{
  "title": {
    "text": "RFC 7726: Clarifying Procedures for Establishing BFD Sessions for MPLS Label Switched Paths (LSPs)",
    "zh-CHS": "RFC 7726"
  },
  "number": 7726,
  "created_at": "2021-11-22 08:58:55.522986+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       V. Govindan\nRequest for Comments: 7726                                  K. Rajaraman\nUpdates: 5884                                              Cisco Systems\nCategory: Standards Track                                      G. Mirsky\nISSN: 2070-1721                                                 Ericsson\n                                                                N. Akiya\n                                                     Big Switch Networks\n                                                               S. Aldrin\n                                                                  Google\n                                                            January 2016",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Clarifying Procedures for Establishing BFD Sessions for MPLS Label Switched Paths (LSPs)",
      "zh-CHS": "澄清为MPLS标签交换路径（LSP）建立BFD会话的程序"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document clarifies the procedures for establishing, maintaining, and removing multiple, concurrent BFD (Bidirectional Forwarding Detection) sessions for a given <MPLS LSP, FEC> as described in RFC 5884.",
      "zh-CHS": "本文件阐明了为给定<MPLS LSP，FEC>建立、维护和删除多个并发BFD（双向转发检测）会话的程序，如RFC 5884所述。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7726.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7726."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Background  . . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n2.  Theory of Operation . . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  Procedures for Establishment of Multiple BFD Sessions . .   3\n  2.2.  Procedures for Maintenance of Multiple BFD Sessions . . .   4\n  2.3.  Procedures for Removing BFD Sessions at the Egress LSR  .   4\n  2.4.  Changing Discriminators for a BFD Session . . . . . . . .   5\n3.  Backwards Compatibility . . . . . . . . . . . . . . . . . . .   5\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   5\n5.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  5.1.  Normative References  . . . . . . . . . . . . . . . . . .   6\n  5.2.  Informative References  . . . . . . . . . . . . . . . . .   6\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   6\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Background",
      "section_title": true,
      "zh-CHS": "1. 出身背景"
    },
    {
      "indent": 3,
      "text": "[RFC5884] defines the procedures to bootstrap and maintain BFD sessions for an <MPLS LSP, FEC> using a Label Switched Path (LSP) ping. While Section 4 of [RFC5884] specifies that multiple BFD sessions can be established for an <MPLS LSP, FEC> tuple, the procedures to bootstrap and maintain multiple BFD sessions concurrently over an <MPLS LSP, FEC> are not clearly specified. Additionally, the procedures of removing BFD sessions bootstrapped on the egress Label Switching Router (LSR) are unclear. This document provides those clarifications without deviating from the principles outlined in [RFC5884].",
      "zh-CHS": "[RFC5884]定义了使用标签交换路径（LSP）ping为<MPLS LSP，FEC>引导和维护BFD会话的过程。虽然[RFC5884]的第4节规定可以为<MPLS LSP，FEC>元组建立多个BFD会话，但没有明确规定在<MPLS LSP，FEC>上同时引导和维护多个BFD会话的过程。此外，删除出口标签交换路由器（LSR）上引导的BFD会话的过程尚不清楚。本文件在不偏离[RFC5884]中概述的原则的情况下提供了这些澄清。"
    },
    {
      "indent": 3,
      "text": "The ability for an ingress LSR to establish multiple BFD sessions for an <MPLS LSP, FEC> tuple is useful in scenarios such as LSPs based on Segment Routing [SEG-ROUTING] or LSPs having Equal-Cost Multipath (ECMP). The process used by the ingress LSR to determine the number of BFD session(s) to be bootstrapped for an <MPLS LSP, FEC> tuple and the mechanism used to construct those session(s) are outside the scope of this document.",
      "zh-CHS": "入口LSR为<MPLS LSP，FEC>元组建立多个BFD会话的能力在诸如基于段路由[SEG-Routing]的LSP或具有等成本多路径（ECMP）的LSP的场景中非常有用。ingress LSR用于确定<MPLS LSP，FEC>元组要引导的BFD会话数的过程以及用于构造这些会话的机制不在本文档的范围内。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "1.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”应按照[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Theory of Operation",
      "section_title": true,
      "zh-CHS": "2. 操作理论"
    },
    {
      "indent": 0,
      "text": "2.1. Procedures for Establishment of Multiple BFD Sessions",
      "section_title": true,
      "zh-CHS": "2.1. 建立多个BFD会议的程序"
    },
    {
      "indent": 3,
      "text": "Section 4 of [RFC5884] specifies the procedure for bootstrapping BFD sessions using LSP ping. It further states that \"a BFD session SHOULD be established for each alternate path that is discovered.\" This requirement has been the source of some ambiguity as the procedures of establishing concurrent, multiple sessions have not been explicitly specified. This ambiguity can also be attributed in part to the text in Section 7 of [RFC5884] forbidding either end to change local discriminator values in BFD control packets after the session reaches the UP state. The following procedures are described to clarify the ambiguity based on the interpretation of the authors' reading of the referenced sections:",
      "zh-CHS": "[RFC5884]的第4节规定了使用LSP ping引导BFD会话的过程。它进一步指出，“应为发现的每个备用路径建立BFD会话”。由于没有明确规定建立并发多个会话的程序，这一要求一直是一些歧义的根源。这种歧义也可以部分归因于[RFC5884]第7节中的文本，其中禁止任何一方在会话达到UP状态后更改BFD控制数据包中的本地鉴别器值。根据作者对参考章节的解读，描述以下程序以澄清歧义："
    },
    {
      "indent": 3,
      "text": "At the ingress LSR:",
      "zh-CHS": "在入口LSR处："
    },
    {
      "indent": 6,
      "text": "MPLS LSP ping can be used to bootstrap multiple BFD sessions for a given <MPLS LSP, FEC>. Each LSP ping MUST carry a different discriminator value in the BFD discriminator TLV [RFC5884].",
      "zh-CHS": "MPLS LSP ping可用于为给定的<MPLS LSP，FEC>引导多个BFD会话。每个LSP ping必须在BFD鉴别器TLV[RFC5884]中携带不同的鉴别器值。"
    },
    {
      "indent": 3,
      "text": "The egress LSR needs to perform the following:",
      "zh-CHS": "出口LSR需要执行以下操作："
    },
    {
      "indent": 6,
      "text": "If the validation of the Forwarding Equivalence Class (FEC) in the MPLS Echo request message succeeds, check the discriminator specified in the BFD discriminator TLV of the MPLS Echo request. If there is no local session that corresponds to the (remote) discriminator received in the MPLS Echo request, a new session is bootstrapped and a local discriminator is allocated. The validation of a FEC is a necessary condition to be satisfied to create a new BFD session at the egress LSR. However, the policy or procedure, if any, to be applied by the egress LSR before",
      "zh-CHS": "如果验证MPLS回显请求消息中的转发等价类（FEC）成功，请检查MPLS回显请求的BFD鉴别器TLV中指定的鉴别器。如果没有与MPLS回送请求中接收到的（远程）鉴别器相对应的本地会话，则将引导新会话并分配本地鉴别器。FEC的验证是在出口LSR处创建新BFD会话所需满足的必要条件。但是，出口LSR将在"
    },
    {
      "indent": 6,
      "text": "allowing a new BFD session to be created is outside the scope of this document. Such policies or procedures could consider availability of system resources before allowing a session to be created. When the egress LSR disallows the creation of a BFD session due to policy, it MUST drop the MPLS Echo request message.",
      "zh-CHS": "允许创建新的BFD会话超出了本文档的范围。这样的策略或过程可以考虑系统资源的可用性，然后才允许创建会话。当出口LSR由于策略而不允许创建BFD会话时，它必须丢弃MPLS回显请求消息。"
    },
    {
      "indent": 6,
      "text": "Ensure the uniqueness of the <MPLS LSP, FEC, Remote Discriminator> tuple.",
      "zh-CHS": "确保<MPLS LSP，FEC，Remote Discriminator>元组的唯一性。"
    },
    {
      "indent": 6,
      "text": "Except for the clarification mentioned above, the remaining procedures of BFD session establishment are as specified in Sections 4-6 of [RFC5884].",
      "zh-CHS": "除上述澄清外，BFD会话建立的其余程序如[RFC5884]第4-6节所述。"
    },
    {
      "indent": 0,
      "text": "2.2. Procedures for Maintenance of Multiple BFD Sessions",
      "section_title": true,
      "zh-CHS": "2.2. 多个BFD会话的维护程序"
    },
    {
      "indent": 3,
      "text": "Both the ingress LSR and egress LSR use the Your Discriminator of the received BFD packet to demultiplex BFD sessions.",
      "zh-CHS": "入口LSR和出口LSR都使用接收到的BFD数据包的Your鉴别器来解复用BFD会话。"
    },
    {
      "indent": 0,
      "text": "2.3. Procedures for Removing BFD Sessions at the Egress LSR",
      "section_title": true,
      "zh-CHS": "2.3. 在出口LSR处移除BFD会话的程序"
    },
    {
      "indent": 3,
      "text": "[RFC5884] does not specify an explicit procedure for deleting BFD sessions. The procedure for removing a BFD session established by an out-of-band discriminator exchange using the MPLS LSP ping can improve resource management (e.g., memory), especially in scenarios involving thousands or more of such sessions. A few observations are made here:",
      "zh-CHS": "[RFC5884]未指定删除BFD会话的明确过程。用于移除由使用MPLS LSP ping的带外鉴别器交换建立的BFD会话的过程可以改进资源管理（例如，存储器），特别是在涉及数千个或更多这样的会话的场景中。以下是一些观察结果："
    },
    {
      "indent": 6,
      "text": "The BFD session MAY be removed in the egress LSR if the BFD session transitions from UP to DOWN. This can either be done immediately after the BFD session transitions from UP to DOWN or after the expiry of a configurable timer started after the BFD session state transitions from UP to DOWN at the egress LSR to reduce flapping by adding hysteresis.",
      "zh-CHS": "如果BFD会话从上到下转换，则可以在出口LSR中移除BFD会话。这可以在BFD会话从上到下转换后立即完成，或者在出口LSR处BFD会话状态从上到下转换后启动的可配置计时器到期后完成，以通过添加滞后来减少拍打。"
    },
    {
      "indent": 6,
      "text": "The BFD session on the egress LSR MAY be removed by the ingress LSR by using the BFD diagnostic code AdminDown(7) as specified in [RFC5880]. When the ingress LSR wants to remove a session without triggering any state change at the egress, it MAY transmit BFD packets indicating the State as Down(1), diagnostic code AdminDown(7) detectMultiplier number of times. Upon receiving such a packet, the egress LSR MAY remove the BFD session, without triggering a change of state.",
      "zh-CHS": "可使用[RFC5880]中规定的BFD诊断代码AdminDown（7），通过入口LSR删除出口LSR上的BFD会话。当入口LSR想要在不触发出口处的任何状态改变的情况下移除会话时，它可以发送BFD分组，指示状态为Down（1），诊断代码AdminDown（7）DETECTMPLIER次数。在接收到这样的分组时，出口LSR可以移除BFD会话，而不触发状态改变。"
    },
    {
      "indent": 6,
      "text": "The procedures to be followed at the egress LSR when BFD session(s) remain in the DOWN state for a significant amount of time is a local matter. Such procedures are outside the scope of this document.",
      "zh-CHS": "当BFD会话在相当长的时间内保持关闭状态时，出口LSR应遵循的程序是一个局部问题。此类程序不在本文件范围内。"
    },
    {
      "indent": 6,
      "text": "All BFD sessions established with the FEC MUST be removed automatically if the FEC is removed.",
      "zh-CHS": "如果删除FEC，则必须自动删除与FEC建立的所有BFD会话。"
    },
    {
      "indent": 6,
      "text": "The egress MUST use the discriminators exchanged when the session was brought UP to indicate any session state change to the ingress. The egress SHOULD reset this to zero after transmitting bfd.detectMult number of packets if the BFD session transitions to DOWN state.",
      "zh-CHS": "出口必须使用会话启动时交换的鉴别器来指示入口的任何会话状态更改。出口应在传输bfd后将其重置为零。如果bfd会话转换为关闭状态，则检测结果数据包数。"
    },
    {
      "indent": 0,
      "text": "2.4. Changing Discriminators for a BFD Session",
      "section_title": true,
      "zh-CHS": "2.4. 更改BFD会话的鉴别器"
    },
    {
      "indent": 3,
      "text": "The discriminators of a BFD session established over an MPLS LSP cannot be changed when it is in UP state. The BFD session could be removed after a graceful transition to AdminDown state using the BFD diagnostic code AdminDown. A new session could be established with a different discriminator. The initiation of the transition from the UP to DOWN state can be done by either the ingress LSR or the egress LSR.",
      "zh-CHS": "在MPLS LSP上建立的BFD会话的鉴别器在处于启动状态时不能更改。在使用BFD诊断代码AdminDown顺利过渡到AdminDown状态后，可以删除BFD会话。可以使用不同的鉴别器建立新的会话。可以通过入口LSR或出口LSR来启动从上到下状态的转换。"
    },
    {
      "indent": 0,
      "text": "3. Backwards Compatibility",
      "section_title": true,
      "zh-CHS": "3. 向后兼容性"
    },
    {
      "indent": 3,
      "text": "The procedures clarified by this document are fully backward compatible with an existing implementation of [RFC5884]. While the capability to bootstrap and maintain multiple BFD sessions may not be present in current implementations, the procedures outlined by this document can be implemented as a software upgrade without affecting existing sessions. In particular, the egress LSR needs to support multiple BFD sessions per <MPLS LSP, FEC> before the ingress LSR is upgraded.",
      "zh-CHS": "本文件阐明的程序与[RFC5884]的现有实现完全向后兼容。虽然目前的实施中可能不具备引导和维护多个BFD会话的能力，但本文档概述的过程可以作为软件升级来实施，而不会影响现有会话。特别地，在升级入口LSR之前，出口LSR需要支持每个<MPLS LSP，FEC>的多个BFD会话。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document clarifies the mechanism to bootstrap multiple BFD sessions per <MPLS LSP, FEC>. BFD sessions, naturally, use system and network resources. More BFD sessions means more resources will be used. It is highly important to ensure that only a minimum number of BFD sessions are provisioned per FEC and that bootstrapped BFD sessions are properly deleted when they are no longer required. Additionally, security measures described in [RFC4379] and [RFC5884] are to be followed.",
      "zh-CHS": "本文档阐明了每个<MPLS LSP，FEC>引导多个BFD会话的机制。BFD会话自然使用系统和网络资源。更多的BFD会话意味着将使用更多的资源。确保每个FEC只提供最少数量的BFD会话，并且在不再需要时正确删除引导BFD会话，这一点非常重要。此外，应遵守[RFC4379]和[RFC5884]中所述的安全措施。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "zh-CHS": "5.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC4379] Kompella, K. and G. Swallow, \"Detecting Multi-Protocol Label Switched (MPLS) Data Plane Failures\", RFC 4379, DOI 10.17487/RFC4379, February 2006, <http://www.rfc-editor.org/info/rfc4379>.",
      "zh-CHS": "[RFC4379]Kompella，K.和G.Swallow，“检测多协议标签交换（MPLS）数据平面故障”，RFC 4379，DOI 10.17487/RFC4379，2006年2月<http://www.rfc-editor.org/info/rfc4379>."
    },
    {
      "indent": 3,
      "text": "[RFC5880] Katz, D. and D. Ward, \"Bidirectional Forwarding Detection (BFD)\", RFC 5880, DOI 10.17487/RFC5880, June 2010, <http://www.rfc-editor.org/info/rfc5880>.",
      "zh-CHS": "[RFC5880]Katz，D.和D.Ward，“双向转发检测（BFD）”，RFC 5880，DOI 10.17487/RFC5880，2010年6月<http://www.rfc-editor.org/info/rfc5880>."
    },
    {
      "indent": 3,
      "text": "[RFC5884] Aggarwal, R., Kompella, K., Nadeau, T., and G. Swallow, \"Bidirectional Forwarding Detection (BFD) for MPLS Label Switched Paths (LSPs)\", RFC 5884, DOI 10.17487/RFC5884, June 2010, <http://www.rfc-editor.org/info/rfc5884>.",
      "zh-CHS": "[RFC5884]Aggarwal，R.，Kompella，K.，Nadeau，T.，和G.Swallow，“MPLS标签交换路径（LSP）的双向转发检测（BFD）”，RFC 5884，DOI 10.17487/RFC5884，2010年6月<http://www.rfc-editor.org/info/rfc5884>."
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "zh-CHS": "5.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[SEG-ROUTING] Filsfils, C., Ed., Previdi, S., Ed., Decraene, B., Litkowski, S., and R. Shakir, \"Segment Routing Architecture\", Work in Progress, draft-ietf-spring-segment-routing-07, December 2015.",
      "zh-CHS": "[SEG-ROUTING]Filsfils，C.，Ed.，Previdi，S.，Ed.，Decarene，B.，Litkowski，S.，和R.Shakir，“分段布线架构”，正在进行的工作，草案-ietf-spring-Segment-ROUTING-072015年12月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Marc Binderberger for performing thorough reviews and providing valuable suggestions.",
      "zh-CHS": "作者要感谢Marc Binderberger进行了全面的审查并提供了宝贵的建议。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Mudigonda Mallik, Rajaguru Veluchamy, and Carlos Pignataro of Cisco Systems for their review comments.",
      "zh-CHS": "作者感谢思科系统公司的Mudigonda Mallik、Rajaguru Veluchamy和Carlos Pignataro的评论意见。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Alvaro Retana and Scott Bradner for their review comments.",
      "zh-CHS": "作者要感谢Alvaro Retana和Scott Bradner的评论意见。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Vengada Prasad Govindan Cisco Systems",
      "zh-CHS": "Vengada Prasad Govindan思科系统公司"
    },
    {
      "indent": 3,
      "text": "Email: venggovi@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Kalyani Rajaraman Cisco Systems",
      "zh-CHS": "Kalyani Rajaraman思科系统公司"
    },
    {
      "indent": 3,
      "text": "Email: kalyanir@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Gregory Mirsky Ericsson",
      "zh-CHS": "格雷戈里·米尔斯基·爱立信"
    },
    {
      "indent": 3,
      "text": "Email: gregory.mirsky@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Nobo Akiya Big Switch Networks",
      "zh-CHS": "Nobo Akiya大交换网络"
    },
    {
      "indent": 3,
      "text": "Email: nobo.akiya.dev@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Sam Aldrin Google",
      "zh-CHS": "山姆·奥尔德林谷歌"
    },
    {
      "indent": 3,
      "text": "Email: aldrin.ietf@gmail.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}