{
  "title": {
    "text": "RFC 7449: Path Computation Element Communication Protocol (PCEP) Requirements for Wavelength Switched Optical Network (WSON) Routing and Wavelength Assignment",
    "zh-CHS": "RFC 7449"
  },
  "number": 7449,
  "created_at": "2021-11-03 00:38:34.007967+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       Y. Lee, Ed.\nRequest for Comments: 7449                                        Huawei\nCategory: Informational                                G. Bernstein, Ed.\nISSN: 2070-1721                                        Grotto Networking\n                                                           J. Martensson\n                                                                   Acreo\n                                                               T. Takeda\n                                                                     NTT\n                                                            T. Tsuritani\n                                                                    KDDI\n                                                     O. Gonzalez de Dios\n                                                              Telefonica\n                                                           February 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Path Computation Element Communication Protocol (PCEP) Requirements for Wavelength Switched Optical Network (WSON) Routing and Wavelength Assignment",
      "zh-CHS": "波长交换光网络（WSON）路由和波长分配的路径计算元件通信协议（PCEP）要求"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo provides application-specific requirements for the Path Computation Element Communication Protocol (PCEP) for the support of Wavelength Switched Optical Networks (WSONs). Lightpath provisioning in WSONs requires a Routing and Wavelength Assignment (RWA) process. From a path computation perspective, wavelength assignment is the process of determining which wavelength can be used on each hop of a path and forms an additional routing constraint to optical light path computation. Requirements for PCEP extensions in support of optical impairments will be addressed in a separate document.",
      "zh-CHS": "本备忘录提供了支持波长交换光网络（WSON）的路径计算元件通信协议（PCEP）的特定应用要求。无线传感器网络中的光路供应需要路由和波长分配（RWA）过程。从路径计算的角度来看，波长分配是确定在路径的每个跃点上可以使用哪个波长的过程，并形成光路径计算的附加路由约束。支持光学损伤的PCEP扩展要求将在单独的文件中说明。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7449.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7449."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. WSON RWA Processes and Architecture .............................4\n3. Requirements ....................................................5\n   3.1. Path Computation Type Option ...............................5\n   3.2. RWA Processing .............................................6\n   3.3. Bulk RWA Path Request/Reply ................................6\n   3.4. RWA Path Reoptimization Request/Reply ......................7\n   3.5. Wavelength Range Constraint ................................7\n   3.6. Wavelength Assignment Preference ...........................7\n   3.7. Signal-Processing Capability Restriction ...................8\n4. Manageability Considerations ....................................8\n   4.1. Control of Function and Policy .............................8\n   4.2. Information and Data Models (e.g., MIB Module) .............9\n   4.3. Liveness Detection and Monitoring ..........................9\n   4.4. Verifying Correct Operation ................................9\n   4.5. Requirements on Other Protocols and Functional Components ..9\n   4.6. Impact on Network Operation ................................9\n5. Security Considerations .........................................9\n6. References .....................................................10\n   6.1. Normative References ......................................10\n   6.2. Informative References ....................................10\nAcknowledgments....................................................11\nAuthors' Addresses.................................................11",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "[RFC4655] defines the PCE-based architecture and explains how a Path Computation Element (PCE) may compute Label Switched Paths (LSPs) in networks controlled by Multiprotocol Label Switching Traffic Engineering (MPLS-TE) and Generalized MPLS (GMPLS) at the request of Path Computation Clients (PCCs). A PCC is shown to be any network component that makes such a request and may be, for instance, an optical switching element within a Wavelength Division Multiplexing (WDM) network. The PCE itself can be located anywhere within the network; it may be within an optical switching element, a Network Management System (NMS), or an Operational Support System (OSS), or it may be an independent network server.",
      "zh-CHS": "[RFC4655]定义了基于PCE的体系结构，并解释了路径计算元素（PCE）如何在由多协议标签交换流量工程（MPLS-TE）和通用MPLS（GMPLS）控制的网络中应路径计算客户端（PCC）的请求计算标签交换路径（LSP）。PCC被示出为发出这种请求的任何网络组件，并且可以是例如波分复用（WDM）网络内的光交换元件。PCE本身可以位于网络内的任何位置；它可以位于光交换元件、网络管理系统（NMS）或操作支持系统（OSS）内，也可以是独立的网络服务器。"
    },
    {
      "indent": 3,
      "text": "The Path Computation Element Communication Protocol (PCEP) is the communication protocol used between a PCC and PCE; it may also be used between cooperating PCEs. [RFC4657] sets out the common protocol requirements for PCEP. Additional application-specific requirements for PCEP are deferred to separate documents.",
      "zh-CHS": "路径计算元件通信协议（PCEP）是PCC和PCE之间使用的通信协议；也可在合作的PCE之间使用。[RFC4657]规定了PCEP的通用协议要求。PCEP的其他特定应用要求将推迟到单独的文件中。"
    },
    {
      "indent": 3,
      "text": "This document provides a set of application-specific PCEP requirements for support of path computation in Wavelength Switched Optical Networks (WSONs). WSON refers to WDM-based optical networks in which switching is performed selectively based on the wavelength of an optical signal.",
      "zh-CHS": "本文档提供了一组特定于应用的PCEP要求，以支持波长交换光网络（WSON）中的路径计算。WSON是指基于WDM的光网络，其中根据光信号的波长选择性地执行切换。"
    },
    {
      "indent": 3,
      "text": "The path in WSON is referred to as a lightpath. A lightpath may span multiple fiber links, and the path should be assigned a wavelength for each link.",
      "zh-CHS": "WSON中的路径称为光路径。一条光路可以跨越多个光纤链路，并且应该为每个链路分配一个波长。"
    },
    {
      "indent": 3,
      "text": "A transparent optical network is made up of optical devices that can switch but not convert from one wavelength to another. In a transparent optical network, a lightpath operates on the same wavelength across all fiber links that it traverses. In such cases, the lightpath is said to satisfy the wavelength-continuity constraint. Two lightpaths that share a common fiber link cannot be assigned the same wavelength. To do otherwise would result in both signals interfering with each other. Note that advanced additional multiplexing techniques such as polarization-based multiplexing are not addressed in this document since the physical-layer aspects are not currently standardized. Therefore, assigning the proper wavelength on a lightpath is an essential requirement in the optical path computation process.",
      "zh-CHS": "透明光网络是由能够从一个波长切换到另一个波长但不能转换的光学设备组成的。在透明光网络中，光路在其穿过的所有光纤链路上以相同的波长运行。在这种情况下，光路被称为满足波长连续性约束。共享同一光纤链路的两条光路不能指定相同的波长。否则将导致两个信号相互干扰。注意，由于物理层方面目前尚未标准化，因此本文档中未讨论诸如基于偏振的复用之类的高级附加复用技术。因此，在光路计算过程中，在光路上指定合适的波长是一项基本要求。"
    },
    {
      "indent": 3,
      "text": "When a switching node has the ability to perform wavelength conversion, the wavelength-continuity constraint can be relaxed, and a lightpath may use different wavelengths on different links along its path from origin to destination. It is, however, to be noted",
      "zh-CHS": "当交换节点具有执行波长转换的能力时，可以放松波长连续性约束，并且光路径可以在沿着其从原点到目的地的路径的不同链路上使用不同的波长。然而，值得注意的是"
    },
    {
      "indent": 3,
      "text": "that wavelength converters may be limited for cost reasons, while the number of WDM channels that can be supported in a fiber is also limited. As a WSON can be composed of network nodes that cannot perform wavelength conversion, nodes with limited wavelength conversion, and nodes with full wavelength conversion abilities, wavelength assignment is an additional routing constraint to be considered in all lightpath computations.",
      "zh-CHS": "由于成本原因，波长转换器可能受到限制，而光纤中可支持的WDM信道数量也受到限制。由于WSON可以由不能执行波长转换的网络节点、波长转换有限的节点和具有完全波长转换能力的节点组成，因此波长分配是所有光路计算中需要考虑的额外路由约束。"
    },
    {
      "indent": 3,
      "text": "In this document, we first review the processes for Routing and Wavelength Assignment (RWA) used when wavelength continuity constraints are present and then specify requirements for PCEP to support RWA. Requirements for optical impairments will be addressed in a separate document.",
      "zh-CHS": "在本文档中，我们首先回顾当存在波长连续性约束时使用的路由和波长分配（RWA）过程，然后指定PCEP支持RWA的要求。光学损伤的要求将在单独的文件中说明。"
    },
    {
      "indent": 3,
      "text": "The remainder of this document uses terminology from [RFC4655].",
      "zh-CHS": "本文件其余部分使用[RFC4655]中的术语。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. WSON RWA Processes and Architecture",
      "section_title": true,
      "zh-CHS": "2. WSON RWA流程和架构"
    },
    {
      "indent": 3,
      "text": "In [RFC6163], three alternative process architectures were given for performing routing and wavelength assignment. These are shown schematically in Figure 1, where R stands for Routing, WA for Wavelength Assignment, and DWA for Distributed Wavelength Assignment.",
      "zh-CHS": "在[RFC6163]中，给出了用于执行路由和波长分配的三种可选工艺体系结构。这些在图1中示意性地显示，其中R代表路由，WA代表波长分配，DWA代表分布式波长分配。"
    },
    {
      "indent": 5,
      "text": "+-------------------+\n|  +-------+  +--+  |    +-------+    +--+     +-------+    +---+\n|  |   R   |  |WA|  |    |   R   |--->|WA|     |   R   |--->|DWA|\n|  +-------+  +--+  |    +-------+    +--+     +-------+    +---+\n|   Combined        |     Separate Processes   Separate Processes\n|   Process         |                          WA performed in a\n+-------------------+                          distributed manner\n      (a)                       (b)                    (b')",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 1: RWA Process Alternatives",
      "zh-CHS": "图1：RWA流程备选方案"
    },
    {
      "indent": 3,
      "text": "These alternatives have the following properties and impact on PCEP requirements in this document.",
      "zh-CHS": "这些备选方案具有以下特性，并对本文件中的PCEP要求产生影响。"
    },
    {
      "indent": 3,
      "text": "(a) Combined Process (R&WA)",
      "zh-CHS": "(a) 联合工艺（R&WA）"
    },
    {
      "indent": 8,
      "text": "Path selection and wavelength assignment are performed as a single process. The requirements for PCC-PCE interaction with a PCE implementing such a combined RWA process are addressed in this document.",
      "zh-CHS": "路径选择和波长分配作为单个过程执行。本文件阐述了PCC-PCE与实施此类组合RWA流程的PCE的互动要求。"
    },
    {
      "indent": 3,
      "text": "(b) Routing Separate from Wavelength Assignment (R+WA)",
      "zh-CHS": "(b) 独立于波长分配的路由（R+WA）"
    },
    {
      "indent": 8,
      "text": "The routing process furnishes one or more potential paths to the wavelength assignment process that then performs final path selection and wavelength assignment. The requirements for PCE-PCE interaction with one PCE implementing the routing process and another implementing the wavelength assignment process are not addressed in this document.",
      "zh-CHS": "路由过程向波长分配过程提供一个或多个潜在路径，然后波长分配过程执行最终路径选择和波长分配。本文件未说明PCE-PCE与一个PCE（实施路由过程）和另一个PCE（实施波长分配过程）交互的要求。"
    },
    {
      "indent": 3,
      "text": "(b') Routing and Distributed Wavelength Assignment (R+DWA)",
      "zh-CHS": "（b’）路由和分布式波长分配（R+DWA）"
    },
    {
      "indent": 8,
      "text": "A standard path computation (unaware of detailed wavelength availability) takes place, and then wavelength assignment is performed along this path in a distributed manner via signaling (RSVP-TE). This alternative is a particular case of R+WA and should be covered by GMPLS PCEP extensions; it does not present new WSON-specific requirements.",
      "zh-CHS": "进行标准路径计算（不知道详细的波长可用性），然后通过信令（RSVP-TE）沿该路径以分布式方式执行波长分配。该替代方案是R+WA的特殊情况，应包含在GMPLS PCEP扩展中；它没有提出新的WSON特定要求。"
    },
    {
      "indent": 3,
      "text": "The various process architectures for implementing RWA have been reviewed above. Figure 2 shows one typical PCE-based implementation, which is referred to as the Combined Process (R&WA). With this architecture, the two processes of routing and wavelength assignment are accessed via a single PCE. This architecture is the base architecture from which the requirements are specified in this document.",
      "zh-CHS": "上文已对实施RWA的各种流程架构进行了审查。图2显示了一个典型的基于PCE的实现，称为组合过程（R&WA）。在这种架构下，路由和波长分配这两个过程通过单个PCE访问。该体系结构是本文件中规定需求的基础体系结构。"
    },
    {
      "indent": 12,
      "text": "              +----------------------------+\n+-----+       |     +-------+     +--+     |\n|     |       |     |Routing|     |WA|     |\n| PCC |<----->|     +-------+     +--+     |\n|     |       |                            |\n+-----+       |             PCE            |\n              +----------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Figure 2: Combined Process (R&WA) Architecture",
      "zh-CHS": "图2：组合流程（R&WA）架构"
    },
    {
      "indent": 0,
      "text": "3. Requirements",
      "section_title": true,
      "zh-CHS": "3. 要求"
    },
    {
      "indent": 3,
      "text": "The requirements for the PCC-to-PCE interface of Figure 2 are specified in this section.",
      "zh-CHS": "本节规定了图2中PCC至PCE接口的要求。"
    },
    {
      "indent": 0,
      "text": "3.1. Path Computation Type Option",
      "section_title": true,
      "zh-CHS": "3.1. 路径计算类型选项"
    },
    {
      "indent": 3,
      "text": "A PCEP request MAY include the path computation type. This can be:",
      "zh-CHS": "PCEP请求可以包括路径计算类型。这可以是："
    },
    {
      "indent": 3,
      "text": "(a) Both RWA, or",
      "zh-CHS": "(a) 均为RWA，或"
    },
    {
      "indent": 3,
      "text": "(b) Routing only.",
      "zh-CHS": "(b) 仅限路由。"
    },
    {
      "indent": 3,
      "text": "This requirement is needed to differentiate between the currently supported routing with distributed wavelength assignment option and combined RWA. For the distributed wavelength assignment option, wavelength assignment will be performed at each node of the route.",
      "zh-CHS": "需要此要求来区分当前支持的具有分布式波长分配选项的路由和组合RWA。对于分布式波长分配选项，将在路由的每个节点上执行波长分配。"
    },
    {
      "indent": 0,
      "text": "3.2. RWA Processing",
      "section_title": true,
      "zh-CHS": "3.2. RWA处理"
    },
    {
      "indent": 3,
      "text": "As discussed in Section 2, various RWA processing options should be supported in a PCEP request/reply.",
      "zh-CHS": "如第2节所述，PCEP请求/回复中应支持各种RWA处理选项。"
    },
    {
      "indent": 3,
      "text": "(a) When the request is an RWA path computation type, the request MUST further include the wavelength assignment options. At minimum, the following options should be supported:",
      "zh-CHS": "(a) 当请求是RWA路径计算类型时，请求必须进一步包括波长分配选项。至少应支持以下选项："
    },
    {
      "indent": 8,
      "text": "(i) Explicit Label Control (ELC) [RFC3473]",
      "zh-CHS": "(i) 显式标签控制（ELC）[RFC3473]"
    },
    {
      "indent": 8,
      "text": "(ii) A set of recommended labels for each hop. The PCC can select the label based on local policy.",
      "zh-CHS": "（ii）为每个跃点提供一套推荐标签。PCC可以根据本地策略选择标签。"
    },
    {
      "indent": 8,
      "text": "Note that option (ii) may also be used in R+WA or R+DWA.",
      "zh-CHS": "注意，选项（ii）也可用于R+WA或R+DWA。"
    },
    {
      "indent": 3,
      "text": "(b) In case of an RWA computation type, the response MUST include the wavelength(s) assigned to the path and an indication of which label assignment option has been applied (ELC or label set).",
      "zh-CHS": "(b) 在RWA计算类型的情况下，响应必须包括分配给路径的波长和已应用标签分配选项的指示（ELC或标签集）。"
    },
    {
      "indent": 3,
      "text": "(c) In the case where a valid path is not found, the response MUST include why the path is not found (e.g., network disconnected, wavelength not found, both, etc.). Note that 'wavelength not found' may include several sub-cases such as wavelength continuity not met, unsupported FEC/Modulation type, etc.",
      "zh-CHS": "(c) 在未找到有效路径的情况下，响应必须包括未找到路径的原因（例如，网络断开连接、波长未找到、两者均未找到等）。请注意，“未找到波长”可能包括若干子情况，如未满足波长连续性、不支持的FEC/调制类型等。"
    },
    {
      "indent": 0,
      "text": "3.3. Bulk RWA Path Request/Reply",
      "section_title": true,
      "zh-CHS": "3.3. 批量RWA路径请求/回复"
    },
    {
      "indent": 3,
      "text": "Sending simultaneous path requests for \"routing only\" computation is supported by the PCEP specification [RFC5440]. To remain consistent, the following requirements are added.",
      "zh-CHS": "PCEP规范[RFC5440]支持为“仅路由”计算同时发送路径请求。为了保持一致，添加了以下要求。"
    },
    {
      "indent": 3,
      "text": "(a) A PCEP request MUST be able to specify an option for bulk RWA path requests. A bulk path request provides an ability to request a number of simultaneous RWA path requests.",
      "zh-CHS": "(a) PCEP请求必须能够为批量RWA路径请求指定选项。批量路径请求提供了同时请求多个RWA路径请求的能力。"
    },
    {
      "indent": 3,
      "text": "(b) The PCEP response MUST include the path and the assigned wavelength for each RWA path request specified in the original bulk request.",
      "zh-CHS": "(b) PCEP响应必须包括原始批量请求中指定的每个RWA路径请求的路径和指定波长。"
    },
    {
      "indent": 0,
      "text": "3.4. RWA Path Reoptimization Request/Reply",
      "section_title": true,
      "zh-CHS": "3.4. RWA路径重新优化请求/回复"
    },
    {
      "indent": 3,
      "text": "This section provides a number of requirements concerning RWA path reoptimization processing in PCEP.",
      "zh-CHS": "本节提供了有关PCEP中RWA路径再优化处理的若干要求。"
    },
    {
      "indent": 3,
      "text": "(a) For a reoptimization request, the request MUST provide both the path and current wavelength to be reoptimized and MAY include the following options:",
      "zh-CHS": "(a) 对于重新优化请求，请求必须提供要重新优化的路径和当前波长，并且可能包括以下选项："
    },
    {
      "indent": 7,
      "text": "(i) Reoptimize the path keeping the same wavelength(s)",
      "zh-CHS": "(i) 重新优化保持相同波长的路径"
    },
    {
      "indent": 7,
      "text": "(ii) Reoptimize wavelength(s) keeping the same path",
      "zh-CHS": "（ii）保持相同路径，重新优化波长"
    },
    {
      "indent": 7,
      "text": "(iii) Reoptimize allowing both the wavelength and the path to change",
      "zh-CHS": "（iii）重新优化，允许波长和路径发生变化"
    },
    {
      "indent": 3,
      "text": "(b) The corresponding response to the reoptimized request MUST provide the reoptimized path and wavelengths even when the request asked for the path or the wavelength to remain unchanged.",
      "zh-CHS": "(b) 即使请求要求路径或波长保持不变，对重新优化请求的相应响应也必须提供重新优化的路径和波长。"
    },
    {
      "indent": 3,
      "text": "(c) In the case that the new path is not found, the response MUST include why the path is not found (e.g., network disconnected, wavelength not found, both, etc.). Note that 'wavelength not found' may include several sub-cases such as wavelength continuity not met, unsupported FEC/Modulation type, etc.",
      "zh-CHS": "(c) 在未找到新路径的情况下，响应必须包括未找到路径的原因（例如，网络断开连接、波长未找到、两者均未找到等）。请注意，“未找到波长”可能包括若干子情况，如未满足波长连续性、不支持的FEC/调制类型等。"
    },
    {
      "indent": 0,
      "text": "3.5. Wavelength Range Constraint",
      "section_title": true,
      "zh-CHS": "3.5. 波长范围限制"
    },
    {
      "indent": 3,
      "text": "For any RWA computation type request, the requester (PCC) MUST be allowed to specify a restriction on the wavelengths to be used. The requester MAY use this option to restrict the assigned wavelength for explicit labels or label sets. This restriction may, for example, come from the tuning ability of a laser transmitter, any optical element, or a policy-based restriction.",
      "zh-CHS": "对于任何RWA计算类型请求，必须允许请求者（PCC）指定对要使用的波长的限制。请求者可以使用此选项限制显式标签或标签集的指定波长。例如，该限制可能来自激光发射机、任何光学元件的调谐能力或基于策略的限制。"
    },
    {
      "indent": 3,
      "text": "Note that the requester (e.g., PCC) is not required to furnish any range restrictions.",
      "zh-CHS": "请注意，请求者（如PCC）无需提供任何范围限制。"
    },
    {
      "indent": 0,
      "text": "3.6. Wavelength Assignment Preference",
      "section_title": true,
      "zh-CHS": "3.6. 波长分配偏好"
    },
    {
      "indent": 3,
      "text": "In a network with wavelength conversion capabilities (e.g., sparse 3R regenerators), a request SHOULD be able to indicate whether a single, continuous wavelength should be allocated or not. In other words, the requesting PCC SHOULD be able to specify the precedence of wavelength continuity even if wavelength conversion is available.",
      "zh-CHS": "在具有波长转换能力的网络中（例如，稀疏3R再生器），请求应能够指示是否应分配单个连续波长。换句话说，即使波长转换可用，请求PCC也应能够指定波长连续性的优先级。"
    },
    {
      "indent": 3,
      "text": "(a) An RWA computation type request MAY include the requester preference for random assignment, descending order, ascending order, etc. A response SHOULD follow the requester preference unless it conflicts with the operator's policy.",
      "zh-CHS": "(a) RWA计算类型请求可能包括请求者对随机分配、降序、升序等的偏好。响应应遵循请求者偏好，除非它与操作员的策略冲突。"
    },
    {
      "indent": 3,
      "text": "(b) A request for two or more paths MUST allow the requester to include an option constraining the paths to have the same wavelength(s) assigned. This is useful in the case of protection with a single transponder (e.g., 1+1 link disjoint paths).",
      "zh-CHS": "(b) 对两个或多个路径的请求必须允许请求者包括一个选项，该选项限制路径分配相同的波长。这在使用单个转发器进行保护的情况下非常有用（例如，1+1链路不相交路径）。"
    },
    {
      "indent": 0,
      "text": "3.7. Signal-Processing Capability Restriction",
      "section_title": true,
      "zh-CHS": "3.7. 信号处理能力限制"
    },
    {
      "indent": 3,
      "text": "Signal-processing compatibility is an important constraint for optical path computation. The signal type for an end-to-end optical path must match at the source and at the destination.",
      "zh-CHS": "信号处理兼容性是光路计算的一个重要约束。端到端光路的信号类型必须在源位置和目标位置匹配。"
    },
    {
      "indent": 3,
      "text": "The PCC MUST be allowed to specify the signal type at the endpoints (i.e., at the source and at the destination). The following signal-processing capabilities should be supported at a minimum:",
      "zh-CHS": "必须允许PCC在端点（即，在源和目标）指定信号类型。至少应支持以下信号处理能力："
    },
    {
      "indent": 3,
      "text": "o Modulation Type List",
      "zh-CHS": "o 调制类型表"
    },
    {
      "indent": 3,
      "text": "o FEC Type List",
      "zh-CHS": "o FEC类型列表"
    },
    {
      "indent": 3,
      "text": "The PCC MUST also be allowed to state whether transit modification is acceptable for the above signal-processing capabilities.",
      "zh-CHS": "还必须允许PCC说明上述信号处理能力是否可接受公交改造。"
    },
    {
      "indent": 0,
      "text": "4. Manageability Considerations",
      "section_title": true,
      "zh-CHS": "4. 可管理性考虑"
    },
    {
      "indent": 3,
      "text": "Manageability of WSON RWA with PCE must address the following considerations.",
      "zh-CHS": "具有PCE的WSON RWA的可管理性必须考虑以下因素。"
    },
    {
      "indent": 0,
      "text": "4.1. Control of Function and Policy",
      "section_title": true,
      "zh-CHS": "4.1. 职能和政策的控制"
    },
    {
      "indent": 3,
      "text": "In addition to the parameters already listed in Section 8.1 of [RFC5440], a PCEP implementation SHOULD allow configuring the following PCEP session parameters on a PCC:",
      "zh-CHS": "除了[RFC5440]第8.1节中已经列出的参数外，PCEP实现还应允许在PCC上配置以下PCEP会话参数："
    },
    {
      "indent": 3,
      "text": "o The ability to send a WSON RWA request.",
      "zh-CHS": "o 发送WSON RWA请求的能力。"
    },
    {
      "indent": 3,
      "text": "In addition to the parameters already listed in Section 8.1 of [RFC5440], a PCEP implementation SHOULD allow configuring the following PCEP session parameters on a PCE:",
      "zh-CHS": "除了[RFC5440]第8.1节中已经列出的参数外，PCEP实现还应允许在PCE上配置以下PCEP会话参数："
    },
    {
      "indent": 3,
      "text": "o The support for WSON RWA.",
      "zh-CHS": "o 对WSON RWA的支持。"
    },
    {
      "indent": 3,
      "text": "o The maximum number of bulk path requests associated with WSON RWA per request message.",
      "zh-CHS": "o 每个请求消息与WSON RWA关联的最大批量路径请求数。"
    },
    {
      "indent": 3,
      "text": "These parameters may be configured as default parameters for any PCEP session the PCEP speaker participates in, or may apply to a specific session with a given PCEP peer or a specific group of sessions with a specific group of PCEP peers.",
      "zh-CHS": "这些参数可配置为PCEP演讲者参与的任何PCEP会话的默认参数，或可应用于与给定PCEP对等方的特定会话或与特定PCEP对等方组的特定会话组。"
    },
    {
      "indent": 0,
      "text": "4.2. Information and Data Models",
      "section_title": true,
      "zh-CHS": "4.2. 信息和数据模型"
    },
    {
      "indent": 3,
      "text": "As this document only concerns the requirements to support WSON RWA, no additional MIB module is defined in this document. However, the corresponding solution document will list the information that should be added to the PCE MIB module defined in [RFC7420].",
      "zh-CHS": "由于本文件仅涉及支持WSON RWA的要求，因此本文件中未定义其他MIB模块。但是，相应的解决方案文档将列出应添加到[RFC7420]中定义的PCE MIB模块中的信息。"
    },
    {
      "indent": 0,
      "text": "4.3. Liveness Detection and Monitoring",
      "section_title": true,
      "zh-CHS": "4.3. 活性检测与监测"
    },
    {
      "indent": 3,
      "text": "This document does not define any new mechanisms that imply any new liveness detection and monitoring requirements in addition to those already listed in Section 8.3 of [RFC5440].",
      "zh-CHS": "除[RFC5440]第8.3节中已列出的要求外，本文件未定义任何暗示任何新活性检测和监测要求的新机制。"
    },
    {
      "indent": 0,
      "text": "4.4. Verifying Correct Operation",
      "section_title": true,
      "zh-CHS": "4.4. 验证操作是否正确"
    },
    {
      "indent": 3,
      "text": "This document does not define any new mechanisms that imply any new verification requirements in addition to those already listed in Section 8.4 of [RFC5440]",
      "zh-CHS": "除[RFC5440]第8.4节中已列出的验证要求外，本文件未定义任何暗示任何新验证要求的新机制"
    },
    {
      "indent": 0,
      "text": "4.5. Requirements on Other Protocols and Functional Components",
      "section_title": true,
      "zh-CHS": "4.5. 对其他协议和功能组件的要求"
    },
    {
      "indent": 3,
      "text": "If PCE discovery mechanisms ([RFC5089] and [RFC5088]) were to be extended for technology-specific capabilities, advertising WSON RWA path computation capability should be considered.",
      "zh-CHS": "如果将PCE发现机制（[RFC5089]和[RFC5088]）扩展为技术特定能力，则应考虑RWA路径计算能力。"
    },
    {
      "indent": 0,
      "text": "4.6. Impact on Network Operation",
      "section_title": true,
      "zh-CHS": "4.6. 对网络运营的影响"
    },
    {
      "indent": 3,
      "text": "This document does not define any new mechanisms that imply any new network operation requirements in addition to those already listed in Section 8.6 of [RFC5440].",
      "zh-CHS": "除[RFC5440]第8.6节中已列出的要求外，本文件未定义任何暗示任何新网络运行要求的新机制。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document has no requirement for a change to the security models within PCEP [RFC5440]. However, the additional information distributed in order to address the RWA problem represents a disclosure of network capabilities that an operator may wish to keep private. Consideration should be given to securing this information.",
      "zh-CHS": "本文件不要求更改PCEP[RFC5440]中的安全模型。然而，为了解决RWA问题而分发的附加信息代表了运营商可能希望保密的网络能力的披露。应考虑保护这些信息。"
    },
    {
      "indent": 3,
      "text": "Solutions that address the requirements in this document need to verify that existing PCEP security mechanisms adequately protect the additional network capabilities and must include new mechanisms as necessary.",
      "zh-CHS": "满足本文件要求的解决方案需要验证现有PCEP安全机制是否充分保护了额外的网络能力，并且必须在必要时包括新机制。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC4655] Farrel, A., Vasseur, J.-P., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, August 2006, <http://www.rfc-editor.org/info/rfc4655>.",
      "zh-CHS": "[RFC4655]Farrel，A.，Vasseur，J.-P.，和J.Ash，“基于路径计算元素（PCE）的体系结构”，RFC 46552006年8月<http://www.rfc-editor.org/info/rfc4655>."
    },
    {
      "indent": 3,
      "text": "[RFC5440] Vasseur, JP., Ed., and JL. Le Roux, Ed., \"Path Computation Element (PCE) Communication Protocol (PCEP)\", RFC 5440, March 2009, <http://www.rfc-editor.org/info/rfc5440>.",
      "zh-CHS": "[RFC5440]Vasseur，JP.，Ed.，和JL。Le Roux，Ed.“路径计算元件（PCE）通信协议（PCEP）”，RFC 54402009年3月<http://www.rfc-editor.org/info/rfc5440>."
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003, <http://www.rfc-editor.org/info/rfc3473>.",
      "zh-CHS": "[RFC3473]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令资源预留协议流量工程（RSVP-TE）扩展”，RFC 3473，2003年1月<http://www.rfc-editor.org/info/rfc3473>."
    },
    {
      "indent": 3,
      "text": "[RFC4657] Ash, J., Ed., and J. Le Roux, Ed., \"Path Computation Element (PCE) Communication Protocol Generic Requirements\", RFC 4657, September 2006, <http://www.rfc-editor.org/info/rfc4657>.",
      "zh-CHS": "[RFC4657]Ash，J.，Ed.，和J.Le Roux，Ed.“路径计算元件（PCE）通信协议通用要求”，RFC 4657，2006年9月<http://www.rfc-editor.org/info/rfc4657>."
    },
    {
      "indent": 3,
      "text": "[RFC5088] Le Roux, JL., Ed., Vasseur, JP., Ed., Ikejiri, Y., and R. Zhang, \"OSPF Protocol Extensions for Path Computation Element (PCE) Discovery\", RFC 5088, January 2008, <http://www.rfc-editor.org/info/rfc5088>.",
      "zh-CHS": "[RFC5088]Le Roux，JL.，Ed.，Vasseur，JP.，Ed.，Ikejiri，Y.，和R.Zhang，“路径计算元素（PCE）发现的OSPF协议扩展”，RFC 5088，2008年1月<http://www.rfc-editor.org/info/rfc5088>."
    },
    {
      "indent": 3,
      "text": "[RFC5089] Le Roux, JL., Ed., Vasseur, JP., Ed., Ikejiri, Y., and R. Zhang, \"IS-IS Protocol Extensions for Path Computation Element (PCE) Discovery\", RFC 5089, January 2008, <http://www.rfc-editor.org/info/rfc5089>.",
      "zh-CHS": "[RFC5089]Le Roux，JL.，Ed.，Vasseur，JP.，Ed.，Ikejiri，Y.，和R.Zhang，“路径计算元素（PCE）发现的IS-IS协议扩展”，RFC 5089，2008年1月<http://www.rfc-editor.org/info/rfc5089>."
    },
    {
      "indent": 3,
      "text": "[RFC6163] Lee, Y., Ed., Bernstein, G., Ed., and W. Imajuku, \"Framework for GMPLS and Path Computation Element (PCE) Control of Wavelength Switched Optical Networks (WSONs)\", RFC 6163, April 2011, <http://www.rfc-editor.org/info/rfc6163>.",
      "zh-CHS": "[RFC6163]Lee，Y.，Ed.，Bernstein，G.，Ed.，和W.Imajuku，“波长交换光网络（WSON）的GMPLS和路径计算元件（PCE）控制框架”，RFC 61632011年4月<http://www.rfc-editor.org/info/rfc6163>."
    },
    {
      "indent": 3,
      "text": "[RFC7420] Koushik, A., Stephan, E., Zhao, Q., King, D., and J. Hardwick, \"Path Computation Element Communication Protocol (PCEP) Management Information Base (MIB) Module\", RFC 7420, December 2014, <http://www.rfc-editor.org/info/rfc7420>.",
      "zh-CHS": "[RFC7420]Koushik，A.，Stephan，E.，Zhao，Q.，King，D.，和J.Hardwick，“路径计算元素通信协议（PCEP）管理信息库（MIB）模块”，RFC 7420，2014年12月<http://www.rfc-editor.org/info/rfc7420>."
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Adrian Farrel, Cycil Margaria, and Ramon Casellas for many helpful comments that greatly improved the content of this document.",
      "zh-CHS": "作者要感谢Adrian Farrel、Cycil Margaria和Ramon Casellas的许多有用的评论，这些评论极大地改进了本文档的内容。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Young Lee (editor) Huawei Technologies 5340 Legacy Drive, Building 3 Plano, TX 75245 United States",
      "zh-CHS": "Young Lee（编辑）美国德克萨斯州普莱诺3号楼华为技术5340 Legacy Drive 75245"
    },
    {
      "indent": 3,
      "text": "Phone: (469) 277-5838 EMail: leeyoung@huawei.com",
      "zh-CHS": "电话：（469）277-5838电子邮件：leeyoung@huawei.com"
    },
    {
      "indent": 3,
      "text": "Greg Bernstein (editor) Grotto Networking Fremont, CA United States",
      "zh-CHS": "Greg Bernstein（编辑）美国加利福尼亚州弗里蒙特Grotto Networking"
    },
    {
      "indent": 3,
      "text": "Phone: (510) 573-2237 EMail: gregb@grotto-networking.com",
      "zh-CHS": "电话：（510）573-2237电子邮件：gregb@grotto-网络"
    },
    {
      "indent": 3,
      "text": "Jonas Martensson Acreo Isafjordsgatan 22 164 40 Kista Sweden",
      "zh-CHS": "Jonas Martenson Acreo Isafjordsgatan 22 164 40 Kista瑞典"
    },
    {
      "indent": 3,
      "text": "EMail: Jonas.Martensson@acreo.se",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Tomonori Takeda NTT Corporation 3-9-11, Midori-Cho Musashino-Shi, Tokyo 180-8585 Japan",
      "zh-CHS": "日本东京武藏市中岛町武藏市武田NTT公司3-9-11，180-8585"
    },
    {
      "indent": 3,
      "text": "EMail: tomonori.takeda@ntt.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Takehiro Tsuritani KDDI R&D Laboratories, Inc. 2-1-15 Ohara Kamifukuoka Saitama, 356-8502 Japan",
      "zh-CHS": "Takehiro Turitani KDDI研发实验室有限公司2-1-15 Ohara Kamifukuoka Saitama，356-8502日本"
    },
    {
      "indent": 3,
      "text": "Phone: +81-49-278-7806\nEMail: tsuri@kddilabs.jp",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Oscar Gonzalez de Dios Telefonica Distrito Telefonica, ed. Sur 3, Pta 3, Ronda de la Comunicacion Madrid, 28050 Spain",
      "zh-CHS": "奥斯卡·冈萨雷斯（Oscar Gonzalez de Dios Telefonica Distrito Telefonica），西班牙马德里市隆达市Pta 3区苏尔3区，邮编：28050"
    },
    {
      "indent": 3,
      "text": "Phone: +34 913129647\nEMail: oscar.gonzalezdedios@telefonica.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}