{
  "title": {
    "text": "RFC 7414: A Roadmap for Transmission Control Protocol (TCP) Specification Documents",
    "zh-CHS": "RFC 7414"
  },
  "number": 7414,
  "created_at": "2021-11-02 21:52:26.730007+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           M. Duke\nRequest for Comments: 7414                                            F5\nObsoletes: 4614                                                R. Braden\nCategory: Informational                                              ISI\nISSN: 2070-1721                                                  W. Eddy\n                                                             MTI Systems\n                                                              E. Blanton\n                                                      Interrupt Sciences\n                                                           A. Zimmermann\n                                                            NetApp, Inc.\n                                                           February 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "A Roadmap for Transmission Control Protocol (TCP) Specification Documents",
      "zh-CHS": "传输控制协议（TCP）规范文档的路线图"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document contains a roadmap to the Request for Comments (RFC) documents relating to the Internet's Transmission Control Protocol (TCP). This roadmap provides a brief summary of the documents defining TCP and various TCP extensions that have accumulated in the RFC series. This serves as a guide and quick reference for both TCP implementers and other parties who desire information contained in the TCP-related RFCs.",
      "zh-CHS": "本文档包含有关互联网传输控制协议（TCP）的征求意见（RFC）文档的路线图。本路线图简要概述了定义TCP的文档以及RFC系列中积累的各种TCP扩展。这为TCP实施者和其他希望获得TCP相关RFC中包含的信息的各方提供了指南和快速参考。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 4614.",
      "zh-CHS": "本文件废除了RFC 4614。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7414.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7414."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n2. Core Functionality ..............................................6\n3. Strongly Encouraged Enhancements ................................8\n   3.1. Fundamental Changes ........................................9\n   3.2. Congestion Control Extensions .............................10\n   3.3. Loss Recovery Extensions ..................................11\n   3.4. Detection and Prevention of Spurious Retransmissions ......13\n   3.5. Path MTU Discovery ........................................14\n   3.6. Header Compression ........................................15\n   3.7. Defending Spoofing and Flooding Attacks ...................15\n4. Experimental Extensions ........................................17\n   4.1. Architectural Guidelines ..................................18\n   4.2. Fundamental Changes .......................................18\n   4.3. Congestion Control Extensions .............................19\n   4.4. Loss Recovery Extensions ..................................20\n   4.5. Detection and Prevention of Spurious Retransmissions ......21\n   4.6. TCP Timeouts ..............................................22\n   4.7. Multipath TCP .............................................22\n5. TCP Parameters at IANA .........................................23\n6. Historic and Undeployed Extensions .............................24\n7. Support Documents ..............................................27\n   7.1. Foundational Works ........................................27\n   7.2. Architectural Guidelines ..................................29\n   7.3. Difficult Network Environments ............................30\n   7.4. Guidance for Developing, Analyzing, and Evaluating TCP ....33\n   7.5. Implementation Advice .....................................34\n   7.6. Tools and Tutorials .......................................36\n   7.7. MIB Modules ...............................................37\n   7.8. Case Studies ..............................................39\n8. Undocumented TCP Features ......................................40\n9. Security Considerations ........................................41\n10. References ....................................................42\n   10.1. Normative References .....................................42\n   10.2. Informative References ...................................53\nAcknowledgments ...................................................56\nAuthors' Addresses ................................................57",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "A correct and efficient implementation of the Transmission Control Protocol (TCP) is a critical part of the software of most Internet hosts. As TCP has evolved over the years, many distinct documents have become part of the accepted standard for TCP. At the same time, a large number of experimental modifications to TCP have also been published in the RFC series, along with informational notes, case studies, and other advice.",
      "zh-CHS": "传输控制协议（TCP）的正确有效实施是大多数Internet主机软件的关键部分。随着TCP多年来的发展，许多不同的文档已经成为TCP公认标准的一部分。与此同时，大量对TCP的实验性修改也已在RFC系列中发表，并附有信息说明、案例研究和其他建议。"
    },
    {
      "indent": 3,
      "text": "As an introduction to newcomers and an attempt to organize the plethora of information for old hands, this document contains a roadmap to the TCP-related RFCs. It provides a brief summary of the RFC documents that define TCP. This should provide guidance to implementers on the relevance and significance of the standards-track extensions, informational notes, and best current practices that relate to TCP.",
      "zh-CHS": "作为对新来者的介绍，以及为老手组织过多信息的尝试，本文档包含TCP相关RFC的路线图。它简要概述了定义TCP的RFC文档。这应该为实施者提供有关标准跟踪扩展、信息说明和与TCP相关的最佳当前实践的相关性和重要性的指导。"
    },
    {
      "indent": 3,
      "text": "This document is not an update of RFC 1122 [RFC1122] and is not a rigorous standard for what needs to be implemented in TCP. This document is merely an informational roadmap that captures, organizes, and summarizes most of the RFC documents that a TCP implementer, experimenter, or student should be aware of. Particular comments or broad categorizations that this document makes about individual mechanisms and behaviors are not to be taken as definitive, nor should the content of this document alone influence implementation decisions.",
      "zh-CHS": "本文档不是RFC 1122[RFC1122]的更新，也不是TCP中需要实现的严格标准。本文档仅仅是一个信息路线图，它捕获、组织和总结了TCP实施者、实验者或学生应该知道的大多数RFC文档。本文件对个别机制和行为所作的特定评论或广泛分类不应被视为确定的，也不应仅凭本文件的内容影响实施决策。"
    },
    {
      "indent": 3,
      "text": "This roadmap includes a brief description of the contents of each TCP-related RFC. In some cases, we simply supply the abstract or a key summary sentence from the text as a terse description. In addition, a letter code after an RFC number indicates its category in the RFC series (see BCP 9 [RFC2026] for explanation of these categories):",
      "zh-CHS": "该路线图包括每个TCP相关RFC内容的简要说明。在某些情况下，我们只是简单地从文本中提供摘要或关键摘要句子作为简短的描述。此外，RFC编号后的字母代码表示其在RFC系列中的类别（有关这些类别的解释，请参见BCP 9[RFC2026]）："
    },
    {
      "indent": 3,
      "text": "S - Standards Track (Proposed Standard, Draft Standard, or Internet Standard)",
      "zh-CHS": "S-标准跟踪（建议标准、标准草案或互联网标准）"
    },
    {
      "indent": 3,
      "text": "E - Experimental",
      "zh-CHS": "电子实验"
    },
    {
      "indent": 3,
      "text": "I - Informational",
      "zh-CHS": "I-信息"
    },
    {
      "indent": 3,
      "text": "H - Historic",
      "zh-CHS": "H-历史"
    },
    {
      "indent": 3,
      "text": "B - Best Current Practice",
      "zh-CHS": "B-最佳现行做法"
    },
    {
      "indent": 3,
      "text": "U - Unknown (not formally defined)",
      "zh-CHS": "U-未知（未正式定义）"
    },
    {
      "indent": 3,
      "text": "Note that the category of an RFC does not necessarily reflect its current relevance. For instance, RFC 5681 [RFC5681] is considered part of the required core functionality of TCP, although the RFC is only a Draft Standard. Similarly, some Informational RFCs contain significant technical proposals for changing TCP.",
      "zh-CHS": "请注意，RFC的类别不一定反映其当前的相关性。例如，RFC 5681[RFC5681]被认为是TCP所需核心功能的一部分，尽管RFC只是一个标准草案。类似地，一些信息RFC包含更改TCP的重要技术建议。"
    },
    {
      "indent": 3,
      "text": "Finally, if an error in the technical content has been found after publication of an RFC (at the time of this writing), this fact is indicated by the term \"(Errata)\" in the headline of the RFC's description. The contents of the errata can be found through the RFC Errata page [Errata].",
      "zh-CHS": "最后，如果在RFC发布后（撰写本文时）发现技术内容中存在错误，则RFC说明标题中的“勘误表”一词将表明这一事实。勘误表的内容可通过RFC勘误表页面[勘误表]找到。"
    },
    {
      "indent": 3,
      "text": "This roadmap is divided into three main sections. Section 2 lists the RFCs that describe absolutely required TCP behaviors for proper functioning and interoperability. Further RFCs that describe strongly encouraged, but nonessential, behaviors are listed in Section 3. Experimental extensions that are not yet standard practices, but that potentially could be in the future, are described in Section 4.",
      "zh-CHS": "本路线图分为三个主要部分。第2节列出了RFC，这些RFC描述了正常运行和互操作性所必需的TCP行为。第3节列出了更多描述强烈鼓励但非必要行为的RFC。第4节描述了尚未成为标准实践，但在未来可能成为标准实践的实验扩展。"
    },
    {
      "indent": 3,
      "text": "The reader will probably notice that these three sections are broadly equivalent to MUST/SHOULD/MAY specifications (per RFC 2119 [RFC2119]), and although the authors support this intuition, this document is merely descriptive; it does not represent a binding Standards Track position. Individual implementers still need to examine the Standards Track RFCs themselves to evaluate specific requirement levels.",
      "zh-CHS": "读者可能会注意到，这三个部分大致等同于必须/应该/可能规范（根据RFC 2119[RFC2119]），尽管作者支持这一直觉，但本文件仅为描述性文件；它不代表具有约束力的标准轨道位置。单个实现者仍然需要检查标准跟踪RFC本身，以评估特定的需求级别。"
    },
    {
      "indent": 3,
      "text": "Section 5 describes both the procedures that the Internet Assigned Numbers Authority (IANA) uses and an RFC author should follow when new TCP parameters are requested and finally assigned.",
      "zh-CHS": "第5节描述了当请求并最终分配新的TCP参数时，互联网分配号码管理局（IANA）和RFC作者应遵循的程序。"
    },
    {
      "indent": 3,
      "text": "A small number of older experimental extensions that have not been widely implemented, deployed, and used are noted in Section 6. Many other supporting documents that are relevant to the development, implementation, and deployment of TCP are described in Section 7.",
      "zh-CHS": "第6节中提到了少量尚未广泛实施、部署和使用的较老的实验性扩展。第7节介绍了与TCP的开发、实现和部署相关的许多其他支持文档。"
    },
    {
      "indent": 3,
      "text": "A small number of fairly ubiquitous important implementation practices that are not currently documented in the RFC series are listed in Section 8.",
      "zh-CHS": "第8节列出了RFC系列中目前未记录的少量相当普遍的重要实施实践。"
    },
    {
      "indent": 3,
      "text": "Within each section, RFCs are listed in the chronological order of their publication dates.",
      "zh-CHS": "在每一节中，RFC按其出版日期的时间顺序列出。"
    },
    {
      "indent": 0,
      "text": "2. Core Functionality",
      "section_title": true,
      "zh-CHS": "2. 核心功能"
    },
    {
      "indent": 3,
      "text": "A small number of documents compose the core specification of TCP. These define the required core functionalities of TCP's header parsing, state machine, congestion control, and retransmission timeout computation. These base specifications must be correctly followed for interoperability.",
      "zh-CHS": "少量文档构成了TCP的核心规范。这些定义了TCP头解析、状态机、拥塞控制和重传超时计算所需的核心功能。为了实现互操作性，必须正确遵循这些基本规范。"
    },
    {
      "indent": 3,
      "text": "RFC 793 S: \"Transmission Control Protocol\", STD 7 (September 1981) (Errata)",
      "zh-CHS": "RFC 793 S：“传输控制协议”，标准7（1981年9月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "This is the fundamental TCP specification document [RFC793]. Written by Jon Postel as part of the Internet protocol suite's core, it describes the TCP packet format, the TCP state machine and event processing, and TCP's semantics for data transmission, reliability, flow control, multiplexing, and acknowledgment.",
      "zh-CHS": "这是基本的TCP规范文档[RFC793]。由Jon Postel编写，作为Internet协议套件核心的一部分，它描述了TCP数据包格式、TCP状态机和事件处理，以及数据传输、可靠性、流量控制、多路复用和确认的TCP语义。"
    },
    {
      "indent": 6,
      "text": "Section 3.6 of RFC 793, describing TCP's handling of the IP precedence and security compartment, is mostly irrelevant today. RFC 2873 (discussed later in Section 2 below) changed the IP precedence handling, and the security compartment portion of the API is no longer implemented or used. In addition, RFC 793 did not describe any congestion control mechanism. Otherwise, however, the majority of this document still accurately describes modern TCPs. RFC 793 is the last of a series of developmental TCP specifications, starting in the Internet Experimental Notes (IENs) and continuing in the RFC series.",
      "zh-CHS": "RFC 793的第3.6节描述了TCP对IP优先级和安全分区的处理，这在今天几乎是无关紧要的。RFC 2873（稍后在第2节中讨论）更改了IP优先级处理，API的安全分区部分不再实现或使用。此外，RFC793没有描述任何拥塞控制机制。然而，除此之外，本文件的大部分内容仍然准确地描述了现代TCP。RFC793是一系列开发TCP规范中的最后一个，从Internet实验说明（IEN）开始，在RFC系列中继续。"
    },
    {
      "indent": 3,
      "text": "RFC 1122 S: \"Requirements for Internet Hosts - Communication Layers\" (October 1989)",
      "zh-CHS": "RFC 1122 S：“互联网主机要求-通信层”（1989年10月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1122] updates and clarifies RFC 793 (see above in Section 2), fixing some specification bugs and oversights. It also explains some features such as keep-alives and Karn's and Jacobson's RTO estimation algorithms [KP87][Jac88][JK92]. ICMP interactions are mentioned, and some tips are given for efficient implementation. RFC 1122 is an Applicability Statement, listing the various features that MUST, SHOULD, MAY, SHOULD NOT, and MUST NOT be present in standards-conforming TCP implementations. Unlike a purely informational roadmap, this Applicability Statement is a standards document and gives formal rules for implementation.",
      "zh-CHS": "本文档[RFC1122]更新并澄清了RFC 793（见上文第2节），修复了一些规范错误和疏忽。它还解释了一些特性，如keep alives和Karn和Jacobson的RTO估计算法[KP87][Jac88][JK92]。文中提到了ICMP交互，并给出了一些有效实现的技巧。RFC1122是一个适用性声明，列出了符合标准的TCP实现中必须、应该、可能、不应该和不应该出现的各种特性。与纯粹的信息路线图不同，本适用性声明是一份标准文档，并给出了正式的实施规则。"
    },
    {
      "indent": 3,
      "text": "RFC 2460 S: \"Internet Protocol, Version 6 (IPv6) Specification\" (December 1998) (Errata)",
      "zh-CHS": "RFC 2460 S：“互联网协议，第6版（IPv6）规范”（1998年12月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2460] is of relevance to TCP because it defines how the pseudo-header for TCP's checksum computation is derived when 128-bit IPv6 addresses are used instead of 32-bit IPv4 addresses. Additionally, RFC 2675 (see Section 3.1 of this document) describes TCP changes required to support IPv6 jumbograms.",
      "zh-CHS": "本文档[RFC2460]与TCP相关，因为它定义了当使用128位IPv6地址而不是32位IPv4地址时，如何导出TCP校验和计算的伪报头。此外，RFC 2675（参见本文档第3.1节）描述了支持IPv6巨型程序所需的TCP更改。"
    },
    {
      "indent": 3,
      "text": "RFC 2873 S: \"TCP Processing of the IPv4 Precedence Field\" (June 2000) (Errata)",
      "zh-CHS": "RFC 2873 S：“IPv4优先字段的TCP处理”（2000年6月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2873] removes from the TCP specification all processing of the precedence bits of the TOS byte of the IP header. This resolves a conflict over the use of these bits between RFC 793 (see above in Section 2) and Differentiated Services [RFC2474].",
      "zh-CHS": "本文件[RFC2873]从TCP规范中删除了对IP报头TOS字节优先位的所有处理。这解决了RFC 793（见上文第2节）和差异化服务[RFC2474]之间使用这些位的冲突。"
    },
    {
      "indent": 3,
      "text": "RFC 5681 S: \"TCP Congestion Control\" (August 2009)",
      "zh-CHS": "RFC 5681 S：“TCP拥塞控制”（2009年8月）"
    },
    {
      "indent": 6,
      "text": "Although RFC 793 (see above in Section 2) did not contain any congestion control mechanisms, today congestion control is a required component of TCP implementations. This document [RFC5681] defines congestion avoidance and control mechanism for TCP, based on Van Jacobson's 1988 SIGCOMM paper [Jac88].",
      "zh-CHS": "尽管RFC 793（见上文第2节）不包含任何拥塞控制机制，但如今，拥塞控制是TCP实现的必需组件。本文档[RFC5681]基于Van Jacobson 1988年的SIGCOMM论文[Jac88]，定义了TCP的拥塞避免和控制机制。"
    },
    {
      "indent": 6,
      "text": "A number of behaviors that together constitute what the community refers to as \"Reno TCP\" is described in RFC 5681. The name \"Reno\" comes from the Net/2 release of the 4.3 BSD operating system. This is generally regarded as the least common denominator among TCP flavors currently found running on Internet hosts. Reno TCP includes the congestion control features of slow start, congestion avoidance, fast retransmit, and fast recovery.",
      "zh-CHS": "RFC 5681中描述了许多共同构成社区所称“雷诺TCP”的行为。“雷诺”这个名字来自4.3 BSD操作系统的Net/2版本。这通常被认为是目前在Internet主机上运行的TCP风格中最不常见的。Reno TCP具有慢启动、避免拥塞、快速重传和快速恢复的拥塞控制功能。"
    },
    {
      "indent": 6,
      "text": "RFC 5681 details the currently accepted congestion control mechanism, while RFC 1122, (see above in Section 2) mandates that such a congestion control mechanism must be implemented. RFC 5681 differs slightly from the other documents listed in this section, as it does not affect the ability of two TCP endpoints to communicate; however, congestion control remains a critical component of any widely deployed TCP implementation and is required for the avoidance of congestion collapse and to ensure fairness among competing flows.",
      "zh-CHS": "RFC 5681详细说明了当前接受的拥塞控制机制，而RFC 1122（见上文第2节）要求必须实施此类拥塞控制机制。RFC 5681与本节中列出的其他文档略有不同，因为它不影响两个TCP端点的通信能力；然而，拥塞控制仍然是任何广泛部署的TCP实现的关键组成部分，是避免拥塞崩溃和确保竞争流之间公平性所必需的。"
    },
    {
      "indent": 6,
      "text": "RFCs 2001 and 2581 are the conceptual precursors of RFC 5681. The most important changes relative to RFC 2581 are:",
      "zh-CHS": "RFC 2001和2581是RFC 5681的概念前身。与RFC 2581相关的最重要变化是："
    },
    {
      "indent": 6,
      "text": "(a) The initial window requirements were changed to allow larger Initial Windows as standardized in [RFC3390] (see Section 3.2 of this document). (b) During slow start and congestion avoidance, the usage of Appropriate Byte Counting [RFC3465] (see Section 3.2 of this document) is explicitly recommended. (c) The use of Limited Transmit [RFC3042] (see Section 3.3 of this document) is now recommended.",
      "zh-CHS": "(a) 初始窗口要求已更改，以允许[RFC3390]中标准化的较大初始窗口（见本文件第3.2节）。（b） 在缓慢启动和避免拥塞期间，明确建议使用适当的字节计数[RFC3465]（见本文件第3.2节）。（c） 现在建议使用有限传输[RFC3042]（见本文件第3.3节）。"
    },
    {
      "indent": 3,
      "text": "RFC 6093 S: \"On the Implementation of the TCP Urgent Mechanism\" (January 2011)",
      "zh-CHS": "RFC 6093 S：“关于TCP紧急机制的实施”（2011年1月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6093] analyzes how current TCP stacks process TCP urgent indications, and how the behavior of widely deployed middleboxes affects the urgent indications processing. The document updates the relevant specifications such that it accommodates current practice in processing TCP urgent indications. Finally, the document raises awareness about the reliability of TCP urgent indications in the Internet, and recommends against the use of urgent mechanism.",
      "zh-CHS": "本文档[RFC6093]分析了当前TCP堆栈如何处理TCP紧急指示，以及广泛部署的中间盒的行为如何影响紧急指示处理。本文件更新了相关规范，以适应当前处理TCP紧急指示的实践。最后，该文件提高了人们对互联网上TCP紧急指示可靠性的认识，并建议不要使用紧急机制。"
    },
    {
      "indent": 3,
      "text": "RFC 6298 S: \"Computing TCP's Retransmission Timer\" (June 2011)",
      "zh-CHS": "RFC 6298 S：“计算TCP的重传计时器”（2011年6月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 6298 [RFC6298]: \"This document defines the standard algorithm that Transmission Control Protocol (TCP) senders are required to use to compute and manage their retransmission timer. It expands on the discussion in Section 4.2.3.1 of RFC 1122 and upgrades the requirement of supporting the algorithm from a SHOULD to a MUST.\" RFC 6298 updates RFC 2988 by changing the initial RTO from 3s to 1s.",
      "zh-CHS": "RFC 6298[RFC6298]摘要：“本文件定义了传输控制协议（TCP）发送方计算和管理其重传计时器所需使用的标准算法。它扩展了RFC 1122第4.2.3.1节中的讨论，并将支持算法的要求从“应该”升级为“必须”RFC 6298通过将初始RTO从3s更改为1s来更新RFC 2988。"
    },
    {
      "indent": 3,
      "text": "RFC 6691 I: \"TCP Options and Maximum Segment Size (MSS)\" (July 2012)",
      "zh-CHS": "RFC 6691 I：“TCP选项和最大段大小（MSS）”（2012年7月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6691] clarifies what value to use with the TCP Maximum Segment Size (MSS) option when IP and TCP options are in use.",
      "zh-CHS": "本文档[RFC6691]阐明了在使用IP和TCP选项时，TCP最大段大小（MSS）选项的值。"
    },
    {
      "indent": 0,
      "text": "3. Strongly Encouraged Enhancements",
      "section_title": true,
      "zh-CHS": "3. 强烈鼓励改进"
    },
    {
      "indent": 3,
      "text": "This section describes recommended TCP modifications that improve performance and security. Section 3.1 represents fundamental changes to the protocol. Sections 3.2 and 3.3 list improvements over the congestion control and loss recovery mechanisms as specified in RFC 5681 (see Section 2). Section 3.4 describes algorithms that allow a TCP sender to detect whether it has entered loss recovery spuriously.",
      "zh-CHS": "本节介绍改进性能和安全性的建议TCP修改。第3.1节代表了协议的根本性变化。第3.2节和第3.3节列出了对RFC 5681中规定的拥塞控制和丢失恢复机制的改进（见第2节）。第3.4节描述了允许TCP发送方检测其是否虚假输入丢失恢复的算法。"
    },
    {
      "indent": 3,
      "text": "Section 3.5 comprises Path MTU Discovery mechanisms. Schemes for TCP/IP header compression are listed in Section 3.6. Finally, Section 3.7 deals with the problem of preventing acceptance of forged segments and flooding attacks.",
      "zh-CHS": "第3.5节包括路径MTU发现机制。TCP/IP报头压缩方案见第3.6节。最后，第3.7节讨论了防止接受伪造段和洪水攻击的问题。"
    },
    {
      "indent": 0,
      "text": "3.1. Fundamental Changes",
      "section_title": true,
      "zh-CHS": "3.1. 根本变化"
    },
    {
      "indent": 3,
      "text": "RFCs 2675 and 7323 represent fundamental changes to TCP by redefining how parts of the basic TCP header and options are interpreted. RFC 7323 defines the Window Scale option, which reinterprets the advertised receive window. RFC 2675 specifies that MSS option and urgent pointer fields with a value of 65,535 are to be treated specially.",
      "zh-CHS": "RFCs 2675和7323通过重新定义基本TCP头和选项的部分解释方式，代表了对TCP的根本更改。RFC 7323定义窗口缩放选项，该选项重新解释播发的接收窗口。RFC 2675规定，值为65535的MSS选项和紧急指针字段将被特殊处理。"
    },
    {
      "indent": 3,
      "text": "RFC 2675 S: \"IPv6 Jumbograms\" (August 1999) (Errata)",
      "zh-CHS": "RFC 2675 S：“IPv6巨型程序”（1999年8月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "IPv6 supports longer datagrams than were allowed in IPv4. These are known as jumbograms, and use with TCP has necessitated changes to the handling of TCP's MSS and Urgent fields (both 16 bits). This document [RFC2675] explains those changes. Although it describes changes to basic header semantics, these changes should only affect the use of very large segments, such as IPv6 jumbograms, which are currently rarely used in the general Internet.",
      "zh-CHS": "IPv6支持比IPv4允许的更长的数据报。这些被称为巨型程序，与TCP一起使用需要更改TCP的MSS和紧急字段（均为16位）的处理。本文档[RFC2675]解释了这些更改。虽然它描述了对基本报头语义的更改，但这些更改只会影响非常大的段的使用，例如IPv6巨型程序，目前在通用Internet中很少使用。"
    },
    {
      "indent": 6,
      "text": "Supporting the behavior described in this document does not affect interoperability with other TCP implementations when IPv4 or non-jumbogram IPv6 is used. This document states that jumbograms are to only be used when it can be guaranteed that all receiving nodes, including each router in the end-to-end path, will support jumbograms. If even a single node that does not support jumbograms is attached to a local network, then no host on that network may use jumbograms. This explains why jumbogram use has been rare, and why this document is considered a performance optimization and not part of TCP over IPv6's basic functionality.",
      "zh-CHS": "当使用IPv4或非巨型IPv6时，支持本文档中描述的行为不会影响与其他TCP实现的互操作性。本文件规定，仅当可以保证所有接收节点（包括端到端路径中的每个路由器）都支持巨型程序时，才可使用巨型程序。如果连不支持巨型程序的单个节点都连接到本地网络，则该网络上的任何主机都不能使用巨型程序。这解释了为什么很少使用巨型程序，以及为什么本文档被视为性能优化，而不是TCP over IPv6的基本功能的一部分。"
    },
    {
      "indent": 3,
      "text": "RFC 7323 S: \"TCP Extensions for High Performance\" (September 2014)",
      "zh-CHS": "RFC 7323 S：“高性能TCP扩展”（2014年9月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC7323] defines TCP extensions for window scaling, timestamps, and protection against wrapped sequence numbers, for efficient and safe operation over paths with large bandwidth-delay products. These extensions are commonly found in currently used systems. The predecessor of this document, RFC 1323, was published in 1992, and is deployed in most TCP implementations. This document includes fixes and clarifications based on the gained deployment experience. One specific issued addressed in",
      "zh-CHS": "本文档[RFC7323]定义了用于窗口缩放、时间戳和防止包装序列号的TCP扩展，以便在具有大带宽延迟产品的路径上高效安全地运行。这些扩展通常存在于当前使用的系统中。本文档的前身RFC1323于1992年发布，并部署在大多数TCP实现中。本文档包括基于获得的部署经验的修复和澄清。其中一个具体问题在"
    },
    {
      "indent": 6,
      "text": "this specification is a recommendation how to modify the algorithm for estimating the mean RTT when timestamps are used. RFCs 1072, 1185, and 1323 are the conceptual precursors of RFC 7323.",
      "zh-CHS": "本规范建议如何修改使用时间戳时估计平均RTT的算法。RFC 1072、1185和1323是RFC 7323的概念前身。"
    },
    {
      "indent": 0,
      "text": "3.2. Congestion Control Extensions",
      "section_title": true,
      "zh-CHS": "3.2. 拥塞控制扩展"
    },
    {
      "indent": 3,
      "text": "Two of the most important aspects of TCP are its congestion control and loss recovery features. TCP treats lost packets as indicating congestion-related loss and cannot distinguish between congestion-related loss and loss due to transmission errors. Even when ECN is in use, there is a rather intimate coupling between congestion control and loss recovery mechanisms. There are several extensions to both features, and more often than not, a particular extension applies to both. In these two subsections, we group enhancements to TCP's congestion control, while the next subsection focus on TCP's loss recovery.",
      "zh-CHS": "TCP最重要的两个方面是其拥塞控制和丢失恢复功能。TCP将丢失的数据包视为表示与拥塞相关的丢失，无法区分与拥塞相关的丢失和由于传输错误导致的丢失。即使在使用ECN时，拥塞控制和丢失恢复机制之间也存在着相当密切的耦合。这两个特性都有几个扩展，通常情况下，一个特定的扩展适用于这两个特性。在这两小节中，我们将对TCP的拥塞控制进行增强，而下一小节将重点讨论TCP的丢失恢复。"
    },
    {
      "indent": 3,
      "text": "RFC 3168 S: \"The Addition of Explicit Congestion Notification (ECN) to IP\" (September 2001)",
      "zh-CHS": "RFC 3168 S：“向IP添加显式拥塞通知（ECN）”（2001年9月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3168] defines a means for end hosts to detect congestion before congested routers are forced to discard packets. Although congestion notification takes place at the IP level, ECN requires support at the transport level (e.g., in TCP) to echo the bits and adapt the sending rate. This document updates RFC 793 (see Section 2 of this document) to define two previously unused flag bits in the TCP header for ECN support. RFC 3540 (see Section 4.3 of this document) provides a supplementary (experimental) means for more secure use of ECN, and RFC 2884 (see Section 7.8 of this document) provides some sample results from using ECN.",
      "zh-CHS": "本文档[RFC3168]定义了终端主机在拥塞路由器被迫丢弃数据包之前检测拥塞的方法。虽然拥塞通知发生在IP级别，但ECN需要在传输级别（例如TCP）上提供支持，以回送位并调整发送速率。本文档更新RFC 793（参见本文档第2节），以在TCP标头中定义两个以前未使用的标志位，以支持ECN。RFC 3540（见本文件第4.3节）提供了一种更安全地使用ECN的补充（实验）方法，RFC 2884（见本文件第7.8节）提供了使用ECN的一些示例结果。"
    },
    {
      "indent": 3,
      "text": "RFC 3390 S: \"Increasing TCP's Initial Window\" (October 2002)",
      "zh-CHS": "RFC 3390 S：“增加TCP的初始窗口”（2002年10月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3390] specifies an increase in the permitted initial window for TCP from one segment to three or four segments during the slow start phase, depending on the segment size.",
      "zh-CHS": "本文件[RFC3390]规定了在慢启动阶段，TCP允许的初始窗口从一段增加到三段或四段，具体取决于段大小。"
    },
    {
      "indent": 3,
      "text": "RFC 3465 E: \"TCP Congestion Control with Appropriate Byte Counting (ABC)\" (February 2003)",
      "zh-CHS": "RFC 3465 E：“具有适当字节计数（ABC）的TCP拥塞控制”（2003年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3465] suggests that congestion control use the number of bytes acknowledged instead of the number of acknowledgments received. This change improves the performance of TCP in situations where there is no one-to-one relationship between data segments and acknowledgments (e.g., delayed ACKs or ACK loss) and closes a security hole TCP receivers can use to",
      "zh-CHS": "本文档[RFC3465]建议拥塞控制使用已确认的字节数，而不是接收到的确认数。在数据段和确认（例如，延迟确认或确认丢失）之间没有一对一关系的情况下，此更改提高了TCP的性能，并关闭了TCP接收器可以用来"
    },
    {
      "indent": 6,
      "text": "induce the sender into increasing the sending rate too rapidly (ACK-division [SCWA99] [RFC3449]). ABC is recommended by RFC 5681 (see Section 2 of this document).",
      "zh-CHS": "诱导发送方过快地增加发送速率（ACK分区[SCWA99][RFC3449]）。RFC 5681推荐ABC（见本文件第2节）。"
    },
    {
      "indent": 3,
      "text": "RFC 6633 S: \"Deprecation of ICMP Source Quench Messages\" (May 2012)",
      "zh-CHS": "RFC 6633 S：“ICMP源猝灭消息的弃用”（2012年5月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6633] formally deprecates the use of ICMP Source Quench messages by transport protocols and recommends against the implementation of [RFC1016].",
      "zh-CHS": "本文件[RFC6633]正式反对通过传输协议使用ICMP源猝灭消息，并建议不要实施[RFC1016]。"
    },
    {
      "indent": 0,
      "text": "3.3. Loss Recovery Extensions",
      "section_title": true,
      "zh-CHS": "3.3. 损失恢复扩展"
    },
    {
      "indent": 3,
      "text": "For the typical implementation of the TCP fast recovery algorithm described in RFC 5681 (see Section 2 of this document), a TCP sender only retransmits a segment after a retransmit timeout has occurred, or after three duplicate ACKs have arrived triggering the fast retransmit. A single RTO might result in the retransmission of several segments, while the fast retransmit algorithm in RFC 5681 leads only to a single retransmission. Hence, multiple losses from a single window of data can lead to a performance degradation. Documents listed in this section aim to improve the overall performance of TCP's standard loss recovery algorithms. In particular, some of them allow TCP senders to recover more effectively when multiple segments are lost from a single flight of data.",
      "zh-CHS": "对于RFC 5681（参见本文档第2节）中描述的TCP快速恢复算法的典型实现，TCP发送方仅在发生重新传输超时后，或在触发快速重新传输的三个重复ACK到达后重新传输段。单个RTO可能导致多个段的重传，而RFC 5681中的快速重传算法只导致一次重传。因此，单个数据窗口的多次丢失可能会导致性能下降。本节列出的文档旨在提高TCP标准丢失恢复算法的总体性能。特别是，其中一些允许TCP发送方在一次数据传输中丢失多个数据段时更有效地进行恢复。"
    },
    {
      "indent": 3,
      "text": "RFC 2018 S: \"TCP Selective Acknowledgment Options\" (October 1996) (Errata)",
      "zh-CHS": "RFC 2018 S：“TCP选择性确认选项”（1996年10月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "When more than one packet is lost during one RTT, TCP may experience poor performance since a TCP sender can only learn about a single lost packet per RTT from cumulative acknowledgments. This document [RFC2018] defines the basic selective acknowledgment (SACK) mechanism for TCP, which can help to overcome these limitations. The receiving TCP returns SACK blocks to inform the sender which data has been received. The sender can then retransmit only the missing data segments.",
      "zh-CHS": "当一个RTT期间丢失多个数据包时，TCP可能会遇到性能不佳的情况，因为TCP发送方只能从累积确认中了解每个RTT的单个丢失数据包。本文档[RFC2018]定义了TCP的基本选择性确认（SACK）机制，这有助于克服这些限制。接收TCP返回SACK块，通知发送方已接收到哪些数据。然后，发送方只能重新传输丢失的数据段。"
    },
    {
      "indent": 3,
      "text": "RFC 3042 S: \"Enhancing TCP's Loss Recovery Using Limited Transmit\" (January 2001)",
      "zh-CHS": "RFC 3042 S：“使用有限传输增强TCP的丢失恢复”（2001年1月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 3042 [RFC3042]: \"This document proposes a new Transmission Control Protocol (TCP) mechanism that can be used to more effectively recover lost segments when a connection's congestion window is small, or when a large number of segments are lost in a single transmission window.\" This algorithm described in RFC 3042 is called \"Limited Transmit\". Tests from 2004 showed",
      "zh-CHS": "RFC 3042的摘要[RFC3042]：“本文件提出了一种新的传输控制协议（TCP）机制，当连接的拥塞窗口较小时，或当在单个传输窗口中丢失大量段时，可使用该机制更有效地恢复丢失的段。”RFC 3042中描述的该算法称为“有限传输”。2004年的测试显示"
    },
    {
      "indent": 6,
      "text": "that Limited Transmit was deployed in roughly one third of the web servers tested [MAF04]. Limited Transmit is recommended by RFC 5681 (see Section 2 of this document).",
      "zh-CHS": "这种有限的传输被部署在大约三分之一被测试的web服务器中[MAF04]。RFC 5681建议采用有限传输（见本文件第2节）。"
    },
    {
      "indent": 3,
      "text": "RFC 6582 S: \"The NewReno Modification to TCP's Fast Recovery Algorithm\" (April 2012)",
      "zh-CHS": "RFC 6582 S：“NewReno对TCP快速恢复算法的修改”（2012年4月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6582] specifies a modification to the standard Reno fast recovery algorithm, whereby a TCP sender can use partial acknowledgments to make inferences determining the next segment to send in situations where SACK would be helpful but isn't available. Although it is only a slight modification, the NewReno behavior can make a significant difference in performance when multiple segments are lost from a single window of data.",
      "zh-CHS": "本文件[RFC6582]规定了对标准雷诺快速恢复算法的修改，其中TCP发送方可以使用部分确认来推断在SACK可能有用但不可用的情况下确定下一个要发送的段。尽管这只是一个小小的修改，但当多个数据段从单个数据窗口丢失时，NewReno行为可以在性能上产生显著的差异。"
    },
    {
      "indent": 6,
      "text": "RFCs 2582 and 3782 are the conceptual precursors of RFC 6582. The main change in RFC 3782 relative to RFC 2582 was to specify the Careful variant of NewReno's Fast Retransmit and Fast Recovery algorithms and advance those two algorithms from Experimental to Standards Track status. The main change in RFC 6582 relative to RFC 3782 was to solve a performance degradation that could occur if FlightSize on Full ACK reception is zero.",
      "zh-CHS": "RFC 2582和3782是RFC 6582的概念前身。RFC 3782相对于RFC 2582的主要变化是详细说明了NewReno的快速重传和快速恢复算法，并将这两种算法从实验状态提升到标准轨道状态。与RFC 3782相比，RFC 6582的主要变化是解决了在全ACK接收时FlightSize为零时可能出现的性能下降问题。"
    },
    {
      "indent": 3,
      "text": "RFC 6675 S: \"A Conservative Loss Recovery Algorithm Based on Selective Acknowledgment (SACK) for TCP\" (August 2012)",
      "zh-CHS": "RFC 6675 S：“基于TCP选择性确认（SACK）的保守丢失恢复算法”（2012年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6675] describes a conservative loss recovery algorithm for TCP that is based on the use of the selective acknowledgment (SACK) TCP option [RFC2018] (see above in Section 3.3). The algorithm conforms to the spirit of the congestion control specification in RFC 5681 (see Section 2 of this document), but allows TCP senders to recover more effectively when multiple segments are lost from a single flight of data.",
      "zh-CHS": "本文件[RFC6675]描述了一种基于选择性确认（SACK）TCP选项[RFC2018]的TCP保守丢失恢复算法（见上文第3.3节）。该算法符合RFC 5681中拥塞控制规范的精神（见本文件第2节），但允许TCP发送方在一次数据传输中丢失多个数据段时更有效地恢复。"
    },
    {
      "indent": 6,
      "text": "RFC 6675 is a revision of RFC 3517 to address several situations that are not handled explicitly before. In particular,",
      "zh-CHS": "RFC 6675是RFC 3517的修订版，用于解决以前未明确处理的几种情况。特别地，"
    },
    {
      "indent": 6,
      "text": "(a) it improves the loss detection in the event that the sender has outstanding segments that are smaller than Sender Maximum Segment Size (SMSS). (b) it modifies the definition of a \"duplicate acknowledgment\" to utilize the SACK information in detecting loss. (c) it maintains the ACK clock under certain circumstances involving loss at the end of the window.",
      "zh-CHS": "(a) 当发送方具有小于发送方最大段大小（SMS）的未完成段时，它改进了丢失检测。（b） 它修改了“重复确认”的定义，以利用SACK信息检测丢失。（c） 它在某些情况下维护ACK时钟，包括窗口结束时的丢失。"
    },
    {
      "indent": 0,
      "text": "3.4. Detection and Prevention of Spurious Retransmissions",
      "section_title": true,
      "zh-CHS": "3.4. 虚假重传的检测和预防"
    },
    {
      "indent": 3,
      "text": "Spurious retransmission timeouts are harmful to TCP performance and multiple algorithms have been defined for detecting when spurious retransmissions have occurred, but they respond differently with regard to their manners of recovering performance. The IETF defined multiple algorithms because there are trade-offs in whether or not certain TCP options need to be implemented and concerns about IPR status. The Standards Track RFCs in this section are closely related to the Experimental RFCs in Section 4.5 also addressing this topic.",
      "zh-CHS": "伪重传超时对TCP性能有害，已经定义了多种算法用于检测何时发生伪重传，但它们在恢复性能方面的响应方式不同。IETF定义了多种算法，因为在是否需要实施某些TCP选项以及对IPR状态的关注方面存在权衡。本节中的标准跟踪RFC与第4.5节中的实验RFC密切相关，也讨论了该主题。"
    },
    {
      "indent": 3,
      "text": "RFC 2883 S: \"An Extension to the Selective Acknowledgement (SACK) Option for TCP\" (July 2000)",
      "zh-CHS": "RFC 2883 S：“TCP选择性确认（SACK）选项的扩展”（2000年7月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2883] extends RFC 2018 (see Section 3.3 of this document). It enables use of the SACK option to acknowledge duplicate packets. With this extension, called DSACK, the sender is able to infer the order of packets received at the receiver and, therefore, to infer when it has unnecessarily retransmitted a packet. A TCP sender could then use this information to detect spurious retransmissions (see [RFC3708]).",
      "zh-CHS": "本文件[RFC2883]扩展了RFC 2018（见本文件第3.3节）。它允许使用SACK选项确认重复的数据包。通过这种称为DSACK的扩展，发送方能够推断在接收方接收的数据包的顺序，从而推断何时不必要地重新传输了数据包。然后，TCP发送方可以使用此信息检测虚假的重新传输（请参阅[RFC3708]）。"
    },
    {
      "indent": 3,
      "text": "RFC 4015 S: \"The Eifel Response Algorithm for TCP\" (February 2005)",
      "zh-CHS": "RFC 4015 S：“TCP的Eifel响应算法”（2005年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4015] describes the response portion of the Eifel algorithm, which can be used in conjunction with one of several methods of detecting when loss recovery has been spuriously entered, such as the Eifel detection algorithm in RFC 3522 (see Section 4.5), the algorithm in RFC 3708 (see Section 4.5 of this document), or F-RTO in RFC 5682 (see below in Section 3.4).",
      "zh-CHS": "本文件[RFC4015]描述了Eifel算法的响应部分，该部分可与错误输入损失恢复时的几种检测方法之一结合使用，如RFC 3522中的Eifel检测算法（见第4.5节）、RFC 3708中的算法（见本文件第4.5节），或RFC 5682中的F-RTO（见下文第3.4节）。"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 4015 [RFC4015]: \"Based on an appropriate detection algorithm, the Eifel response algorithm provides a way for a TCP sender to respond to a detected spurious timeout. It adapts the retransmission timer to avoid further spurious timeouts and (depending on the detection algorithm) can avoid the often unnecessary go-back-N retransmits that would otherwise be sent. In addition, the Eifel response algorithm restores the congestion control state in such a way that packet bursts are avoided.\"",
      "zh-CHS": "RFC 4015[RFC4015]摘要：“基于适当的检测算法，Eifel响应算法为TCP发送方响应检测到的虚假超时提供了一种方法。它调整重传计时器以避免进一步的虚假超时和（取决于检测算法）可以避免通常不必要的回退N重传，否则将被发送。此外，Eifel响应算法以避免数据包突发的方式恢复拥塞控制状态。”"
    },
    {
      "indent": 3,
      "text": "RFC 5682 S: \"Forward RTO-Recovery (F-RTO): An Algorithm for Detecting Spurious Retransmission Timeouts with TCP\" (September 2009)",
      "zh-CHS": "RFC 5682 S：“前向RTO恢复（F-RTO）：使用TCP检测虚假重传超时的算法”（2009年9月）"
    },
    {
      "indent": 6,
      "text": "The F-RTO detection algorithm [RFC5682], originally described in RFC 4138, provides an option for inferring spurious retransmission timeouts. Unlike some similar detection methods (e.g., RFCs 3522",
      "zh-CHS": "最初在RFC 4138中描述的F-RTO检测算法[RFC5682]提供了一个用于推断伪重传超时的选项。与一些类似的检测方法不同（如RFCs 3522"
    },
    {
      "indent": 6,
      "text": "and 3708, both listed in Section 4.5 of this document), F-RTO does not rely on the use of any TCP options. The basic idea is to send previously unsent data after the first retransmission after a RTO. If the ACKs advance the window, the RTO may be declared spurious.",
      "zh-CHS": "F-RTO不依赖任何TCP选项的使用。基本思想是在RTO后的第一次重传之后发送以前未发送的数据。如果ACK使窗口提前，则RTO可能被宣布为虚假。"
    },
    {
      "indent": 0,
      "text": "3.5. Path MTU Discovery",
      "section_title": true,
      "zh-CHS": "3.5. 路径MTU发现"
    },
    {
      "indent": 3,
      "text": "The MTUs supported by different links and tunnels within the Internet can vary widely. Fragmentation of packets larger than the supported MTU on a hop is undesirable. As TCP is the segmentation layer for dividing an application's byte stream into IP packet payloads, TCP implementations generally include Path MTU Discovery (PMTUD) mechanisms in order to maximize the size of segments they send, without causing fragmentation within the network. Some algorithms may utilize signaling from routers on the path to determine that the MTU on some part of the path has been exceeded.",
      "zh-CHS": "互联网内不同链路和隧道支持的MTU可能有很大差异。不希望在跃点上出现大于支持的MTU的数据包碎片。由于TCP是用于将应用程序的字节流划分为IP数据包有效负载的分段层，TCP实现通常包括路径MTU发现（PMTUD）机制，以便最大化它们发送的段的大小，而不会导致网络内的分段。一些算法可以利用来自路径上的路由器的信令来确定路径的某些部分上的MTU已被超过。"
    },
    {
      "indent": 3,
      "text": "RFC 1191 S: \"Path MTU Discovery\" (November 1990)",
      "zh-CHS": "RFC 1191 S：“路径MTU发现”（1990年11月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 1191 [RFC1191]: \"This memo describes a technique for dynamically discovering the maximum transmission unit (MTU) of an arbitrary internet path. It specifies a small change to the way routers generate one type of ICMP message. For a path that passes through a router that has not been so changed, this technique might not discover the correct Path MTU, but it will always choose a Path MTU as accurate as, and in many cases more accurate than, the Path MTU that would be chosen by current practice.\"",
      "zh-CHS": "RFC1191[RFC1191]摘要：“本备忘录描述了一种动态发现最大传输单元（MTU）的技术指任意internet路径。它指定路由器生成一种类型ICMP消息的方式的微小更改。对于通过未更改的路由器的路径，此技术可能无法发现正确的路径MTU，但它始终会选择与所选路径MTU一样准确的路径MTU，并且在许多情况下比所选路径MTU更准确的路径MTU将根据当前的实践进行选择。”"
    },
    {
      "indent": 3,
      "text": "RFC 1981 S: \"Path MTU Discovery for IP version 6\" (August 1996)",
      "zh-CHS": "RFC 1981 S：“IP版本6的路径MTU发现”（1996年8月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 1981 [RFC1981]: \"This document describes Path MTU Discovery for IP version 6. It is largely derived from RFC 1191, which describes Path MTU Discovery for IP version 4.\"",
      "zh-CHS": "RFC 1981[RFC1981]摘要：“本文档描述了IP版本6的路径MTU发现。它主要源自RFC 1191，它描述了IP版本4的路径MTU发现。”"
    },
    {
      "indent": 3,
      "text": "RFC 4821 S: \"Packetization Layer Path MTU Discovery\" (March 2007)",
      "zh-CHS": "RFC 4821 S：“打包层路径MTU发现”（2007年3月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 4821 [RFC4821]: \"This document describes a robust method for Path MTU Discovery (PMTUD) that relies on TCP or some other Packetization Layer to probe an Internet path with progressively larger packets. This method is described as an extension to RFC 1191 and RFC 1981, which specify ICMP-based Path MTU Discovery for IP versions 4 and 6, respectively.\"",
      "zh-CHS": "RFC 4821[RFC4821]摘要：“本文档描述了一种用于路径MTU发现（PMTUD）的健壮方法一种依靠TCP或其他包化层来探测具有逐渐增大的数据包的Internet路径的方法。该方法被描述为RFC 1191和RFC 1981的扩展，RFC 1191和RFC 1981分别为IP版本4和6指定基于ICMP的路径MTU发现。”"
    },
    {
      "indent": 0,
      "text": "3.6. Header Compression",
      "section_title": true,
      "zh-CHS": "3.6. 头部压缩"
    },
    {
      "indent": 3,
      "text": "Especially in streaming applications, the overhead of TCP/IP headers could correspond to more than 50% of the total amount of data sent. Such large overheads may be tolerable in wired LANs where capacity is often not an issue, but are excessive for WANs and wireless systems where bandwidth is scarce. Header compression schemes for TCP/IP like RObust Header Compression (ROHC) can significantly compress this overhead. It performs well over links with significant error rates and long round-trip times.",
      "zh-CHS": "特别是在流应用程序中，TCP/IP头的开销可能占发送数据总量的50%以上。在容量通常不成问题的有线局域网中，这样大的开销是可以忍受的，但对于带宽稀缺的广域网和无线系统来说，这样的开销太大了。TCP/IP的头压缩方案，如鲁棒头压缩（ROHC）可以显著压缩这种开销。它在错误率高、往返时间长的链路上表现良好。"
    },
    {
      "indent": 3,
      "text": "RFC 1144 S: \"Compressing TCP/IP Headers for Low-Speed Serial Links\" (February 1990)",
      "zh-CHS": "RFC 1144 S：“压缩低速串行链路的TCP/IP头”（1990年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1144] describes a method for compressing the headers of TCP/IP datagrams to improve performance over low-speed serial links. The method described in this document is limited in its handling of TCP options and cannot compress the headers of SYNs and FINs.",
      "zh-CHS": "本文档[RFC1144]描述了一种压缩TCP/IP数据报报头以提高低速串行链路性能的方法。本文档中描述的方法在处理TCP选项时受到限制，无法压缩SYN和FINs的头。"
    },
    {
      "indent": 3,
      "text": "RFC 6846 S: \"RObust Header Compression (ROHC): A Profile for TCP/IP (ROHC-TCP)\" (January 2013)",
      "zh-CHS": "RFC 6846 S：“鲁棒头压缩（ROHC）：TCP/IP配置文件（ROHC-TCP）”（2013年1月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 6846 [RFC6846]: \"This document specifies a RObust Header Compression (ROHC) profile for compression of TCP/ IP packets. The profile, called ROHC-TCP, provides efficient and robust compression of TCP headers, including frequently used TCP options such as selective acknowledgments (SACKs) and Timestamps.\" RFC 6846 is the successor of RFC 4996. It fixes a technical issue with the SACK compression and clarifies other compression methods used.",
      "zh-CHS": "来自RFC 6846[RFC6846]的摘要：“本文档指定了一个用于压缩TCP/IP数据包的健壮报头压缩（ROHC）配置文件。该配置文件称为ROHC-TCP，提供了对TCP报头的高效而健壮的压缩，包括常用的TCP选项，如选择性确认（SACK）和时间戳。”RFC 6846是RFC 4996的继任者。它修复了SACK压缩的一个技术问题，并澄清了使用的其他压缩方法。"
    },
    {
      "indent": 0,
      "text": "3.7. Defending Spoofing and Flooding Attacks",
      "section_title": true,
      "zh-CHS": "3.7. 防御欺骗和洪水攻击"
    },
    {
      "indent": 3,
      "text": "By default, TCP lacks any cryptographic structures to differentiate legitimate segments from those spoofed from malicious hosts. Spoofing valid segments requires correctly guessing a number of fields. The documents in this subsection describe ways to make that guessing harder or to prevent it from being able to affect a connection negatively.",
      "zh-CHS": "默认情况下，TCP缺少任何加密结构来区分合法段和恶意主机伪造的段。欺骗有效段需要正确猜测多个字段。本小节中的文档描述了使猜测更加困难或防止其对连接产生负面影响的方法。"
    },
    {
      "indent": 3,
      "text": "RFC 4953 I: \"Defending TCP Against Spoofing Attacks\" (July 2007)",
      "zh-CHS": "RFC 4953 I：“保护TCP免受欺骗攻击”（2007年7月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4953] discusses the recently increased vulnerability of long-lived TCP connections, such as BGP connections, to reset (send RST) spoofing attacks. The document analyzes the vulnerability, discussing proposed solutions at the transport level and their inherent challenges, as well as existing network level solutions and the feasibility of their deployment.",
      "zh-CHS": "本文档[RFC4953]讨论了长寿命TCP连接（如BGP连接）最近增加的重置（发送RST）欺骗攻击的漏洞。该文件分析了该漏洞，讨论了在传输级别提出的解决方案及其固有的挑战，以及现有的网络级别解决方案及其部署的可行性。"
    },
    {
      "indent": 3,
      "text": "RFC 5461 I: \"TCP's Reaction to Soft Errors\" (February 2009)",
      "zh-CHS": "RFC 5461 I：“TCP对软错误的反应”（2009年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5461] describes a nonstandard but widely implemented modification to TCP's handling of ICMP soft error messages that rejects pending connection-requests when such error messages are received. This behavior reduces the likelihood of long delays between connection-establishment attempts that may arise in some scenarios.",
      "zh-CHS": "本文档[RFC5461]描述了对TCP处理ICMP软错误消息的非标准但广泛实施的修改，该修改在收到此类错误消息时拒绝挂起的连接请求。这种行为降低了在某些场景中可能出现的连接建立尝试之间长时间延迟的可能性。"
    },
    {
      "indent": 3,
      "text": "RFC 4987 I: \"TCP SYN Flooding Attacks and Common Mitigations\" (August 2007)",
      "zh-CHS": "RFC 4987 I：“TCP SYN洪泛攻击和常见缓解措施”（2007年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4987] describes the well-known TCP SYN flooding attack. It analyzes and discusses various countermeasures against these attacks, including their use and trade-offs.",
      "zh-CHS": "本文档[RFC4987]描述了著名的TCP SYN洪泛攻击。它分析和讨论了针对这些攻击的各种对策，包括它们的使用和权衡。"
    },
    {
      "indent": 3,
      "text": "RFC 5925 S: \"The TCP Authentication Option\" (June 2010)",
      "zh-CHS": "RFC 5925 S：“TCP认证选项”（2010年6月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5925] describes the TCP Authentication Option (TCP-AO), which is used to authenticate TCP segments. TCP-AO obsoletes the TCP MD5 Signature option of RFC 2385. It supports the use of stronger hash functions, protects against replays for long-lived TCP connections (as used, e.g., in BGP and LDP), coordinates key exchanges between endpoints, and provides a more explicit recommendation for external key management. Cryptographic algorithms for TCP-AO are defined in [RFC5926] (see below in Section 3.7).",
      "zh-CHS": "本文档[RFC5925]描述了用于验证TCP段的TCP身份验证选项（TCP-AO）。TCP-AO淘汰了RFC 2385的TCP MD5签名选项。它支持使用更强的散列函数，防止长时间TCP连接（如BGP和LDP中所用）的重播，协调端点之间的密钥交换，并为外部密钥管理提供更明确的建议。[RFC5926]中定义了TCP-AO的加密算法（见下文第3.7节）。"
    },
    {
      "indent": 3,
      "text": "RFC 5926 S: \"Cryptographic Algorithms for the TCP Authentication Option (TCP-AO)\" (June 2010)",
      "zh-CHS": "RFC 5926 S：“TCP认证选项（TCP-AO）的加密算法”（2010年6月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5926] specifies the algorithms and attributes that can be used in TCP Authentication Option's (TCP-AO) [RFC5925] (see above in Section 3.7) current manual keying mechanism and provides the interface for future message authentication codes (MACs).",
      "zh-CHS": "本文件[RFC5926]规定了可用于TCP认证选项（TCP-AO）[RFC5925]（见上文第3.7节）当前手动键控机制的算法和属性，并为未来的消息认证码（MAC）提供了接口。"
    },
    {
      "indent": 3,
      "text": "RFC 5927 I: \"ICMP Attacks against TCP\" (July 2010)",
      "zh-CHS": "RFC 5927 I：“针对TCP的ICMP攻击”（2010年7月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 5927 [RFC5927]: \"This document discusses the use of the Internet Control Message Protocol (ICMP) to perform a variety of attacks against the Transmission Control Protocol (TCP). Additionally, this document describes a number of widely implemented modifications to TCP's handling of ICMP error messages that help to mitigate these issues.\"",
      "zh-CHS": "RFC 5927[RFC5927]摘要：“本文档讨论了使用Internet控制消息协议（ICMP）对传输控制协议（TCP）执行各种攻击的方法。此外，本文件还描述了对TCP处理ICMP错误消息的一些广泛实施的修改，这些修改有助于缓解这些问题。”"
    },
    {
      "indent": 3,
      "text": "RFC 5961 S: \"Improving TCP's Robustness to Blind In-Window Attacks\" (August 2010)",
      "zh-CHS": "RFC 5961 S：“提高TCP对窗口内盲攻击的鲁棒性”（2010年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5961] describes minor modifications to how TCP handles inbound segments. This renders TCP connections, especially long-lived connections such as H-323 or BGP, less vulnerable to spoofed packet injection attacks where the 4-tuple (the source and destination IP addresses and the source and destination ports) has been guessed.",
      "zh-CHS": "本文档[RFC5961]描述了TCP如何处理入站段的一些小修改。这使得TCP连接，特别是长寿命的连接，如H-323或BGP，在猜测到4元组（源和目标IP地址以及源和目标端口）的情况下，不易受到欺骗数据包注入攻击。"
    },
    {
      "indent": 3,
      "text": "RFC 6528 S: \"Defending against Sequence Number Attacks\" (February 2012)",
      "zh-CHS": "RFC 6528 S：“防御序列号攻击”（2012年2月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 6528 [RFC6528]: \"This document specifies an algorithm for the generation of TCP Initial Sequence Numbers (ISNs), such that the chances of an off-path attacker guessing the sequence numbers in use by a target connection are reduced. This document revises (and formally obsoletes) RFC 1948, and takes the ISN generation algorithm originally proposed in that document to Standards Track, formally updating RFC 793\"",
      "zh-CHS": "RFC 6528[RFC6528]摘要：“本文档指定了一种生成TCP初始序列号（ISN）的算法，以减少非路径攻击者猜测目标连接正在使用的序列号的机会。本文档修订（并正式废弃）RFC 1948，并将该文件中最初提出的ISN生成算法纳入标准轨道，正式更新RFC 793“"
    },
    {
      "indent": 0,
      "text": "4. Experimental Extensions",
      "section_title": true,
      "zh-CHS": "4. 实验扩展"
    },
    {
      "indent": 3,
      "text": "The RFCs in this section are either Experimental and may become Proposed Standards in the future or are Proposed Standards (or Informational), but can be considered experimental due to lack of wide deployment. At least part of the reason that they are still experimental is to gain more wide-scale experience with them before a standards track decision is made.",
      "zh-CHS": "本节中的RFC要么是试验性的，将来可能成为建议的标准，要么是建议的标准（或信息性的），但由于缺乏广泛的部署，可以认为是试验性的。至少部分原因是，他们仍然是实验性的，是为了在做出标准跟踪决策之前获得更广泛的经验。"
    },
    {
      "indent": 3,
      "text": "If the Experimental RFC is a proposal for a new protocol capability or service, i.e., it requires a new TCP option code point, the implementation and experimentation should follow [RFC6994] (see Section 5 of this document), which describes how the experimental TCP option code points can concurrently support multiple TCP extensions.",
      "zh-CHS": "如果实验性RFC是一个新协议功能或服务的提案，即它需要一个新的TCP选项代码点，那么实现和实验应遵循[RFC6994]（参见本文档第5节），其中描述了实验性TCP选项代码点如何能够同时支持多个TCP扩展。"
    },
    {
      "indent": 3,
      "text": "By their publication as Experimental RFCs, it is hoped that the community of TCP researchers will analyze and test the contents of these RFCs. Although experimentation is encouraged, there is not yet",
      "zh-CHS": "通过将其作为实验性RFC发表，希望TCP研究人员社区能够分析和测试这些RFC的内容。虽然鼓励进行实验，但目前还没有"
    },
    {
      "indent": 3,
      "text": "formal consensus that these are fully logical and safe behaviors. Wide-scale deployment of implementations that use these features should be well thought out in terms of consequences.",
      "zh-CHS": "正式一致认为这些行为完全符合逻辑且安全。使用这些特性的实现的大规模部署应该考虑到后果。"
    },
    {
      "indent": 0,
      "text": "4.1. Architectural Guidelines",
      "section_title": true,
      "zh-CHS": "4.1. 建筑指南"
    },
    {
      "indent": 3,
      "text": "As multiple flows may share the same paths, sections of paths, or other resources, the TCP implementation may benefit from sharing information across TCP connections or other flows. Some experimental proposals have been documented and some implementations have included the concepts.",
      "zh-CHS": "由于多个流可能共享相同的路径、路径部分或其他资源，TCP实现可能受益于跨TCP连接或其他流共享信息。一些实验性的建议已经被记录下来，一些实现已经包含了这些概念。"
    },
    {
      "indent": 3,
      "text": "RFC 2140 I: \"TCP Control Block Interdependence\" (April 1997)",
      "zh-CHS": "RFC 2140 I：“TCP控制块相互依赖”（1997年4月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2140] suggests how TCP connections between the same endpoints might share information, such as their congestion control state. To some degree, this is done in practice by a few operating systems; for example, Linux currently has a destination cache. Although this RFC is technically Informational, the concepts it describes are in experimental use, so we include it in this section.",
      "zh-CHS": "本文档[RFC2140]建议相同端点之间的TCP连接如何共享信息，例如它们的拥塞控制状态。在某种程度上，这实际上是由一些操作系统完成的；例如，Linux当前有一个目标缓存。尽管本RFC在技术上是信息性的，但它所描述的概念在实验中使用，因此我们将其包括在本节中。"
    },
    {
      "indent": 3,
      "text": "RFC 3124 S: \"The Congestion Manager\" (June 2001)",
      "zh-CHS": "RFC 3124 S：“拥塞管理器”（2001年6月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3124] is a related proposal to RFC 2140 (see above in Section 4.1). The idea behind the Congestion Manager, moving congestion control outside of individual TCP connections, represents a modification to the core of TCP, which supports sharing information among TCP connections. Although a Proposed Standard, some pieces of the Congestion Manager support architecture have not been specified yet, and it has not achieved use or implementation beyond experimental stacks, so it is not listed among the standard TCP enhancements in this roadmap.",
      "zh-CHS": "本文件[RFC3124]是RFC 2140的相关提案（见上文第4.1节）。拥塞管理器背后的思想，将拥塞控制移到单个TCP连接之外，代表了对TCP核心的修改，它支持在TCP连接之间共享信息。虽然是一个提议的标准，但拥塞管理器支持体系结构的某些部分尚未指定，并且它还没有实现实验堆栈之外的使用或实现，因此它没有在本路线图的标准TCP增强中列出。"
    },
    {
      "indent": 0,
      "text": "4.2. Fundamental Changes",
      "section_title": true,
      "zh-CHS": "4.2. 根本变化"
    },
    {
      "indent": 3,
      "text": "Like the Standards Track documents listed in Section 3.1, there also exist new Experimental RFCs that specify fundamental changes to TCP. At the time of writing, the only example so far is TCP Fast Open that deviates from the standard TCP semantics of [RFC793].",
      "zh-CHS": "与第3.1节中列出的标准跟踪文件一样，也存在新的实验性RFC，这些RFC规定了TCP的基本更改。在撰写本文时，到目前为止唯一的例子是TCP Fast Open，它偏离了[RFC793]的标准TCP语义。"
    },
    {
      "indent": 3,
      "text": "RFC 7413 E: \"TCP Fast Open\" (December 2014)",
      "zh-CHS": "RFC 7413 E：“TCP快速开放”（2014年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC7413] describes TCP Fast Open that allows data to be carried in the SYN and SYN-ACK packets and consumed by the receiver during the initial connection handshake. It saves up to one RTT compared to the standard TCP, which requires a three-way handshake to complete before data can be exchanged.",
      "zh-CHS": "本文档[RFC7413]描述了TCP Fast Open，它允许数据在SYN和SYN-ACK数据包中传输，并在初始连接握手期间由接收器使用。与标准TCP相比，它最多可以节省一个RTT，标准TCP需要三次握手才能完成数据交换。"
    },
    {
      "indent": 0,
      "text": "4.3. Congestion Control Extensions",
      "section_title": true,
      "zh-CHS": "4.3. 拥塞控制扩展"
    },
    {
      "indent": 3,
      "text": "TCP congestion control has been an extremely active research area for many years (see RFC 5783 discussed in Section 7.6 of this document), as it determines the performance of many applications that use TCP. A number of Experimental RFCs address issues with flow start up, overshoot, and steady-state behavior in the basic algorithms of RFC 5681 (see Section 2 of this document). In these subsections, enhancements to TCP's congestion control are listed. The next subsection focuses on TCP's loss recovery.",
      "zh-CHS": "TCP拥塞控制多年来一直是一个非常活跃的研究领域（参见本文档第7.6节中讨论的RFC 5783），因为它决定了许多使用TCP的应用程序的性能。许多实验性RFC解决了RFC 5681基本算法中的流量启动、超调和稳态行为问题（见本文件第2节）。在这些小节中，列出了TCP拥塞控制的增强功能。下一小节重点介绍TCP的丢失恢复。"
    },
    {
      "indent": 3,
      "text": "RFC 2861 E: \"TCP Congestion Window Validation\" (June 2000)",
      "zh-CHS": "RFC 2861 E：“TCP拥塞窗口验证”（2000年6月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2861] suggests reducing the congestion window over time when no packets are flowing. This behavior is more aggressive than that specified in RFC 5681 (see Section 2 of this document), which says that a TCP sender SHOULD set its congestion window to the initial window after an idle period of an RTO or greater.",
      "zh-CHS": "本文档[RFC2861]建议在没有数据包流动的情况下，随着时间的推移减少拥塞窗口。这种行为比RFC 5681（参见本文档第2节）中规定的行为更具攻击性，RFC 5681指出TCP发送方应在RTO空闲时间或更长时间后将其拥塞窗口设置为初始窗口。"
    },
    {
      "indent": 3,
      "text": "RFC 3540 E: \"Robust Explicit Congestion Notification (ECN) Signaling with Nonces\" (June 2003)",
      "zh-CHS": "RFC 3540 E:“带有nonce的鲁棒显式拥塞通知（ECN）信令”（2003年6月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3540] describes an optional addition to ECN that protects against accidental or malicious concealment of marked packets from the TCP sender.",
      "zh-CHS": "本文档[RFC3540]描述了ECN的一个可选添加项，可防止TCP发送方意外或恶意隐藏标记的数据包。"
    },
    {
      "indent": 3,
      "text": "RFC 3649 E: \"HighSpeed TCP for Large Congestion Windows\" (December 2003)",
      "zh-CHS": "RFC 3649 E：“用于大拥塞窗口的高速TCP”（2003年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3649] proposes a modification to TCP's congestion control mechanism for use with TCP connections with large congestion windows, to allow TCP to achieve a higher throughput in high-bandwidth environments.",
      "zh-CHS": "本文档[RFC3649]建议对TCP的拥塞控制机制进行修改，以用于具有大拥塞窗口的TCP连接，从而允许TCP在高带宽环境中实现更高的吞吐量。"
    },
    {
      "indent": 3,
      "text": "RFC 3742 E: \"Limited Slow-Start for TCP with Large Congestion Windows\" (March 2004)",
      "zh-CHS": "RFC 3742 E：“具有大拥塞窗口的TCP有限慢启动”（2004年3月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3742] describes a more conservative slow-start behavior to prevent massive packet losses when a connection uses a very large congestion window.",
      "zh-CHS": "本文档[RFC3742]描述了一种更为保守的慢启动行为，用于在连接使用非常大的拥塞窗口时防止大量数据包丢失。"
    },
    {
      "indent": 3,
      "text": "RFC 4782 E: \"Quick-Start for TCP and IP\" (January 2007) (Errata)",
      "zh-CHS": "RFC 4782 E：“TCP和IP的快速启动”（2007年1月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4782] specifies the optional Quick-Start mechanism for TCP. This mechanism allows connections to use higher sending rates at the beginning of the data transfer or after an idle period, provided that there is significant unused bandwidth along the path, and the sender and all of the routers along the path approve this higher rate.",
      "zh-CHS": "本文件[RFC4782]规定了TCP的可选快速启动机制。此机制允许连接在数据传输开始时或空闲时间后使用更高的发送速率，前提是路径上存在大量未使用的带宽，并且发送方和路径上的所有路由器都认可此更高速率。"
    },
    {
      "indent": 3,
      "text": "RFC 5562 E: \"Adding Explicit Congestion Notification (ECN) Capability to TCP's SYN/ACK Packets\" (June 2009)",
      "zh-CHS": "RFC 5562 E：“向TCP的SYN/ACK数据包添加显式拥塞通知（ECN）功能”（2009年6月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5562] describes an experimental modification to ECN [RFC3168] (see Section 3.2 of this document) for the use of ECN in TCP SYN/ACK packets. This would allow to ECN-mark rather than drop the TCP SYN/ACK packet at an ECN-capable router, and to avoid the severe penalty of a retransmission timeout for a connection when the SYN/ACK packet is dropped.",
      "zh-CHS": "本文件[RFC5562]描述了对ECN[RFC3168]（见本文件第3.2节）的实验性修改，以在TCP SYN/ACK数据包中使用ECN。这将允许ECN标记而不是在支持ECN的路由器上丢弃TCP SYN/ACK数据包，并避免在丢弃SYN/ACK数据包时对连接重新传输超时的严重惩罚。"
    },
    {
      "indent": 3,
      "text": "RFC 5690 I: \"Adding Acknowledgement Congestion Control to TCP\" (February 2010)",
      "zh-CHS": "RFC 5690 I：“向TCP添加确认拥塞控制”（2010年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5690] describes a congestion control mechanism for acknowledgment (ACKs) traffic in TCP. The mechanism is based on the acknowledgment congestion control of the Datagram Congestion Control Protocol's (DCCP's) [RFC4340] Congestion Control Identifier (CCID) 2 [RFC4341].",
      "zh-CHS": "本文档[RFC5690]描述了TCP中确认（ACKs）流量的拥塞控制机制。该机制基于数据报拥塞控制协议（DCCP）[RFC4340]拥塞控制标识符（CCID）2[RFC4341]的确认拥塞控制。"
    },
    {
      "indent": 3,
      "text": "RFC 6928 E: \"Increasing TCP's Initial Window\" (April 2013)",
      "zh-CHS": "RFC 6928 E：“增加TCP的初始窗口”（2013年4月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6928] proposes to increase the TCP initial window from between 2 and 4 segments, as specified in RFC 3390 (see Section 3.2 of this document), to 10 segments with a fallback to the existing recommendation when performance issues are detected.",
      "zh-CHS": "本文件[RFC6928]建议在检测到性能问题时，将TCP初始窗口从RFC 3390（见本文件第3.2节）中规定的2到4个段增加到10个段，并返回到现有建议。"
    },
    {
      "indent": 0,
      "text": "4.4. Loss Recovery Extensions",
      "section_title": true,
      "zh-CHS": "4.4. 损失恢复扩展"
    },
    {
      "indent": 3,
      "text": "RFC 5827 E: \"Early Retransmit for TCP and Stream Control Transmission Protocol (SCTP)\" (April 2010)",
      "zh-CHS": "RFC 5827 E：“TCP和流控制传输协议（SCTP）的早期重传”（2010年4月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5827] proposes the \"Early Retransmit\" mechanism for TCP (and SCTP) that can be used to recover lost segments when a connection's congestion window is small. In certain special circumstances, Early Retransmit reduces the number of duplicate acknowledgments required to trigger fast retransmit to recover segment losses without waiting for a lengthy retransmission timeout.",
      "zh-CHS": "本文档[RFC5827]提出了TCP（和SCTP）的“早期重传”机制，可用于在连接拥塞窗口较小时恢复丢失的段。在某些特殊情况下，早期重传减少了触发快速重传以恢复段丢失而无需等待较长的重传超时所需的重复确认次数。"
    },
    {
      "indent": 3,
      "text": "RFC 6069 E: \"Making TCP More Robust to Long Connectivity Disruptions (TCP-LCD)\" (December 2010)",
      "zh-CHS": "RFC 6069 E：“使TCP对长时间连接中断（TCP-LCD）更具鲁棒性”（2010年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6069] describes how standard ICMP messages can be used to disambiguate true congestion loss from non-congestion loss caused by connectivity disruptions. It proposes a reversion strategy of TCP's retransmission timer that enables a more prompt detection of whether or not the connectivity has been restored.",
      "zh-CHS": "本文档[RFC6069]描述了如何使用标准ICMP消息来消除连接中断导致的真实拥塞丢失和非拥塞丢失之间的歧义。它提出了一种TCP重传计时器的反转策略，可以更快速地检测连接是否已恢复。"
    },
    {
      "indent": 3,
      "text": "RFC 6937 E: \"Proportional Rate Reduction for TCP\" (May 2013)",
      "zh-CHS": "RFC 6937 E：“TCP的比例费率降低”（2013年5月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6937] describes an experimental Proportional Rate Reduction (PRR) algorithm as an alternative to the widely deployed Fast Recovery algorithm, to improve the accuracy of the amount of data sent by TCP during loss recovery.",
      "zh-CHS": "本文档[RFC6937]描述了一种实验性比例速率降低（PRR）算法，作为广泛部署的快速恢复算法的替代方案，以提高丢失恢复期间TCP发送的数据量的准确性。"
    },
    {
      "indent": 0,
      "text": "4.5. Detection and Prevention of Spurious Retransmissions",
      "section_title": true,
      "zh-CHS": "4.5. 虚假重传的检测和预防"
    },
    {
      "indent": 3,
      "text": "In addition to the Standards Track extensions to deal with spurious retransmissions in Section 3.4, Experimental proposals have also been documented.",
      "zh-CHS": "In addition to the Standards Track extensions to deal with spurious retransmissions in Section 3.4, Experimental proposals have also been documented.translate error, please retry"
    },
    {
      "indent": 3,
      "text": "RFC 3522 E: \"The Eifel Detection Algorithm for TCP\" (April 2003)",
      "zh-CHS": "RFC 3522 E：“TCP的Eifel检测算法”（2003年4月）"
    },
    {
      "indent": 6,
      "text": "The Eifel detection algorithm [RFC3522] allows a TCP sender to detect a posteriori whether it has entered loss recovery unnecessarily by using the TCP timestamp option to solve the ACK ambiguity.",
      "zh-CHS": "Eifel检测算法[RFC3522]允许TCP发送方通过使用TCP时间戳选项解决ACK模糊性来检测其是否已不必要地进入丢失恢复。"
    },
    {
      "indent": 3,
      "text": "RFC 3708 E: \"Using TCP Duplicate Selective Acknowledgement (DSACKs) and Stream Control Transmission Protocol (SCTP) Duplicate Transmission Sequence Numbers (TSNs) to Detect Spurious Retransmissions\" (February 2004)",
      "zh-CHS": "RFC 3708 E：“使用TCP重复选择性确认（DSACKs）和流控制传输协议（SCTP）重复传输序列号（TSN）来检测虚假重传”（2004年2月）"
    },
    {
      "indent": 6,
      "text": "Abstract: \"TCP and Stream Control Transmission Protocol (SCTP) provide notification of duplicate segment receipt through Duplicate Selective Acknowledgement (DSACKs) and Duplicate Transmission Sequence Number (TSN) notification, respectively. This document presents conservative methods of using this information to identify unnecessary retransmissions for various applications.\"",
      "zh-CHS": "摘要：“TCP和流控制传输协议（SCTP）通过重复选择确认（DSACKs）和重复传输序列号（TSN）提供重复段接收通知分别通知。本文档介绍了使用此信息识别各种应用程序不必要的重新传输的保守方法。”"
    },
    {
      "indent": 3,
      "text": "RFC 4653 E: \"Improving the Robustness of TCP to Non-Congestion Events\" (August 2006)",
      "zh-CHS": "RFC 4653 E：“提高TCP对非拥塞事件的鲁棒性”（2006年8月）"
    },
    {
      "indent": 6,
      "text": "In the presence of non-congestion events, such as packet reordering, an out-of-order segment does not necessarily indicate a lost segment and congestion. This document [RFC4653] proposes",
      "zh-CHS": "在存在非拥塞事件（例如分组重新排序）的情况下，无序段不一定表示丢失段和拥塞。本文件[RFC4653]建议："
    },
    {
      "indent": 6,
      "text": "to increase the threshold used to trigger a fast retransmission from the fixed value of three duplicate ACKs to about one congestion window of data in order to disambiguate true segment loss from segment reordering.",
      "zh-CHS": "将用于触发快速重传的阈值从三个重复ack的固定值增加到大约一个数据拥塞窗口，以消除段重新排序造成的真正段丢失的歧义。"
    },
    {
      "indent": 0,
      "text": "4.6. TCP Timeouts",
      "section_title": true,
      "zh-CHS": "4.6. TCP超时"
    },
    {
      "indent": 3,
      "text": "Besides the well-known retransmission timeout the TCP standard [RFC793] defines other timeouts. This section lists documents that deal with TCP's various timeouts.",
      "zh-CHS": "除了众所周知的重传超时外，TCP标准[RFC793]还定义了其他超时。本节列出了处理TCP各种超时的文档。"
    },
    {
      "indent": 3,
      "text": "RFC 5482 S: \"TCP User Timeout Option\" (March 2009)",
      "zh-CHS": "RFC 5482 S：“TCP用户超时选项”（2009年3月）"
    },
    {
      "indent": 6,
      "text": "As a local per-connection parameter, the TCP user timeout controls how long transmitted data may remain unacknowledged before a connection is forcefully closed. This document [RFC5482] specifies the TCP User Timeout Option that allows one end of a TCP connection to advertise its current user timeout value. This information provides advice to the other end of the TCP connection to adapt its user timeout accordingly.",
      "zh-CHS": "作为每个连接的本地参数，TCP用户超时控制在强制关闭连接之前传输的数据未确认的时间。本文档[RFC5482]指定TCP用户超时选项，该选项允许TCP连接的一端公布其当前用户超时值。此信息向TCP连接的另一端提供建议，以相应地调整其用户超时。"
    },
    {
      "indent": 0,
      "text": "4.7. Multipath TCP",
      "section_title": true,
      "zh-CHS": "4.7. 多路径TCP"
    },
    {
      "indent": 3,
      "text": "MultiPath TCP (MPTCP) is an ongoing effort within the IETF that allows a TCP connection to simultaneously use multiple IP addresses / interfaces to spread their data across several subflows, while presenting a regular TCP interface to applications. Benefits of this include better resource utilization, better throughput and smoother reaction to failures. The documents listed in this section specify the Multipath TCP scheme, while the documents in Sections 7.2, 7.4, and 7.5 provide some additional background information.",
      "zh-CHS": "多路径TCP（MPTCP）是IETF中正在进行的一项工作，它允许TCP连接同时使用多个IP地址/接口将其数据传播到多个子流，同时向应用程序提供常规TCP接口。这样做的好处包括更好的资源利用率、更好的吞吐量和更平滑的故障反应。本节中列出的文档指定了多路径TCP方案，而第7.2、7.4和7.5节中的文档提供了一些额外的背景信息。"
    },
    {
      "indent": 3,
      "text": "RFC 6356 E: \"Coupled Congestion Control for Multipath Transport Protocols\" (October 2011)",
      "zh-CHS": "RFC 6356 E：“多路径传输协议的耦合拥塞控制”（2011年10月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6356] presents a congestion control algorithm for multipath transport protocols such as Multipath TCP. It couples the congestion control algorithms running on different subflows by linking their increase functions, and dynamically controls the overall aggressiveness of the multipath flow. The result is an algorithm that is fair to TCP at bottlenecks while moving traffic away from congested links.",
      "zh-CHS": "本文档[RFC6356]介绍了多路径传输协议（如多路径TCP）的拥塞控制算法。它通过连接不同子流上运行的拥塞控制算法的增加函数来耦合这些算法，并动态控制多径流的总体攻击性。其结果是一种算法，在瓶颈处对TCP公平，同时将流量从拥塞的链路移开。"
    },
    {
      "indent": 3,
      "text": "RFC 6824 E: \"TCP Extensions for Multipath Operation with Multiple Addresses\" (January 2013) (Errata)",
      "zh-CHS": "RFC 6824 E：“多地址多路径操作的TCP扩展”（2013年1月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6824] presents protocol changes required to add multipath capability to TCP; specifically, those for signaling and setting up multiple paths (\"subflows\"), managing these subflows, reassembly of data, and termination of sessions.",
      "zh-CHS": "本文件[RFC6824]介绍了向TCP添加多路径功能所需的协议更改；具体地说，用于发送信号和设置多条路径（“子流”）、管理这些子流、重新组装数据和终止会话的协议。"
    },
    {
      "indent": 0,
      "text": "5. TCP Parameters at IANA",
      "section_title": true,
      "zh-CHS": "5. IANA上的TCP参数"
    },
    {
      "indent": 3,
      "text": "RFCs listed here describes both the procedures that the Internet Assigned Numbers Authority (IANA) uses when handling assignments and the procedures an RFC author should follow when requesting new TCP option code points.",
      "zh-CHS": "此处列出的RFC描述了互联网分配号码管理局（IANA）在处理分配时使用的程序，以及RFC作者在请求新的TCP选项代码点时应遵循的程序。"
    },
    {
      "indent": 3,
      "text": "RFC 2780 B: \"IANA Allocation Guidelines For Values In the Internet Protocol and Related Headers\" (March 2000)",
      "zh-CHS": "RFC 2780 B：“互联网协议和相关标题中值的IANA分配指南”（2000年3月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 2780 [RFC2780]: \"This memo provides guidance for the IANA to use in assigning parameters for fields in the IPv4, IPv6, ICMP, UDP and TCP protocol headers.\"",
      "zh-CHS": "RFC 2780[RFC2780]摘要：“本备忘录为IANA在为IPv4、IPv6、ICMP、UDP和TCP协议头中的字段分配参数时提供了指导。”"
    },
    {
      "indent": 3,
      "text": "RFC 4727 S: \"Experimental Values in IPv4, IPv6, ICMPv4, ICMPv6, UDP, and TCP Headers\" (November 2006)",
      "zh-CHS": "RFC 4727 S：“IPv4、IPv6、ICMPv4、ICMPv6、UDP和TCP标头中的实验值”（2006年11月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4727] reserves both TCP options 253 and 254 for experimentation purposes. When such experiments are deployed in the Internet, they should follow the additional requirements in RFC 6994 (see below in Section 5).",
      "zh-CHS": "本文件[RFC4727]保留TCP选项253和254，以供实验使用。当此类试验部署在互联网上时，应遵循RFC 6994中的附加要求（见下文第5节）。"
    },
    {
      "indent": 3,
      "text": "RFC 6335 B: \"Internet Assigned Numbers Authority (IANA) Procedures for the Management of the Service Name and Transport Protocol Port Number Registry\" (August 2011)",
      "zh-CHS": "RFC 6335 B：“互联网分配号码管理局（IANA）服务名称和传输协议端口号注册管理程序”（2011年8月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 6335 [RFC6335]: \"This document defines the procedures that the Internet Assigned Numbers Authority (IANA) uses when handling assignment and other requests related to the Service Name and Transport Protocol Port Number registry.\"",
      "zh-CHS": "来自RFC 6335[RFC6335]摘要：“本文档定义了Internet分配号码管理局（IANA）在处理与服务名称和传输协议端口号注册表相关的分配和其他请求时使用的程序。”"
    },
    {
      "indent": 3,
      "text": "RFC 6994 S: \"Shared Use of Experimental TCP Options (August 2013)",
      "zh-CHS": "RFC 6994 S：“实验性TCP选项的共享使用（2013年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6994] describes how the experimental TCP option code points can concurrently support multiple TCP extensions, even within the same connection. It creates an IANA registry for extensions to the experimental code points.",
      "zh-CHS": "本文档[RFC6994]描述了实验性TCP选项代码点如何能够同时支持多个TCP扩展，即使在同一连接中也是如此。它为实验代码点的扩展创建了一个IANA注册表。"
    },
    {
      "indent": 0,
      "text": "6. Historic and Undeployed Extensions",
      "section_title": true,
      "zh-CHS": "6. 历史和未部署的扩展"
    },
    {
      "indent": 3,
      "text": "The RFCs listed here define extensions that have thus far failed to arouse substantial interest from implementers and have never seen widespread deployment or were found to be defective for general use. Most of them were reclassified by [RFC6247] to Historic status.",
      "zh-CHS": "这里列出的RFC定义了一些扩展，这些扩展到目前为止未能引起实现者的极大兴趣，并且从未见过广泛的部署，或者在一般使用中被发现有缺陷。其中大多数被[RFC6247]重新归类为历史地位。"
    },
    {
      "indent": 3,
      "text": "RFC 721 U: \"Out-of-Band Control Signals in a Host-to-Host Protocol\" (September 1976): lack of interest",
      "zh-CHS": "RFC 721 U：“主机对主机协议中的带外控制信号”（1976年9月）：缺乏兴趣"
    },
    {
      "indent": 6,
      "text": "RFC 721 [RFC721] addresses the problem of implementing a reliable out-of-band signal (interrupts) for use in a host-to-host protocol. The proposal was not included in the final TCP specification.",
      "zh-CHS": "RFC 721[RFC721]解决了在主机对主机协议中实现可靠带外信号（中断）的问题。该提案未包含在最终TCP规范中。"
    },
    {
      "indent": 3,
      "text": "RFC 1078 U: \"TCP Port Service Multiplexer (TCPMUX)\" (November 1988): lack of interest",
      "zh-CHS": "RFC1078U：“TCP端口服务多路复用器（TCPMUX）”（1988年11月）：缺乏兴趣"
    },
    {
      "indent": 6,
      "text": "This document [RFC1078] proposes a protocol to contact multiple services on a single well-known TCP port using a service name instead of a well-known number.",
      "zh-CHS": "本文档[RFC1078]提出了一种协议，使用服务名称而不是已知号码在单个已知TCP端口上联系多个服务。"
    },
    {
      "indent": 3,
      "text": "RFC 1106 H: \"TCP Big Window and Nak Options\" (June 1989): found defective",
      "zh-CHS": "RFC 1106 H：“TCP大窗口和Nak选项”（1989年6月）：发现有缺陷"
    },
    {
      "indent": 6,
      "text": "This RFC [RFC1106] defined an alternative to the Window Scale option for using large windows and described the \"negative acknowledgment\" or NAK option. There is a comparison of NAK and SACK methods and early discussion of TCP over satellite issues. RFC 1110 (see below in Section 6) explains some problems with the approaches described in RFC 1106. The options described in this document have not been adopted by the larger community, although NAKs are used in the SCPS-TP adaptation of TCP for satellite and spacecraft use, developed by the Consultative Committee for Space Data Systems (CCSDS).",
      "zh-CHS": "该RFC[RFC1106]定义了使用大窗口的窗口缩放选项的替代方案，并描述了“否定确认”或NAK选项。对NAK和SACK方法进行了比较，并对卫星TCP问题进行了早期讨论。RFC 1110（见下文第6节）解释了RFC 1106中所述方法的一些问题。本文件中描述的选项尚未被较大的社区采用，尽管NAK用于空间数据系统协商委员会（CCSDS）开发的卫星和航天器使用TCP的SCPS-TP适配。"
    },
    {
      "indent": 3,
      "text": "RFC 1110 H: \"A Problem with the TCP Big Window Option\" (August 1989): deprecates RFC 1106",
      "zh-CHS": "RFC 1110 H：“TCP大窗口选项的问题”（1989年8月）：反对RFC 1106"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 1110 [RFC1110]: \"The TCP Big Window option discussed in RFC 1106 will not work properly in an Internet environment which has both a high bandwidth * delay product and the possibility of disordering and duplicating packets. In such networks, the window size must not be increased without a similar increase in the sequence number space. Therefore, a different approach to big windows should be taken in the Internet.\"",
      "zh-CHS": "RFC 1110[RFC1110]摘要：“RFC 1106中讨论的TCP大窗口选项在既有高带宽*延迟产品又有扰乱和复制数据包的可能性的互联网环境中无法正常工作。在这种网络中，如果序列号空间没有类似的增加，则窗口大小不得增加。因此，应在互联网上采取不同的方法来打开大窗口。”"
    },
    {
      "indent": 3,
      "text": "RFC 1146 H: \"TCP Alternate Checksum Options\" (March 1990): lack of interest",
      "zh-CHS": "RFC 1146 H：“TCP备用校验和选项”（1990年3月）：缺乏兴趣"
    },
    {
      "indent": 6,
      "text": "This document [RFC1146] defined more robust TCP checksums than the 16-bit ones-complement in use today. A typographical error in RFC 1145 is fixed in RFC 1146; otherwise, the documents are the same.",
      "zh-CHS": "本文档[RFC1146]定义了比目前使用的16位校验和更健壮的TCP校验和。RFC 1146修复了RFC 1145中的印刷错误；否则，文件是相同的。"
    },
    {
      "indent": 3,
      "text": "RFC 1263 I: \"TCP Extensions Considered Harmful\" (October 1991): lack of interest",
      "zh-CHS": "RFC 1263 I：“TCP扩展被认为是有害的”（1991年10月）：缺乏兴趣"
    },
    {
      "indent": 6,
      "text": "This document [RFC1263] argues against \"backwards compatible\" TCP extensions. Specifically mentioned are several TCP enhancements that have been successful, including timestamps, window scaling, PAWS, and SACK. RFC 1263 presents an alternative approach called \"protocol evolution\", whereby several evolutionary versions of TCP would exist on hosts. These distinct TCP versions would represent upgrades to each other and could be header incompatible. Interoperability would be provided by having a virtualization layer select the right TCP version for a particular connection. This idea did not catch on with the community, while the type of extensions RFC 1263 specifically targeted as harmful did become popular.",
      "zh-CHS": "本文档[RFC1263]反对“向后兼容”的TCP扩展。特别提到了几个已经成功的TCP增强，包括时间戳、窗口缩放、PAWS和SACK。RFC1263提出了一种称为“协议进化”的替代方法，即在主机上存在TCP的几个进化版本。这些不同的TCP版本将代表彼此的升级，并且可能不兼容。通过让虚拟化层为特定连接选择正确的TCP版本，可以提供互操作性。这个想法并没有在社区中流行起来，而专门针对有害的RFC1263扩展类型却变得流行起来。"
    },
    {
      "indent": 3,
      "text": "RFC 1379 H: \"Extending TCP for Transactions -- Concepts\" (November 1992): found defective",
      "zh-CHS": "RFC1379H：“为事务扩展TCP——概念”（1992年11月）：发现有缺陷"
    },
    {
      "indent": 6,
      "text": "See RFC 1644, in Section 6 below.",
      "zh-CHS": "见下文第6节RFC 1644。"
    },
    {
      "indent": 3,
      "text": "RFC 1644 H: \"T/TCP -- TCP Extensions for Transactions Functional\n            Specification\" (July 1994): found defective",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "The inventors of TCP believed that cached connection state could have been used to eliminate TCP's three-way handshake, to support two-packet request/response exchanges. RFC 1379 [RFC1379] (see above in Section 6) and RFC 1644 [RFC1644] show that this is far from simple. Furthermore, T/TCP floundered on the ease of denial-of-service attacks that can result. One idea pioneered by T/TCP lives on in RFC 2140 (see Section 4.1 of this document), in the sharing of state across connections.",
      "zh-CHS": "TCP的发明者认为缓存连接状态可以用来消除TCP的三方握手，以支持两个数据包请求/响应交换。RFC 1379[RFC1379]（见上文第6节）和RFC 1644[RFC1644]表明，这远远不简单。此外，T/TCP在可能导致的拒绝服务攻击的易受性上苦苦挣扎。T/TCP开创的一个想法存在于RFC 2140中（见本文件第4.1节），即跨连接共享状态。"
    },
    {
      "indent": 3,
      "text": "RFC 1693 H: \"An Extension to TCP: Partial Order Service\" (November 1994): lack of interest",
      "zh-CHS": "RFC 1693 H：“TCP的扩展：部分订购服务”（1994年11月）：缺乏兴趣"
    },
    {
      "indent": 6,
      "text": "This document [RFC1693] defines a TCP extension for applications that do not care about the order in which application-layer objects are received. Examples are multimedia and database applications. In practice, these applications either accept the possible performance loss because of TCP's strict ordering or use specialized transport protocols other than TCP, such as PR-SCTP [RFC3758].",
      "zh-CHS": "本文档[RFC1693]为不关心应用层对象接收顺序的应用程序定义了TCP扩展。例如多媒体和数据库应用程序。在实践中，这些应用程序要么接受由于TCP的严格排序而可能造成的性能损失，要么使用TCP以外的专用传输协议，如PR-SCTP[RFC3758]。"
    },
    {
      "indent": 3,
      "text": "RFC 1705 I: \"Six Virtual Inches to the Left: The Problem with IPng\" (October 1994): lack of interest",
      "zh-CHS": "RFC 1705 I：“左六虚拟英寸：IPng的问题”（1994年10月）：缺乏兴趣"
    },
    {
      "indent": 6,
      "text": "To overcome the exhaustion of the IP class B address space, this document [RFC1705] suggests that a new version of TCP (TCPng) needs to be developed and deployed. It proposes that a globally unique address be assigned to the transport layer to uniquely identify an Internet host without specifying any routing information. Later work on splitting locator and identifier values is summarized well in [RFC6115], but no resulting changes to TCP have occurred.",
      "zh-CHS": "为了克服IP B类地址空间耗尽的问题，本文档[RFC1705]建议开发和部署新版本的TCP（TCPng）。它建议将一个全局唯一地址分配给传输层，以便在不指定任何路由信息的情况下唯一地标识Internet主机。[RFC6115]中对拆分定位器和标识符值的后续工作进行了总结，但没有对TCP进行任何更改。"
    },
    {
      "indent": 3,
      "text": "RFC 6013 E: \"TCP Cookie Transactions (TCPCT)\" (January 2011): lack of interest",
      "zh-CHS": "RFC 6013 E：“TCP Cookie事务（TCPCT）”（2011年1月）：缺乏兴趣"
    },
    {
      "indent": 6,
      "text": "This document [RFC6013] describes a method to exchange a cookie (nonce) during the connection establishment to negotiate elimination of receiver state. These cookies are later used to inhibit premature closing of connections and reduce retention of state after the connection has terminated.",
      "zh-CHS": "本文档[RFC6013]描述了一种在建立连接期间交换cookie（nonce）以协商消除接收方状态的方法。这些cookie稍后用于禁止过早关闭连接，并减少连接终止后的状态保留。"
    },
    {
      "indent": 6,
      "text": "Since the cookie pair is too large to fit with the other TCP options in the 40 bytes of TCP option space, the document further describes a method to extent the option space after the connection establishment.",
      "zh-CHS": "由于cookie对太大，无法与40字节TCP选项空间中的其他TCP选项匹配，因此本文档进一步描述了在建立连接后扩展选项空间的方法。"
    },
    {
      "indent": 6,
      "text": "Although RFC 6013 was published in 2011, the authors of this document places it in this section of the roadmap document due to two factors.",
      "zh-CHS": "尽管RFC 6013于2011年发布，但由于两个因素，本文件的作者将其放在路线图文件的本节中。"
    },
    {
      "indent": 6,
      "text": "(a) The authors are not aware of any wide deployment and use of RFC 6013. (b) RFC 6013 uses experimental TCP option code points, which prohibits a large-scale deployment.",
      "zh-CHS": "(a) 作者不知道RFC6013有任何广泛的部署和使用。（b） RFC6013使用实验性TCP选项代码点，这禁止大规模部署。"
    },
    {
      "indent": 0,
      "text": "7. Support Documents",
      "section_title": true,
      "zh-CHS": "7. 支持文件"
    },
    {
      "indent": 3,
      "text": "This section contains several classes of documents that do not necessarily define current protocol behaviors but that are nevertheless of interest to TCP implementers. Section 7.1 describes several foundational RFCs that give modern readers a better understanding of the principles underlying TCP's behaviors and development over the years. Section 7.2 contains architectural guidelines and principles for TCP architects and designers. The documents listed in Section 7.3 provide advice on using TCP in various types of network situations that pose challenges above those of typical wired links. Guidance for developing, analyzing, and evaluating TCP is given in Section 7.4. Some implementation notes and implementation advice can be found in Section 7.5. RFCs that describe tools for testing and debugging TCP implementations or that contain high-level tutorials on the protocol are listed Section 7.6. The TCP Management Information Bases are described in Section 7.7, and Section 7.8 lists a number of case studies that have explored TCP performance.",
      "zh-CHS": "本节包含几类文档，这些文档不一定定义当前的协议行为，但是TCP实现者仍然感兴趣。第7.1节描述了几个基础RFC，这些RFC使现代读者更好地理解TCP多年来行为和发展的基本原则。第7.2节包含TCP架构师和设计师的架构指南和原则。第7.3节中列出的文件提供了在各种网络情况下使用TCP的建议，这些网络情况比典型的有线链路更具挑战性。第7.4节给出了开发、分析和评估TCP的指南。第7.5节提供了一些实施说明和实施建议。第7.6节列出了描述测试和调试TCP实现的工具或包含协议高级教程的RFC。第7.7节介绍了TCP管理信息库，第7.8节列出了一些探索TCP性能的案例研究。"
    },
    {
      "indent": 0,
      "text": "7.1. Foundational Works",
      "section_title": true,
      "zh-CHS": "7.1. 基础工作"
    },
    {
      "indent": 3,
      "text": "The documents listed in this section contain information that is largely duplicated by the standards documents previously discussed. However, some of them contain a greater depth of problem statement explanation or other context. Particularly, RFCs 813 - 817 (known as the \"Dave Clark Five\") describe some early problems and solutions (RFC 815 only describes the reassembly of IP fragments and is not included in this TCP roadmap).",
      "zh-CHS": "本节中列出的文件包含的信息与前面讨论的标准文件在很大程度上是重复的。然而，其中一些包含更深入的问题陈述解释或其他上下文。特别是，RFC813-817（被称为“DaveClarkFive”）描述了一些早期问题和解决方案（RFC815仅描述了IP片段的重新组装，不包括在TCP路线图中）。"
    },
    {
      "indent": 3,
      "text": "RFC 675 U: \"Specification of Internet Transmission Control Program\" (December 1974)",
      "zh-CHS": "RFC 675 U：“互联网传输控制程序规范”（1974年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC675] is a very early precursor of the fundamental RFC 793 (see Section 2 of this document), which already contained the three-way handshake in its final form and the concept of sliding windows for reliable data transmission. Apart from that, the segment layout is totally different and the specified API differs from the latter RFC 793 (see Section 2 of this document).",
      "zh-CHS": "本文件[RFC675]是基本RFC 793（见本文件第2节）的早期前身，其中已包含最终形式的三向握手和用于可靠数据传输的滑动窗口概念。除此之外，段布局完全不同，指定的API不同于后者RFC 793（见本文件第2节）。"
    },
    {
      "indent": 3,
      "text": "RFC 761 U: \"DoD Standard Transmission Control Protocol\" (January 1980)",
      "zh-CHS": "RFC 761 U：“国防部标准传输控制协议”（1980年1月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC761] is the immediate precursor of RFC 793 (see Section 2 of this document). The header format, the connection establishment (including the different connection states), and the overall API correspond mostly to the final Standard RFC 793 (see Section 2 of this document).",
      "zh-CHS": "本文件[RFC761]是RFC 793的直接前身（见本文件第2节）。标头格式、连接建立（包括不同的连接状态）和总体API主要对应于最终标准RFC 793（参见本文档第2节）。"
    },
    {
      "indent": 3,
      "text": "RFC 813 U: \"Window and Acknowledgement Strategy in TCP\" (July 1982)",
      "zh-CHS": "RFC813U：“TCP中的窗口和确认策略”（1982年7月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC813] contains an early discussion of Silly Window Syndrome and its avoidance and motivates and describes the use of delayed acknowledgments.",
      "zh-CHS": "本文件[RFC813]包含关于傻窗综合征及其避免、激励和描述延迟确认使用的早期讨论。"
    },
    {
      "indent": 3,
      "text": "RFC 814 U: \"Name, Addresses, Ports, and Routes\" (July 1982)",
      "zh-CHS": "RFC814U：“名称、地址、港口和航线”（1982年7月）"
    },
    {
      "indent": 6,
      "text": "Suggestions and guidance for the design of tables and algorithms to keep track of various identifiers within a TCP/IP implementation are provided by this document [RFC814].",
      "zh-CHS": "本文件[RFC814]提供了关于表和算法设计的建议和指导，以跟踪TCP/IP实现中的各种标识符。"
    },
    {
      "indent": 3,
      "text": "RFC 816 U: \"Fault Isolation and Recovery\" (July 1982)",
      "zh-CHS": "RFC 816 U：“故障隔离和恢复”（1982年7月）"
    },
    {
      "indent": 6,
      "text": "In this document [RFC816], TCP's response to indications of network error conditions such as timeouts or received ICMP messages is discussed.",
      "zh-CHS": "在本文件[RFC816]中，讨论了TCP对网络错误条件指示的响应，如超时或接收到的ICMP消息。"
    },
    {
      "indent": 3,
      "text": "RFC 817 U: \"Modularity and Efficiency in Protocol Implementation\" (July 1982)",
      "zh-CHS": "RFC817U：“协议实施中的模块化和效率”（1982年7月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC817] contains implementation suggestions that are general and not TCP specific. However, they have been used to develop TCP implementations and describe some performance implications of the interactions between various layers in the Internet stack.",
      "zh-CHS": "本文档[RFC817]包含一般性而非特定于TCP的实施建议。然而，它们已被用于开发TCP实现，并描述Internet堆栈中不同层之间交互的一些性能影响。"
    },
    {
      "indent": 3,
      "text": "RFC 872 U: \"TCP-on-a-LAN\" (September 1982)",
      "zh-CHS": "RFC 872 U：“TCP-on-a-LAN”（1982年9月）"
    },
    {
      "indent": 6,
      "text": "Conclusion of RFC 872 [RFC872]: \"The sometimes-expressed fear that using TCP on a local net is a bad idea is unfounded.\"",
      "zh-CHS": "RFC872的结论[RFC872]：“有时表示担心在本地网络上使用TCP是个坏主意是没有根据的。”"
    },
    {
      "indent": 3,
      "text": "RFC 896 U: \"Congestion Control in IP/TCP Internetworks\" (January 1984)",
      "zh-CHS": "RFC896U：“IP/TCP网络中的拥塞控制”（1984年1月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC896] contains some early experiences with congestion collapse and some initial thoughts on how to avoid it using congestion control in TCP. Furthermore, it defined an algorithm for efficient transmission of small packets that is today known as the Nagle algorithm.",
      "zh-CHS": "本文档[RFC896]包含了一些早期的拥塞崩溃经验，以及一些关于如何在TCP中使用拥塞控制避免拥塞崩溃的初步想法。此外，它还定义了一种高效传输小数据包的算法，即今天所称的Nagle算法。"
    },
    {
      "indent": 3,
      "text": "RFC 964 U: \"Some Problems with the Specification of the Military Standard Transmission Control Protocol\" (November 1985)",
      "zh-CHS": "RFC 964 U：“军用标准传输控制协议规范的一些问题”（1985年11月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC964] points out several specification bugs in the US Military's MIL-STD-1778 document, which was intended as a successor to RFC 793 (see Section 2 of this document). This serves to remind us of the difficulty in specification writing (even when we work from existing documents!).",
      "zh-CHS": "本文件[RFC964]指出了美军MIL-STD-1778文件中的几个规范缺陷，该文件旨在作为RFC 793的后续文件（见本文件第2节）。这提醒了我们编写规范的困难（即使我们是从现有文档开始工作的！）。"
    },
    {
      "indent": 0,
      "text": "7.2. Architectural Guidelines",
      "section_title": true,
      "zh-CHS": "7.2. 建筑指南"
    },
    {
      "indent": 3,
      "text": "Some documents in this section contain architectural guidance and concerns, while others specify TCP- and congestion-control-related mechanisms that are broadly applicable and have impacts on TCP's congestion control techniques. Some of these documents are direct products of the Internet Architecture Board (IAB) giving their guidance on specific aspects of congestion control in the Internet.",
      "zh-CHS": "本节中的一些文档包含架构指导和关注点，而其他文档则指定了广泛适用的TCP和拥塞控制相关机制，并对TCP的拥塞控制技术产生影响。其中一些文件是互联网体系结构委员会（IAB）的直接产品，为互联网拥塞控制的具体方面提供指导。"
    },
    {
      "indent": 3,
      "text": "RFC 1958 I: \"Architectural Principles of the Internet\" (June 1996)",
      "zh-CHS": "RFC 1958 I：“互联网的架构原则”（1996年6月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1958] describes the underlying principles of the Internet architecture. It provides guidelines for network systems designs that have proven useful in the evolution of the Internet.",
      "zh-CHS": "本文件[RFC1958]描述了互联网体系结构的基本原理。它为网络系统设计提供了指南，这些设计在互联网的发展中被证明是有用的。"
    },
    {
      "indent": 3,
      "text": "RFC 2914 B: \"Congestion Control Principles\" (September 2000)",
      "zh-CHS": "RFC 2914 B：“拥塞控制原则”（2000年9月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2914] motivates the use of end-to-end congestion control for preventing congestion collapse and providing fairness to TCP. Later work on TCP has included several more aggressive mechanisms than Reno TCP includes, and RFC 5033 (see Section 7.4 of this document) provides additional guidance on use of such algorithms. The fundamental architectural discussion in RFC 2914 remains valid, regarding the standards process role in defining protocol aspects that are critical to performance and avoiding congestion collapse scenarios.",
      "zh-CHS": "本文档[RFC2914]鼓励使用端到端拥塞控制来防止拥塞崩溃并为TCP提供公平性。后来关于TCP的工作包括了几个比雷诺TCP更具攻击性的机制，RFC 5033（见本文件第7.4节）提供了使用此类算法的额外指导。RFC 2914中关于标准流程在定义对性能至关重要的协议方面的作用和避免拥塞崩溃场景的基本架构讨论仍然有效。"
    },
    {
      "indent": 3,
      "text": "RFC 3360 B: \"Inappropriate TCP Resets Considered Harmful\" (August 2002)",
      "zh-CHS": "RFC 3360 B：“不适当的TCP重置被认为是有害的”（2002年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3360] is a plea that firewall vendors not send gratuitous TCP RST (Reset) packets when unassigned TCP header bits are used. This practice prevents desirable extension and evolution of the protocol and thus is potentially harmful to the future of the Internet.",
      "zh-CHS": "本文件[RFC3360]呼吁防火墙供应商在使用未分配的TCP头位时不要发送免费的TCP RST（重置）数据包。这种做法妨碍了协议的理想扩展和演变，因此可能对互联网的未来有害。"
    },
    {
      "indent": 3,
      "text": "RFC 3439 I: \"Some Internet Architectural Guidelines and Philosophy\" (December 2002)",
      "zh-CHS": "RFC 3439 I：“一些互联网架构指南和理念”（2002年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3439] updates RFC 1958 (see above in Section 7.2) by outlining some philosophical guidelines for architects and designers of Internet backbone networks. The document describes the Simplicity Principle, which states that complexity is the primary impediment to efficient scaling.",
      "zh-CHS": "本文件[RFC3439]更新了RFC 1958（见上文第7.2节），概述了互联网骨干网络架构师和设计师的一些哲学指导原则。该文档描述了简单性原则，该原则指出复杂性是有效扩展的主要障碍。"
    },
    {
      "indent": 3,
      "text": "RFC 4774 B: \"Specifying Alternate Semantics for the Explicit Congestion Notification (ECN) Field\" (November 2006)",
      "zh-CHS": "RFC 4774 B：“为显式拥塞通知（ECN）字段指定替代语义”（2006年11月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4774] discusses some of the issues in defining alternate semantics for the ECN field and specifies requirements for a safe coexistence with routers that do not understand the defined alternate semantics.",
      "zh-CHS": "本文件[RFC4774]讨论了为ECN字段定义替代语义时的一些问题，并规定了与不理解已定义替代语义的路由器安全共存的要求。"
    },
    {
      "indent": 3,
      "text": "RFC 6182 I: \"Architectural Guidelines for Multipath TCP Development\" (March 2011)",
      "zh-CHS": "RFC 6182 I：“多路径TCP开发的体系结构指南”（2011年3月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 6182 [RFC6182]: \"This document outlines architectural guidelines for the development of a Multipath Transport Protocol, with references to how these architectural components come together in the development of a Multipath TCP (MPTCP) (see Section 4.7 of this document). This document lists certain high-level design decisions that provide foundations for the design of the MPTCP protocol, based upon these architectural requirements\"",
      "zh-CHS": "RFC 6182[RFC6182]摘要：“本文件概述了开发多路径传输协议的体系结构指南，并参考了在开发多路径TCP（MPTCP）过程中这些体系结构组件是如何结合在一起的（见本文件第4.7节）.本文件列出了某些高层设计决策，这些决策根据这些体系结构要求为MPTCP协议的设计提供了基础。”"
    },
    {
      "indent": 0,
      "text": "7.3. Difficult Network Environments",
      "section_title": true,
      "zh-CHS": "7.3. 困难的网络环境"
    },
    {
      "indent": 3,
      "text": "As the internetworking field has explored wireless, satellite, cellular telephone, and other kinds of link-layer technologies, a large body of work has built up on enhancing TCP performance for such links. The RFCs listed in this section describe some of these more challenging network environments and how TCP interacts with them.",
      "zh-CHS": "随着互联网领域对无线、卫星、蜂窝电话和其他类型的链路层技术的探索，大量工作都集中在提高此类链路的TCP性能上。本节中列出的RFC描述了其中一些更具挑战性的网络环境，以及TCP如何与它们交互。"
    },
    {
      "indent": 3,
      "text": "RFC 2488 B: \"Enhancing TCP Over Satellite Channels using Standard Mechanisms\" (January 1999)",
      "zh-CHS": "RFC 2488 B：“使用标准机制增强卫星信道上的TCP”（1999年1月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 2488 [RFC2488]: \"While TCP works over satellite channels there are several IETF standardized mechanisms that enable TCP to more effectively utilize the available capacity of the network path. This document outlines some of these TCP mitigations. At this time, all mitigations discussed in this document are IETF standards track mechanisms (or are compliant with IETF standards).\"",
      "zh-CHS": "根据RFC 2488[RFC2488]的摘要：“虽然TCP在卫星信道上工作，但有几种IETF标准化机制使TCP能够更有效地利用网络路径的可用容量。本文档概述了其中一些TCP缓解措施。目前，本文件中讨论的所有缓解措施均为IETF标准跟踪机制（或符合IETF标准）。”"
    },
    {
      "indent": 3,
      "text": "RFC 2757 I: \"Long Thin Networks\" (January 2000)",
      "zh-CHS": "RFC 2757 I：“长瘦网络”（2000年1月）"
    },
    {
      "indent": 6,
      "text": "Several methods of improving TCP performance over long thin networks (i.e., networks with low bandwidth and high delay), such as geosynchronous satellite links, are discussed in this document [RFC2757]. A particular set of TCP options is developed that should work well in such environments and be safe to use in the global Internet. The implications of such environments have been further discussed in RFCs 3150 and 3155 (see below in Section 7.3), and these documents should be preferred where there is overlap between them and RFC 2757 (see Section 7.3 of this document).",
      "zh-CHS": "本文件[RFC2757]讨论了在长瘦网络（即低带宽和高延迟的网络）上提高TCP性能的几种方法，如地球同步卫星链路。开发了一组特定的TCP选项，这些选项应能在此类环境中正常工作，并可在全球互联网中安全使用。RFC 3150和3155（见下文第7.3节）进一步讨论了此类环境的影响，如果这些文件与RFC 2757（见本文件第7.3节）之间存在重叠，则应首选这些文件。"
    },
    {
      "indent": 3,
      "text": "RFC 2760 I: \"Ongoing TCP Research Related to Satellites\" (February 2000)",
      "zh-CHS": "RFC 2760 I：“正在进行的与卫星有关的TCP研究”（2000年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2760] discusses the advantages and disadvantages of several different experimental means of improving TCP performance over long-delay or error-prone paths. These include T/TCP, larger initial windows, byte counting, delayed acknowledgments, slow start thresholds, NewReno and SACK-based loss recovery, FACK [MM96], ECN, various corruption-detection mechanisms, congestion avoidance changes for fairness, use of multiple parallel flows, pacing, header compression, state sharing, and ACK congestion control, filtering, and reconstruction. Although RFC 2488 (see above in Section 7.3) looks at standard extensions, this document focuses on more experimental means of performance enhancement.",
      "zh-CHS": "本文[RFC2760]讨论了在长延迟或易出错路径上改善TCP性能的几种不同实验方法的优缺点。这些包括T/TCP、较大的初始窗口、字节计数、延迟确认、慢启动阈值、基于NewReno和SACK的丢失恢复、FACK[MM96]、ECN、各种损坏检测机制、公平性拥塞避免更改、使用多个并行流、调速、报头压缩、状态共享和ACK拥塞控制，滤波和重建。尽管RFC2488（见上文第7.3节）介绍了标准扩展，但本文重点介绍了性能增强的更多实验手段。"
    },
    {
      "indent": 3,
      "text": "RFC 3135 I: \"Performance Enhancing Proxies Intended to Mitigate Link-Related Degradations\" (June 2001)",
      "zh-CHS": "RFC 3135 I：“旨在缓解链路相关降级的性能增强代理”（2001年6月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 3135 [RFC3135]: \"This document is a survey of Performance Enhancing Proxies (PEPs) often employed to improve degraded TCP performance caused by characteristics of specific link environments, for example, in satellite, wireless",
      "zh-CHS": "来自RFC 3135[RFC3135]的摘要：“本文档是对性能增强代理（PEP）的调查，通常用于改善因特定链路环境（例如卫星、无线网络）的特性而导致的TCP性能下降"
    },
    {
      "indent": 6,
      "text": "WAN, and wireless LAN environments. Different types of Performance Enhancing Proxies are described as well as the mechanisms used to improve performance.\"",
      "zh-CHS": "广域网和无线局域网环境。描述了不同类型的性能增强代理以及用于提高性能的机制。”"
    },
    {
      "indent": 3,
      "text": "RFC 3150 B: \"End-to-end Performance Implications of Slow Links\" (July 2001)",
      "zh-CHS": "RFC 3150 B：“慢链路的端到端性能影响”（2001年7月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 3150 [RFC3150]: \"This document makes\nperformance-related recommendations for users of network paths\nthat traverse \"very low bit-rate\" links....This recommendation may\nbe useful in any network where hosts can saturate available\nbandwidth, but the design space for this recommendation explicitly\nincludes connections that traverse 56 Kb/second modem links or 4.8\nKb/second wireless access links - both of which are widely\ndeployed.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "RFC 3155 B: \"End-to-end Performance Implications of Links with Errors\" (August 2001)",
      "zh-CHS": "RFC 3155 B：“有错误链接的端到端性能影响”（2001年8月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 3155 [RFC3155]: \"This document discusses the specific TCP mechanisms that are problematic in environments with high uncorrected error rates, and discusses what can be done to mitigate the problems without introducing intermediate devices into the connection.\"",
      "zh-CHS": "来自RFC 3155[RFC3155]的摘要：“本文档讨论了在高未纠正错误率环境中存在问题的特定TCP机制，并讨论了在不将中间设备引入连接的情况下可以采取哪些措施来缓解问题。”"
    },
    {
      "indent": 3,
      "text": "RFC 3366 B: \"Advice to link designers on link Automatic Repeat reQuest (ARQ)\" (August 2002)",
      "zh-CHS": "RFC 3366 B：“关于链路自动重复请求（ARQ）的链路设计者建议”（2002年8月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 3366 [RFC3366]: \"This document provides advice to the designers of digital communication equipment and link-layer protocols employing link-layer Automatic Repeat reQuest (ARQ) techniques. This document presumes that the designers wish to support Internet protocols, but may be unfamiliar with the architecture of the Internet and with the implications of their design choices for the performance and efficiency of Internet traffic carried over their links.\"",
      "zh-CHS": "来自RFC 3366[RFC3366]的摘要：“本文件为采用链路层自动重复请求（ARQ）的数字通信设备和链路层协议的设计者提供建议技术。本文件假定设计人员希望支持互联网协议，但可能不熟悉互联网的体系结构及其设计选择对通过其链接传输的互联网流量的性能和效率的影响。”"
    },
    {
      "indent": 3,
      "text": "RFC 3449 B: \"TCP Performance Implications of Network Path Asymmetry\" (December 2002)",
      "zh-CHS": "RFC 3449 B：“网络路径不对称对TCP性能的影响”（2002年12月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 3449 [RFC3449]: \"This document describes TCP performance problems that arise because of asymmetric effects. These problems arise in several access networks, including bandwidth-asymmetric networks and packet radio subnetworks, for different underlying reasons. However, the end result on TCP performance is the same in both cases: performance often degrades significantly because of imperfection and variability in the ACK feedback from the receiver to the sender.",
      "zh-CHS": "根据RFC 3449[RFC3449]的摘要：“本文档描述了由于不对称效应而产生的TCP性能问题。由于不同的根本原因，这些问题出现在几种接入网络中，包括带宽不对称网络和分组无线电子网。然而，在这两种情况下，TCP性能的最终结果是相同的：由于从接收方到发送方的ACK反馈的不完善性和可变性，性能通常会显著下降。"
    },
    {
      "indent": 6,
      "text": "The document details several mitigations to these effects, which have either been proposed or evaluated in the literature, or are currently deployed in networks.",
      "zh-CHS": "该文件详细说明了针对这些影响的几种缓解措施，这些措施已在文献中提出或评估，或目前已部署在网络中。"
    },
    {
      "indent": 3,
      "text": "RFC 3481 B: \"TCP over Second (2.5G) and Third (3G) Generation Wireless Networks\" (February 2003)",
      "zh-CHS": "RFC 3481 B：“第二代（2.5G）和第三代（3G）无线网络上的TCP”（2003年2月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 3481 [RFC3481]: \"This document describes a profile for optimizing TCP to adapt so that it handles paths including second (2.5G) and third (3G) generation wireless networks.\"",
      "zh-CHS": "来自RFC 3481[RFC3481]的摘要：“本文档描述了优化TCP以适应的配置文件，以便它处理包括第二代（2.5G）和第三代（3G）无线网络在内的路径。”"
    },
    {
      "indent": 3,
      "text": "RFC 3819 B: \"Advice for Internet Subnetwork Designers\" (July 2004)",
      "zh-CHS": "RFC 3819 B：“互联网子网设计者的建议”（2004年7月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3819] describes how TCP performance can be negatively affected by some particular lower-layer behaviors and provides guidance in designing lower-layer networks and protocols to be amicable to TCP. RFC 3366 (see above in Section 7.3) specifically focuses on ARQ mechanisms, while RFC 3819 more widely covers additional aspects of the underlying layers",
      "zh-CHS": "本文档[RFC3819]描述了某些特定的低层行为如何对TCP性能产生负面影响，并为设计与TCP友好的低层网络和协议提供了指导。RFC 3366（见上文第7.3节）特别关注ARQ机制，而RFC 3819更广泛地涵盖了底层的其他方面"
    },
    {
      "indent": 0,
      "text": "7.4. Guidance for Developing, Analyzing, and Evaluating TCP",
      "section_title": true,
      "zh-CHS": "7.4. 开发、分析和评估TCP的指南"
    },
    {
      "indent": 3,
      "text": "Documents in this section give general guidance for developing, analyzing, and evaluating TCP. Some of the documents discuss, for example, the properties of congestion control protocols that are \"safe\" for Internet deployment as well as how to measure the properties of congestion control mechanisms and transport protocols.",
      "zh-CHS": "本节中的文档为开发、分析和评估TCP提供了一般指导。例如，一些文档讨论了对于Internet部署来说“安全”的拥塞控制协议的属性，以及如何度量拥塞控制机制和传输协议的属性。"
    },
    {
      "indent": 3,
      "text": "RFC 5033 B: \"Specifying New Congestion Control Algorithms\" (August 2007)",
      "zh-CHS": "RFC 5033 B：“指定新的拥塞控制算法”（2007年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5033] considers the evaluation of suggested congestion control algorithms that differ from the principles outlined in RFC 2914 (see Section 7.2 of this document). It is useful for authors of such algorithms as well as for IETF members reviewing the associated documents.",
      "zh-CHS": "本文件[RFC5033]考虑了与RFC 2914中概述的原则不同的建议拥塞控制算法的评估（见本文件第7.2节）。它对于此类算法的作者以及IETF成员审查相关文档都很有用。"
    },
    {
      "indent": 3,
      "text": "RFC 5166 I: \"Metrics for the Evaluation of Congestion Control Mechanisms\" (March 2008)",
      "zh-CHS": "RFC 5166 I：“拥塞控制机制评估指标”（2008年3月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5166] discusses metrics that need to be considered when evaluating new or modified congestion control mechanisms for the Internet. Among other topics, the document discusses throughput, delay, loss rates, response times, fairness, and robustness for challenging environments.",
      "zh-CHS": "本文件[RFC5166]讨论了在评估新的或改进的互联网拥塞控制机制时需要考虑的指标。除其他主题外，本文档还讨论了吞吐量、延迟、丢失率、响应时间、公平性以及在具有挑战性的环境中的健壮性。"
    },
    {
      "indent": 3,
      "text": "RFC 6077 I: \"Open Research Issues in Internet Congestion Control\" (February 2011)",
      "zh-CHS": "RFC 6077 I：“互联网拥塞控制的开放研究问题”（2011年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6077] summarizes the main open problems in the domain of Internet congestion control. As a good starting point for newcomers, the document describes several new challenges that are becoming important as the network grows, as well as some issues that have been known for many years.",
      "zh-CHS": "本文件[RFC6077]总结了互联网拥塞控制领域的主要开放问题。作为新来者的一个良好起点，该文件描述了随着网络的发展而变得越来越重要的几个新挑战，以及多年来已知的一些问题。"
    },
    {
      "indent": 3,
      "text": "RFC 6181 I: \"Threat Analysis for TCP Extensions for Multipath Operation with Multiple Addresses\" (March 2011)",
      "zh-CHS": "RFC 6181 I：“具有多个地址的多路径操作的TCP扩展的威胁分析”（2011年3月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6181] describes a threat analysis for Multipath TCP (MPTCP) (see Section 4.7 of this document). The document discusses several types of attacks and provides recommendations for MPTCP designers how to create an MPTCP specification that is as secure as the current (single-path) TCP.",
      "zh-CHS": "本文件[RFC6181]描述了多路径TCP（MPTCP）的威胁分析（见本文件第4.7节）。本文档讨论了几种类型的攻击，并为MPTCP设计人员提供了如何创建与当前（单路径）TCP一样安全的MPTCP规范的建议。"
    },
    {
      "indent": 3,
      "text": "RFC 6349 I: \"Framework for TCP Throughput Testing\" (August 2011)",
      "zh-CHS": "RFC 6349 I：“TCP吞吐量测试框架”（2011年8月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 6349 [RFC6349]: \"This framework describes a practical methodology for measuring end-to-end TCP Throughput in a managed IP network. The goal is to provide a better indication in regard to user experience. In this framework, TCP and IP parameters are specified to optimize TCP Throughput.\"",
      "zh-CHS": "来自RFC 6349[RFC6349]的摘要：“此框架描述了一种在托管IP网络中测量端到端TCP吞吐量的实用方法。其目标是在用户体验方面提供更好的指示。在此框架中，指定TCP和IP参数以优化TCP吞吐量。”"
    },
    {
      "indent": 0,
      "text": "7.5. Implementation Advice",
      "section_title": true,
      "zh-CHS": "7.5. 实施建议"
    },
    {
      "indent": 3,
      "text": "RFC 794 U: \"PRE-EMPTION\" (September 1981)",
      "zh-CHS": "RFC 794 U：“优先购买权”（1981年9月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC794] clarifies that operating systems need to manage their limited resources, which may include TCP connection state, and that these decisions can be made with application input, but they do not need to be part of the TCP protocol specification itself.",
      "zh-CHS": "本文档[RFC794]阐明了操作系统需要管理其有限的资源，其中可能包括TCP连接状态，并且这些决策可以通过应用程序输入来做出，但它们不需要成为TCP协议规范本身的一部分。"
    },
    {
      "indent": 3,
      "text": "RFC 879 U: \"The TCP Maximum Segment Size and Related Topics\" (November 1983)",
      "zh-CHS": "RFC 879 U：“TCP最大段大小和相关主题”（1983年11月）"
    },
    {
      "indent": 6,
      "text": "Abstract of RFC 879 [RFC879]: \"This memo discusses the TCP Maximum Segment Size Option and related topics. The purposes [sic] is to clarify some aspects of TCP and its interaction with IP. This memo is a clarification to the TCP specification, and contains information that may be considered as 'advice to implementers'.\"",
      "zh-CHS": "RFC 879的摘要[RFC879]：“本备忘录讨论TCP最大段大小选项和相关主题。目的[sic]是澄清TCP的某些方面及其与IP的交互。本备忘录是对TCP规范的澄清，并包含可能被视为“对实施者的建议”的信息。”"
    },
    {
      "indent": 3,
      "text": "RFC 1071 U: \"Computing the Internet Checksum\" (September 1988) (Errata)",
      "zh-CHS": "RFC 1071 U：“计算互联网校验和”（1988年9月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1071] lists a number of implementation techniques for efficiently computing the Internet checksum (used by TCP).",
      "zh-CHS": "本文档[RFC1071]列出了一些有效计算互联网校验和（TCP使用）的实现技术。"
    },
    {
      "indent": 3,
      "text": "RFC 1624 I: \"Computation of the Internet Checksum via Incremental Update\" (May 1994)",
      "zh-CHS": "RFC 1624 I：“通过增量更新计算互联网校验和”（1994年5月）"
    },
    {
      "indent": 6,
      "text": "Incrementally updating the Internet checksum is useful to routers in updating IP checksums. Some middleboxes that alter TCP headers may also be able to update the TCP checksum incrementally. This document [RFC1624] expands upon the explanation of the incremental update procedure in RFC 1071 (see above in Section 7.5).",
      "zh-CHS": "增量更新Internet校验和对路由器更新IP校验和很有用。一些改变TCP报头的中间盒也可以增量更新TCP校验和。本文件[RFC1624]对RFC 1071中增量更新程序的解释进行了扩展（见上文第7.5节）。"
    },
    {
      "indent": 3,
      "text": "RFC 1936 I: \"Implementing the Internet Checksum in Hardware\" (April 1996)",
      "zh-CHS": "RFC 1936 I：“在硬件中实现互联网校验和”（1996年4月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1936] describes the motivation for implementing the Internet checksum in hardware, rather than in software, and provides an implementation example.",
      "zh-CHS": "本文档[RFC1936]描述了在硬件而不是软件中实现Internet校验和的动机，并提供了一个实现示例。"
    },
    {
      "indent": 3,
      "text": "RFC 2525 I: \"Known TCP Implementation Problems\" (March 1999)",
      "zh-CHS": "RFC 2525 I：“已知TCP实施问题”（1999年3月）"
    },
    {
      "indent": 6,
      "text": "From the Abstract of RFC 2525 [RFC2525]: \"This memo catalogs a number of known TCP implementation problems. The goal in doing so is to improve conditions in the existing Internet by enhancing the quality of current TCP/IP implementations.\"",
      "zh-CHS": "摘自RFC 2525[RFC2525]摘要：“本备忘录列举了许多已知的TCP实施问题。这样做的目的是通过提高当前TCP/IP实施的质量来改善现有互联网的状况。”"
    },
    {
      "indent": 3,
      "text": "RFC 2923 I: \"TCP Problems with Path MTU Discovery\" (September 2000)",
      "zh-CHS": "RFC 2923 I：“路径MTU发现的TCP问题”（2000年9月）"
    },
    {
      "indent": 6,
      "text": "From abstract: \"This memo catalogs several known Transmission Control Protocol (TCP) implementation problems dealing with Path Maximum Transmission Unit Discovery (PMTUD), including the long-standing black hole problem, stretch acknowledgments (ACKs) due to confusion between Maximum Segment Size (MSS) and segment size, and MSS advertisement based on PMTU.\" [RFC2923]",
      "zh-CHS": "摘自摘要：“本备忘录列举了几个已知的传输控制协议（TCP）实现问题，这些问题涉及路径最大传输单元发现（PMTUD），包括长期存在的黑洞问题、由于最大段大小（MSS）之间的混淆而导致的延伸确认（ACKs）和段大小，以及基于PMTU的MSS广告。”[RFC2923]"
    },
    {
      "indent": 3,
      "text": "RFC 3493 I: \"Basic Socket Interface Extensions for IPv6\" (February 2003)",
      "zh-CHS": "RFC 3493 I：“IPv6的基本套接字接口扩展”（2003年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC3493] describes the de facto standard sockets API for programming with TCP. This API is implemented nearly ubiquitously in modern operating systems and programming languages.",
      "zh-CHS": "本文档[RFC3493]描述了使用TCP编程的事实上的标准套接字API。这个API在现代操作系统和编程语言中几乎无处不在。"
    },
    {
      "indent": 3,
      "text": "RFC 6056 B: \"Recommendations for Transport-Protocol Port Randomization\" (December 2010)",
      "zh-CHS": "RFC 6056 B：“传输协议端口随机化建议”（2010年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6056] describes a number of simple and efficient methods for the selection of the client port number. It reduces the possibility of an attacker guessing the correct five-tuple (Protocol, Source/Destination Address, Source/Destination Port).",
      "zh-CHS": "本文档[RFC6056]介绍了选择客户端端口号的一些简单有效的方法。它降低了攻击者猜测正确的五元组（协议、源/目标地址、源/目标端口）的可能性。"
    },
    {
      "indent": 3,
      "text": "RFC 6191 B: \"Reducing the TIME-WAIT State Using TCP Timestamps\" (April 2011)",
      "zh-CHS": "RFC 6191 B：“使用TCP时间戳减少等待时间状态”（2011年4月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6191] describes the usage of the TCP Timestamps option (RFC 7323, see Section 3.1 of this document) to perform heuristics to determine whether or not to allow the creation of a new incarnation of a connection that is in the TIME-WAIT state.",
      "zh-CHS": "本文档[RFC6191]描述了使用TCP时间戳选项（RFC 7323，请参阅本文档第3.1节）执行试探，以确定是否允许创建处于等待状态的连接的新化身。"
    },
    {
      "indent": 3,
      "text": "RFC 6429 I: \"TCP Sender Clarification for Persist Condition\" (December 2011)",
      "zh-CHS": "RFC 6429 I：“TCP发送方对持续状态的澄清”（2011年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6429] clarifies the actions that a TCP can take on connections that are experiencing the Zero Window Probe (ZWP) condition.",
      "zh-CHS": "本文档[RFC6429]阐明了TCP在遇到零窗口探测（ZWP）情况的连接上可以采取的操作。"
    },
    {
      "indent": 3,
      "text": "RFC 6897 I: \"Multipath TCP (MPTCP) Application Interface Considerations\" (March 2013)",
      "zh-CHS": "RFC 6897 I：“多路径TCP（MPTCP）应用程序接口注意事项”（2013年3月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC6897] characterizes the impact that Multipath TCP (MPTCP) (see Section 4.7 of this document) may have on applications. It further discusses compatibility issues of MPTCP in combination with non-MPTCP-aware applications. Finally, it describes a basic API that is a simple extension of TCP's interface for MPTCP-aware applications.",
      "zh-CHS": "本文件[RFC6897]描述了多路径TCP（MPTCP）（见本文件第4.7节）可能对应用程序产生的影响。它进一步讨论了MPTCP与非MPTCP感知应用程序的兼容性问题。最后，它描述了一个基本API，它是用于MPTCP感知应用程序的TCP接口的简单扩展。"
    },
    {
      "indent": 0,
      "text": "7.6. Tools and Tutorials",
      "section_title": true,
      "zh-CHS": "7.6. 工具和教程"
    },
    {
      "indent": 3,
      "text": "RFC 1180 I: \"TCP/IP Tutorial\" (January 1991) (Errata)",
      "zh-CHS": "RFC 1180 I：“TCP/IP教程”（1991年1月）（勘误表）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1180] is an extremely brief overview of the TCP/ IP protocol suite as a whole. It gives some explanation as to how and where TCP fits in.",
      "zh-CHS": "本文档[RFC1180]对TCP/IP协议套件作为一个整体进行了极其简要的概述。它给出了一些关于TCP如何以及在何处适合的解释。"
    },
    {
      "indent": 3,
      "text": "RFC 1470 I: \"FYI on a Network Management Tool Catalog: Tools for Monitoring and Debugging TCP/IP Internets and Interconnected Devices\" (June 1993)",
      "zh-CHS": "RFC 1470 I：“网络管理工具目录上的FYI：监控和调试TCP/IP互联网和互连设备的工具”（1993年6月）"
    },
    {
      "indent": 6,
      "text": "A few of the tools that this document [RFC1470] describes are still maintained and in use today, for example, ttcp and tcpdump. However, many of the tools described do not relate specifically to TCP and are no longer used or easily available.",
      "zh-CHS": "本文档[RFC1470]描述的一些工具至今仍在维护和使用，例如ttcp和tcpdump。然而，所描述的许多工具并不专门与TCP相关，并且不再使用或容易获得。"
    },
    {
      "indent": 3,
      "text": "RFC 2398 I: \"Some Testing Tools for TCP Implementors\" (August 1998)",
      "zh-CHS": "RFC 2398 I：“TCP实现者的一些测试工具”（1998年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2398] describes a number of TCP packet generation and analysis tools. Although some of these tools are no longer readily available or widely used, for the most part they are still relevant and usable.",
      "zh-CHS": "本文档[RFC2398]描述了许多TCP数据包生成和分析工具。尽管其中一些工具不再容易获得或广泛使用，但在大多数情况下，它们仍然是相关的和可用的。"
    },
    {
      "indent": 3,
      "text": "RFC 5783 I: \"Congestion Control in the RFC Series\" (February 2010)",
      "zh-CHS": "RFC 5783 I：“RFC系列中的拥塞控制”（2010年2月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC5783] provides an overview of RFCs related to congestion control that had been published at the time. The focus of the document is on end-host-based congestion control.",
      "zh-CHS": "本文档[RFC5783]概述了当时发布的与拥塞控制相关的RFC。本文档的重点是基于终端主机的拥塞控制。"
    },
    {
      "indent": 0,
      "text": "7.7. MIB Modules",
      "section_title": true,
      "zh-CHS": "7.7. MIB模块"
    },
    {
      "indent": 3,
      "text": "The first MIB module defined for use with Simple Network Management Protocol (SNMP) was a single monolithic MIB module, called MIB-I, defined in RFC 1156. This evolved over time to the MIB-II specification in RFC 1213, which obsoletes RFC 1156. It then became apparent that having a single monolithic MIB module was not scalable, given the number and breadth of MIB data definitions that needed to be included. Thus, additional MIB modules were defined, and those parts of MIB-II that needed to evolve were split off. Eventually, the remaining parts of MIB-II were also split off, the TCP-specific part being documented in RFC 2012. RFC 2012 was obsoleted by RFC 4022, which is the primary TCP MIB document at the time of writing. For current TCP implementers, RFC 4022 should be supported.",
      "zh-CHS": "第一个定义用于简单网络管理协议（SNMP）的MIB模块是RFC 1156中定义的单个单片MIB模块，称为MIB-I。随着时间的推移，这发展到RFC 1213中的MIB-II规范，该规范淘汰了RFC 1156。考虑到需要包含的MIB数据定义的数量和广度，很明显，拥有单个单片MIB模块是不可伸缩的。因此，定义了额外的MIB模块，并分离了MIB-II中需要进化的部分。最终，MIB-II的其余部分也被拆分，TCP特定部分记录在RFC 2012中。RFC 2012已被RFC 4022淘汰，RFC 4022是撰写本文时的主要TCP MIB文档。对于当前的TCP实现者，应该支持RFC4022。"
    },
    {
      "indent": 3,
      "text": "RFC 1156 S: \"Management Information Base for Network Management of TCP/IP-based Internets\" (May 1990)",
      "zh-CHS": "RFC 1156 S：“基于TCP/IP的互联网网络管理的管理信息库”（1990年5月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1156] describes the required MIB fields for TCP implementations with minor corrections and no technical changes from RFC 1066, which it obsoletes. This is the Standards Track RFC for MIB-I.",
      "zh-CHS": "本文档[RFC1156]描述了TCP实现所需的MIB字段，并对RFC1066进行了微小的修改，且未进行技术更改，该文档已废弃。这是MIB-I的标准跟踪RFC。"
    },
    {
      "indent": 3,
      "text": "RFC 1213 S: \"Management Information Base for Network Management of TCP/IP-based internets: MIB-II\" (March 1991)",
      "zh-CHS": "RFC 1213 S：“基于TCP/IP的互联网网络管理的管理信息库：MIB-II”（1991年3月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1213] describes the second version of the MIB in a monolithic form. It is the immediate successor of RFC 1158, with minor modifications. It obsoletes the MIB-I, defined in RFC 1156 (see above in Section 7.7).",
      "zh-CHS": "本文档[RFC1213]以单片形式描述了MIB的第二个版本。它是RFC 1158的直接继承者，稍作修改。它淘汰了RFC 1156中定义的MIB-I（见上文第7.7节）。"
    },
    {
      "indent": 3,
      "text": "RFC 2012 S: \"SNMPv2 Management Information Base for the Transmission Control Protocol using SMIv2\" (November 1996)",
      "zh-CHS": "RFC 2012 S：“使用SMIv2的传输控制协议的SNMPv2管理信息库”（1996年11月）"
    },
    {
      "indent": 6,
      "text": "In an update to RFC 1213 (see Section 7.7 of this document), this document [RFC2012] defines the TCP MIB by splitting out the TCP-specific portions. It is now obsoleted by RFC 4022 (see below in Section 7.7).",
      "zh-CHS": "在对RFC 1213的更新中（参见本文件第7.7节），本文件[RFC2012]通过拆分TCP特定部分来定义TCP MIB。现在，RFC 4022已将其淘汰（见下文第7.7节）。"
    },
    {
      "indent": 3,
      "text": "RFC 2452 S: \"IP Version 6 Management Information Base for the Transmission Control Protocol\" (December 1998)",
      "zh-CHS": "RFC 2452 S：“传输控制协议的IP版本6管理信息库”（1998年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2452] augments RFC 2012 (see Section 7.7 of this document) by adding an IPv6-specific connection table. The rest of RFC 2012 holds for any IP version. RFC 2452 is now obsoleted by RFC 4022 (see below in Section 7.7).",
      "zh-CHS": "本文档[RFC2452]通过添加特定于IPv6的连接表来扩充RFC 2012（参见本文档第7.7节）。RFC 2012的其余部分适用于任何IP版本。RFC 2452现已被RFC 4022淘汰（见下文第7.7节）。"
    },
    {
      "indent": 6,
      "text": "Although it is a Standards Track RFC, RFC 2452 is considered a historic mistake by the MIB community, as it is based on the idea of parallel IPv4 and IPv6 structures. Although IPv6 requires new structures, the community has decided to define a single generic structure for both IPv4 and IPv6. This will aid in definition, implementation, and transition between IPv4 and IPv6.",
      "zh-CHS": "尽管RFC2452是一个标准的跟踪RFC，但MIB社区认为它是一个历史性的错误，因为它基于并行IPv4和IPv6结构的思想。尽管IPv6需要新的结构，但社区已决定为IPv4和IPv6定义一个通用结构。这将有助于IPv4和IPv6之间的定义、实现和转换。"
    },
    {
      "indent": 3,
      "text": "RFC 4022 S: \"Management Information Base for the Transmission Control Protocol (TCP)\" (March 2005)",
      "zh-CHS": "RFC 4022 S：“传输控制协议（TCP）的管理信息库”（2005年3月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4022] obsoletes RFCs 2012 and 2452 (see above in Section 7.7) and specifies the current standard for the TCP MIB that should be deployed.",
      "zh-CHS": "本文件[RFC4022]废除了RFCs 2012和2452（见上文第7.7节），并规定了应部署的TCP MIB的现行标准。"
    },
    {
      "indent": 3,
      "text": "RFC 4898 S: \"TCP Extended Statistics MIB\" (May 2007)",
      "zh-CHS": "RFC 4898 S：“TCP扩展统计MIB”（2007年5月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC4898] describes extended performance statistics for TCP. They are designed to use TCP's ideal vantage point to diagnose performance problems in both the network and the application.",
      "zh-CHS": "本文档[RFC4898]描述了TCP的扩展性能统计信息。它们旨在利用TCP的理想优势诊断网络和应用程序中的性能问题。"
    },
    {
      "indent": 0,
      "text": "7.8. Case Studies",
      "section_title": true,
      "zh-CHS": "7.8. 案例研究"
    },
    {
      "indent": 3,
      "text": "RFC 700 U: \"A Protocol Experiment\" (August 1974)",
      "zh-CHS": "RFC 700 U：“协议实验”（1974年8月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC700] presents a field report about the deployment of a very early version of TCP, the so-called INWN #39 protocol, which is originally described by Cerf and Kahn in INWG Note #39 [CK73] to use a PDP-11 line printer via the ARPANET.",
      "zh-CHS": "本文件[RFC700]提供了一份关于TCP早期版本部署的现场报告，即所谓的INWN#39协议，该协议最初由Cerf和Kahn在INWG Note#39[CK73]中描述，用于通过ARPANET使用PDP-11行打印机。"
    },
    {
      "indent": 3,
      "text": "RFC 889 U: \"Internet Delay Experiments\" (December 1983)",
      "zh-CHS": "RFC 889 U：“互联网延迟实验”（1983年12月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC889] is a status report about experiments concerning the TCP retransmission timeout calculation and also provides advice for implementers.",
      "zh-CHS": "本文档[RFC889]是关于TCP重传超时计算实验的状态报告，并为实现者提供建议。"
    },
    {
      "indent": 3,
      "text": "RFC 1337 I: \"TIME-WAIT Assassination Hazards in TCP\" (May 1992)",
      "zh-CHS": "RFC 1337 I：“TCP中的等待时间暗杀危险”（1992年5月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC1337] points out a problem with acting on received reset segments while one is in the TIME-WAIT state. The main recommendation is that hosts in TIME-WAIT ignore resets. This recommendation might not currently be widely implemented.",
      "zh-CHS": "本文件[RFC1337]指出了在接收的重置段处于等待时间状态时对其进行操作的问题。主要建议是等待时间的主机忽略重置。这项建议目前可能没有得到广泛执行。"
    },
    {
      "indent": 3,
      "text": "RFC 2415 I: \"Simulation Studies of Increased Initial TCP Window Size\" (September 1998)",
      "zh-CHS": "RFC 2415 I：“增加初始TCP窗口大小的模拟研究”（1998年9月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2415] presents results of some simulations using TCP initial windows greater than 1 segment. The analysis indicates that user-perceived performance can be improved by increasing the initial window to 3 segments.",
      "zh-CHS": "本文件[RFC2415]介绍了使用TCP初始窗口大于1段的一些模拟结果。分析表明，通过将初始窗口增加到3个分段，可以提高用户感知性能。"
    },
    {
      "indent": 3,
      "text": "RFC 2416 I: \"When TCP Starts Up With Four Packets Into Only Three Buffers\" (September 1998)",
      "zh-CHS": "RFC 2416 I：“当TCP启动时，只有四个数据包进入三个缓冲区”（1998年9月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2416] uses simulation results to clear up some concerns about using an initial window of 4 segments when the network path has less provisioning.",
      "zh-CHS": "本文档[RFC2416]使用模拟结果来解决当网络路径的供应较少时使用4段初始窗口的一些问题。"
    },
    {
      "indent": 3,
      "text": "RFC 2884 I: \"Performance Evaluation of Explicit Congestion Notification (ECN) in IP Networks\" (July 2000)",
      "zh-CHS": "RFC 2884 I：“IP网络中显式拥塞通知（ECN）的性能评估”（2000年7月）"
    },
    {
      "indent": 6,
      "text": "This document [RFC2884] describes experimental results that show some improvements to the performance of both short- and long-lived connections due to ECN.",
      "zh-CHS": "本文档[RFC2884]描述了一些实验结果，这些结果表明，由于ECN，短寿命连接和长寿命连接的性能都有一些改善。"
    },
    {
      "indent": 0,
      "text": "8. Undocumented TCP Features",
      "section_title": true,
      "zh-CHS": "8. 未记录的TCP功能"
    },
    {
      "indent": 3,
      "text": "There are a few important implementation tactics for the TCP that have not yet been described in any RFC. Although this roadmap is primarily concerned with mapping the TCP RFCs, this section is included because an implementer needs to be aware of these important issues.",
      "zh-CHS": "有一些重要的TCP实现策略尚未在任何RFC中描述。尽管本路线图主要关注TCP RFC的映射，但之所以包含本节，是因为实施者需要了解这些重要问题。"
    },
    {
      "indent": 3,
      "text": "Header Prediction",
      "zh-CHS": "报头预测"
    },
    {
      "indent": 6,
      "text": "Header prediction is a trick to speed up the processing of segments. Van Jacobson and Mike Karels developed the technique in the late 1980s. The basic idea is that some processing time can be saved when most of a segment's fields can be predicted from previous segments. A good description of this was sent to the TCP-IP mailing list by Van Jacobson on March 9, 1988 (see [Jacobson] for the full message):",
      "zh-CHS": "报头预测是一种加快段处理速度的技巧。Van Jacobson和Mike Karels在20世纪80年代末开发了这项技术。其基本思想是，当可以从以前的段预测段的大部分字段时，可以节省一些处理时间。1988年3月9日，Van Jacobson向TCP-IP邮件列表发送了关于这一点的详细说明（完整信息见[Jacobson]）："
    },
    {
      "indent": 9,
      "text": "Quite a bit of the speedup comes from an algorithm that we ('we' refers to collaborator Mike Karels and myself) are calling \"header prediction\". The idea is that if you're in the middle of a bulk data transfer and have just seen a packet, you know what the next packet is going to look like: It will look just like the current packet with either the sequence number or ack number updated (depending on whether you're the sender or receiver). Combining this with the \"Use hints\" epigram from Butler Lampson's classic \"Epigrams for System Designers\", you start to think of the tcp state (rcv.nxt, snd.una, etc.) as \"hints\" about what the next packet should look like.",
      "zh-CHS": "相当多的加速来自一种我们称之为“头预测”的算法（“我们”指的是合作者迈克·卡勒斯和我自己）。这个想法是，如果你正处于批量数据传输的中间，并且刚刚看到一个数据包，你就知道下一个数据包会是什么样子：它看起来就像当前的数据包，它有序列号或ACK号的更新（取决于你是发送者还是接收者）。结合巴特勒·兰普森（Butler Lampson）的经典“系统设计师的警句”中的“使用提示”警句，您开始将tcp状态（rcv.nxt、snd.una等）视为下一个数据包应该是什么样子的“提示”。"
    },
    {
      "indent": 9,
      "text": "If you arrange those \"hints\" so they match the layout of a tcp packet header, it takes a single 14-byte compare to see if your prediction is correct (3 longword compares to pick up the send & ack sequence numbers, header length, flags and window, plus a short compare on the length). If the prediction is correct, there's a single test on the length to see if you're the sender or receiver followed by the appropriate processing. E.g., if the length is non-zero (you're the receiver), checksum and append the data to the socket buffer then wake any process that's sleeping on the buffer. Update rcv.nxt by the length of this packet (this updates your \"prediction\" of the next packet). Check if you can handle another packet the same size as the current one. If not, set one of the unused flag bits in your header prediction to guarantee that the prediction will fail on the next packet and force you to go through full protocol processing. Otherwise, you're done with this packet. So, the *total* tcp protocol processing, exclusive of checksumming, is on the order of 6 compares and an add.",
      "zh-CHS": "如果您排列这些“提示”，使其与tcp数据包头的布局相匹配，则需要进行一次14字节的比较，以查看您的预测是否正确（3次长字比较，以获取发送和确认序列号、头长度、标志和窗口，加上对长度的简短比较）。如果预测是正确的，则只需对长度进行一次测试，以确定您是发送者还是接收者，然后进行适当的处理。例如，如果长度不为零（您是接收器），则校验和并将数据附加到套接字缓冲区，然后唤醒缓冲区上休眠的任何进程。按此数据包的长度更新rcv.nxt（这将更新您对下一个数据包的“预测”）。检查是否可以处理与当前数据包大小相同的另一个数据包。如果没有，则在报头预测中设置一个未使用的标志位，以确保预测在下一个数据包上失败，并强制您进行完整的协议处理。否则，你就不需要这个包了。因此，不包括校验和的*total*tcp协议处理大约是6个比较和一个加法。"
    },
    {
      "indent": 3,
      "text": "Forward Acknowledgement (FACK)",
      "zh-CHS": "转发确认（FACK）"
    },
    {
      "indent": 6,
      "text": "FACK [MM96] includes an alternate algorithm for triggering fast retransmit [RFC5681], based on the extent of the SACK scoreboard. Its goal is to trigger fast retransmit as soon as the receiver's reassembly queue is larger than the duplicate ACK threshold, as indicated by the difference between the forward most SACK block edge and SND.UNA. This algorithm quickly and reliably triggers fast retransmit in the presence of burst losses -- often on the first SACK following such a loss. Such a threshold-based algorithm also triggers fast retransmit immediately in the presence of any reordering with extent greater than the duplicate ACK threshold. FACK is implemented in Linux and turned on per default.",
      "zh-CHS": "FACK[MM96]包括基于SACK记分板的范围触发快速重传[RFC5681]的替代算法。它的目标是在接收器的重组队列大于重复ACK阈值时触发快速重传，如最前面的SACK块边缘和SND.UNA之间的差异所示。这种算法能够在突发丢失的情况下快速可靠地触发快速重传——通常是在丢失后的第一个SACK上。这种基于阈值的算法还可以在存在范围大于重复ACK阈值的任何重新排序时立即触发快速重传。FACK是在Linux中实现的，默认情况下是打开的。"
    },
    {
      "indent": 3,
      "text": "Congestion Control for High Rate Flows",
      "zh-CHS": "高速率流的拥塞控制"
    },
    {
      "indent": 6,
      "text": "In the last decade significant research effort has been put into experimental TCP congestion control modifications for obtaining high throughput with reduced startup and recovery times. Only a few RFCs have been published on some of these modifications, including HighSpeed TCP [RFC3649], Limited Slow-Start [RFC3742], and Quick-Start [RFC4782] (see Section 4.3 of this document for more information on each), but high-rate congestion control mechanisms are still considered an open issue in congestion control research. Some other schemes have been published as Internet-Drafts, e.g. CUBIC [CUBIC] (the standard TCP congestion control algorithm in Linux), Compound TCP [CTCP], and H-TCP [HTCP] or have been discussed a little by the IETF, but much of the work in this area has not been adopted within the IETF yet, so the majority of this work is outside the RFC series and may be discussed in other products of the IRTF Internet Congestion Control Research Group (ICCRG).",
      "zh-CHS": "在过去的十年中，大量的研究工作已经投入到实验性的TCP拥塞控制修改中，以在减少启动和恢复时间的情况下获得高吞吐量。在这些修改中，只有少数几个RFC已经发布，包括高速TCP[RFC3649]、有限慢启动[RFC3742]和快速启动[RFC4782]（有关每种修改的更多信息，请参阅本文档第4.3节），但高速拥塞控制机制仍然被认为是拥塞控制研究中的一个开放问题。其他一些方案已作为互联网草案发布，例如CUBIC[CUBIC]（Linux中的标准TCP拥塞控制算法）、复合TCP[CTCP]和H-TCP[HTCP]，或已被IETF讨论过一些，但该领域的许多工作尚未在IETF中采用，因此，这项工作的大部分在RFC系列之外，可能会在IRTF互联网拥塞控制研究小组（ICCRG）的其他产品中讨论。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "zh-CHS": "9. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security considerations. Each RFC listed in this document attempts to address the security considerations of the specification it contains.",
      "zh-CHS": "本文档没有引入新的安全注意事项。本文档中列出的每个RFC都试图解决它所包含的规范的安全注意事项。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC675] Cerf, V., Dalal, Y., and C. Sunshine, \"Specification of Internet Transmission Control Program\", RFC 675, December 1974, <http://www.rfc-editor.org/info/rfc675>.",
      "zh-CHS": "[RFC675]Cerf，V.，Dalal，Y.，和C.Sunshine，“互联网传输控制程序规范”，RFC 6751974年12月<http://www.rfc-editor.org/info/rfc675>."
    },
    {
      "indent": 3,
      "text": "[RFC700] Mader, E., Plummer, W., and R. Tomlinson, \"Protocol experiment\", RFC 700, August 1974, <http://www.rfc-editor.org/info/rfc700>.",
      "zh-CHS": "[RFC700]Mader，E.，Plummer，W.和R.Tomlinson，“协议实验”，RFC700，1974年8月<http://www.rfc-editor.org/info/rfc700>."
    },
    {
      "indent": 3,
      "text": "[RFC721] Garlick, L., \"Out-of-Band Control Signals in a Host-to-Host Protocol\", RFC 721, September 1976, <http://www.rfc-editor.org/info/rfc721>.",
      "zh-CHS": "[RFC721]Garlick，L.，“主机对主机协议中的带外控制信号”，RFC 7211976年9月<http://www.rfc-editor.org/info/rfc721>."
    },
    {
      "indent": 3,
      "text": "[RFC761] Postel, J., \"DoD standard Transmission Control Protocol\", RFC 761, January 1980, <http://www.rfc-editor.org/info/rfc761>.",
      "zh-CHS": "[RFC761]Postel，J.，“国防部标准传输控制协议”，RFC 761，1980年1月<http://www.rfc-editor.org/info/rfc761>."
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981, <http://www.rfc-editor.org/info/rfc793>.",
      "zh-CHS": "[RFC793]Postel，J.，“传输控制协议”，标准7，RFC 793，1981年9月<http://www.rfc-editor.org/info/rfc793>."
    },
    {
      "indent": 3,
      "text": "[RFC794] Cerf, V., \"Pre-emption\", RFC 794, September 1981, <http://www.rfc-editor.org/info/rfc794>.",
      "zh-CHS": "[RFC794]Cerf，V.，“优先购买权”，RFC7941981年9月<http://www.rfc-editor.org/info/rfc794>."
    },
    {
      "indent": 3,
      "text": "[RFC813] Clark, D., \"Window and Acknowledgement Strategy in TCP\", RFC 813, July 1982, <http://www.rfc-editor.org/info/rfc813>.",
      "zh-CHS": "[RFC813]Clark，D.，“TCP中的窗口和确认策略”，RFC813，1982年7月<http://www.rfc-editor.org/info/rfc813>."
    },
    {
      "indent": 3,
      "text": "[RFC814] Clark, D., \"Name, addresses, ports, and routes\", RFC 814, July 1982, <http://www.rfc-editor.org/info/rfc814>.",
      "zh-CHS": "[RFC814]Clark，D.，“名称、地址、港口和路线”，RFC8141982年7月<http://www.rfc-editor.org/info/rfc814>."
    },
    {
      "indent": 3,
      "text": "[RFC816] Clark, D., \"Fault isolation and recovery\", RFC 816, July 1982, <http://www.rfc-editor.org/info/rfc816>.",
      "zh-CHS": "[RFC816]Clark，D.，“故障隔离和恢复”，RFC816，1982年7月<http://www.rfc-editor.org/info/rfc816>."
    },
    {
      "indent": 3,
      "text": "[RFC817] Clark, D., \"Modularity and efficiency in protocol implementation\", RFC 817, July 1982, <http://www.rfc-editor.org/info/rfc817>.",
      "zh-CHS": "[RFC817]Clark，D.，“协议实现中的模块化和效率”，RFC817，1982年7月<http://www.rfc-editor.org/info/rfc817>."
    },
    {
      "indent": 3,
      "text": "[RFC872] Padlipsky, M., \"TCP-on-a-LAN\", RFC 872, September 1982, <http://www.rfc-editor.org/info/rfc872>.",
      "zh-CHS": "[RFC872]Padlipsky，M.，“TCP-on-a-LAN”，RFC8721982年9月<http://www.rfc-editor.org/info/rfc872>."
    },
    {
      "indent": 3,
      "text": "[RFC879] Postel, J., \"TCP maximum segment size and related topics\", RFC 879, November 1983, <http://www.rfc-editor.org/info/rfc879>.",
      "zh-CHS": "[RFC879]Postel，J.，“TCP最大段大小和相关主题”，RFC879，1983年11月<http://www.rfc-editor.org/info/rfc879>."
    },
    {
      "indent": 3,
      "text": "[RFC889] Mills, D., \"Internet delay experiments\", RFC 889, December 1983, <http://www.rfc-editor.org/info/rfc889>.",
      "zh-CHS": "[RFC889]Mills，D.，“互联网延迟实验”，RFC 889，1983年12月<http://www.rfc-editor.org/info/rfc889>."
    },
    {
      "indent": 3,
      "text": "[RFC896] Nagle, J., \"Congestion control in IP/TCP internetworks\", RFC 896, January 1984, <http://www.rfc-editor.org/info/rfc896>.",
      "zh-CHS": "[RFC896]Nagle，J.，“IP/TCP网络中的拥塞控制”，RFC896，1984年1月<http://www.rfc-editor.org/info/rfc896>."
    },
    {
      "indent": 3,
      "text": "[RFC964] Sidhu, D. and T. Blumer, \"Some problems with the specification of the Military Standard Transmission Control Protocol\", RFC 964, November 1985, <http://www.rfc-editor.org/info/rfc964>.",
      "zh-CHS": "[RFC964]Sidhu，D.和T.Blumer，“军用标准传输控制协议规范的一些问题”，RFC 964，1985年11月<http://www.rfc-editor.org/info/rfc964>."
    },
    {
      "indent": 3,
      "text": "[RFC1071] Braden, R., Borman, D., Partridge, C., and W. Plummer, \"Computing the Internet checksum\", RFC 1071, September 1988, <http://www.rfc-editor.org/info/rfc1071>.",
      "zh-CHS": "[RFC1071]Braden，R.，Borman，D.，Partridge，C.，和W.Plummer，“计算互联网校验和”，RFC 10711988年9月<http://www.rfc-editor.org/info/rfc1071>."
    },
    {
      "indent": 3,
      "text": "[RFC1078] Lottor, M., \"TCP port service Multiplexer (TCPMUX)\", RFC 1078, November 1988, <http://www.rfc-editor.org/info/rfc1078>.",
      "zh-CHS": "[RFC1078]洛托，M.，“TCP端口服务多路复用器（TCPMUX）”，RFC1078，1988年11月<http://www.rfc-editor.org/info/rfc1078>."
    },
    {
      "indent": 3,
      "text": "[RFC1106] Fox, R., \"TCP big window and NAK options\", RFC 1106, June 1989, <http://www.rfc-editor.org/info/rfc1106>.",
      "zh-CHS": "[RFC1106]Fox，R.，“TCP大窗口和NAK选项”，RFC1106，1989年6月<http://www.rfc-editor.org/info/rfc1106>."
    },
    {
      "indent": 3,
      "text": "[RFC1110] McKenzie, A., \"Problem with the TCP big window option\", RFC 1110, August 1989, <http://www.rfc-editor.org/info/rfc1110>.",
      "zh-CHS": "[RFC1110]McKenzie，A.，“TCP大窗口选项的问题”，RFC11101989年8月<http://www.rfc-editor.org/info/rfc1110>."
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, October 1989, <http://www.rfc-editor.org/info/rfc1122>.",
      "zh-CHS": "[RFC1122]Braden，R.，“互联网主机的要求-通信层”，标准3，RFC 1122，1989年10月<http://www.rfc-editor.org/info/rfc1122>."
    },
    {
      "indent": 3,
      "text": "[RFC1144] Jacobson, V., \"Compressing TCP/IP headers for low-speed serial links\", RFC 1144, February 1990, <http://www.rfc-editor.org/info/rfc1144>.",
      "zh-CHS": "[RFC1144]Jacobson，V.，“压缩低速串行链路的TCP/IP报头”，RFC 11441990年2月<http://www.rfc-editor.org/info/rfc1144>."
    },
    {
      "indent": 3,
      "text": "[RFC1146] Zweig, J. and C. Partridge, \"TCP alternate checksum options\", RFC 1146, March 1990, <http://www.rfc-editor.org/info/rfc1146>.",
      "zh-CHS": "[RFC1146]Zweig，J.和C.Partridge，“TCP备用校验和选项”，RFC 11461990年3月<http://www.rfc-editor.org/info/rfc1146>."
    },
    {
      "indent": 3,
      "text": "[RFC1156] McCloghrie, K. and M. Rose, \"Management Information Base for network management of TCP/IP-based internets\", RFC 1156, May 1990, <http://www.rfc-editor.org/info/rfc1156>.",
      "zh-CHS": "[RFC1156]McCloghrie，K.和M.Rose，“基于TCP/IP的互联网网络管理的管理信息库”，RFC 1156，1990年5月<http://www.rfc-editor.org/info/rfc1156>."
    },
    {
      "indent": 3,
      "text": "[RFC1180] Socolofsky, T. and C. Kale, \"TCP/IP tutorial\", RFC 1180, January 1991, <http://www.rfc-editor.org/info/rfc1180>.",
      "zh-CHS": "[RFC1180]Socolofsky，T.和C.Kale，“TCP/IP教程”，RFC11801991年1月<http://www.rfc-editor.org/info/rfc1180>."
    },
    {
      "indent": 3,
      "text": "[RFC1191] Mogul, J. and S. Deering, \"Path MTU discovery\", RFC 1191, November 1990, <http://www.rfc-editor.org/info/rfc1191>.",
      "zh-CHS": "[RFC1191]Mogul，J.和S.Deering，“MTU发现路径”，RFC1191，1990年11月<http://www.rfc-editor.org/info/rfc1191>."
    },
    {
      "indent": 3,
      "text": "[RFC1213] McCloghrie, K. and M. Rose, \"Management Information Base for Network Management of TCP/IP-based internets:MIB-II\", STD 17, RFC 1213, March 1991, <http://www.rfc-editor.org/info/rfc1213>.",
      "zh-CHS": "[RFC1213]McCloghrie，K.和M.Rose，“基于TCP/IP的互联网网络管理的管理信息库：MIB-II”，STD 17，RFC 1213，1991年3月<http://www.rfc-editor.org/info/rfc1213>."
    },
    {
      "indent": 3,
      "text": "[RFC1263] O'Malley, S. and L. Peterson, \"TCP Extensions Considered Harmful\", RFC 1263, October 1991, <http://www.rfc-editor.org/info/rfc1263>.",
      "zh-CHS": "[RFC1263]O'Malley，S.和L.Peterson，“TCP扩展被认为是有害的”，RFC1263，1991年10月<http://www.rfc-editor.org/info/rfc1263>."
    },
    {
      "indent": 3,
      "text": "[RFC1337] Braden, B., \"TIME-WAIT Assassination Hazards in TCP\", RFC 1337, May 1992, <http://www.rfc-editor.org/info/rfc1337>.",
      "zh-CHS": "[RFC1337]Braden，B.，“TCP中的等待时间暗杀危险”，RFC 1337，1992年5月<http://www.rfc-editor.org/info/rfc1337>."
    },
    {
      "indent": 3,
      "text": "[RFC1379] Braden, B., \"Extending TCP for Transactions -- Concepts\", RFC 1379, November 1992, <http://www.rfc-editor.org/info/rfc1379>.",
      "zh-CHS": "[RFC1379]Braden，B.，“为事务扩展TCP——概念”，RFC 13791992年11月<http://www.rfc-editor.org/info/rfc1379>."
    },
    {
      "indent": 3,
      "text": "[RFC1470] Enger, R. and J. Reynolds, \"FYI on a Network Management Tool Catalog: Tools for Monitoring and Debugging TCP/IP Internets and Interconnected Devices\", RFC 1470, June 1993, <http://www.rfc-editor.org/info/rfc1470>.",
      "zh-CHS": "[RFC1470]Enger，R.和J.Reynolds，“网络管理工具目录：监控和调试TCP/IP互联网和互联设备的工具”，RFC 1470，1993年6月<http://www.rfc-editor.org/info/rfc1470>."
    },
    {
      "indent": 3,
      "text": "[RFC1624] Rijsinghani, A., \"Computation of the Internet Checksum via Incremental Update\", RFC 1624, May 1994, <http://www.rfc-editor.org/info/rfc1624>.",
      "zh-CHS": "[RFC1624]Rijsinghani，A.，“通过增量更新计算互联网校验和”，RFC1624，1994年5月<http://www.rfc-editor.org/info/rfc1624>."
    },
    {
      "indent": 3,
      "text": "[RFC1644] Braden, B., \"T/TCP -- TCP Extensions for Transactions Functional Specification\", RFC 1644, July 1994, <http://www.rfc-editor.org/info/rfc1644>.",
      "zh-CHS": "[RFC1644]Braden，B，“T/TCP——事务功能规范的TCP扩展”，RFC16441994年7月<http://www.rfc-editor.org/info/rfc1644>."
    },
    {
      "indent": 3,
      "text": "[RFC1693] Connolly, T., Amer, P., and P. Conrad, \"An Extension to TCP : Partial Order Service\", RFC 1693, November 1994, <http://www.rfc-editor.org/info/rfc1693>.",
      "zh-CHS": "[RFC1693]Connolly，T.，Amer，P.，和P.Conrad，“TCP的扩展：部分订单服务”，RFC 1693，1994年11月<http://www.rfc-editor.org/info/rfc1693>."
    },
    {
      "indent": 3,
      "text": "[RFC1705] Carlson, R. and D. Ficarella, \"Six Virtual Inches to the Left: The Problem with IPng\", RFC 1705, October 1994, <http://www.rfc-editor.org/info/rfc1705>.",
      "zh-CHS": "[RFC1705]Carlson，R.和D.Ficarella，“左边六个虚拟英寸：IPng的问题”，RFC 17051994年10月<http://www.rfc-editor.org/info/rfc1705>."
    },
    {
      "indent": 3,
      "text": "[RFC1936] Touch, J. and B. Parham, \"Implementing the Internet Checksum in Hardware\", RFC 1936, April 1996, <http://www.rfc-editor.org/info/rfc1936>.",
      "zh-CHS": "[RFC1936]Touch，J.和B.Parham，“在硬件中实现互联网校验和”，RFC 1936，1996年4月<http://www.rfc-editor.org/info/rfc1936>."
    },
    {
      "indent": 3,
      "text": "[RFC1958] Carpenter, B., \"Architectural Principles of the Internet\", RFC 1958, June 1996, <http://www.rfc-editor.org/info/rfc1958>.",
      "zh-CHS": "[RFC1958]Carpenter，B.，“互联网的建筑原理”，RFC19581996年6月<http://www.rfc-editor.org/info/rfc1958>."
    },
    {
      "indent": 3,
      "text": "[RFC1981] McCann, J., Deering, S., and J. Mogul, \"Path MTU Discovery for IP version 6\", RFC 1981, August 1996, <http://www.rfc-editor.org/info/rfc1981>.",
      "zh-CHS": "[RFC1981]McCann，J.，Deering，S.，和J.Mogul，“IP版本6的路径MTU发现”，RFC 1981，1996年8月<http://www.rfc-editor.org/info/rfc1981>."
    },
    {
      "indent": 3,
      "text": "[RFC2012] McCloghrie, K., \"SNMPv2 Management Information Base for the Transmission Control Protocol using SMIv2\", RFC 2012, November 1996, <http://www.rfc-editor.org/info/rfc2012>.",
      "zh-CHS": "[RFC2012]McCloghrie，K.，“使用SMIv2的传输控制协议的SNMPv2管理信息库”，RFC 2012，1996年11月<http://www.rfc-editor.org/info/rfc2012>."
    },
    {
      "indent": 3,
      "text": "[RFC2018] Mathis, M., Mahdavi, J., Floyd, S., and A. Romanow, \"TCP Selective Acknowledgment Options\", RFC 2018, October 1996, <http://www.rfc-editor.org/info/rfc2018>.",
      "zh-CHS": "[RFC2018]Mathis，M.，Mahdavi，J.，Floyd，S.，和A.Romanow，“TCP选择性确认选项”，RFC 2018，1996年10月<http://www.rfc-editor.org/info/rfc2018>."
    },
    {
      "indent": 3,
      "text": "[RFC2140] Touch, J., \"TCP Control Block Interdependence\", RFC 2140, April 1997, <http://www.rfc-editor.org/info/rfc2140>.",
      "zh-CHS": "[RFC2140]Touch，J.，“TCP控制块相互依赖”，RFC 21401997年4月<http://www.rfc-editor.org/info/rfc2140>."
    },
    {
      "indent": 3,
      "text": "[RFC2398] Parker, S. and C. Schmechel, \"Some Testing Tools for TCP Implementors\", RFC 2398, August 1998, <http://www.rfc-editor.org/info/rfc2398>.",
      "zh-CHS": "[RFC2398]Parker，S.和C.Schmechel，“TCP实现者的一些测试工具”，RFC2398，1998年8月<http://www.rfc-editor.org/info/rfc2398>."
    },
    {
      "indent": 3,
      "text": "[RFC2415] Poduri, K., \"Simulation Studies of Increased Initial TCP Window Size\", RFC 2415, September 1998, <http://www.rfc-editor.org/info/rfc2415>.",
      "zh-CHS": "[RFC2415]Poduri，K.，“增加初始TCP窗口大小的模拟研究”，RFC2415，1998年9月<http://www.rfc-editor.org/info/rfc2415>."
    },
    {
      "indent": 3,
      "text": "[RFC2416] Shepard, T. and C. Partridge, \"When TCP Starts Up With Four Packets Into Only Three Buffers\", RFC 2416, September 1998, <http://www.rfc-editor.org/info/rfc2416>.",
      "zh-CHS": "[RFC2416]Shepard，T.和C.Partridge，“当TCP启动时，只有四个数据包进入三个缓冲区”，RFC 2416，1998年9月<http://www.rfc-editor.org/info/rfc2416>."
    },
    {
      "indent": 3,
      "text": "[RFC2452] Daniele, M., \"IP Version 6 Management Information Base for the Transmission Control Protocol\", RFC 2452, December 1998, <http://www.rfc-editor.org/info/rfc2452>.",
      "zh-CHS": "[RFC2452]Daniele，M.，“传输控制协议的IP版本6管理信息库”，RFC 2452，1998年12月<http://www.rfc-editor.org/info/rfc2452>."
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998, <http://www.rfc-editor.org/info/rfc2460>.",
      "zh-CHS": "[RFC2460]Deering，S.和R.Hinden，“互联网协议，第6版（IPv6）规范”，RFC 2460，1998年12月<http://www.rfc-editor.org/info/rfc2460>."
    },
    {
      "indent": 3,
      "text": "[RFC2488] Allman, M., Glover, D., and L. Sanchez, \"Enhancing TCP Over Satellite Channels using Standard Mechanisms\", BCP 28, RFC 2488, January 1999, <http://www.rfc-editor.org/info/rfc2488>.",
      "zh-CHS": "[RFC2488]Allman，M.，Glover，D.，和L.Sanchez，“使用标准机制增强卫星信道上的TCP”，BCP 28，RFC 2488，1999年1月<http://www.rfc-editor.org/info/rfc2488>."
    },
    {
      "indent": 3,
      "text": "[RFC2525] Paxson, V., Dawson, S., Fenner, W., Griner, J., Heavens, I., Lahey, K., Semke, J., and B. Volz, \"Known TCP Implementation Problems\", RFC 2525, March 1999, <http://www.rfc-editor.org/info/rfc2525>.",
      "zh-CHS": "[RFC2525]Paxson，V.，Dawson，S.，Fenner，W.，Griner，J.，Skys，I.，Lahey，K.，Semke，J.，和B.Volz，“已知的TCP实现问题”，RFC 25251999年3月<http://www.rfc-editor.org/info/rfc2525>."
    },
    {
      "indent": 3,
      "text": "[RFC2675] Borman, D., Deering, S., and R. Hinden, \"IPv6 Jumbograms\", RFC 2675, August 1999, <http://www.rfc-editor.org/info/rfc2675>.",
      "zh-CHS": "[RFC2675]Borman，D.，Deering，S.和R.Hinden，“IPv6巨型程序”，RFC 26751999年8月<http://www.rfc-editor.org/info/rfc2675>."
    },
    {
      "indent": 3,
      "text": "[RFC2757] Montenegro, G., Dawkins, S., Kojo, M., Magret, V., and N. Vaidya, \"Long Thin Networks\", RFC 2757, January 2000, <http://www.rfc-editor.org/info/rfc2757>.",
      "zh-CHS": "[RFC2757]黑山，G.，道金斯，S.，科乔，M.，马格里特，V.，和N.瓦迪亚，“长瘦网络”，RFC 2757，2000年1月<http://www.rfc-editor.org/info/rfc2757>."
    },
    {
      "indent": 3,
      "text": "[RFC2760] Allman, M., Dawkins, S., Glover, D., Griner, J., Tran, D., Henderson, T., Heidemann, J., Touch, J., Kruse, H., Ostermann, S., Scott, K., and J. Semke, \"Ongoing TCP Research Related to Satellites\", RFC 2760, February 2000, <http://www.rfc-editor.org/info/rfc2760>.",
      "zh-CHS": "[RFC2760]Allman，M.，Dawkins，S.，Glover，D.，Griner，J.，Tran，D.，Henderson，T.，Heidemann，J.，Touch，J.，Kruse，H.，Ostermann，S.，Scott，K.，和J.Semke，“正在进行的与卫星相关的TCP研究”，RFC 27602000年2月<http://www.rfc-editor.org/info/rfc2760>."
    },
    {
      "indent": 3,
      "text": "[RFC2780] Bradner, S. and V. Paxson, \"IANA Allocation Guidelines For Values In the Internet Protocol and Related Headers\", BCP 37, RFC 2780, March 2000, <http://www.rfc-editor.org/info/rfc2780>.",
      "zh-CHS": "[RFC2780]Bradner，S.和V.Paxson，“互联网协议和相关报头中值的IANA分配指南”，BCP 37，RFC 2780，2000年3月<http://www.rfc-editor.org/info/rfc2780>."
    },
    {
      "indent": 3,
      "text": "[RFC2861] Handley, M., Padhye, J., and S. Floyd, \"TCP Congestion Window Validation\", RFC 2861, June 2000, <http://www.rfc-editor.org/info/rfc2861>.",
      "zh-CHS": "[RFC2861]Handley，M.，Padhye，J.，和S.Floyd，“TCP拥塞窗口验证”，RFC 28612000年6月<http://www.rfc-editor.org/info/rfc2861>."
    },
    {
      "indent": 3,
      "text": "[RFC2873] Xiao, X., Hannan, A., Paxson, V., and E. Crabbe, \"TCP Processing of the IPv4 Precedence Field\", RFC 2873, June 2000, <http://www.rfc-editor.org/info/rfc2873>.",
      "zh-CHS": "[RFC2873]Xiao，X.，Hannan，A.，Paxson，V.，和E.Crabbe，“IPv4优先字段的TCP处理”，RFC 28732000年6月<http://www.rfc-editor.org/info/rfc2873>."
    },
    {
      "indent": 3,
      "text": "[RFC2883] Floyd, S., Mahdavi, J., Mathis, M., and M. Podolsky, \"An Extension to the Selective Acknowledgement (SACK) Option for TCP\", RFC 2883, July 2000, <http://www.rfc-editor.org/info/rfc2883>.",
      "zh-CHS": "[RFC2883]Floyd，S.，Mahdavi，J.，Mathis，M.，和M.Podolsky，“TCP选择性确认（SACK）选项的扩展”，RFC 28832000年7月<http://www.rfc-editor.org/info/rfc2883>."
    },
    {
      "indent": 3,
      "text": "[RFC2884] Hadi Salim, J. and U. Ahmed, \"Performance Evaluation of Explicit Congestion Notification (ECN) in IP Networks\", RFC 2884, July 2000, <http://www.rfc-editor.org/info/rfc2884>.",
      "zh-CHS": "[RFC2884]Hadi Salim，J.和U.Ahmed，“IP网络中显式拥塞通知（ECN）的性能评估”，RFC 28842000年7月<http://www.rfc-editor.org/info/rfc2884>."
    },
    {
      "indent": 3,
      "text": "[RFC2914] Floyd, S., \"Congestion Control Principles\", BCP 41, RFC 2914, September 2000, <http://www.rfc-editor.org/info/rfc2914>.",
      "zh-CHS": "[RFC2914]Floyd，S.，“拥塞控制原则”，BCP 41，RFC 2914，2000年9月<http://www.rfc-editor.org/info/rfc2914>."
    },
    {
      "indent": 3,
      "text": "[RFC2923] Lahey, K., \"TCP Problems with Path MTU Discovery\", RFC 2923, September 2000, <http://www.rfc-editor.org/info/rfc2923>.",
      "zh-CHS": "[RFC2923]Lahey，K.，“路径MTU发现的TCP问题”，RFC 29232000年9月<http://www.rfc-editor.org/info/rfc2923>."
    },
    {
      "indent": 3,
      "text": "[RFC3042] Allman, M., Balakrishnan, H., and S. Floyd, \"Enhancing TCP's Loss Recovery Using Limited Transmit\", RFC 3042, January 2001, <http://www.rfc-editor.org/info/rfc3042>.",
      "zh-CHS": "[RFC3042]Allman，M.，Balakrishnan，H.，和S.Floyd，“使用有限传输增强TCP的丢失恢复”，RFC 3042，2001年1月<http://www.rfc-editor.org/info/rfc3042>."
    },
    {
      "indent": 3,
      "text": "[RFC3124] Balakrishnan, H. and S. Seshan, \"The Congestion Manager\", RFC 3124, June 2001, <http://www.rfc-editor.org/info/rfc3124>.",
      "zh-CHS": "[RFC3124]Balakrishnan，H.和S.Seshan，“拥堵管理者”，RFC31242001年6月<http://www.rfc-editor.org/info/rfc3124>."
    },
    {
      "indent": 3,
      "text": "[RFC3135] Border, J., Kojo, M., Griner, J., Montenegro, G., and Z. Shelby, \"Performance Enhancing Proxies Intended to Mitigate Link-Related Degradations\", RFC 3135, June 2001, <http://www.rfc-editor.org/info/rfc3135>.",
      "zh-CHS": "[RFC3135]Border，J.，Kojo，M.，Griner，J.，黑山，G.，和Z.Shelby，“旨在缓解链路相关降级的性能增强代理”，RFC 31352001年6月<http://www.rfc-editor.org/info/rfc3135>."
    },
    {
      "indent": 3,
      "text": "[RFC3150] Dawkins, S., Montenegro, G., Kojo, M., and V. Magret, \"End-to-end Performance Implications of Slow Links\", BCP 48, RFC 3150, July 2001, <http://www.rfc-editor.org/info/rfc3150>.",
      "zh-CHS": "[RFC3150]Dawkins，S.，黑山，G.，Kojo，M.，和V.Magret，“慢链路的端到端性能影响”，BCP 48，RFC 3150，2001年7月<http://www.rfc-editor.org/info/rfc3150>."
    },
    {
      "indent": 3,
      "text": "[RFC3155] Dawkins, S., Montenegro, G., Kojo, M., Magret, V., and N. Vaidya, \"End-to-end Performance Implications of Links with Errors\", BCP 50, RFC 3155, August 2001, <http://www.rfc-editor.org/info/rfc3155>.",
      "zh-CHS": "[RFC3155]Dawkins，S.，黑山，G.，Kojo，M.，Magret，V.，和N.Vaidya，“带错误链接的端到端性能影响”，BCP 50，RFC 3155，2001年8月<http://www.rfc-editor.org/info/rfc3155>."
    },
    {
      "indent": 3,
      "text": "[RFC3168] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, September 2001, <http://www.rfc-editor.org/info/rfc3168>.",
      "zh-CHS": "[RFC3168]Ramakrishnan，K.，Floyd，S.，和D.Black，“向IP添加显式拥塞通知（ECN）”，RFC 3168，2001年9月<http://www.rfc-editor.org/info/rfc3168>."
    },
    {
      "indent": 3,
      "text": "[RFC3360] Floyd, S., \"Inappropriate TCP Resets Considered Harmful\", BCP 60, RFC 3360, August 2002, <http://www.rfc-editor.org/info/rfc3360>.",
      "zh-CHS": "[RFC3360]Floyd，S.，“不适当的TCP重置被认为是有害的”，BCP 60，RFC 3360，2002年8月<http://www.rfc-editor.org/info/rfc3360>."
    },
    {
      "indent": 3,
      "text": "[RFC3366] Fairhurst, G. and L. Wood, \"Advice to link designers on link Automatic Repeat reQuest (ARQ)\", BCP 62, RFC 3366, August 2002, <http://www.rfc-editor.org/info/rfc3366>.",
      "zh-CHS": "[RFC3366]Fairhurst，G.和L.Wood，“关于链路自动重复请求（ARQ）的链路设计者建议”，BCP 62，RFC 3366，2002年8月<http://www.rfc-editor.org/info/rfc3366>."
    },
    {
      "indent": 3,
      "text": "[RFC3390] Allman, M., Floyd, S., and C. Partridge, \"Increasing TCP's Initial Window\", RFC 3390, October 2002, <http://www.rfc-editor.org/info/rfc3390>.",
      "zh-CHS": "[RFC3390]奥尔曼，M.，弗洛伊德，S.和C.帕特里奇，“增加TCP的初始窗口”，RFC3902002年10月<http://www.rfc-editor.org/info/rfc3390>."
    },
    {
      "indent": 3,
      "text": "[RFC3439] Bush, R. and D. Meyer, \"Some Internet Architectural Guidelines and Philosophy\", RFC 3439, December 2002, <http://www.rfc-editor.org/info/rfc3439>.",
      "zh-CHS": "[RFC3439]Bush，R.和D.Meyer，“一些互联网架构指南和哲学”，RFC 3439，2002年12月<http://www.rfc-editor.org/info/rfc3439>."
    },
    {
      "indent": 3,
      "text": "[RFC3449] Balakrishnan, H., Padmanabhan, V., Fairhurst, G., and M. Sooriyabandara, \"TCP Performance Implications of Network Path Asymmetry\", BCP 69, RFC 3449, December 2002, <http://www.rfc-editor.org/info/rfc3449>.",
      "zh-CHS": "[RFC3449]Balakrishnan，H.，Padmanabhan，V.，Fairhurst，G.，和M.Sooriyabandara，“网络路径不对称的TCP性能影响”，BCP 69，RFC 3449，2002年12月<http://www.rfc-editor.org/info/rfc3449>."
    },
    {
      "indent": 3,
      "text": "[RFC3465] Allman, M., \"TCP Congestion Control with Appropriate Byte Counting (ABC)\", RFC 3465, February 2003, <http://www.rfc-editor.org/info/rfc3465>.",
      "zh-CHS": "[RFC3465]Allman，M.“具有适当字节计数的TCP拥塞控制（ABC）”，RFC 3465，2003年2月<http://www.rfc-editor.org/info/rfc3465>."
    },
    {
      "indent": 3,
      "text": "[RFC3481] Inamura, H., Montenegro, G., Ludwig, R., Gurtov, A., and F. Khafizov, \"TCP over Second (2.5G) and Third (3G) Generation Wireless Networks\", BCP 71, RFC 3481, February 2003, <http://www.rfc-editor.org/info/rfc3481>.",
      "zh-CHS": "[RFC3481]Inamura，H.，黑山，G.，路德维希，R.，Gurtov，A.，和F.Khafizov，“第二代（2.5G）和第三代（3G）无线网络上的TCP”，BCP 71，RFC 3481，2003年2月<http://www.rfc-editor.org/info/rfc3481>."
    },
    {
      "indent": 3,
      "text": "[RFC3493] Gilligan, R., Thomson, S., Bound, J., McCann, J., and W. Stevens, \"Basic Socket Interface Extensions for IPv6\", RFC 3493, February 2003, <http://www.rfc-editor.org/info/rfc3493>.",
      "zh-CHS": "[RFC3493]Gilligan，R.，Thomson，S.，Bound，J.，McCann，J.，和W.Stevens，“IPv6的基本套接字接口扩展”，RFC 3493，2003年2月<http://www.rfc-editor.org/info/rfc3493>."
    },
    {
      "indent": 3,
      "text": "[RFC3522] Ludwig, R. and M. Meyer, \"The Eifel Detection Algorithm for TCP\", RFC 3522, April 2003, <http://www.rfc-editor.org/info/rfc3522>.",
      "zh-CHS": "[RFC3522]Ludwig，R.和M.Meyer，“TCP的Eifel检测算法”，RFC 3522，2003年4月<http://www.rfc-editor.org/info/rfc3522>."
    },
    {
      "indent": 3,
      "text": "[RFC3540] Spring, N., Wetherall, D., and D. Ely, \"Robust Explicit Congestion Notification (ECN) Signaling with Nonces\", RFC 3540, June 2003, <http://www.rfc-editor.org/info/rfc3540>.",
      "zh-CHS": "[RFC3540]Spring，N.，Weterral，D.，和D.Ely，“带有nonce的鲁棒显式拥塞通知（ECN）信令”，RFC 35402003年6月<http://www.rfc-editor.org/info/rfc3540>."
    },
    {
      "indent": 3,
      "text": "[RFC3649] Floyd, S., \"HighSpeed TCP for Large Congestion Windows\", RFC 3649, December 2003, <http://www.rfc-editor.org/info/rfc3649>.",
      "zh-CHS": "[RFC3649]Floyd，S.，“用于大拥塞窗口的高速TCP”，RFC 3649，2003年12月<http://www.rfc-editor.org/info/rfc3649>."
    },
    {
      "indent": 3,
      "text": "[RFC3708] Blanton, E. and M. Allman, \"Using TCP Duplicate Selective Acknowledgement (DSACKs) and Stream Control Transmission Protocol (SCTP) Duplicate Transmission Sequence Numbers (TSNs) to Detect Spurious Retransmissions\", RFC 3708, February 2004, <http://www.rfc-editor.org/info/rfc3708>.",
      "zh-CHS": "[RFC3708]Blanton，E.和M.Allman，“使用TCP重复选择确认（DSACKs）和流控制传输协议（SCTP）重复传输序列号（TSN）来检测虚假重传”，RFC 3708，2004年2月<http://www.rfc-editor.org/info/rfc3708>."
    },
    {
      "indent": 3,
      "text": "[RFC3742] Floyd, S., \"Limited Slow-Start for TCP with Large Congestion Windows\", RFC 3742, March 2004, <http://www.rfc-editor.org/info/rfc3742>.",
      "zh-CHS": "[RFC3742]Floyd，S.，“具有大拥塞窗口的TCP有限慢启动”，RFC 3742，2004年3月<http://www.rfc-editor.org/info/rfc3742>."
    },
    {
      "indent": 3,
      "text": "[RFC3819] Karn, P., Bormann, C., Fairhurst, G., Grossman, D., Ludwig, R., Mahdavi, J., Montenegro, G., Touch, J., and L. Wood, \"Advice for Internet Subnetwork Designers\", BCP 89, RFC 3819, July 2004, <http://www.rfc-editor.org/info/rfc3819>.",
      "zh-CHS": "[RFC3819]Karn，P.，Bormann，C.，Fairhurst，G.，Grossman，D.，路德维希，R.，Mahdavi，J.，黑山，G.，Touch，J.，和L.Wood，“互联网子网络设计师的建议”，BCP 89，RFC 3819，2004年7月<http://www.rfc-editor.org/info/rfc3819>."
    },
    {
      "indent": 3,
      "text": "[RFC4015] Ludwig, R. and A. Gurtov, \"The Eifel Response Algorithm for TCP\", RFC 4015, February 2005, <http://www.rfc-editor.org/info/rfc4015>.",
      "zh-CHS": "[RFC4015]Ludwig，R.和A.Gurtov，“TCP的Eifel响应算法”，RFC 4015，2005年2月<http://www.rfc-editor.org/info/rfc4015>."
    },
    {
      "indent": 3,
      "text": "[RFC4022] Raghunarayan, R., \"Management Information Base for the Transmission Control Protocol (TCP)\", RFC 4022, March 2005, <http://www.rfc-editor.org/info/rfc4022>.",
      "zh-CHS": "[RFC4022]Raghunarayan，R.，“传输控制协议（TCP）的管理信息库”，RFC4022，2005年3月<http://www.rfc-editor.org/info/rfc4022>."
    },
    {
      "indent": 3,
      "text": "[RFC4653] Bhandarkar, S., Reddy, A., Allman, M., and E. Blanton, \"Improving the Robustness of TCP to Non-Congestion Events\", RFC 4653, August 2006, <http://www.rfc-editor.org/info/rfc4653>.",
      "zh-CHS": "[RFC4653]Bhandarkar，S.，Reddy，A.，Allman，M.，和E.Blanton，“提高TCP对非拥塞事件的鲁棒性”，RFC 46532006年8月<http://www.rfc-editor.org/info/rfc4653>."
    },
    {
      "indent": 3,
      "text": "[RFC4727] Fenner, B., \"Experimental Values In IPv4, IPv6, ICMPv4, ICMPv6, UDP, and TCP Headers\", RFC 4727, November 2006, <http://www.rfc-editor.org/info/rfc4727>.",
      "zh-CHS": "[RFC4727]Fenner，B.“IPv4、IPv6、ICMPv4、ICMPv6、UDP和TCP报头中的实验值”，RFC 4727，2006年11月<http://www.rfc-editor.org/info/rfc4727>."
    },
    {
      "indent": 3,
      "text": "[RFC4774] Floyd, S., \"Specifying Alternate Semantics for the Explicit Congestion Notification (ECN) Field\", BCP 124, RFC 4774, November 2006, <http://www.rfc-editor.org/info/rfc4774>.",
      "zh-CHS": "[RFC4774]Floyd，S.，“为显式拥塞通知（ECN）字段指定替代语义”，BCP 124，RFC 4774，2006年11月<http://www.rfc-editor.org/info/rfc4774>."
    },
    {
      "indent": 3,
      "text": "[RFC4782] Floyd, S., Allman, M., Jain, A., and P. Sarolahti, \"Quick-Start for TCP and IP\", RFC 4782, January 2007, <http://www.rfc-editor.org/info/rfc4782>.",
      "zh-CHS": "[RFC4782]Floyd，S.，Allman，M.，Jain，A.，和P.Sarolahti，“TCP和IP的快速启动”，RFC 4782，2007年1月<http://www.rfc-editor.org/info/rfc4782>."
    },
    {
      "indent": 3,
      "text": "[RFC4821] Mathis, M. and J. Heffner, \"Packetization Layer Path MTU Discovery\", RFC 4821, March 2007, <http://www.rfc-editor.org/info/rfc4821>.",
      "zh-CHS": "[RFC4821]Mathis，M.和J.Heffner，“打包层路径MTU发现”，RFC 48212007年3月<http://www.rfc-editor.org/info/rfc4821>."
    },
    {
      "indent": 3,
      "text": "[RFC4898] Mathis, M., Heffner, J., and R. Raghunarayan, \"TCP Extended Statistics MIB\", RFC 4898, May 2007, <http://www.rfc-editor.org/info/rfc4898>.",
      "zh-CHS": "[RFC4898]Mathis，M.，Heffner，J.和R.Raghunarayan，“TCP扩展统计MIB”，RFC 4898，2007年5月<http://www.rfc-editor.org/info/rfc4898>."
    },
    {
      "indent": 3,
      "text": "[RFC4953] Touch, J., \"Defending TCP Against Spoofing Attacks\", RFC 4953, July 2007, <http://www.rfc-editor.org/info/rfc4953>.",
      "zh-CHS": "[RFC4953]Touch，J.“保护TCP免受欺骗攻击”，RFC 49532007年7月<http://www.rfc-editor.org/info/rfc4953>."
    },
    {
      "indent": 3,
      "text": "[RFC4987] Eddy, W., \"TCP SYN Flooding Attacks and Common Mitigations\", RFC 4987, August 2007, <http://www.rfc-editor.org/info/rfc4987>.",
      "zh-CHS": "[RFC4987]Eddy，W.“TCP SYN洪泛攻击和常见缓解措施”，RFC 4987，2007年8月<http://www.rfc-editor.org/info/rfc4987>."
    },
    {
      "indent": 3,
      "text": "[RFC5033] Floyd, S. and M. Allman, \"Specifying New Congestion Control Algorithms\", BCP 133, RFC 5033, August 2007, <http://www.rfc-editor.org/info/rfc5033>.",
      "zh-CHS": "[RFC5033]Floyd，S.和M.Allman，“指定新的拥塞控制算法”，BCP 133，RFC 5033，2007年8月<http://www.rfc-editor.org/info/rfc5033>."
    },
    {
      "indent": 3,
      "text": "[RFC5166] Floyd, S., \"Metrics for the Evaluation of Congestion Control Mechanisms\", RFC 5166, March 2008, <http://www.rfc-editor.org/info/rfc5166>.",
      "zh-CHS": "[RFC5166]Floyd，S.，“拥塞控制机制评估指标”，RFC 5166，2008年3月<http://www.rfc-editor.org/info/rfc5166>."
    },
    {
      "indent": 3,
      "text": "[RFC5461] Gont, F., \"TCP's Reaction to Soft Errors\", RFC 5461, February 2009, <http://www.rfc-editor.org/info/rfc5461>.",
      "zh-CHS": "[RFC5461]Gont，F.，“TCP对软错误的反应”，RFC 54612009年2月<http://www.rfc-editor.org/info/rfc5461>."
    },
    {
      "indent": 3,
      "text": "[RFC5482] Eggert, L. and F. Gont, \"TCP User Timeout Option\", RFC 5482, March 2009, <http://www.rfc-editor.org/info/rfc5482>.",
      "zh-CHS": "[RFC5482]Eggert，L.和F.Gont，“TCP用户超时选项”，RFC 54822009年3月<http://www.rfc-editor.org/info/rfc5482>."
    },
    {
      "indent": 3,
      "text": "[RFC5562] Kuzmanovic, A., Mondal, A., Floyd, S., and K. Ramakrishnan, \"Adding Explicit Congestion Notification (ECN) Capability to TCP's SYN/ACK Packets\", RFC 5562, June 2009, <http://www.rfc-editor.org/info/rfc5562>.",
      "zh-CHS": "[RFC5562]Kuzmanovic，A.，Mondal，A.，Floyd，S.，和K.Ramakrishnan，“向TCP的SYN/ACK数据包添加显式拥塞通知（ECN）功能”，RFC 55622009年6月<http://www.rfc-editor.org/info/rfc5562>."
    },
    {
      "indent": 3,
      "text": "[RFC5681] Allman, M., Paxson, V., and E. Blanton, \"TCP Congestion Control\", RFC 5681, September 2009, <http://www.rfc-editor.org/info/rfc5681>.",
      "zh-CHS": "[RFC5681]Allman，M.，Paxson，V.和E.Blanton，“TCP拥塞控制”，RFC 56812009年9月<http://www.rfc-editor.org/info/rfc5681>."
    },
    {
      "indent": 3,
      "text": "[RFC5682] Sarolahti, P., Kojo, M., Yamamoto, K., and M. Hata, \"Forward RTO-Recovery (F-RTO): An Algorithm for Detecting Spurious Retransmission Timeouts with TCP\", RFC 5682, September 2009, <http://www.rfc-editor.org/info/rfc5682>.",
      "zh-CHS": "[RFC5682]Sarolahti，P.，Kojo，M.，Yamamoto，K.，和M.Hata，“前向RTO恢复（F-RTO）：使用TCP检测虚假重传超时的算法”，RFC 5682，2009年9月<http://www.rfc-editor.org/info/rfc5682>."
    },
    {
      "indent": 3,
      "text": "[RFC5690] Floyd, S., Arcia, A., Ros, D., and J. Iyengar, \"Adding Acknowledgement Congestion Control to TCP\", RFC 5690, February 2010, <http://www.rfc-editor.org/info/rfc5690>.",
      "zh-CHS": "[RFC5690]Floyd，S.，Arcia，A.，Ros，D.，和J.Iyengar，“将确认拥塞控制添加到TCP”，RFC 56902010年2月<http://www.rfc-editor.org/info/rfc5690>."
    },
    {
      "indent": 3,
      "text": "[RFC5783] Welzl, M. and W. Eddy, \"Congestion Control in the RFC Series\", RFC 5783, February 2010, <http://www.rfc-editor.org/info/rfc5783>.",
      "zh-CHS": "[RFC5783]Welzl，M.和W.Eddy，“RFC系列中的拥塞控制”，RFC 5783，2010年2月<http://www.rfc-editor.org/info/rfc5783>."
    },
    {
      "indent": 3,
      "text": "[RFC5827] Allman, M., Avrachenkov, K., Ayesta, U., Blanton, J., and P. Hurtig, \"Early Retransmit for TCP and Stream Control Transmission Protocol (SCTP)\", RFC 5827, May 2010, <http://www.rfc-editor.org/info/rfc5827>.",
      "zh-CHS": "[RFC5827]Allman，M.，Avrachenkov，K.，Ayesta，U.，Blanton，J.，和P.Hurtig，“TCP和流控制传输协议（SCTP）的早期重传”，RFC 5827，2010年5月<http://www.rfc-editor.org/info/rfc5827>."
    },
    {
      "indent": 3,
      "text": "[RFC5925] Touch, J., Mankin, A., and R. Bonica, \"The TCP Authentication Option\", RFC 5925, June 2010, <http://www.rfc-editor.org/info/rfc5925>.",
      "zh-CHS": "[RFC5925]Touch，J.，Mankin，A.，和R.Bonica，“TCP认证选项”，RFC 59252010年6月<http://www.rfc-editor.org/info/rfc5925>."
    },
    {
      "indent": 3,
      "text": "[RFC5926] Lebovitz, G. and E. Rescorla, \"Cryptographic Algorithms for the TCP Authentication Option (TCP-AO)\", RFC 5926, June 2010, <http://www.rfc-editor.org/info/rfc5926>.",
      "zh-CHS": "[RFC5926]Lebovitz，G.和E.Rescorla，“TCP认证选项（TCP-AO）的加密算法”，RFC 59262010年6月<http://www.rfc-editor.org/info/rfc5926>."
    },
    {
      "indent": 3,
      "text": "[RFC5927] Gont, F., \"ICMP Attacks against TCP\", RFC 5927, July 2010, <http://www.rfc-editor.org/info/rfc5927>.",
      "zh-CHS": "[RFC5927]Gont，F.，“针对TCP的ICMP攻击”，RFC 5927，2010年7月<http://www.rfc-editor.org/info/rfc5927>."
    },
    {
      "indent": 3,
      "text": "[RFC5961] Ramaiah, A., Stewart, R., and M. Dalal, \"Improving TCP's Robustness to Blind In-Window Attacks\", RFC 5961, August 2010, <http://www.rfc-editor.org/info/rfc5961>.",
      "zh-CHS": "[RFC5961]Ramaiah，A.，Stewart，R.，和M.Dalal，“提高TCP对窗口盲攻击的鲁棒性”，RFC 59612010年8月<http://www.rfc-editor.org/info/rfc5961>."
    },
    {
      "indent": 3,
      "text": "[RFC6013] Simpson, W., \"TCP Cookie Transactions (TCPCT)\", RFC 6013, January 2011, <http://www.rfc-editor.org/info/rfc6013>.",
      "zh-CHS": "[RFC6013]辛普森，W.“TCP Cookie事务（TCPCT）”，RFC6013，2011年1月<http://www.rfc-editor.org/info/rfc6013>."
    },
    {
      "indent": 3,
      "text": "[RFC6056] Larsen, M. and F. Gont, \"Recommendations for Transport-Protocol Port Randomization\", BCP 156, RFC 6056, January 2011, <http://www.rfc-editor.org/info/rfc6056>.",
      "zh-CHS": "[RFC6056]Larsen，M.和F.Gont，“运输协议端口随机化建议”，BCP 156，RFC 6056，2011年1月<http://www.rfc-editor.org/info/rfc6056>."
    },
    {
      "indent": 3,
      "text": "[RFC6069] Zimmermann, A. and A. Hannemann, \"Making TCP More Robust to Long Connectivity Disruptions (TCP-LCD)\", RFC 6069, December 2010, <http://www.rfc-editor.org/info/rfc6069>.",
      "zh-CHS": "[RFC6069]Zimmermann，A.和A.Hannemann，“使TCP对长时间连接中断（TCP-LCD）更加健壮”，RFC 6069，2010年12月<http://www.rfc-editor.org/info/rfc6069>."
    },
    {
      "indent": 3,
      "text": "[RFC6077] Papadimitriou, D., Welzl, M., Scharf, M., and B. Briscoe, \"Open Research Issues in Internet Congestion Control\", RFC 6077, February 2011, <http://www.rfc-editor.org/info/rfc6077>.",
      "zh-CHS": "[RFC6077]Papadimitriou，D.，Welzl，M.，Scharf，M.，和B.Briscoe，“互联网拥塞控制的开放研究问题”，RFC 6077，2011年2月<http://www.rfc-editor.org/info/rfc6077>."
    },
    {
      "indent": 3,
      "text": "[RFC6093] Gont, F. and A. Yourtchenko, \"On the Implementation of the TCP Urgent Mechanism\", RFC 6093, January 2011, <http://www.rfc-editor.org/info/rfc6093>.",
      "zh-CHS": "[RFC6093]Gont，F.和A.Yourtchenko，“关于TCP紧急机制的实施”，RFC 6093，2011年1月<http://www.rfc-editor.org/info/rfc6093>."
    },
    {
      "indent": 3,
      "text": "[RFC6181] Bagnulo, M., \"Threat Analysis for TCP Extensions for Multipath Operation with Multiple Addresses\", RFC 6181, March 2011, <http://www.rfc-editor.org/info/rfc6181>.",
      "zh-CHS": "[RFC6181]Bagnulo，M.，“具有多个地址的多路径操作的TCP扩展的威胁分析”，RFC 61812011年3月<http://www.rfc-editor.org/info/rfc6181>."
    },
    {
      "indent": 3,
      "text": "[RFC6182] Ford, A., Raiciu, C., Handley, M., Barre, S., and J. Iyengar, \"Architectural Guidelines for Multipath TCP Development\", RFC 6182, March 2011, <http://www.rfc-editor.org/info/rfc6182>.",
      "zh-CHS": "[RFC6182]福特，A.，雷丘，C.，汉德利，M.，巴尔，S.，和J.艾扬格，“多路径TCP开发的架构指南”，RFC6182，2011年3月<http://www.rfc-editor.org/info/rfc6182>."
    },
    {
      "indent": 3,
      "text": "[RFC6191] Gont, F., \"Reducing the TIME-WAIT State Using TCP Timestamps\", BCP 159, RFC 6191, April 2011, <http://www.rfc-editor.org/info/rfc6191>.",
      "zh-CHS": "[RFC6191]Gont，F.，“使用TCP时间戳减少等待时间”，BCP 159，RFC 61912011年4月<http://www.rfc-editor.org/info/rfc6191>."
    },
    {
      "indent": 3,
      "text": "[RFC6247] Eggert, L., \"Moving the Undeployed TCP Extensions RFC 1072, RFC 1106, RFC 1110, RFC 1145, RFC 1146, RFC 1379, RFC 1644, and RFC 1693 to Historic Status\", RFC 6247, May 2011, <http://www.rfc-editor.org/info/rfc6247>.",
      "zh-CHS": "[RFC6247]Eggert，L.“将未部署的TCP扩展RFC 1072、RFC 1106、RFC 1110、RFC 1145、RFC 1146、RFC 1379、RFC 1644和RFC 1693移动到历史状态”，RFC 6247，2011年5月<http://www.rfc-editor.org/info/rfc6247>."
    },
    {
      "indent": 3,
      "text": "[RFC6298] Paxson, V., Allman, M., Chu, J., and M. Sargent, \"Computing TCP's Retransmission Timer\", RFC 6298, June 2011, <http://www.rfc-editor.org/info/rfc6298>.",
      "zh-CHS": "[RFC6298]Paxson，V.，Allman，M.，Chu，J.，和M.Sargent，“计算TCP的重传计时器”，RFC 62982011年6月<http://www.rfc-editor.org/info/rfc6298>."
    },
    {
      "indent": 3,
      "text": "[RFC6335] Cotton, M., Eggert, L., Touch, J., Westerlund, M., and S. Cheshire, \"Internet Assigned Numbers Authority (IANA) Procedures for the Management of the Service Name and Transport Protocol Port Number Registry\", BCP 165, RFC 6335, August 2011, <http://www.rfc-editor.org/info/rfc6335>.",
      "zh-CHS": "[RFC6335]Cotton，M.，Eggert，L.，Touch，J.，Westerlund，M.，和S.Cheshire，“互联网分配号码管理局（IANA）服务名称和传输协议端口号注册管理程序”，BCP 165，RFC 63352011年8月<http://www.rfc-editor.org/info/rfc6335>."
    },
    {
      "indent": 3,
      "text": "[RFC6349] Constantine, B., Forget, G., Geib, R., and R. Schrage, \"Framework for TCP Throughput Testing\", RFC 6349, August 2011, <http://www.rfc-editor.org/info/rfc6349>.",
      "zh-CHS": "[RFC6349]Constantine，B.，Forget，G.，Geib，R.和R.Schrage，“TCP吞吐量测试框架”，RFC 6349，2011年8月<http://www.rfc-editor.org/info/rfc6349>."
    },
    {
      "indent": 3,
      "text": "[RFC6356] Raiciu, C., Handley, M., and D. Wischik, \"Coupled Congestion Control for Multipath Transport Protocols\", RFC 6356, October 2011, <http://www.rfc-editor.org/info/rfc6356>.",
      "zh-CHS": "[RFC6356]Raiciu，C.，Handley，M.，和D.Wischik，“多路径传输协议的耦合拥塞控制”，RFC 63562011年10月<http://www.rfc-editor.org/info/rfc6356>."
    },
    {
      "indent": 3,
      "text": "[RFC6429] Bashyam, M., Jethanandani, M., and A. Ramaiah, \"TCP Sender Clarification for Persist Condition\", RFC 6429, December 2011, <http://www.rfc-editor.org/info/rfc6429>.",
      "zh-CHS": "[RFC6429]Bashyam，M.，Jethanandani，M.，和A.Ramaiah，“TCP发送方对持续状态的澄清”，RFC 64292011年12月<http://www.rfc-editor.org/info/rfc6429>."
    },
    {
      "indent": 3,
      "text": "[RFC6528] Gont, F. and S. Bellovin, \"Defending against Sequence Number Attacks\", RFC 6528, February 2012, <http://www.rfc-editor.org/info/rfc6528>.",
      "zh-CHS": "[RFC6528]Gont，F.和S.Bellovin，“防御序列号攻击”，RFC 65282012年2月<http://www.rfc-editor.org/info/rfc6528>."
    },
    {
      "indent": 3,
      "text": "[RFC6582] Henderson, T., Floyd, S., Gurtov, A., and Y. Nishida, \"The NewReno Modification to TCP's Fast Recovery Algorithm\", RFC 6582, April 2012, <http://www.rfc-editor.org/info/rfc6582>.",
      "zh-CHS": "[RFC6582]Henderson，T.，Floyd，S.，Gurtov，A.，和Y.Nishida，“TCP快速恢复算法的NewReno修改”，RFC 6582，2012年4月<http://www.rfc-editor.org/info/rfc6582>."
    },
    {
      "indent": 3,
      "text": "[RFC6633] Gont, F., \"Deprecation of ICMP Source Quench Messages\", RFC 6633, May 2012, <http://www.rfc-editor.org/info/rfc6633>.",
      "zh-CHS": "[RFC6633]Gont，F.，“ICMP源猝灭消息的弃用”，RFC 6633，2012年5月<http://www.rfc-editor.org/info/rfc6633>."
    },
    {
      "indent": 3,
      "text": "[RFC6675] Blanton, E., Allman, M., Wang, L., Jarvinen, I., Kojo, M., and Y. Nishida, \"A Conservative Loss Recovery Algorithm Based on Selective Acknowledgment (SACK) for TCP\", RFC 6675, August 2012, <http://www.rfc-editor.org/info/rfc6675>.",
      "zh-CHS": "[RFC6675]Blanton，E.，Allman，M.，Wang，L.，Jarvinen，I.，Kojo，M.，和Y.Nishida，“基于TCP选择性确认（SACK）的保守丢失恢复算法”，RFC 66752012年8月<http://www.rfc-editor.org/info/rfc6675>."
    },
    {
      "indent": 3,
      "text": "[RFC6691] Borman, D., \"TCP Options and Maximum Segment Size (MSS)\", RFC 6691, July 2012, <http://www.rfc-editor.org/info/rfc6691>.",
      "zh-CHS": "[RFC6691]Borman，D.，“TCP选项和最大段大小（MSS）”，RFC 66912012年7月<http://www.rfc-editor.org/info/rfc6691>."
    },
    {
      "indent": 3,
      "text": "[RFC6824] Ford, A., Raiciu, C., Handley, M., and O. Bonaventure, \"TCP Extensions for Multipath Operation with Multiple Addresses\", RFC 6824, January 2013, <http://www.rfc-editor.org/info/rfc6824>.",
      "zh-CHS": "[RFC6824]Ford，A.，Raiciu，C.，Handley，M.，和O.Bonaventure，“多地址多路径操作的TCP扩展”，RFC 68242013年1月<http://www.rfc-editor.org/info/rfc6824>."
    },
    {
      "indent": 3,
      "text": "[RFC6846] Pelletier, G., Sandlund, K., Jonsson, L-E., and M. West, \"RObust Header Compression (ROHC): A Profile for TCP/IP (ROHC-TCP)\", RFC 6846, January 2013, <http://www.rfc-editor.org/info/rfc6846>.",
      "zh-CHS": "[RFC6846]Pelletier，G.，Sandlund，K.，Jonsson，L-E.，和M.West，“鲁棒头压缩（ROHC）：TCP/IP配置文件（ROHC-TCP）”，RFC 68462013年1月<http://www.rfc-editor.org/info/rfc6846>."
    },
    {
      "indent": 3,
      "text": "[RFC6897] Scharf, M. and A. Ford, \"Multipath TCP (MPTCP) Application Interface Considerations\", RFC 6897, March 2013, <http://www.rfc-editor.org/info/rfc6897>.",
      "zh-CHS": "[RFC6897]Scharf，M.和A.Ford，“多路径TCP（MPTCP）应用程序接口注意事项”，RFC 68972013年3月<http://www.rfc-editor.org/info/rfc6897>."
    },
    {
      "indent": 3,
      "text": "[RFC6928] Chu, J., Dukkipati, N., Cheng, Y., and M. Mathis, \"Increasing TCP's Initial Window\", RFC 6928, April 2013, <http://www.rfc-editor.org/info/rfc6928>.",
      "zh-CHS": "[RFC6928]Chu，J.，Dukkipati，N.，Cheng，Y.，和M.Mathis，“增加TCP的初始窗口”，RFC 69282013年4月<http://www.rfc-editor.org/info/rfc6928>."
    },
    {
      "indent": 3,
      "text": "[RFC6937] Mathis, M., Dukkipati, N., and Y. Cheng, \"Proportional Rate Reduction for TCP\", RFC 6937, May 2013, <http://www.rfc-editor.org/info/rfc6937>.",
      "zh-CHS": "[RFC6937]Mathis，M.，Dukkipati，N.，和Y.Cheng，“TCP的比例费率降低”，RFC 6937，2013年5月<http://www.rfc-editor.org/info/rfc6937>."
    },
    {
      "indent": 3,
      "text": "[RFC6994] Touch, J., \"Shared Use of Experimental TCP Options\", RFC 6994, August 2013, <http://www.rfc-editor.org/info/rfc6994>.",
      "zh-CHS": "[RFC6994]Touch，J.，“实验TCP选项的共享使用”，RFC 69942013年8月<http://www.rfc-editor.org/info/rfc6994>."
    },
    {
      "indent": 3,
      "text": "[RFC7323] Borman, D., Braden, B., Jacobson, V., and R. Scheffenegger, \"TCP Extensions for High Performance\", RFC 7323, September 2014, <http://www.rfc-editor.org/info/rfc7323>.",
      "zh-CHS": "[RFC7323]Borman，D.，Braden，B.，Jacobson，V.，和R.Scheffenegger，“高性能TCP扩展”，RFC 73232014年9月<http://www.rfc-editor.org/info/rfc7323>."
    },
    {
      "indent": 3,
      "text": "[RFC7413] Cheng, Y., Chu, J., Radhakrishnan, S., and A. Jain, \"TCP Fast Open\", RFC 7413, December 2014, <http://www.rfc-editor.org/info/rfc7413>.",
      "zh-CHS": "[RFC7413]Cheng，Y.，Chu，J.，Radhakrishnan，S.，和A.Jain，“TCP快速开放”，RFC 74132014年12月<http://www.rfc-editor.org/info/rfc7413>."
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[CK73] Cerf, V. and R. Kahn, \"Towards Protocols for Internetwork Communication\", IFIP/TC6.1, NIC 18764, INWG 39, September 1973.",
      "zh-CHS": "[CK73]Cerf，V.和R.Kahn，“网络间通信协议”，IFIP/TC6.1，NIC 18764，INWG 39，1973年9月。"
    },
    {
      "indent": 3,
      "text": "[CTCP] Sridharan, M., Tan, K., Bansal, D., and D. Thaler, \"Compound TCP: A New TCP Congestion Control for High-Speed and Long Distance Networks\", Work in Progress, draft-sridharan-tcpm-ctcp-02, November 2008.",
      "zh-CHS": "[CTCP]Sridharan，M.，Tan，K.，Bansal，D.，和D.Thaler，“复合TCP：用于高速和远程网络的新TCP拥塞控制”，正在进行的工作，草稿-Sridharan-tcpm-CTCP-022008年11月。"
    },
    {
      "indent": 3,
      "text": "[CUBIC] Rhee, I., Xu, L., and S. Ha, \"CUBIC for Fast Long-Distance Networks\", Work in Progress, draft-rhee-tcpm-cubic-02, August 2008.",
      "zh-CHS": "[CUBIC]Rhee，I.，Xu，L.，和S.Ha，“用于快速长途网络的CUBIC”，正在进行的工作，草稿-Rhee-tcpm-CUBIC-022008年8月。"
    },
    {
      "indent": 3,
      "text": "[Errata] RFC Editor, \"RFC Errata\", <http://www.rfc-editor.org/errata.php>.",
      "zh-CHS": "[勘误表]RFC编辑器，“RFC勘误表”<http://www.rfc-editor.org/errata.php>."
    },
    {
      "indent": 3,
      "text": "[HTCP] Leith, D., \"H-TCP: TCP Congestion Control for High Bandwidth-Delay Product Paths\", Work in Progress, draft-leith-tcp-htcp-06, April 2008.",
      "zh-CHS": "[HTCP]Leith，D.，“H-TCP：高带宽延迟乘积路径的TCP拥塞控制”，正在进行的工作，草稿-Leith-TCP-HTCP-06，2008年4月。"
    },
    {
      "indent": 3,
      "text": "[JK92] Jacobson, V. and M. Karels, \"Congestion Avoidance and Control\", November 1992, <ftp://ftp.ee.lbl.gov/papers/congavoid.ps.Z>.",
      "zh-CHS": "[JK92]Jacobson，V.和M.Karels，“拥塞避免和控制”，1992年11月<ftp://ftp.ee.lbl.gov/papers/congavoid.ps.Z>."
    },
    {
      "indent": 3,
      "text": "[Jac88] Jacobson, V., \"Congestion Avoidance and Control\", ACM SIGCOMM 1988 Proceedings, in ACM Computer Communication Review, 18 (4), pp. 314-329, August 1988.",
      "zh-CHS": "[Jac88]Jacobson，V.，“拥塞避免和控制”，ACM SIGCOMM 1988年会议记录，载于《ACM计算机通信评论》，第18（4）页，第314-329页，1988年8月。"
    },
    {
      "indent": 3,
      "text": "[Jacobson] Jacobson, V., \"TCP-IP Mailing List\", Article 167 of comp.protocols.tcp-ip, March 1988, <ftp://ftp.ee.lbl.gov/email/vanj.88mar10.txt>.",
      "zh-CHS": "[Jacobson]Jacobson，V.，“TCP-IP邮件列表”，comp.protocols.TCP-IP第167条，1988年3月<ftp://ftp.ee.lbl.gov/email/vanj.88mar10.txt>."
    },
    {
      "indent": 3,
      "text": "[KP87] Karn, P. and C. Partridge, \"Round Trip Time Estimation\", ACM SIGCOMM 1987 Proceedings, in ACM Computer Communication Review, 17 (5), pp. 2-7, August 1987.",
      "zh-CHS": "[KP87]Karn，P.和C.Partridge，“往返时间估算”，ACM SIGCOMM 1987年会议记录，载于《ACM计算机通信评论》，第17（5）页，第2-7页，1987年8月。"
    },
    {
      "indent": 3,
      "text": "[MAF04] Medina, A., Allman, M., and S. Floyd, \"Measuring the Evolution of Transport Protocols in the Internet\", ACM Computer Communication Review, 35 (2), April 2005.",
      "zh-CHS": "[MAF04]Medina，A.，Allman，M.，和S.Floyd，“测量互联网传输协议的演变”，ACM计算机通信评论，35（2），2005年4月。"
    },
    {
      "indent": 3,
      "text": "[MM96] Mathis, M. and J. Mahdavi, \"Forward Acknowledgement: Refining TCP Congestion Control\", ACM SIGCOMM 1996 Proceedings, in ACM Computer Communication Review 26 (4), pp. 281-292, October 1996.",
      "zh-CHS": "[MM96]Mathis，M.和J.Mahdavi，“转发确认：改进TCP拥塞控制”，ACM SIGCOMM 1996年会议记录，载于《ACM计算机通信评论》26（4），第281-292页，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1016] Prue, W. and J. Postel, \"Something a host could do with source quench: The Source Quench Introduced Delay (SQuID)\", RFC 1016, July 1987, <http://www.rfc-editor.org/info/rfc1016>.",
      "zh-CHS": "[RFC1016]Prue，W.和J.Postel，“主机与源猝灭的关系：源猝灭引入延迟（SQuID）”，RFC 1016，1987年7月<http://www.rfc-editor.org/info/rfc1016>."
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996, <http://www.rfc-editor.org/info/rfc2026>.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月<http://www.rfc-editor.org/info/rfc2026>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC2474] Nichols, K., Blake, S., Baker, F., and D. Black, \"Definition of the Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998, <http://www.rfc-editor.org/info/rfc2474>.",
      "zh-CHS": "[RFC2474]Nichols，K.，Blake，S.，Baker，F.，和D.Black，“IPv4和IPv6报头中区分服务字段（DS字段）的定义”，RFC 24741998年12月<http://www.rfc-editor.org/info/rfc2474>."
    },
    {
      "indent": 3,
      "text": "[RFC3758] Stewart, R., Ramalho, M., Xie, Q., Tuexen, M., and P. Conrad, \"Stream Control Transmission Protocol (SCTP) Partial Reliability Extension\", RFC 3758, May 2004, <http://www.rfc-editor.org/info/rfc3758>.",
      "zh-CHS": "[RFC3758]Stewart，R.，Ramalho，M.，Xie，Q.，Tuexen，M.，和P.Conrad，“流控制传输协议（SCTP）部分可靠性扩展”，RFC 3758，2004年5月<http://www.rfc-editor.org/info/rfc3758>."
    },
    {
      "indent": 3,
      "text": "[RFC4340] Kohler, E., Handley, M., and S. Floyd, \"Datagram Congestion Control Protocol (DCCP)\", RFC 4340, March 2006, <http://www.rfc-editor.org/info/rfc4340>.",
      "zh-CHS": "[RFC4340]Kohler，E.，Handley，M.和S.Floyd，“数据报拥塞控制协议（DCCP）”，RFC 43402006年3月<http://www.rfc-editor.org/info/rfc4340>."
    },
    {
      "indent": 3,
      "text": "[RFC4341] Floyd, S. and E. Kohler, \"Profile for Datagram Congestion Control Protocol (DCCP) Congestion Control ID 2: TCP-like Congestion Control\", RFC 4341, March 2006, <http://www.rfc-editor.org/info/rfc4341>.",
      "zh-CHS": "[RFC4341]Floyd，S.和E.Kohler，“数据报拥塞控制协议（DCCP）拥塞控制ID 2的配置文件：类似TCP的拥塞控制”，RFC 43412006年3月<http://www.rfc-editor.org/info/rfc4341>."
    },
    {
      "indent": 3,
      "text": "[RFC6115] Li, T., \"Recommendation for a Routing Architecture\", RFC 6115, February 2011, <http://www.rfc-editor.org/info/rfc6115>.",
      "zh-CHS": "[RFC6115]Li，T.，“路由架构的建议”，RFC61152011年2月<http://www.rfc-editor.org/info/rfc6115>."
    },
    {
      "indent": 3,
      "text": "[SCWA99] Savage, S., Cardwell, N., Wetherall, D., and T. Anderson, \"TCP Congestion Control with a Misbehaving Receiver\", ACM Computer Communication Review, 29 (5), pp. 71-78, October 1999.",
      "zh-CHS": "[SCWA99]Savage，S.，Cardwell，N.，Wetheral，D.，和T.Anderson，“使用行为不当接收器的TCP拥塞控制”，ACM计算机通信评论，29（5），第71-78页，1999年10月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "This document grew out of a discussion on the end2end-interest mailing list, the public list of the End-to-End Research Group of the IRTF, and continued development under the IETF's TCP Maintenance and Minor Extensions (TCPM) working group. We thank Mark Allman, Yuchung Cheng, Ted Faber, Gorry Fairhurst, Sally Floyd, Janardhan Iyengar, Reiner Ludwig, Pekka Savola, and Joe Touch for their contributions, in particular. Keith McCloghrie provided some useful notes and clarification on the various MIB-related RFCs.",
      "zh-CHS": "本文件源于对End2 End interest邮件列表、IRTF端到端研究组的公开列表以及IETF的TCP维护和小型扩展（TCPM）工作组下的持续开发的讨论。我们特别感谢马克·奥尔曼、郑宇忠、特德·费伯、戈里·费尔赫斯特、萨利·弗洛伊德、贾纳丹·艾扬格、雷纳·路德维格、佩卡·萨沃拉和乔·图奇的贡献。Keith McCloghrie就各种MIB相关RFC提供了一些有用的注释和说明。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Martin Duke F5 Networks 401 Elliott Ave W Seattle, WA 98119 United States",
      "zh-CHS": "美国华盛顿州西雅图西艾略特大道401号马丁杜克F5网络公司，邮编：98119"
    },
    {
      "indent": 3,
      "text": "Phone: 206-272-7537 EMail: m.duke@f5.com",
      "zh-CHS": "电话：206-272-7537电子邮件：m。duke@f5.com"
    },
    {
      "indent": 3,
      "text": "Robert Braden USC Information Sciences Institute Marina del Rey, CA 90292-6695 United States",
      "zh-CHS": "Robert Braden USC信息科学研究所Marina del Rey，加利福尼亚州，美国90292-6695"
    },
    {
      "indent": 3,
      "text": "Phone: 310-448-9173 EMail: braden@isi.edu",
      "zh-CHS": "电话：310-448-9173电子邮件：braden@isi.edu"
    },
    {
      "indent": 3,
      "text": "Wesley M. Eddy MTI Systems 18013 Cleveland Parkway Suite 170 Cleveland, OH 44135 United States",
      "zh-CHS": "美国俄亥俄州克利夫兰市克利夫兰公园路170号韦斯利M.埃迪MTI系统18013套房，邮编：44135"
    },
    {
      "indent": 3,
      "text": "Phone: 216-433-6682 EMail: wes@mti-systems.com",
      "zh-CHS": "电话：216-433-6682电子邮件：wes@mti-系统网"
    },
    {
      "indent": 3,
      "text": "Ethan Blanton Interrupt Sciences",
      "zh-CHS": "伊桑·布兰顿"
    },
    {
      "indent": 3,
      "text": "EMail: elb@interruptsciences.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Alexander Zimmermann NetApp, Inc. Sonnenallee 1 Kirchheim 85551 Germany",
      "zh-CHS": "Alexander Zimmermann NetApp，Inc.Sonnenalee 1 Kirchheim 85551德国"
    },
    {
      "indent": 3,
      "text": "Phone: +49 89 900594712\nEMail: alexander.zimmermann@netapp.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}