{
  "title": {
    "text": "RFC 7566: Enumservice Registration for 'acct' URI",
    "zh-CHS": "RFC 7566"
  },
  "number": 7566,
  "created_at": "2021-10-31 04:19:22.190716+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                           L. Goix\nRequest for Comments: 7566                   Econocom-Osiatis Ingenierie\nCategory: Experimental                                             K. Li\nISSN: 2070-1721                                               Individual\n                                                               June 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Enumservice Registration for 'acct' URI",
      "zh-CHS": "“帐户”URI的枚举服务注册"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document registers an E.164 Number Mapping (ENUM) service for 'acct' URIs (Uniform Resource Identifiers).",
      "zh-CHS": "本文档为“acct”URI（统一资源标识符）注册了E.164数字映射（ENUM）服务。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为检查、实验实施和评估而发布的。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文档为互联网社区定义了一个实验协议。这是对RFC系列的贡献，独立于任何其他RFC流。RFC编辑器已选择自行发布此文档，并且未声明其对实现或部署的价值。RFC编辑批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7566.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7566."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................2\n3. Use Cases .......................................................2\n   3.1. Reverse Phone Lookup .......................................2\n   3.2. Routing of Mobile Social Communications ....................3\n4. IANA Registration ...............................................4\n5. Examples ........................................................5\n6. DNS Considerations ..............................................5\n7. Security Considerations .........................................6\n8. IANA Considerations .............................................7\n9. References ......................................................7\n   9.1. Normative References .......................................7\n   9.2. Informative References .....................................8\nAcknowledgements ...................................................8\nAuthors' Addresses .................................................8",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "ENUM (E.164 Number Mapping, [RFC6116]) is a system that uses DNS (Domain Name Service, [RFC1034]) to translate telephone numbers, such as '+44 1632 960123', into URIs (Uniform Resource Identifiers, [RFC3986]), such as 'acct:user@example.com'. ENUM exists primarily to facilitate the interconnection of systems that rely on telephone numbers with those that use URIs to identify resources.",
      "zh-CHS": "ENUM（E.164数字映射[RFC6116]）是一个使用DNS（域名服务[RFC1034]）将电话号码（如“+44 1632 960123”）转换为URI（统一资源标识符[RFC3986]）的系统，如“acct:user@example.com'. ENUM的存在主要是为了促进依赖电话号码的系统与使用URI识别资源的系统之间的互连。"
    },
    {
      "indent": 3,
      "text": "[RFC7565] defines the 'acct' URI scheme as a way to identify a user's account at a service provider.",
      "zh-CHS": "[RFC7565]将“acct”URI方案定义为在服务提供商处标识用户帐户的一种方式。"
    },
    {
      "indent": 3,
      "text": "This document registers an Enumservice for advertising 'acct' URI information associated with an E.164 number.",
      "zh-CHS": "此文档注册Enumservice，用于公布与E.164号码相关联的“帐户”URI信息。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Use Cases",
      "section_title": true,
      "zh-CHS": "3. 用例"
    },
    {
      "indent": 0,
      "text": "3.1. Reverse Phone Lookup",
      "section_title": true,
      "zh-CHS": "3.1. 反向电话查询"
    },
    {
      "indent": 3,
      "text": "In this example, an address book application could issue ENUM queries looking for 'acct' URIs corresponding to phone numbers. This could be used to display the account identifier as well as an icon based on the host (domain) portion of that URI.",
      "zh-CHS": "在本例中，通讯簿应用程序可以发出枚举查询，查找与电话号码对应的“帐户”URI。这可以用于显示帐户标识符以及基于该URI的主机（域）部分的图标。"
    },
    {
      "indent": 3,
      "text": "Similarly, an endpoint could trigger this resolution process during inbound and/or outbound calls to discover an account associated with the remote party.",
      "zh-CHS": "类似地，端点可以在入站和/或出站调用期间触发此解析过程，以发现与远程方关联的帐户。"
    },
    {
      "indent": 3,
      "text": "In general, the provision of an ENUM record to map a phone number into an account may be useful for businesses or professional workers to identify themselves publicly (in a way similar to vCard ENUM records).",
      "zh-CHS": "一般来说，提供ENUM记录以将电话号码映射到帐户可能有助于企业或专业人员公开身份（以类似于vCard ENUM记录的方式）。"
    },
    {
      "indent": 0,
      "text": "3.2. Routing of Mobile Social Communications",
      "section_title": true,
      "zh-CHS": "3.2. 移动社交通信的路由"
    },
    {
      "indent": 3,
      "text": "The Open Mobile Alliance (OMA) develops mobile service enabler specifications, which support the creation of interoperable end-to-end mobile services independent of the underlying wireless platforms, such as GSM (Global System for Mobile communications), UMTS (Universal Mobile Telecommunications System), and LTE (Long Term Evolution) mobile networks. The OMA Social Network Web (SNeW) Enabler Release [OMA-SNeW] has introduced a number of social networking functionalities for mobile subscribers identified by their MSISDN (Mobile Subscriber Integrated Services Digital Network number, a number uniquely identifying a subscription in a mobile network), amongst which is the ability to follow each other's social activities across service providers.",
      "zh-CHS": "开放移动联盟（OMA）制定了移动服务启用码规范，支持创建独立于底层无线平台的互操作端到端移动服务，如GSM（全球移动通信系统）、UMTS（通用移动通信系统）和LTE（长期演进）移动网络。OMA Social Network Web（SNeW）Enabler Release[OMA SNeW]为移动用户引入了许多社交网络功能，这些功能由其MSISDN（移动用户综合服务数字网络号码，唯一标识移动网络中订阅的号码）标识，其中之一就是能够跨服务提供商跟踪彼此的社交活动。"
    },
    {
      "indent": 3,
      "text": "Such functionality requires the global resolution of the MSISDN to the corresponding account and provider, in a way analogous to Multimedia Messaging Service (MMS) routing, to identify the target endpoint for the related messages. Although alternative solutions exist (e.g., based on mobile network operations and/or proprietary lookup techniques), ENUM provides a globally accessible mechanism for enabling resolution from network entities on behalf of an endpoint, or from an endpoint itself.",
      "zh-CHS": "此类功能要求MSISDN以类似于彩信服务（MMS）路由的方式全局解析到相应的帐户和提供商，以识别相关消息的目标端点。尽管存在替代解决方案（例如，基于移动网络操作和/或专有查找技术），但ENUM提供了一种全局可访问的机制，用于支持代表端点的网络实体或端点本身的解析。"
    },
    {
      "indent": 3,
      "text": "For example, a user of a service provider could request to follow the social activities of user '+44 1632 960123'. The home SNeW Server of the former user could perform an ENUM query to identify the 'acct' URI corresponding to that phone number. Based on the resulting URI, the server could then identify the SNeW Server of the target user and route the original user's request to the appropriate endpoint.",
      "zh-CHS": "例如，服务提供商的用户可以请求跟踪用户“+44 1632 960123”的社交活动。前一个用户的家庭SNeW服务器可以执行枚举查询，以标识与该电话号码对应的“acct”URI。根据生成的URI，服务器可以识别目标用户的SNeW服务器，并将原始用户的请求路由到适当的端点。"
    },
    {
      "indent": 3,
      "text": "A similar mechanism can apply to other types of social networking-related messages or other communications targeted to a mobile subscriber.",
      "zh-CHS": "类似的机制可应用于其他类型的社交网络相关消息或针对移动用户的其他通信。"
    },
    {
      "indent": 0,
      "text": "4. IANA Registration",
      "section_title": true,
      "zh-CHS": "4. IANA注册"
    },
    {
      "indent": 3,
      "text": "As defined in [RFC6117], the following is a template covering information needed for the registration of the Enumservice specified in this document:",
      "zh-CHS": "根据[RFC6117]中的定义，以下模板涵盖了注册本文档中指定的Enumservice所需的信息："
    },
    {
      "indent": 11,
      "text": "<record>\n  <class>Application-Based, Ancillary</class>\n  <type>acct</type>\n  <urischeme>acct</urischeme>\n  <functionalspec>\n    <paragraph>\n      This Enumservice indicates that the resource\n      can be identified by the associated 'acct' URI\n      <xref target='RFC7565'/>.\n    </paragraph>\n  </functionalspec>\n  <security>\n    For DNS considerations in avoiding loops when\n    searching for \"acct\" NAPTRs, see\n    <xref type=\"rfc\" data=\"7566\"/>, Section 6.\n    For security considerations, see\n    <xref type=\"rfc\" data=\"7566\"/>, Section 7.\n  </security>\n  <usage>COMMON</usage>\n  <registrationdocs>\n    <xref type=\"rfc\" data=\"7566\"/>\n  </registrationdocs>\n  <requesters>\n    <xref type=\"person\" data=\"Laurent_Walter_Goix\"/>\n  </requesters>\n</record>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "<people>\n  <person id=\"Laurent_Walter_Goix\">\n    <name>Laurent-Walter Goix</name>\n    <org>Econocom-Osiatis Ingenierie</org>\n    <uri>mailto:laurent.goix@econocom-osiatis.com</uri>\n    <updated>2014-06-18</updated>\n  </person>\n</people>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that the registry maintained by IANA is definitive. For the most recent version of the registration, please see the online registry <http://www.iana.org/assignments/enum-services>.",
      "zh-CHS": "请注意，IANA维护的注册表是确定的。有关注册的最新版本，请参阅在线注册<http://www.iana.org/assignments/enum-services>."
    },
    {
      "indent": 0,
      "text": "5. Examples",
      "section_title": true,
      "zh-CHS": "5. 例子"
    },
    {
      "indent": 3,
      "text": "The following is an example of the use of the Enumservice registered by this document in a Naming Authority Pointer (NAPTR) resource record for phone number +44 1632 960123.",
      "zh-CHS": "以下是使用本文档在电话号码+44 1632 960123的命名机构指针（NAPTR）资源记录中注册的Enumservice的示例。"
    },
    {
      "indent": 3,
      "text": "$ORIGIN 3.2.1.0.6.9.2.3.6.1.4.4.e164.arpa.",
      "zh-CHS": "$ORIGIN 3.2.1.0.6.9.2.3.6.1.4.4.e164.arpa。"
    },
    {
      "indent": 3,
      "text": "IN NAPTR 10 100 \"u\" \"E2U+acct\" \"!^.*$!acct:441632960123@foo.com!\" .",
      "zh-CHS": "在NAPTR 10 100“u”E2U+账户中！^.*$！账户：441632960123@foo.com!\" ."
    },
    {
      "indent": 3,
      "text": "IN NAPTR 10 101 \"u\" \"E2U+acct\" \"!^.*$!acct:john.doe@example.com!\" .",
      "zh-CHS": "在NAPTR 10 101“u”中，E2U+acct“！^.*$！acct:john。doe@example.com!\" ."
    },
    {
      "indent": 3,
      "text": "Note that in the first record, the revealed information is limited to the domain of the service provider serving that user, as the userpart of the 'acct' URI simply replicates the phone number.",
      "zh-CHS": "请注意，在第一条记录中，显示的信息仅限于为该用户提供服务的服务提供商的域，因为“acct”URI的userpart只是复制电话号码。"
    },
    {
      "indent": 0,
      "text": "6. DNS Considerations",
      "section_title": true,
      "zh-CHS": "6. DNS注意事项"
    },
    {
      "indent": 3,
      "text": "There may not be any \"E2U+acct\" NAPTRs returned in response to the original ENUM query on the requested telephone number, but other terminal ENUM NAPTRs that include tel: URLs [RFC3966] (e.g., \"voice:tel\", \"pstn:tel\", \"sms:tel\", or \"mms:tel\" -- see [RFC6118]) may be present.",
      "zh-CHS": "可能不存在响应请求电话号码的原始ENUM查询而返回的任何“E2U+acct”NAPTR，但可能存在包括电话：URL[RFC3966]（例如，“语音：电话”、“pstn:电话”、“短信：电话”或“彩信：电话”--参见[RFC6118]）的其他终端ENUM NAPTR。"
    },
    {
      "indent": 3,
      "text": "The application that made that ENUM query may choose to resubmit ENUM queries for any E.164 numbers included in those returned terminal NAPTRs. Doing so may cause a query loop (e.g., the ENUM records returned from subsequent queries may refer to the telephone number already considered). If applications choose to perform subsequent ENUM queries using telephone numbers retrieved from earlier queries, these applications MUST be aware of the potential for query loops and MUST be prepared to abort the set of queries if such a loop is detected.",
      "zh-CHS": "进行枚举查询的应用程序可以选择为返回的终端NAPTR中包含的任何E.164号重新提交枚举查询。这样做可能会导致查询循环（例如，后续查询返回的枚举记录可能会引用已考虑的电话号码）。如果应用程序选择使用从早期查询中检索到的电话号码执行后续枚举查询，则这些应用程序必须了解查询循环的可能性，并且必须准备在检测到此类循环时中止查询集。"
    },
    {
      "indent": 3,
      "text": "This issue is similar to the referential loop issue caused by processing non-terminal NAPTR queries, as mentioned in Section 5.2.1 of [RFC6116], and a similar technique to mitigate this issue can be used; an application searching for records with \"acct\" Enumservice may consider that submitting a chain of more than 5 ENUM queries without finding such a record indicates that a referential loop has been entered, and the chain of queries SHOULD be abandoned.",
      "zh-CHS": "该问题类似于[RFC6116]第5.2.1节中提到的由处理非终端NAPTR查询引起的引用循环问题，可以使用类似的技术来缓解该问题；使用“ACTT”枚举服务搜索记录的应用程序可以考虑提交超过5个枚举查询的链，而不必发现这样的记录指示引用循环已被输入，并且应该放弃查询链。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "DNS, as used by ENUM, is a global, distributed database. Should implementers of this specification use e164.arpa or any other publicly available domain as the tree for maintaining Public Switched Telephone Network (PSTN) Enumservice data, this information would be visible to anyone anonymously.",
      "zh-CHS": "ENUM使用的DNS是一个全局分布式数据库。如果本规范的实施者使用e164.arpa或任何其他公共可用域作为维护公共交换电话网络（PSTN）服务数据的树，则任何人都可以匿名看到该信息。"
    },
    {
      "indent": 3,
      "text": "Carriers, service providers, and other users may choose not to publish such information in the public e164.arpa tree. They may instead simply publish this in an internal ENUM infrastructure that is only able to be queried by trusted elements of their network, thus limiting threats.",
      "zh-CHS": "运营商、服务提供商和其他用户可以选择不在公共e164.arpa树中发布此类信息。相反，他们可以简单地将其发布在内部枚举基础设施中，该基础设施只能由其网络的受信任元素查询，从而限制威胁。"
    },
    {
      "indent": 3,
      "text": "For security considerations that apply to all Enumservices, please refer to [RFC6116], Section 7.",
      "zh-CHS": "有关适用于所有Enumservices的安全注意事项，请参阅[RFC6116]第7节。"
    },
    {
      "indent": 3,
      "text": "It is important to note that the ENUM record itself does not need to contain any personal information but only contains a pointer to an account identifier. This identifier may be queried to discover pointers to personal information (e.g., social-network information) endpoints, and an authorization mechanism may be in place in that context with any level of granularity; these topics are out of scope for this document.",
      "zh-CHS": "请务必注意，枚举记录本身不需要包含任何个人信息，而只包含指向帐户标识符的指针。可以查询该标识符以发现指向个人信息（例如，社交网络信息）端点的指针，并且可以在该上下文中以任何粒度级别设置授权机制；这些主题超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "Technically, ENUM records themselves could contain pointers to the same endpoints. However, the visibility of ENUM records cannot be controlled based on the requesting entity. In that context, the simple mapping of the phone number to the account identifier, notwithstanding the disclosure of the association itself, still enables the reuse of more advanced access policies.",
      "zh-CHS": "从技术上讲，枚举记录本身可以包含指向相同端点的指针。但是，无法基于请求实体控制枚举记录的可见性。在这种情况下，电话号码到帐户标识符的简单映射，尽管关联本身被公开，仍然能够重用更高级的访问策略。"
    },
    {
      "indent": 3,
      "text": "Revealing an 'acct' URI by itself is unlikely to introduce many privacy concerns, although, depending on the structure of the URI, it might reveal the full name or employer of the target. The use of anonymous URIs mitigates this risk.",
      "zh-CHS": "披露“acct”URI本身不太可能引起许多隐私问题，尽管根据URI的结构，它可能会披露目标公司的全名或雇主。匿名URI的使用减轻了这种风险。"
    },
    {
      "indent": 3,
      "text": "Unlike a traditional telephone number, the endpoint identified by an 'acct' URI may require that requesting entities provide cryptographic credentials for authentication and authorization before messages are exchanged. ENUM can actually provide far greater protection from unwanted requesting entities than does the existing PSTN, despite the public availability of ENUM records.",
      "zh-CHS": "与传统电话号码不同，由“acct”URI标识的端点可能要求请求实体在交换消息之前提供用于身份验证和授权的加密凭据。尽管ENUM记录公开可用，但与现有PSTN相比，ENUM实际上可以提供更大的保护，以防止不必要的请求实体。"
    },
    {
      "indent": 3,
      "text": "More serious security concerns are associated with potential attacks against an underlying system (for example, a social-network system) using the 'acct' URI. For this reason, the underlying system should have a number of security requirements that call for authentication, integrity, and confidentiality properties, and similar measures to prevent such attacks. This is out of scope for this document.",
      "zh-CHS": "更严重的安全问题与使用“acct”URI对底层系统（例如，社交网络系统）的潜在攻击有关。因此，底层系统应该有许多安全要求，要求身份验证、完整性和机密性属性，以及防止此类攻击的类似措施。这超出了本文档的范围。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "zh-CHS": "8. IANA考虑"
    },
    {
      "indent": 3,
      "text": "Per this document, IANA has registered the Enumservice with Type \"acct\" according to the definitions in this document, [RFC6116], and [RFC6117].",
      "zh-CHS": "根据本文档，IANA已根据本文档[RFC6116]和[RFC6117]中的定义注册了类型为“acct”的Enumservice。"
    },
    {
      "indent": 3,
      "text": "Details of the registration are given in Section 4.",
      "zh-CHS": "注册详情见第4节。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC1034] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, DOI 10.17487/RFC1034, November 1987, <http://www.rfc-editor.org/info/rfc1034>.",
      "zh-CHS": "[RFC1034]Mockapetris，P.，“域名-概念和设施”，STD 13，RFC 1034，DOI 10.17487/RFC1034，1987年11月<http://www.rfc-editor.org/info/rfc1034>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC3966] Schulzrinne, H., \"The tel URI for Telephone Numbers\", RFC 3966, DOI 10.17487/RFC3966, December 2004, <http://www.rfc-editor.org/info/rfc3966>.",
      "zh-CHS": "[RFC3966]Schulzrinne，H.，“电话号码的电话URI”，RFC 3966，DOI 10.17487/RFC3966，2004年12月<http://www.rfc-editor.org/info/rfc3966>."
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <http://www.rfc-editor.org/info/rfc3986>.",
      "zh-CHS": "[RFC3986]Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，DOI 10.17487/RFC3986，2005年1月<http://www.rfc-editor.org/info/rfc3986>."
    },
    {
      "indent": 3,
      "text": "[RFC6116] Bradner, S., Conroy, L., and K. Fujiwara, \"The E.164 to Uniform Resource Identifiers (URI) Dynamic Delegation Discovery System (DDDS) Application (ENUM)\", RFC 6116, DOI 10.17487/RFC6116, March 2011, <http://www.rfc-editor.org/info/rfc6116>.",
      "zh-CHS": "[RFC6116]Bradner，S.，Conroy，L.，和K.Fujiwara，“E.164到统一资源标识符（URI）动态委托发现系统（DDDS）应用程序（ENUM）”，RFC 6116DOI 10.17487/RFC6116，2011年3月<http://www.rfc-editor.org/info/rfc6116>."
    },
    {
      "indent": 3,
      "text": "[RFC6117] Hoeneisen, B., Mayrhofer, A., and J. Livingood, \"IANA Registration of Enumservices: Guide, Template, and IANA Considerations\", RFC 6117, DOI 10.17487/RFC6117, March 2011, <http://www.rfc-editor.org/info/rfc6117>.",
      "zh-CHS": "[RFC6117]Hoenesen，B.，Mayrhofer，A.，和J.Livingood，“Enumservices的IANA注册：指南，模板和IANA注意事项”，RFC 6117，DOI 10.17487/RFC6117，2011年3月<http://www.rfc-editor.org/info/rfc6117>."
    },
    {
      "indent": 3,
      "text": "[RFC6118] Hoeneisen, B. and A. Mayrhofer, \"Update of Legacy IANA Registrations of Enumservices\", RFC 6118, DOI 10.17487/RFC6118, March 2011, <http://www.rfc-editor.org/info/rfc6118>.",
      "zh-CHS": "[RFC6118]Hoenesen，B.和A.Mayrhofer，“Enumservices传统IANA注册的更新”，RFC 6118，DOI 10.17487/RFC6118，2011年3月<http://www.rfc-editor.org/info/rfc6118>."
    },
    {
      "indent": 3,
      "text": "[RFC7565] Saint-Andre, P., \"The 'acct' URI Scheme\", RFC 7565, DOI 10.17487/RFC7565, May 2015, <http://www.rfc-editor.org/info/rfc7565>.",
      "zh-CHS": "[RFC7565]圣安德烈，P.，“账户URI方案”，RFC 7565，DOI 10.17487/RFC7565，2015年5月<http://www.rfc-editor.org/info/rfc7565>."
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[OMA-SNeW] Open Mobile Alliance, OMA-ER-SNeW-V1_0, \"Social Network Web Enabler\", August 2013, <http://technical.openmobilealliance.org/Technical/ release_program/snew_v1_0.aspx>.",
      "zh-CHS": "[OMA SNeW]开放式移动联盟，OMA-ER-SNeW-V1_0，“社交网络网络启用程序”，2013年8月<http://technical.openmobilealliance.org/Technical/ 发布程序/snew\\u v1\\u 0.aspx>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Gonzalo Salgueiro, Paul Jones, Lawrence Conroy, Enrico Marocco, Bert Greevenbosch, and Bernie Hoeneisen for their valuable feedback to improve this document.",
      "zh-CHS": "作者要感谢Gonzalo Salgueiro、Paul Jones、Lawrence Conroy、Enrico Marocco、Bert Greevenbosch和Bernie Hoeneisen为改进本文件提供的宝贵反馈。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Laurent-Walter Goix Econocom-Osiatis Ingenierie 75 cours Albert Thomas 69003 Lyon France",
      "zh-CHS": "劳伦特·沃尔特·戈伊克斯经济公司奥西亚蒂斯Ingenierie 75 cours阿尔伯特·托马斯69003法国里昂"
    },
    {
      "indent": 3,
      "text": "EMail: laurent.goix@econocom-osiatis.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Kepeng Li Individual 969 Wenyixi Road 311121 Hangzhou China",
      "zh-CHS": "中国杭州市文化西路969号李克鹏个人311121"
    },
    {
      "indent": 3,
      "text": "EMail: kepeng.likp@gmail.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}