{
  "title": {
    "text": "RFC 7917: Advertising Node Administrative Tags in IS-IS",
    "zh-CHS": "RFC 7917"
  },
  "number": 7917,
  "created_at": "2021-11-01 06:28:30.632539+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    P. Sarkar, Ed.\nRequest for Comments: 7917                        Individual Contributor\nCategory: Standards Track                                     H. Gredler\nISSN: 2070-1721                                             RtBrick Inc.\n                                                                S. Hegde\n                                                  Juniper Networks, Inc.\n                                                            S. Litkowski\n                                                             B. Decraene\n                                                                  Orange\n                                                               July 2016",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Advertising Node Administrative Tags in IS-IS",
      "zh-CHS": "IS-IS中的广告节点管理标记"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes an extension to the IS-IS routing protocol to advertise node administrative tags. This optional capability allows tagging and grouping of the nodes in an IS-IS domain. The node administrative tags can be used to express and apply locally defined network policies, thereby providing a very useful operational capability. Node administrative tags may be used by either IS-IS itself or other applications consuming information propagated via IS-IS.",
      "zh-CHS": "本文档描述IS-IS路由协议的扩展，用于公布节点管理标记。此可选功能允许对IS-IS域中的节点进行标记和分组。节点管理标签可用于表示和应用本地定义的网络策略，从而提供非常有用的操作能力。节点管理标记可由IS-IS本身或其他使用通过IS-IS传播的信息的应用程序使用。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7917.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7917."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Requirements Language ......................................3\n2. Node Administrative Tags ........................................3\n3. Node Administrative Tag (Node-Admin-Tag) Sub-TLV ................3\n   3.1. TLV Format .................................................4\n4. Elements of Procedure ...........................................5\n   4.1. Interpretation of Node Administrative Tags .................5\n   4.2. Use of Node Administrative Tags ............................5\n   4.3. Processing Node Administrative Tag Changes .................6\n5. Applications ....................................................7\n6. Security Considerations .........................................7\n7. Operational Considerations ......................................8\n8. Manageability Considerations ....................................8\n9. IANA Considerations .............................................8\n10. References .....................................................9\n   10.1. Normative References ......................................9\n   10.2. Informative References ....................................9\nAcknowledgments ...................................................11\nContributors ......................................................11\nAuthors' Addresses ................................................11",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "It is useful to assign a node administrative tag to a router in the IS-IS domain and use it as an attribute associated with the node. The node administrative tag can be used in variety of applications. For example:",
      "zh-CHS": "将节点管理标记分配给is-is域中的路由器并将其用作与节点关联的属性非常有用。节点管理标记可用于各种应用程序中。例如："
    },
    {
      "indent": 3,
      "text": "(a) Traffic-engineering applications to provide different path-selection criteria.",
      "zh-CHS": "(a) 交通工程应用程序提供不同的路径选择标准。"
    },
    {
      "indent": 3,
      "text": "(b) Preference for, or pruning of, certain paths in Loop-Free Alternate (LFA) [RFC5286] backup selection via local policies as defined in [RFC7916].",
      "zh-CHS": "(b) 通过[RFC7916]中定义的本地策略，优先选择或修剪无循环备用（LFA）[RFC5286]备份选择中的某些路径。"
    },
    {
      "indent": 3,
      "text": "This document provides mechanisms to advertise node administrative tags in IS-IS for various applications, including (but not limited to) route and path selection. Route and path selection functionality applies to both Traffic Engineering (TE) and non-TE applications. Hence, the new sub-TLV for carrying node administrative tags is included in the Router CAPABILITY TLV [RFC4971].",
      "zh-CHS": "本文档提供了在IS-IS中为各种应用程序播发节点管理标记的机制，包括（但不限于）路由和路径选择。路由和路径选择功能适用于交通工程（TE）和非TE应用。因此，用于承载节点管理标签的新子TLV包括在路由器能力TLV[RFC4971]中。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "1.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Node Administrative Tags",
      "section_title": true,
      "zh-CHS": "2. 节点管理标记"
    },
    {
      "indent": 3,
      "text": "An administrative tag is a 32-bit unsigned integer value that can be used to identify a group of nodes in the IS-IS domain. An IS-IS router should advertise in the specific IS-IS level the set of groups of which it is a part.",
      "zh-CHS": "管理标记是32位无符号整数值，可用于标识is-is域中的一组节点。IS-IS路由器应在特定IS-IS级别公布其所属的组集。"
    },
    {
      "indent": 3,
      "text": "As an example, all edge network devices in a given network may be configured with a certain tag value, whereas all core network devices may be configured with another, different tag value.",
      "zh-CHS": "例如，给定网络中的所有边缘网络设备可配置有特定的标签值，而所有核心网络设备可配置有另一个不同的标签值。"
    },
    {
      "indent": 0,
      "text": "3. Node Administrative Tag (Node-Admin-Tag) Sub-TLV",
      "section_title": true,
      "zh-CHS": "3. 节点管理标签（节点管理标签）子TLV"
    },
    {
      "indent": 3,
      "text": "The new sub-TLV defined in this document is carried within an IS-IS Router CAPABILITY TLV (IS-IS TLV type 242) [RFC4971] in the Link State PDUs originated by the device. Router CAPABILITY TLVs [RFC4971] can have \"level-wide\" or \"domain-wide\" flooding scope. The choice of flooding scope in which a specific node administrative tag shall be flooded is purely a matter of local policy and is defined by the operator's usage needs. An operator MAY choose to advertise a set of node administrative tags across levels and another different",
      "zh-CHS": "本文件中定义的新子TLV在由设备发起的链路状态PDU中的is-is路由器能力TLV（is-is TLV类型242）[RFC4971]中携带。路由器功能TLV[RFC4971]可以具有“级别范围”或“域范围”泛洪范围。选择应用特定节点管理标签的应用范围纯粹是本地政策的问题，由运营商的使用需求决定。操作员可以选择跨级别和其他不同的级别公布一组节点管理标记"
    },
    {
      "indent": 3,
      "text": "set of node administrative tags within the specific level. Alternatively, the operator may use the same node administrative tags within both the \"domain-wide\" flooding scope and one or more \"level-wide\" flooding scopes.",
      "zh-CHS": "特定级别内的一组节点管理标记。或者，操作员可以在“域范围”泛洪作用域和一个或多个“级别范围”泛洪作用域内使用相同的节点管理标记。"
    },
    {
      "indent": 3,
      "text": "The format of the Node Administrative Tag (Node-Admin-Tag) sub-TLV (see Section 3.1) does not include a topology identifier. Therefore, it is not possible to indicate a topology-specific context when advertising node administrative tags. Hence, in deployments using multi-topology routing [RFC5120], advertising a separate set of node administrative tags for each topology SHOULD NOT be supported.",
      "zh-CHS": "节点管理标签（节点管理标签）子TLV的格式（见第3.1节）不包括拓扑标识符。因此，在公布节点管理标记时，不可能指示特定于拓扑的上下文。因此，在使用多拓扑路由[RFC5120]的部署中，不应支持为每个拓扑播发一组单独的节点管理标记。"
    },
    {
      "indent": 0,
      "text": "3.1. TLV Format",
      "section_title": true,
      "zh-CHS": "3.1. TLV格式"
    },
    {
      "indent": 3,
      "text": "[RFC4971] defines the Router CAPABILITY TLV, which may be used to advertise properties of the originating router. The payload of the Router CAPABILITY TLV consists of one or more nested Type-Length-Value (TLV) triplets.",
      "zh-CHS": "[RFC4971]定义路由器功能TLV，可用于公布发起路由器的属性。路由器能力TLV的有效负载由一个或多个嵌套类型长度值（TLV）三元组组成。"
    },
    {
      "indent": 3,
      "text": "The new Node-Admin-Tag sub-TLV, like other IS-IS sub-TLVs, is formatted as TLV triplets. Figure 1 below shows the format of the new sub-TLV.",
      "zh-CHS": "与其他IS-IS子TLV一样，新节点管理标记子TLV的格式为TLV三元组。下图1显示了新子TLV的格式。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Administrative Tag #1                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Administrative Tag #2                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n//                                                             //\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Administrative Tag #N                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "Type: 21 (Node-Admin-Tag)",
      "zh-CHS": "类型：21（节点管理标签）"
    },
    {
      "indent": 4,
      "text": "Length: An 8-bit field that indicates the length of the Value portion in octets; this will be a multiple of 4 octets, depending on the number of tags advertised.",
      "zh-CHS": "长度：一个8位字段，以八位字节表示值部分的长度；这将是4个八位字节的倍数，具体取决于广告的标签数量。"
    },
    {
      "indent": 4,
      "text": "Value: Defines the node administrative tags (Administrative Tag #1, Administrative Tag #2, etc.). Multiples of 4 octets.",
      "zh-CHS": "值：定义节点管理标记（管理标记#1、管理标记#2等）。4个八位组的倍数。"
    },
    {
      "indent": 18,
      "text": "Figure 1: IS-IS Node-Admin-Tag Sub-TLV",
      "zh-CHS": "图1:IS-IS节点管理标签子TLV"
    },
    {
      "indent": 0,
      "text": "4. Elements of Procedure",
      "section_title": true,
      "zh-CHS": "4. 程序要素"
    },
    {
      "indent": 0,
      "text": "4.1. Interpretation of Node Administrative Tags",
      "section_title": true,
      "zh-CHS": "4.1. 节点管理标记的解释"
    },
    {
      "indent": 3,
      "text": "The meaning of node administrative tags is generally opaque to IS-IS. A router advertising one or more node administrative tags may be configured to do so without knowing (or even explicitly supporting) the functionality implied by the tag. This section describes general rules, regulations, and guidelines for using and interpreting a node administrative tag; these rules, regulations, and guidelines will facilitate interoperable implementations between vendors.",
      "zh-CHS": "对于is-is，节点管理标记的含义通常是不透明的。可将公布一个或多个节点管理标签的路由器配置为这样做，而不知道（甚至明确支持）该标签隐含的功能。本节介绍使用和解释节点管理标记的一般规则、规定和指南；这些规则、条例和指南将促进供应商之间的互操作实现。"
    },
    {
      "indent": 3,
      "text": "Interpretation of tag values is specific to the administrative domain of a particular network operator. Hence, tag values SHOULD NOT be propagated outside the administrative domain to which they apply. The meaning of a node administrative tag is defined by the network local policy and is controlled via configuration. If a receiving node does not understand the tag value, it ignores the specific tag and floods the Router CAPABILITY TLV without any change, as defined in [RFC4971].",
      "zh-CHS": "标签值的解释特定于特定网络运营商的管理域。因此，标记值不应传播到其应用的管理域之外。节点管理标记的含义由网络本地策略定义，并通过配置进行控制。如果接收节点不理解标记值，它将忽略特定标记，并在不做任何更改的情况下，按照[RFC4971]中的定义，使路由器功能TLV溢出。"
    },
    {
      "indent": 3,
      "text": "The semantics of the tag order has no meaning. There is no implied meaning to the ordering of the tags that indicates a certain operation or set of operations that need to be performed based on the ordering.",
      "zh-CHS": "标记顺序的语义没有任何意义。标记的顺序没有隐含的含义，它指示需要根据顺序执行的特定操作或操作集。"
    },
    {
      "indent": 3,
      "text": "Each tag SHOULD be treated as an independent identifier that may be used in a policy to perform a policy action. Each tag carried by the Node-Admin-Tag sub-TLVs should be used to indicate a characteristic of a node that is independent of the characteristics indicated by other administrative tags within the same instance or another instance of a Node-Admin-Tag sub-TLV. The list of node administrative tags carried in a Node-Admin-Tag sub-TLV MUST be considered as an unordered list. Whilst policies may be implemented based on the presence of multiple tags (e.g., if tag A AND tag B are present), they MUST NOT be reliant upon the order of the tags (i.e., all policies should be considered commutative operations, such that tag A preceding or following tag B does not change their outcome).",
      "zh-CHS": "每个标记都应被视为一个独立的标识符，可以在策略中使用该标识符来执行策略操作。节点管理标签子TLV携带的每个标签应用于指示节点的特征，该特征独立于节点管理标签子TLV的同一实例或另一实例内的其他管理标签指示的特征。节点管理标记子TLV中包含的节点管理标记列表必须视为无序列表。虽然可以基于多个标签的存在来实施策略（例如，如果标签A和标签B存在），但它们不得依赖于标签的顺序（即，所有策略都应被视为交换操作，以便标签B之前或之后的标签A不会改变其结果）。"
    },
    {
      "indent": 0,
      "text": "4.2. Use of Node Administrative Tags",
      "section_title": true,
      "zh-CHS": "4.2. 节点管理标记的使用"
    },
    {
      "indent": 3,
      "text": "The node administrative tags are not meant to be extended by future IS-IS standards. New IS-IS extensions are not expected to require the use of node administrative tags or define well-known tag values. Node administrative tags are for generic use and do not require IANA registration. Future IS-IS extensions requiring well-known values MAY define their own data signaling tailored to the needs of the feature or MAY use the Router CAPABILITY TLV as defined in [RFC4971].",
      "zh-CHS": "节点管理标记不打算被未来的IS-IS标准扩展。新的IS-IS扩展不需要使用节点管理标记或定义已知的标记值。节点管理标记用于一般用途，不需要IANA注册。需要已知值的未来IS-IS扩展可以定义自己的数据信令，以适应功能的需要，或者可以使用[RFC4971]中定义的路由器功能TLV。"
    },
    {
      "indent": 3,
      "text": "Node administrative tags are expected to be associated with a stable attribute. In particular, node administrative tags MUST NOT be associated with something whose state can oscillate frequently, e.g., the reachability of a specific destination.",
      "zh-CHS": "节点管理标记应与稳定属性相关联。特别是，节点管理标记不得与状态可能频繁振荡的事物相关联，例如，特定目的地的可达性。"
    },
    {
      "indent": 3,
      "text": "While no specific limit on the number of node administrative tags that may be advertised has been defined, it is expected that only a modest number of tags will be required in any deployment.",
      "zh-CHS": "虽然尚未对可能公布的节点管理标记的数量定义具体限制，但预计在任何部署中只需要少量的标记。"
    },
    {
      "indent": 0,
      "text": "4.3. Processing Node Administrative Tag Changes",
      "section_title": true,
      "zh-CHS": "4.3. 处理节点管理标记更改"
    },
    {
      "indent": 3,
      "text": "Multiple Node-Admin-Tag sub-TLVs MAY appear in a Router CAPABILITY TLV, or Node-Admin-Tag sub-TLVs MAY be contained in different instances of Router CAPABILITY TLVs. The node administrative tags associated with a node that originates tags for the purpose of any computation or processing at a receiving node SHOULD be a superset of node administrative tags from all the TLVs in all the instances of Router CAPABILITY TLVs received in the Link State PDU(s) advertised by the corresponding IS-IS router. When a Router CAPABILITY TLV is received that changes the set of node administrative tags applicable to any originating node, a receiving node MUST repeat any computation or processing that makes use of node administrative tags.",
      "zh-CHS": "多个节点管理标签子TLV可能出现在路由器功能TLV中，或者节点管理标签子TLV可能包含在路由器功能TLV的不同实例中。与在接收节点处为任何计算或处理目的而发起标记的节点相关联的节点管理标记应该是来自所有TLV的节点管理标记的超集，这些TLV位于由相应IS-IS路由器通告的链路状态PDU中接收的路由器能力TLV的所有实例中。当接收到改变适用于任何发起节点的节点管理标记集的路由器能力TLV时，接收节点必须重复使用节点管理标记的任何计算或处理。"
    },
    {
      "indent": 3,
      "text": "When there is a change to, or removal of, an administrative affiliation of a node, the node MUST re-originate the Router CAPABILITY TLV(s) with the latest set of node administrative tags. On a receiving router, on detecting a change in contents (or removal) of existing Node-Admin-Tag sub-TLV(s) or the addition of new Node-Admin-Tag sub-TLV(s) in any instance of Router CAPABILITY TLV(s), implementations MUST take appropriate measures to update their state according to the changed set of node administrative tags. The exact actions needed will vary, depending on what features are associated with node administrative tags; this topic is outside the scope of this specification.",
      "zh-CHS": "当更改或删除节点的管理从属关系时，该节点必须使用最新的一组节点管理标记重新发起路由器功能TLV。在接收路由器上，当检测到现有节点管理标签子TLV的内容变化（或删除）或在路由器功能TLV的任何实例中添加新的节点管理标签子TLV时，实现必须采取适当措施根据更改的节点管理标签集更新其状态。所需的确切操作将有所不同，具体取决于与节点管理标记关联的功能；本主题不在本规范的范围内。"
    },
    {
      "indent": 0,
      "text": "5. Applications",
      "section_title": true,
      "zh-CHS": "5. 应用"
    },
    {
      "indent": 3,
      "text": "[RFC7777] lists several non-normative examples of how implementations might use node administrative tags. These examples are given only to demonstrate the generic usefulness of the router tagging mechanism. An implementation supporting this specification is not required to implement any of the use cases. The following is a brief list of non-normative use cases listed in [RFC7777]. Please refer to Section 3 of [RFC7777] for more details.",
      "zh-CHS": "[RFC7777]列出了实现如何使用节点管理标记的几个非规范性示例。给出这些示例只是为了证明路由器标记机制的通用性。实现任何用例都不需要支持此规范的实现。以下是[RFC7777]中列出的非规范性用例的简要列表。有关更多详细信息，请参阅[RFC7777]第3节。"
    },
    {
      "indent": 3,
      "text": "1. Auto-discovery of services",
      "zh-CHS": "1. 自动发现服务"
    },
    {
      "indent": 3,
      "text": "2. Policy-based Fast Reroute (FRR)",
      "zh-CHS": "2. 基于策略的快速重路由（FRR）"
    },
    {
      "indent": 7,
      "text": "(a) Administrative limitation of LFA scope",
      "zh-CHS": "(a) LFA范围的行政限制"
    },
    {
      "indent": 7,
      "text": "(b) Optimizing LFA calculations",
      "zh-CHS": "(b) 优化LFA计算"
    },
    {
      "indent": 3,
      "text": "3. Controlling remote LFA tunnel termination",
      "zh-CHS": "3. 控制远程LFA隧道终端"
    },
    {
      "indent": 3,
      "text": "4. Mobile backhaul network service deployment",
      "zh-CHS": "4. 移动回程网络服务部署"
    },
    {
      "indent": 3,
      "text": "5. Policy-based explicit routing",
      "zh-CHS": "5. 基于策略的显式路由"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not introduce any new security issues. Node administrative tags, like link administrative tags (a.k.a. administrative groups) [RFC5305], can be used by operators to indicate geographical location or other sensitive information. The information carried in node administrative tags, like link administrative tags, can be leaked to an IGP snooper.",
      "zh-CHS": "本文档没有引入任何新的安全问题。节点管理标记，如链接管理标记（又称管理组）[RFC5305]，可由操作员用于指示地理位置或其他敏感信息。节点管理标记（如链接管理标记）中携带的信息可能会泄漏给IGP窥探者。"
    },
    {
      "indent": 3,
      "text": "Advertisement of tag values for one administrative domain into another involves the risk of misinterpretation of the tag values (if the two domains have assigned different meanings to the same values) and may have undesirable and unanticipated side effects.",
      "zh-CHS": "将一个管理域的标签值公布到另一个管理域中涉及标签值被误解的风险（如果两个域对相同的值赋予了不同的含义），并且可能产生不希望的和未预料到的副作用。"
    },
    {
      "indent": 3,
      "text": "Security concerns for IS-IS are already addressed in [ISO10589], [RFC5304], and [RFC5310] and are applicable to the mechanisms described in this document. Extended authentication mechanisms described in [RFC5304] or [RFC5310] SHOULD be used in deployments where attackers have access to the physical networks, because nodes included in the IS-IS domain are vulnerable.",
      "zh-CHS": "IS-IS的安全问题已在[ISO10589]、[RFC5304]和[RFC5310]中解决，并适用于本文档中描述的机制。[RFC5304]或[RFC5310]中描述的扩展身份验证机制应用于攻击者可以访问物理网络的部署中，因为IS-IS域中包含的节点易受攻击。"
    },
    {
      "indent": 0,
      "text": "7. Operational Considerations",
      "section_title": true,
      "zh-CHS": "7. 业务考虑"
    },
    {
      "indent": 3,
      "text": "Operators can assign a meaning to the node administrative tags that is local to the operator's administrative domain. The operational use of node administrative tags is analogical to the IS-IS prefix tags [RFC5130] and BGP communities [RFC1997]. Operational discipline and procedures followed in configuring and using BGP communities and IS-IS prefix tags are also applicable to the usage of node administrative tags.",
      "zh-CHS": "操作员可以为操作员管理域本地的节点管理标记指定含义。节点管理标记的操作使用类似于is-is前缀标记[RFC5130]和BGP社区[RFC1997]。配置和使用BGP社区和IS-IS前缀标记时遵循的操作规程和程序也适用于节点管理标记的使用。"
    },
    {
      "indent": 3,
      "text": "Defining a language for local policies is outside the scope of this document. As is the case with other policy applications, the pruning policies can cause the path to be completely removed from the forwarding plane and hence have the potential for a more severe impact on operations (e.g., node unreachability due to path removal) as compared to preference policies that only affect path selection.",
      "zh-CHS": "为本地策略定义语言超出了本文档的范围。与其他策略应用程序的情况一样，与仅影响路径选择的首选策略相比，修剪策略可导致路径从转发平面完全移除，因此可能对操作产生更严重的影响（例如，由于路径移除而导致节点不可达）。"
    },
    {
      "indent": 0,
      "text": "8. Manageability Considerations",
      "section_title": true,
      "zh-CHS": "8. 可管理性考虑"
    },
    {
      "indent": 3,
      "text": "Node administrative tags are configured and managed using routing policy enhancements. YANG [RFC6020] is a data modeling language used to specify configuration data models. The IS-IS YANG data model is described in [YANG-ISIS-CFG], and the routing policy configuration model is described in [RTG-POLICY-MODEL]. At the time of writing this document, some work to enhance these two other documents so that they include configurations related to node administrative tags is either already in progress or shall be taken up soon.",
      "zh-CHS": "使用路由策略增强功能配置和管理节点管理标记。YANG[RFC6020]是一种用于指定配置数据模型的数据建模语言。IS-IS YANG数据模型在[YANG-ISIS-CFG]中描述，路由策略配置模型在[RTG-policy-model]中描述。在编写本文件时，为增强这两个其他文件，使其包含与节点管理标签相关的配置而进行的一些工作已经在进行中，或者即将开始。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "zh-CHS": "9. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This specification updates one IS-IS registry: the \"Sub-TLVs for TLV 242\" registry. The following value has been registered.",
      "zh-CHS": "本规范更新了一个IS-IS注册表：“TLV 242的子TLV”注册表。已注册以下值。"
    },
    {
      "indent": 3,
      "text": "Value  Description\n-----  -----------\n21     Node-Admin-Tag",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISO10589] International Organization for Standardization, \"Intermediate System to Intermediate System intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service (ISO 8473)\", ISO Standard 10589, 2002.",
      "zh-CHS": "[ISO10589]国际标准化组织，“与提供无连接模式网络服务协议一起使用的中间系统到中间系统域内路由信息交换协议（ISO 8473）”，ISO标准10589，2002年。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC4971] Vasseur, JP., Ed., Shen, N., Ed., and R. Aggarwal, Ed., \"Intermediate System to Intermediate System (IS-IS) Extensions for Advertising Router Information\", RFC 4971, DOI 10.17487/RFC4971, July 2007, <http://www.rfc-editor.org/info/rfc4971>.",
      "zh-CHS": "[RFC4971]Vasseur，JP.，Ed.，Shen，N.，Ed.，和R.Aggarwal，Ed.，“广告路由器信息的中间系统到中间系统（IS-IS）扩展”，RFC 4971，DOI 10.17487/RFC4971，2007年7月<http://www.rfc-editor.org/info/rfc4971>."
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, DOI 10.17487/RFC5304, October 2008, <http://www.rfc-editor.org/info/rfc5304>.",
      "zh-CHS": "[RFC5304]Li，T.和R.Atkinson，“IS-IS加密认证”，RFC 5304，DOI 10.17487/RFC5304，2008年10月<http://www.rfc-editor.org/info/rfc5304>."
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, DOI 10.17487/RFC5310, February 2009, <http://www.rfc-editor.org/info/rfc5310>.",
      "zh-CHS": "[RFC5310]Bhatia，M.，Manral，V.，Li，T.，Atkinson，R.，White，R.，和M.Fanto，“IS-IS通用密码认证”，RFC 5310，DOI 10.17487/RFC5310，2009年2月<http://www.rfc-editor.org/info/rfc5310>."
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC1997] Chandra, R., Traina, P., and T. Li, \"BGP Communities Attribute\", RFC 1997, DOI 10.17487/RFC1997, August 1996, <http://www.rfc-editor.org/info/rfc1997>.",
      "zh-CHS": "[RFC1997]Chandra，R.，Traina，P.，和T.Li，“BGP社区属性”，RFC 1997，DOI 10.17487/RFC1997，1996年8月<http://www.rfc-editor.org/info/rfc1997>."
    },
    {
      "indent": 3,
      "text": "[RFC5120] Przygienda, T., Shen, N., and N. Sheth, \"M-ISIS: Multi Topology (MT) Routing in Intermediate System to Intermediate Systems (IS-ISs)\", RFC 5120, DOI 10.17487/RFC5120, February 2008, <http://www.rfc-editor.org/info/rfc5120>.",
      "zh-CHS": "[RFC5120]Przygienda，T.，Shen，N.，和N.Sheth，“M-ISIS：中间系统到中间系统（IS-ISs）的多拓扑（MT）路由”，RFC 5120，DOI 10.17487/RFC5120，2008年2月<http://www.rfc-editor.org/info/rfc5120>."
    },
    {
      "indent": 3,
      "text": "[RFC5130] Previdi, S., Shand, M., Ed., and C. Martin, \"A Policy Control Mechanism in IS-IS Using Administrative Tags\", RFC 5130, DOI 10.17487/RFC5130, February 2008, <http://www.rfc-editor.org/info/rfc5130>.",
      "zh-CHS": "[RFC5130]Previdi，S.，Shand，M.，Ed.，和C.Martin，“IS-IS中使用管理标签的策略控制机制”，RFC 5130，DOI 10.17487/RFC5130，2008年2月<http://www.rfc-editor.org/info/rfc5130>."
    },
    {
      "indent": 3,
      "text": "[RFC5286] Atlas, A., Ed., and A. Zinin, Ed., \"Basic Specification for IP Fast Reroute: Loop-Free Alternates\", RFC 5286, DOI 10.17487/RFC5286, September 2008, <http://www.rfc-editor.org/info/rfc5286>.",
      "zh-CHS": "[RFC5286]Atlas，A.，Ed.，和A.Zinin，Ed.，“IP快速重路由的基本规范：无环路交替”，RFC 5286，DOI 10.17487/RFC5286，2008年9月<http://www.rfc-editor.org/info/rfc5286>."
    },
    {
      "indent": 3,
      "text": "[RFC5305] Li, T. and H. Smit, \"IS-IS Extensions for Traffic Engineering\", RFC 5305, DOI 10.17487/RFC5305, October 2008, <http://www.rfc-editor.org/info/rfc5305>.",
      "zh-CHS": "[RFC5305]Li，T.和H.Smit，“交通工程的IS-IS扩展”，RFC 5305，DOI 10.17487/RFC5305，2008年10月<http://www.rfc-editor.org/info/rfc5305>."
    },
    {
      "indent": 3,
      "text": "[RFC6020] Bjorklund, M., Ed., \"YANG - A Data Modeling Language for the Network Configuration Protocol (NETCONF)\", RFC 6020, DOI 10.17487/RFC6020, October 2010, <http://www.rfc-editor.org/info/rfc6020>.",
      "zh-CHS": "[RFC6020]Bjorklund，M.，Ed.“YANG-网络配置协议的数据建模语言（NETCONF）”，RFC 6020，DOI 10.17487/RFC6020，2010年10月<http://www.rfc-editor.org/info/rfc6020>."
    },
    {
      "indent": 3,
      "text": "[RFC7777] Hegde, S., Shakir, R., Smirnov, A., Li, Z., and B. Decraene, \"Advertising Node Administrative Tags in OSPF\", RFC 7777, DOI 10.17487/RFC7777, March 2016, <http://www.rfc-editor.org/info/rfc7777>.",
      "zh-CHS": "[RFC7777]Hegde，S.，Shakir，R.，Smirnov，A.，Li，Z.，和B.Decraene，“OSPF中的广告节点管理标签”，RFC 7777，DOI 10.17487/RFC7777，2016年3月<http://www.rfc-editor.org/info/rfc7777>."
    },
    {
      "indent": 3,
      "text": "[RFC7916] Litkowski, S., Ed., Decraene, B., Filsfils, C., Raza, K., Horneffer, M., and P. Sarkar, \"Operational Management of Loop-Free Alternates\", RFC 7916, DOI 10.17487/RFC7916, July 2016, <http://www.rfc-editor.org/info/rfc7916>.",
      "zh-CHS": "[RFC7916]Litkowski，S.，Ed.，DeClaene，B.，Filsfils，C.，Raza，K.，Horneffer，M.，和P.Sarkar，“无回路备用电源的运行管理”，RFC 7916，DOI 10.17487/RFC7916，2016年7月<http://www.rfc-editor.org/info/rfc7916>."
    },
    {
      "indent": 3,
      "text": "[RTG-POLICY-MODEL] Shaikh, A., Shakir, R., D'Souza, K., and C. Chase, \"Routing Policy Configuration Model for Service Provider Networks\", Work in Progress, draft-ietf-rtgwg-policy-model-01, April 2016.",
      "zh-CHS": "[RTG-POLICY-MODEL]Shaikh，A.，Shakir，R.，D'Souza，K.，和C.Chase，“服务提供商网络的路由策略配置模型”，正在进行的工作，草稿-ietf-rtgwg-POLICY-MODEL-01，2016年4月。"
    },
    {
      "indent": 3,
      "text": "[YANG-ISIS-CFG] Litkowski, S., Yeung, D., Lindem, A., Zhang, J., and L. Lhotka, \"YANG Data Model for IS-IS protocol\", Work in Progress, draft-ietf-isis-yang-isis-cfg-08, March 2016.",
      "zh-CHS": "[YANG-ISIS-CFG]Litkowski，S.，Yeung，D.，Lindem，A.，Zhang，J.，和L.Lhotka，“IS-IS协议的YANG数据模型”，正在进行的工作，草案-ietf-ISIS-YANG-ISIS-CFG-082016年3月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "Many thanks to Les Ginsberg, Dhruv Dhody, Uma Chunduri, and Chris Bowers for providing useful inputs.",
      "zh-CHS": "非常感谢Les Ginsberg、Dhruv Dhody、Uma Chunduri和Chris Bowers提供的有用信息。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "zh-CHS": "贡献者"
    },
    {
      "indent": 3,
      "text": "Many many thanks to Ebben Aries and Rafael Rodriguez for their help with reviewing and improving the text of this document. Many thanks to Harish Raguveer for his contributions to initial draft versions of the document as well. Finally, many thanks to Zhenbin Li for providing some valuable use cases.",
      "zh-CHS": "非常感谢Ebben Aries和Rafael Rodriguez在审查和改进本文件文本方面提供的帮助。非常感谢Harish Raguveer对文件初稿的贡献。最后，非常感谢李振斌提供了一些有价值的用例。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Pushpasis Sarkar (editor) Individual Contributor",
      "zh-CHS": "Pushpasis Sarkar（编辑）个人撰稿人"
    },
    {
      "indent": 3,
      "text": "Email: pushpasis.ietf@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Hannes Gredler RtBrick Inc.",
      "zh-CHS": "汉内斯·格雷德勒RtBrick公司。"
    },
    {
      "indent": 3,
      "text": "Email: hannes@rtbrick.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Shraddha Hegde Juniper Networks, Inc. Electra, Exora Business Park Bangalore, KA 560103 India",
      "zh-CHS": "Shraddha Hegde Juniper Networks，Inc.Electra，Exora商业园区班加罗尔，印度，邮编560103"
    },
    {
      "indent": 3,
      "text": "Email: shraddha@juniper.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stephane Litkowski Orange",
      "zh-CHS": "斯蒂芬利特科夫斯基橙"
    },
    {
      "indent": 3,
      "text": "Email: stephane.litkowski@orange.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Bruno Decraene Orange",
      "zh-CHS": "布鲁诺橙"
    },
    {
      "indent": 3,
      "text": "Email: bruno.decraene@orange.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}