{
  "title": {
    "text": "RFC 7100: Retirement of the \"Internet Official Protocol Standards\" Summary Document",
    "zh-CHS": "RFC 7100"
  },
  "number": 7100,
  "created_at": "2021-11-01 21:54:34.762811+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        P. Resnick\nRequest for Comments: 7100                   Qualcomm Technologies, Inc.\nBCP: 9                                                     December 2013\nObsoletes: 5000\nUpdates: 2026\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Retirement of the \"Internet Official Protocol Standards\" Summary Document",
      "zh-CHS": "“互联网官方协议标准”摘要文件的废止"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 2026 to no longer use STD 1 as a summary of \"Internet Official Protocol Standards\". It obsoletes RFC 5000 and requests the IESG to move RFC 5000 (and therefore STD 1) to Historic status.",
      "zh-CHS": "本文件更新了RFC 2026，不再使用STD 1作为“互联网官方协议标准”的总结。它淘汰RFC 5000，并要求IESG将RFC 5000（因此STD 1）移至历史状态。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "zh-CHS": "本备忘录记录了互联网最佳实践。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。互联网工程指导小组（IESG）已批准将其出版。有关BCP的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7100.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7100."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2013 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "1. Retiring STD 1",
      "section_title": true,
      "zh-CHS": "1. 退休标准1"
    },
    {
      "indent": 3,
      "text": "RFC 2026 [RFC2026] and its predecessors call for the publication of an RFC describing the status of IETF protocols:",
      "zh-CHS": "RFC 2026[RFC2026]及其前身要求发布描述IETF协议状态的RFC："
    },
    {
      "indent": 6,
      "text": "The RFC Editor shall publish periodically an \"Internet Official Protocol Standards\" RFC [1], summarizing the status of all Internet protocol and service specifications.",
      "zh-CHS": "RFC编辑应定期发布“互联网官方协议标准”RFC[1]，总结所有互联网协议和服务规范的状态。"
    },
    {
      "indent": 3,
      "text": "The \"Internet Official Protocol Standards\" document, now as RFC 5000 [RFC5000], has always been listed in the Internet Standard series as STD 1. However, the document has not been kept up to date in recent years, and it has fallen out of use in favor of the online list produced by the RFC Editor [STDS-TRK]. The IETF no longer sees the need for the document to be maintained. Therefore, this document updates RFC 2026 [RFC2026], effectively removing the above-mentioned paragraph from Section 6.1.3, along with the paragraph from Section 2.1 that states:",
      "zh-CHS": "“互联网官方协议标准”文件，现为RFC 5000[RFC5000]，一直作为STD 1列入互联网标准系列。然而，该文件近年来一直没有更新，它已经不再使用，取而代之的是RFC编辑[STDS-TRK]制作的在线列表。IETF不再认为需要维护文档。因此，本文件更新了RFC 2026[RFC2026]，有效地删除了第6.1.3节中的上述段落，以及第2.1节中的段落，其中规定："
    },
    {
      "indent": 6,
      "text": "The status of Internet protocol and service specifications is summarized periodically in an RFC entitled \"Internet Official Protocol Standards\" [1]. This RFC shows the level of maturity and other helpful information for each Internet protocol or service specification (see section 3).",
      "zh-CHS": "互联网协议和服务规范的状态在题为“互联网官方协议标准”[1]的RFC中定期总结。此RFC显示每个Internet协议或服务规范的成熟度级别和其他有用信息（参见第3节）。"
    },
    {
      "indent": 3,
      "text": "and the paragraph from Section 3.3 that states:",
      "zh-CHS": "第3.3节中的段落规定："
    },
    {
      "indent": 6,
      "text": "The \"Official Protocol Standards\" RFC (STD1) lists a general requirement level for each TS, using the nomenclature defined in this section. This RFC is updated periodically. In many cases, more detailed descriptions of the requirement levels of particular protocols and of individual features of the protocols will be found in appropriate ASs.",
      "zh-CHS": "“官方协议标准”RFC（STD1）使用本节定义的术语列出了每个TS的一般要求级别。此RFC定期更新。在许多情况下，在适当的ASs中可以找到特定协议的需求级别和协议的各个特性的更详细描述。"
    },
    {
      "indent": 3,
      "text": "Additionally, this document obsoletes RFC 5000 [RFC5000], the current incarnation of that document, and requests that the IESG move that document (and therefore STD 1) to Historic status.",
      "zh-CHS": "此外，本文件淘汰了RFC 5000[RFC5000]，即该文件的当前版本，并要求IESG将该文件（因此STD 1）移至历史状态。"
    },
    {
      "indent": 3,
      "text": "Finally, RFC 2026 [RFC2026] Section 6.1.3 also calls for the publication of an \"official summary of standards actions completed and pending\" in the Internet Society's newsletter. This has also not been done in recent years, and the \"publication of record\" for standards actions has for some time been the minutes of the IESG [IESG-MINUTES]. Therefore, that paragraph is also effectively removed from Section 6.1.3.",
      "zh-CHS": "最后，RFC 2026[RFC2026]第6.1.3节还要求在互联网协会的时事通讯中发布“已完成和待定标准行动的官方摘要”。近年来也没有这样做，一段时间以来，标准行动的“记录发布”一直是IESG的会议记录[IESG-minutes]。因此，该段也从第6.1.3节中有效删除。"
    },
    {
      "indent": 0,
      "text": "2. Security Considerations",
      "section_title": true,
      "zh-CHS": "2. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not impact the security of the Internet.",
      "zh-CHS": "本文档不会影响Internet的安全性。"
    },
    {
      "indent": 0,
      "text": "3. Normative References",
      "section_title": true,
      "zh-CHS": "3. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[IESG-MINUTES] Internet Engineering Steering Group, \"IESG Telechat Minutes\", <http://www.ietf.org/iesg/minutes.html>.",
      "zh-CHS": "[IESG-MINUTES]互联网工程指导小组，“IESG Telechat MINUTES”<http://www.ietf.org/iesg/minutes.html>."
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5000] RFC Editor, \"Internet Official Protocol Standards\", RFC 5000, May 2008.",
      "zh-CHS": "[RFC5000]RFC编辑器，“互联网官方协议标准”，RFC 5000，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[STDS-TRK] RFC Editor, \"Official Internet Protocol Standards\", <http://www.rfc-editor.org/rfcxx00.html>.",
      "zh-CHS": "[STDS-TRK]RFC编辑器，“官方互联网协议标准”<http://www.rfc-editor.org/rfcxx00.html>."
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Pete Resnick Qualcomm Technologies, Inc. 5775 Morehouse Drive San Diego, CA 92121 US",
      "zh-CHS": "Pete Resnick高通技术有限公司，美国加利福尼亚州圣地亚哥Morehouse大道5775号，邮编92121"
    },
    {
      "indent": 3,
      "text": "Phone: +1 858 6511 4478\nEMail: presnick@qti.qualcomm.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}