{
  "title": {
    "text": "RFC 7302: Entertainment Identifier Registry (EIDR) URN Namespace Definition",
    "zh-CHS": "RFC 7302"
  },
  "number": 7302,
  "created_at": "2021-11-02 14:44:00.765443+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        P. Lemieux\nRequest for Comments: 7302                       Sandflow Consulting LLC\nCategory: Informational                                        July 2014\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Entertainment Identifier Registry (EIDR) URN Namespace Definition",
      "zh-CHS": "娱乐标识符注册表（EIDR）URN命名空间定义"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Entertainment Identifier Registry (EIDR) Identifiers are used for the globally unique identification of motion picture and television content. This document defines the formal Uniform Resource Name (URN) Namespace Identifier (NID) for EIDR Identifiers.",
      "zh-CHS": "娱乐标识符注册（EIDR）标识符用于电影和电视内容的全球唯一标识。本文档为EIDR标识符定义了正式的统一资源名（URN）命名空间标识符（NID）。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7302.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7302."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2014 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document defines the formal Uniform Resource Name (URN) Namespace Identifier (NID) for EIDR Identifiers.",
      "zh-CHS": "本文档为EIDR标识符定义了正式的统一资源名（URN）命名空间标识符（NID）。"
    },
    {
      "indent": 3,
      "text": "EIDR Identifiers are centrally registered, globally unique identifiers for audiovisual works and their variants, primarily film and television. A unique set of metadata parameters describing the associated work is bound to the EIDR Identifier at the time of registration.",
      "zh-CHS": "EIDR标识符是视听作品及其变体（主要是电影和电视）的集中注册的全球唯一标识符。描述相关工作的一组唯一元数据参数在注册时绑定到EIDR标识符。"
    },
    {
      "indent": 3,
      "text": "EIDR Identifiers are a special kind of DOI Names allocated by EIDR Association specifically for audiovisual works. The Digital Object Identifier (DOI) system provides an infrastructure for persistent unique identification of objects of any type and is specified in [ISO26234]. A DOI name is the identifier that is permanently assigned to an object. The use of DOI Names ensures persistence, global uniqueness, and an open resolution infrastructure.",
      "zh-CHS": "EIDR标识符是EIDR协会专门为视听作品分配的一种特殊DOI名称。数字对象标识符（DOI）系统为任何类型对象的持久唯一标识提供了基础设施，并在[ISO26234]中规定。DOI名称是永久分配给对象的标识符。DOI名称的使用确保了持久性、全局唯一性和开放解析基础设施。"
    },
    {
      "indent": 3,
      "text": "As a DOI Name, an EIDR Identifier has two components: a prefix assigned exclusively to EIDR Association by the DOI Registration Authority and a suffix defined by EIDR Association. Currently, EIDR Identifiers use the prefix \"10.5240\", but additional prefixes might be introduced in the future.",
      "zh-CHS": "作为DOI名称，EIDR标识符有两个组成部分：由DOI注册机构专门分配给EIDR协会的前缀和由EIDR协会定义的后缀。目前，EIDR标识符使用前缀“10.5240”，但将来可能会引入其他前缀。"
    },
    {
      "indent": 3,
      "text": "The following is an example of an EIDR Identifier in its canonical representation:",
      "zh-CHS": "以下是EIDR标识符的规范表示形式示例："
    },
    {
      "indent": 11,
      "text": "10.5240/7791-8534-2C23-9030-8610-5",
      "zh-CHS": "10.5240/7791-8534-2C23-9030-8610-5"
    },
    {
      "indent": 3,
      "text": "where \"10.5240\" is the prefix and \"7791-8534-2C23-9030-8610-5\" is the suffix. The canonical URN representation of the same EIDR Identifier is:",
      "zh-CHS": "其中，“10.5240”为前缀，“7791-8534-2C23-9030-8610-5”为后缀。同一EIDR标识符的规范URN表示为："
    },
    {
      "indent": 3,
      "text": " urn:eidr:10.5240:7791-8534-2C23-9030-8610-5 Note that \":\" is used as separator between prefix and suffix since \"/\" is a URN reserved character.",
      "zh-CHS": "urn:eidr:10.5240:7791-8534-2C23-9030-8610-5注意“：”用作前缀和后缀之间的分隔符，因为“/”是urn保留字符。"
    },
    {
      "indent": 3,
      "text": "[EIDR-OVERVIEW] and [EIDR-INTRO] provide additional background information.",
      "zh-CHS": "[EIDR-OVERVIEW]和[EIDR-INTRO]提供了其他背景信息。"
    },
    {
      "indent": 0,
      "text": "2. Completed URN Namespace Definition Template",
      "section_title": true,
      "zh-CHS": "2. 已完成的URN命名空间定义模板"
    },
    {
      "indent": 3,
      "text": "The namespace definition according to the template in [RFC3406] is as follows:",
      "zh-CHS": "根据[RFC3406]中的模板，名称空间定义如下："
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 6,
      "text": "eidr",
      "zh-CHS": "艾德"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "Version 1",
      "zh-CHS": "版本1"
    },
    {
      "indent": 6,
      "text": "2014-03-03",
      "zh-CHS": "2014-03-03"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "Name:",
      "zh-CHS": "姓名："
    },
    {
      "indent": 9,
      "text": "Entertainment Identifier Registry Association",
      "zh-CHS": "娱乐标识注册协会"
    },
    {
      "indent": 6,
      "text": "Address:",
      "zh-CHS": "地址:"
    },
    {
      "indent": 9,
      "text": "c/o Alliances Management 544 Hillside Road Redwood City, CA 94062 USA",
      "zh-CHS": "转交美国加利福尼亚州红木市希尔赛德路544号联盟管理公司，邮编94062"
    },
    {
      "indent": 6,
      "text": "Contact:",
      "zh-CHS": "联系人："
    },
    {
      "indent": 9,
      "text": "URL: http://eidr.org/contact/\nEmail: info@eidr.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "zh-CHS": "句法结构声明："
    },
    {
      "indent": 6,
      "text": "An EIDR Identifier is a special kind of DOI Name (see [ISO26234]) and, as such, consists of two components: a prefix denoted EIDR-PREFIX and a suffix denoted EIDR-SUFFIX. The URN representation URN-EIDR of an EIDR Identifier conforms to the syntax (expressed using [RFC5234]):",
      "zh-CHS": "EIDR标识符是一种特殊的DOI名称（参见[ISO26234]），因此由两部分组成：一个前缀表示EIDR-prefix，一个后缀表示EIDR-suffix。EIDR标识符的URN表示URN-EIDR符合语法（使用[RFC5234]表示）："
    },
    {
      "indent": 11,
      "text": "URN-EIDR = \"urn:eidr:\" EIDR-NSS\nEIDR-NSS = EIDR-PREFIX \":\" EIDR-SUFFIX\nEIDR-PREFIX = 1*EIDR-CHARS\nEIDR-SUFFIX = 1*EIDR-CHARS\nEIDR-CHARS = ALPHA / DIGIT / \"-\" / \".\" / \"_\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "The only value of EIDR-PREFIX currently in use is \"10.5240\". Additional prefix values conforming to the EIDR-PREFIX syntax might be introduced by EIDR Association in the future. In all cases, each of these additional prefix values will be associated with suffix values that conform to a subset of the EIDR-SUFFIX syntax. These additional prefixes and their corresponding suffixes will be documented in future revisions to this registration.",
      "zh-CHS": "当前使用的EIDR-PREFIX的唯一值是“10.5240”。未来EIDR关联可能会引入符合EIDR-prefix语法的其他前缀值。在所有情况下，这些附加前缀值中的每一个都将与符合EIDR-suffix语法子集的后缀值相关联。这些附加前缀及其相应后缀将在本注册的未来版本中记录。"
    },
    {
      "indent": 6,
      "text": "An implementation can process an EIDR-NSS with an unknown prefix as an opaque string per the \"Rules of Lexical Equivalence\" below, and resolve it as a generic DOI Name per the \"Process for identifier resolution\" below.",
      "zh-CHS": "实现可以根据下面的“词汇等价规则”将前缀未知的EIDR-NSS处理为不透明字符串，并根据下面的“标识符解析过程”将其解析为通用DOI名称。"
    },
    {
      "indent": 6,
      "text": "When EIDR-PREFIX is equal to \"10.5240\", the syntax of EIDR-SUFFIX is further constrained according to the to RP2079-SUFFIX syntax specified in [SMPTERP2079]:",
      "zh-CHS": "当EIDR-PREFIX等于“10.5240”时，EIDR-SUFFIX的语法将根据[SMPTERP2079]中指定的to RP2079-SUFFIX语法进一步约束："
    },
    {
      "indent": 11,
      "text": "RP2079-SUFFIX = 5(4HEXDIG \"-\") CHECK\nCHECK         = DIGIT / ALPHA",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "where CHECK is the Mod 37,36 check character as specified in [ISO7064], computed over the 20 hexadecimal digits HEXDIG of RP2079-SUFFIX.",
      "zh-CHS": "其中，CHECK是[ISO7064]中规定的Mod 37,36检查字符，通过RP2079-SUFFIX的20个十六进制数字HEXDIG计算得出。"
    },
    {
      "indent": 6,
      "text": "EXAMPLE: urn:eidr:10.5240:7791-8534-2C23-9030-8610-5",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "[ISO26234] specifies DOI Name syntax and registration.",
      "zh-CHS": "[ISO26234]指定DOI名称语法和注册。"
    },
    {
      "indent": 6,
      "text": "[SMPTERP2079] specifies the syntax of the EIDR Identifier with the prefix \"10.5240\".",
      "zh-CHS": "[SMPTERP2079]指定前缀为“10.5240”的EIDR标识符的语法。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "An EIDR Identifier is a DOI Name. The ISO 26324 Registration Authority ensures that DOI Name uniqueness; therefore, the URN-EIDR derived from an EIDR Identifier is guaranteed to be unique and never reassigned.",
      "zh-CHS": "EIDR标识符是DOI名称。ISO 26324注册机构确保DOI名称的唯一性；因此，从EIDR标识符派生的URN-EIDR保证是唯一的，并且永远不会重新分配。"
    },
    {
      "indent": 6,
      "text": "Furthermore, an EIDR Identifier is associated with a single URN-EIDR.",
      "zh-CHS": "此外，EIDR标识符与单个URN-EIDR相关联。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 6,
      "text": "An EIDR Identifier is a DOI Name. The ISO 26324 Registration Authority ensures that a DOI Name remains valid indefinitely; therefore, the URN-EIDR derived from an EIDR Identifier remains valid indefinitely.",
      "zh-CHS": "EIDR标识符是DOI名称。ISO 26324注册机构确保内政部名称无限期保持有效；因此，从EIDR标识符派生的URN-EIDR将无限期地保持有效。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 6,
      "text": "EIDR Association registers each EIDR Identifier with the ISO 26324 Registration Authority.",
      "zh-CHS": "EIDR协会向ISO 26324注册机构注册每个EIDR标识符。"
    },
    {
      "indent": 6,
      "text": "Entities involved in the motion picture and television industry, either directly in the production of content or in its distribution and related services, are eligible to apply for registrant status. Registrants pay an annual membership fee that depends on the size of the company.",
      "zh-CHS": "直接参与内容制作或发行及相关服务的电影和电视行业实体有资格申请注册人身份。注册人根据公司规模缴纳年度会员费。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 6,
      "text": "As a DOI Name, the resolution of the EIDR Identifier associated with an EIDR-NSS is handled by the ISO 26324 Registration Authority.",
      "zh-CHS": "作为DOI名称，与EIDR-NSS关联的EIDR标识符的解析由ISO 26324注册机构处理。"
    },
    {
      "indent": 6,
      "text": "The ISO 26324 Registration Authority operates a web service that allows the EIDR Identifier associated with an EIDR-NSS to be resolved by issuing an HTTP GET request to the following URI (see [RFC7231]):",
      "zh-CHS": "ISO 26324注册机构运行一个web服务，允许通过向以下URI发出HTTP GET请求来解析与EIDR-NSS关联的EIDR标识符（请参见[RFC7231]）："
    },
    {
      "indent": 15,
      "text": "\"http://doi.org/\" EIDR-PREFIX \"/\" EIDR-SUFFIX",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "If the EIDR Identifier exists, then an XML Schema instance document (see [XMLSchema]) containing metadata associated with the EIDR Identifier is returned; otherwise, the HTTP status code \"404 Not Found\" is returned.",
      "zh-CHS": "如果存在EIDR标识符，则返回包含与EIDR标识符关联的元数据的XML模式实例文档（参见[XMLSchema]）；否则，将返回HTTP状态代码“404未找到”。"
    },
    {
      "indent": 6,
      "text": "EXAMPLE: http://doi.org/10.5240/7791-8534-2C23-9030-8610-5",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "NOTE: At the time of this writing, this service of the ISO 26324 Registration Authority is not available over TLS, and hence the confidentiality of queries is not protected.",
      "zh-CHS": "注：在撰写本文时，ISO 26324注册机构的这项服务在TLS上不可用，因此查询的机密性不受保护。"
    },
    {
      "indent": 6,
      "text": "EIDR Association operates additional services specifically tailored to EIDR users (see [EIDR-SERVICES]). These services include additional features, e.g., confidential lookup using TLS and the ability to register EIDR Identifiers.",
      "zh-CHS": "EIDR协会运营专门为EIDR用户定制的附加服务（参见[EIDR-services]）。这些服务包括附加功能，例如，使用TLS进行机密查找，以及注册EIDR标识符的能力。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "Lexical equivalence of EIDR-URN is defined by case-insensitive string match.",
      "zh-CHS": "EIDR-URN的词汇等价性由不区分大小写的字符串匹配定义。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "As specified above, the syntax of EIDR-URN is a subset of the URN syntax specified in [RFC2141].",
      "zh-CHS": "如上所述，EIDR-URN的语法是[RFC2141]中指定的URN语法的子集。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "The validity of an EIDR-NSS can only be guaranteed by completing the resolution process.",
      "zh-CHS": "EIDR-NSS的有效性只能通过完成解决过程来保证。"
    },
    {
      "indent": 6,
      "text": "For EIDR-NSS with an EIDR-PREFIX equal to \"10.5240\", the CHECK value can be used for integrity checking, as specified above.",
      "zh-CHS": "对于EIDR前缀等于“10.5240”的EIDR-NSS，检查值可用于完整性检查，如上所述。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "EIDR Identifiers are centrally registered, globally unique identifiers for use with audiovisual works worldwide.",
      "zh-CHS": "EIDR标识符是集中注册的全球唯一标识符，用于全球范围内的视听作品。"
    },
    {
      "indent": 0,
      "text": "3. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "3. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "EIDR Identifiers are intended for use in Internet applications, where URNs are routinely used to identify audiovisual resources. There is no direct mapping from EIDR Identifiers to existing URN namespaces.",
      "zh-CHS": "EIDR标识符用于互联网应用，其中URN通常用于识别视听资源。没有从EIDR标识符到现有URN名称空间的直接映射。"
    },
    {
      "indent": 0,
      "text": "4. Community Considerations",
      "section_title": true,
      "zh-CHS": "4. 社区考虑"
    },
    {
      "indent": 3,
      "text": "The primary registrants of EIDR Identifiers are producers and distributors of audiovisual works, metadata aggregators, and audiovisual archives. Any bona fide member of the ecosystem can become an EIDR member and register any work. EIDR Identifiers can be used by anyone to unambiguously identify an audiovisual asset and retrieve underlying metadata. The primary benefits of their use are associated with works in wide distribution, management of long or complex distribution chains, and aggregation of information from multiple sources.",
      "zh-CHS": "EIDR标识符的主要注册人是视听作品、元数据聚合器和视听档案的制作人和发行人。生态系统的任何真正成员都可以成为EIDR成员并注册任何作品。任何人都可以使用EIDR标识符来明确标识视听资产并检索底层元数据。使用它们的主要好处与广泛分布的工作、长或复杂分布链的管理以及来自多个来源的信息聚合有关。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has registered the Formal URN Namespace 'eidr' in the \"Uniform Resource Names (URN) Namespaces\" registry, using the registration template in Section 2 of this document.",
      "zh-CHS": "IANA已使用本文档第2节中的注册模板在“统一资源名称（URN）命名空间”注册表中注册了正式的URN命名空间“eidr”。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document specifies the syntax of the EIDR-URN namespace and makes no security representations. Furthermore, the details of assignment and resolution processes are defined external to this document by EIDR Association and the ISO 26324 Registration Authority, and thus are outside the scope of this document. Note, however, that failure to conform to the syntactic and lexical equivalence rules in this specification when using an EIDR Identifier as a criteria for accessing restricted resources can result in granting unauthorized access to these resources.",
      "zh-CHS": "本文档指定了EIDR-URN名称空间的语法，不提供任何安全表示。此外，EIDR协会和ISO 26324注册机构在本文件之外定义了转让和处置过程的细节，因此不在本文件范围内。但是，请注意，当使用EIDR标识符作为访问受限资源的标准时，如果不遵守本规范中的语法和词汇等价规则，可能会导致授予对这些资源的未经授权访问。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISO26234] International Organization for Standardization, \"Information and documentation - Digital object identifier system\", ISO Standard 26324, 2012.",
      "zh-CHS": "[ISO26234]国际标准化组织，“信息和文件-数字对象标识符系统”，ISO标准263242012。"
    },
    {
      "indent": 3,
      "text": "[ISO7064] International Organization for Standardization, \"Information technology - Security techniques - Check character systems\", ISO Standard 7064, 2003.",
      "zh-CHS": "[ISO7064]国际标准化组织，“信息技术-安全技术-检查字符系统”，ISO标准7064，2003年。"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[RFC2141]Moats，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "zh-CHS": "[RFC5234]Crocker，D.和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[SMPTERP2079] Society of Motion Picture and Television Engineers, \"Digital Object Identifier (DOI) Name and Entertainment ID Registry (EIDR) Identifier Representations\", SMPTE RP 2079, 2014.",
      "zh-CHS": "[SMPTERP2079]电影和电视工程师学会，“数字对象标识符（DOI）名称和娱乐ID注册（EIDR）标识符表示”，SMPTE RP 20792014。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[EIDR-INTRO] Entertainment Identifier Registry Association, \"EIDR: ID Format Ver. 1.1\", August 2013, <http://eidr.org/documents/EIDR_ID_Format_v1.1.pdf>.",
      "zh-CHS": "[EIDR-INTRO]娱乐标识注册协会，“EIDR:ID格式1.1版”，2013年8月<http://eidr.org/documents/EIDR_ID_Format_v1.1.pdf>."
    },
    {
      "indent": 3,
      "text": "[EIDR-OVERVIEW] Entertainment Identifier Registry Association, \"EIDR Overview\", November 2013, <http://eidr.org/ documents/2013-11-01_EIDR_Overview_FINAL.pdf>.",
      "zh-CHS": "[EIDR-概述]娱乐标识注册协会，“EIDR概述”，2013年11月<http://eidr.org/ documents/2013-11-01\\u EIDR\\u Overview\\u FINAL.pdf>。"
    },
    {
      "indent": 3,
      "text": "[EIDR-SERVICES] Entertainment Identifier Registry Association, \"EIDR System Version 2.0: Registry User's Guide\", August 2013, <http://eidr.org/documents/ EIDR_2.0_Registry_User_Guide.pdf>.",
      "zh-CHS": "[EIDR-SERVICES]娱乐标识符注册协会，“EIDR系统2.0版：注册用户指南”，2013年8月<http://eidr.org/documents/ EIDR_2.0_注册表_用户指南.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "zh-CHS": "[RFC3406]Daigle，L.，van Gulik，D.，Iannella，R.，和P.Faltstrom，“统一资源名称（URN）命名空间定义机制”，BCP 66，RFC 3406，2002年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC7231] Fielding, R. and J. Reschke, \"Hypertext Transfer Protocol (HTTP/1.1): Semantics and Content\", RFC 7231, June 2014.",
      "zh-CHS": "[RFC7231]Fielding，R.和J.Reschke，“超文本传输协议（HTTP/1.1）：语义和内容”，RFC 72312014年6月。"
    },
    {
      "indent": 3,
      "text": "[XMLSchema] Holstege, M. and A. Vedamuthu, \"W3C XML Schema Definition Language (XSD): Component Designators\", W3C Candidate Recommendation CR-xmlschema-ref-20100119, January 2010, <http://www.w3.org/TR/2010/CR-xmlschema-ref-20100119>.",
      "zh-CHS": "[XMLSchema]Holstege，M.和A.Vedamuthu，“W3C XML模式定义语言（XSD）：组件标识符”，W3C候选建议CR-XMLSchema-ref-20100119，2010年1月<http://www.w3.org/TR/2010/CR-xmlschema-ref-20100119>."
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Pierre-Anthony Lemieux Sandflow Consulting LLC",
      "zh-CHS": "Pierre Anthony Lemieux Sandflow咨询有限责任公司"
    },
    {
      "indent": 3,
      "text": "EMail: pal@sandflow.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}