{
  "title": {
    "text": "RFC 7603: Energy Management (EMAN) Applicability Statement",
    "zh-CHS": "RFC 7603"
  },
  "number": 7603,
  "created_at": "2021-10-31 07:22:44.530772+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      B. Schoening\nRequest for Comments: 7603                        Independent Consultant\nCategory: Standards Track                                M. Chandramouli\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                              B. Nordman\n                                          Lawrence Berkeley National Lab\n                                                             August 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Energy Management (EMAN) Applicability Statement",
      "zh-CHS": "能源管理（EMAN）适用性声明"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The objective of Energy Management (EMAN) is to provide an energy management framework for networked devices. This document presents the applicability of the EMAN information model in a variety of scenarios with cases and target devices. These use cases are useful for identifying requirements for the framework and MIBs. Further, we describe the relationship of the EMAN framework to other relevant energy monitoring standards and architectures.",
      "zh-CHS": "能量管理（EMAN）的目标是为网络设备提供一个能量管理框架。本文档介绍了EMAN信息模型在各种案例和目标设备场景中的适用性。这些用例有助于确定框架和MIB的需求。此外，我们还描述了EMAN框架与其他相关能源监测标准和体系结构的关系。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7603.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7603."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ................................................. 3\n  1.1. Energy Management Overview ............................... 4\n  1.2. EMAN Document Overview ................................... 4\n  1.3. Energy Measurement ....................................... 5\n  1.4. Energy Management ........................................ 5\n  1.5. EMAN Framework Application ............................... 6\n2. Scenarios and Target Devices ................................. 6\n  2.1. Network Infrastructure Energy Objects .................... 6\n  2.2. Devices Powered and Connected by a Network Device ........ 7\n  2.3. Devices Connected to a Network ........................... 8\n  2.4. Power Meters ............................................. 9\n  2.5. Mid-level Managers ...................................... 10\n  2.6. Non-residential Building System Gateways ................ 10\n  2.7. Home Energy Gateways .................................... 11\n  2.8. Data Center Devices ..................................... 12\n  2.9. Energy Storage Devices .................................. 13\n  2.10. Industrial Automation Networks ......................... 14\n  2.11. Printers ............................................... 14\n  2.12. Demand Response ........................................ 15\n3. Use Case Patterns ........................................... 16\n  3.1. Metering ................................................ 16\n  3.2. Metering and Control .................................... 16\n  3.3. Power Supply, Metering and Control ...................... 16\n  3.4. Multiple Power Sources .................................. 16\n4. Relationship of EMAN to Other Standards ..................... 17\n  4.1. Data Model and Reporting ................................ 17\n        4.1.1. IEC - CIM........................................ 17\n        4.1.2. DMTF............................................. 17\n        4.1.3. ODVA............................................. 19\n        4.1.4. Ecma SDC......................................... 19\n        4.1.5. PWG.............................................. 19",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "        4.1.6. ASHRAE........................................... 20\n        4.1.7. ANSI/CEA......................................... 21\n        4.1.8. ZigBee........................................... 21\n  4.2. Measurement ............................................. 22\n        4.2.1. ANSI C12......................................... 22\n        4.2.2. IEC 62301........................................ 22\n  4.3. Other ................................................... 22\n        4.3.1. ISO.............................................. 22\n        4.3.2. Energy Star...................................... 23\n        4.3.3. Smart Grid....................................... 23\n5. Limitations ................................................. 24\n6. Security Considerations ..................................... 24\n7. References .................................................. 25\n  7.1. Normative References .................................... 25\n  7.2. Informative References .................................. 25\nAcknowledgements ............................................... 27\nAuthors' Addresses ............................................. 28",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The focus of the Energy Management (EMAN) framework is energy monitoring and management of energy objects [RFC7326]. The scope of devices considered are network equipment and their components, and devices connected directly or indirectly to the network. The EMAN framework enables monitoring of heterogeneous devices to report their energy consumption and, if permissible, control. There are multiple scenarios where this is desirable, particularly considering the increased importance of limiting consumption of finite energy resources and reducing operational expenses.",
      "zh-CHS": "能源管理（EMAN）框架的重点是能源监测和能源对象的管理[RFC7326]。考虑的设备范围包括网络设备及其组件，以及直接或间接连接到网络的设备。EMAN框架能够监控异构设备，以报告其能耗，并在允许的情况下进行控制。在许多情况下，这是可取的，特别是考虑到限制有限能源消耗和降低运营费用的重要性日益增加。"
    },
    {
      "indent": 3,
      "text": "The EMAN framework [RFC7326] describes how energy information can be retrieved from IP-enabled devices using Simple Network Management Protocol (SNMP), specifically, Management Information Base (MIB) modules for SNMP.",
      "zh-CHS": "EMAN框架[RFC7326]描述了如何使用简单网络管理协议（SNMP），特别是SNMP的管理信息库（MIB）模块，从启用IP的设备检索能源信息。"
    },
    {
      "indent": 3,
      "text": "This document describes typical applications of the EMAN framework as well as its opportunities and limitations. It also reviews other standards that are similar in part to EMAN but address different domains, describing how those other standards relate to the EMAN framework.",
      "zh-CHS": "本文档描述了EMAN框架的典型应用及其机会和局限性。它还审查了部分类似于EMAN但涉及不同领域的其他标准，描述了这些其他标准与EMAN框架的关系。"
    },
    {
      "indent": 3,
      "text": "The rest of the document is organized as follows. Section 2 contains a list of use cases or network scenarios that EMAN addresses. Section 3 contains an abstraction of the use case scenarios to distinct patterns. Section 4 deals with other standards related and applicable to EMAN.",
      "zh-CHS": "文件的其余部分组织如下。第2节包含一个使用案例或网络场景的列表，EMAN解决了这些问题。第3节将用例场景抽象为不同的模式。第4节讨论了与EMAN相关并适用于EMAN的其他标准。"
    },
    {
      "indent": 0,
      "text": "1.1. Energy Management Overview",
      "section_title": true,
      "zh-CHS": "1.1. 能源管理概述"
    },
    {
      "indent": 3,
      "text": "EMAN addresses the electrical energy consumed by devices connected to a network. A first step to increase the energy efficiency in networks and the devices attached to the network is to enable energy objects to report their energy usage over time. The EMAN framework addresses this problem with an information model for electrical equipment: energy object identification, energy object context, power measurement, and power characteristics.",
      "zh-CHS": "EMAN处理连接到网络的设备消耗的电能。提高网络和连接到网络的设备的能源效率的第一步是使能源对象能够报告其能源使用情况。EMAN框架通过电气设备的信息模型解决了这个问题：能源对象识别、能源对象上下文、功率测量和功率特性。"
    },
    {
      "indent": 3,
      "text": "The EMAN framework defines SNMP MIB modules based on the information model. By implementing these SNMP MIB modules, an energy object can report its energy consumption according to the information model. Based on the information model, the MIB documents specify SNMP MIB modules, but it is equally possible to use other mechanisms such as YANG module, Network Conference Protocol (NETCONF), etc.",
      "zh-CHS": "EMAN框架根据信息模型定义SNMP MIB模块。通过实现这些SNMP MIB模块，能量对象可以根据信息模型报告其能量消耗。基于信息模型，MIB文档指定SNMP MIB模块，但也可以使用其他机制，如YANG模块、网络会议协议（NETCONF）等。"
    },
    {
      "indent": 3,
      "text": "In that context, it is important to distinguish energy objects that can only report their own energy usage from devices that can also collect and aggregate energy usage of other energy objects.",
      "zh-CHS": "在这种情况下，重要的是要区分只能报告自身能源使用情况的能源对象和也可以收集和汇总其他能源对象能源使用情况的设备。"
    },
    {
      "indent": 0,
      "text": "1.2. EMAN Document Overview",
      "section_title": true,
      "zh-CHS": "1.2. EMAN文档概述"
    },
    {
      "indent": 3,
      "text": "The EMAN work consists of the following Standard Track and Informational documents in the area of energy management.",
      "zh-CHS": "EMAN工作包括能源管理领域的以下标准跟踪和信息文件。"
    },
    {
      "indent": 6,
      "text": "Applicability Statement (this document)",
      "zh-CHS": "适用性声明（本文件）"
    },
    {
      "indent": 6,
      "text": "Requirements [RFC6988]: This document presents requirements of energy management and the scope of the devices considered.",
      "zh-CHS": "要求[RFC6988]：本文件介绍了能源管理的要求和所考虑设备的范围。"
    },
    {
      "indent": 6,
      "text": "Framework [RFC7326]: This document defines a framework for providing energy management for devices within or connected to communication networks and lists the definitions for the common terms used in these documents.",
      "zh-CHS": "框架[RFC7326]：本文件定义了为通信网络内或连接到通信网络的设备提供能源管理的框架，并列出了这些文件中常用术语的定义。"
    },
    {
      "indent": 6,
      "text": "Energy Object Context MIB [RFC7461]: This document defines a MIB module that characterizes a device's identity, context, and relationships to other entities.",
      "zh-CHS": "能量对象上下文MIB[RFC7461]：本文档定义了一个MIB模块，用于描述设备的标识、上下文以及与其他实体的关系。"
    },
    {
      "indent": 6,
      "text": "Monitoring and Control MIB [RFC7460]: This document defines a MIB module for monitoring the power and energy consumption of a device.",
      "zh-CHS": "监控MIB[RFC7460]：本文档定义了一个MIB模块，用于监控设备的功率和能耗。"
    },
    {
      "indent": 9,
      "text": "The MIB module contains an optional module for metrics associated with power characteristics.",
      "zh-CHS": "MIB模块包含一个可选模块，用于与电源特性相关的度量。"
    },
    {
      "indent": 6,
      "text": "Battery MIB [RFC7577]: This document defines a MIB module for monitoring characteristics of an internal battery.",
      "zh-CHS": "电池MIB[RFC7577]：本文档定义了用于监控内部电池特性的MIB模块。"
    },
    {
      "indent": 0,
      "text": "1.3. Energy Measurement",
      "section_title": true,
      "zh-CHS": "1.3. 能量测量"
    },
    {
      "indent": 3,
      "text": "It is increasingly common for today's smart devices to measure and report their own energy consumption. Intelligent power strips and some Power over Ethernet (PoE) switches can meter consumption of connected devices. However, when managed and reported through proprietary means, this information is difficult to view at the enterprise level.",
      "zh-CHS": "当今的智能设备越来越普遍地测量和报告自身的能耗。智能电源板和一些以太网供电（PoE）交换机可以测量所连接设备的功耗。然而，当通过专有方式进行管理和报告时，这些信息很难在企业级查看。"
    },
    {
      "indent": 3,
      "text": "The primary goal of the EMAN information model is to enable reporting and management within a standard framework that is applicable to a wide variety of end devices, meters, and proxies. This enables a management system to know who's consuming what, when, and how by leveraging existing networks across various equipment in a unified and consistent manner.",
      "zh-CHS": "EMAN信息模型的主要目标是在适用于各种终端设备、仪表和代理的标准框架内实现报告和管理。这使得管理系统能够通过以统一一致的方式跨各种设备利用现有网络来了解谁在消费什么、何时以及如何消费。"
    },
    {
      "indent": 3,
      "text": "Because energy objects may both consume energy and provide energy to other devices, there are three types of energy measurement: energy input to a device, energy supplied to other devices, and net (resultant) energy consumed (the difference between energy input and supplied).",
      "zh-CHS": "由于能量对象既可以消耗能量，也可以向其他设备提供能量，因此有三种类型的能量测量：输入到设备的能量、供应到其他设备的能量以及消耗的净（合成）能量（输入和供应的能量之差）。"
    },
    {
      "indent": 0,
      "text": "1.4. Energy Management",
      "section_title": true,
      "zh-CHS": "1.4. 能源管理"
    },
    {
      "indent": 3,
      "text": "The EMAN framework provides mechanisms for energy control in addition to passive monitoring. There are many cases where active energy control of devices is desirable, for example, during low device utilization or peak electrical price periods.",
      "zh-CHS": "除被动监测外，EMAN框架还提供了能源控制机制。在许多情况下，例如在设备利用率低或电价高峰期间，需要对设备进行有功能量控制。"
    },
    {
      "indent": 3,
      "text": "Energy control can be as simple as controlling on/off states. In many cases, however, energy control requires understanding the energy object context. For instance, during non-business hours in a commercial building, some phones must remain available in case of emergency, and office cooling is not usually turned off completely, but the comfort level is reduced.",
      "zh-CHS": "能量控制可以像控制开/关状态一样简单。然而，在许多情况下，能量控制需要理解能量对象上下文。例如，在商业建筑的非营业时间，一些手机必须在紧急情况下保持可用，办公室冷却通常不会完全关闭，但舒适度会降低。"
    },
    {
      "indent": 3,
      "text": "Energy object control therefore requires flexibility and support for different policies and mechanisms: from centralized management by an energy management system to autonomous control by individual devices and alignment with dynamic demand-response mechanisms.",
      "zh-CHS": "因此，能源对象控制需要灵活性和对不同策略和机制的支持：从能源管理系统的集中管理到单个设备的自主控制，并与动态需求响应机制保持一致。"
    },
    {
      "indent": 3,
      "text": "The power states specified in the EMAN framework can be used in demand-response scenarios. In response to time-of-day fluctuation of energy costs or grid power shortages, network devices can respond and reduce their energy consumption.",
      "zh-CHS": "EMAN框架中指定的电源状态可用于需求响应场景。为了响应一天中能源成本的波动或电网电力短缺，网络设备可以做出响应并降低其能耗。"
    },
    {
      "indent": 0,
      "text": "1.5. EMAN Framework Application",
      "section_title": true,
      "zh-CHS": "1.5. EMAN框架应用"
    },
    {
      "indent": 3,
      "text": "A Network Management System (NMS) is an entity that requests information from compatible devices, typically using the SNMP protocol. An NMS may implement many network management functions, such as security or identity management. An NMS that deals exclusively with energy is called an Energy Management System (EnMS). It may be limited to monitoring energy use, or it may also implement control functions. An EnMS collects energy information for devices in the network.",
      "zh-CHS": "网络管理系统（NMS）是从兼容设备请求信息的实体，通常使用SNMP协议。NMS可以实现许多网络管理功能，例如安全或身份管理。专门处理能源的NMS称为能源管理系统（EnMS）。它可能仅限于监测能源使用，也可能实现控制功能。EnMS为网络中的设备收集能量信息。"
    },
    {
      "indent": 3,
      "text": "Energy management can be implemented by extending existing SNMP support with EMAN-specific MIBs. SNMP provides an industry-proven and well-known mechanism to discover, secure, measure, and control SNMP-enabled end devices. The EMAN framework provides an information and data model to unify access to a large range of devices.",
      "zh-CHS": "能源管理可以通过使用特定于EMAN的MIB扩展现有的SNMP支持来实现。SNMP提供了一种业界公认的机制，用于发现、保护、测量和控制启用SNMP的终端设备。EMAN框架提供了一个信息和数据模型，以统一对大量设备的访问。"
    },
    {
      "indent": 0,
      "text": "2. Scenarios and Target Devices",
      "section_title": true,
      "zh-CHS": "2. 场景和目标设备"
    },
    {
      "indent": 3,
      "text": "This section presents energy management scenarios that the EMAN framework should solve. Each scenario lists target devices for which the energy management framework can be applied, how the reported-on devices are powered, and how the reporting or control is accomplished. While there is some overlap between some of the use cases, the use cases illustrate network scenarios that the EMAN framework supports.",
      "zh-CHS": "本节介绍了EMAN框架应解决的能源管理场景。每个场景都列出了可以应用能量管理框架的目标设备、所报告设备的供电方式以及报告或控制的完成方式。虽然一些用例之间有一些重叠，但这些用例说明了EMAN框架支持的网络场景。"
    },
    {
      "indent": 0,
      "text": "2.1. Network Infrastructure Energy Objects",
      "section_title": true,
      "zh-CHS": "2.1. 网络基础设施能源对象"
    },
    {
      "indent": 3,
      "text": "This scenario covers the key use case of network devices and their components. For a device aware of one or more components, our information model supports monitoring and control at the component level. Typically, the chassis draws power from one or more sources and feeds its internal components. It is highly desirable to have monitoring available for individual components, such as line cards, processors, disk drives, and peripherals such as USB devices.",
      "zh-CHS": "此场景涵盖网络设备及其组件的关键用例。对于了解一个或多个组件的设备，我们的信息模型支持在组件级别进行监视和控制。通常，机箱从一个或多个电源获取电源，并为其内部组件供电。对于单个组件（如线路卡、处理器、磁盘驱动器和外围设备（如USB设备））来说，非常需要监控。"
    },
    {
      "indent": 3,
      "text": "As an illustrative example, consider a switch with the following grouping of subentities for which energy management could be useful.",
      "zh-CHS": "作为一个说明性的例子，考虑一个具有以下能量子组的开关，其中能量管理可能是有用的。"
    },
    {
      "indent": 6,
      "text": "o Physical view: chassis (or stack), line cards, and service modules of the switch.",
      "zh-CHS": "o 物理视图：交换机的机箱（或堆栈）、线路卡和服务模块。"
    },
    {
      "indent": 6,
      "text": "o Component view: CPU, Application-Specific Integrated Circuits (ASICs), fans, power supply, ports (single port and port groups), storage, and memory.",
      "zh-CHS": "o 组件视图：CPU、专用集成电路（ASIC）、风扇、电源、端口（单端口和端口组）、存储器和内存。"
    },
    {
      "indent": 3,
      "text": "The ENTITY-MIB [RFC6933] provides a containment model for uniquely identifying the physical subcomponents of network devices. The containment information identifies whether one Energy Object belongs to another Energy Object (e.g., a line-card Energy Object contained in a chassis Energy Object). The mapping table, entPhysicalContainsTable, has an index, entPhysicalChildIndex, and the table, entPhysicalTable, has a MIB object, entPhysicalContainedIn, that points to the containing entity.",
      "zh-CHS": "ENTITY-MIB[RFC6933]提供了一个包含模型，用于唯一标识网络设备的物理子组件。安全壳信息标识一个能源对象是否属于另一个能源对象（例如，机箱能源对象中包含的线路卡能源对象）。映射表EntPhysicalContainedStable有一个索引entPhysicalChildIndex，而表entPhysicalTable有一个指向包含实体的MIB对象entPhysicalContainedIn。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: network devices such as routers and switches, as well as their components.",
      "zh-CHS": "o 目标设备：路由器和交换机等网络设备及其组件。"
    },
    {
      "indent": 6,
      "text": "o How powered: typically by a Power Distribution Unit (PDU) on a rack or from a wall outlet. The components of a device are powered by the device chassis.",
      "zh-CHS": "o 供电方式：通常由机架上的配电装置（PDU）或墙上的插座供电。设备的组件由设备机箱供电。"
    },
    {
      "indent": 6,
      "text": "o Reporting: Direct power measurement can be performed at a device level. Components can report their power consumption directly, or the chassis/device can report on behalf of some components.",
      "zh-CHS": "o 报告：可在设备级别执行直接功率测量。组件可以直接报告其功耗，或者机箱/设备可以代表某些组件进行报告。"
    },
    {
      "indent": 0,
      "text": "2.2. Devices Powered and Connected by a Network Device",
      "section_title": true,
      "zh-CHS": "2.2. 由网络设备供电和连接的设备"
    },
    {
      "indent": 3,
      "text": "This scenario covers Power Sourcing Equipment (PSE) devices. A PSE device (e.g., a PoE switch) provides power to a Powered Device (PD) (e.g., a desktop phone) over a medium such as USB or Ethernet [RFC3621]. For each port, the PSE can control the power supply (switching it on and off) and usually meter actual power provided. PDs obtain network connectivity as well as power over a single connection so the PSE can determine which device is associated with each port.",
      "zh-CHS": "此场景包括电源设备（PSE）设备。PSE设备（例如PoE交换机）通过USB或以太网等介质向受电设备（PD）（例如台式电话）供电[RFC3621]。对于每个端口，PSE可以控制电源（打开和关闭电源），通常测量实际提供的功率。PDs通过单个连接获得网络连接和电源，因此PSE可以确定哪个设备与每个端口关联。"
    },
    {
      "indent": 3,
      "text": "PoE ports on a switch are commonly connected to devices such as IP phones, wireless access points, and IP cameras. The switch needs power for its internal use and to supply power to PoE ports. Monitoring the power consumption of the switch (supplying device) and the power consumption of the PoE endpoints (consuming devices) is a simple use case of this scenario.",
      "zh-CHS": "交换机上的PoE端口通常连接到IP电话、无线接入点和IP摄像头等设备。交换机内部使用和向PoE端口供电需要电源。监控交换机（供电设备）的功耗和PoE端点（消费设备）的功耗是此场景的一个简单用例。"
    },
    {
      "indent": 3,
      "text": "This scenario illustrates the relationships between entities. The PoE IP phone is powered by the switch. If there are many IP phones connected to the same switch, the power consumption of all the IP phones can be aggregated by the switch.",
      "zh-CHS": "此场景演示了实体之间的关系。PoE IP电话由交换机供电。如果有许多IP电话连接到同一个交换机，则所有IP电话的功耗都可以通过交换机聚合。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "Target devices: Power over Ethernet devices such as IP phones, wireless access points, and IP cameras.",
      "zh-CHS": "目标设备：通过以太网设备供电，如IP电话、无线接入点和IP摄像头。"
    },
    {
      "indent": 6,
      "text": "How powered: PoE devices are connected to the switch port that supplies power to those devices.",
      "zh-CHS": "供电方式：PoE设备连接到为这些设备供电的交换机端口。"
    },
    {
      "indent": 6,
      "text": "Reporting: PoE device power consumption is measured and reported by the switch (PSE) that supplies power. In addition, some edge devices can support the EMAN framework.",
      "zh-CHS": "报告：PoE设备功耗由供电的交换机（PSE）测量和报告。此外，一些边缘设备可以支持EMAN框架。"
    },
    {
      "indent": 3,
      "text": "This use case can be divided into two subcases:",
      "zh-CHS": "此用例可分为两个子类："
    },
    {
      "indent": 6,
      "text": "a) The endpoint device supports the EMAN framework, in which case this device is an EMAN Energy Object by itself with its own Universally Unique Identifier (UUID). The device is responsible for its own power reporting and control. See the related scenario \"Devices Connected to a Network\" below.",
      "zh-CHS": "a) 端点设备支持EMAN框架，在这种情况下，该设备本身就是一个具有自己的通用唯一标识符（UUID）的EMAN能量对象。设备负责其自身的功率报告和控制。请参阅下面的相关场景“连接到网络的设备”。"
    },
    {
      "indent": 6,
      "text": "b) The endpoint device does not have EMAN capabilities, and the power measurement may not be able to be performed independently and is therefore only performed by the supplying device. This scenario is similar to the \"Mid-level Manager\" below.",
      "zh-CHS": "b) 终端设备不具有EMAN能力，并且功率测量可能无法独立执行，因此仅由供电设备执行。此场景类似于下面的“中级经理”。"
    },
    {
      "indent": 3,
      "text": "In subcase (a), note that two power usage reporting mechanisms for the same device are available: one performed by the PD itself and one performed by the PSE. Device-specific implementations will dictate which one to use.",
      "zh-CHS": "在subcase（a）中，请注意，同一设备有两种可用的电源使用情况报告机制：一种由PD自身执行，另一种由PSE执行。特定于设备的实现将决定使用哪一种。"
    },
    {
      "indent": 0,
      "text": "2.3. Devices Connected to a Network",
      "section_title": true,
      "zh-CHS": "2.3. 连接到网络的设备"
    },
    {
      "indent": 3,
      "text": "This use case covers the metering relationship between an energy object and the parent energy object to which it is connected, while receiving power from a different source.",
      "zh-CHS": "本用例涵盖了能量对象与其连接的父能量对象之间的计量关系，同时从不同的电源接收电力。"
    },
    {
      "indent": 3,
      "text": "An example is a PC that has a network connection to a switch but draws power from a wall outlet. In this case, the PC can report power usage by itself, ideally through the EMAN framework.",
      "zh-CHS": "例如，一台PC与交换机有网络连接，但从墙上的插座获取电源。在这种情况下，PC可以自行报告电源使用情况，最好是通过EMAN框架。"
    },
    {
      "indent": 3,
      "text": "The wall outlet to which the PC is plugged in can be unmetered or metered, for example, by a Smart PDU.",
      "zh-CHS": "例如，可以通过智能PDU对插入电脑的墙上插座进行非计量或计量。"
    },
    {
      "indent": 6,
      "text": "a) If metered, the PC has a powered-by relationship to the Smart PDU, and the Smart PDU acts as a \"mid-level manager\".",
      "zh-CHS": "a) 如果按计量，则PC与智能PDU之间有一种由电源供电的关系，智能PDU充当“中级管理器”。"
    },
    {
      "indent": 6,
      "text": "b) If unmetered, or operating on batteries, the PC will report its own energy usage as any other Energy Object to the switch, and the switch may possibly provide aggregation.",
      "zh-CHS": "b) 如果未计量或使用电池，PC将向交换机报告其自身的能量使用情况，作为任何其他能量对象，交换机可能会提供聚合。"
    },
    {
      "indent": 3,
      "text": "These two cases are not mutually exclusive.",
      "zh-CHS": "这两种情况并不相互排斥。"
    },
    {
      "indent": 3,
      "text": "In terms of relationships between entities, the PC has a powered-by relationship to the PDU, and if the power consumption of the PC is metered by the PDU, then there is a metered-by relation between the PC and the PDU.",
      "zh-CHS": "就实体之间的关系而言，PC与PDU之间存在按电源供电的关系，如果PC的功耗由PDU计量，则PC与PDU之间存在按电源供电的关系。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: energy objects that have a network connection but receive power supply from another source.",
      "zh-CHS": "o 目标设备：具有网络连接但从其他来源接收电源的能量对象。"
    },
    {
      "indent": 6,
      "text": "o How powered: endpoint devices (e.g., PCs) receive power supply from the wall outlet (unmetered), a PDU (metered), or can be powered autonomously (batteries).",
      "zh-CHS": "o 供电方式：终端设备（如PC）从墙上插座（未计量）、PDU（计量）接收电源，或者可以自动供电（电池）。"
    },
    {
      "indent": 6,
      "text": "o Reporting: The power consumption can be reported via the EMAN framework - by the device directly, - by the switch with information provided to it by the device, or - by the PDU from which the device obtains its power.",
      "zh-CHS": "o 报告：功耗可以通过EMAN框架报告-由设备直接报告-由交换机通过设备提供的信息报告，或-由设备从中获取电源的PDU报告。"
    },
    {
      "indent": 0,
      "text": "2.4. Power Meters",
      "section_title": true,
      "zh-CHS": "2.4. 功率计"
    },
    {
      "indent": 3,
      "text": "Some electrical devices are not equipped with instrumentation to measure their own power and accumulated energy consumption. External meters can be used to measure the power consumption of such electrical devices as well as collections of devices.",
      "zh-CHS": "一些电气设备未配备测量自身功率和累计能耗的仪器。外部仪表可用于测量此类电气设备以及设备集合的功耗。"
    },
    {
      "indent": 3,
      "text": "Three types of external metering are relevant to EMAN: PDUs, standalone meters, and utility meters. External meters can measure consumption of a single device or a set of devices.",
      "zh-CHS": "三种类型的外部计量与EMAN相关：PDU、独立计量器和公用电计量器。外部仪表可以测量单个设备或一组设备的消耗量。"
    },
    {
      "indent": 3,
      "text": "Power Distribution Units (PDUs) can have built-in meters for each socket and can measure the power supplied to each device in an equipment rack. PDUs typically have remote management capabilities that can report and possibly control the power supply of each outlet.",
      "zh-CHS": "配电装置（PDU）可以为每个插座配备内置仪表，并可以测量设备机架中每个设备的供电量。PDU通常具有远程管理功能，可以报告并可能控制每个插座的电源。"
    },
    {
      "indent": 3,
      "text": "Standalone meters can be placed anywhere in a power distribution tree and may measure all or part of the total. Utility meters monitor and report accumulated power consumption of the entire building. There can be submeters to measure the power consumption of a portion of the building.",
      "zh-CHS": "独立电表可以放置在配电树中的任何位置，可以测量全部或部分总电量。公用电表监控并报告整个建筑的累计功耗。可以使用子仪表测量建筑物部分的功耗。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: PDUs and meters.",
      "zh-CHS": "o 目标设备：PDU和仪表。"
    },
    {
      "indent": 6,
      "text": "o How powered: from traditional mains power but supplied through a PDU or meter (where \"mains power\" is the standard AC power drawn from the wall outlet).",
      "zh-CHS": "o 供电方式：由传统电源供电，但通过PDU或仪表供电（其中“电源”是指从墙上插座引出的标准交流电源）。"
    },
    {
      "indent": 6,
      "text": "o Reporting: PDUs report power consumption of downstream devices, usually a single device per outlet. Meters may report for one or more devices and may require knowledge of the topology to associate meters with metered devices.",
      "zh-CHS": "o 报告：PDU报告下游设备的功耗，通常为每个插座的单个设备。仪表可能报告一个或多个设备，并且可能需要拓扑知识才能将仪表与计量设备相关联。"
    },
    {
      "indent": 3,
      "text": "Meters have metered-by relationships with devices and may have aggregation relationships between the meters and the devices for which power consumption is accumulated and reported by the meter.",
      "zh-CHS": "电表通过与设备的关系进行计量，并且可能在电表与电表累计和报告功耗的设备之间具有聚合关系。"
    },
    {
      "indent": 0,
      "text": "2.5. Mid-level Managers",
      "section_title": true,
      "zh-CHS": "2.5. 中层管理人员"
    },
    {
      "indent": 3,
      "text": "This use case covers aggregation of energy management data at \"mid-level managers\" that can provide energy management functions for themselves and associated devices.",
      "zh-CHS": "本用例涵盖了“中层管理者”的能源管理数据聚合，这些管理者可以为自己和相关设备提供能源管理功能。"
    },
    {
      "indent": 3,
      "text": "A switch can provide energy management functions for all devices connected to its ports whether or not these devices are powered by the switch or whether the switch provides immediate network connectivity to the devices. Such a switch is a mid-level manager, offering aggregation of power consumption data for other devices. Devices report their EMAN data to the switch and the switch aggregates the data for further reporting.",
      "zh-CHS": "交换机可以为连接到其端口的所有设备提供能量管理功能，无论这些设备是否由交换机供电，或者交换机是否为设备提供即时网络连接。这样的交换机是一个中级管理器，为其他设备提供功耗数据的聚合。设备向交换机报告其EMAN数据，交换机聚合数据以进行进一步报告。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case:",
      "zh-CHS": "此用例的基本属性："
    },
    {
      "indent": 6,
      "text": "o Target devices: devices that can perform aggregation; commonly a switch or a proxy.",
      "zh-CHS": "o 目标设备：可以执行聚合的设备；通常是开关或代理。"
    },
    {
      "indent": 6,
      "text": "o How powered: mid-level managers are commonly powered by a PDU or from a wall outlet but can be powered by any method.",
      "zh-CHS": "o 供电方式：中层管理人员通常由PDU或墙上插座供电，但可以通过任何方式供电。"
    },
    {
      "indent": 6,
      "text": "o Reporting: The mid-level manager aggregates the energy data and reports that data to an EnMS or higher mid-level manager.",
      "zh-CHS": "o 报告：中级经理汇总能源数据，并将数据报告给EnMS或更高级别的中级经理。"
    },
    {
      "indent": 0,
      "text": "2.6. Non-residential Building System Gateways",
      "section_title": true,
      "zh-CHS": "2.6. 非住宅建筑系统网关"
    },
    {
      "indent": 3,
      "text": "This use case describes energy management of non-residential buildings. Building Management Systems (BMS) have been in place for many years using legacy protocols not based on IP. In these buildings, a gateway can provide a proxy function between IP networks",
      "zh-CHS": "本用例描述了非住宅建筑的能源管理。楼宇管理系统（BMS）使用非基于IP的遗留协议已有多年。在这些建筑物中，网关可以在IP网络之间提供代理功能"
    },
    {
      "indent": 3,
      "text": "and legacy building automation protocols. The gateway provides an interface between the EMAN framework and relevant building management protocols.",
      "zh-CHS": "和传统的楼宇自动化协议。网关提供了EMAN框架和相关楼宇管理协议之间的接口。"
    },
    {
      "indent": 3,
      "text": "Due to the potential energy savings, energy management of buildings has received significant attention. There are gateway network elements to manage the multiple components of a building energy management system such as Heating, Ventilation, and Air Conditioning (HVAC), lighting, electrical, fire and emergency systems, elevators, etc. The gateway device uses legacy building protocols to communicate with those devices, collects their energy usage, and reports the results.",
      "zh-CHS": "由于建筑节能的潜力，建筑的能源管理受到了广泛的关注。有网关网元来管理建筑能源管理系统的多个组件，如供暖、通风和空调（HVAC）、照明、电气、消防和应急系统、电梯等。网关设备使用传统建筑协议与这些设备通信，收集其能源使用情况，并报告结果。"
    },
    {
      "indent": 3,
      "text": "The gateway performs protocol conversion and communicates via RS-232/RS-485 interfaces, Ethernet interfaces, and protocols specific to building management such as BACnet (a protocol for building automation and control networks) [BACnet], Modbus [MODBUS], or ZigBee [ZIGBEE].",
      "zh-CHS": "网关通过RS-232/RS-485接口、以太网接口和特定于楼宇管理的协议（如BACnet（楼宇自动化和控制网络协议）[BACnet]、Modbus[Modbus]或ZigBee[ZigBee]）执行协议转换和通信。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: building energy management devices -- HVAC systems, lighting, electrical, and fire and emergency systems.",
      "zh-CHS": "o 目标设备：建筑能源管理设备——暖通空调系统、照明、电气、消防和应急系统。"
    },
    {
      "indent": 6,
      "text": "o How powered: any method.",
      "zh-CHS": "o 动力：任何方法。"
    },
    {
      "indent": 6,
      "text": "o Reporting: The gateway collects energy consumption of non-IP systems and communicates the data via the EMAN framework.",
      "zh-CHS": "o 报告：网关收集非IP系统的能耗，并通过EMAN框架进行数据通信。"
    },
    {
      "indent": 0,
      "text": "2.7. Home Energy Gateways",
      "section_title": true,
      "zh-CHS": "2.7. 家庭能源网关"
    },
    {
      "indent": 3,
      "text": "This use case describes the scenario of energy management of a home. The home energy gateway is another example of a proxy that interfaces with electrical appliances and other devices in a home. This gateway can monitor and manage electrical equipment (e.g., refrigerator, heating/cooling, or washing machine) using one of the many protocols that are being developed for residential devices.",
      "zh-CHS": "本用例描述了家庭能源管理的场景。家庭能源网关是与家庭中的电器和其他设备接口的代理的另一个示例。该网关可以使用为住宅设备开发的众多协议之一来监控和管理电气设备（例如，冰箱、加热/冷却或洗衣机）。"
    },
    {
      "indent": 3,
      "text": "Beyond simply metering, it's possible to implement energy saving policies based on time of day, occupancy, or energy pricing from the utility grid. The EMAN information model can be applied to the energy management of a home.",
      "zh-CHS": "除了简单的计量之外，还可以根据一天中的时间、占用率或公用电网的能源定价实施节能政策。EMAN信息模型可应用于家庭能源管理。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: home energy gateway and smart meters in a home.",
      "zh-CHS": "o 目标设备：家庭能源网关和家庭智能电表。"
    },
    {
      "indent": 6,
      "text": "o How powered: any method.",
      "zh-CHS": "o 动力：任何方法。"
    },
    {
      "indent": 6,
      "text": "o Reporting: The home energy gateway can collect power consumption of device in a home and possibly report the meter reading to the utility.",
      "zh-CHS": "o 报告：家庭能源网关可以收集家庭中设备的功耗，并可能向公用事业公司报告电表读数。"
    },
    {
      "indent": 0,
      "text": "2.8. Data Center Devices",
      "section_title": true,
      "zh-CHS": "2.8. 数据中心设备"
    },
    {
      "indent": 3,
      "text": "This use case describes energy management of a data center. Energy efficiency of data centers has become a fundamental challenge of data center operation, as data centers are big energy consumers and have an expensive infrastructure. The equipment generates heat, and heat needs to be evacuated through an HVAC system.",
      "zh-CHS": "本用例描述数据中心的能源管理。数据中心的能源效率已成为数据中心运营的一个基本挑战，因为数据中心是能源消耗大户，基础设施成本高昂。设备产生热量，需要通过HVAC系统排出热量。"
    },
    {
      "indent": 3,
      "text": "A typical data center network consists of a hierarchy of electrical energy objects. At the bottom of the network hierarchy are servers mounted on a rack; these are connected to top-of-the-rack switches, which in turn are connected to aggregation switches and then to core switches. Power consumption of all network elements, servers, and storage devices in the data center should be measured. Energy management can be implemented on different aggregation levels, i.e., at the network level, the Power Distribution Unit (PDU) level, and/or the server level.",
      "zh-CHS": "典型的数据中心网络由电能对象的层次结构组成。在网络层次结构的底部是安装在机架上的服务器；这些交换机连接到机架顶部交换机，机架顶部交换机依次连接到聚合交换机和核心交换机。应测量数据中心中所有网络元件、服务器和存储设备的功耗。能量管理可以在不同的聚合级别上实现，即在网络级别、配电单元（PDU）级别和/或服务器级别。"
    },
    {
      "indent": 3,
      "text": "Beyond the network devices, storage devices, and servers, data centers contain Uninterruptable Power Systems (UPSs) to provide back-up power for the facility in the event of a power outage. A UPS can provide backup power for many devices in a data center for a finite period of time. Energy monitoring of energy storage capacity is vital from a data center network operations point of view. Presently, the UPS MIB can be useful in monitoring the battery capacity, the input load to the UPS, and the output load from the UPS. Currently, there is no link between the UPS MIB and the ENTITY MIB.",
      "zh-CHS": "除了网络设备、存储设备和服务器之外，数据中心还包含不间断电源系统（UPS），以便在停电时为设施提供备用电源。UPS可以在有限的时间内为数据中心中的许多设备提供备用电源。从数据中心网络运营的角度来看，能源存储容量的能源监控至关重要。目前，UPS MIB可用于监控电池容量、UPS的输入负载和UPS的输出负载。目前，UPS MIB和实体MIB之间没有链接。"
    },
    {
      "indent": 3,
      "text": "In addition to monitoring the power consumption of a data center, additional power characteristics should be monitored. Some of these are dynamic variations in the input power supply from the grid, referred to as power quality metrics. It can also be useful to monitor how efficiently the devices utilize power.",
      "zh-CHS": "除了监控数据中心的功耗外，还应监控其他电源特性。其中一些是电网输入电源的动态变化，称为电能质量指标。监测设备如何有效地利用电力也很有用。"
    },
    {
      "indent": 3,
      "text": "Nameplate capacity of the data center can be estimated from the nameplate ratings (which indicate the maximum possible power draw) of IT equipment at a site.",
      "zh-CHS": "数据中心的铭牌容量可根据现场IT设备的铭牌额定值（指示最大可能功率消耗）进行估算。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: IT devices in a data center, such as network equipment, servers, and storage devices, as well as power and cooling infrastructure.",
      "zh-CHS": "o 目标设备：数据中心中的IT设备，如网络设备、服务器和存储设备，以及电源和冷却基础设施。"
    },
    {
      "indent": 6,
      "text": "o How powered: any method, but commonly by one or more PDUs.",
      "zh-CHS": "o 如何供电：任何方法，但通常由一个或多个PDU供电。"
    },
    {
      "indent": 6,
      "text": "o Reporting: Devices may report on their own behalf or for other connected devices as described in other use cases.",
      "zh-CHS": "o 报告：设备可以自己报告，也可以按照其他用例中的描述报告其他连接的设备。"
    },
    {
      "indent": 0,
      "text": "2.9. Energy Storage Devices",
      "section_title": true,
      "zh-CHS": "2.9. 储能装置"
    },
    {
      "indent": 3,
      "text": "Energy storage devices can have two different roles: one type whose primary function is to provide power to another device (e.g., a UPS) and one type with a different primary function but that has energy storage as a component (e.g., a notebook). This use case covers both.",
      "zh-CHS": "储能设备可以有两种不同的功能：一种主要功能是向另一个设备（如UPS）供电，另一种主要功能不同，但将储能作为一个组件（如笔记本电脑）。这个用例涵盖了这两个方面。"
    },
    {
      "indent": 3,
      "text": "The energy storage can be a conventional battery or any other means to store electricity, such as a hydrogen cell.",
      "zh-CHS": "储能装置可以是传统电池或任何其他储能装置，如氢电池。"
    },
    {
      "indent": 3,
      "text": "An internal battery can be a back-up or an alternative source of power to mains power. As batteries have a finite capacity and lifetime, means for reporting the actual charge, age, and state of a battery are required. An internal battery can be viewed as a component of a device and can be contained within the device from an ENTITY-MIB perspective.",
      "zh-CHS": "内部电池可以作为备用电源或主电源的替代电源。由于电池的容量和寿命有限，因此需要报告电池的实际电量、使用寿命和状态的方法。内部电池可以被视为设备的一个组件，并且可以从ENTITY-MIB的角度包含在设备中。"
    },
    {
      "indent": 3,
      "text": "Battery systems are often used in remote locations such as mobile telecom towers. For continuous operation, it is important to monitor the remaining battery life and raise an alarm when this falls below a threshold.",
      "zh-CHS": "电池系统通常用于远程位置，如移动通信塔。对于连续运行，重要的是监测剩余电池寿命，并在低于阈值时发出警报。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: devices that have an internal battery or external storage.",
      "zh-CHS": "o 目标设备：具有内部电池或外部存储器的设备。"
    },
    {
      "indent": 6,
      "text": "o How powered: from batteries or other storage devices.",
      "zh-CHS": "o 供电方式：由电池或其他存储设备供电。"
    },
    {
      "indent": 6,
      "text": "o Reporting: The device reports on its power delivered and state.",
      "zh-CHS": "o 报告：设备报告其电源传输和状态。"
    },
    {
      "indent": 0,
      "text": "2.10. Industrial Automation Networks",
      "section_title": true,
      "zh-CHS": "2.10. 工业自动化网络"
    },
    {
      "indent": 3,
      "text": "Energy consumption statistics in the industrial sector are staggering. The industrial sector alone consumes about half of the world's total delivered energy and is a significant user of electricity. Thus, the need for optimization of energy usage in this sector is natural.",
      "zh-CHS": "工业部门的能源消耗统计数字令人震惊。仅工业部门就消耗了全世界输送能源总量的一半左右，是电力的重要用户。因此，自然需要优化该部门的能源使用。"
    },
    {
      "indent": 3,
      "text": "Industrial facilities consume energy in process loads and non-process loads.",
      "zh-CHS": "工业设施在过程负荷和非过程负荷中消耗能源。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: devices used in an industrial sector.",
      "zh-CHS": "o 目标设备：用于工业部门的设备。"
    },
    {
      "indent": 6,
      "text": "o How powered: any method.",
      "zh-CHS": "o 动力：任何方法。"
    },
    {
      "indent": 6,
      "text": "o Reporting: The Common Industrial Protocol (CIP) is commonly used for reporting energy for these devices.",
      "zh-CHS": "o 报告：通用工业协议（CIP）通常用于报告这些设备的能量。"
    },
    {
      "indent": 0,
      "text": "2.11. Printers",
      "section_title": true,
      "zh-CHS": "2.11. 印刷工"
    },
    {
      "indent": 3,
      "text": "This use case describes the scenario of energy monitoring and management of printers. Printers in this use case stand in for all imaging equipment, including Multi-function Devices (MFDs), scanners, fax machines, and mailing machines.",
      "zh-CHS": "本用例描述打印机的能源监控和管理场景。本用例中的打印机代表所有成像设备，包括多功能设备（MFD）、扫描仪、传真机和邮件机。"
    },
    {
      "indent": 3,
      "text": "Energy use of printers has been a long-standing industry concern, and sophisticated power management is common. Printers often use a variety of low-power modes, particularly for managing energy-intensive thermo-mechanical components. Printers also have long made extensive use of SNMP for end-user system interaction and for management generally, with cross-vendor management systems able to manage fleets of printers in enterprises. Power consumption during active modes can vary widely, with high peak usage levels.",
      "zh-CHS": "打印机的能源使用一直是业界关注的问题，复杂的电源管理也很常见。打印机通常使用各种低功耗模式，特别是用于管理能源密集型热机械部件。打印机长期以来也广泛使用SNMP进行最终用户系统交互和管理，跨供应商管理系统能够管理企业中的打印机组。活动模式下的功耗变化很大，峰值使用率很高。"
    },
    {
      "indent": 3,
      "text": "Printers can expose detailed power state information, distinct from operational state information, with some printers reporting transition states between stable long-term states. Many also support active setting of power states and policies, such as delay times, when inactivity automatically transitions the device to a lower power mode. Other features include reporting on components, counters for state transitions, typical power levels by state, scheduling, and events/alarms.",
      "zh-CHS": "打印机可以公开详细的电源状态信息，与操作状态信息不同，一些打印机报告稳定长期状态之间的过渡状态。许多还支持电源状态和策略的活动设置，例如当设备处于非活动状态时自动转换到较低电源模式的延迟时间。其他功能包括组件报告、状态转换计数器、按状态划分的典型功率级别、调度和事件/警报。"
    },
    {
      "indent": 3,
      "text": "Some large printers also have a \"Digital Front End\", which is a computer that performs functions on behalf of the physical imaging system. These typically have their own presence on the network and are sometimes separately powered.",
      "zh-CHS": "一些大型打印机也有“数字前端”，这是一台代表物理成像系统执行功能的计算机。它们通常在网络上有自己的存在，有时单独供电。"
    },
    {
      "indent": 3,
      "text": "There are some unique characteristics of printers from the point of view energy management. While the printer is not in use, there are timer-based low power states, which consume little power. On the other hand, while the printer is printing or copying, the cylinder is heated so that power consumption is quite high but only for a short period of time. Given this work load, periodic polling of power levels alone would not suffice.",
      "zh-CHS": "从能源管理的角度来看，打印机有一些独特的特点。打印机未使用时，会出现基于计时器的低功耗状态，功耗很小。另一方面，当打印机打印或复印时，滚筒被加热，因此功耗相当高，但仅在短时间内。鉴于这种工作负载，仅定期轮询功率级别是不够的。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: all imaging equipment.",
      "zh-CHS": "o 目标设备：所有成像设备。"
    },
    {
      "indent": 6,
      "text": "o How powered: typically, AC from a wall outlet.",
      "zh-CHS": "o 供电方式：通常情况下，从墙上插座获得交流电。"
    },
    {
      "indent": 6,
      "text": "o Reporting: The devices report for themselves.",
      "zh-CHS": "o 报告：设备自行报告。"
    },
    {
      "indent": 0,
      "text": "2.12. Demand Response",
      "section_title": true,
      "zh-CHS": "2.12. 需求响应"
    },
    {
      "indent": 3,
      "text": "The theme of demand response from a utility grid spans across several use cases. In some situations, in response to time-of-day fluctuation of energy costs or sudden energy shortages due power outages, it may be important to respond and reduce the energy consumption of the network.",
      "zh-CHS": "公用电网的需求响应主题跨越多个用例。在某些情况下，为了应对一天中能源成本的波动或停电导致的突然能源短缺，应对并降低网络的能耗可能很重要。"
    },
    {
      "indent": 3,
      "text": "From the EMAN use case perspective, the demand-response scenario can apply to a data center, building, or home. Real-time energy monitoring is usually a prerequisite so that during a potential energy shortfall the EnMS can provide an active response. The EnMS could shut down selected devices that are considered lower priority or uniformly reduce the power supplied to a class of devices. For multisite data centers, it may be possible to formulate policies such as the follow-the-sun type of approach by scheduling the mobility of Virtual Machines (VMs) across data centers in different geographical locations.",
      "zh-CHS": "从EMAN用例的角度来看，需求响应场景可以应用于数据中心、建筑物或家庭。实时能源监测通常是一个先决条件，以便在潜在能源短缺期间，EnMS能够提供积极响应。EnMS可以关闭被认为优先级较低的选定设备，或统一减少向一类设备供电。对于多站点数据中心，可以通过在不同地理位置的数据中心之间调度虚拟机（VM）的移动性来制定策略，如“追随太阳”式方法。"
    },
    {
      "indent": 3,
      "text": "The essential properties of this use case are:",
      "zh-CHS": "此用例的基本属性是："
    },
    {
      "indent": 6,
      "text": "o Target devices: any device.",
      "zh-CHS": "o 目标设备：任何设备。"
    },
    {
      "indent": 6,
      "text": "o How powered: traditional mains AC power.",
      "zh-CHS": "o 供电方式：传统交流电源。"
    },
    {
      "indent": 6,
      "text": "o Reporting: Devices report in real time.",
      "zh-CHS": "o 报告：设备实时报告。"
    },
    {
      "indent": 6,
      "text": "o Control: demand response based upon policy or priority.",
      "zh-CHS": "o 控制：基于策略或优先级的需求响应。"
    },
    {
      "indent": 0,
      "text": "3. Use Case Patterns",
      "section_title": true,
      "zh-CHS": "3. 用例模式"
    },
    {
      "indent": 3,
      "text": "The use cases presented above can be abstracted to the following broad patterns for energy objects.",
      "zh-CHS": "上述用例可以抽象为以下能源对象的广泛模式。"
    },
    {
      "indent": 0,
      "text": "3.1. Metering",
      "section_title": true,
      "zh-CHS": "3.1. 测量"
    },
    {
      "indent": 3,
      "text": "- Energy objects that have the capability for internal metering",
      "zh-CHS": "- 具有内部计量能力的能源对象"
    },
    {
      "indent": 3,
      "text": "- Energy objects that are metered by an external device",
      "zh-CHS": "- 由外部设备计量的能量对象"
    },
    {
      "indent": 0,
      "text": "3.2. Metering and Control",
      "section_title": true,
      "zh-CHS": "3.2. 计量与控制"
    },
    {
      "indent": 3,
      "text": "- Energy objects that do not supply power but can perform power metering for other devices",
      "zh-CHS": "- 不供电但可以为其他设备进行功率计量的能源对象"
    },
    {
      "indent": 3,
      "text": "- Energy objects that do not supply power but can perform both metering and control for other devices",
      "zh-CHS": "- 不供电但可对其他设备进行计量和控制的能源对象"
    },
    {
      "indent": 0,
      "text": "3.3. Power Supply, Metering, and Control",
      "section_title": true,
      "zh-CHS": "3.3. 电源、计量和控制"
    },
    {
      "indent": 3,
      "text": "- Energy objects that supply power for other devices but do not perform power metering for those devices",
      "zh-CHS": "- 为其他设备供电但不为这些设备执行功率计量的能源对象"
    },
    {
      "indent": 3,
      "text": "- Energy objects that supply power for other devices and also perform power metering",
      "zh-CHS": "- 为其他设备供电并执行功率计量的能源对象"
    },
    {
      "indent": 3,
      "text": "- Energy objects that supply power for other devices and also perform power metering and control for other devices",
      "zh-CHS": "- 为其他设备供电并对其他设备进行功率计量和控制的能源对象"
    },
    {
      "indent": 0,
      "text": "3.4. Multiple Power Sources",
      "section_title": true,
      "zh-CHS": "3.4. 多电源"
    },
    {
      "indent": 3,
      "text": "- Energy objects that have multiple power sources, with metering and control performed by the same power source",
      "zh-CHS": "- 具有多个电源且由同一电源执行计量和控制的能源对象"
    },
    {
      "indent": 3,
      "text": "- Energy objects that have multiple power sources supplying power to the device with metering performed by one or more sources and control performed by another source",
      "zh-CHS": "- 具有多个电源的能源对象，通过一个或多个电源进行计量并通过另一个电源进行控制，向设备供电"
    },
    {
      "indent": 0,
      "text": "4. Relationship of EMAN to Other Standards",
      "section_title": true,
      "zh-CHS": "4. EMAN与其他标准的关系"
    },
    {
      "indent": 3,
      "text": "The EMAN framework is tied to other standards and efforts that address energy monitoring and control. EMAN leverages existing standards when possible, and it helps enable adjacent technologies such as Smart Grid.",
      "zh-CHS": "EMAN框架与解决能源监测和控制的其他标准和工作相关联。EMAN尽可能利用现有标准，并帮助实现智能电网等相邻技术。"
    },
    {
      "indent": 3,
      "text": "The standards most relevant and applicable to EMAN are listed below with a brief description of their objectives, the current state, and how that standard relates to EMAN.",
      "zh-CHS": "以下列出了与电子政务管理最相关和最适用的标准，并简要说明了其目标、现状以及该标准与电子政务管理的关系。"
    },
    {
      "indent": 0,
      "text": "4.1. Data Model and Reporting",
      "section_title": true,
      "zh-CHS": "4.1. 数据模型和报告"
    },
    {
      "indent": 0,
      "text": "4.1.1. IEC - CIM",
      "section_title": true,
      "zh-CHS": "4.1.1. IEC-CIM"
    },
    {
      "indent": 3,
      "text": "The International Electrotechnical Commission (IEC) has developed a broad set of standards for power management. Among these, the most applicable to EMAN is IEC 61850, a standard for the design of electric utility automation. The abstract data model defined in 61850 is built upon and extends the Common Information Model (CIM). The complete 61850 CIM model includes over a hundred object classes and is widely used by utilities worldwide.",
      "zh-CHS": "国际电工委员会（IEC）制定了一套广泛的电源管理标准。其中，最适用于EMAN的是IEC 61850，这是一个用于电力设施自动化设计的标准。61850中定义的抽象数据模型是在公共信息模型（CIM）的基础上建立和扩展的。完整的61850 CIM模型包括100多个对象类，被世界各地的公用事业公司广泛使用。"
    },
    {
      "indent": 3,
      "text": "This set of standards were originally conceived to automate control of a substation (a facility that transfers electricity from the transmission to the distribution system). However, the extensive data model has been widely used in other domains, including Energy Management Systems (EnMS).",
      "zh-CHS": "这套标准最初设想用于自动化变电站控制（将电力从输电系统传输到配电系统的设施）。然而，广泛的数据模型已广泛应用于其他领域，包括能源管理系统（EnMS）。"
    },
    {
      "indent": 3,
      "text": "IEC TC57 WG19 is an ongoing working group with the objective to harmonize the CIM data model and 61850 standards.",
      "zh-CHS": "IEC TC57 WG19是一个正在进行的工作组，其目标是协调CIM数据模型和61850标准。"
    },
    {
      "indent": 3,
      "text": "Several concepts from IEC Standards have been reused in the EMAN documents. In particular, AC Power Quality measurements have been reused from IEC 61850-7-4. The concept of Accuracy Classes for measurement of power and energy has been adapted from ANSI C12.20 and IEC standards 62053-21 and 62053-22.",
      "zh-CHS": "IEC标准中的几个概念已在EMAN文件中重复使用。特别是，已重复使用IEC 61850-7-4中的交流电能质量测量值。功率和能量测量精度等级的概念已根据ANSI C12.20和IEC标准62053-21和62053-22进行了调整。"
    },
    {
      "indent": 0,
      "text": "4.1.2. DMTF",
      "section_title": true,
      "zh-CHS": "4.1.2. DMTF"
    },
    {
      "indent": 3,
      "text": "The Distributed Management Task Force (DMTF) has defined a Power State Management profile [DMTF-DSP1027] for managing computer systems using the DMTF's Common Information Model (CIM). These specifications provide physical, logical, and virtual system management requirements for power-state control services. The DMTF standard does not include energy monitoring.",
      "zh-CHS": "分布式管理任务组（DMTF）定义了一个电源状态管理配置文件[DMTF-DSP1027]，用于使用DMTF的公共信息模型（CIM）管理计算机系统。这些规范为电源状态控制服务提供了物理、逻辑和虚拟系统管理需求。DMTF标准不包括能源监测。"
    },
    {
      "indent": 3,
      "text": "The Power State Management profile is used to describe and manage the Power State of computer systems. This includes controlling the Power State of an entity for entering sleep mode, awakening, and rebooting. The EMAN framework references the DMTF Power Profile and Power State Set.",
      "zh-CHS": "电源状态管理配置文件用于描述和管理计算机系统的电源状态。这包括控制实体的电源状态以进入睡眠模式、唤醒和重新启动。EMAN框架引用DMTF功率配置文件和功率状态集。"
    },
    {
      "indent": 0,
      "text": "4.1.2.1. Common Information Model Profiles",
      "section_title": true,
      "zh-CHS": "4.1.2.1. 公共信息模型概要"
    },
    {
      "indent": 3,
      "text": "The DMTF uses CIM-based 'Profiles' to represent and manage power utilization and configuration of managed elements (note that this is not the 61850 CIM). Key profiles for energy management are 'Power Supply' (DSP 1015), 'Power State' (DSP 1027), and 'Power Utilization Management' (DSP 1085). These profiles define many features for the monitoring and configuration of a Power Managed Element's static and dynamic power saving modes, power allocation limits, and power states.",
      "zh-CHS": "DMTF使用基于CIM的“配置文件”来表示和管理受管元件的电源利用率和配置（注意，这不是61850 CIM）。能源管理的关键配置文件包括“电源”（DSP 1015）、“电源状态”（DSP 1027）和“电源利用管理”（DSP 1085）。这些配置文件定义了许多用于监视和配置电源管理元件的静态和动态节能模式、电源分配限制和电源状态的功能。"
    },
    {
      "indent": 3,
      "text": "Reduced power modes can be established as static or dynamic. Static modes are fixed policies that limit power use or utilization. Dynamic power saving modes rely upon internal feedback to control power consumption.",
      "zh-CHS": "降低功率模式可以建立为静态或动态模式。静态模式是限制电源使用或利用的固定策略。动态节能模式依靠内部反馈来控制功耗。"
    },
    {
      "indent": 3,
      "text": "Power states are eight named operational and non-operational levels. These are On, Sleep-Light, Sleep-Deep, Hibernate, Off-Soft, and Off-Hard. Power change capabilities provide immediate, timed interval, and graceful transitions between on, off, and reset power states. Table 3 of the Power State Profile defines the correspondence between the Advanced Configuration and Power Interface [ACPI] and DMTF power state models, although it is not necessary for a managed element to support ACPI. Optionally, a TransitioningToPowerState property can represent power state transitions in progress.",
      "zh-CHS": "电源状态是八个命名的操作和非操作级别。这些是开着的，睡得轻，睡得深，冬眠，关软，关硬。电源切换功能可在打开、关闭和重置电源状态之间提供即时、定时的间隔和优雅的转换。电源状态配置文件的表3定义了高级配置和电源接口[ACPI]与DMTF电源状态模型之间的对应关系，尽管托管元件不需要支持ACPI。或者，TransitioningToPowerState属性可以表示正在进行的电源状态转换。"
    },
    {
      "indent": 0,
      "text": "4.1.2.2. DASH",
      "section_title": true,
      "zh-CHS": "4.1.2.2. 猛冲"
    },
    {
      "indent": 3,
      "text": "DMTF Desktop and Mobile Architecture for System Hardware [DASH] addresses managing heterogeneous desktop and mobile systems (including power) via in-band and out-of-band communications. DASH uses the DMTF's Web Services for Management (WS-Management) and CIM data model to manage and control resources such as power, CPU, etc.",
      "zh-CHS": "DMTF桌面和移动系统硬件体系结构[DASH]解决了通过带内和带外通信管理异构桌面和移动系统（包括电源）的问题。DASH使用DMTF的Web服务管理（WS-Management）和CIM数据模型来管理和控制资源，如电源、CPU等。"
    },
    {
      "indent": 3,
      "text": "Both in-service and out-of-service systems can be managed with the DASH specification in a fully secured remote environment. Full power life-cycle management is possible using out-of-band management.",
      "zh-CHS": "在完全安全的远程环境中，可以使用DASH规范管理在用和停用系统。使用带外管理可以实现全功率生命周期管理。"
    },
    {
      "indent": 0,
      "text": "4.1.3. ODVA",
      "section_title": true,
      "zh-CHS": "4.1.3. 奥德瓦"
    },
    {
      "indent": 3,
      "text": "The Open DeviceNet Vendors Association (ODVA) is an association for industrial automation companies that defines the Common Industrial Protocol (CIP). Within ODVA, there is a special interest group focused on energy and standardization and interoperability of energy-aware devices.",
      "zh-CHS": "开放设备网供应商协会（ODVA）是一个工业自动化公司协会，定义通用工业协议（CIP）。在ODVA内部，有一个专门的兴趣小组，专注于能源和能源感知设备的标准化和互操作性。"
    },
    {
      "indent": 3,
      "text": "The ODVA is developing an energy management framework for the industrial sector. There are synergies and similar concepts between the ODVA and EMAN approaches to energy monitoring and management.",
      "zh-CHS": "ODVA正在为工业部门制定能源管理框架。ODVA和EMAN能源监测和管理方法之间存在协同效应和类似概念。"
    },
    {
      "indent": 3,
      "text": "ODVA defines a three-part approach towards energy management: awareness of energy usage, energy efficiency, and the exchange of energy with a utility or others. Energy monitoring and management promote efficient consumption and enable automating actions that reduce energy consumption.",
      "zh-CHS": "ODVA定义了能源管理的三部分方法：能源使用意识、能源效率以及与公用事业公司或其他公司的能源交换。能源监控和管理促进了能源的高效消耗，并实现了降低能源消耗的自动化操作。"
    },
    {
      "indent": 3,
      "text": "The foundation of the approach is the information and communication model for entities. An entity is a network-connected, energy-aware device that has the ability to either measure or derive its energy usage based on its native consumption or generation of energy, or report a nominal or static energy value.",
      "zh-CHS": "该方法的基础是实体的信息和通信模型。实体是一种网络连接的能源感知设备，能够根据自身的能源消耗或产生量测量或推导其能源使用量，或报告标称或静态能源值。"
    },
    {
      "indent": 0,
      "text": "4.1.4. Ecma SDC",
      "section_title": true,
      "zh-CHS": "4.1.4. Ecma SDC"
    },
    {
      "indent": 3,
      "text": "The Ecma International standard on Smart Data Centre [Ecma-SDC] defines semantics for management of entities in a data center such as servers, storage, and network equipment. It covers energy as one of many functional resources or attributes of systems for monitoring and control. It only defines messages and properties and does not reference any specific protocol. Its goal is to enable interoperability of such protocols as SNMP, BACnet, and HTTP by ensuring a common semantic model across them. Four power states are defined, Off, Sleep, Idle, and Active. The standard does not include actual energy or power measurements.",
      "zh-CHS": "Ecma智能数据中心国际标准[Ecma SDC]定义了数据中心中实体（如服务器、存储和网络设备）管理的语义。它将能源作为监测和控制系统的许多功能资源或属性之一。它只定义消息和属性，不引用任何特定协议。其目标是通过确保跨SNMP、BACnet和HTTP等协议的通用语义模型，实现它们之间的互操作性。定义了四种电源状态：关闭、睡眠、空闲和活动。本标准不包括实际能量或功率测量。"
    },
    {
      "indent": 3,
      "text": "When used with EMAN, the SDC standard will provide a thin abstraction on top of the more detailed data model available in EMAN.",
      "zh-CHS": "当与EMAN一起使用时，SDC标准将在EMAN中可用的更详细的数据模型之上提供一个精简的抽象。"
    },
    {
      "indent": 0,
      "text": "4.1.5. PWG",
      "section_title": true,
      "zh-CHS": "4.1.5. PWG"
    },
    {
      "indent": 3,
      "text": "The IEEE Industry Standards and Technology Organization (ISTO) Printer Working Group (PWG) defines open standards for printer-related protocols for the benefit of printer manufacturers and related software vendors. The Printer WG covers power monitoring and management of network printers and imaging systems in the PWG Power Management Model for Imaging Systems [PWG5106.4]. Clearly, these",
      "zh-CHS": "IEEE工业标准和技术组织（ISTO）打印机工作组（PWG）为打印机制造商和相关软件供应商定义了打印机相关协议的开放标准。打印机工作组涵盖成像系统PWG电源管理模型[PWG5106.4]中网络打印机和成像系统的电源监控和管理。显然，这些"
    },
    {
      "indent": 3,
      "text": "devices are within the scope of energy management since they receive power and are attached to the network. In addition, there is ample scope for power management since printers and imaging systems are not used that often.",
      "zh-CHS": "设备在能源管理范围内，因为它们接收电力并连接到网络。此外，由于打印机和成像系统的使用频率不高，因此电源管理还有很大的空间。"
    },
    {
      "indent": 3,
      "text": "The IEEE-ISTO Printer Working Group (PWG) defines SNMP MIB modules for printer management and, in particular, a \"PWG Power Management Model for Imaging Systems v1.0\" [PWG5106.4] and a companion SNMP binding in the \"PWG Imaging System Power MIB v1.0\" [PWG5106.5]. This PWG model and MIB are harmonized with the DMTF CIM Infrastructure [DMTF-DSP0004] and DMTF CIM Power State Management Profile [DMTF-DSP1027] for power states and alerts.",
      "zh-CHS": "IEEE-ISTO打印机工作组（PWG）定义了用于打印机管理的SNMP MIB模块，特别是“成像系统PWG电源管理模型v1.0”[PWG5106.4]和“PWG成像系统电源MIB v1.0”[PWG5106.5]中的配套SNMP绑定。该PWG模型和MIB与DMTF CIM基础设施[DMTF-DSP0004]和DMTF CIM电源状态管理配置文件[DMTF-DSP1027]协调，用于电源状态和警报。"
    },
    {
      "indent": 3,
      "text": "These MIB modules can be useful for monitoring the power and Power State of printers. The EMAN framework takes into account the standards defined in the Printer Working Group. The PWG may harmonize its MIBs with those from EMAN. The PWG covers many topics in greater detail than EMAN, including those specific to imaging equipment. The PWG also provides for vendor-specific extension states (beyond the standard DMTF CIM states).",
      "zh-CHS": "这些MIB模块可用于监控打印机的电源和电源状态。EMAN框架考虑了打印机工作组中定义的标准。PWG可将其MIB与来自EMAN的MIB进行协调。PWG比EMAN更详细地涵盖了许多主题，包括特定于成像设备的主题。PWG还提供特定于供应商的扩展状态（超出标准DMTF CIM状态）。"
    },
    {
      "indent": 3,
      "text": "The IETF Printer MIB [RFC3805] is on the Standards Track, but that MIB module does not address power management.",
      "zh-CHS": "IETF打印机MIB[RFC3805]在标准轨道上，但该MIB模块不解决电源管理问题。"
    },
    {
      "indent": 0,
      "text": "4.1.6. ASHRAE",
      "section_title": true,
      "zh-CHS": "4.1.6. 阿什雷"
    },
    {
      "indent": 3,
      "text": "In the U.S., there is an extensive effort to coordinate and develop standards related to the \"Smart Grid\". The Smart Grid Interoperability Panel, coordinated by the government's National Institute of Standards and Technology, identified the need for a building side information model (as a counterpart to utility models) and specified this in Priority Action Plan (PAP) 17. This was designated to be a joint effort by the American Society of Heating, Refrigerating and Air-Conditioning Engineers (ASHRAE) and the National Electrical Manufacturers Association (NEMA), both ANSI-approved Standards Development Organizations (SDOs). The result is to be an information model, not a protocol.",
      "zh-CHS": "在美国，有大量的工作来协调和制定与“智能电网”相关的标准。由政府国家标准与技术研究所协调的智能电网互操作性小组确定了对建筑物侧信息模型（作为实用新型的对应物）的需求，并在优先行动计划（PAP）17中对此进行了规定。这是美国采暖、制冷和空调工程师协会（ASHRAE）和美国国家电气制造商协会（NEMA）的共同努力，这两个组织都是ANSI批准的标准开发组织（SDO）。结果是形成了一个信息模型，而不是一个协议。"
    },
    {
      "indent": 3,
      "text": "The ASHRAE effort [ASHRAE] addresses data used only within a building as well as data that may be shared with the grid, particularly as it relates to coordinating future demand levels with the needs of the grid. The model is intended to be applied to any building type, both residential and commercial. It is expected that existing protocols will be adapted to comply with the new information model, as would new protocols.",
      "zh-CHS": "ASHRAE工作[ASHRAE]解决了仅在建筑物内使用的数据以及可能与电网共享的数据，特别是涉及协调未来需求水平与电网需求的数据。该模型适用于任何建筑类型，包括住宅和商业。预计现有的协议将与新的协议一样适应新的信息模型。"
    },
    {
      "indent": 3,
      "text": "There are four basic types of entities in the model: generators, loads, meters, and energy managers. The metering part of the model overlaps to a large degree with the EMAN framework, though there are features unique to each. The load part speaks to control capabilities well beyond what EMAN covers. Details of generation and of the energy management function are outside of EMAN scope.",
      "zh-CHS": "模型中有四种基本类型的实体：发电机、负荷、仪表和能源管理器。模型的计量部分在很大程度上与EMAN框架重叠，尽管每个框架都有其独特的功能。负载部分谈到的控制能力远远超出了EMAN的范围。发电和能源管理功能的详细信息不在EMAN范围内。"
    },
    {
      "indent": 3,
      "text": "A public review draft of the ASHRAE standard was released in July 2012. There are no apparent major conflicts between the two approaches, but there are areas where some harmonization is possible.",
      "zh-CHS": "ASHRAE标准的公共审查草案于2012年7月发布。这两种方法之间没有明显的重大冲突，但在某些领域可以进行某种协调。"
    },
    {
      "indent": 0,
      "text": "4.1.7. ANSI/CEA",
      "section_title": true,
      "zh-CHS": "4.1.7. ANSI/CEA"
    },
    {
      "indent": 3,
      "text": "The Consumer Electronics Association (CEA) has approved ANSI/CEA-2047 [ANSICEA] as a standard data model for Energy Usage Information. The primary purpose is to enable home appliances and electronics to communicate energy usage information over a wide range of technologies with pluggable modules that contain the physical-layer electronics. The standard can be used by devices operating on any home network including Wi-Fi, Ethernet, ZigBee, Z-Wave, and Bluetooth. The Introduction to ANSI/CEA-2047 states that \"this standard provides an information model for other groups to develop implementations specific to their network, protocol and needs.\" It covers device identification, current power level, cumulative energy consumption, and provides for reporting time-series data.",
      "zh-CHS": "消费电子协会（CEA）已批准ANSI/CEA-2047[ANSICEA]作为能源使用信息的标准数据模型。其主要目的是使家用电器和电子设备能够通过包含物理层电子设备的可插拔模块，通过广泛的技术交流能源使用信息。该标准可用于任何家庭网络上的设备，包括Wi-Fi、以太网、ZigBee、Z-Wave和蓝牙。ANSI/CEA-2047简介中指出，“本标准为其他团体提供了一个信息模型，以开发特定于其网络、协议和需求的实施方案。”它涵盖了设备标识、当前功率水平、累计能耗，并提供了报告时间序列数据的方法。"
    },
    {
      "indent": 0,
      "text": "4.1.8. ZigBee",
      "section_title": true,
      "zh-CHS": "4.1.8. 齐格比"
    },
    {
      "indent": 3,
      "text": "The ZigBee Smart Energy Profile 2.0 (SEP) effort [ZIGBEE] focuses on IP-based wireless communication to appliances and lighting. It is intended to enable internal building energy management and provide for bidirectional communication with the power grid.",
      "zh-CHS": "ZigBee智能能源配置文件2.0（SEP）工作[ZigBee]专注于基于IP的设备和照明无线通信。其目的是实现内部建筑能源管理，并提供与电网的双向通信。"
    },
    {
      "indent": 3,
      "text": "ZigBee protocols are intended for use in embedded applications with low data rates and low power consumption. ZigBee defines a general-purpose, inexpensive, self-organizing mesh network that can be used for industrial control, embedded sensing, medical data collection, smoke and intruder warning, building automation, home automation, etc.",
      "zh-CHS": "ZigBee协议适用于低数据速率和低功耗的嵌入式应用。ZigBee定义了一种通用、廉价、自组织的网状网络，可用于工业控制、嵌入式传感、医疗数据采集、烟雾和入侵者报警、楼宇自动化、家庭自动化等。"
    },
    {
      "indent": 3,
      "text": "ZigBee is currently not an ANSI-recognized SDO.",
      "zh-CHS": "ZigBee目前不是ANSI认可的SDO。"
    },
    {
      "indent": 3,
      "text": "The EMAN framework addresses the needs of IP-enabled networks through the usage of SNMP, while ZigBee provides for completely integrated and inexpensive mesh solutions.",
      "zh-CHS": "EMAN框架通过使用SNMP满足了IP网络的需求，而ZigBee提供了完全集成且价格低廉的网状解决方案。"
    },
    {
      "indent": 0,
      "text": "4.2. Measurement",
      "section_title": true,
      "zh-CHS": "4.2. 测量"
    },
    {
      "indent": 0,
      "text": "4.2.1. ANSI C12",
      "section_title": true,
      "zh-CHS": "4.2.1. ANSI C12"
    },
    {
      "indent": 3,
      "text": "The American National Standards Institute (ANSI) has defined a collection of power meter standards under ANSI C12. The primary standards include communication protocols (C12.18, 21 and 22), data and schema definitions (C12.19), and measurement accuracy (C12.20). European equivalent standards are provided by IEC 62053-22.",
      "zh-CHS": "美国国家标准协会（ANSI）根据ANSI C12定义了一系列功率计标准。主要标准包括通信协议（C12.18、21和22）、数据和模式定义（C12.19）以及测量精度（C12.20）。IEC 62053-22提供了欧洲等效标准。"
    },
    {
      "indent": 3,
      "text": "These very specific standards are oriented to the meter itself and are used by electricity distributors and producers.",
      "zh-CHS": "这些非常具体的标准针对电表本身，供电力分销商和生产商使用。"
    },
    {
      "indent": 3,
      "text": "The EMAN framework [RFC7326] references the Accuracy Classes specified in ANSI C12.20.",
      "zh-CHS": "EMAN框架[RFC7326]参考了ANSI C12.20中规定的精度等级。"
    },
    {
      "indent": 0,
      "text": "4.2.2. IEC 62301",
      "section_title": true,
      "zh-CHS": "4.2.2. IEC 62301"
    },
    {
      "indent": 3,
      "text": "IEC 62301, \"Household electrical appliances - Measurement of standby power\" [IEC62301], specifies a power-level measurement procedure. While nominally for appliances and low-power modes, its concepts apply to other device types and modes, and it is commonly referenced in test procedures for energy using products.",
      "zh-CHS": "IEC 62301，“家用电器-备用功率的测量”[IEC62301]规定了功率级测量程序。虽然名义上适用于电器和低功率模式，但其概念适用于其他设备类型和模式，并且通常在能源使用产品的测试程序中引用。"
    },
    {
      "indent": 3,
      "text": "While the standard is intended for laboratory measurements of devices in controlled conditions, aspects of it are informative to those implementing measurement in products that ultimately report via EMAN.",
      "zh-CHS": "虽然本标准旨在对受控条件下的设备进行实验室测量，但其各方面对最终通过EMAN报告的产品中实施测量的人员具有参考价值。"
    },
    {
      "indent": 0,
      "text": "4.3. Other",
      "section_title": true,
      "zh-CHS": "4.3. 另外"
    },
    {
      "indent": 0,
      "text": "4.3.1. ISO",
      "section_title": true,
      "zh-CHS": "4.3.1. 国际标准化组织"
    },
    {
      "indent": 3,
      "text": "The International Organization for Standardization (ISO) [ISO] is developing an energy management standard, ISO 50001, to complement ISO 9001 for quality management and ISO 14001 for environmental management. The intent is to facilitate the creation of energy management programs for industrial, commercial, and other entities. The standard defines a process for energy management at an organizational level. It does not define the way in which devices report energy and consume energy.",
      "zh-CHS": "国际标准化组织（ISO）[ISO]正在制定能源管理标准ISO 50001，以补充ISO 9001质量管理和ISO 14001环境管理。其目的是促进为工业、商业和其他实体创建能源管理计划。该标准定义了组织层面的能源管理流程。它没有定义设备报告能量和消耗能量的方式。"
    },
    {
      "indent": 3,
      "text": "ISO 50001 is based on the common elements found in all of ISO's management system standards, assuring a high level of compatibility with ISO 9001 and ISO 14001. ISO 50001 benefits include:",
      "zh-CHS": "ISO 50001基于所有ISO管理体系标准中的通用元素，确保与ISO 9001和ISO 14001高度兼容。ISO 50001的好处包括："
    },
    {
      "indent": 6,
      "text": "o Integrating energy efficiency into management practices and throughout the supply chain.",
      "zh-CHS": "o 将能源效率整合到管理实践和整个供应链中。"
    },
    {
      "indent": 6,
      "text": "o Using energy management best practices and good energy management behaviors.",
      "zh-CHS": "o 使用能源管理最佳实践和良好的能源管理行为。"
    },
    {
      "indent": 6,
      "text": "o Benchmarking, measuring, documenting, and reporting energy intensity improvements and their projected impact on reductions in greenhouse gas (GHG) emissions.",
      "zh-CHS": "o 对标、测量、记录和报告能源强度改进及其对温室气体（GHG）排放量减少的预期影响。"
    },
    {
      "indent": 6,
      "text": "o Evaluating and prioritizing the implementation of new energy-efficient technologies.",
      "zh-CHS": "o 评估并优先考虑新节能技术的实施。"
    },
    {
      "indent": 3,
      "text": "ISO 50001 has been developed by ISO project committee ISO TC 242, Energy Management. EMAN is complementary to ISO 9001.",
      "zh-CHS": "ISO 50001由ISO项目委员会ISO TC 242能源管理部制定。EMAN是对ISO 9001的补充。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Energy Star",
      "section_title": true,
      "zh-CHS": "4.3.2. 能源之星"
    },
    {
      "indent": 3,
      "text": "The U.S. Environmental Protection Agency (EPA) and U.S. Department of Energy (DOE) jointly sponsor the Energy Star program [ESTAR]. The program promotes the development of energy efficient products and practices.",
      "zh-CHS": "美国环境保护署（EPA）和美国能源部（DOE）共同赞助能源之星计划[ESTAR]。该计划促进节能产品和实践的开发。"
    },
    {
      "indent": 3,
      "text": "To qualify as Energy Star, products must meet specific energy efficiency targets. The Energy Star program also provides planning tools and technical documentation to encourage more energy-efficient building design. Energy Star is a program; it is not a protocol or standard.",
      "zh-CHS": "要获得能源之星的资格，产品必须达到特定的能源效率目标。能源之星计划还提供规划工具和技术文件，以鼓励更节能的建筑设计。能源之星是一个项目；它不是一个协议或标准。"
    },
    {
      "indent": 3,
      "text": "For businesses and data centers, Energy Star offers technical support to help companies establish energy conservation practices. Energy Star provides best practices for measuring current energy performance, goal setting, and tracking improvement. The Energy Star tools offered include a rating system for building performance and comparative benchmarks.",
      "zh-CHS": "对于企业和数据中心，能源之星提供技术支持，帮助企业建立节能实践。能源之星提供了衡量当前能源绩效、目标设定和跟踪改进的最佳实践。能源之星提供的工具包括建筑性能评级系统和比较基准。"
    },
    {
      "indent": 3,
      "text": "There is no immediate link between EMAN and Energy Star, one being a protocol and the other a set of recommendations to develop energy-efficient products. However, Energy Star could include EMAN standards in specifications for future products, either as required or rewarded with some benefit.",
      "zh-CHS": "EMAN和Energy Star之间没有直接的联系，一个是协议，另一个是开发节能产品的一系列建议。然而，能源之星可以在未来产品的规范中纳入EMAN标准，无论是根据需要还是获得一些好处。"
    },
    {
      "indent": 0,
      "text": "4.3.3. Smart Grid",
      "section_title": true,
      "zh-CHS": "4.3.3. 智能电网"
    },
    {
      "indent": 3,
      "text": "The Smart Grid standards efforts underway in the United States are overseen by the U.S. National Institute of Standards and Technology [NIST]. NIST is responsible for coordinating a public-private partnership with key energy and consumer stakeholders in order to facilitate the development of Smart Grid standards. These activities are monitored and facilitated by the Smart Grid Interoperability Panel (SGIP). This group has working groups for specific topics",
      "zh-CHS": "美国正在进行的智能电网标准工作由美国国家标准与技术研究所（NIST）监督。NIST负责与关键能源和消费者利益相关者协调公私合作关系，以促进智能电网标准的制定。这些活动由智能电网互操作性小组（SGIP）监控和促进。该小组有专门的专题工作组"
    },
    {
      "indent": 3,
      "text": "including homes, commercial buildings, and industrial facilities as they relate to the grid. A stated goal of the group is to harmonize any new standard with the IEC CIM and IEC 61850.",
      "zh-CHS": "包括与电网相关的住宅、商业建筑和工业设施。该小组的既定目标是使任何新标准与IEC CIM和IEC 61850相协调。"
    },
    {
      "indent": 3,
      "text": "When a working group detects a standard or technology gap, the team seeks approval from the SGIP for the creation of a Priority Action Plan (PAP), a private-public partnership to close the gap. PAP 17 is discussed in Section 4.1.6.",
      "zh-CHS": "当工作组检测到标准或技术差距时，团队寻求SGIP的批准，以制定优先行动计划（PAP），这是一种公私合作关系，旨在缩小差距。第4.1.6节讨论了PAP 17。"
    },
    {
      "indent": 3,
      "text": "PAP 10 addresses \"Standard Energy Usage Information\". Smart Grid standards will provide distributed intelligence in the network and allow enhanced load shedding. For example, pricing signals will enable selective shutdown of non-critical activities during peak price periods. Actions can be effected through both centralized and distributed management controls.",
      "zh-CHS": "PAP 10涉及“标准能源使用信息”。智能电网标准将在网络中提供分布式智能，并允许增强减载。例如，定价信号将使非关键活动在价格高峰期间选择性关闭。可以通过集中式和分布式管理控制实现操作。"
    },
    {
      "indent": 3,
      "text": "There is an obvious functional link between Smart Grid and EMAN in the form of demand response even though the EMAN framework itself does not address any coordination with the grid. As EMAN enables control, it can be used by an EnMS to accomplish demand response through translation of a signal from an outside entity.",
      "zh-CHS": "智能电网和EMAN之间存在着需求响应形式的明显功能联系，尽管EMAN框架本身并未涉及与电网的任何协调。由于EMAN实现了控制，因此EnMS可以通过转换来自外部实体的信号来完成需求响应。"
    },
    {
      "indent": 0,
      "text": "5. Limitations",
      "section_title": true,
      "zh-CHS": "5. 局限性"
    },
    {
      "indent": 3,
      "text": "EMAN addresses the needs of energy monitoring in terms of measurement and considers limited control capabilities of energy monitoring of networks.",
      "zh-CHS": "EMAN在测量方面满足了能源监测的需求，并考虑了网络能源监测的有限控制能力。"
    },
    {
      "indent": 3,
      "text": "EMAN does not create a new protocol stack, but rather defines a data and information model useful for measuring and reporting energy and other metrics over SNMP.",
      "zh-CHS": "EMAN并没有创建新的协议栈，而是定义了一个数据和信息模型，用于通过SNMP测量和报告能量和其他指标。"
    },
    {
      "indent": 3,
      "text": "EMAN does not address questions regarding Smart Grid, electricity producers, and distributors.",
      "zh-CHS": "EMAN没有解决有关智能电网、发电商和分销商的问题。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "EMAN uses SNMP and thus has the functionality of SNMP's security capabilities. SNMPv3 [RFC3411] provides important security features such as confidentiality, integrity, and authentication.",
      "zh-CHS": "EMAN使用SNMP，因此具有SNMP安全功能的功能。SNMPv3[RFC3411]提供重要的安全特性，如机密性、完整性和身份验证。"
    },
    {
      "indent": 3,
      "text": "Section 10 of [RFC7460] and Section 6 of [RFC7461] mention that power monitoring and management MIBs may have certain privacy implications. These privacy implications are beyond the scope of this document. There may be additional privacy considerations specific to each use case; this document has not attempted to analyze these.",
      "zh-CHS": "[RFC7460]的第10节和[RFC7461]的第6节提到电源监控和管理MIB可能具有某些隐私影响。这些隐私影响超出了本文档的范围。每个用例可能有额外的隐私注意事项；本文档未尝试分析这些问题。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, DOI 10.17487/RFC3411, December 2002, <http://www.rfc-editor.org/info/rfc3411>.",
      "zh-CHS": "[RFC3411]Harrington，D.，Presohn，R.，和B.Wijnen，“描述简单网络管理协议（SNMP）管理框架的体系结构”，STD 62，RFC 3411，DOI 10.17487/RFC34112002年12月<http://www.rfc-editor.org/info/rfc3411>."
    },
    {
      "indent": 3,
      "text": "[RFC3621] Berger, A. and D. Romascanu, \"Power Ethernet MIB\", RFC 3621, DOI 10.17487/RFC3621, December 2003, <http://www.rfc-editor.org/info/rfc3621>.",
      "zh-CHS": "[RFC3621]Berger，A.和D.Romascanu，“电力以太网MIB”，RFC 3621，DOI 10.17487/RFC36212003年12月<http://www.rfc-editor.org/info/rfc3621>."
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[ACPI] ACPI, \"Advanced Configuration and Power Interface Specification\", Revision 5.0b, November 2013, <http://www.acpi.info/spec30b.htm>.",
      "zh-CHS": "[ACPI]ACPI，“高级配置和电源接口规范”，版本5.0b，2013年11月<http://www.acpi.info/spec30b.htm>."
    },
    {
      "indent": 3,
      "text": "[ANSICEA] ANSI, \"CEA 2047 CE Energy Usage Information (CE-EUI)\", ANSI/CEA-2047, August 2014.",
      "zh-CHS": "[ANSICEA]ANSI，“CEA 2047 CE能源使用信息（CE-EUI）”，ANSI/CEA-2047，2014年8月。"
    },
    {
      "indent": 3,
      "text": "[ASHRAE] NIST, \"ASHRAE SPC 201 P Information Page\", <http://collaborate.nist.gov/twiki-sggrid/ bin/view/SmartGrid/PAP17Information>.",
      "zh-CHS": "[ASHRAE]NIST，“ASHRAE SPC 201 P信息页”<http://collaborate.nist.gov/twiki-sggrid/ bin/view/SmartGrid/pap17信息>。"
    },
    {
      "indent": 3,
      "text": "[BACnet] \"BACnet Webpage\", <http://www.bacnet.org>.",
      "zh-CHS": "[BACnet]“BACnet网页”<http://www.bacnet.org>."
    },
    {
      "indent": 3,
      "text": "[DASH] DMTF, \"Desktop and Mobile Architecture for System Hardware\", <http://www.dmtf.org/standards/mgmt/dash/>.",
      "zh-CHS": "[DASH]DMTF，“系统硬件的桌面和移动架构”<http://www.dmtf.org/standards/mgmt/dash/>."
    },
    {
      "indent": 3,
      "text": "[DMTF-DSP0004] DMTF, \"Common Information Model (CIM) Infrastructure\", DSP0004, Version 2.5.0, May 2009, <http://www.dmtf.org/ standards/published_documents/DSP0004_2.5.0.pdf>.",
      "zh-CHS": "[DMTF-DSP0004]DMTF，“公共信息模型（CIM）基础设施”，DSP0004，版本2.5.0，2009年5月<http://www.dmtf.org/ 标准/已发布文件/DSP0004\\U 2.5.0.pdf>。"
    },
    {
      "indent": 3,
      "text": "[DMTF-DSP1027] DMTF, \"Power State Management Profile\", DSP1027, Version 2.0.0, December 2009, <http://www.dmtf.org/standards/ published_documents/DSP1027_2.0.0.pdf>.",
      "zh-CHS": "[DMTF-DSP1027]DMTF，“电源状态管理配置文件”，DSP1027，版本2.0.0，2009年12月<http://www.dmtf.org/standards/ 已发布的文档/DSP1027\\U 2.0.0.pdf>。"
    },
    {
      "indent": 3,
      "text": "[Ecma-SDC] Ecma International, \"Smart Data Centre Resource Monitoring and Control\", Standard ECMA-400, Second Edition, June 2013, <http://www.ecma-international.org/ publications/standards/Ecma-400.htm>.",
      "zh-CHS": "[Ecma SDC]Ecma国际，“智能数据中心资源监控”，标准Ecma-400，第二版，2013年6月<http://www.ecma-international.org/ 出版物/标准/Ecma-400.htm>。"
    },
    {
      "indent": 3,
      "text": "[ESTAR] Energy Star, <http://www.energystar.gov/>.",
      "zh-CHS": "[ESTAR]能源之星<http://www.energystar.gov/>."
    },
    {
      "indent": 3,
      "text": "[IEC62301] IEC, \"Household electrical appliances - Measurement of standby power\", IEC 62301:2011, Edition 2.0, January 2011.",
      "zh-CHS": "[IEC62301]IEC，“家用电器-备用功率的测量”，IEC 62301:2011，第2.0版，2011年1月。"
    },
    {
      "indent": 3,
      "text": "[ISO] ISO, \"ISO launches ISO 50001 energy management standard\", June 2011, <http://www.iso.org/iso/news.htm?refid=Ref1434>.",
      "zh-CHS": "[ISO]ISO，“ISO发布ISO 50001能源管理标准”，2011年6月<http://www.iso.org/iso/news.htm?refid=Ref1434>."
    },
    {
      "indent": 3,
      "text": "[MODBUS] Modbus-IDA, \"MODBUS Application Protocol Specification\", Version 1.1b, December 2006, <http://www.modbus.org/docs/ Modbus_Application_Protocol_V1_1b.pdf>.",
      "zh-CHS": "[MODBUS]MODBUS IDA，“MODBUS应用协议规范”，版本1.1b，2006年12月<http://www.modbus.org/docs/ Modbus应用程序协议V1\\u 1b.pdf>。"
    },
    {
      "indent": 3,
      "text": "[NIST] NIST, \"Smart Grid Homepage\", August 2010, <http://www.nist.gov/smartgrid/>.",
      "zh-CHS": "[NIST]NIST，“智能电网主页”，2010年8月<http://www.nist.gov/smartgrid/>."
    },
    {
      "indent": 3,
      "text": "[PWG5106.4] IEEE-ISTO, \"PWG Power Management Model for Imaging Systems 1.0\", PWG Candidate Standard 5106.4-2011, February 2011, <ftp://ftp.pwg.org/pub/pwg/candidates/ cs-wimspower10-20110214-5106.4.pdf>.",
      "zh-CHS": "[PWG5106.4]IEEE-ISTO，“成像系统1.0的PWG电源管理模型”，PWG候选标准5106.4-2011，2011年2月<ftp://ftp.pwg.org/pub/pwg/candidates/ cs-wimspower10-20110214-5106.4.pdf>。"
    },
    {
      "indent": 3,
      "text": "[PWG5106.5] IEEE-ISTO, \"PWG Imaging System Power MIB v1.0\", PWG Candidate Standard 5106.5-2011, February 2011.",
      "zh-CHS": "[PWG5106.5]IEEE-ISTO，“PWG成像系统电源MIB v1.0”，PWG候选标准5106.5-2011，2011年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3805] Bergman, R., Lewis, H., and I. McDonald, \"Printer MIB v2\", RFC 3805, DOI 10.17487/RFC3805, June 2004, <http://www.rfc-editor.org/info/rfc3805>.",
      "zh-CHS": "[RFC3805]伯格曼，R.，刘易斯，H.和I.麦克唐纳，“打印机MIB v2”，RFC 3805，DOI 10.17487/RFC3805，2004年6月<http://www.rfc-editor.org/info/rfc3805>."
    },
    {
      "indent": 3,
      "text": "[RFC6933] Bierman, A., Romascanu, D., Quittek, J., and M. Chandramouli, \"Entity MIB (Version 4)\", RFC 6933, DOI 10.17487/RFC6933, May 2013, <http://www.rfc-editor.org/info/rfc6933>.",
      "zh-CHS": "[RFC6933]Bierman，A.，Romascanu，D.，Quittek，J.，和M.Chandramouli，“实体MIB（版本4）”，RFC 6933，DOI 10.17487/RFC6933，2013年5月<http://www.rfc-editor.org/info/rfc6933>."
    },
    {
      "indent": 3,
      "text": "[RFC6988] Quittek, J., Ed., Chandramouli, M., Winter, R., Dietz, T., and B. Claise, \"Requirements for Energy Management\", RFC 6988, DOI 10.17487/RFC6988, September 2013, <http://www.rfc-editor.org/info/rfc6988>.",
      "zh-CHS": "[RFC6988]Quitek，J.，Ed.，Chandramouli，M.，Winter，R.，Dietz，T.，和B.Claise，“能源管理要求”，RFC 6988，DOI 10.17487/RFC6988，2013年9月<http://www.rfc-editor.org/info/rfc6988>."
    },
    {
      "indent": 3,
      "text": "[RFC7326] Parello, J., Claise, B., Schoening, B., and J. Quittek, \"Energy Management Framework\", RFC 7326, DOI 10.17487/RFC7326, September 2014, <http://www.rfc-editor.org/info/rfc7326>.",
      "zh-CHS": "[RFC7326]Parello，J.，Claise，B.，Schoining，B.，和J.Quitek，“能源管理框架”，RFC 7326，DOI 10.17487/RFC7326，2014年9月<http://www.rfc-editor.org/info/rfc7326>."
    },
    {
      "indent": 3,
      "text": "[RFC7460] Chandramouli, M., Claise, B., Schoening, B., Quittek, J., and T. Dietz, \"Monitoring and Control MIB for Power and Energy\", RFC 7460, DOI 10.17487/RFC7460, March 2015, <http://www.rfc-editor.org/info/rfc7460>.",
      "zh-CHS": "[RFC7460]Chandramouli，M.，Claise，B.，Schoining，B.，Quitek，J.，和T.Dietz，“电力和能源的监控MIB”，RFC 7460，DOI 10.17487/RFC7460，2015年3月<http://www.rfc-editor.org/info/rfc7460>."
    },
    {
      "indent": 3,
      "text": "[RFC7461] Parello, J., Claise, B., and M. Chandramouli, \"Energy Object Context MIB\", RFC 7461, DOI 10.17487/RFC7461, March 2015, <http://www.rfc-editor.org/info/rfc7461>.",
      "zh-CHS": "[RFC7461]Parello，J.，Claise，B.，和M.Chandramouli，“能源对象上下文MIB”，RFC 7461，DOI 10.17487/RFC7461，2015年3月<http://www.rfc-editor.org/info/rfc7461>."
    },
    {
      "indent": 3,
      "text": "[RFC7577] Quittek, J., Winter, R., and T. Dietz, \"Definition of Managed Objects for Battery Monitoring\", RFC 7577, DOI 10.17487/RFC7577, July 2015, <http://www.rfc-editor.org/info/rfc7577>.",
      "zh-CHS": "[RFC7577]Quittek，J.，Winter，R.，和T.Dietz，“电池监控管理对象的定义”，RFC 7577，DOI 10.17487/RFC7577，2015年7月<http://www.rfc-editor.org/info/rfc7577>."
    },
    {
      "indent": 3,
      "text": "[ZIGBEE] \"The ZigBee Alliance\", <http://www.zigbee.org/>.",
      "zh-CHS": "[ZIGBEE]“ZIGBEE联盟”<http://www.zigbee.org/>."
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "Firstly, the authors thank Emmanuel Tychon for taking the lead on the initial draft and making substantial contributions to it. The authors also thank Jeff Wheeler, Benoit Claise, Juergen Quittek, Chris Verges, John Parello, and Matt Laherty for their valuable contributions. The authors also thank Kerry Lynn for the use case involving demand response.",
      "zh-CHS": "首先，作者感谢Emmanuel Tychon带头起草初稿，并为初稿做出了重大贡献。作者还感谢杰夫·惠勒、贝诺特·克莱斯、尤尔根·奎特克、克里斯·维格斯、约翰·帕雷罗和马特·拉赫蒂的宝贵贡献。作者还感谢Kerry Lynn提供的涉及需求响应的用例。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Brad Schoening Independent Consultant 44 Rivers Edge Drive Little Silver, NJ 07739 United States",
      "zh-CHS": "Brad Schoening独立顾问44 Rivers Edge Drive Little Silver，NJ 07739美国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 917 304 7190\nEmail: brad.schoening@verizon.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mouli Chandramouli Cisco Systems, Inc. Sarjapur Outer Ring Road Bangalore 560103 India",
      "zh-CHS": "Mouli Chandramouli Cisco Systems，Inc.印度班加罗尔Sarjapur外环路560103"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 4429 2409\nEmail: moulchan@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Bruce Nordman Lawrence Berkeley National Laboratory 1 Cyclotron Road, 90-2000 Berkeley, CA 94720-8130 United States",
      "zh-CHS": "Bruce Nordman Lawrence Berkeley国家实验室1号回旋加速器路，90-2000伯克利，加利福尼亚州94720-8130"
    },
    {
      "indent": 3,
      "text": "Phone: +1 510 486 7089\nEmail: bnordman@lbl.gov",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}