{
  "title": {
    "text": "RFC 7760: Statement of Work for Extensions to the IETF Datatracker for Author Statistics",
    "zh-CHS": "RFC 7760"
  },
  "number": 7760,
  "created_at": "2021-10-31 18:54:11.719513+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        R. Housley\nRequest for Comments: 7760                                Vigil Security\nCategory: Informational                                     January 2016\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Statement of Work for Extensions to the IETF Datatracker for Author Statistics",
      "zh-CHS": "作者统计IETF数据跟踪器扩展工作说明"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This is the Statement of Work (SOW) for extensions to the IETF Datatracker to provide statistics about RFCs and Internet-Drafts and their authors.",
      "zh-CHS": "这是IETF数据跟踪器扩展的工作说明书（SOW），用于提供有关RFC和Internet草稿及其作者的统计信息。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7760.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7760."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Purpose  . . . . . . . . . . . . . . . . . . . . . . . . . . .  2\n3.  Statistics . . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  3.1.  Documents  . . . . . . . . . . . . . . . . . . . . . . . .  3\n  3.2.  Authors  . . . . . . . . . . . . . . . . . . . . . . . . .  4\n  3.3.  Affiliation of Authors . . . . . . . . . . . . . . . . . .  4\n  3.4.  Countries of Authors . . . . . . . . . . . . . . . . . . .  5\n  3.5.  Continents of Authors  . . . . . . . . . . . . . . . . . .  5\n4.  IETF Meeting Attendees . . . . . . . . . . . . . . . . . . . .  6\n  4.1.  Countries of IETF Meeting Attendees  . . . . . . . . . . .  6\n  4.2.  Continents of IETF Meeting Attendees . . . . . . . . . . .  6\n5.  Existing Code  . . . . . . . . . . . . . . . . . . . . . . . .  6\n6.  Deployment . . . . . . . . . . . . . . . . . . . . . . . . . .  7\n7.  Thoughts on Future Enhancements  . . . . . . . . . . . . . . .  7\n8.  Security Considerations  . . . . . . . . . . . . . . . . . . .  8\n9.  Informative References   . . . . . . . . . . . . . . . . . . .  8\nAuthor's Address . . . . . . . . . . . . . . . . . . . . . . . . .  8",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "A prominent member of the IETF community has developed a set of tools to produce statistics about the authors of RFCs and Internet-Drafts. These tools analyze the documents themselves to produce statistics about the documents and their authors. The goal of the IETF Datatracker enhancements described in this document is to provide similar statistics and ensure that the software is maintained as part of the IETF information services. While some data may still need to be extracted from the documents themselves, as much data as possible should be maintained in the IETF Datatracker database [DATATRACKER].",
      "zh-CHS": "IETF社区的一位著名成员开发了一套工具，用于统计RFC和互联网草稿的作者。这些工具分析文档本身，以生成有关文档及其作者的统计信息。本文档中描述的IETF数据跟踪器增强的目标是提供类似的统计数据，并确保软件作为IETF信息服务的一部分进行维护。虽然一些数据可能仍需要从文档本身提取，但应在IETF Datatracker数据库[Datatracker]中维护尽可能多的数据。"
    },
    {
      "indent": 3,
      "text": "Current statistics are available on the web at http://www.arkko.com/tools/docstats.html.",
      "zh-CHS": "目前的统计数据可在以下网址获得：http://www.arkko.com/tools/docstats.html."
    },
    {
      "indent": 3,
      "text": "The code that is used to produce these statistics is available at http://www.arkko.com/tools/authorstats.html.",
      "zh-CHS": "用于生成这些统计信息的代码位于http://www.arkko.com/tools/authorstats.html."
    },
    {
      "indent": 0,
      "text": "2. Purpose",
      "section_title": true,
      "zh-CHS": "2. 意图"
    },
    {
      "indent": 3,
      "text": "Author statistics allow the community to understand where work is being done and by whom. The statistics make it visible which individuals, companies, and geographic regions are the most active contributors. The statistics also show how these are changing over the years.",
      "zh-CHS": "作者统计数据让社区了解工作在哪里，由谁完成。统计数据表明哪些个人、公司和地理区域是最积极的贡献者。统计数据还显示了这些年来的变化。"
    },
    {
      "indent": 3,
      "text": "Some of the statistics provide \"nice to know\" information; however, others are sometimes used to refer to a particular participant's contributions in the IETF or used to study trends within IETF work. For instance, the IETF has been trying to increase the diversity of participants, and the statistics are one way to see the impact of those efforts. Also, the most active individuals are potential candidates for various leadership positions.",
      "zh-CHS": "一些统计数据提供了“很好知道”的信息；然而，其他人有时用来指IETF中特定参与者的贡献，或用来研究IETF工作中的趋势。例如，IETF一直在努力增加参与者的多样性，统计数据是了解这些努力影响的一种方式。此外，最活跃的个人是各种领导职位的潜在候选人。"
    },
    {
      "indent": 0,
      "text": "3. Statistics",
      "section_title": true,
      "zh-CHS": "3. 统计数字"
    },
    {
      "indent": 3,
      "text": "The enhancements to the IETF Datatracker shall provide statistics and graphs about documents, document authors, author affiliation, author country, and author continent.",
      "zh-CHS": "IETF数据跟踪器的增强功能应提供有关文件、文件作者、作者隶属关系、作者国家和作者大陆的统计数据和图表。"
    },
    {
      "indent": 3,
      "text": "The statistics should also include trends relating to IETF meeting attendees, which the current tools do not track.",
      "zh-CHS": "统计数据还应包括与IETF会议与会者相关的趋势，而当前工具无法跟踪这些趋势。"
    },
    {
      "indent": 3,
      "text": "For the purposes of these requirements, \"recent Internet-Drafts\" and \"recent RFCs\" cover documents that have been published in the last five years.",
      "zh-CHS": "出于这些要求的目的，“最近的互联网草案”和“最近的RFC”包括过去五年中发布的文件。"
    },
    {
      "indent": 0,
      "text": "3.1. Documents",
      "section_title": true,
      "zh-CHS": "3.1. 文件"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into the number of authors per document. The current web page presents the statistics and a bar chart. The current web page can be seen at http://www.arkko.com/tools/rfcstats/authdistr.html.",
      "zh-CHS": "统计数据应提供每个文件的作者数量。当前网页显示统计数据和条形图。可在以下位置查看当前网页：http://www.arkko.com/tools/rfcstats/authdistr.html."
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into the size of the documents. The current web page presents the statistics and a bar chart. The current web page can be seen at http://www.arkko.com/tools/allstats/pagedistr.html. With the planned change in document format, some other way to measure document size might be more appropriate, such as word count.",
      "zh-CHS": "统计数据应提供对文件大小的深入了解。当前网页显示统计数据和条形图。可在以下位置查看当前网页：http://www.arkko.com/tools/allstats/pagedistr.html. 随着文档格式的计划更改，其他一些度量文档大小的方法可能更合适，例如字数。"
    },
    {
      "indent": 3,
      "text": "Additionally, statistics about the document format that was used by the authors should be provided, which is not provided by the current tools.",
      "zh-CHS": "此外，还应提供关于作者使用的文档格式的统计信息，而当前工具并未提供这些信息。"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into the use of various specification techniques such as ABNF, ASN.1, C code, CBOR, JSON, and XML. The current web page does not include all of these techniques. The current web page can be seen at http://www.arkko.com/tools/allstats/formatdistr.html.",
      "zh-CHS": "统计数据应提供对各种规范技术使用的深入了解，如ABNF、ASN.1、C代码、CBOR、JSON和XML。当前网页不包括所有这些技术。可在以下位置查看当前网页：http://www.arkko.com/tools/allstats/formatdistr.html."
    },
    {
      "indent": 0,
      "text": "3.2. Authors",
      "section_title": true,
      "zh-CHS": "3.2. 作者"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into the distribution of authors according to the number of documents they have authored for recent Internet-Drafts, recent RFCs, and all RFCs. The current web pages that provide similar information include the statistics and a bar chart. The web pages are available at http://www.arkko.com/tools/stats/authactdistr.html, http://www.arkko.com/tools/recrfcstats/authactdistr.html, and http://www.arkko.com/tools/rfcstats/authactdistr.html.",
      "zh-CHS": "统计数据应根据作者为最近的互联网草稿、最近的RFC和所有RFC编写的文件数量，深入了解作者的分布情况。当前提供类似信息的网页包括统计数据和条形图。网页可于http://www.arkko.com/tools/stats/authactdistr.html, http://www.arkko.com/tools/recrfcstats/authactdistr.html和http://www.arkko.com/tools/rfcstats/authactdistr.html."
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into the relative impact of authors by the number of their RFCs that are cited by other RFCs. The current web page can be seen at http://www.arkko.com/tools/rfcstats/hindextop.html.",
      "zh-CHS": "统计数据应提供作者被其他RFC引用的RFC数量的相对影响。可在以下位置查看当前网页：http://www.arkko.com/tools/rfcstats/hindextop.html."
    },
    {
      "indent": 0,
      "text": "3.3. Affiliation of Authors",
      "section_title": true,
      "zh-CHS": "3.3. 作者的归属"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into the affiliation of authors for recent Internet-Drafts, recent RFCs, and all RFCs. The current web pages that provide similar information include the statistics and a bar chart. The web pages are available at http://www.arkko.com/tools/allstats/companies.html, http://www.arkko.com/tools/stats/companydistr.html, http://www.arkko.com/tools/recrfcstats/companydistr.html, and http://www.arkko.com/tools/rfcstats/companydistr.html.",
      "zh-CHS": "统计数据应提供对近期互联网草稿、近期RFC和所有RFC作者关系的深入了解。当前提供类似信息的网页包括统计数据和条形图。网页可于http://www.arkko.com/tools/allstats/companies.html, http://www.arkko.com/tools/stats/companydistr.html, http://www.arkko.com/tools/recrfcstats/companydistr.html和http://www.arkko.com/tools/rfcstats/companydistr.html."
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into the way that affiliations of RFC authors have changed over the years. The current web page can be seen at http://www.arkko.com/tools/rfcstats/companydistrhist.html.",
      "zh-CHS": "统计数据应提供对RFC作者所属关系多年来发生变化的方式的洞察。可在以下位置查看当前网页：http://www.arkko.com/tools/rfcstats/companydistrhist.html."
    },
    {
      "indent": 0,
      "text": "3.4. Countries of Authors",
      "section_title": true,
      "zh-CHS": "3.4. 作者国"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into countries of authors for recent Internet-Drafts, recent RFCs, and all RFCs. It has been useful to provide country-based statistics, and it has also been useful to provide statistics showing the European Union (EU) as a single \"country\" for the sake of comparison with other large countries. The current web pages that provide similar information include the statistics and a bar chart. The web pages are available at http://www.arkko.com/tools/rfcstats/countries.html, http://www.arkko.com/tools/stats/d-countrydistr.html, http://www.arkko.com/tools/stats/d-countryeudistr.html, http://www.arkko.com/tools/stats/countrydistr.html, http://www.arkko.com/tools/stats/countryeudistr.html, http://www.arkko.com/tools/recrfcstats/d-countrydistr.html, http://www.arkko.com/tools/recrfcstats/d-countryeudistr.html, http://www.arkko.com/tools/recrfcstats/countrydistr.html, http://www.arkko.com/tools/recrfcstats/countryeudistr.html, http://www.arkko.com/tools/rfcstats/d-countrydistr.html, http://www.arkko.com/tools/rfcstats/d-countryeudistr.html, http://www.arkko.com/tools/rfcstats/countrydistr.html, and http://www.arkko.com/tools/rfcstats/countryeudistr.html.",
      "zh-CHS": "统计数据应提供对最近互联网草稿、最近RFC和所有RFC作者国家的深入了解。提供以国家为基础的统计数据是有益的，而且提供统计数据表明欧洲联盟（欧盟）是一个单一的“国家”，以便与其他大国进行比较也是有益的。当前提供类似信息的网页包括统计数据和条形图。网页可于http://www.arkko.com/tools/rfcstats/countries.html, http://www.arkko.com/tools/stats/d-countrydistr.html, http://www.arkko.com/tools/stats/d-countryeudistr.html, http://www.arkko.com/tools/stats/countrydistr.html, http://www.arkko.com/tools/stats/countryeudistr.html, http://www.arkko.com/tools/recrfcstats/d-countrydistr.html, http://www.arkko.com/tools/recrfcstats/d-countryeudistr.html, http://www.arkko.com/tools/recrfcstats/countrydistr.html, http://www.arkko.com/tools/recrfcstats/countryeudistr.html, http://www.arkko.com/tools/rfcstats/d-countrydistr.html, http://www.arkko.com/tools/rfcstats/d-countryeudistr.html, http://www.arkko.com/tools/rfcstats/countrydistr.html和http://www.arkko.com/tools/rfcstats/countryeudistr.html."
    },
    {
      "indent": 3,
      "text": "The statistics shall illustrate the change in number of Internet-Draft and RFC authors per country over time. The current web page can be seen at http://www.arkko.com/tools/rfcstats/countrydistrhist.html.",
      "zh-CHS": "统计数据应说明每个国家互联网草稿和RFC作者数量随时间的变化。可在以下位置查看当前网页：http://www.arkko.com/tools/rfcstats/countrydistrhist.html."
    },
    {
      "indent": 0,
      "text": "3.5. Continents of Authors",
      "section_title": true,
      "zh-CHS": "3.5. 作家大洲"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into continents of authors for recent Internet-Drafts, recent RFCs, and all RFCs. The current web pages that provide similar information include the statistics and a bar chart. The web pages are available at http://www.arkko.com/tools/stats/d-contdistr.html, http://www.arkko.com/tools/recrfcstats/d-contdistr.html, and http://www.arkko.com/tools/rfcstats/d-contdistr.html.",
      "zh-CHS": "统计数据应提供对最近互联网草稿、最近RFC和所有RFC作者大陆的深入了解。当前提供类似信息的网页包括统计数据和条形图。网页可于http://www.arkko.com/tools/stats/d-contdistr.html, http://www.arkko.com/tools/recrfcstats/d-contdistr.html和http://www.arkko.com/tools/rfcstats/d-contdistr.html."
    },
    {
      "indent": 3,
      "text": "The statistics shall illustrate the change in number of Internet-Draft and RFC authors per continent over time. The current pages can be seen at http://www.arkko.com/tools/rfcstats/d-contdistrhist.html.",
      "zh-CHS": "统计数据应说明各大洲互联网草稿和RFC作者数量随时间的变化。当前页面可在以下位置查看：http://www.arkko.com/tools/rfcstats/d-contdistrhist.html."
    },
    {
      "indent": 0,
      "text": "4. IETF Meeting Attendees",
      "section_title": true,
      "zh-CHS": "4. IETF会议与会者"
    },
    {
      "indent": 3,
      "text": "The enhancements to the IETF Datatracker shall provide statistics and graphs about the country and continent of IETF meeting participants.",
      "zh-CHS": "IETF数据跟踪器的增强功能应提供IETF会议参与者所在国家和大陆的统计数据和图表。"
    },
    {
      "indent": 0,
      "text": "4.1. Countries of IETF Meeting Attendees",
      "section_title": true,
      "zh-CHS": "4.1. IETF会议与会者所在国家"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into countries represented by attendees at each IETF meeting. Country-based statistics have been presented in the plenary session for many years. For consistency with the author statistics discussed in Section 3 of this document, the statistics will include a way to show the EU as a single \"country\" for the sake of comparison with other large countries. The statistics for each meeting should be accompanied with a pie chart that shows the eight countries with the highest number of attendees and \"other\".",
      "zh-CHS": "统计数据应能深入了解IETF各次会议与会者所代表的国家。多年来，以国家为基础的统计数字一直在全体会议上提出。为了与本文件第3节中讨论的作者统计数据保持一致，统计数据将包括一种方式，表明欧盟是一个单一的“国家”，以便与其他大国进行比较。每次会议的统计数据应附有一个饼图，显示出席人数最多的八个国家和“其他国家”。"
    },
    {
      "indent": 3,
      "text": "The statistics shall illustrate the change in number of IETF meeting attendees per country over time. Again, for consistency with the author statistics discussed in Section 3 of this document, the statistics will include a way to show the EU as a single \"country\".",
      "zh-CHS": "统计数据应说明各国IETF会议出席人数随时间的变化。同样，为了与本文件第3节中讨论的作者统计数据保持一致，统计数据将包括显示欧盟作为单一“国家”的方式。"
    },
    {
      "indent": 0,
      "text": "4.2. Continents of IETF Meeting Attendees",
      "section_title": true,
      "zh-CHS": "4.2. 各大洲的IETF会议与会者"
    },
    {
      "indent": 3,
      "text": "The statistics shall provide insight into continents represented by attendees at each IETF meeting.",
      "zh-CHS": "统计数据应提供对各IETF会议与会者所代表大陆的深入了解。"
    },
    {
      "indent": 3,
      "text": "The statistics shall illustrate the change in number of IETF meeting attendees per continent over time.",
      "zh-CHS": "统计数据应说明各大洲IETF会议出席人数随时间的变化。"
    },
    {
      "indent": 0,
      "text": "5. Existing Code",
      "section_title": true,
      "zh-CHS": "5. 现行守则"
    },
    {
      "indent": 3,
      "text": "Since the new code will be driven by the Datatracker database to the greatest extent possible, the existing code may be of limited value. The existing code was intended as a temporary solution and requires a rewrite. However, a set of heuristics used by the code may be useful. These heuristics are provided in a separate rule database and are used as a last resort when there is otherwise too little information. The heuristics include author aliases, some recognized authors and some recognized affiliations, domain name data for determining location and affiliation, and mappings for some ways that people represent their countries in a post address.",
      "zh-CHS": "由于新代码将尽可能由Datatracker数据库驱动，因此现有代码的价值可能有限。现有代码旨在作为临时解决方案，需要重写。但是，代码使用的一组启发式可能很有用。这些启发式方法在一个单独的规则数据库中提供，并在信息太少时作为最后手段使用。启发式方法包括作者别名、一些公认的作者和一些公认的从属关系、用于确定位置和从属关系的域名数据，以及人们在邮寄地址中表示其国家的某些方式的映射。"
    },
    {
      "indent": 3,
      "text": "Authors are not consistent about the way their names appear in various documents. For example, one document may include their given name and another document may include a nickname. The Datatracker",
      "zh-CHS": "作者的名字在各种文件中出现的方式并不一致。例如，一个文档可能包含他们的名字，而另一个文档可能包含昵称。数据跟踪器"
    },
    {
      "indent": 3,
      "text": "database provides a way to capture aliases, but not all of the aliases in the documents have been added to the database.",
      "zh-CHS": "数据库提供了一种捕获别名的方法，但并非文档中的所有别名都已添加到数据库中。"
    },
    {
      "indent": 3,
      "text": "The current Datatracker database does not have tables for heuristics other than author aliases that are used in the current tool. Appropriate tables to hold the additional heuristics from the current rule database should be added to the Datatracker database in a manner agreed by the group of people that maintain the Datatracker source code.",
      "zh-CHS": "除当前工具中使用的作者别名外，当前Datatracker数据库没有用于启发式的表。应以维护Datatracker源代码的人员小组同意的方式，将用于保存当前规则数据库中附加启发的适当表添加到Datatracker数据库中。"
    },
    {
      "indent": 3,
      "text": "A workable web interface, possibly using Django Admin, to update the new heuristics tables shall be provided.",
      "zh-CHS": "应提供一个可行的web界面，可能使用Django Admin更新新的启发式表。"
    },
    {
      "indent": 3,
      "text": "The current code can be found at http://www.arkko.com/tools/authorstats.html and is openly available but without any warranty.",
      "zh-CHS": "可在以下位置找到当前代码：http://www.arkko.com/tools/authorstats.html 并公开提供，但不提供任何担保。"
    },
    {
      "indent": 3,
      "text": "The software is split in two parts, with the code itself being separate from the heuristics database. The two main components of the code are authorstats, which produces the statistics and generates the statistics web pages, and getauthors, which performs document analysis.",
      "zh-CHS": "软件分为两部分，代码本身与启发式数据库分离。代码的两个主要组件是authorstats（生成统计信息并生成统计信息网页）和getauthors（执行文档分析）。"
    },
    {
      "indent": 0,
      "text": "6. Deployment",
      "section_title": true,
      "zh-CHS": "6. 部署"
    },
    {
      "indent": 3,
      "text": "The current tools analyze the documents themselves to produce statistics. Some of the data needed to produce the statistics is not currently in the Datatracker database. This development effort will include adding the capability to capture this data in the Datatracker database and populate it for all RFCs and Internet-Drafts posted over the last five years. It may be cost-effective to leverage the existing code to extract the information and then verify it one time.",
      "zh-CHS": "当前的工具分析文档本身以生成统计数据。生成统计数据所需的一些数据当前不在Datatracker数据库中。这项开发工作将包括增加在Datatracker数据库中捕获这些数据的能力，并为过去五年发布的所有RFC和互联网草案填充这些数据。利用现有代码提取信息，然后进行一次验证，这可能是一种经济高效的方法。"
    },
    {
      "indent": 3,
      "text": "The URLs for the current tools exist in many places in the Web. Once a suitable replacement tool is available, the author of the original tools has promised to provide a suitable form of redirection.",
      "zh-CHS": "当前工具的URL存在于Web的许多地方。一旦有合适的替换工具可用，原始工具的作者承诺提供合适的重定向形式。"
    },
    {
      "indent": 0,
      "text": "7. Thoughts on Future Enhancements",
      "section_title": true,
      "zh-CHS": "7. 对未来改进的思考"
    },
    {
      "indent": 3,
      "text": "With the planned change in document format, some of the information obtained through heuristics might be more directly extracted from the XML file. Once this format is being used by a significant number of authors, a future effort might move away from heuristics toward extraction from the XML file. To support this approach, it would be desirable for the new XML schema to make the author's continent of residence available, even if it not used in the formatting of the human-readable document.",
      "zh-CHS": "随着文档格式的计划更改，通过启发式获得的一些信息可能会更直接地从XML文件中提取出来。一旦大量作者使用这种格式，未来的工作可能会从启发式转向从XML文件提取。为了支持这种方法，希望新的XML模式能够提供作者居住的大陆，即使它没有用于人类可读文档的格式化。"
    },
    {
      "indent": 3,
      "text": "Currently, the Datatracker has information about document authors, but not other contributors. If information is added to the Datatracker in the future to cover contributors, then the statistics can be expanded to cover contributors as well as authors.",
      "zh-CHS": "目前，Datatracker拥有有关文档作者的信息，但没有其他贡献者的信息。如果将来将信息添加到Datatracker以涵盖贡献者，那么可以扩展统计数据以涵盖贡献者和作者。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document contains the SOW for enhancements to the IETF Datatracker to provide author statistics. These enhancements do not affect the security of the Internet. The enhancements provide statistics about documents that are available to the public without prior authentication, and the statistics will also be available to the public without prior authentication.",
      "zh-CHS": "本文档包含IETF Datatracker增强的SOW，以提供作者统计信息。这些增强不会影响Internet的安全性。这些增强功能提供了有关未经事先验证就可供公众使用的文档的统计信息，并且这些统计信息也将在未经事先验证的情况下供公众使用。"
    },
    {
      "indent": 0,
      "text": "9. Informative References",
      "section_title": true,
      "zh-CHS": "9. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[DATATRACKER] Internet Engineering Task Force, \"IETF Datatracker\", <https://datatracker.ietf.org/>.",
      "zh-CHS": "[DATATRACKER]互联网工程任务组，“IETF DATATRACKER”<https://datatracker.ietf.org/>."
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Russ Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, VA 20170 United States",
      "zh-CHS": "Russ Housley Vigil Security，LLC 918 Spring Knoll Drive Herndon，弗吉尼亚州，美国，20170"
    },
    {
      "indent": 3,
      "text": "Email: housley@vigilsec.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}