{
  "title": {
    "text": "RFC 7102: Terms Used in Routing for Low-Power and Lossy Networks",
    "zh-CHS": "RFC 7102"
  },
  "number": 7102,
  "created_at": "2021-11-01 21:56:03.774854+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       JP. Vasseur\nRequest for Comments: 7102                           Cisco Systems, Inc.\nCategory: Informational                                     January 2014\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Terms Used in Routing for Low-Power and Lossy Networks",
      "zh-CHS": "低功耗和有损网络路由中使用的术语"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terminology used in routing requirements and solutions for networks referred to as Low-Power and Lossy Networks (LLNs). An LLN is typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (e.g., heating, ventilation, air conditioning, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "zh-CHS": "本文档提供了一个术语表，用于低功耗和有损网络（LLN）的路由要求和解决方案。LLN通常由许多嵌入式设备组成，这些设备具有有限的电源、内存和处理资源，通过各种链路相互连接。LLN有广泛的应用领域，包括工业监控、楼宇自动化（如供暖、通风、空调、照明、门禁、消防）、联网家庭、医疗保健、环境监控、城市传感器网络、能源管理、资产跟踪和制冷。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7102.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7102."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2014 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................3\n3. Security Considerations .........................................7\n4. Acknowledgements ................................................7\n5. Informative References ..........................................7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terminology used in routing requirements and solutions for networks referred to as Low-Power and Lossy Networks (LLNs).",
      "zh-CHS": "本文档提供了一个术语表，用于低功耗和有损网络（LLN）的路由要求和解决方案。"
    },
    {
      "indent": 3,
      "text": "LLNs are typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links, such as IEEE 802.15.4 or low-power Wi-Fi. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (heating, ventilation, air conditioning, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "zh-CHS": "LLN通常由许多嵌入式设备组成，这些设备具有有限的电源、内存和处理资源，通过各种链路互连，如IEEE 802.15.4或低功耗Wi-Fi。LLN有广泛的应用领域，包括工业监控、楼宇自动化（供暖、通风、空调、照明、门禁、消防）、联网家庭、医疗保健、环境监测、城市传感器网络、能源管理、资产跟踪和制冷。"
    },
    {
      "indent": 3,
      "text": "Since these applications are usually highly specific (for example, industrial automation, building automation, etc.), it is not uncommon to see a number of disparate terms used to describe the same device or functionality. Thus, in order to avoid confusion or discrepancies, this document specifies the common terminology to be used in all ROLL working group documents. The terms defined in this document are used in [RFC5548], [RFC5673], [RFC5826], and [RFC5867].",
      "zh-CHS": "由于这些应用程序通常是高度特定的（例如，工业自动化、楼宇自动化等），因此使用许多不同的术语来描述相同的设备或功能并不少见。因此，为了避免混淆或不一致，本文件规定了所有滚动工作组文件中使用的通用术语。本文件中定义的术语在[RFC5548]、[RFC5673]、[RFC5826]和[RFC5867]中使用。"
    },
    {
      "indent": 3,
      "text": "Terminology specific to a particular application is out of the scope of this document.",
      "zh-CHS": "特定应用的专用术语不在本文档范围内。"
    },
    {
      "indent": 3,
      "text": "It is expected that all routing documents defining requirements or specifying solutions for LLN will use the common terminology specified in this document. This document should be listed as an informative reference.",
      "zh-CHS": "所有定义LLN要求或指定LLN解决方案的路由文件应使用本文件中指定的通用术语。本文件应作为参考资料列出。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "Actuator: A field device that controls a set of equipment. For example, an actuator might control and/or modulate the flow of a gas or liquid, control electricity distribution, perform a mechanical operation, etc.",
      "zh-CHS": "致动器：控制一套设备的现场装置。例如，致动器可以控制和/或调节气体或液体的流量、控制配电、执行机械操作等。"
    },
    {
      "indent": 3,
      "text": "AMI: Advanced Metering Infrastructure. Makes use of Smart Grid technologies. A canonical Smart Grid application is smart-metering.",
      "zh-CHS": "AMI：先进的计量基础设施。利用智能电网技术。典型的智能电网应用是智能计量。"
    },
    {
      "indent": 3,
      "text": "Channel: Radio frequency sub-band used to transmit a modulated signal carrying packets.",
      "zh-CHS": "信道：无线电频率子频带，用于传输携带数据包的调制信号。"
    },
    {
      "indent": 3,
      "text": "Channel Hopping: A procedure by which field devices synchronously change channels during operation.",
      "zh-CHS": "信道跳变：现场设备在运行期间同步改变信道的过程。"
    },
    {
      "indent": 3,
      "text": "Commissioning Tool: Any physical or logical device temporarily added to the network for the express purpose of setting up the network and device operational parameters. The commissioning tool can also be temporarily added to the LLN for scheduled or unscheduled maintenance.",
      "zh-CHS": "调试工具：为设置网络和设备运行参数而临时添加到网络中的任何物理或逻辑设备。调试工具也可以临时添加到LLN中，以进行计划内或计划外维护。"
    },
    {
      "indent": 3,
      "text": "Closed Loop Control: A procedure whereby a device controller controls an actuator based on input information sensed by one or more field devices.",
      "zh-CHS": "闭环控制：设备控制器根据一个或多个现场设备感应到的输入信息控制执行器的过程。"
    },
    {
      "indent": 3,
      "text": "Controller: A field device that can receive sensor input and automatically change the environment in the facility by manipulating digital or analog actuators.",
      "zh-CHS": "控制器：一种现场设备，可接收传感器输入，并通过操纵数字或模拟执行器自动改变设施内的环境。"
    },
    {
      "indent": 3,
      "text": "DA: Distribution Automation. Part of Smart Grid. Encompasses technologies for maintenance and management of electrical distribution systems.",
      "zh-CHS": "配电自动化。智能电网的一部分。包括配电系统的维护和管理技术。"
    },
    {
      "indent": 3,
      "text": "DAG: Directed Acyclic Graph. A directed graph with no directed cycles (a graph formed by a collection of vertices and directed edges where each edge connects one vertex to another, such that there is no way to start at some vertex v and follow a sequence of edges that eventually loops back to vertex v again).",
      "zh-CHS": "有向无环图。没有有向圈的有向图（由顶点和有向边的集合形成的图，其中每条边将一个顶点连接到另一个顶点，这样就无法从某个顶点v开始，并跟随一系列最终循环到顶点v的边）。"
    },
    {
      "indent": 3,
      "text": "Data sink: A device that collects data from nodes in an LLN.",
      "zh-CHS": "数据接收器：从LLN中的节点收集数据的设备。"
    },
    {
      "indent": 3,
      "text": "Downstream: Data direction traveling from outside of the LLN (e.g., traffic coming from a LAN, WAN, or the Internet) via an LLN Border Router (LBR), or in general, \"deeper\" in the Directed Acyclic Graph computed by the routing protocol.",
      "zh-CHS": "下游：通过LLN边界路由器（LBR）从LLN外部传输的数据方向（例如，来自LAN、WAN或Internet的流量），或者通常在路由协议计算的有向无环图中“更深”。"
    },
    {
      "indent": 3,
      "text": "Field Device: A field device is a physical device placed in the network's operating environment (e.g., plant, urban area, or home). Field devices include sensors and actuators as well as routers and Low-Power and Lossy Network Border Routers (LBRs). A field device is usually (but not always) a device with constrained CPU, memory footprint, storage capacity, bandwidth, and sometimes power (battery operated). At the time of writing, for the sake of illustration, a typical sensor or actuator would have a few Kilobytes of RAM, a few dozens of Kilobytes of ROM/Flash memory, a 8-/16-/32-bit microcontroller, and communication capabilities ranging from a few kbits/s to a few hundred kbits/s. Although continuous improvement of hardware and software technologies is expected, such devices will likely continue to be seen as resource-constrained devices compared to computers and routers used in the rest of the Internet.",
      "zh-CHS": "现场设备：现场设备是放置在网络操作环境中的物理设备（例如，工厂、市区或家庭）。现场设备包括传感器和执行器以及路由器和低功耗有损网络边界路由器（LBR）。现场设备通常是（但并非总是）CPU、内存占用、存储容量、带宽受限的设备，有时是电源（电池供电）。在撰写本文时，为了便于说明，典型的传感器或执行器将具有几千字节的RAM、几十千字节的ROM/闪存、8-/16-/32位微控制器，以及从几kbits/s到几百kbits/s的通信能力。尽管预计硬件和软件技术会不断改进，但与互联网其他部分使用的计算机和路由器相比，此类设备可能会继续被视为资源受限设备。"
    },
    {
      "indent": 3,
      "text": "Flash Memory: non-volatile memory that can be re-programmed.",
      "zh-CHS": "闪存：可重新编程的非易失性存储器。"
    },
    {
      "indent": 3,
      "text": "FMS: Facility Management System. A global term applied across all the vertical designations within a building, including heating, ventilation, and air conditioning (also referred to as HVAC), fire, security, lighting, and elevator control.",
      "zh-CHS": "设施管理系统。适用于建筑物内所有垂直指定的全局术语，包括供暖、通风和空调（也称为HVAC）、消防、安保、照明和电梯控制。"
    },
    {
      "indent": 3,
      "text": "HART: Highway Addressable Remote Transducer. A group of specifications for industrial process and control devices administered by the HART Foundation (see [HART]). The latest version for the specifications is HART7, which includes the additions for WirelessHART.",
      "zh-CHS": "HART：公路可寻址远程传感器。由HART基金会管理的工业过程和控制装置的一组规范（见[ HART]）。规范的最新版本是HART7，其中包括WirelessHART的新增部分。"
    },
    {
      "indent": 3,
      "text": "HVAC: Heating, Ventilation, and Air Conditioning. A term applied to mechanisms used to maintain the comfort level of an internal space.",
      "zh-CHS": "暖通空调：供暖、通风和空调。用于维持内部空间舒适度的机械装置的术语。"
    },
    {
      "indent": 3,
      "text": "ISA: International Society of Automation. An ANSI accredited standards-making society. ISA100 is an ISA committee whose charter includes defining a family of standards for industrial automation. [ISA100.11a] is a working group within ISA100 that is working on a standard for monitoring and non-critical process-control applications.",
      "zh-CHS": "ISA：国际自动化学会。美国国家标准协会认可的标准制定协会。ISA100是一个ISA委员会，其章程包括定义一系列工业自动化标准。[ISA100.11a]是ISA100中的一个工作组，负责制定监控和非关键过程控制应用的标准。"
    },
    {
      "indent": 3,
      "text": "LAN: Local Area Network.",
      "zh-CHS": "局域网：局域网。"
    },
    {
      "indent": 3,
      "text": "LBR: Low-Power and Lossy Network Border Router. A device that connects the Low-Power and Lossy Network to another routing domain such as a LAN, a WAN, or the Internet where a different routing protocol may be in operation. The LBR acts as a routing device and may possibly host other functions such as data collector or aggregator.",
      "zh-CHS": "低功耗和有损网络边界路由器。将低功耗有损网络连接到另一个路由域（如LAN、WAN或Internet）的设备，其中可能使用不同的路由协议。LBR充当路由设备，并且可能承载诸如数据收集器或聚合器之类的其他功能。"
    },
    {
      "indent": 3,
      "text": "LLN: Low-Power and Lossy Network. Typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links, such as IEEE 802.15.4 or low-power Wi-Fi. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (HVAC, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "zh-CHS": "LLN：低功耗和有损网络。通常由许多嵌入式设备组成，这些设备具有有限的电源、内存和处理资源，通过各种链路互连，如IEEE 802.15.4或低功耗Wi-Fi。LLN有广泛的应用领域，包括工业监控、楼宇自动化（HVAC、照明、门禁、消防）、联网家庭、医疗保健、环境监测、城市传感器网络、能源管理、资产跟踪和制冷。"
    },
    {
      "indent": 3,
      "text": "MP2P: Multipoint-to-Point. Used to describe a particular traffic pattern (e.g., MP2P flows collecting information from many nodes flowing upstream towards a collecting sink or an LBR).",
      "zh-CHS": "MP2P：多点对点。用于描述特定的业务模式（例如，MP2P流从流向收集汇或LBR的上游的多个节点收集信息）。"
    },
    {
      "indent": 3,
      "text": "MAC: Medium Access Control. Refers to algorithms and procedures used by the data link layer to coordinate use of the physical layer.",
      "zh-CHS": "媒体访问控制。指数据链路层用于协调物理层使用的算法和程序。"
    },
    {
      "indent": 3,
      "text": "Non-Sleepy Node: A node that always remains in a fully powered-on state (i.e., always awake) where it has the capability to perform communication.",
      "zh-CHS": "非休眠节点：始终处于完全通电状态（即始终处于唤醒状态）的节点，在该状态下，它具有执行通信的能力。"
    },
    {
      "indent": 3,
      "text": "Open Loop Control: A process whereby a plant operator manually manipulates an actuator over the network where the decision is influenced by information sensed by field devices.",
      "zh-CHS": "开环控制：电厂操作员通过网络手动操纵致动器的过程，其中决策受现场设备感应到的信息影响。"
    },
    {
      "indent": 3,
      "text": "PER: Packet Error Rate. A ratio of the number of unusable packets (not received at all or received in error, even after any applicable error correction has been applied) to the total number of packets that would have been received in the absence of errors.",
      "zh-CHS": "PER：数据包错误率。不可用数据包数（完全未接收或错误接收，即使在应用了任何适用的错误纠正之后）与在没有错误的情况下接收的数据包总数的比率。"
    },
    {
      "indent": 3,
      "text": "P2P: Point To Point. Refers to traffic exchanged between two nodes (regardless of the number of hops between the two nodes).",
      "zh-CHS": "P2P：点对点。指两个节点之间交换的通信量（与两个节点之间的跳数无关）。"
    },
    {
      "indent": 3,
      "text": "P2MP: Point-to-Multipoint. Refers to traffic between one node and a set of nodes. This is similar to the P2MP concept in Multicast or MPLS Traffic Engineering ([RFC4461]and [RFC4875]). A common use case for the Routing Protocol for Low-Power and Lossy Networks (RPL) involves P2MP flows from or through a DAG root outward towards other nodes contained in the DAG.",
      "zh-CHS": "P2MP：点对多点。指一个节点和一组节点之间的通信量。这类似于多播或MPLS流量工程中的P2MP概念（[RFC4461]和[RFC4875]）。低功耗有损网络（RPL）路由协议的一个常见用例涉及P2MP流从DAG根或通过DAG根向外流向DAG中包含的其他节点。"
    },
    {
      "indent": 3,
      "text": "RAM: Random Access Memory. A volatile memory.",
      "zh-CHS": "随机存取存储器。易失性存储器。"
    },
    {
      "indent": 3,
      "text": "RFID: Radio Frequency IDentification.",
      "zh-CHS": "射频识别：射频识别。"
    },
    {
      "indent": 3,
      "text": "ROM: Read-Only Memory.",
      "zh-CHS": "只读存储器：只读存储器。"
    },
    {
      "indent": 3,
      "text": "ROLL: Routing Over Low-Power and Lossy Networks.",
      "zh-CHS": "滚动：在低功耗和有损网络上路由。"
    },
    {
      "indent": 3,
      "text": "RPL: An IPv6 Routing Protocol for Low-Power and Lossy Networks that provides a mechanism whereby multipoint-to-point traffic from devices inside the LLN towards a central control point as well as point-to-multipoint traffic from the central control point to the devices inside the LLN are supported. RPL also supports point-to-point traffic between any arbitrary nodes in the LLN.",
      "zh-CHS": "RPL：一种用于低功耗和有损网络的IPv6路由协议，它提供了一种机制，支持从LLN内部设备到中央控制点的多点对点流量，以及从中央控制点到LLN内部设备的点对多点流量。RPL还支持LLN中任意节点之间的点对点通信。"
    },
    {
      "indent": 3,
      "text": "RPL Domain: A collection of RPL routers under the control of a single administration. The boundaries of routing domains are defined by network management by setting some links to be exterior, or inter-domain, links.",
      "zh-CHS": "RPL域：由单一管理层控制的RPL路由器集合。网络管理通过将某些链路设置为外部或域间链路来定义路由域的边界。"
    },
    {
      "indent": 3,
      "text": "Schedule: An agreed execution, wake-up, transmission, reception, etc., timetable between two or more field devices.",
      "zh-CHS": "时间表：两个或多个现场设备之间商定的执行、唤醒、传输、接收等时间表。"
    },
    {
      "indent": 3,
      "text": "Sensor: A device that measures a physical quantity and converts it to an analog or digital signal that can be read by a program or a user. Sensed data can be of many types: electromagnetic (e.g., current, voltage, power, or resistance), mechanical (e.g., pressure, flow, liquid density, or humidity), chemical (e.g., oxygen or carbon monoxide), acoustic (e.g., noise or ultrasound), etc.",
      "zh-CHS": "传感器：一种测量物理量并将其转换为可由程序或用户读取的模拟或数字信号的装置。感测数据可以是多种类型：电磁（例如电流、电压、功率或电阻）、机械（例如压力、流量、液体密度或湿度）、化学（例如氧气或一氧化碳）、声学（例如噪声或超声波）等。"
    },
    {
      "indent": 3,
      "text": "Sleepy Node: A node that may sometimes go into a sleep mode (i.e., go into a low-power state to conserve power) and temporarily suspend protocol communication. When not in sleep mode, the sleepy node is in a fully powered-on state where it has the capability to perform communication.",
      "zh-CHS": "休眠节点：有时可能进入休眠模式（即进入低功耗状态以节省电源）并临时挂起协议通信的节点。当不处于睡眠模式时，休眠节点处于完全通电状态，在此状态下，它能够执行通信。"
    },
    {
      "indent": 3,
      "text": "Smart Grid: A broad class of applications to network and automate utility infrastructure.",
      "zh-CHS": "智能电网：用于网络和自动化公用设施基础设施的广泛应用。"
    },
    {
      "indent": 3,
      "text": "Timeslot: A fixed time interval that may be used for the transmission or reception of a packet between two field devices. A timeslot used for communications is associated with a slotted-link.",
      "zh-CHS": "时隙：可用于在两个现场设备之间传输或接收数据包的固定时间间隔。用于通信的时隙与时隙链路相关联。"
    },
    {
      "indent": 3,
      "text": "Upstream: Data direction traveling from the LLN via the LBR to outside of the LLN (LAN, WAN, or Internet) or generally closer to the root of the DAG computed by the routing protocol.",
      "zh-CHS": "上游：从LLN通过LBR传输到LLN外部（LAN、WAN或Internet）或通常更接近路由协议计算的DAG根的数据方向。"
    },
    {
      "indent": 3,
      "text": "WAN: Wide Area Network.",
      "zh-CHS": "广域网：广域网。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Since this document specifies terminology and does not specify new procedures or protocols, it raises no new security issues.",
      "zh-CHS": "由于本文件规定了术语，没有规定新的程序或协议，因此不会产生新的安全问题。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "zh-CHS": "4. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Christian Jacquenet, Tim Winter, Pieter De Mil, David Meyer, Mukul Goyal, and Abdussalam Baryun for their valuable feedback.",
      "zh-CHS": "作者要感谢Christian Jacquenet、Tim Winter、Pieter De Mil、David Meyer、Mukul Goyal和Abdussalam Baryun的宝贵反馈。"
    },
    {
      "indent": 0,
      "text": "5. Informative References",
      "section_title": true,
      "zh-CHS": "5. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[HART] HART Communication Foundation, <http://www.hartcomm.org>.",
      "zh-CHS": "[哈特]哈特通讯基金会，<http://www.hartcomm.org>."
    },
    {
      "indent": 3,
      "text": "[ISA100.11a] ISA, \"Wireless systems for industrial automation: Process control and related applications\", ISA 100.11a, May 2008, <http://www.isa.org/Community/ SP100WirelessSystemsforAutomation>.",
      "zh-CHS": "[ISA100.11a]ISA，“工业自动化无线系统：过程控制和相关应用”，ISA 100.11a，2008年5月<http://www.isa.org/Community/ SP100无线自动化系统>。"
    },
    {
      "indent": 3,
      "text": "[RFC4461] Yasukawa, S., Ed., \"Signaling Requirements for Point-to-Multipoint Traffic-Engineered MPLS Label Switched Paths (LSPs)\", RFC 4461, April 2006.",
      "zh-CHS": "[RFC4461]Yasukawa，S.，Ed.“点对多点流量工程MPLS标签交换路径（LSP）的信令要求”，RFC 4461，2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4875] Aggarwal, R., Ed., Papadimitriou, D., Ed., and S. Yasukawa, Ed., \"Extensions to Resource Reservation Protocol - Traffic Engineering (RSVP-TE) for Point-to-Multipoint TE Label Switched Paths (LSPs)\", RFC 4875, May 2007.",
      "zh-CHS": "[RFC4875]Aggarwal，R.，Ed.，Papadimitriou，D.，Ed.，和S.Yasukawa，Ed.，“资源预留协议的扩展-点对多点TE标签交换路径（LSP）的流量工程（RSVP-TE）”，RFC 48752007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5548] Dohler, M., Ed., Watteyne, T., Ed., Winter, T., Ed., and D. Barthel, Ed., \"Routing Requirements for Urban Low-Power and Lossy Networks\", RFC 5548, May 2009.",
      "zh-CHS": "[RFC5548]Dohler，M.，Ed.，Watteyne，T.，Ed.，Winter，T.，Ed.，和D.Barthel，Ed.，“城市低功率和有损网络的路由要求”，RFC 5548，2009年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5673] Pister, K., Ed., Thubert, P., Ed., Dwars, S., and T. Phinney, \"Industrial Routing Requirements in Low-Power and Lossy Networks\", RFC 5673, October 2009.",
      "zh-CHS": "[RFC5673]Pister，K.，Ed.，Thubert，P.，Ed.，Dwars，S.，和T.Phinney，“低功率和有损网络中的工业路由要求”，RFC 5673，2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5826] Brandt, A., Buron, J., and G. Porcu, \"Home Automation Routing Requirements in Low-Power and Lossy Networks\", RFC 5826, April 2010.",
      "zh-CHS": "[RFC5826]Brandt，A.，Buron，J.，和G.Porcu，“低功率和有损网络中的家庭自动化路由要求”，RFC 5826，2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5867] Martocci, J., Ed., De Mil, P., Riou, N., and W. Vermeylen, \"Building Automation Routing Requirements in Low-Power and Lossy Networks\", RFC 5867, June 2010.",
      "zh-CHS": "[RFC5867]Martocci，J.，Ed.，De Mil，P.，Riou，N.，和W.Vermeylen，“低功率和有损网络中的楼宇自动化路由要求”，RFC 58672010年6月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "JP. Vasseur Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719 US",
      "zh-CHS": "JP。美国马萨诸塞州博克斯伯勒马萨诸塞大道1414号瓦瑟尔思科系统公司01719"
    },
    {
      "indent": 3,
      "text": "EMail: jpv@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}