{
  "title": {
    "text": "RFC 7699: Generalized Labels for the Flexi-Grid in Lambda Switch Capable (LSC) Label Switching Routers",
    "zh-CHS": "RFC 7699"
  },
  "number": 7699,
  "created_at": "2021-10-31 14:50:47.773122+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Farrel\nRequest for Comments: 7699                                       D. King\nUpdates: 3471, 6205                                   Old Dog Consulting\nCategory: Standards Track                                          Y. Li\nISSN: 2070-1721                                       Nanjing University\n                                                                F. Zhang\n                                                     Huawei Technologies\n                                                           November 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": " Generalized Labels for the Flexi-Grid in Lambda Switch Capable (LSC) Label Switching Routers",
      "zh-CHS": "Lambda交换机（LSC）标签交换路由器中Flexi网格的通用标签"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "GMPLS supports the description of optical switching by identifying entries in fixed lists of switchable wavelengths (called grids) through the encoding of lambda labels. Work within the ITU-T Study Group 15 has defined a finer-granularity grid, and the facility to flexibly select different widths of spectrum from the grid. This document defines a new GMPLS lambda label format to support this flexi-grid.",
      "zh-CHS": "GMPLS通过对lambda标签进行编码来识别固定的可切换波长列表（称为网格）中的条目，从而支持对光交换的描述。ITU-T研究小组15内的工作定义了更精细的粒度网格，以及从网格中灵活选择不同频谱宽度的设施。本文件定义了一种新的GMPLS lambda标签格式，以支持该flexi网格。"
    },
    {
      "indent": 3,
      "text": "This document updates RFCs 3471 and 6205 by introducing a new label format.",
      "zh-CHS": "本文档通过引入新的标签格式来更新RFCs 3471和6205。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7699.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7699."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n   1.1. Conventions Used in This Document . . . . . . . . . . . . . 4\n2. Overview of Flexi-Grid . . . . . . . . . . . . . . . . . . . . . 4\n3. Fixed-Grid Lambda Label Encoding . . . . . . . . . . . . . . . . 5\n4. Flexi-Grid Label Format and Values . . . . . . . . . . . . . . . 5\n   4.1. Flexi-Grid Label Encoding . . . . . . . . . . . . . . . . . 5\n   4.2. Considerations of Bandwidth . . . . . . . . . . . . . . . . 7\n   4.3. Composite Labels  . . . . . . . . . . . . . . . . . . . . . 7\n5. Manageability and Backward Compatibility Considerations  . . . . 9\n   5.1. Control-Plane Backward Compatibility  . . . . . . . . . . . 9\n   5.2. Manageability Considerations  . . . . . . . . . . . . . . . 9\n6. Security Considerations . . . . . . . . . . . . . . . . . . . . 10\n7. IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 10\n   7.1. Grid Subregistry . . . . . . . . . . . . . . . . . . . . . 10\n   7.2. DWDM Channel Spacing Subregistry . . . . . . . . . . . . . 11\n8. References  . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n   8.1. Normative References . . . . . . . . . . . . . . . . . . . 11\n   8.2. Informative References . . . . . . . . . . . . . . . . . . 11\nAppendix A. Flexi-Grid Example . . . . . . . . . . . . . . . . . . 13\nAcknowledgments  . . . . . . . . . . . . . . . . . . . . . . . . . 14\nContributors . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\nAuthors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 14",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As described in [RFC3945], GMPLS extends MPLS from supporting only Packet Switch Capable (PSC) interfaces and switching, to also support four new classes of interfaces and switching that include Lambda Switch Capable (LSC).",
      "zh-CHS": "如[RFC3945]所述，GMPLS将MPLS从仅支持支持支持分组交换（PSC）的接口和交换扩展到支持四类新的接口和交换，包括支持Lambda交换（LSC）。"
    },
    {
      "indent": 3,
      "text": "A functional description of the extensions to MPLS signaling needed to support this new class of interface and switching is provided in [RFC3471].",
      "zh-CHS": "[RFC3471]中提供了支持这种新型接口和交换所需的MPLS信令扩展的功能描述。"
    },
    {
      "indent": 3,
      "text": "Section 3.2.1.1 of [RFC3471] states that wavelength labels \"only have significance between two neighbors\": global wavelength semantics are not considered. [RFC6205] defines a standard lambda label format that has a global semantic and is compliant with both the Dense Wavelength Division Multiplexing (DWDM) grid [G.694.1] and the Coarse Wavelength Division Multiplexing (CWDM) grid [G.694.2]. The terms DWDM and CWDM are defined in [G.671].",
      "zh-CHS": "[RFC3471]第3.2.1.1节规定波长标签“仅在两个相邻位置之间具有重要性”：不考虑全局波长语义。[RFC6205]定义了一种标准的lambda标签格式，该格式具有全局语义，并符合密集波分复用（DWDM）网格[G.694.1]和粗波分复用（CWDM）网格[G.694.2]。术语DWDM和CWDM的定义见[G.671]。"
    },
    {
      "indent": 3,
      "text": "A flexible-grid network selects its data channels as arbitrarily assigned pieces of the spectrum. Mixed bitrate transmission systems can allocate their channels with different spectral bandwidths so that the channels can be optimized for the bandwidth requirements of the particular bit rate and modulation scheme of the individual channels. This technique is regarded as a promising way to improve the network utilization efficiency and fundamentally reduce the cost of the core network.",
      "zh-CHS": "灵活的网格网络选择其数据通道作为任意分配的频谱。混合比特率传输系统可分配其具有不同频谱带宽的信道，以便信道可针对特定比特率的带宽要求和单个信道的调制方案进行优化。该技术被认为是提高网络利用率、从根本上降低核心网成本的一条有前途的途径。"
    },
    {
      "indent": 3,
      "text": "The \"flexi-grid\" has been developed within the ITU-T Study Group 15 to allow selection and switching of pieces of the optical spectrum chosen flexibly from a fine-granularity grid of wavelengths with variable spectral bandwidth [G.694.1].",
      "zh-CHS": "在ITU-T研究组15内开发了“flexi网格”，以允许从具有可变光谱带宽的波长的精细粒度网格中灵活选择和切换光谱片段[G.694.1]。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] defines several basic label types including the lambda label. Section 3.2.1.1 of [RFC3471] states that wavelength labels \"only have significance between two neighbors\"; global wavelength semantics are not considered. In order to facilitate interoperability in a network composed of LSC equipment, [RFC6205] defines a standard lambda label format and is designated an update of RFC 3471.",
      "zh-CHS": "[RFC3471]定义了几种基本标签类型，包括lambda标签。[RFC3471]第3.2.1.1节规定，波长标签“仅在两个相邻位置之间具有重要意义”；不考虑全局波长语义。为了促进LSC设备组成的网络中的互操作性，[RFC6205]定义了标准的lambda标签格式，并指定为RFC 3471的更新。"
    },
    {
      "indent": 3,
      "text": "This document continues the theme of defining global semantics for the wavelength label by adding support for the flexi-grid. Thus, this document updates [RFC6205] and [RFC3471].",
      "zh-CHS": "本文档通过添加对flexi网格的支持，继续定义波长标签的全局语义这一主题。因此，本文件更新了[RFC6205]和[RFC3471]。"
    },
    {
      "indent": 3,
      "text": "This document relies on [G.694.1] for the definition of the optical data plane and does not make any updates to the work of the ITU-T.",
      "zh-CHS": "本文件依赖[G.694.1]定义光学数据平面，未对ITU-T的工作进行任何更新。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Overview of Flexi-Grid",
      "section_title": true,
      "zh-CHS": "2. Flexi网格概述"
    },
    {
      "indent": 3,
      "text": "[G.694.1] defines DWDM fixed grids. The latest version of that document extends the DWDM fixed grids to add support for flexible grids. The basis of the work is to allow a data channel to be formed from an abstract grid anchored at 193.1 THz and selected on a channel spacing of 6.25 GHz with a variable slot width measured in units of 12.5 GHz. Individual allocations may be made on this basis from anywhere in the spectrum, subject to allocations not overlapping.",
      "zh-CHS": "[G.694.1]定义DWDM固定网格。该文档的最新版本扩展了DWDM固定网格，以添加对柔性网格的支持。这项工作的基础是允许数据信道由锚定在193.1太赫兹的抽象网格形成，并在6.25 GHz的信道间隔上选择，可变槽宽以12.5 GHz为单位测量。可在此基础上从频谱中的任何位置进行单独分配，但分配不得重叠。"
    },
    {
      "indent": 3,
      "text": "[G.694.1] provides clear guidance on the support of flexible grid by implementations in Section 2 of Appendix I:",
      "zh-CHS": "[G.694.1]提供了附录I第2节中实施的灵活网格支持的明确指南："
    },
    {
      "indent": 6,
      "text": "The flexible DWDM grid defined in clause 7 has a nominal central frequency granularity of 6.25 GHz and a slot width granularity of 12.5 GHz. However, devices or applications that make use of the flexible grid may not have to be capable of supporting every possible slot width or position. In other words, applications may be defined where only a subset of the possible slot widths and positions are required to be supported.",
      "zh-CHS": "第7条中定义的柔性DWDM网格的标称中心频率粒度为6.25 GHz，时隙宽度粒度为12.5 GHz。然而，使用柔性网格的设备或应用程序可能不必能够支持每个可能的插槽宽度或位置。换句话说，可以定义仅需要支持可能的槽宽度和位置的子集的应用。"
    },
    {
      "indent": 6,
      "text": "For example, an application could be defined where the nominal central frequency granularity is 12.5 GHz (by only requiring values of n that are even) and that only requires slot widths as a multiple of 25 GHz (by only requiring values of m that are even).",
      "zh-CHS": "例如，可以定义一个应用，其中标称中心频率粒度为12.5ghz（仅要求n的值为偶数），并且仅要求槽宽为25ghz的倍数（仅要求m的值为偶数）。"
    },
    {
      "indent": 3,
      "text": "Some additional background on the use of GMPLS for flexible grids can be found in [RFC7698].",
      "zh-CHS": "在[RFC7698]中可以找到关于柔性网格使用GMPLS的其他背景资料。"
    },
    {
      "indent": 0,
      "text": "2.1. Composite Labels",
      "section_title": true,
      "zh-CHS": "2.1. 复合标签"
    },
    {
      "indent": 3,
      "text": "It is possible to construct an end-to-end connection as a composite of more than one flexi-grid slot. The mechanism used in GMPLS is similar to that used to support inverse multiplexing familiar in time-division multiplexing (TDM) and optical transport networks (OTNs). The slots in the set could potentially be contiguous or non-contiguous (only as allowed by the definitions of the data plane) and could be signaled as a single LSP or constructed from a group of LSPs. For more details, refer to Section 4.3.",
      "zh-CHS": "可以将端到端连接构造为多个柔性网格槽的组合。GMPLS中使用的机制类似于用于支持时分复用（TDM）和光传输网络（OTN）中常见的反向复用的机制。集合中的插槽可能是连续的或非连续的（仅在数据平面的定义允许的情况下），并且可以作为单个LSP发出信号，或者由一组LSP构造。有关更多详细信息，请参阅第4.3节。"
    },
    {
      "indent": 3,
      "text": "How the signal is carried across such groups of channels is out of scope for this document.",
      "zh-CHS": "如何在这些信道组中传输信号超出了本文件的范围。"
    },
    {
      "indent": 0,
      "text": "3. Fixed-Grid Lambda Label Encoding",
      "section_title": true,
      "zh-CHS": "3. 固定网格Lambda标签编码"
    },
    {
      "indent": 3,
      "text": "[RFC6205] defines an encoding for a global semantic for a DWDM label based on four fields:",
      "zh-CHS": "[RFC6205]基于四个字段定义DWDM标签的全局语义编码："
    },
    {
      "indent": 3,
      "text": "- Grid: used to select which grid the lambda is selected from. Values defined in [RFC6205] identify DWDM [G.694.1] and CWDM [G.694.2].",
      "zh-CHS": "- 栅格：用于选择从中选择lambda的栅格。[RFC6205]中定义的值标识DWDM[G.694.1]和CWDM[G.694.2]。"
    },
    {
      "indent": 3,
      "text": "- C.S. (Channel Spacing): used to indicate the channel spacing. [RFC6205] defines values to represent spacing of 100, 50, 25, and 12.5 GHz.",
      "zh-CHS": "- C.S.（通道间距）：用于指示通道间距。[RFC6205]定义了表示100、50、25和12.5 GHz间隔的值。"
    },
    {
      "indent": 3,
      "text": "- Identifier: a local-scoped integer used to distinguish different lasers (in one node) when they can transmit the same frequency lambda.",
      "zh-CHS": "- 标识符：一个局部范围的整数，用于区分不同的激光器（在一个节点中），当它们可以传输相同的频率λ时。"
    },
    {
      "indent": 3,
      "text": "- n: a two's-complement integer to take a positive, negative, or zero value. This value is used to compute the frequency as defined in [RFC6205] and based on [G.694.1]. The use of n is repeated here for ease of reading the rest of this document: in case of discrepancy, the definition in [RFC6205] is normative.",
      "zh-CHS": "- n：取正、负或零值的二补整数。该值用于根据[G.694.1]计算[RFC6205]中定义的频率。为了便于阅读本文件的其余部分，此处重复使用n：如果存在差异，[RFC6205]中的定义是规范性的。"
    },
    {
      "indent": 9,
      "text": "Frequency (THz) = 193.1 THz + n * frequency granularity (THz)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "where the nominal central frequency granularity for the flexible grid is 0.00625 THz",
      "zh-CHS": "其中，柔性网格的标称中心频率粒度为0.00625太赫兹"
    },
    {
      "indent": 0,
      "text": "4. Flexi-Grid Label Format and Values",
      "section_title": true,
      "zh-CHS": "4. Flexi网格标签格式和值"
    },
    {
      "indent": 0,
      "text": "4.1 Flexi-Grid Label Encoding",
      "section_title": true,
      "zh-CHS": "4.1 灵活网格标签编码"
    },
    {
      "indent": 3,
      "text": "This document defines a generalized label encoding for use in flexi-grid systems. As with the other GMPLS lambda label formats defined in [RFC3471] and [RFC6205], the use of this label format is known a priori. That is, since the interpretation of all lambda labels is determined hop by hop, the use of this label format requires that all nodes on the path expect to use this label format.",
      "zh-CHS": "本文件定义了用于flexi网格系统的通用标签编码。与[RFC3471]和[RFC6205]中定义的其他GMPLS lambda标签格式一样，此标签格式的使用是先验的。也就是说，由于所有lambda标签的解释是逐跳确定的，因此使用此标签格式要求路径上的所有节点都希望使用此标签格式。"
    },
    {
      "indent": 3,
      "text": "For convenience, however, the label format is modeled on the fixed-grid label defined in [RFC6205] and briefly described in Section 3.",
      "zh-CHS": "然而，为方便起见，标签格式以[RFC6205]中定义的固定网格标签为模型，并在第3节中简要描述。"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the format of the Flexi-Grid Label. It is a 64-bit label.",
      "zh-CHS": "图1显示了Flexi网格标签的格式。它是一个64位标签。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid | C.S.  |    Identifier   |              n                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              m                |          Reserved             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Figure 1 : The Flexi-Grid Label Encoding",
      "zh-CHS": "图1:Flexi网格标签编码"
    },
    {
      "indent": 3,
      "text": "This document defines a new Grid value to supplement those in [RFC6205]:",
      "zh-CHS": "本文件定义了一个新的网格值，以补充[RFC6205]中的网格值："
    },
    {
      "indent": 3,
      "text": "+----------+---------+\n|   Grid   |  Value  |\n+----------+---------+\n|ITU-T Flex|    3    |\n+----------+---------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Within the fixed-grid network, the C.S. value is used to represent the channel spacing, as the spacing between adjacent channels is constant. For the flexible-grid situation, this field is used to represent the nominal central frequency granularity.",
      "zh-CHS": "在固定网格网络中，C.S.值用于表示通道间距，因为相邻通道之间的间距是恒定的。对于灵活网格情况，此字段用于表示标称中心频率粒度。"
    },
    {
      "indent": 3,
      "text": "This document defines a new C.S. value to supplement those in [RFC6205]:",
      "zh-CHS": "本文件定义了一个新的C.S.值，以补充[RFC6205]中的值："
    },
    {
      "indent": 3,
      "text": "+------------+---------+\n| C.S. (GHz) |  Value  |\n+------------+---------+\n|     6.25   |    5    |\n+------------+---------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The meaning of the Identifier field is maintained from [RFC6205] (see also Section 3).",
      "zh-CHS": "标识符字段的含义由[RFC6205]保持（另见第3节）。"
    },
    {
      "indent": 3,
      "text": "The meaning of n is maintained from [RFC6205] (see also Section 3).",
      "zh-CHS": "n的含义由[RFC6205]保留（另见第3节）。"
    },
    {
      "indent": 3,
      "text": "The m field is used to identify the slot width according to the formula given in [G.694.1] as follows. It is a 16-bit integer value encoded in line format.",
      "zh-CHS": "m字段用于根据[G.694.1]中给出的公式确定槽宽，如下所示。它是以行格式编码的16位整数值。"
    },
    {
      "indent": 9,
      "text": "Slot Width (GHz) = 12.5 GHz * m",
      "zh-CHS": "槽宽（GHz）=12.5 GHz*m"
    },
    {
      "indent": 3,
      "text": "The Reserved field MUST be set to zero on transmission and SHOULD be ignored on receipt.",
      "zh-CHS": "传输时必须将保留字段设置为零，接收时应忽略该字段。"
    },
    {
      "indent": 3,
      "text": "An implementation that wishes to use the flexi-grid label encoding MUST follow the procedures of [RFC3473] and of [RFC3471] as updated by [RFC6205]. It MUST set Grid to 3 and C.S. to 5. It MUST set Identifier to indicate the local identifier of the laser in use as described in [RFC6205]. It MUST also set n according to the formula in Section 3 (inherited unchanged from [RFC6205]). Finally, the implementation MUST set m as described in the formula stated above.",
      "zh-CHS": "希望使用灵活网格标签编码的实现必须遵循[RFC3473]和[RFC6205]更新的[RFC3471]的程序。它必须将栅格设置为3，将C.S.设置为5。必须设置标识符，以指示使用中激光器的本地标识符，如[RFC6205]所述。它还必须根据第3节中的公式设置n（继承自[RFC6205]）。最后，实现必须按照上述公式中所述设置m。"
    },
    {
      "indent": 0,
      "text": "4.2. Considerations of Bandwidth",
      "section_title": true,
      "zh-CHS": "4.2. 对带宽的考虑"
    },
    {
      "indent": 3,
      "text": "There is some overlap between the concepts of bandwidth and label in many GMPLS-based systems where a label indicates a physical switching resource. This overlap is increased in a flexi-grid system where a label value indicates the slot width and so affects the bandwidth supported by an LSP. Thus, the m parameter is both a property of the label (i.e., it helps define exactly what is switched) and of the bandwidth.",
      "zh-CHS": "在许多基于GMPLS的系统中，带宽和标签的概念有些重叠，其中标签表示物理交换资源。这种重叠在flexi网格系统中增加，其中标签值表示插槽宽度，因此影响LSP支持的带宽。因此，m参数既是标签的属性（即，它有助于准确定义交换的内容）也是带宽的属性。"
    },
    {
      "indent": 3,
      "text": "In GMPLS signaling [RFC3473], bandwidth is requested in the SENDER_TSPEC object and confirmed in the FLOWSPEC object. The m parameter, which is a parameter of the GMPLS flexi-grid label as described above, is also a parameter of the flexi-grid Tspec and Flowspec as described in [FLEXRSVP].",
      "zh-CHS": "在GMPLS信令[RFC3473]中，在发送方_TSPEC对象中请求带宽，并在FLOWSPEC对象中确认带宽。m参数是如上所述的GMPLS flexi grid标签的参数，也是[FLEXRSVP]中所述的flexi grid Tspec和Flowspec的参数。"
    },
    {
      "indent": 0,
      "text": "4.3. Composite Labels",
      "section_title": true,
      "zh-CHS": "4.3. 复合标签"
    },
    {
      "indent": 3,
      "text": "The creation of a composite of multiple channels to support inverse multiplexing is already supported in GMPLS for TDM and OTN (see [RFC4606], [RFC6344], and [RFC7139]). The mechanism used for flexi-grid is similar.",
      "zh-CHS": "用于TDM和OTN的GMPLS已经支持创建多个信道的组合以支持反向多路复用（请参见[RFC4606]、[RFC6344]和[RFC7139]）。用于flexi网格的机制类似。"
    },
    {
      "indent": 3,
      "text": "To signal an LSP that uses multiple flexi-grid slots, a \"compound label\" is constructed. That is, the LABEL object is constructed from a concatenation of the 64-bit Flexi-Grid Labels shown in Figure 1. The number of elements in the label can be determined from the length of the LABEL object. The resulting LABEL object is shown in Figure 2 including the object header that is not normally shown in diagrammatic representations of RSVP-TE objects. Note that r is the count of component labels, and this is backward compatible with the label shown in Figure 1 where the value of r is 1.",
      "zh-CHS": "为了向使用多个flexi网格插槽的LSP发送信号，需要构造一个“复合标签”。也就是说，LABEL对象是由图1所示的64位Flexi网格标签串联而成的。标签中的元素数量可以根据标签对象的长度确定。结果标签对象如图2所示，包括RSVP-TE对象的图表表示中通常未显示的对象标题。请注意，r是组件标签的计数，这与图1所示的标签向后兼容，其中r的值为1。"
    },
    {
      "indent": 3,
      "text": "The component labels MUST be presented in increasing order of the value n. Implementations MUST NOT infer anything about the encoding of a signal into the set of slots represented by a compound label from the label itself. Information about the encoding MAY be handled in other fields in signaling messages or through an out-of-band system, but such considerations are outside the scope of this document.",
      "zh-CHS": "组件标签必须按值n的递增顺序显示。实现不能从标签本身推断任何关于将信号编码到由复合标签表示的插槽集合的信息。关于编码的信息可以在信令消息中的其他字段中处理，也可以通过带外系统处理，但是这些注意事项不在本文档的范围之内。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Object Length (4 + 8r)      | Class-Num (16)|  C-Type (2)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid | C.S.  |    Identifier   |              n                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              m                |          Reserved             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                                                               ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid | C.S.  |    Identifier   |              n                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              m                |          Reserved             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Figure 2 : A Compound Label for Virtual Concatenation",
      "zh-CHS": "图2：虚拟连接的复合标签"
    },
    {
      "indent": 3,
      "text": "Note that specific rules must be applied as follows:",
      "zh-CHS": "请注意，必须按照以下方式应用特定规则："
    },
    {
      "indent": 3,
      "text": "- Grid MUST show \"ITU-T Flex\" value 3 in each component label. - C.S. MUST have the same value in each component label. - Identifier in each component label may identify different physical equipment. - Values of n and m in each component label define the slots that are concatenated.",
      "zh-CHS": "- 网格必须在每个组件标签中显示“ITU-T Flex”值3。-每个组件标签上的C.S.值必须相同。-每个组件标签中的标识符可以识别不同的物理设备。-每个组件标签中的n和m值定义了连接的插槽。"
    },
    {
      "indent": 3,
      "text": "At the time of writing, [G.694.1] only supports only groupings of adjacent slots (i.e., without intervening unused slots that could be used for other purposes) of identical width (same value of m), and the component slots must be in increasing order of frequency (i.e., increasing order of the value n). The mechanism defined here MUST NOT be used for other forms of grouping unless and until those forms are defined and documented in Recommendations published by the ITU-T.",
      "zh-CHS": "在撰写本文时，[G.694.1]仅支持相同宽度（相同m值）的相邻插槽分组（即，不干预可用于其他目的的未使用插槽），并且组件插槽必须按频率的递增顺序（即，值n的递增顺序）。此处定义的机制不得用于其他形式的分组，除非ITU-T发布的建议中定义并记录了这些形式。"
    },
    {
      "indent": 3,
      "text": "Note further that while the mechanism described here naturally means that all component channels are corouted, a composite channel can also be achieved by constructing individual LSPs from single flexi-grid slots and managing those LSPs as a group. A mechanism for achieving this for TDM is described in [RFC6344], but is out of scope for discussion in this document because the labels used are normal, single-slot labels and require no additional definitions.",
      "zh-CHS": "进一步注意，虽然这里描述的机制自然意味着所有组件通道都是共线的，但是也可以通过从单个flexi网格插槽构建单个lsp并将这些lsp作为一个组进行管理来实现复合通道。[RFC6344]中描述了TDM实现这一点的机制，但不在本文档讨论的范围内，因为使用的标签是普通的单槽标签，不需要其他定义。"
    },
    {
      "indent": 0,
      "text": "5. Manageability and Backward Compatibility Considerations",
      "section_title": true,
      "zh-CHS": "5. 可管理性和向后兼容性注意事项"
    },
    {
      "indent": 3,
      "text": "This section briefly considers issues of manageability and backward compatibility.",
      "zh-CHS": "本节简要讨论可管理性和向后兼容性问题。"
    },
    {
      "indent": 0,
      "text": "5.1. Control-Plane Backward Compatibility",
      "section_title": true,
      "zh-CHS": "5.1. 控制平面向后兼容性"
    },
    {
      "indent": 3,
      "text": "Labels are carried in two ways in GMPLS: for immediate use on the next hop and for use at remote hops.",
      "zh-CHS": "在GMPLS中，标签以两种方式携带：在下一跳时立即使用，在远程跳时使用。"
    },
    {
      "indent": 3,
      "text": "It is an assumption of GMPLS that both ends of a link know what label types are supported and only use appropriate label types. If a label of an unknown type is received, it will be processed as if it was of a known type since the Label Object and similar label-carrying objects do not contain a type identifier. Thus, the introduction of a flexi-grid label in this document does not change the compatibility issues, and a legacy node that does not support the new flexi-grid label should not expect to receive or handle such labels. If one is incorrectly used in communication with a legacy node, it will attempt to process it as an expected label type with a potentially poor outcome.",
      "zh-CHS": "GMPLS假设链接的两端都知道支持哪些标签类型，并且只使用适当的标签类型。如果接收到未知类型的标签，则会像处理已知类型的标签一样对其进行处理，因为标签对象和类似的标签承载对象不包含类型标识符。因此，本文档中引入flexi网格标签不会改变兼容性问题，不支持新flexi网格标签的旧节点不应期望接收或处理此类标签。如果在与旧节点的通信中错误地使用了一个标签，它将尝试将其作为预期的标签类型进行处理，结果可能很差。"
    },
    {
      "indent": 3,
      "text": "It is possible that a GMPLS message transitting a legacy node will contain a flexi-grid label destined for or reported by a remote node. For example, an LSP that transits links of different technologies might record flexi-grid labels in a Record Route Object that is subsequently passed to a legacy node. Such labels will not have any impact on legacy implementations except as noted in the manageability considerations in the next section.",
      "zh-CHS": "传输传统节点的GMPLS消息可能包含一个目的地为远程节点或由远程节点报告的flexi网格标签。例如，传输不同技术的链路的LSP可能会在记录路由对象中记录flexi网格标签，该对象随后会传递给遗留节点。除下一节中的可管理性注意事项外，此类标签不会对遗留实现产生任何影响。"
    },
    {
      "indent": 0,
      "text": "5.2. Manageability Considerations",
      "section_title": true,
      "zh-CHS": "5.2. 可管理性考虑"
    },
    {
      "indent": 3,
      "text": "This document introduces no new elements for management. That is, labels can continue to be used in the same way by the GMPLS protocols and where those labels were treated as opaque quantities with local or global significance, no change is needed to the management systems.",
      "zh-CHS": "本文件未介绍任何新的管理要素。也就是说，GMPLS协议可以以同样的方式继续使用标签，如果这些标签被视为具有本地或全球意义的不透明数量，则无需对管理系统进行任何更改。"
    },
    {
      "indent": 3,
      "text": "However, this document introduces some changes to the nature of a label that may require changes to management systems. Although Section 3.2 of [RFC3471] makes clear that a label is of variable length according to the type and that the type is supposed to be known a priori by both ends of a link, a management system is not guaranteed to be updated in step with upgrades or installations of new flexi-grid functionality in the network.",
      "zh-CHS": "但是，本文件对标签的性质进行了一些更改，可能需要更改管理系统。尽管[RFC3471]第3.2节明确指出，标签根据类型具有可变长度，并且链路两端应事先知道类型，但管理系统不保证随着网络中新flexi网格功能的升级或安装而同步更新。"
    },
    {
      "indent": 3,
      "text": "But, an implementation expecting a 32-bit lambda label would not fail ungracefully because the first 32 bits follow the format of [RFC6205]. It would look at theses labels and read but not recognize the new grid type value. It would then give up trying to parse the label and (presumably) the whole of the rest of the message.",
      "zh-CHS": "但是，期望32位lambda标签的实现不会失败，因为前32位遵循[RFC6205]的格式。它将查看这些标签并读取但无法识别新的网格类型值。然后，它将放弃解析标签和（大概）消息其余部分的尝试。"
    },
    {
      "indent": 3,
      "text": "The management system can be upgraded in two steps:",
      "zh-CHS": "管理系统可分两步升级："
    },
    {
      "indent": 3,
      "text": "- Firstly, systems that handle lambda labels as 32-bit quantities need to be updated to handle the increased length (64 bits) of labels as described in this document. These \"unknown\" 64-bit labels could be displayed as opaque 64-bit quantities and still add a lot of value for the operator (who might need to parse the label by hand). However, an implementation that already supports lambda labels as defined in [RFC6205] can safely continue to process the first 32 bits and display the fields defined in RFC 6205 as before, leaving just the second 32 bits as opaque data.",
      "zh-CHS": "- 首先，需要更新将lambda标签作为32位量处理的系统，以处理本文档中描述的增加长度（64位）的标签。这些“未知”的64位标签可以显示为不透明的64位数量，并且仍然为操作员（可能需要手动解析标签）添加了很多值。然而，已经支持[RFC6205]中定义的lambda标签的实现可以安全地继续处理前32位，并像以前一样显示RFC 6205中定义的字段，只留下第二个32位作为不透明数据。"
    },
    {
      "indent": 3,
      "text": "- Second, a more sophisticated upgrade to a management system would fully parse the flexi-grid labels and display them field by field as described in this document.",
      "zh-CHS": "- 其次，对管理系统进行更复杂的升级将完全解析flexi grid标签，并按本文档所述逐字段显示它们。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "[RFC6205] notes that the definition of a new label encoding does not introduce any new security considerations to [RFC3471] or [RFC3473]. That statement applies equally to this document.",
      "zh-CHS": "[RFC6205]注意到，新标签编码的定义并未对[RFC3471]或[RFC3473]引入任何新的安全注意事项。该声明同样适用于本文件。"
    },
    {
      "indent": 3,
      "text": "For a general discussion on MPLS and GMPLS-related security issues, see the MPLS/GMPLS security framework [RFC5920].",
      "zh-CHS": "有关MPLS和GMPLS相关安全问题的一般性讨论，请参阅MPLS/GMPLS安全框架[RFC5920]。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA maintains the \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Parameters\" registry that contains several subregistries.",
      "zh-CHS": "IANA维护“通用多协议标签交换（GMPLS）信令参数”注册表，该注册表包含多个子区域。"
    },
    {
      "indent": 0,
      "text": "7.1. Grid Subregistry",
      "section_title": true,
      "zh-CHS": "7.1. 网格分区"
    },
    {
      "indent": 3,
      "text": "IANA has allocated a new entry in this subregistry as follows:",
      "zh-CHS": "IANA已在该分区分配了一个新条目，如下所示："
    },
    {
      "indent": 3,
      "text": "Value   Grid                         Reference\n-----   -------------------------    ----------\n  3     ITU-T Flex                   RFC 7699",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7.2. DWDM Channel Spacing Subregistry",
      "section_title": true,
      "zh-CHS": "7.2. DWDM信道间隔分区"
    },
    {
      "indent": 3,
      "text": "IANA has allocated a new entry in this subregistry as follows:",
      "zh-CHS": "IANA已在该分区分配了一个新条目，如下所示："
    },
    {
      "indent": 3,
      "text": "Value   Channel Spacing (GHz)        Reference\n-----   -------------------------    ----------\n  5     6.25                         RFC 7699",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, DOI 10.17487/RFC3471, January 2003, <http://www.rfc-editor.org/info/rfc3471>.",
      "zh-CHS": "[RFC3471]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令功能描述”，RFC 3471，DOI 10.17487/RFC3471，2003年1月<http://www.rfc-editor.org/info/rfc3471>."
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, DOI 10.17487/RFC3473, January 2003, <http://www.rfc-editor.org/info/rfc3473>.",
      "zh-CHS": "[RFC3473]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令资源预留协议流量工程（RSVP-TE）扩展”，RFC 3473，DOI 10.17487/RFC3473，2003年1月<http://www.rfc-editor.org/info/rfc3473>."
    },
    {
      "indent": 3,
      "text": "[RFC6205] Otani, T., Ed., and D. Li, Ed., \"Generalized Labels for Lambda-Switch-Capable (LSC) Label Switching Routers\", RFC 6205, DOI 10.17487/RFC6205, March 2011, <http://www.rfc-editor.org/info/rfc6205>.",
      "zh-CHS": "[RFC6205]Otani，T.，Ed.，和D.Li，Ed.，“Lambda交换机功能（LSC）标签交换路由器的通用标签”，RFC 6205，DOI 10.17487/RFC6205，2011年3月<http://www.rfc-editor.org/info/rfc6205>."
    },
    {
      "indent": 3,
      "text": "[G.694.1] International Telecommunication Union, \"Spectral grids for WDM applications: DWDM frequency grid\", ITU-T Recommendation G.694.1, February 2012, <https://www.itu.int/rec/T-REC-G.694.1/en>.",
      "zh-CHS": "[G.694.1]国际电信联盟，“WDM应用的频谱网格：DWDM频率网格”，ITU-T建议G.694.1，2012年2月<https://www.itu.int/rec/T-REC-G.694.1/en>."
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3945] Mannie, E., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Architecture\", RFC 3945, DOI 10.17487/RFC3945, October 2004, <http://www.rfc-editor.org/info/rfc3945>.",
      "zh-CHS": "[RFC3945]Mannie，E.，Ed.“通用多协议标签交换（GMPLS）体系结构”，RFC 3945，DOI 10.17487/RFC3945，2004年10月<http://www.rfc-editor.org/info/rfc3945>."
    },
    {
      "indent": 3,
      "text": "[RFC4606] Mannie, E. and D. Papadimitriou, \"Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control\", RFC 4606, DOI 10.17487/RFC4606, August 2006, <http://www.rfc-editor.org/info/rfc4606>.",
      "zh-CHS": "[RFC4606]Mannie，E.和D.Papadimitriou，“同步光网络（SONET）和同步数字体系（SDH）控制的通用多协议标签交换（GMPLS）扩展”，RFC 4606，DOI 10.17487/RFC4606，2006年8月<http://www.rfc-editor.org/info/rfc4606>."
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, DOI 10.17487/RFC5920, July 2010, <http://www.rfc-editor.org/info/rfc5920>.",
      "zh-CHS": "[RFC5920]方，L.，编辑，“MPLS和GMPLS网络的安全框架”，RFC 5920，DOI 10.17487/RFC5920，2010年7月<http://www.rfc-editor.org/info/rfc5920>."
    },
    {
      "indent": 3,
      "text": "[RFC6344] Bernstein, G., Ed., Caviglia, D., Rabbat, R., and H. van Helvoort, \"Operating Virtual Concatenation (VCAT) and the Link Capacity Adjustment Scheme (LCAS) with Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 6344, DOI 10.17487/RFC6344, August 2011, <http://www.rfc-editor.org/info/rfc6344>.",
      "zh-CHS": "[RFC6344]Bernstein，G.，Ed.，Caviglia，D.，Rabbat，R.，和H.van Helvoort，“操作虚拟连接（VCAT）和带有通用多协议标签交换（GMPLS）的链路容量调整方案（LCAS）”，RFC 6344，DOI 10.17487/RFC6344，2011年8月<http://www.rfc-editor.org/info/rfc6344>."
    },
    {
      "indent": 3,
      "text": "[RFC7139] Zhang, F., Ed., Zhang, G., Belotti, S., Ceccarelli, D., and K. Pithewan, \"GMPLS Signaling Extensions for Control of Evolving G.709 Optical Transport Networks\", RFC 7139, DOI 10.17487/RFC7139, March 2014, <http://www.rfc-editor.org/info/rfc7139>.",
      "zh-CHS": "[RFC7139]Zhang，F.，Ed.，Zhang，G.，Belotti，S.，Ceccarelli，D.，和K.Pithewan，“用于控制演进中的G.709光传输网络的GMPLS信令扩展”，RFC 7139，DOI 10.17487/RFC7139，2014年3月<http://www.rfc-editor.org/info/rfc7139>."
    },
    {
      "indent": 3,
      "text": "[RFC7698] Gonzalez de Dios, O., Ed., Casellas, R., Ed., Zhang, F., Fu., X., Ceccarelli, D., and I. Hussain, \"Framework and Requirements for GMPLS-Based Control of Flexi-Grid Dense Wavelength Division Multiplexing (DWDM) Networks\", RFC 7698, DOI 10.17487/RFC7698, November 2015, <http://www.rfc-editor.org/info/rfc7698>.",
      "zh-CHS": "[RFC7698]Gonzalez de Dios，O.，Ed.，Casellas，R.，Ed.，Zhang，F.，Fu.，X.，Ceccarelli，D.，和I.Hussain，“基于GMPLS的灵活网格密集波分复用（DWDM）网络控制框架和要求”，RFC 7698，DOI 10.17487/RFC7698，2015年11月<http://www.rfc-editor.org/info/rfc7698>."
    },
    {
      "indent": 3,
      "text": "[G.671] International Telecommunication Union, \"Transmission characteristics of optical components and subsystems\", ITU-T Recommendation G.671, February 2012, <https://www.itu.int/rec/T-REC-G.671/en>.",
      "zh-CHS": "[G.671]国际电信联盟，“光学元件和子系统的传输特性”，ITU-T建议G.671，2012年2月<https://www.itu.int/rec/T-REC-G.671/en>."
    },
    {
      "indent": 3,
      "text": "[G.694.2] International Telecommunication Union, \"Spectral grids for WDM applications: CWDM wavelength grid\", ITU-T Recommendation G.694.2, December 2003, <https://www.itu.int/rec/T-REC-G.694.2/en>.",
      "zh-CHS": "[G.694.2]国际电信联盟，“WDM应用的频谱网格：CWDM波长网格”，ITU-T建议G.694.2，2003年12月<https://www.itu.int/rec/T-REC-G.694.2/en>."
    },
    {
      "indent": 3,
      "text": "[FLEXRSVP] Zhang, F., Zhang, X., Farrel, A., Gonzalez de Dios, O., and D. Ceccarelli, \"RSVP-TE Signaling Extensions in support of Flexible Grid\", Work in Progress, draft-ietf-ccamp-flexible-grid-rsvp-te-ext-03, August 2015.",
      "zh-CHS": "[FLEXRSVP]Zhang，F.，Zhang，X.，Farrel，A.，Gonzalez de Dios，O.，和D.Ceccarelli，“支持灵活电网的RSVP-TE信令扩展”，正在进行的工作，草稿-ietf-ccamp-Flexible-Grid-RSVP-TE-ext-032015年8月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Flexi-Grid Example",
      "section_title": true,
      "zh-CHS": "附录A.柔性网格示例"
    },
    {
      "indent": 3,
      "text": "Consider a fragment of an optical LSP between node A and node B using the flexible grid. Suppose that the LSP on this hop is formed:",
      "zh-CHS": "使用柔性网格考虑节点A和节点B之间的光学LSP片段。假设此跃点上的LSP已形成："
    },
    {
      "indent": 3,
      "text": "- using the ITU-T Flexi-Grid - the nominal central frequency of the slot is 193.05 THz - the nominal central frequency granularity is 6.25 GHz - the slot width is 50 GHz.",
      "zh-CHS": "- 使用ITU-T Flexi网格-插槽的标称中心频率为193.05太赫兹-标称中心频率粒度为6.25 GHz-插槽宽度为50 GHz。"
    },
    {
      "indent": 3,
      "text": "In this case, the label representing the switchable quantity that is the flexi-grid quantity is encoded as described in Section 4.1 with the following parameter settings. The label can be used in signaling or in management protocols to describe the LSP.",
      "zh-CHS": "在这种情况下，代表可切换数量的标签（即灵活网格数量）按照第4.1节所述，使用以下参数设置进行编码。标签可用于信令或管理协议中，以描述LSP。"
    },
    {
      "indent": 6,
      "text": "Grid = 3 : ITU-T Flexi-Grid",
      "zh-CHS": "网格=3:ITU-T Flexi网格"
    },
    {
      "indent": 6,
      "text": "C.S. = 5 : 6.25 GHz nominal central frequency granularity",
      "zh-CHS": "C.S.=5:6.25 GHz标称中心频率粒度"
    },
    {
      "indent": 6,
      "text": "Identifier = local value indicating the laser in use",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "n = -8 :",
      "zh-CHS": "n=-8："
    },
    {
      "indent": 10,
      "text": "Frequency (THz) = 193.1 THz + n * frequency granularity (THz)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "193.05 (THz) = 193.1 (THz) + n * 0.00625 (THz)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "n = (193.05 - 193.1) / 0.00625 = -8",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "m = 4 :",
      "zh-CHS": "m=4："
    },
    {
      "indent": 10,
      "text": "Slot Width (GHz) = 12.5 GHz * m",
      "zh-CHS": "槽宽（GHz）=12.5 GHz*m"
    },
    {
      "indent": 10,
      "text": "50 (GHz) = 12.5 (GHz) * m",
      "zh-CHS": "50（千兆赫）=12.5（千兆赫）*m"
    },
    {
      "indent": 10,
      "text": "m = 50 / 12.5 = 4",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "This work was supported in part by the FP-7 IDEALIST project under grant agreement number 317999.",
      "zh-CHS": "这项工作部分得到了FP-7理想主义项目的支持，该项目的赠款协议编号为317999。"
    },
    {
      "indent": 3,
      "text": "Very many thanks to Lou Berger for discussions of labels of more than 32 bits. Many thanks to Sergio Belotti and Pietro Vittorio Grandi for their support of this work. Thanks to Gabriele Galimberti for discussion of the size of the \"m\" field, and to Iftekhar Hussain for discussion of composite labels. Robert Sparks, Carlos Pignataro, and Paul Wouters provided review comments during IETF Last Call.",
      "zh-CHS": "非常感谢Lou Berger对32位以上标签的讨论。非常感谢塞尔吉奥·贝洛蒂和彼得罗·维托里奥·格兰迪对这项工作的支持。感谢Gabriele Galimberti对“m”字段大小的讨论，以及Iftekhar Hussain对复合标签的讨论。Robert Sparks、Carlos Pignataro和Paul Wouters在IETF上次通话中提供了评论。"
    },
    {
      "indent": 3,
      "text": "The Vancouver 2012 Pool Party drove early discussions and rough consensus. It comprised: Dieter Beller, Ramon Casellas, Daniele Ceccarelli, Oscar Gonzalez de Dios, Iftekhar Hussain, Cyril Margaria, Lyndon Ong, Fatai Zhang, and Adrian Farrel.",
      "zh-CHS": "温哥华2012泳池派对推动了早期讨论和初步共识。其中包括：迪特尔·贝勒、拉蒙·卡塞拉斯、丹尼尔·塞卡雷利、奥斯卡·冈萨雷斯·德迪奥斯、伊夫特哈尔·侯赛因、西里尔·玛格丽亚、林登·翁、张法泰和阿德里安·法雷尔。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "zh-CHS": "贡献者"
    },
    {
      "indent": 3,
      "text": "Zhang Fei Huawei Technologies Email: zhangfei7@huawei.com",
      "zh-CHS": "张飞华为技术电子邮件：zhangfei7@huawei.com"
    },
    {
      "indent": 3,
      "text": "Ramon Casellas CTTC Email: ramon.casellas@cttc.es",
      "zh-CHS": "Ramon Casellas CTTC电子邮件：Ramon。casellas@cttc.es"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Old Dog Consulting Email: adrian@olddog.co.uk",
      "zh-CHS": "Adrian Farrel老狗咨询电子邮件：adrian@olddog.co.uk"
    },
    {
      "indent": 3,
      "text": "Daniel King Old Dog Consulting Email: daniel@olddog.co.uk",
      "zh-CHS": "Daniel King老狗咨询电子邮件：daniel@olddog.co.uk"
    },
    {
      "indent": 3,
      "text": "Yao Li Nanjing University Email: wsliguotou@hotmail.com",
      "zh-CHS": "姚莉南京大学电子邮件：wsliguotou@hotmail.com"
    },
    {
      "indent": 3,
      "text": "Fatai Zhang Huawei Technologies Email: zhangfatai@huawei.com",
      "zh-CHS": "华为技术有限公司电子邮件：zhangfatai@huawei.com"
    }
  ]
}