{
  "title": {
    "text": "RFC 7026: Retiring TLVs from the Associated Channel Header of the MPLS Generic Associated Channel",
    "zh-CHS": "RFC 7026"
  },
  "number": 7026,
  "created_at": "2021-11-01 16:47:24.014234+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Farrel\nRequest for Comments: 7026                              Juniper Networks\nUpdates: 5586                                                  S. Bryant\nCategory: Standards Track                                  Cisco Systems\nISSN: 2070-1721                                           September 2013",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Retiring TLVs from the Associated Channel Header of the MPLS Generic Associated Channel",
      "zh-CHS": "从MPLS通用关联通道的关联通道标头停用TLV"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The MPLS Generic Associated Channel (G-ACh) is a generalization of the applicability of the pseudowire (PW) Associated Channel Header (ACH). RFC 5586 defines the concept of TLV constructs that can be carried in messages on the G-ACh by placing them in the ACH between the fixed header fields and the G-ACh message. These TLVs are called ACH TLVs",
      "zh-CHS": "MPLS通用关联信道（G-ACh）是伪线（PW）关联信道头（ACh）适用性的推广。RFC 5586定义了TLV构造的概念，通过将它们放置在固定头字段和G-ACh消息之间的ACh中，TLV构造可以在G-ACh上的消息中携带。这些TLV称为ACH TLV"
    },
    {
      "indent": 3,
      "text": "No Associated Channel Type yet defined uses an ACH TLV. Furthermore, it is believed that handling TLVs in hardware introduces significant problems to the fast path, and since G-ACh messages are intended to be processed substantially in hardware, the use of ACH TLVs is undesirable.",
      "zh-CHS": "尚未定义使用ACH TLV的关联通道类型。此外，相信在硬件中处理tlv会给快速路径带来重大问题，并且由于G-ACh消息打算基本上在硬件中处理，因此使用ACh tlv是不可取的。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 5586 by retiring ACH TLVs and removing the associated registry.",
      "zh-CHS": "本文档通过停用ACH TLV并删除相关注册表来更新RFC 5586。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7026.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7026."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2013 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "1. Introduction and Scope",
      "section_title": true,
      "zh-CHS": "1. 导言和范围"
    },
    {
      "indent": 3,
      "text": "RFC 4385 [RFC4385] says that if the first nibble of a PW packet carried over an MPLS network has a value of 1, then the packet starts with a specific header format called the Pseudowire Associated Channel Header (PWACH) or more generally known as the ACH. This mechanism creates an Associated Channel that is a message channel associated with a specific pseudowire (PW).",
      "zh-CHS": "RFC 4385[RFC4385]指出，如果通过MPLS网络承载的PW数据包的第一个半字节的值为1，则该数据包以称为伪线相关信道报头（PWACH）或更一般地称为ACH的特定报头格式开始。此机制创建一个关联通道，该通道是与特定伪线（PW）关联的消息通道。"
    },
    {
      "indent": 3,
      "text": "The applicability of the ACH is generalized in RFC 5586 [RFC5586] to define the MPLS Generic Associated Channel (G-ACh). This creates a common encapsulation header for control channel messages associated with MPLS Sections, Label Switching Paths (LSPs), and PWs.",
      "zh-CHS": "在RFC 5586[RFC5586]中对ACH的适用性进行了概括，以定义MPLS通用关联信道（G-ACH）。这将为与MPLS部分、标签交换路径（LSP）和PWs关联的控制通道消息创建公共封装头。"
    },
    {
      "indent": 3,
      "text": "As part of making the ACH fully generic, RFC 5586 defines ACH TLV constructs. According to RFC 5586:",
      "zh-CHS": "作为使ACH完全通用的一部分，RFC5586定义了ACH TLV构造。根据RFC 5586："
    },
    {
      "indent": 5,
      "text": "In some applications of the generalized associated control channel, it is necessary to include one or more ACH TLVs to provide additional context information to the G-ACh packet.",
      "zh-CHS": "在广义关联控制信道的一些应用中，有必要包括一个或多个ACH tlv以向G-ACH分组提供额外的上下文信息。"
    },
    {
      "indent": 3,
      "text": "RFC 5586 goes on to say:",
      "zh-CHS": "RFC 5586接着说："
    },
    {
      "indent": 5,
      "text": "If the G-ACh message MAY be preceded by one or more ACH TLVs, then this MUST be explicitly specified in the definition of an ACH Channel Type.",
      "zh-CHS": "如果G-ACh消息前面可能有一个或多个ACh TLV，则必须在ACh通道类型的定义中明确指定。"
    },
    {
      "indent": 3,
      "text": "However, at the time of writing, of the 18 ACH Channel Types defined, none allows the use of ACH TLVs [IANA-ACH]. At the time of writing, there are no unexpired Internet-Drafts that utilize ACH TLVs.",
      "zh-CHS": "然而，在编写本文时，在定义的18种ACH通道类型中，没有一种允许使用ACH TLV[IANA-ACH]。在撰写本文时，没有使用ACH TLV的未过期互联网草案。"
    },
    {
      "indent": 3,
      "text": "Furthermore, G-ACh packets are intended to be substantially processed in hardware; however, processing TLVs in hardware can be difficult because of the unpredictable formats and lengths that they introduce to the normal ACH format.",
      "zh-CHS": "此外，G-ACh分组打算基本上在硬件中处理；然而，在硬件中处理TLV可能会很困难，因为它们会引入不可预测的格式和长度到正常的ACH格式。"
    },
    {
      "indent": 3,
      "text": "This document states that ACH TLVs, as specified in RFC 5586, are not useful and might be harmful. It updates RFC 5586 by deprecating the ACH TLV and updating the associated IANA registries as described in Section 4 of this document. This document makes no comment about the use of TLVs in other places. In particular, proposals to use TLVs within ACH messages or as an appendage to ACH messages, are not in scope of this document.",
      "zh-CHS": "本文件规定，RFC 5586中规定的ACH TLV无效，可能有害。如本文件第4节所述，它通过弃用ACH TLV和更新相关IANA注册表来更新RFC 5586。本文件对TLV在其他地方的使用不作任何评论。特别是，在ACH消息中使用TLV或作为ACH消息附件的建议不在本文档的范围内。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification of Requirements",
      "section_title": true,
      "zh-CHS": "1.1. 需求说明"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Update to RFC 5586",
      "section_title": true,
      "zh-CHS": "2. 更新至RFC5586"
    },
    {
      "indent": 3,
      "text": "Section 3 of RFC 5586 is deleted.",
      "zh-CHS": "删除RFC 5586第3节。"
    },
    {
      "indent": 3,
      "text": "References to ACH TLVs in Section 4 of RFC 5586 should also be disregarded. Note that the text in Section 4 currently uses phrases like \"ACH TLV(s), if present\" so, with the removal of Section 3 that used to define ACH TLVs, they will not be present.",
      "zh-CHS": "RFC 5586第4节中对ACH TLV的引用也应忽略不计。请注意，第4节中的文本目前使用了类似“ACH TLV，如果存在”的短语，因此，删除用于定义ACH TLV的第3节后，它们将不存在。"
    },
    {
      "indent": 0,
      "text": "3. Implication for the ACH",
      "section_title": true,
      "zh-CHS": "3. ACH的含义"
    },
    {
      "indent": 3,
      "text": "A G-ACh message MUST NOT be preceded by an ACH TLV.",
      "zh-CHS": "G-ACh消息前面不得有ACh TLV。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document details two changes to the IANA registries.",
      "zh-CHS": "本文件详细说明了IANA注册的两项变更。"
    },
    {
      "indent": 0,
      "text": "4.1. Associated Channel Header TLV Registry",
      "section_title": true,
      "zh-CHS": "4.1. 关联的通道头TLV注册表"
    },
    {
      "indent": 3,
      "text": "The \"Pseudowire Name Spaces (PWE3)\" registry has a subregistry called the \"Associated Channel Header TLV Registry\". IANA has entirely deleted this subregistry but has left a tombstone record in the top-level list of registries that says:",
      "zh-CHS": "“伪线名称空间（PWE3）”注册表有一个子注册表，称为“关联通道头TLV注册表”。IANA已经完全删除了该分区，但在顶级登记册列表中留下了一个墓碑记录，上面写着："
    },
    {
      "indent": 5,
      "text": "Associated Channel Header TLV Registry (DELETED)",
      "zh-CHS": "关联的通道标头TLV注册表（已删除）"
    },
    {
      "indent": 5,
      "text": "Reference [RFC5586] [RFC7026]",
      "zh-CHS": "参考文献[RFC5586][RFC7026]"
    },
    {
      "indent": 0,
      "text": "4.2. Pseudowire Associated Channel Types Registry",
      "section_title": true,
      "zh-CHS": "4.2. 伪线关联通道类型注册表"
    },
    {
      "indent": 5,
      "text": "The \"Pseudowire Name Spaces (PWE3)\" registry has a subregistry called the \"Pseudowire Associated Channel Types\" registry. This subregistry previously included a column marked \"TLV Follows\". IANA has entirely deleted this column leaving no record.",
      "zh-CHS": "“伪线名称空间（PWE3）”注册表有一个子区，称为“伪线关联通道类型”注册表。该分区域以前包括一列标记为“TLV如下”。IANA已完全删除此列，未留下任何记录。"
    },
    {
      "indent": 0,
      "text": "5. Manageability Considerations",
      "section_title": true,
      "zh-CHS": "5. 可管理性考虑"
    },
    {
      "indent": 5,
      "text": "This document will have no impact on network or device manageability because there are no ACH Types that allow the use of TLVs. The document removes a feature that might have been used to enhance management messages, and especially Operations, Management, and Administration (OAM) messages. However, given the considerable experience in defining MPLS OAM messages in the last few years, it would appear that this feature is not useful.",
      "zh-CHS": "本文档不会影响网络或设备的可管理性，因为没有允许使用TLV的ACH类型。该文档删除了可能用于增强管理消息，特别是操作、管理和管理（OAM）消息的功能。然而，考虑到过去几年在定义MPLS OAM消息方面的丰富经验，该功能似乎没有用处。"
    },
    {
      "indent": 5,
      "text": "It is possible that packet sniffers that have already been implemented will look for ACH TLVs. The deletion of the construct will not have a negative impact.",
      "zh-CHS": "已经实现的数据包嗅探器可能会查找ACH TLV。删除构造不会产生负面影响。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 5,
      "text": "Deleting the ACH TLV has a marginal positive effect on security because it removes a feature that might have been used as an attack vector to carry false information or to bloat G-ACh messages.",
      "zh-CHS": "删除ACTLV对安全性具有边际积极影响，因为它移除了可能用作攻击向量以携带虚假信息或膨胀G-ACH消息的特征。"
    },
    {
      "indent": 5,
      "text": "On the other hand, it had been suggested that the ACH TLV could have been used to carry security parameters to secure the messages on the G-ACh in a generic way. However, no mechanisms have been proposed at the time of writing, and it has generally been considered that it is the responsibility of the specification that defines G-ACh messages to consider the security requirements of those messages that may be different for the different applications.",
      "zh-CHS": "另一方面，有人建议可以使用ACH TLV携带安全参数，以通用方式保护G-ACH上的消息。然而，在编写时没有提出机制，并且一般认为，规范的职责是定义G-ACH消息来考虑那些对于不同应用可能不同的消息的安全要求。"
    },
    {
      "indent": 5,
      "text": "Otherwise, this document has no implications for security.",
      "zh-CHS": "否则，本文件对安全性没有影响。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 5,
      "text": "Thanks to Eric Osborne, Thomas Morin, Lizhong Jin, Greg Mirsky, Jia He, and Pearl Liang for suggestions to improve the text.",
      "zh-CHS": "感谢Eric Osborne、Thomas Morin、Lizhong Jin、Greg Mirsky、Jia He和Pearl Liang为改进文本提出的建议。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4385] Bryant, S., Swallow, G., Martini, L., and D. McPherson, \"Pseudowire Emulation Edge-to-Edge (PWE3) Control Word for Use over an MPLS PSN\", RFC 4385, February 2006.",
      "zh-CHS": "[RFC4385]Bryant，S.，Swallow，G.，Martini，L.，和D.McPherson，“用于MPLS PSN的伪线仿真边到边（PWE3）控制字”，RFC 43852006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5586] Bocci, M., Ed., Vigoureux, M., Ed., and S. Bryant, Ed., \"MPLS Generic Associated Channel\", RFC 5586, June 2009.",
      "zh-CHS": "[RFC5586]Bocci，M.，Ed.，Vigoureux，M.，Ed.，和S.Bryant，Ed.，“MPLS通用关联信道”，RFC 55862009年6月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[IANA-ACH] \"Pseudowire Associated Channel Types\", IANA,\n           <http://www.iana.org/assignments/pwe3-parameters>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Juniper Networks EMail: adrian@olddog.co.uk",
      "zh-CHS": "Adrian Farrel Juniper Networks电子邮件：adrian@olddog.co.uk"
    },
    {
      "indent": 3,
      "text": "Stewart Bryant Cisco Systems EMail: stbryant@cisco.com",
      "zh-CHS": "Stewart Bryant Cisco Systems电子邮件：stbryant@cisco.com"
    }
  ]
}