{
  "title": {
    "text": "RFC 7981: IS-IS Extensions for Advertising Router Information",
    "zh-CHS": "RFC 7981"
  },
  "number": 7981,
  "created_at": "2021-11-01 12:22:58.055568+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       L. Ginsberg\nRequest for Comments: 7981                                    S. Previdi\nObsoletes: 4971                                            Cisco Systems\nCategory: Standards Track                                        M. Chen\nISSN: 2070-1721                             Huawei Technologies Co., Ltd\n                                                            October 2016",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "IS-IS Extensions for Advertising Router Information",
      "zh-CHS": "用于广告路由器信息的IS-IS扩展"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a new optional Intermediate System to Intermediate System (IS-IS) TLV named CAPABILITY, formed of multiple sub-TLVs, which allows a router to announce its capabilities within an IS-IS level or the entire routing domain. This document obsoletes RFC 4971.",
      "zh-CHS": "本文档定义了一个新的可选中间系统到中间系统（IS-IS）TLV命名功能，该功能由多个子TLV组成，允许路由器在IS-IS级别或整个路由域内宣布其功能。本文件淘汰RFC 4971。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7981.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7981."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Requirements Language ......................................3\n2. IS-IS Router CAPABILITY TLV .....................................3\n3. Elements of Procedure ...........................................4\n4. Interoperability with Routers Not Supporting the IS-IS Router\n   CAPABILITY TLV ..................................................6\n5. Security Considerations .........................................6\n6. IANA Considerations .............................................7\n7. References ......................................................7\n   7.1. Normative References .......................................7\n   7.2. Informative References .....................................8\nAppendix A.  Changes to RFC 4971 ...................................9\nAcknowledgements ..................................................10\nAuthors' Addresses ................................................10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "There are several situations where it is useful for the IS-IS [ISO10589] [RFC1195] routers to learn the capabilities of the other routers of their IS-IS level, area, or routing domain. For the sake of illustration, three examples related to MPLS Traffic Engineering (TE) are described here:",
      "zh-CHS": "is-is[ISO10589][RFC1195]路由器了解其is-is级别、区域或路由域的其他路由器的能力时，有几种情况是有用的。为了说明，这里描述了与MPLS流量工程（TE）相关的三个示例："
    },
    {
      "indent": 3,
      "text": "1. Mesh-group: The setting up of a mesh of TE Label Switched Paths (LSPs) [RFC5305] requires some significant configuration effort. [RFC4972] proposes an auto-discovery mechanism whereby every Label Switching Router (LSR) of a mesh advertises its mesh-group membership by means of IS-IS extensions.",
      "zh-CHS": "1. 网格组：设置TE标签交换路径（LSP）网格[RFC5305]需要一些重要的配置工作。[RFC4972]提出了一种自动发现机制，其中网状网的每个标签交换路由器（LSR）通过IS-IS扩展来公布其网状网组成员资格。"
    },
    {
      "indent": 3,
      "text": "2. Point-to-Multipoint TE LSP (RFC4875): A specific sub-TLV [RFC5073] allows an LSR to advertise its Point-to-Multipoint capabilities ([RFC4875] and [RFC4461]).",
      "zh-CHS": "2. 点对多点TE LSP（RFC4875）：特定的子TLV[RFC5073]允许LSR公布其点对多点能力（[RFC4875]和[RFC4461]）。"
    },
    {
      "indent": 3,
      "text": "3. Inter-area traffic engineering: Advertisement of the IPv4 and/or the IPv6 Traffic Engineering Router IDs.",
      "zh-CHS": "3. 区域间流量工程：公布IPv4和/或IPv6流量工程路由器ID。"
    },
    {
      "indent": 3,
      "text": "The use of IS-IS for Path Computation Element (PCE) discovery may also be considered and will be discussed in the PCE WG.",
      "zh-CHS": "也可考虑使用IS-IS进行路径计算元素（PCE）发现，并将在PCE工作组中讨论。"
    },
    {
      "indent": 3,
      "text": "The capabilities mentioned above require the specification of new sub-TLVs carried within the IS-IS Router CAPABILITY TLV defined in this document.",
      "zh-CHS": "上述能力要求本文件中定义的IS-IS路由器能力TLV中携带的新子TLV的规范。"
    },
    {
      "indent": 3,
      "text": "Note that the examples above are provided for the sake of illustration. This document proposes a generic capability advertising mechanism that is not limited to MPLS Traffic Engineering.",
      "zh-CHS": "请注意，以上示例仅用于说明。本文档提出了一种通用的能力广告机制，该机制不限于MPLS流量工程。"
    },
    {
      "indent": 3,
      "text": "This document defines a new optional IS-IS TLV named CAPABILITY, formed of multiple sub-TLVs, which allows a router to announce its capabilities within an IS-IS level or the entire routing domain. The applications mentioned above require the specification of new sub-TLVs carried within the IS-IS Router CAPABILITY TLV defined in this document.",
      "zh-CHS": "本文档定义了一个新的可选IS-IS TLV命名功能，该功能由多个子TLV组成，允许路由器在IS-IS级别或整个路由域内宣布其功能。上述应用需要本文件中定义的IS-IS路由器能力TLV中携带的新子TLV的规范。"
    },
    {
      "indent": 3,
      "text": "Definition of these sub-TLVs is outside the scope of this document.",
      "zh-CHS": "这些子TLV的定义不在本文件范围内。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "1.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. IS-IS Router CAPABILITY TLV",
      "section_title": true,
      "zh-CHS": "2. IS-IS路由器能力TLV"
    },
    {
      "indent": 3,
      "text": "The IS-IS Router CAPABILITY TLV is composed of 1 octet for the type, 1 octet that specifies the number of bytes in the value field, and a variable length value field that starts with 4 octets of Router ID, indicating the source of the TLV, followed by 1 octet of flags.",
      "zh-CHS": "IS-IS路由器功能TLV由1个八位字节（表示类型）、1个八位字节（指定值字段中的字节数）和一个可变长度值字段组成，该字段以4个八位字节的路由器ID开头，表示TLV的源，后跟1个八位字节的标志。"
    },
    {
      "indent": 3,
      "text": "A set of optional sub-TLVs may follow the flag field. Sub-TLVs are formatted as described in [RFC5305].",
      "zh-CHS": "标志字段后面可能有一组可选的子TLV。子TLV的格式如[RFC5305]所述。"
    },
    {
      "indent": 4,
      "text": "TYPE: 242 LENGTH: from 5 to 255 VALUE: Router ID (4 octets) Flags (1 octet) Set of optional sub-TLVs (0-250 octets)",
      "zh-CHS": "类型：242长度：从5到255值：路由器ID（4个八位字节）标志（1个八位字节）可选子TLV集（0-250个八位字节）"
    },
    {
      "indent": 4,
      "text": "Flags",
      "zh-CHS": "旗帜"
    },
    {
      "indent": 16,
      "text": "0 1 2 3 4 5 6 7\n+-+-+-+-+-+-+-+-+\n| Reserved  |D|S|\n+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Currently, two bit flags are defined.",
      "zh-CHS": "目前，定义了两位标志。"
    },
    {
      "indent": 3,
      "text": "S bit (0x01): If the S bit is set(1), the IS-IS Router CAPABILITY TLV MUST be flooded across the entire routing domain. If the S bit is not set(0), the TLV MUST NOT be leaked between levels. This bit MUST NOT be altered during the TLV leaking.",
      "zh-CHS": "S位（0x01）：如果设置了S位（1），则is-is路由器功能TLV必须覆盖整个路由域。如果未设置S位（0），则TLV不得在级别之间泄漏。TLV泄漏期间，不得更改该位。"
    },
    {
      "indent": 3,
      "text": "D bit (0x02): When the IS-IS Router CAPABILITY TLV is leaked from Level 2 (L2) to Level 1 (L1), the D bit MUST be set. Otherwise, this bit MUST be clear. IS-IS Router CAPABILITY TLVs with the D bit set MUST NOT be leaked from Level 1 to Level 2. This is to prevent TLV looping.",
      "zh-CHS": "D位（0x02）：当IS-IS路由器功能TLV从级别2（L2）泄漏到级别1（L1）时，必须设置D位。否则，该位必须是清晰的。具有D位设置的IS-IS路由器功能TLV不得从1级泄漏到2级。这是为了防止TLV循环。"
    },
    {
      "indent": 3,
      "text": "The IS-IS Router CAPABILITY TLV is OPTIONAL. As specified in Section 3, more than one IS-IS Router CAPABILITY TLV from the same source MAY be present.",
      "zh-CHS": "IS-IS路由器功能TLV是可选的。如第3节所述，可能存在来自同一来源的多个IS-IS路由器能力TLV。"
    },
    {
      "indent": 3,
      "text": "This document does not specify how an application may use the IS-IS Router CAPABILITY TLV, and such specification is outside the scope of this document.",
      "zh-CHS": "本文档未指定应用程序如何使用IS-IS路由器功能TLV，此类规范不在本文档范围内。"
    },
    {
      "indent": 0,
      "text": "3. Elements of Procedure",
      "section_title": true,
      "zh-CHS": "3. 程序要素"
    },
    {
      "indent": 3,
      "text": "The Router ID SHOULD be identical to the value advertised in the Traffic Engineering Router ID TLV [RFC5305]. If no Traffic Engineering Router ID is assigned, the Router ID SHOULD be identical to an IP Interface Address [RFC1195] advertised by the originating IS. If the originating node does not support IPv4, then the reserved value 0.0.0.0 MUST be used in the Router ID field, and the IPv6 TE Router ID sub-TLV [RFC5316] MUST be present in the TLV. IS-IS Router CAPABILITY TLVs that have a Router ID of 0.0.0.0 and do NOT have the IPv6 TE Router ID sub-TLV present MUST NOT be used.",
      "zh-CHS": "路由器ID应与流量工程路由器ID TLV[RFC5305]中公布的值相同。如果未分配流量工程路由器ID，则路由器ID应与发起is公布的IP接口地址[RFC1195]相同。如果发起节点不支持IPv4，则必须在路由器ID字段中使用保留值0.0.0.0，并且IPv6 TE路由器ID子TLV[RFC5316]必须存在于TLV中。不得使用路由器ID为0.0.0.0且不存在IPv6 TE路由器ID子TLV的IS-IS路由器功能TLV。"
    },
    {
      "indent": 3,
      "text": "When advertising capabilities with different flooding scopes, a router MUST originate a minimum of two IS-IS Router CAPABILITY TLVs, each TLV carrying the set of sub-TLVs with the same flooding scope. For instance, if a router advertises two sets of capabilities, C1 and C2, with an area/level scope and routing domain scope respectively, C1 and C2 being specified by their respective sub-TLV(s), the router will originate two IS-IS Router CAPABILITY TLVs:",
      "zh-CHS": "当使用不同泛洪作用域发布功能时，路由器必须至少发起两个IS-IS路由器功能TLV，每个TLV承载具有相同泛洪作用域的子TLV集。例如，如果路由器播发两组功能C1和C2，其区域/级别范围和路由域范围分别为C1和C2，C1和C2由各自的子TLV指定，则路由器将发起两个IS-IS路由器功能TLV："
    },
    {
      "indent": 3,
      "text": "o One IS-IS Router CAPABILITY TLV with the S flag cleared, carrying the sub-TLV(s) relative to C1. This IS-IS Router CAPABILITY TLV will not be leaked into another level.",
      "zh-CHS": "o 一个IS-IS路由器功能TLV清除S标志，携带相对于C1的子TLV。此IS-IS路由器功能TLV不会泄漏到另一个级别。"
    },
    {
      "indent": 3,
      "text": "o One IS-IS Router CAPABILITY TLV with the S flag set, carrying the sub-TLV(s) relative to C2. This IS-IS Router CAPABILITY TLV will be leaked into other IS-IS levels. When the TLV is leaked from Level 2 to Level 1, the D bit will be set in the Level 1 LSP advertisement.",
      "zh-CHS": "o 一个IS-IS路由器能力TLV设置了S标志，携带相对于C2的子TLV。此IS-IS路由器功能TLV将泄漏到其他IS-IS级别。当TLV从2级泄漏到1级时，将在1级LSP播发中设置D位。"
    },
    {
      "indent": 3,
      "text": "In order to prevent the use of stale IS-IS Router CAPABILITY TLVs, a system MUST NOT use an IS-IS Router CAPABILITY TLV present in an LSP of a system that is not currently reachable via Level x paths, where \"x\" is the level (1 or 2) in which the sending system advertised the TLV. This requirement applies regardless of whether or not the sending system is the originator of the IS-IS Router CAPABILITY TLV.",
      "zh-CHS": "In order to prevent the use of stale IS-IS Router CAPABILITY TLVs, a system MUST NOT use an IS-IS Router CAPABILITY TLV present in an LSP of a system that is not currently reachable via Level x paths, where \"x\" is the level (1 or 2) in which the sending system advertised the TLV. This requirement applies regardless of whether or not the sending system is the originator of the IS-IS Router CAPABILITY TLV.translate error, please retry"
    },
    {
      "indent": 3,
      "text": "When an IS-IS Router CAPABILITY TLV is not used, either due to a lack of reachability to the originating router or due to an unusable Router ID, note that leaking the IS-IS Router CAPABILITY TLV is one of the uses that is prohibited under these conditions.",
      "zh-CHS": "当IS-IS路由器能力TLV未被使用时，无论是由于无法到达原始路由器还是由于路由器ID不可用，请注意，泄漏IS-IS路由器能力TLV是这些情况下禁止的使用之一。"
    },
    {
      "indent": 6,
      "text": "Example: If Level 1 router A generates an IS-IS Router CAPABILITY TLV and floods it to two L1/L2 routers, S and T, they will flood it into the Level 2 domain. Now suppose the Level 1 area partitions, such that A and S are in one partition and T is in another. IP routing will still continue to work, but if A now issues a revised version of the CAP TLV, or decides to stop advertising it, S will follow suit, but without the above prohibition, T will continue to advertise the old version until the LSP times out.",
      "zh-CHS": "示例：如果1级路由器A生成IS-IS路由器能力TLV并将其洪泛到两个L1/L2路由器S和T，则它们将其洪泛到2级域。现在假设1级区域分区，A和S在一个分区中，T在另一个分区中。IP路由仍将继续工作，但如果A现在发布CAP TLV的修订版本，或决定停止发布，S将跟进，但在没有上述禁令的情况下，T将继续发布旧版本，直到LSP超时。"
    },
    {
      "indent": 6,
      "text": "Routers in other areas have to choose whether to trust T's copy of A's IS-IS Router CAPABILITY TLV or S's copy of A's IS-IS Router CAPABILITY TLV, and they have no reliable way to choose. By making sure that T stops leaking A's information, the possibility that other routers will use stale information from A is eliminated.",
      "zh-CHS": "其他地区的路由器必须选择是信任T的IS-IS路由器能力TLV副本，还是信任s的IS-IS路由器能力TLV副本，它们没有可靠的选择方法。通过确保T停止泄漏A的信息，消除了其他路由器使用A的过时信息的可能性。"
    },
    {
      "indent": 3,
      "text": "In IS-IS, the atomic unit of the update process is a TLV -- or more precisely, in the case of TLVs that allow multiple entries to appear in the value field (e.g., IS-neighbors), the atomic unit is an entry in the value field of a TLV. If an update to an entry in a TLV is advertised in an LSP fragment different from the LSP fragment associated with the old advertisement, the possibility exists that other systems can temporarily have either 0 copies of a particular advertisement or 2 copies of a particular advertisement, depending on the order in which new copies of the LSP fragment that had the old advertisement and the fragment that has the new advertisement arrive at other systems.",
      "zh-CHS": "在IS-IS中，更新过程的原子单位是TLV——或者更准确地说，在TLV允许多个条目出现在值字段（例如，IS邻居）中的情况下，原子单位是TLV的值字段中的条目。如果在不同于与旧播发相关联的LSP片段的LSP片段中播发对TLV中的条目的更新，则存在其他系统可以临时具有特定播发的0个副本或特定播发的2个副本的可能性，取决于具有旧广告的LSP片段的新副本和具有新广告的片段到达其他系统的顺序。"
    },
    {
      "indent": 3,
      "text": "Wherever possible, an implementation SHOULD advertise the update to an IS-IS Router CAPABILITY TLV in the same LSP fragment as the advertisement that it replaces. Where this is not possible, the two affected LSP fragments should be flooded as an atomic action.",
      "zh-CHS": "在可能的情况下，实现应在与其替换的公告相同的LSP片段中公告对IS-IS路由器功能TLV的更新。在不可能的情况下，两个受影响的LSP片段应作为原子动作被淹没。"
    },
    {
      "indent": 3,
      "text": "Systems that receive an update to an existing IS-IS Router CAPABILITY TLV can minimize the potential disruption associated with the update by employing a holddown time prior to processing the update so as to allow for the receipt of multiple LSP fragments associated with the same update prior to beginning processing.",
      "zh-CHS": "接收对现有IS-IS路由器能力TLV的更新的系统可以通过在处理更新之前采用抑制时间来最小化与更新相关联的潜在中断，从而允许在开始处理之前接收与相同更新相关联的多个LSP片段。"
    },
    {
      "indent": 3,
      "text": "Where a receiving system has two copies of an IS-IS Router CAPABILITY TLV from the same system that have conflicting information for a given sub-TLV, the procedure used to choose which copy shall be used is undefined.",
      "zh-CHS": "如果接收系统具有来自同一系统的IS-IS路由器能力TLV的两个副本，且该副本具有给定子TLV的冲突信息，则用于选择应使用哪个副本的程序未定义。"
    },
    {
      "indent": 0,
      "text": "4. Interoperability with Routers Not Supporting the IS-IS Router CAPABILITY TLV",
      "zh-CHS": "4. 与不支持IS-IS路由器功能TLV的路由器的互操作性"
    },
    {
      "indent": 3,
      "text": "Routers that do not support the IS-IS Router CAPABILITY TLV MUST silently ignore the TLV(s) and continue processing other TLVs in the same LSP. Routers that do not support specific sub-TLVs carried within an IS-IS Router CAPABILITY TLV MUST silently ignore the unsupported sub-TLVs and continue processing those sub-TLVs that are supported in the IS-IS Router CAPABILITY TLV. How partial support may impact the operation of the capabilities advertised within the IS-IS Router CAPABILITY TLV is outside the scope of this document.",
      "zh-CHS": "不支持IS-IS路由器功能TLV的路由器必须以静默方式忽略TLV，并继续在同一LSP中处理其他TLV。不支持IS-IS路由器功能TLV中携带的特定子TLV的路由器必须静默忽略不支持的子TLV，并继续处理IS-IS路由器功能TLV中支持的子TLV。部分支持如何影响IS-IS路由器功能TLV中公布的功能的运行超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "In order for IS-IS Router CAPABILITY TLVs with domain-wide scope originated by L1 routers to be flooded across the entire domain, at least one L1/L2 router in every area of the domain MUST support the Router CAPABILITY TLV.",
      "zh-CHS": "为了使L1路由器发起的具有域范围的IS-IS路由器能力TLV在整个域内泛滥，域的每个区域中至少有一个L1/L2路由器必须支持路由器能力TLV。"
    },
    {
      "indent": 3,
      "text": "If leaking of the IS-IS Router CAPABILITY TLV is required, the entire CAPABILITY TLV MUST be leaked into another level without change (except for changes to the TLV flags as noted in Section 2) even though it may contain some sub-TLVs that are unsupported by the router doing the leaking.",
      "zh-CHS": "如果IS-IS路由器功能TLV需要泄漏，则必须将整个功能TLV泄漏到另一个级别而不进行更改（第2节中所述的TLV标志更改除外），即使它可能包含一些进行泄漏的路由器不支持的子TLV。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Any new security issues raised by the procedures in this document depend upon the opportunity for LSPs to be snooped and modified, the ease/difficulty of which has not been altered. As the LSPs may now contain additional information regarding router capabilities, this new information would also become available to an attacker. Specifications based on this mechanism need to describe the security considerations around the disclosure and modification of their",
      "zh-CHS": "本文件中程序提出的任何新安全问题取决于LSP被窥探和修改的机会，其难易程度尚未改变。由于LSP现在可能包含有关路由器功能的其他信息，因此攻击者也可以使用这些新信息。基于这一机制的规范需要描述在披露和修改它们的安全机制时的安全注意事项"
    },
    {
      "indent": 3,
      "text": "information. Note that an integrity mechanism, such as the ones defined in [RFC5304] or [RFC5310], should be applied if there is high risk resulting from modification of capability information.",
      "zh-CHS": "信息注意，如果修改能力信息导致高风险，则应采用完整性机制，如[RFC5304]或[RFC5310]中定义的机制。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA originally assigned a TLV codepoint for the IS-IS Router CAPABILITY TLV (242) as described in RFC 4971. IANA has updated this entry in the \"TLV Codepoints Registry\" to refer to this document.",
      "zh-CHS": "IANA最初为IS-IS路由器能力TLV（242）分配了一个TLV码点，如RFC 4971所述。IANA已更新“TLV代码点注册表”中的该条目，以参考本文档。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISO10589] International Organization for Standardization, \"Information technology -- Telecommunications and information exchange between systems -- Intermediate System to Intermediate System intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service (ISO 8473)\", ISO/IEC 10589:2002, Second Edition, November 2002.",
      "zh-CHS": "[ISO10589]国际标准化组织，“信息技术——系统间电信和信息交换——与提供无连接模式网络服务协议一起使用的中间系统到中间系统域内路由信息交换协议（ISO 8473）”，ISO/IEC 10589:2002，第二版，2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC1195] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, DOI 10.17487/RFC1195, December 1990, <http://www.rfc-editor.org/info/rfc1195>.",
      "zh-CHS": "[RFC1195]Callon，R.“OSI IS-IS在TCP/IP和双环境中的路由使用”，RFC 1195，DOI 10.17487/RFC1195，1990年12月<http://www.rfc-editor.org/info/rfc1195>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC5073] Vasseur, J., Ed. and J. Le Roux, Ed., \"IGP Routing Protocol Extensions for Discovery of Traffic Engineering Node Capabilities\", RFC 5073, DOI 10.17487/RFC5073, December 2007, <http://www.rfc-editor.org/info/rfc5073>.",
      "zh-CHS": "[RFC5073]Vasseur，J.，Ed.和J.Le Roux，Ed.，“发现流量工程节点能力的IGP路由协议扩展”，RFC 5073，DOI 10.17487/RFC5073，2007年12月<http://www.rfc-editor.org/info/rfc5073>."
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, DOI 10.17487/RFC5304, October 2008, <http://www.rfc-editor.org/info/rfc5304>.",
      "zh-CHS": "[RFC5304]Li，T.和R.Atkinson，“IS-IS加密认证”，RFC 5304，DOI 10.17487/RFC5304，2008年10月<http://www.rfc-editor.org/info/rfc5304>."
    },
    {
      "indent": 3,
      "text": "[RFC5305] Li, T. and H. Smit, \"IS-IS Extensions for Traffic Engineering\", RFC 5305, DOI 10.17487/RFC5305, October 2008, <http://www.rfc-editor.org/info/rfc5305>.",
      "zh-CHS": "[RFC5305]Li，T.和H.Smit，“交通工程的IS-IS扩展”，RFC 5305，DOI 10.17487/RFC5305，2008年10月<http://www.rfc-editor.org/info/rfc5305>."
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, DOI 10.17487/RFC5310, February 2009, <http://www.rfc-editor.org/info/rfc5310>.",
      "zh-CHS": "[RFC5310]Bhatia，M.，Manral，V.，Li，T.，Atkinson，R.，White，R.，和M.Fanto，“IS-IS通用密码认证”，RFC 5310，DOI 10.17487/RFC5310，2009年2月<http://www.rfc-editor.org/info/rfc5310>."
    },
    {
      "indent": 3,
      "text": "[RFC5316] Chen, M., Zhang, R., and X. Duan, \"ISIS Extensions in Support of Inter-Autonomous System (AS) MPLS and GMPLS Traffic Engineering\", RFC 5316, DOI 10.17487/RFC5316, December 2008, <http://www.rfc-editor.org/info/rfc5316>.",
      "zh-CHS": "[RFC5316]Chen，M.，Zhang，R.，和X.Duan，“支持自治系统间MPLS和GMPLS流量工程的ISIS扩展”，RFC 5316，DOI 10.17487/RFC5316，2008年12月<http://www.rfc-editor.org/info/rfc5316>."
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC4461] Yasukawa, S., Ed., \"Signaling Requirements for Point-to-Multipoint Traffic-Engineered MPLS Label Switched Paths (LSPs)\", RFC 4461, DOI 10.17487/RFC4461, April 2006, <http://www.rfc-editor.org/info/rfc4461>.",
      "zh-CHS": "[RFC4461]Yasukawa，S.，Ed.“点对多点流量工程MPLS标签交换路径（LSP）的信令要求”，RFC 4461，DOI 10.17487/RFC4461，2006年4月<http://www.rfc-editor.org/info/rfc4461>."
    },
    {
      "indent": 3,
      "text": "[RFC4875] Aggarwal, R., Ed., Papadimitriou, D., Ed., and S. Yasukawa, Ed., \"Extensions to Resource Reservation Protocol - Traffic Engineering (RSVP-TE) for Point-to-Multipoint TE Label Switched Paths (LSPs)\", RFC 4875, DOI 10.17487/RFC4875, May 2007, <http://www.rfc-editor.org/info/rfc4875>.",
      "zh-CHS": "[RFC4875]Aggarwal，R.，Ed.，Papadimitriou，D.，Ed.，和S.Yasukawa，Ed.，“资源预留协议的扩展-点对多点TE标签交换路径（LSP）的流量工程（RSVP-TE）”，RFC 4875，DOI 10.17487/RFC4875，2007年5月<http://www.rfc-editor.org/info/rfc4875>."
    },
    {
      "indent": 3,
      "text": "[RFC4972] Vasseur, JP., Ed., Leroux, JL., Ed., Yasukawa, S., Previdi, S., Psenak, P., and P. Mabbey, \"Routing Extensions for Discovery of Multiprotocol (MPLS) Label Switch Router (LSR) Traffic Engineering (TE) Mesh Membership\", RFC 4972, DOI 10.17487/RFC4972, July 2007, <http://www.rfc-editor.org/info/rfc4972>.",
      "zh-CHS": "[RFC4972]Vasseur，JP.，Ed.，Leroux，JL.，Ed.，Yasukawa，S.，Previdi，S.，Psenak，P.，和P.Mabbey，“发现多协议（MPLS）标签交换路由器（LSR）流量工程（TE）网状成员的路由扩展”，RFC 4972，DOI 10.17487/RFC4972，2007年7月<http://www.rfc-editor.org/info/rfc4972>."
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes to RFC 4971",
      "section_title": true,
      "zh-CHS": "附录A.RFC 4971的变更"
    },
    {
      "indent": 3,
      "text": "This document makes the following changes to RFC 4971.",
      "zh-CHS": "本文件对RFC 4971进行了以下更改。"
    },
    {
      "indent": 3,
      "text": "RFC 4971 only allowed a 32-bit Router ID in the fixed header of TLV 242. This is problematic in an IPv6-only deployment where an IPv4 address may not be available. This document specifies:",
      "zh-CHS": "RFC 4971只允许在TLV 242的固定报头中使用32位路由器ID。在IPv4地址可能不可用的仅IPv6部署中，这是有问题的。本文件规定："
    },
    {
      "indent": 3,
      "text": "1. The Router ID SHOULD be identical to the value advertised in the Traffic Engineering Router ID TLV (134) if available.",
      "zh-CHS": "1. 如果可用，路由器ID应与流量工程路由器ID TLV（134）中公布的值相同。"
    },
    {
      "indent": 3,
      "text": "2. If no Traffic Engineering Router ID is assigned, the Router ID SHOULD be identical to an IP Interface Address [RFC1195] advertised by the originating IS.",
      "zh-CHS": "2. 如果未分配流量工程路由器ID，则路由器ID应与发起is公布的IP接口地址[RFC1195]相同。"
    },
    {
      "indent": 3,
      "text": "3. If the originating node does not support IPv4, then the reserved value 0.0.0.0 MUST be used in the Router ID field, and the IPv6 TE Router ID sub-TLV [RFC5316] MUST be present in the TLV.",
      "zh-CHS": "3. 如果发起节点不支持IPv4，则必须在路由器ID字段中使用保留值0.0.0.0，并且IPv6 TE路由器ID子TLV[RFC5316]必须存在于TLV中。"
    },
    {
      "indent": 3,
      "text": "In addition, some clarifying editorial changes have been made.",
      "zh-CHS": "此外，还作了一些澄清性的编辑修改。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors of RFC 4971 thanked Jean-Louis Le Roux, Paul Mabey, Andrew Partan, and Adrian Farrel for their useful comments.",
      "zh-CHS": "RFC4971的作者感谢让-路易斯·勒鲁克斯、保罗·马比、安德鲁·帕坦和阿德里安·法雷尔的有用评论。"
    },
    {
      "indent": 3,
      "text": "The authors of this document would like to thank Kris Michielsen for calling attention to the problem associated with an IPv6-only router.",
      "zh-CHS": "本文档的作者要感谢Kris Michielsen提醒大家注意与仅IPv6路由器相关的问题。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Les Ginsberg Cisco Systems 510 McCarthy Blvd. Milpitas, CA 95035 United States of America",
      "zh-CHS": "莱斯金斯伯格思科系统公司，麦卡锡大道510号。美国加利福尼亚州米尔皮塔斯95035"
    },
    {
      "indent": 3,
      "text": "Email: ginsberg@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems Via Del Serafico 200 Rome 0144 Italy",
      "zh-CHS": "Stefano Previdi Cisco Systems Via Del Serafico 200罗马0144意大利"
    },
    {
      "indent": 3,
      "text": "Email: sprevidi@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mach(Guoyi) Chen Huawei Technologies Co., Ltd KuiKe Building, No. 9 Xinxi Rd. Hai-Dian District Beijing 100085 China",
      "zh-CHS": "中国北京市海淀区新西路9号魁克大厦Mach（国一）陈华为技术有限公司100085"
    },
    {
      "indent": 3,
      "text": "Email: mach.chen@huawei.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}