{
  "title": {
    "text": "RFC 7902: Registry and Extensions for P-Multicast Service Interface Tunnel Attribute Flags",
    "zh-CHS": "RFC 7902"
  },
  "number": 7902,
  "created_at": "2021-11-01 05:41:40.553455+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          E. Rosen\nRequest for Comments: 7902                        Juniper Networks, Inc.\nUpdates: 6514                                                   T. Morin\nCategory: Standards Track                                         Orange\nISSN: 2070-1721                                                June 2016",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": " Registry and Extensions for P-Multicast Service Interface Tunnel Attribute Flags",
      "zh-CHS": "P-Multicast服务接口隧道属性标志的注册表和扩展"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The BGP-based control procedures for Multicast Virtual Private Networks (MVPNs) make use of a BGP attribute known as the \"P-Multicast Service Interface (PMSI) Tunnel\" attribute. The attribute contains a one-octet \"Flags\" field. The purpose of this document is to establish an IANA registry for the assignment of the bits in this field. Since the \"Flags\" field contains only eight bits, this document also defines a new BGP Extended Community, \"Additional PMSI Tunnel Attribute Flags\", that can be used to carry additional flags for the \"P-Multicast Service Interface (PMSI) Tunnel\" attribute. This document updates RFC 6514.",
      "zh-CHS": "基于BGP的多播虚拟专用网络（mvpn）控制过程利用BGP属性，称为“P-多播服务接口（PMSI）隧道”属性。该属性包含一个八位字节的“标志”字段。本文件的目的是建立IANA注册表，用于分配该字段中的位。由于“标志”字段仅包含八位，因此本文档还定义了一个新的BGP扩展社区“附加PMSI隧道属性标志”，可用于携带“P-多播服务接口（PMSI）隧道”属性的附加标志。本文件更新了RFC 6514。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7902.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7902."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Extending the \"PMSI Tunnel\" Attribute \"Flags\" Field . . . . .   3\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n5.  Normative References  . . . . . . . . . . . . . . . . . . . .   6\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .   7\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "A BGP attribute, \"P-Multicast Service Interface (PMSI) Tunnel\" attribute is defined in [RFC6514]. This attribute, referred to as the \"PMSI Tunnel\" attribute in this document, contains a one-octet \"Flags\" field. Only one flag is defined in that RFC, but there is now a need to define additional flags. However, that RFC did not create an IANA registry for the assignment of bits in the \"Flags\" field. This document creates a registry for that purpose. In addition, there may be a need to define more than eight flags. Therefore this document defines a new BGP Extended Community, \"Additional PMSI Tunnel Attribute Flags\", that can be used to carry additional flags for the \"PMSI Tunnel\" attribute. A registry is also created for this Extended Community, allowing IANA to assign flag bits from the Extended Community's six-octet value field.",
      "zh-CHS": "BGP属性，“P-多播服务接口（PMSI）隧道”属性在[RFC6514]中定义。此属性在本文档中称为“PMSI隧道”属性，包含一个八位字节的“标志”字段。该RFC中只定义了一个标志，但现在需要定义其他标志。但是，该RFC没有为“标志”字段中的位分配创建IANA注册表。本文档为此目的创建了一个注册表。此外，可能需要定义八个以上的标志。因此，本文档定义了一个新的BGP扩展社区“附加PMSI隧道属性标志”，可用于携带“PMSI隧道”属性的附加标志。还为此扩展社区创建了一个注册表，允许IANA从扩展社区的六个八位组值字段中分配标志位。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Extending the \"PMSI Tunnel\" Attribute \"Flags\" Field",
      "section_title": true,
      "zh-CHS": "2. 扩展“PMSI隧道”属性“标志”字段"
    },
    {
      "indent": 3,
      "text": "In [RFC6514], only a single octet in the \"PMSI Tunnel\" attribute is defined to carry bit flags. This allows eight flags, which is unlikely to be sufficient for all future applications.",
      "zh-CHS": "在[RFC6514]中，“PMSI隧道”属性中只有一个八位字节被定义为携带位标志。这允许使用8个标志，这不太可能对所有未来的应用程序都足够。"
    },
    {
      "indent": 3,
      "text": "This document defines a new Transitive Opaque Extended Community ([RFC4360] [RFC7153]), \"Additional PMSI Tunnel Attribute Flags\". It also defines a new bit flag in the \"PMSI Tunnel\" attribute \"Flags\" field, called the \"Extension\" flag.",
      "zh-CHS": "本文档定义了一个新的可传递不透明扩展社区（[RFC4360][RFC7153]），“附加PMSI隧道属性标志”。它还在“PMSI隧道”属性“标志”字段中定义了一个新的位标志，称为“扩展”标志。"
    },
    {
      "indent": 3,
      "text": "The \"Additional PMSI Tunnel Attribute Flags\" Extended Community MUST NOT be carried by a given BGP UPDATE message unless the following conditions both hold:",
      "zh-CHS": "“附加PMSI隧道属性标志”扩展社区不得由给定BGP更新消息携带，除非以下条件均成立："
    },
    {
      "indent": 3,
      "text": "o the given BGP UPDATE message is also carrying a \"PMSI Tunnel\" attribute, and",
      "zh-CHS": "o 给定的BGP更新消息也带有“PMSI隧道”属性，并且"
    },
    {
      "indent": 3,
      "text": "o the \"Extension\" flag of that \"PMSI Tunnel\" attribute's \"Flags\" field is set.",
      "zh-CHS": "o 设置该“PMSI隧道”属性的“标志”字段的“扩展”标志。"
    },
    {
      "indent": 3,
      "text": "The six-octet value field of the \"Additional PMSI Tunnel Attribute Flags\" Extended Community is considered to be a string of 48 one-bit flags. As shown in Figure 1, the leftmost bit (the most significant bit of the most significant octet) is bit 0, and the rightmost bit (the least significant bit of the least significant octet) is bit 47.",
      "zh-CHS": "“附加PMSI隧道属性标志”扩展社区的六个八位组值字段被视为48个一位标志的字符串。如图1所示，最左边的位（最高有效八位字节的最高有效位）是位0，最右边的位（最低有效八位字节的最低有效位）是位47。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               |               |               |               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": " 3               4\n 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               |               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 1: Value Field of the \"Additional PMSI Tunnel Attribute Flags\" Extended Community",
      "zh-CHS": "图1：“附加PMSI隧道属性标志”扩展社区的值字段"
    },
    {
      "indent": 3,
      "text": "A BGP speaker MUST NOT attach more than one \"Additional PMSI Tunnel Attribute Flags\" Extended Community to a given BGP UPDATE. If a given BGP UPDATE already contains an \"Additional PMSI Tunnel Attribute Flags\" Extended Community, a BGP speaker MUST NOT attach any additional such Extended Communities.",
      "zh-CHS": "BGP扬声器不得将多个“附加PMSI隧道属性标志”扩展社区附加到给定的BGP更新。如果给定的BGP更新已包含“附加PMSI隧道属性标志”扩展社区，则BGP扬声器不得附加任何附加的此类扩展社区。"
    },
    {
      "indent": 3,
      "text": "If a BGP speaker receives a BGP UPDATE with more than one \"Additional PMSI Tunnel Attribute Flags\" Extended Communities attached, only the flag settings in first occurrence of the Extended Community are significant. Flag settings in subsequent occurrences of the Extended Community MUST be ignored. When propagating the UPDATE, all instances of the Extended Community other than the first SHOULD be removed.",
      "zh-CHS": "如果BGP扬声器接收到附加了多个“附加PMSI隧道属性标志”扩展社区的BGP更新，则只有扩展社区第一次出现时的标志设置才有效。必须忽略扩展社区后续事件中的标志设置。传播更新时，应删除扩展社区中除第一个以外的所有实例。"
    },
    {
      "indent": 3,
      "text": "Suppose a BGP speaker receives an UPDATE message that contains a \"PMSI Tunnel\" attribute, but does not contain an \"Additional PMSI Tunnel Attribute Flags\" Extended Community. If the \"Extension\" flag of the \"PMSI Tunnel\" attribute is set, the UPDATE is considered to be malformed, and the \"treat-as-withdraw\" procedure of [RFC7606] MUST be applied.",
      "zh-CHS": "假设BGP扬声器接收到一条更新消息，该消息包含“PMSI隧道”属性，但不包含“附加PMSI隧道属性标志”扩展社区。如果设置了“PMSI隧道”属性的“扩展”标志，则认为更新的格式不正确，必须应用[RFC7606]的“视为撤回”过程。"
    },
    {
      "indent": 3,
      "text": "If a BGP speaker receives an UPDATE message that contains one or more \"Additional PMSI Tunnel Attribute Flags\" Extended Communities, but either (a) that UPDATE message does not contain a \"PMSI Tunnel\" attribute, or (b) the \"Extension\" flag of the \"PMSI Tunnel\" attribute is not set, then the Extended Community(ies) SHOULD be removed and SHOULD NOT be redistributed. The BGP UPDATE message MUST be processed (and if necessary, redistributed) as if the Extended Community(ies) had not been present.",
      "zh-CHS": "如果BGP扬声器接收到包含一个或多个“附加PMSI隧道属性标志”扩展社区的更新消息，但（a）该更新消息不包含“PMSI隧道”属性，或（b）未设置“PMSI隧道”属性的“扩展”标志，则扩展社区应删除，不应重新分发。必须像扩展社区不存在一样处理（如有必要，重新分发）BGP更新消息。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that supports the current document, but does not recognize a particular flag (either in the\" PMSI Tunnel\" attribute \"Flags\" field or in the \"Additional PMSI Tunnel Attribute Flags\" Extended Community) MUST simply ignore that flag. If the BGP speaker propagates either the \"PMSI Tunnel\" attribute, the \"Additional PMSI Tunnel Attribute Flags\" Extended Community, or both along with the UPDATE message, it SHOULD leave the setting of the flag unchanged.",
      "zh-CHS": "支持当前文档但不识别特定标志（在“PMSI隧道”属性“标志”字段或“附加PMSI隧道属性标志”扩展社区中）的BGP演讲者必须忽略该标志。如果BGP扬声器在更新消息中传播“PMSI隧道”属性、“附加PMSI隧道属性标志”扩展社区或两者，则应保持标志设置不变。"
    },
    {
      "indent": 3,
      "text": "It is possible that a particular application will require all members of a particular set of BGP speakers to support a particular flag. How it is determined whether all such BGP speakers support that flag is outside the scope of this document.",
      "zh-CHS": "一个特定的应用程序可能需要一组特定BGP扬声器的所有成员支持一个特定的标志。如何确定所有此类BGP扬声器是否支持该标志不在本文档范围内。"
    },
    {
      "indent": 3,
      "text": "In some situations, a BGP speaker may need to modify or replace the \"PMSI Tunnel\" attribute before propagating an UPDATE. If the \"Extension\" flag of the \"PMSI Tunnel\" attribute was set before the attribute is modified or replaced, but that flag is no longer set after the attribute is modified or replaced, any \"Additional PMSI Tunnel Attribute Flags\" Extended Communities MUST be removed before the UPDATE is propagated. If the \"PMSI Tunnel\" attribute is removed entirely before an UPDATE is propagated, the \"Additional PMSI Tunnel Attribute Flags\" Extended Communities (if any) MUST also be removed.",
      "zh-CHS": "在某些情况下，BGP扬声器可能需要在传播更新之前修改或替换“PMSI隧道”属性。如果在修改或替换属性之前设置了“PMSI隧道”属性的“扩展”标志，但在修改或替换属性之后不再设置该标志，则必须在传播更新之前删除任何“附加PMSI隧道属性标志”扩展社区。如果在传播更新之前完全删除了“PMSI隧道”属性，则还必须删除“附加PMSI隧道属性标志”扩展社区（如果有）。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry called \"P-Multicast Service Interface (PMSI) Tunnel Attribute Flags\" in the \"Border Gateway Protocol (BGP) Parameters\" registry.",
      "zh-CHS": "IANA在“边界网关协议（BGP）参数”注册表中创建了一个名为“P-多播服务接口（PMSI）隧道属性标志”的新注册表。"
    },
    {
      "indent": 3,
      "text": "Per Section 5 of [RFC6514], a \"PMSI Tunnel\" attribute contains a \"Flags\" octet. The \"Flags\" field is a single octet, with bits numbered, left-to-right, from 0 to 7. IANA has initialized the registry as follows:",
      "zh-CHS": "根据[RFC6514]第5节，“PMSI隧道”属性包含一个“标志”八位字节。“Flags”字段是一个八位字节，从左到右编号，从0到7。IANA已按如下方式初始化注册表："
    },
    {
      "indent": 7,
      "text": "Bit Position Description Reference (left to right) 0 unassigned 1 Extension This document 2 unassigned 3 unassigned 4 unassigned 5 unassigned 6 unassigned 7 Leaf Information Required (L) RFC 6514",
      "zh-CHS": "位位置描述参考（从左到右）0未分配1扩展本文档2未分配3未分配4未分配5未分配6未分配7所需叶信息（L）RFC 6514"
    },
    {
      "indent": 23,
      "text": "\"PMSI Tunnel\" Attribute Flags",
      "zh-CHS": "“PMSI隧道”属性标志"
    },
    {
      "indent": 3,
      "text": "The registration procedure for this registry is Standards Action.",
      "zh-CHS": "本注册处的注册程序为标准行动。"
    },
    {
      "indent": 3,
      "text": "IANA has also assigned the codepoint 0x07 from the \"First Come, First Served\" range of the \"Transitive Opaque Extended Community Sub-Types\" registry for \"Additional PMSI Tunnel Attribute Flags\".",
      "zh-CHS": "IANA还从“可传递不透明扩展社区子类型”注册表的“先到先得”范围为“其他PMSI隧道属性标志”分配了代码点0x07。"
    },
    {
      "indent": 3,
      "text": "IANA has established a registry for the bit flags carried in the \"Additional PMSI Tunnel Attribute Flags\" Extended Community. The bits are numbered 0-47, with 0 being the most significant bit and 47 being the least significant bit. The registration policy for this registry is \"Standards Action\".",
      "zh-CHS": "IANA已经为“附加PMSI隧道属性标志”扩展社区中携带的位标志建立了一个注册表。位编号为0-47，0为最高有效位，47为最低有效位。本注册中心的注册政策为“标准行动”。"
    },
    {
      "indent": 3,
      "text": "The initial registry should be as follows:",
      "zh-CHS": "初始注册表应如下所示："
    },
    {
      "indent": 19,
      "text": "Bit Flag Name Reference",
      "zh-CHS": "位标志名称引用"
    },
    {
      "indent": 20,
      "text": "0-47 Unassigned",
      "zh-CHS": "0-47未分配"
    },
    {
      "indent": 17,
      "text": "Additional \"PMSI Tunnel\" Attribute Flags",
      "zh-CHS": "附加的“PMSI隧道”属性标志"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document establishes an IANA registry, and defines a new Transitive Opaque Extended Community ([RFC4360], [RFC7153]).",
      "zh-CHS": "本文档建立了IANA注册表，并定义了一个新的可传递不透明扩展社区（[RFC4360]，[RFC7153]）。"
    },
    {
      "indent": 3,
      "text": "Establishment of an IANA registry does not raise any security considerations.",
      "zh-CHS": "IANA注册中心的建立不会引起任何安全考虑。"
    },
    {
      "indent": 3,
      "text": "While this document defines a new Extended Community for carrying bit flags, it does not define any of the bit flags in that Extended Community. Therefore, no security considerations are raised.",
      "zh-CHS": "虽然本文档定义了一个新的扩展社区来承载位标志，但它没有定义该扩展社区中的任何位标志。因此，没有提出任何安全考虑。"
    },
    {
      "indent": 3,
      "text": "This document defines a new flag, the \"Extension\" flag, in the \"PMSI Tunnel\" attribute. If a particular UPDATE contains a \"PMSI Tunnel\" attribute with this flag set, but the UPDATE does not contain an \"Additional PMSI Tunnel Attribute Flags\" Extended Community, then the UPDATE is considered to be malformed, and the \"treat-as-withdraw\" procedure of [RFC7606] is invoked. Thus, one can cause an UPDATE to be treated as a withdrawal by incorrectly setting this bit.",
      "zh-CHS": "本文档在“PMSI隧道”属性中定义了一个新标志，即“扩展”标志。如果特定更新包含设置了此标志的“PMSI隧道”属性，但该更新不包含“附加PMSI隧道属性标志”扩展社区，则该更新被视为格式错误，并调用[RFC7606]的“视为撤回”过程。因此，通过错误地设置此位，可以将更新视为撤回。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "zh-CHS": "5. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC4360] Sangli, S., Tappan, D., and Y. Rekhter, \"BGP Extended Communities Attribute\", RFC 4360, DOI 10.17487/RFC4360, February 2006, <http://www.rfc-editor.org/info/rfc4360>.",
      "zh-CHS": "[RFC4360]Sangli，S.，Tappan，D.和Y.Rekhter，“BGP扩展社区属性”，RFC 4360，DOI 10.17487/RFC4360，2006年2月<http://www.rfc-editor.org/info/rfc4360>."
    },
    {
      "indent": 3,
      "text": "[RFC6514] Aggarwal, R., Rosen, E., Morin, T., and Y. Rekhter, \"BGP Encodings and Procedures for Multicast in MPLS/BGP IP VPNs\", RFC 6514, DOI 10.17487/RFC6514, February 2012, <http://www.rfc-editor.org/info/rfc6514>.",
      "zh-CHS": "[RFC6514]Aggarwal，R.，Rosen，E.，Morin，T.，和Y.Rekhter，“MPLS/BGP IP VPN中的BGP编码和多播过程”，RFC 6514，DOI 10.17487/RFC6514，2012年2月<http://www.rfc-editor.org/info/rfc6514>."
    },
    {
      "indent": 3,
      "text": "[RFC7153] Rosen, E. and Y. Rekhter, \"IANA Registries for BGP Extended Communities\", RFC 7153, DOI 10.17487/RFC7153, March 2014, <http://www.rfc-editor.org/info/rfc7153>.",
      "zh-CHS": "[RFC7153]Rosen，E.和Y.Rekhter，“BGP扩展社区的IANA注册”，RFC 7153，DOI 10.17487/RFC7153，2014年3月<http://www.rfc-editor.org/info/rfc7153>."
    },
    {
      "indent": 3,
      "text": "[RFC7606] Chen, E., Ed., Scudder, J., Ed., Mohapatra, P., and K. Patel, \"Revised Error Handling for BGP UPDATE Messages\", RFC 7606, DOI 10.17487/RFC7606, August 2015, <http://www.rfc-editor.org/info/rfc7606>.",
      "zh-CHS": "[RFC7606]Chen，E.，Ed.，Scudder，J.，Ed.，Mohapatra，P.，和K.Patel，“BGP更新消息的修订错误处理”，RFC 7606，DOI 10.17487/RFC7606，2015年8月<http://www.rfc-editor.org/info/rfc7606>."
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Martin Vigoureux for his review of this document. We also thank Christian Huitema and Alexey Melnikov for their review and comments.",
      "zh-CHS": "作者希望感谢Martin Vigoureux对本文件的审查。我们还感谢克里斯蒂安·惠特马和阿列克谢·梅尔尼科夫的审查和评论。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Eric C. Rosen Juniper Networks, Inc. 10 Technology Park Drive Westford, Massachusetts 01886 United States",
      "zh-CHS": "Eric C.Rosen Juniper Networks，Inc.美国马萨诸塞州韦斯特福德科技园大道10号01886"
    },
    {
      "indent": 3,
      "text": "Email: erosen@juniper.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Thomas Morin Orange 2, avenue Pierre-Marzin 22307 Lannion Cedex France",
      "zh-CHS": "托马斯·莫林·奥兰治2号，皮埃尔·马津大街22307拉尼翁·塞德克斯法国"
    },
    {
      "indent": 3,
      "text": "Email: thomas.morin@orange.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}