{
  "title": {
    "text": "RFC 7280: IANA Guidance for Managing the Unidirectional Lightweight Encapsulation (ULE) Next-Header Registry",
    "zh-CHS": "RFC 7280"
  },
  "number": 7280,
  "created_at": "2021-11-02 12:41:45.112341+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      G. Fairhurst\nRequest for Comments: 7280                        University of Aberdeen\nUpdates: 4326                                                  June 2014\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": " IANA Guidance for Managing the Unidirectional Lightweight Encapsulation (ULE) Next-Header Registry",
      "zh-CHS": "IANA关于管理单向轻量级封装（ULE）下一个标头注册表的指南"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 4326 to clarify and update the allocation rules for the Unidirectional Lightweight Encapsulation (ULE) Next-Header registry. This registry is used by ULE and Generic Stream Encapsulation (GSE) to record the code points of Extension Headers and protocols supported by these encapsulation protocols.",
      "zh-CHS": "本文档更新RFC 4326，以澄清和更新单向轻量级封装（ULE）下一报头注册表的分配规则。ULE和通用流封装（GSE）使用此注册表记录这些封装协议支持的扩展头和协议的代码点。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7280.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7280."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2014 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  The ULE Next-Header Registry  . . . . . . . . . . . . . .   3\n  2.2.  Informative Example of Using a Value from the Optional\n        Range . . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Updated IANA Guidance on Allocation in the ULE Next-Header\n    Registry  . . . . . . . . . . . . . . . . . . . . . . . . . .   4\n  3.1.  ULE Next-Header Registry  . . . . . . . . . . . . . . . .   4\n  3.2.  Expert Review Guidelines  . . . . . . . . . . . . . . . .   5\n  3.3.  Reservation of Next-Header Values for Private Use . . . .   5\n4.  Update to Registry Information  . . . . . . . . . . . . . . .   6\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   6\n7.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .   6\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .   7\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .   7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The Unidirectional Lightweight Encapsulation (ULE) [RFC4326] specifies an encapsulation for links that employ the MPEG-2 Transport Stream, with support over a wide variety of physical-layer bearers [RFC4259]. The encapsulation header includes a Type field that identifies payload types and Extension Headers (e.g., [RFC5163]). The ULE specification requested IANA to maintain the ULE Next-Header registry to record the allocation of the values used to derive this Type field.",
      "zh-CHS": "单向轻量级封装（ULE）[RFC4326]为采用MPEG-2传输流的链路指定封装，支持多种物理层承载[RFC4259]。封装报头包括标识有效负载类型和扩展报头的类型字段（例如，[RFC5163]）。ULE规范要求IANA维护ULE下一个标头注册表，以记录用于派生此类型字段的值的分配。"
    },
    {
      "indent": 3,
      "text": "The Digital Video Broadcast (DVB) Project has published an encapsulation for second-generation DVB physical layers. This specifies the Generic Stream Encapsulation [GSE]. This encapsulation shares many of the network properties of ULE and uses a common format for the Type field [RFC5163]. The ULE Next-Header registry is therefore also applicable to this encapsulation.",
      "zh-CHS": "数字视频广播（DVB）项目发布了第二代DVB物理层的封装。这指定了通用流封装[GSE]。此封装共享ULE的许多网络属性，并对类型字段[RFC5163]使用通用格式。因此，ULE Next头注册表也适用于此封装。"
    },
    {
      "indent": 3,
      "text": "This document updates the IANA rules and guidance defined in Section 11.1 of [RFC4326] in the following way:",
      "zh-CHS": "本文件以以下方式更新了[RFC4326]第11.1节中定义的IANA规则和指南："
    },
    {
      "indent": 3,
      "text": "o The document clarifies use of the ULE Next-Header registry by GSE as well as by ULE.",
      "zh-CHS": "o 该文件澄清了GSE和ULE对ULE下一个标题注册表的使用。"
    },
    {
      "indent": 3,
      "text": "o Section 3 specifies that new allocations in the ULE Next-Header registry are to be assigned by IANA using the \"Specification Required\" policy and provides guidance to the expert reviewer.",
      "zh-CHS": "o 第3节规定，IANA将使用“所需规范”政策分配ULE下一个标题注册表中的新分配，并向专家评审员提供指导。"
    },
    {
      "indent": 3,
      "text": "o Section 3.3 reserves a range of allocated values.",
      "zh-CHS": "o 第3.3节保留了一系列分配值。"
    },
    {
      "indent": 3,
      "text": "o Section 4 adds an explanatory note to clarify the encoding used in the ULE Next-Header registry.",
      "zh-CHS": "o 第4节添加了一个解释性说明，以澄清ULE下一个标头注册表中使用的编码。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "This document assumes familiarity with the ULE terminology used in [RFC4326] and [RFC5163].",
      "zh-CHS": "本文件假定熟悉[RFC4326]和[RFC5163]中使用的ULE术语。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2.1. The ULE Next-Header Registry",
      "section_title": true,
      "zh-CHS": "2.1. 下一个标头注册表"
    },
    {
      "indent": 3,
      "text": "The Mandatory Extension Headers are allocated in the ULE Next-Header registry with integer values in the decimal range 0-255. The registered value corresponds to a 16-bit Type value (converted by setting the most significant 8 bits of the 16-bit value to zero). This Type value may identify a Mandatory Extension Header or a specific protocol.",
      "zh-CHS": "强制扩展标头在ULE下一个标头注册表中分配，其整数值在十进制范围0-255之间。注册值对应于16位类型值（通过将16位值的最高有效8位设置为零进行转换）。此类型值可以标识强制扩展标头或特定协议。"
    },
    {
      "indent": 3,
      "text": "The Optional Extension Headers are allocated in the ULE Next-Header registry with integer values in the decimal range 256-511. The registered value corresponds to the 16-bit Type value that would be used for an Optional Extension Header with a length (H-LEN) of 1.",
      "zh-CHS": "可选扩展标头在ULE下一个标头注册表中分配，其整数值在十进制范围256-511内。注册值对应于将用于长度（H-LEN）为1的可选扩展标头的16位类型值。"
    },
    {
      "indent": 0,
      "text": "2.2. Informative Example of Using a Value from the Optional Range",
      "section_title": true,
      "zh-CHS": "2.2. 使用可选范围中的值的信息示例"
    },
    {
      "indent": 3,
      "text": "This section provides an informative example of how a registry entry is constructed to identify an Optional ULE Extension Header.",
      "zh-CHS": "本节提供了一个信息示例，说明如何构造注册表项来标识可选的ULE扩展头。"
    },
    {
      "indent": 3,
      "text": "Values registered by IANA in the Optional ULE Extension Header range correspond to a 16-bit Type value with the H-LEN field (in bits 5 to 7) set to a decimal value of 1. This registration format is used irrespective of the H-LEN value to be used. Bits 8 to 15 of the value in the registry are combined with the actual required H-LEN value (bits 5 to 7) to form the 16-bit Type field.",
      "zh-CHS": "IANA在可选ULE扩展头范围内注册的值对应于16位类型值，H-LEN字段（第5位至第7位）设置为十进制值1。无论要使用的H-LEN值如何，都将使用此注册格式。注册表中值的第8位至第15位与实际所需的H-LEN值（第5位至第7位）组合，形成16位类型字段。"
    },
    {
      "indent": 3,
      "text": "For example, the decimal value 256 has been allocated to denote the padding Extension Header.",
      "zh-CHS": "例如，已分配十进制值256以表示填充扩展报头。"
    },
    {
      "indent": 3,
      "text": "o Type value 256: When a 2-byte padding Extension Header is used, the H-LEN is 1, resulting in a Type value with a decimal value of 256 (as allocated), corresponding to a hexadecimal value of 0x100.",
      "zh-CHS": "o 类型值256：使用2字节填充扩展标头时，H-LEN为1，导致类型值的十进制值为256（按分配），对应于十六进制值0x100。"
    },
    {
      "indent": 3,
      "text": "o Type value 768: When a 6-byte padding Extension Header is used, the H-LEN is 3, resulting in a Type value with a decimal value of 768, corresponding to a hexadecimal value of 0x300.",
      "zh-CHS": "o 类型值768：使用6字节填充扩展标头时，H-LEN为3，导致类型值的十进制值为768，对应于十六进制值0x300。"
    },
    {
      "indent": 0,
      "text": "3. Updated IANA Guidance on Allocation in the ULE Next-Header Registry",
      "section_title": true,
      "zh-CHS": "3. 更新了IANA关于ULE下一个标题注册表中分配的指南"
    },
    {
      "indent": 3,
      "text": "The rules for allocation were defined in Section 11 of [RFC4326]. This document updates these rules by replacing them with the rules in this section:",
      "zh-CHS": "分配规则在[RFC4326]第11节中定义。本文档通过将这些规则替换为本节中的规则来更新这些规则："
    },
    {
      "indent": 3,
      "text": "Allocations in the ULE Next-Header registry are to be assigned by IANA using the \"Specification Required\" policy defined in [RFC5226]. Applications must include a reference to a specification of the Next-Header extension in a \"permanent and readily available public specification\" [RFC5226]. An IETF Standards Track RFC can provide such a reference. Other specifications are also permitted. The Designated Expert shall advise IANA on whether a particular specification constitutes a \"permanent and readily available public specification\".",
      "zh-CHS": "IANA将使用[RFC5226]中定义的“所需规范”策略分配ULE下一个标头注册表中的分配。应用程序必须在“永久且随时可用的公共规范”[RFC5226]中包含对下一个报头扩展规范的引用。IETF标准跟踪RFC可以提供这样的参考。其他规格也是允许的。指定专家应就特定规范是否构成“永久且随时可用的公共规范”向IANA提出建议。"
    },
    {
      "indent": 0,
      "text": "3.1. ULE Next-Header Registry",
      "section_title": true,
      "zh-CHS": "3.1. 下一个标题注册表"
    },
    {
      "indent": 3,
      "text": "The ULE Next-Header registry allocates 0-511 decimal (0x0000-0x01FF hexadecimal). IANA must not allocate values greater than 511 (decimal). For each allocated value, it also specifies the set of allowed H-LEN values (see [RFC4326], Section 5). The combination of the IANA-registered value and the H-LEN are used by ULE and GSE to derive a set of allowed 16-bit integer values in the range 0-1535 (decimal). This forms the first part of the ULE Type space (see [RFC4326], Section 4.4.1).",
      "zh-CHS": "ULE下一个标头注册表分配0-511十进制（0x0000-0x01FF十六进制）。IANA不得分配大于511（十进制）的值。对于每个分配的值，它还指定了一组允许的H-LEN值（参见[RFC4326]，第5节）。ULE和GSE使用IANA注册值和H-LEN的组合来推导范围为0-1535（十进制）的一组允许的16位整数值。这构成ULE类型空间的第一部分（见[RFC4326]，第4.4.1节）。"
    },
    {
      "indent": 3,
      "text": "The registry is divided into two ranges:",
      "zh-CHS": "注册表分为两个范围："
    },
    {
      "indent": 3,
      "text": "1. 0-255 (decimal) IANA-assigned values, indicating Mandatory Extension Headers (or link-dependent Type fields). [RFC4326] made initial assignments to this range of values in the registry, updated by later requests.",
      "zh-CHS": "1. 0-255（十进制）IANA分配的值，指示强制扩展标题（或链接相关类型字段）。[RFC4326]在注册表中对该范围的值进行了初始赋值，并在以后的请求中进行了更新。"
    },
    {
      "indent": 3,
      "text": "2. 256-511 (decimal) IANA-assigned values, indicating Optional Extension Headers. The entry MUST define the need for the Optional Extension and the intended use. [RFC4326] made initial assignments to this range of values in the registry, updated by later requests.",
      "zh-CHS": "2. 256-511（十进制）IANA分配的值，表示可选的扩展标题。条目必须定义可选扩展的需要和预期用途。[RFC4326]在注册表中对该范围的值进行了初始赋值，并在以后的请求中进行了更新。"
    },
    {
      "indent": 0,
      "text": "3.2. Expert Review Guidelines",
      "section_title": true,
      "zh-CHS": "3.2. 专家审评准则"
    },
    {
      "indent": 3,
      "text": "The Specification Required policy also implies use of a Designated Expert [RFC5226]. The Designated Expert shall review a proposed registration for the following REQUIRED information:",
      "zh-CHS": "所需的规范政策还意味着使用指定专家[RFC5226]。指定专家应审查拟议登记的下列所需信息："
    },
    {
      "indent": 3,
      "text": "For requests in the range 0-255 (decimal) - Mandatory Extension Headers:",
      "zh-CHS": "对于0-255（十进制）范围内的请求-强制扩展标题："
    },
    {
      "indent": 3,
      "text": "o The value and the name associated with the Extension Header;",
      "zh-CHS": "o 与扩展标头关联的值和名称；"
    },
    {
      "indent": 3,
      "text": "o The procedure for processing the Extension Header;",
      "zh-CHS": "o 处理扩展头的过程；"
    },
    {
      "indent": 3,
      "text": "o A definition of the Extension Header and the intended use; and",
      "zh-CHS": "o 扩展标题和预期用途的定义；和"
    },
    {
      "indent": 3,
      "text": "o The size of the Extension Header (by default, the entire remaining payload).",
      "zh-CHS": "o 扩展标头的大小（默认情况下，为整个剩余有效负载）。"
    },
    {
      "indent": 3,
      "text": "For requests in the range 256-511 (decimal) - Optional Extension Headers:",
      "zh-CHS": "对于256-511（十进制）范围内的请求-可选扩展标头："
    },
    {
      "indent": 3,
      "text": "o The value and the name associated with the Optional Extension Header;",
      "zh-CHS": "o 与可选扩展标头关联的值和名称；"
    },
    {
      "indent": 3,
      "text": "o The procedure for processing the Extension Header;",
      "zh-CHS": "o 处理扩展头的过程；"
    },
    {
      "indent": 3,
      "text": "o A definition of the Extension Header and the intended use (including any extension ordering requirements); and",
      "zh-CHS": "o 扩展标题和预期用途的定义（包括任何扩展订购要求）；和"
    },
    {
      "indent": 3,
      "text": "o The range of allowable H-LEN values that are permitted (in the range 1-5).",
      "zh-CHS": "o 允许的允许H-LEN值范围（范围1-5）。"
    },
    {
      "indent": 3,
      "text": "If the registration information does not have any of the above required information, the Designated Expert shall not approve the registration to IANA.",
      "zh-CHS": "如果注册信息不包含任何上述所需信息，指定专家不得批准向IANA注册。"
    },
    {
      "indent": 0,
      "text": "3.3. Reservation of Next-Header Values for Private Use",
      "section_title": true,
      "zh-CHS": "3.3. 保留下一个标题值供私人使用"
    },
    {
      "indent": 3,
      "text": "This document reserves the range 144-159 decimal (0x80-0x8F hexadecimal) for Private Use [RFC5226].",
      "zh-CHS": "本文档保留144-159十进制（0x80-0x8F十六进制）范围供私人使用[RFC5226]。"
    },
    {
      "indent": 3,
      "text": "These values are not available for allocation by IANA. Appropriate use includes development of experimental options for which either no general-purpose solution was planned, insufficient operational experience was available to understand if a general solution is needed, or a more general solution is not yet mature. This use is not coordinated between users of these values, so the uniqueness of a particular value can not be guaranteed.",
      "zh-CHS": "IANA无法分配这些值。适当使用包括开发试验选项，这些选项要么没有计划通用解决方案，要么没有足够的操作经验来理解是否需要通用解决方案，要么更通用的解决方案尚未成熟。这些值的用户之间不协调使用，因此无法保证特定值的唯一性。"
    },
    {
      "indent": 3,
      "text": "Authors of specifications MUST contact IANA to request a new value to be allocated in the ULE Next-Header registry. An IANA-allocated value uniquely identifies the method. Such an allocation is REQUIRED for any method that is to be standardised.",
      "zh-CHS": "规范的作者必须联系IANA，请求在下一个标头注册表中分配新值。IANA分配的值唯一标识该方法。任何要标准化的方法都需要这样的分配。"
    },
    {
      "indent": 0,
      "text": "4. Update to Registry Information",
      "section_title": true,
      "zh-CHS": "4. 更新注册表信息"
    },
    {
      "indent": 3,
      "text": "IANA has recorded an additional explanatory note in the ULE Next-Header registry:",
      "zh-CHS": "IANA在ULE下一个标题注册表中记录了一个附加说明："
    },
    {
      "indent": 6,
      "text": "The Mandatory Extension Header range in the ULE Next-Header registry is used to allocate integer values in the range 0-255 (decimal). These values are used to identify Mandatory Extension Headers. The registered value corresponds to the 16-bit Type value for the Mandatory Extension Header or the specified protocol.",
      "zh-CHS": "ULE下一个标头注册表中的强制扩展标头范围用于分配0-255（十进制）范围内的整数值。这些值用于标识必需的扩展标题。注册值对应于强制扩展标头或指定协议的16位类型值。"
    },
    {
      "indent": 6,
      "text": "The Optional Extension Header range in the ULE Next-Header registry is used to allocate integer values in the range 256-511 (decimal). These values are used to identify Optional Extension Headers. The registered value corresponds to the 16-bit Type value that would be used for an Optional Extension Header with a header length (H-LEN) of 1.",
      "zh-CHS": "ULE Next Header注册表中的可选扩展标头范围用于分配范围为256-511（十进制）的整数值。这些值用于标识可选的扩展标题。注册值对应于16位类型值，该值将用于头长度（H-LEN）为1的可选扩展头。"
    },
    {
      "indent": 3,
      "text": "This additional note has been placed before the existing note.",
      "zh-CHS": "此附加注释已放置在现有注释之前。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not present new security considerations.",
      "zh-CHS": "本文档没有提出新的安全注意事项。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "Section 3 specifies updated IANA allocation rules.",
      "zh-CHS": "第3节规定了更新后的IANA分配规则。"
    },
    {
      "indent": 3,
      "text": "Per Section 3.3, IANA has reserved the range 144-159 decimal (0x80-0x8F hexadecimal) marked it as Reserved for Private Use.",
      "zh-CHS": "根据第3.3节，IANA保留了144-159十进制（0x80-0x8F十六进制）范围，并将其标记为保留供私人使用。"
    },
    {
      "indent": 3,
      "text": "Per Section 4, IANA has updated the ULE Next-Header registry information.",
      "zh-CHS": "根据第4节，IANA已更新ULE下一个标题注册表信息。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The author acknowledges feedback from IANA, Thomas Narten, Margaret Wasserman, Wes Eddy, and the IETF Gen-ART team. Helpful reviews and comments on usage of this registry were also received from Alexander Adolf and Hans-Peter Lexow.",
      "zh-CHS": "作者感谢来自IANA、Thomas Narten、Margaret Wasserman、Wes Eddy和IETF Gen艺术团队的反馈。亚历山大·阿道夫（Alexander Adolf）和汉斯·彼得·莱克索（Hans-Peter Lexow）也对该注册中心的使用情况进行了有益的审查和评论。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[GSE] European Telecommunication Standards Institute (ETSI), \"Digital Video Broadcasting (DVB); Generic Stream Encapsulation (GSE) Protocol\", 2007.",
      "zh-CHS": "[GSE]欧洲电信标准协会（ETSI），“数字视频广播（DVB）；通用流封装（GSE）协议”，2007年。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4326] Fairhurst, G. and B. Collini-Nocker, \"Unidirectional Lightweight Encapsulation (ULE) for Transmission of IP Datagrams over an MPEG-2 Transport Stream (TS)\", RFC 4326, December 2005.",
      "zh-CHS": "[RFC4326]Fairhurst，G.和B.Collini Nocker，“通过MPEG-2传输流（TS）传输IP数据报的单向轻量封装（ULE）”，RFC 4326，2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5163] Fairhurst, G. and B. Collini-Nocker, \"Extension Formats for Unidirectional Lightweight Encapsulation (ULE) and the Generic Stream Encapsulation (GSE)\", RFC 5163, April 2008.",
      "zh-CHS": "[RFC5163]Fairhurst，G.和B.Collini-Nocker，“单向轻量封装（ULE）和通用流封装（GSE）的扩展格式”，RFC 51632008年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC4259] Montpetit, M., Fairhurst, G., Clausen, H., Collini-Nocker, B., and H. Linder, \"A Framework for Transmission of IP Datagrams over MPEG-2 Networks\", RFC 4259, November 2005.",
      "zh-CHS": "[RFC4259]Montpetit，M.，Fairhurst，G.，Clausen，H.，Collini Nocker，B.，和H.Linder，“通过MPEG-2网络传输IP数据报的框架”，RFC 4259，2005年11月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Godred Fairhurst University of Aberdeen School of Engineering Fraser Noble Building Aberdeen, Scotland AB24 3UE UK",
      "zh-CHS": "GoRead FelHurt阿伯丁大学工程学院弗雷泽贵族大厦阿伯丁，苏格兰AB24 3UE英国"
    },
    {
      "indent": 3,
      "text": "EMail: gorry@erg.abdn.ac.uk\nURI:   http://www.erg.abdn.ac.uk",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}