{
  "title": {
    "text": "RFC 7689: Signaling Extensions for Wavelength Switched Optical Networks",
    "zh-CHS": "RFC 7689"
  },
  "number": 7689,
  "created_at": "2021-10-31 14:09:44.906643+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                 G. Bernstein, Ed.\nRequest for Comments: 7689                             Grotto Networking\nCategory: Standards Track                                          S. Xu\nISSN: 2070-1721                                                     NICT\n                                                             Y. Lee, Ed.\n                                                                  Huawei\n                                                           G. Martinelli\n                                                                   Cisco\n                                                                H. Harai\n                                                                    NICT\n                                                           November 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Signaling Extensions for Wavelength Switched Optical Networks",
      "zh-CHS": "波长交换光网络的信令扩展"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document provides extensions to Generalized Multiprotocol Label Switching (GMPLS) signaling for control of Wavelength Switched Optical Networks (WSONs). Such extensions are applicable in WSONs under a number of conditions including: (a) when optional processing, such as regeneration, must be configured to occur at specific nodes along a path, (b) where equipment must be configured to accept an optical signal with specific attributes, or (c) where equipment must be configured to output an optical signal with specific attributes. This document provides mechanisms to support distributed wavelength assignment with a choice of distributed wavelength assignment algorithms.",
      "zh-CHS": "本文档提供了用于控制波长交换光网络（WSON）的通用多协议标签交换（GMPLS）信令的扩展。这种扩展适用于无线传感器网络中的多种情况，包括：（a）必须将可选处理（如再生）配置为在路径上的特定节点上发生时，（b）必须将设备配置为接受具有特定属性的光信号时，或（c）其中设备必须配置为输出具有特定属性的光信号。本文档通过选择分布式波长分配算法提供支持分布式波长分配的机制。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7689.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7689."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................3\n   2.1. Conventions Used in This Document ..........................4\n3. Requirements for WSON Signaling .................................4\n   3.1. WSON Signal Characterization ...............................4\n   3.2. Per-Node Processing Configuration ..........................5\n   3.3. Bidirectional WSON LSPs ....................................5\n   3.4. Distributed Wavelength Assignment Selection Method .........6\n   3.5. Optical Impairments ........................................6\n4. WSON Signal Traffic Parameters, Attributes, and Processing ......6\n   4.1. Traffic Parameters for Optical Tributary Signals ...........7\n   4.2. WSON Processing Hop Attribute TLV ..........................7\n        4.2.1. ResourceBlockInfo Sub-TLV ...........................8\n        4.2.2. WavelengthSelection Sub-TLV .........................9\n5. Security Considerations ........................................11\n6. IANA Considerations ............................................11\n7. References .....................................................13\n   7.1. Normative References ......................................13\n   7.2. Informative References ....................................14\nAcknowledgments ...................................................15\nContributors ......................................................15\nAuthor's Addresses ................................................16",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document provides extensions to Generalized Multiprotocol Label Switching (GMPLS) signaling for control of Wavelength Switched Optical Networks (WSONs). Fundamental extensions are given to permit simultaneous bidirectional wavelength assignment, while more advanced extensions are given to support the networks described in [RFC6163], which feature connections requiring configuration of input, output, and general signal processing capabilities at a node along a Label Switched Path (LSP).",
      "zh-CHS": "本文档提供了用于控制波长交换光网络（WSON）的通用多协议标签交换（GMPLS）信令的扩展。给出了基本扩展以允许同时双向波长分配，同时给出了更高级扩展以支持[RFC6163]中所述的网络，其特征是连接需要在沿着标签交换路径（LSP）的节点处配置输入、输出和一般信号处理能力。"
    },
    {
      "indent": 3,
      "text": "These extensions build on previous work for the control of lambda and G.709-based networks.",
      "zh-CHS": "这些扩展基于以前的工作，用于控制基于lambda和G.709的网络。"
    },
    {
      "indent": 3,
      "text": "Related documents are [RFC7446] that provides a high-level information model and [RFC7581] that provides common encodings that can be applicable to other protocol extensions such as routing.",
      "zh-CHS": "相关文档包括提供高级信息模型的[RFC7446]和提供可应用于路由等其他协议扩展的通用编码的[RFC7581]。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "CWDM: Coarse Wavelength Division Multiplexing.",
      "zh-CHS": "CWDM：粗波分复用。"
    },
    {
      "indent": 3,
      "text": "DWDM: Dense Wavelength Division Multiplexing.",
      "zh-CHS": "密集波分复用。"
    },
    {
      "indent": 3,
      "text": "ROADM: Reconfigurable Optical Add/Drop Multiplexer. A reduced port count wavelength selective switching element featuring ingress and egress line side ports as well as add/drop side ports.",
      "zh-CHS": "ROADM：可重构光分插复用器。一种端口数减少的波长选择性交换元件，具有入口和出口线路侧端口以及添加/删除侧端口。"
    },
    {
      "indent": 3,
      "text": "RWA: Routing and Wavelength Assignment.",
      "zh-CHS": "RWA：路由和波长分配。"
    },
    {
      "indent": 3,
      "text": "Wavelength Conversion/Converters: The process of converting information bearing optical signal centered at a given frequency (wavelength) to one with \"equivalent\" content centered at a different wavelength. Wavelength conversion can be implemented via an optical-electronic-optical (OEO) process or via a strictly optical process.",
      "zh-CHS": "波长转换/转换器：将承载以给定频率（波长）为中心的光信号的信息转换为具有以不同波长为中心的“等效”内容的信息的过程。波长转换可以通过光电光学（OEO）工艺或严格的光学工艺实现。"
    },
    {
      "indent": 3,
      "text": "WDM: Wavelength Division Multiplexing.",
      "zh-CHS": "波分复用：波分复用。"
    },
    {
      "indent": 3,
      "text": "Wavelength Switched Optical Networks (WSONs): WDM-based optical networks in which switching is performed selectively based on the frequency of an optical signal.",
      "zh-CHS": "波长交换光网络（WSON）：基于WDM的光网络，其中根据光信号的频率选择性地执行切换。"
    },
    {
      "indent": 3,
      "text": "AWG: Arrayed Waveguide Grating.",
      "zh-CHS": "阵列波导光栅。"
    },
    {
      "indent": 3,
      "text": "OXC: Optical Cross-Connect.",
      "zh-CHS": "OXC：光交叉连接。"
    },
    {
      "indent": 3,
      "text": "Optical Transmitter: A device that has both a laser, tuned on a certain wavelength, and electronic components that convert electronic signals into optical signals.",
      "zh-CHS": "光发射机：一种既有调谐到特定波长的激光器，又有将电子信号转换成光信号的电子元件的装置。"
    },
    {
      "indent": 3,
      "text": "Optical Receiver: A device that has both optical and electronic components. It detects optical signals and converts optical signals into electronic signals.",
      "zh-CHS": "光接收器：一种既有光学元件又有电子元件的装置。它检测光信号并将光信号转换为电子信号。"
    },
    {
      "indent": 3,
      "text": "Optical Transponder: A device that has both an optical transmitter and an optical receiver.",
      "zh-CHS": "光转发器：一种既有光发射机又有光接收机的设备。"
    },
    {
      "indent": 3,
      "text": "Optical End Node: The end of a wavelength (optical lambdas) lightpath in the data plane. It may be equipped with some optical/electronic devices such as wavelength multiplexers/demultiplexer (e.g., AWG), optical transponder, etc., which are employed to transmit/terminate the optical signals for data transmission.",
      "zh-CHS": "光端节点：数据平面中波长（光λ）光路的末端。它可以配备一些光学/电子设备，例如波长复用器/解复用器（例如，AWG）、光学转发器等，用于传输/终止用于数据传输的光学信号。"
    },
    {
      "indent": 3,
      "text": "FEC: Forward Error Correction. FEC is a digital signal processing technique used to enhance data reliability. It does this by introducing redundant data, called error correcting code, prior to data transmission or storage. FEC provides the receiver with the ability to correct errors without a reverse channel to request the retransmission of data.",
      "zh-CHS": "前向纠错。FEC是一种用于提高数据可靠性的数字信号处理技术。它通过在数据传输或存储之前引入称为纠错码的冗余数据来实现这一点。FEC为接收机提供了纠正错误的能力，而无需反向信道来请求数据的重新传输。"
    },
    {
      "indent": 3,
      "text": "3R Regeneration: The process of amplifying (correcting loss), reshaping (correcting noise and dispersion), retiming (synchronizing with the network clock), and retransmitting an optical signal.",
      "zh-CHS": "3R再生：放大（校正损耗）、整形（校正噪声和色散）、重定时（与网络时钟同步）和重新传输光信号的过程。"
    },
    {
      "indent": 0,
      "text": "2.1. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "2.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Requirements for WSON Signaling",
      "section_title": true,
      "zh-CHS": "3. 无线传感器网络信令要求"
    },
    {
      "indent": 3,
      "text": "The following requirements for GMPLS-based WSON signaling are in addition to the functionality already provided by existing GMPLS signaling mechanisms.",
      "zh-CHS": "基于GMPLS的WSON信令的以下要求是对现有GMPLS信令机制已经提供的功能的补充。"
    },
    {
      "indent": 0,
      "text": "3.1. WSON Signal Characterization",
      "section_title": true,
      "zh-CHS": "3.1. 无线传感器网络信号特征"
    },
    {
      "indent": 3,
      "text": "WSON signaling needs to convey sufficient information characterizing the signal to allow systems along the path to determine compatibility and perform any required local configuration. Examples of such systems include intermediate nodes (ROADMs, OXCs, wavelength",
      "zh-CHS": "WSON信令需要传递足够的信号特征信息，以允许沿路径的系统确定兼容性并执行任何所需的本地配置。此类系统的示例包括中间节点（roadm、OXCs、波长）"
    },
    {
      "indent": 3,
      "text": "converters, regenerators, OEO switches, etc.), links (WDM systems), and end systems (detectors, demodulators, etc.). The details of any local configuration processes are outside the scope of this document.",
      "zh-CHS": "转换器、再生器、OEO开关等）、链路（WDM系统）和终端系统（检测器、解调器等）。任何本地配置过程的详细信息不在本文档的范围内。"
    },
    {
      "indent": 3,
      "text": "From [RFC6163], we have the following list of WSON signal characteristics:",
      "zh-CHS": "根据[RFC6163]，我们有以下WSON信号特征列表："
    },
    {
      "indent": 3,
      "text": "1. Optical tributary signal class (modulation format). 2. FEC: whether forward error correction is used in the digital stream and what type of error correcting code is used 3. Center frequency (wavelength) 4. Bit rate 5. G-PID: General Protocol Identifier for the information format",
      "zh-CHS": "1. 光支路信号类别（调制格式）。2.FEC：数字流中是否使用前向纠错以及使用何种类型的纠错码3。中心频率（波长）4。比特率5。G-PID：信息格式的通用协议标识符"
    },
    {
      "indent": 3,
      "text": "The first three items on this list can change as a WSON signal traverses a network with regenerators, OEO switches, or wavelength converters. These parameters are summarized in the Optical Interface Class as defined in [RFC7446], and the assumption is that a class always includes signal compatibility information. An ability to control wavelength conversion already exists in GMPLS signaling along with the ability to share client signal type information (G-PID). In addition, bit rate is a standard GMPLS signaling traffic parameter. It is referred to as bandwidth encoding in [RFC3471].",
      "zh-CHS": "当WSON信号通过带有再生器、OEO开关或波长转换器的网络时，此列表中的前三项可能会发生变化。这些参数总结在[RFC7446]中定义的光学接口类中，假设一个类始终包含信号兼容性信息。GMPLS信令中已经存在控制波长转换的能力以及共享客户端信号类型信息的能力（G-PID）。此外，比特率是标准的GMPLS信令流量参数。在[RFC3471]中称为带宽编码。"
    },
    {
      "indent": 0,
      "text": "3.2. Per-Node Processing Configuration",
      "section_title": true,
      "zh-CHS": "3.2. 每节点处理配置"
    },
    {
      "indent": 3,
      "text": "In addition to configuring a node along an LSP to input or output a signal with specific attributes, we may need to signal the node to perform specific processing, such as 3R regeneration, on the signal at a particular node. [RFC6163] discussed three types of processing:",
      "zh-CHS": "除了沿着LSP配置节点以输入或输出具有特定属性的信号外，我们可能需要向节点发送信号以对特定节点处的信号执行特定处理，例如3R再生。[RFC6163]讨论了三种类型的处理："
    },
    {
      "indent": 6,
      "text": "(A) Regeneration (possibly different types)",
      "zh-CHS": "（A） 再生（可能不同类型）"
    },
    {
      "indent": 6,
      "text": "(B) Fault and Performance Monitoring",
      "zh-CHS": "（B） 故障和性能监视"
    },
    {
      "indent": 6,
      "text": "(C) Attribute Conversion",
      "zh-CHS": "（C） 属性转换"
    },
    {
      "indent": 3,
      "text": "The extensions here provide for the configuration of these types of processing at nodes along an LSP.",
      "zh-CHS": "这里的扩展用于在LSP上的节点上配置这些类型的处理。"
    },
    {
      "indent": 0,
      "text": "3.3. Bidirectional WSON LSPs",
      "section_title": true,
      "zh-CHS": "3.3. 双向WSON-lsp"
    },
    {
      "indent": 3,
      "text": "WSON signaling can support LSP setup consistent with the wavelength continuity constraint for bidirectional connections. The following cases need to be supported separately:",
      "zh-CHS": "WSON信令可以支持与双向连接的波长连续性约束一致的LSP设置。以下情况需要单独支持："
    },
    {
      "indent": 3,
      "text": "(a) Where the same wavelength is used for both upstream and downstream directions",
      "zh-CHS": "(a) 其中上游和下游方向使用相同的波长"
    },
    {
      "indent": 3,
      "text": "(b) Where different wavelengths are used for both upstream and downstream directions.",
      "zh-CHS": "(b) 上游和下游方向使用不同的波长。"
    },
    {
      "indent": 3,
      "text": "This document will review existing GMPLS bidirectional solutions according to WSON case.",
      "zh-CHS": "本文件将根据WSON案例审查现有的GMPLS双向解决方案。"
    },
    {
      "indent": 0,
      "text": "3.4. Distributed Wavelength Assignment Selection Method",
      "section_title": true,
      "zh-CHS": "3.4. 分布式波长分配选择方法"
    },
    {
      "indent": 3,
      "text": "WSON signaling can support the selection of a specific distributed wavelength assignment method.",
      "zh-CHS": "WSON信令可以支持选择特定的分布式波长分配方法。"
    },
    {
      "indent": 3,
      "text": "This method is beneficial in cases of equipment failure, etc., where fast provisioning used in quick recovery is critical to protect carriers/users against system loss. This requires efficient signaling that supports distributed wavelength assignment, in particular, when the wavelength assignment capability is not available.",
      "zh-CHS": "此方法在设备故障等情况下非常有用，其中快速恢复中使用的快速资源调配对于保护运营商/用户免受系统丢失至关重要。这需要支持分布式波长分配的有效信令，特别是当波长分配能力不可用时。"
    },
    {
      "indent": 3,
      "text": "As discussed in [RFC6163], different computational approaches for wavelength assignment are available. One method is the use of distributed wavelength assignment. This feature would allow the specification of a particular approach when more than one is implemented in the systems along the path.",
      "zh-CHS": "如[RFC6163]中所述，可以使用不同的波长分配计算方法。一种方法是使用分布式波长分配。当沿着路径的系统中实现了多个方法时，此功能将允许指定特定方法。"
    },
    {
      "indent": 0,
      "text": "3.5. Optical Impairments",
      "section_title": true,
      "zh-CHS": "3.5. 光学损伤"
    },
    {
      "indent": 3,
      "text": "This document does not address signaling information related to optical impairments.",
      "zh-CHS": "本文件不涉及与光学损伤相关的信令信息。"
    },
    {
      "indent": 0,
      "text": "4. WSON Signal Traffic Parameters, Attributes, and Processing",
      "section_title": true,
      "zh-CHS": "4. WSON信号流量参数、属性和处理"
    },
    {
      "indent": 3,
      "text": "As discussed in [RFC6163], single-channel optical signals used in WSONs are called \"optical tributary signals\" and come in a number of classes characterized by modulation format and bit rate. Although WSONs are fairly transparent to the signals they carry, to ensure compatibility amongst various networks devices and end systems, it can be important to include key lightpath characteristics as traffic parameters in signaling [RFC6163].",
      "zh-CHS": "如[RFC6163]所述，无线传感器网络中使用的单通道光信号被称为“光支路信号”，并以调制格式和比特率为特征分为多个类别。尽管无线传感器网络对其承载的信号相当透明，但为了确保各种网络设备和终端系统之间的兼容性，在信令中包含关键光路特性作为业务参数是很重要的[RFC6163]。"
    },
    {
      "indent": 3,
      "text": "LSPs signaled through extensions provided in this document MUST apply the following signaling parameters:",
      "zh-CHS": "通过本文件中提供的扩展发送信号的LSP必须应用以下信号参数："
    },
    {
      "indent": 6,
      "text": "o Switching Capability = WSON-LSC [RFC7688] o Encoding Type = Lambda [RFC3471] o Label Format = as defined in [RFC6205]",
      "zh-CHS": "o 交换能力=WSON-LSC[RFC7688]o编码类型=λ[RFC3471]o标签格式=如[RFC6205]中所定义"
    },
    {
      "indent": 3,
      "text": "[RFC6205] defines the label format as applicable to LSC capable devices.",
      "zh-CHS": "[RFC6205]定义了适用于支持LSC的设备的标签格式。"
    },
    {
      "indent": 0,
      "text": "4.1. Traffic Parameters for Optical Tributary Signals",
      "section_title": true,
      "zh-CHS": "4.1. 光支路信号的业务参数"
    },
    {
      "indent": 3,
      "text": "In [RFC3471] we see that the G-PID (client signal type) and bit rate (byte rate) of the signals are defined as parameters, and in [RFC3473] they are conveyed in the Generalized Label Request object and the RSVP SENDER_TSPEC/FLOWSPEC objects, respectively.",
      "zh-CHS": "在[RFC3471]中，我们看到信号的G-PID（客户机信号类型）和比特率（字节率）被定义为参数，在[RFC3473]中，它们分别在通用标签请求对象和RSVP发送方_TSPEC/FLOWSPEC对象中传输。"
    },
    {
      "indent": 0,
      "text": "4.2. WSON Processing Hop Attribute TLV",
      "section_title": true,
      "zh-CHS": "4.2. WSON处理跃点属性TLV"
    },
    {
      "indent": 3,
      "text": "Section 3.1 provides requirements to signal to a node along an LSP what type of processing to perform on an optical signal and how to configure itself to accept or transmit an optical signal with particular attributes.",
      "zh-CHS": "第3.1节提供了沿LSP向节点发送信号的要求，即对光信号执行什么类型的处理，以及如何配置自身以接收或传输具有特定属性的光信号。"
    },
    {
      "indent": 3,
      "text": "To target a specific node, this section defines a WSON Processing Hop Attribute TLV. This TLV is encoded as an attributes TLV; see [RFC5420]. The TLV is carried in the ERO and RRO Hop Attributes subobjects and processed according to the procedures defined in [RFC7570]. The type value of the WSON Processing Hop Attribute TLV is 4 as assigned by IANA.",
      "zh-CHS": "为了针对特定节点，本节定义了WSON处理跃点属性TLV。该TLV编码为属性TLV；参见[RFC5420]。TLV包含在ERO和RRO Hop属性子对象中，并根据[RFC7570]中定义的程序进行处理。由IANA分配的WSON处理跃点属性TLV的类型值为4。"
    },
    {
      "indent": 3,
      "text": "The WSON Processing Hop Attribute TLV carries one or more sub-TLVs with the following format:",
      "zh-CHS": "WSON处理跃点属性TLV携带一个或多个子TLV，格式如下："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |   Length      |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |\n//                            Value                            //\n|                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           ...                 |        Padding                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Type",
      "zh-CHS": "类型"
    },
    {
      "indent": 6,
      "text": "The identifier of the sub-TLV.",
      "zh-CHS": "子TLV的标识符。"
    },
    {
      "indent": 3,
      "text": "Length",
      "zh-CHS": "长"
    },
    {
      "indent": 6,
      "text": "Indicates the total length of the sub-TLV in octets. That is, the combined length of the Type, Length, and Value fields, i.e., two plus the length of the Value field in octets.",
      "zh-CHS": "表示子TLV的总长度（以八位字节为单位）。也就是说，类型、长度和值字段的组合长度，即2加上值字段的长度（以八位字节为单位）。"
    },
    {
      "indent": 3,
      "text": "Value",
      "zh-CHS": "价值"
    },
    {
      "indent": 6,
      "text": "Zero or more octets of data carried in the sub-TLV.",
      "zh-CHS": "子TLV中携带的零个或多个八位字节的数据。"
    },
    {
      "indent": 3,
      "text": "Padding",
      "zh-CHS": "衬料"
    },
    {
      "indent": 6,
      "text": "Variable",
      "zh-CHS": "变量"
    },
    {
      "indent": 3,
      "text": "The entire sub-TLV MUST be padded with zeros to ensure four-octet alignment of the sub-TLV.",
      "zh-CHS": "整个子TLV必须用零填充，以确保子TLV的四个八位组对齐。"
    },
    {
      "indent": 3,
      "text": "Sub-TLV ordering is significant and MUST be preserved. Error processing follows [RFC7570].",
      "zh-CHS": "次级TLV排序非常重要，必须予以保留。错误处理如下[RFC7570]。"
    },
    {
      "indent": 3,
      "text": "The following sub-TLV types are defined in this document:",
      "zh-CHS": "本文件中定义了以下子TLV类型："
    },
    {
      "indent": 3,
      "text": "Sub-TLV Name        Type    Length\n--------------------------------------------------------------\nResourceBlockInfo    1      variable\nWavelengthSelection  2      8 octets (2-octet padding)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The TLV can be represented in Reduced Backus-Naur Form (RBNF) [RFC5511] syntax as:",
      "zh-CHS": "TLV可用简化的巴科斯诺尔形式（RBNF）[RFC5511]语法表示为："
    },
    {
      "indent": 3,
      "text": "<WSON Processing Hop Attribute> ::= <ResourceBlockInfo>\n[<ResourceBlockInfo>] [<WavelengthSelection>]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.2.1. ResourceBlockInfo Sub-TLV",
      "section_title": true,
      "zh-CHS": "4.2.1. ResourceBlockInfo子TLV"
    },
    {
      "indent": 3,
      "text": "The format of the ResourceBlockInfo sub-TLV value field is defined in Section 4 of [RFC7581]. It is a list of available Optical Interface Classes and processing capabilities.",
      "zh-CHS": "ResourceBlockInfo子TLV值字段的格式在[RFC7581]的第4节中定义。它是可用光学接口类和处理能力的列表。"
    },
    {
      "indent": 3,
      "text": "At least one ResourceBlockInfo sub-TLV MUST be present in the WSON Processing Hop Attribute TLV. No more than two ResourceBlockInfo sub-TLVs SHOULD be present. Any present ResourceBlockInfo sub-TLVs MUST be processed in the order received, and extra (unprocessed) sub-TLVs SHOULD be ignored.",
      "zh-CHS": "WSON处理跃点属性TLV中必须至少存在一个ResourceBlockInfo子TLV。不应存在超过两个ResourceBlockInfo子TLV。必须按照收到的顺序处理任何现有ResourceBlockInfo子TLV，并且应忽略额外的（未处理的）子TLV。"
    },
    {
      "indent": 3,
      "text": "The ResourceBlockInfo field contains several information elements as defined by [RFC7581]. The following rules apply to the sub-TLV:",
      "zh-CHS": "ResourceBlockInfo字段包含[RFC7581]定义的几个信息元素。以下规则适用于子TLV："
    },
    {
      "indent": 3,
      "text": "o RB Set field can carry one or more RB Identifier. Only the first RB Identifier listed in the RB Set field SHALL be processed; any others SHOULD be ignored.",
      "zh-CHS": "o RB Set字段可以携带一个或多个RB标识符。仅处理RB集合字段中列出的第一个RB标识符；任何其他的都应该被忽略。"
    },
    {
      "indent": 3,
      "text": "o In the case of unidirectional LSPs, only one ResourceBlockInfo sub-TLV SHALL be processed, and the I and O bits can be safely ignored.",
      "zh-CHS": "o 在单向LSP的情况下，只能处理一个ResourceBlockInfo子TLV，并且可以安全地忽略I和O位。"
    },
    {
      "indent": 3,
      "text": "o In the case of a bidirectional LSP, there MUST be either:",
      "zh-CHS": "o 在双向LSP的情况下，必须有："
    },
    {
      "indent": 6,
      "text": "(a) only one ResourceBlockInfo sub-TLV present in a WSON Processing Hop Attribute TLV, and the bits I and O both set to 1, or",
      "zh-CHS": "(a) WSON处理跃点属性TLV中仅存在一个ResourceBlockInfo子TLV，位I和O均设置为1，或"
    },
    {
      "indent": 6,
      "text": "(b) two ResourceBlockInfo sub-TLVs present, one with only the I bit set and the other with only the O bit set.",
      "zh-CHS": "(b) 存在两个ResourceBlockInfo子TLV，一个仅具有I位集，另一个仅具有O位集。"
    },
    {
      "indent": 3,
      "text": "o The rest of the information carried within the ResourceBlockInfo sub-TLV includes the Optical Interface Class List, Input Bit Rate List, and Processing Capability List. These lists MAY contain one or more elements. These elements apply equally to both bidirectional and unidirectional LSPs.",
      "zh-CHS": "o ResourceBlockInfo子TLV中包含的其余信息包括光接口类列表、输入比特率列表和处理能力列表。这些列表可能包含一个或多个元素。这些元素同样适用于双向和单向LSP。"
    },
    {
      "indent": 3,
      "text": "Any violation of these rules detected by a transit or egress node SHALL be treated as an error and be processed per [RFC7570].",
      "zh-CHS": "运输或出口节点检测到的任何违反这些规则的行为应视为错误，并根据[RFC7570]进行处理。"
    },
    {
      "indent": 3,
      "text": "A ResourceBlockInfo sub-TLV can be constructed by a node and added to an ERO Hop Attributes subobject in order to be processed by downstream nodes (transit and egress). As defined in [RFC7570], the R bit reflects the LSP_REQUIRED_ATTRIBUTE and LSP_ATTRIBUTE semantic defined in [RFC5420], and it SHOULD be set accordingly.",
      "zh-CHS": "ResourceBlockInfo子TLV可以由节点构造并添加到ERO Hop Attributes子对象中，以便由下游节点处理（传输和出口）。如[RFC7570]中所定义，R位反映了[RFC5420]中定义的LSP_REQUIRED_属性和LSP_属性语义，应相应地进行设置。"
    },
    {
      "indent": 3,
      "text": "Once a node properly parses a ResourceBlockInfo sub-TLV received in an ERO Hop Attributes subobject (according to the rules stated above and in [RFC7570]), the node allocates the indicated resources, e.g., the selected regeneration pool, for the LSP. In addition, the node SHOULD report compliance by adding an RRO Hop Attributes subobject with the WSON Processing Hop Attribute TLV (and its sub-TLVs) indicating the utilized resources. ResourceBlockInfo sub-TLVs carried in an RRO Hop Attributes subobject are subject to [RFC7570] and standard RRO processing; see [RFC3209].",
      "zh-CHS": "一旦节点正确解析在ERO-Hop Attributes子对象中接收到的ResourceBlockInfo子TLV（根据上文和[RFC7570]中所述的规则），节点将为LSP分配指示的资源，例如所选的再生池。此外，节点应通过添加一个RRO Hop Attributes子对象来报告合规性，其中WSON处理跃点属性TLV（及其子TLV）指示已利用的资源。RRO跃点属性子对象中携带的ResourceBlockInfo子TLV接受[RFC7570]和标准RRO处理；见[RFC3209]。"
    },
    {
      "indent": 0,
      "text": "4.2.2. WavelengthSelection Sub-TLV",
      "section_title": true,
      "zh-CHS": "4.2.2. 波长选择子TLV"
    },
    {
      "indent": 3,
      "text": "Routing + Distributed Wavelength Assignment (R+DWA) is one of the options defined by [RFC6163]. The output from the routing function will be a path, but the wavelength will be selected on a hop-by-hop basis.",
      "zh-CHS": "路由+分布式波长分配（R+DWA）是[RFC6163]定义的选项之一。路由功能的输出将是一条路径，但波长将逐跳选择。"
    },
    {
      "indent": 3,
      "text": "As discussed in [RFC6163], the wavelength assignment can be either for a unidirectional lightpath or for a bidirectional lightpath constrained to use the same lambda in both directions.",
      "zh-CHS": "如[RFC6163]中所述，波长分配可以是单向光路，也可以是双向光路，限制为在两个方向上使用相同的λ。"
    },
    {
      "indent": 3,
      "text": "In order to indicate wavelength assignment directionality and wavelength assignment method, the WavelengthSelection sub-TLV is carried in the WSON Processing Hop Attribute TLV defined above.",
      "zh-CHS": "为了指示波长分配方向性和波长分配方法，在上面定义的WSON处理跳属性TLV中携带波长选择子TLV。"
    },
    {
      "indent": 3,
      "text": "The WavelengthSelection sub-TLV value field is defined as:",
      "zh-CHS": "波长选择子TLV值字段定义为："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|W|  WA Method  |                    Reserved                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Where:",
      "zh-CHS": "哪里："
    },
    {
      "indent": 3,
      "text": "W (1 bit): 0 denotes requiring the same wavelength in both directions; 1 denotes that different wavelengths on both directions are allowed.",
      "zh-CHS": "W（1位）：0表示在两个方向上需要相同的波长；1表示允许两个方向上的不同波长。"
    },
    {
      "indent": 6,
      "text": "Wavelength Assignment (WA) Method (7 bits):",
      "zh-CHS": "波长分配（WA）方法（7位）："
    },
    {
      "indent": 6,
      "text": "0: unspecified (any); This does not constrain the WA method used by a specific node. This value is implied when the WavelengthSelection sub-TLV is absent.",
      "zh-CHS": "0：未指定（任何）；这不会约束特定节点使用的WA方法。当不存在波长选择子TLV时，暗示此值。"
    },
    {
      "indent": 6,
      "text": "1: First-Fit. All the wavelengths are numbered, and this WA method chooses the available wavelength with the lowest index.",
      "zh-CHS": "1：第一次试穿。所有波长都已编号，此WA方法选择具有最低索引的可用波长。"
    },
    {
      "indent": 6,
      "text": "2: Random. This WA method chooses an available wavelength randomly.",
      "zh-CHS": "2:随机。此WA方法随机选择可用波长。"
    },
    {
      "indent": 6,
      "text": "3: Least-Loaded (multi-fiber). This WA method selects the wavelength that has the largest residual capacity on the most loaded link along the route. This method is used in multi-fiber networks. If used in single-fiber networks, it is equivalent to the First-Fit WA method.",
      "zh-CHS": "3：最小负载（多光纤）。该WA方法选择在沿路由的负载最大的链路上具有最大剩余容量的波长。该方法适用于多光纤网络。如果用于单光纤网络，则相当于First Fit WA方法。"
    },
    {
      "indent": 6,
      "text": "4-127: Unassigned.",
      "zh-CHS": "4-127：未分配。"
    },
    {
      "indent": 3,
      "text": "The processing rules for this TLV are as follows:",
      "zh-CHS": "此TLV的处理规则如下所示："
    },
    {
      "indent": 3,
      "text": "If a receiving node does not support the attribute(s), its behaviors are specified below:",
      "zh-CHS": "如果接收节点不支持该属性，则其行为指定如下："
    },
    {
      "indent": 3,
      "text": "- W bit not supported: a PathErr MUST be generated with the Error Code \"Routing Problem\" (24) with error sub-code \"Unsupported WavelengthSelection Symmetry value\" (107).",
      "zh-CHS": "- 不支持W位：必须使用错误代码“路由问题”（24）和错误子代码“不支持的波长选择对称值”（107）生成PathErr。"
    },
    {
      "indent": 3,
      "text": "- WA method not supported: a PathErr MUST be generated with the Error Code \"Routing Problem\" (24) with error sub-code \"Unsupported Wavelength Assignment value\" (108).",
      "zh-CHS": "- 不支持WA方法：必须使用错误代码“路由问题”（24）和错误子代码“不支持的波长分配值”（108）生成路径错误。"
    },
    {
      "indent": 3,
      "text": "A WavelengthSelection sub-TLV can be constructed by a node and added to an ERO Hop Attributes subobject in order to be processed by downstream nodes (transit and egress). As defined in [RFC7570], the R bit reflects the LSP_REQUIRED_ATTRIBUTE and LSP_ATTRIBUTE semantic defined in [RFC5420], and it SHOULD be set accordingly.",
      "zh-CHS": "波长选择子TLV可由节点构造并添加到ERO-Hop属性子对象，以便由下游节点处理（传输和出口）。如[RFC7570]中所定义，R位反映了[RFC5420]中定义的LSP_REQUIRED_属性和LSP_属性语义，应相应地进行设置。"
    },
    {
      "indent": 3,
      "text": "Once a node properly parses the WavelengthSelection sub-TLV received in an ERO Hop Attributes subobject, the node use the indicated wavelength assignment method (at that hop) for the LSP. In addition, the node SHOULD report compliance by adding an RRO Hop Attributes subobject with the WSON Processing Hop Attribute TLV (and its sub-TLVs) that indicate the utilized method. WavelengthSelection sub-TLVs carried in an RRO Hop Attributes subobject are subject to [RFC7570] and standard RRO processing; see [RFC3209].",
      "zh-CHS": "一旦节点正确解析在ERO跃点属性子对象中接收的波长选择子TLV，节点将使用指示的LSP波长分配方法（在该跃点）。此外，节点应通过添加一个带有WSON处理跃点属性TLV（及其子TLV）的RRO跃点属性子对象来报告合规性，该属性指示所使用的方法。RRO跃点属性子对象中携带的波长选择子TLV接受[RFC7570]和标准RRO处理；见[RFC3209]。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document is built on the mechanisms defined in [RFC3473], and only differs in the specific information communicated. The specific additional information (optical resource and wavelength selection properties) is not viewed as substantively changing or adding to the security considerations of the existing GMPLS signaling protocol mechanisms. See [RFC3473] for details of the supported security measures. Additionally, [RFC5920] provides an overview of security vulnerabilities and protection mechanisms for the GMPLS control plane.",
      "zh-CHS": "本文件以[RFC3473]中定义的机制为基础，仅在传达的具体信息上有所不同。特定的附加信息（光资源和波长选择属性）不被视为实质性地改变或增加现有GMPLS信令协议机制的安全考虑。有关支持的安全措施的详细信息，请参见[RFC3473]。此外，[RFC5920]概述了GMPLS控制平面的安全漏洞和保护机制。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a new value in the existing \"Attributes TLV Space\" registry located at <http://www.iana.org/assignments/rsvp-te-parameters>, as updated by [RFC7570]:",
      "zh-CHS": "IANA已在位于的现有“属性TLV空间”注册表中分配了一个新值<http://www.iana.org/assignments/rsvp-te-parameters>，由[RFC7570]更新："
    },
    {
      "indent": 3,
      "text": "Type Name Allowed on Allowed on Allowed on Reference LSP LSP REQUIRED RO LSP ATTRIBUTES ATTRIBUTES Attribute Subobject",
      "zh-CHS": "引用LSP LSP必需RO LSP属性子对象上允许的类型名称"
    },
    {
      "indent": 3,
      "text": "4 WSON No No Yes RFC 7689 Processing Hop Attribute TLV",
      "zh-CHS": "4 WSON否否是RFC 7689处理跃点属性TLV"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry named \"Sub-TLV Types for WSON Processing Hop Attribute TLV\" located at <http://www.iana.org/assignments/rsvp-te-parameters>.",
      "zh-CHS": "IANA已经创建了一个名为“WSON处理跃点属性TLV的子TLV类型”的新注册表，该注册表位于<http://www.iana.org/assignments/rsvp-te-parameters>."
    },
    {
      "indent": 3,
      "text": "The following entries have been added:",
      "zh-CHS": "已添加以下条目："
    },
    {
      "indent": 3,
      "text": "Value Sub-TLV Type Reference",
      "zh-CHS": "值子TLV类型引用"
    },
    {
      "indent": 3,
      "text": "0 Reserved RFC 7689",
      "zh-CHS": "0保留RFC 7689"
    },
    {
      "indent": 3,
      "text": "1 ResourceBlockInfo RFC 7689",
      "zh-CHS": "1 ResourceBlockInfo RFC 7689"
    },
    {
      "indent": 3,
      "text": "2 WavelengthSelection RFC 7689",
      "zh-CHS": "2波长选择RFC 7689"
    },
    {
      "indent": 3,
      "text": "All assignments are to be performed via Standards Action or Specification Required policies as defined in [RFC5226].",
      "zh-CHS": "所有任务都将通过[RFC5226]中定义的标准行动或规范要求政策执行。"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry named \"Values for Wavelength Assignment Method field in WavelengthSelection Sub-TLV\" located at <http://www.iana.org/assignments/rsvp-te-parameters>.",
      "zh-CHS": "IANA创建了一个名为“波长选择子TLV中波长分配方法字段的值”的新注册表，位于<http://www.iana.org/assignments/rsvp-te-parameters>."
    },
    {
      "indent": 3,
      "text": "The following entries have been added:",
      "zh-CHS": "已添加以下条目："
    },
    {
      "indent": 3,
      "text": "Value Meaning Reference",
      "zh-CHS": "价值意义参照"
    },
    {
      "indent": 3,
      "text": "0 unspecified RFC 7689",
      "zh-CHS": "0未指定的RFC 7689"
    },
    {
      "indent": 3,
      "text": "1 First-Fit RFC 7689",
      "zh-CHS": "1首次安装RFC 7689"
    },
    {
      "indent": 3,
      "text": "2 Random RFC 7689",
      "zh-CHS": "2随机RFC 7689"
    },
    {
      "indent": 3,
      "text": "3 Least-Loaded (multi-fiber) RFC 7689",
      "zh-CHS": "3最小负载（多光纤）RFC 7689"
    },
    {
      "indent": 3,
      "text": "4-127 Unassigned",
      "zh-CHS": "4-127未分配"
    },
    {
      "indent": 3,
      "text": "All assignments are to be performed via Standards Action or Specification Required policies as defined in [RFC5226]. The assignment policy chosen for any specific code point must be clearly stated in the document that describes the code point so that IANA can apply the correct policy.",
      "zh-CHS": "所有任务都将通过[RFC5226]中定义的标准行动或规范要求政策执行。为任何特定代码点选择的分配策略必须在描述代码点的文件中明确说明，以便IANA能够应用正确的策略。"
    },
    {
      "indent": 3,
      "text": "IANA has assigned new values in the existing \"Sub-Codes - 24 Routing Problem\" registry located at <http://www.iana.org/assignments/rsvp-parameters>:",
      "zh-CHS": "IANA已在位于的现有“子代码-24路由问题”注册表中分配了新值<http://www.iana.org/assignments/rsvp-parameters>:"
    },
    {
      "indent": 3,
      "text": "Value Description Reference",
      "zh-CHS": "值描述参考"
    },
    {
      "indent": 3,
      "text": "107 Unsupported WavelengthSelection symmetry value RFC 7689",
      "zh-CHS": "107无支持的波长选择对称值RFC 7689"
    },
    {
      "indent": 3,
      "text": "108 Unsupported Wavelength Assignment value RFC 7689",
      "zh-CHS": "108不支持的波长分配值RFC 7689"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, DOI 10.17487/RFC3209, December 2001, <http://www.rfc-editor.org/info/rfc3209>.",
      "zh-CHS": "[RFC3209]Awduche，D.，Berger，L.，Gan，D.，Li，T.，Srinivasan，V.，和G.Swallow，“RSVP-TE：LSP隧道RSVP的扩展”，RFC 3209，DOI 10.17487/RFC3209，2001年12月<http://www.rfc-editor.org/info/rfc3209>."
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, DOI 10.17487/RFC3471, January 2003, <http://www.rfc-editor.org/info/rfc3471>.",
      "zh-CHS": "[RFC3471]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令功能描述”，RFC 3471，DOI 10.17487/RFC3471，2003年1月<http://www.rfc-editor.org/info/rfc3471>."
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, DOI 10.17487/RFC3473, January 2003, <http://www.rfc-editor.org/info/rfc3473>.",
      "zh-CHS": "[RFC3473]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令资源预留协议流量工程（RSVP-TE）扩展”，RFC 3473，DOI 10.17487/RFC3473，2003年1月<http://www.rfc-editor.org/info/rfc3473>."
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，DOI 10.17487/RFC5226，2008年5月<http://www.rfc-editor.org/info/rfc5226>."
    },
    {
      "indent": 3,
      "text": "[RFC5420] Farrel, A., Ed., Papadimitriou, D., Vasseur, JP., and A. Ayyangarps, \"Encoding of Attributes for MPLS LSP Establishment Using Resource Reservation Protocol Traffic Engineering (RSVP-TE)\", RFC 5420, DOI 10.17487/RFC5420, February 2009, <http://www.rfc-editor.org/info/rfc5420>.",
      "zh-CHS": "[RFC5420]Farrel，A.，Ed.，Papadimitriou，D.，Vasseur，JP.，和A.Ayangarps，“使用资源预留协议流量工程（RSVP-TE）对MPLS LSP建立的属性进行编码”，RFC 5420，DOI 10.17487/RFC5420，2009年2月<http://www.rfc-editor.org/info/rfc5420>."
    },
    {
      "indent": 3,
      "text": "[RFC5511] Farrel, A., \"Routing Backus-Naur Form (RBNF): A Syntax Used to Form Encoding Rules in Various Routing Protocol Specifications\", RFC 5511, DOI 10.17487/RFC5511, April 2009, <http://www.rfc-editor.org/info/rfc5511>.",
      "zh-CHS": "[RFC5511]Farrel，A.，“路由Backus-Naur形式（RBNF）：用于在各种路由协议规范中形成编码规则的语法”，RFC 5511，DOI 10.17487/RFC5511，2009年4月<http://www.rfc-editor.org/info/rfc5511>."
    },
    {
      "indent": 3,
      "text": "[RFC6205] Otani, T., Ed., and D. Li, Ed., \"Generalized Labels for Lambda-Switch-Capable (LSC) Label Switching Routers\", RFC 6205, DOI 10.17487/RFC6205, March 2011, <http://www.rfc-editor.org/info/rfc6205>.",
      "zh-CHS": "[RFC6205]Otani，T.，Ed.，和D.Li，Ed.，“Lambda交换机功能（LSC）标签交换路由器的通用标签”，RFC 6205，DOI 10.17487/RFC6205，2011年3月<http://www.rfc-editor.org/info/rfc6205>."
    },
    {
      "indent": 3,
      "text": "[RFC7570] Margaria, C., Ed., Martinelli, G., Balls, S., and B. Wright, \"Label Switched Path (LSP) Attribute in the Explicit Route Object (ERO)\", RFC 7570, DOI 10.17487/RFC7570, July 2015, <http://www.rfc-editor.org/info/rfc7570>.",
      "zh-CHS": "[RFC7570]Margaria，C.，Ed.，Martinelli，G.，Balls，S.，和B.Wright，“显式路由对象（ERO）中的标签交换路径（LSP）属性”，RFC 7570，DOI 10.17487/RFC7570，2015年7月<http://www.rfc-editor.org/info/rfc7570>."
    },
    {
      "indent": 3,
      "text": "[RFC7581] Bernstein, G., Ed., Lee, Y., Ed., Li, D., Imajuku, W., and J. Han, \"Routing and Wavelength Assignment Information Encoding for Wavelength Switched Optical Networks\", RFC 7581, DOI 10.17487/RFC7581, June 2015, <http://www.rfc-editor.org/info/rfc7581>.",
      "zh-CHS": "[RFC7581]Bernstein，G.，Ed.，Lee，Y.，Ed.，Li，D.，Imajuku，W.，和J.Han，“波长交换光网络的路由和波长分配信息编码”，RFC 7581，DOI 10.17487/RFC7581，2015年6月<http://www.rfc-editor.org/info/rfc7581>."
    },
    {
      "indent": 3,
      "text": "[RFC7688] Lee, Y., Ed., and G. Bernstein, Ed., \"GMPLS OSPF Enhancement for Signal and Network Element Compatibility for Wavelength Switched Optical Networks\", RFC 7688, DOI 10.17487/RFC7688, November 2015, <http://www.rfc-editor.org/info/rfc7688>.",
      "zh-CHS": "[RFC7688]Lee，Y.，Ed.，和G.Bernstein，Ed.，“波长交换光网络信号和网元兼容性的GMPLS OSPF增强”，RFC 7688，DOI 10.17487/RFC7688，2015年11月<http://www.rfc-editor.org/info/rfc7688>."
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, DOI 10.17487/RFC5920, July 2010, <http://www.rfc-editor.org/info/rfc5920>.",
      "zh-CHS": "[RFC5920]方，L.，编辑，“MPLS和GMPLS网络的安全框架”，RFC 5920，DOI 10.17487/RFC5920，2010年7月<http://www.rfc-editor.org/info/rfc5920>."
    },
    {
      "indent": 3,
      "text": "[RFC6163] Lee, Y., Ed., Bernstein, G., Ed., and W. Imajuku, \"Framework for GMPLS and Path Computation Element (PCE) Control of Wavelength Switched Optical Networks (WSONs)\", RFC 6163, DOI 10.17487/RFC6163, April 2011, <http://www.rfc-editor.org/info/rfc6163>.",
      "zh-CHS": "[RFC6163]Lee，Y.，Ed.，Bernstein，G.，Ed.，和W.Imajuku，“波长交换光网络（WSON）的GMPLS和路径计算元件（PCE）控制框架”，RFC 6163，DOI 10.17487/RFC6163，2011年4月<http://www.rfc-editor.org/info/rfc6163>."
    },
    {
      "indent": 3,
      "text": "[RFC7446] Lee, Y., Ed., Bernstein, G., Ed., Li, D., and W. Imajuku, \"Routing and Wavelength Assignment Information Model for Wavelength Switched Optical Networks\", RFC 7446, DOI 10.17487/RFC7446, February 2015, <http://www.rfc-editor.org/info/rfc7446>.",
      "zh-CHS": "[RFC7446]Lee，Y.，Ed.，Bernstein，G.，Ed.，Li，D.，和W.Imajuku，“波长交换光网络的路由和波长分配信息模型”，RFC 7446，DOI 10.17487/RFC7446，2015年2月<http://www.rfc-editor.org/info/rfc7446>."
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thanks Lou Berger, Cyril Margaria, and Xian Zhang for their comments and suggestions.",
      "zh-CHS": "作者要感谢Lou Berger、Cyril Margaria和Xian Zhang的评论和建议。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "zh-CHS": "贡献者"
    },
    {
      "indent": 3,
      "text": "Nicola Andriolli Scuola Superiore Sant'Anna Pisa, Italy Email: nick@sssup.it",
      "zh-CHS": "Nicola Andriolli Scoula Superiore Sant'Anna Pisa，意大利电子邮件：nick@sssup.it"
    },
    {
      "indent": 3,
      "text": "Alessio Giorgetti Scuola Superiore Sant'Anna Pisa, Italy Email: a.giorgetti@sssup.it",
      "zh-CHS": "Alessio Giorgeti Scoula Superiore圣安娜比萨，意大利电子邮件：a。giorgetti@sssup.it"
    },
    {
      "indent": 3,
      "text": "Lin Guo Key Laboratory of Optical Communication and Lightwave Technologies Ministry of Education P.O. Box 128, Beijing University of Posts and Telecommunications China Email: guolintom@gmail.com",
      "zh-CHS": "北京邮电大学光通信与光波技术教育部重点实验室128号信箱：中国电子邮件：guolintom@gmail.com"
    },
    {
      "indent": 3,
      "text": "Yuefeng Ji Key Laboratory of Optical Communication and Lightwave Technologies Ministry of Education P.O. Box 128, Beijing University of Posts and Telecommunications China Email: jyf@bupt.edu.cn",
      "zh-CHS": "北京邮电大学光通信与光波技术教育部重点实验室，128号信箱：中国电邮：jyf@bupt.edu.cn"
    },
    {
      "indent": 3,
      "text": "Daniel King Old Dog Consulting Email: daniel@olddog.co.uk",
      "zh-CHS": "Daniel King老狗咨询电子邮件：daniel@olddog.co.uk"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Greg M. Bernstein (editor) Grotto Networking Fremont, CA United States Phone: (510) 573-2237 Email: gregb@grotto-networking.com",
      "zh-CHS": "Greg M.Bernstein（编辑）Grotto Networking Fremont，CA美国电话：（510）573-2237电子邮件：gregb@grotto-网络"
    },
    {
      "indent": 3,
      "text": "Sugang Xu National Institute of Information and Communications Technology 4-2-1 Nukui-Kitamachi, Koganei, Tokyo, 184-8795 Japan Phone: +81 42-327-6927 Email: xsg@nict.go.jp",
      "zh-CHS": "徐素刚国家信息和通信技术研究所4-2-1日本东京高加内市北田努奎184-8795电话：+81 42-327-6927电子邮件：xsg@nict.go.jp"
    },
    {
      "indent": 3,
      "text": "Young Lee (editor) Huawei Technologies 5340 Legacy Dr. Building 3 Plano, TX 75024 United States Phone: (469) 277-5838 Email: leeyoung@huawei.com",
      "zh-CHS": "Young Lee（编辑）华为技术5340 Legacy Dr.Building 3 Plano，TX 75024美国电话：（469）277-5838电子邮件：leeyoung@huawei.com"
    },
    {
      "indent": 3,
      "text": "Giovanni Martinelli Cisco Via Philips 12 20052 Monza Italy Phone: +39 039-209-2044 Email: giomarti@cisco.com",
      "zh-CHS": "Giovanni Martinelli Cisco通过飞利浦12 20052意大利蒙扎电话：+39 039-209-2044电子邮件：giomarti@cisco.com"
    },
    {
      "indent": 3,
      "text": "Hiroaki Harai National Institute of Information and Communications Technology 4-2-1 Nukui-Kitamachi, Koganei, Tokyo, 184-8795 Japan Phone: +81 42-327-5418 Email: harai@nict.go.jp",
      "zh-CHS": "Hiroaki Harai国家信息和通信技术研究所4-2-1日本东京高加内市北町Nukui，184-8795电话：+81 42-327-5418电子邮件：harai@nict.go.jp"
    }
  ]
}