{
  "title": {
    "text": "RFC 7659: Definitions of Managed Objects for Network Address Translators (NATs)",
    "zh-CHS": "RFC 7659"
  },
  "number": 7659,
  "created_at": "2021-10-31 12:03:16.113936+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      S. Perreault\nRequest for Comments: 7659                           Jive Communications\nCategory: Standards Track                                        T. Tsou\nISSN: 2070-1721                                      Huawei Technologies\n                                                            S. Sivakumar\n                                                           Cisco Systems\n                                                               T. Taylor\n                                                    PT Taylor Consulting\n                                                            October 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 1,
      "text": "Definitions of Managed Objects for Network Address Translators (NATs)",
      "zh-CHS": "网络地址转换器（NAT）的托管对象定义"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for devices implementing the Network Address Translator (NAT) function. The new MIB module defined in this document, NATV2-MIB, is intended to replace module NAT-MIB (RFC 4008). NATV2-MIB is not backwards compatible with NAT-MIB, for reasons given in the text of this document. A companion document deprecates all objects in NAT-MIB. NATV2-MIB can be used for the monitoring of NAT instances on a device capable of NAT function. Compliance levels are defined for three application scenarios: basic NAT, pooled NAT, and carrier-grade NAT (CGN).",
      "zh-CHS": "本备忘录为实现网络地址转换器（NAT）功能的设备定义了管理信息库（MIB）的一部分。本文件中定义的新MIB模块NATV2-MIB旨在取代模块NAT-MIB（RFC 4008）。NATV2-MIB与NAT-MIB不向后兼容，原因见本文件正文。附带文档不推荐NAT-MIB中的所有对象。NATV2-MIB可用于监控具有NAT功能的设备上的NAT实例。为三种应用场景定义了法规遵从性级别：基本NAT、池NAT和运营商级NAT（CGN）。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7659.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7659."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  The Internet-Standard Management Framework  . . . . . . . . .   3\n2.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Overview  . . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  3.1.  Content Provided by the NATV2-MIB Module  . . . . . . . .   5\n    3.1.1.  Configuration Data  . . . . . . . . . . . . . . . . .   5\n    3.1.2.  Notifications . . . . . . . . . . . . . . . . . . . .   6\n    3.1.3.  State Information . . . . . . . . . . . . . . . . . .   9\n    3.1.4.  Statistics  . . . . . . . . . . . . . . . . . . . . .   9\n  3.2.  Outline of MIB Module Organization  . . . . . . . . . . .  12\n  3.3.  Detailed MIB Module Walk-Through  . . . . . . . . . . . .  13\n    3.3.1.  Textual Conventions . . . . . . . . . . . . . . . . .  13\n    3.3.2.  Notifications . . . . . . . . . . . . . . . . . . . .  14\n    3.3.3.  The Subscriber Table: natv2SubscriberTable  . . . . .  14\n    3.3.4.  The Instance Table: natv2InstanceTable  . . . . . . .  15\n    3.3.5.  The Protocol Table: natv2ProtocolTable  . . . . . . .  15\n    3.3.6.  The Address Pool Table: natv2PoolTable  . . . . . . .  16\n    3.3.7.  The Address Pool Address Range Table:\n            natv2PoolRangeTable . . . . . . . . . . . . . . . . .  17\n    3.3.8.  The Address Map Table: natv2AddressMapTable . . . . .  17\n    3.3.9.  The Port Map Table: natv2PortMapTable . . . . . . . .  17\n  3.4.  Conformance: Three Application Scenarios  . . . . . . . .  18\n4.  Definitions . . . . . . . . . . . . . . . . . . . . . . . . .  19\n5.  Operational and Management Considerations . . . . . . . . . .  74\n  5.1.  Configuration Requirements  . . . . . . . . . . . . . . .  74\n  5.2.  Transition from and Coexistence with NAT-MIB (RFC 4008) .  76\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .  78\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  81\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  81\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .  81\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .  82\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  84",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "1. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了符合SMIv2的MIB模块，如STD 58、RFC 2578[RFC2578]、STD 58、RFC 2579[RFC2579]和STD 58、RFC 2580[RFC2580]所述。"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "zh-CHS": "2. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for devices implementing NAT functions. This MIB module, NATV2-MIB, may be used for the monitoring of such devices. NATV2-MIB supersedes NAT-MIB [RFC4008], which did not fit well with existing NAT implementations, and hence was not itself much implemented. [RFC7658] provides a detailed analysis of the deficiencies of NAT-MIB.",
      "zh-CHS": "此备忘录为实现NAT功能的设备定义了管理信息库（MIB）的一部分。该MIB模块NATV2-MIB可用于监控此类设备。NATV2-MIB取代了NAT-MIB[RFC4008]，后者与现有的NAT实现不太匹配，因此其本身也没有太多实现。[RFC7658]详细分析了NAT-MIB的缺陷。"
    },
    {
      "indent": 3,
      "text": "Relative to [RFC4008] and based on the analysis just mentioned, the present document introduces the following changes:",
      "zh-CHS": "相对于[RFC4008]，根据刚才提到的分析，本文件引入了以下变化："
    },
    {
      "indent": 3,
      "text": "o removed all writable configuration except that related to control of the generation of notifications and the setting of quotas on the use of NAT resources;",
      "zh-CHS": "o 删除了所有可写配置，但与通知生成控制和NAT资源使用配额设置相关的配置除外；"
    },
    {
      "indent": 3,
      "text": "o minimized the read-only exposure of configuration to what is needed to provide context for the state and statistical information presented by the MIB module;",
      "zh-CHS": "o 最小化配置的只读暴露，以提供MIB模块呈现的状态和统计信息的上下文；"
    },
    {
      "indent": 3,
      "text": "o removed the association between mapping and interfaces, retaining only the mapping aspect;",
      "zh-CHS": "o 删除了映射和接口之间的关联，只保留映射方面；"
    },
    {
      "indent": 3,
      "text": "o replaced references to NAT types with references to NAT behaviors as specified in [RFC4787];",
      "zh-CHS": "o 将对NAT类型的引用替换为[RFC4787]中规定的对NAT行为的引用；"
    },
    {
      "indent": 3,
      "text": "o replaced a module-specific enumeration of protocols with the standard protocol numbers provided by the IANA Protocol Numbers registry.",
      "zh-CHS": "o 用IANA协议编号注册表提供的标准协议编号替换特定于模块的协议枚举。"
    },
    {
      "indent": 3,
      "text": "This MIB module adds the following features not present in [RFC4008]:",
      "zh-CHS": "此MIB模块添加了[RFC4008]中没有的以下功能："
    },
    {
      "indent": 3,
      "text": "o additional writable protective limits on NAT state data;",
      "zh-CHS": "o NAT状态数据的附加可写保护限制；"
    },
    {
      "indent": 3,
      "text": "o additional objects to report state, statistics, and notifications;",
      "zh-CHS": "o 报告状态、统计信息和通知的其他对象；"
    },
    {
      "indent": 3,
      "text": "o support for the carrier-grade NAT (CGN) application, including subscriber-awareness, support for an arbitrary number of address realms, and support for multiple NAT instances running on a single device;",
      "zh-CHS": "o 支持运营商级NAT（CGN）应用程序，包括用户感知、支持任意数量的地址域，以及支持在单个设备上运行多个NAT实例；"
    },
    {
      "indent": 3,
      "text": "o expanded support for address pools;",
      "zh-CHS": "o 扩大对地址池的支持；"
    },
    {
      "indent": 3,
      "text": "o revised indexing of port map entries to simplify traceback from externally observable packet parameters to the corresponding internal endpoint.",
      "zh-CHS": "o 修改了端口映射项的索引，以简化从外部可观察数据包参数到相应内部端点的回溯。"
    },
    {
      "indent": 3,
      "text": "These features are described in more detail below.",
      "zh-CHS": "下面将更详细地描述这些功能。"
    },
    {
      "indent": 3,
      "text": "The remainder of this document is organized as follows:",
      "zh-CHS": "本文件其余部分的组织结构如下："
    },
    {
      "indent": 3,
      "text": "o Section 3 provides a verbal description of the content and organization of the MIB module.",
      "zh-CHS": "o 第3节口头描述了MIB模块的内容和组织。"
    },
    {
      "indent": 3,
      "text": "o Section 4 provides the MIB module definition.",
      "zh-CHS": "o 第4节提供了MIB模块定义。"
    },
    {
      "indent": 3,
      "text": "o Section 5 discusses operational and management issues relating to the deployment of NATV2-MIB. One of these issues is NAT management when both NAT-MIB [RFC4008] and NATV2-MIB are deployed.",
      "zh-CHS": "o 第5节讨论与NATV2-MIB部署相关的运营和管理问题。其中一个问题是NAT-MIB[RFC4008]和NATV2-MIB同时部署时的NAT管理。"
    },
    {
      "indent": 3,
      "text": "o Sections 6 and 7 provide a security discussion and a request to IANA for allocation of an object identifier for the module in the mib-2 tree, respectively.",
      "zh-CHS": "o 第6节和第7节分别提供了安全讨论和向IANA请求为mib-2树中的模块分配对象标识符。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”应按照[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 3,
      "text": "This document uses the following terminology:",
      "zh-CHS": "本文件使用以下术语："
    },
    {
      "indent": 3,
      "text": "Upper-layer protocol: The protocol following the outer IP header of a packet. This follows the terminology of [RFC2460], but as that document points out, \"upper\" is not necessarily a correct description of the protocol relationships (e.g., where IP is encapsulated in IP). The abbreviated term \"protocol\" will often be used where it is unambiguous.",
      "zh-CHS": "上层协议：数据包外部IP报头后面的协议。这遵循了[RFC2460]的术语，但正如该文件所指出的，“上限”不一定是协议关系的正确描述（例如，IP封装在IP中）。缩写术语“协议”通常在明确的地方使用。"
    },
    {
      "indent": 3,
      "text": "Trigger: With respect to notifications, the logical recognition of the event that the notification is intended to report.",
      "zh-CHS": "触发器：对于通知，是对通知要报告的事件的逻辑识别。"
    },
    {
      "indent": 3,
      "text": "Report: The actual production of a notification message. Reporting can happen later than triggering, or may never happen for a given notification instance, because of the operation of notification rate controls.",
      "zh-CHS": "报告：通知消息的实际生成。由于通知速率控制的操作，对于给定的通知实例，报告可能会晚于触发，也可能永远不会发生。"
    },
    {
      "indent": 3,
      "text": "Address realm: A network domain in which the network addresses are uniquely assigned to entities such that datagrams can be routed to them. (Definition taken from [RFC2663], Section 2.1.) The abbreviated term \"realm\" will often be used.",
      "zh-CHS": "地址域：一个网络域，其中网络地址被唯一地分配给实体，以便数据报可以路由到实体。（定义取自[RFC2663]第2.1节。）通常使用缩写词“领域”。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "zh-CHS": "3. 概述"
    },
    {
      "indent": 3,
      "text": "This section provides a prose description of the contents and organization of the NATV2-MIB module.",
      "zh-CHS": "本节对NATV2-MIB模块的内容和组织进行了详细描述。"
    },
    {
      "indent": 0,
      "text": "3.1. Content Provided by the NATV2-MIB Module",
      "section_title": true,
      "zh-CHS": "3.1. NATV2-MIB模块提供的内容"
    },
    {
      "indent": 3,
      "text": "The content provided by the NATV2-MIB module can be classed under four headings: configuration data, notifications, state information, and statistics.",
      "zh-CHS": "NATV2-MIB模块提供的内容可以分为四个标题：配置数据、通知、状态信息和统计信息。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Configuration Data",
      "section_title": true,
      "zh-CHS": "3.1.1. 配置数据"
    },
    {
      "indent": 3,
      "text": "As mentioned above, the intent in designing the NATV2-MIB module was to minimize the amount of configuration data presented to that needed to give a context for interpreting the other types of information provided. Detailed descriptions of the configuration data are included with the descriptions of the individual tables. In general, that data is limited to what is needed for indexing and cross-referencing between tables. The two exceptions are the objects describing NAT instance behavior in the NAT instance table and the detailed enumeration of resources allocated to each address pool in the pool table and its extension.",
      "zh-CHS": "如上所述，设计NATV2-MIB模块的目的是将提供给用户的配置数据量降至最低，以提供解释所提供其他类型信息的上下文。配置数据的详细说明包含在各个表的说明中。通常，这些数据仅限于表之间的索引和交叉引用所需的数据。两个例外是NAT实例表中描述NAT实例行为的对象，以及池表及其扩展中分配给每个地址池的资源的详细枚举。"
    },
    {
      "indent": 3,
      "text": "The NATV2-MIB module provides three sets of read-write objects, specifically related to other aspects of the module content. The first set controls the rate at which specific notifications are generated. The second set provides thresholds used to trigger the notifications. These objects are listed in Section 3.1.2.",
      "zh-CHS": "NATV2-MIB模块提供三组读写对象，具体与模块内容的其他方面相关。第一组控制生成特定通知的速率。第二组提供用于触发通知的阈值。第3.1.2节列出了这些对象。"
    },
    {
      "indent": 3,
      "text": "A third set of read-write objects sets limits on resource consumption per NAT instance and per subscriber. When these limits are reached, packets requiring further consumption of the given resource are",
      "zh-CHS": "第三组读写对象限制每个NAT实例和每个订户的资源消耗。当达到这些限制时，需要进一步消耗给定资源的数据包被删除"
    },
    {
      "indent": 3,
      "text": "dropped rather than translated. Statistics described in Section 3.1.4 record the numbers of packets dropped. Limits are provided for:",
      "zh-CHS": "删除而不是翻译。第3.1.4节中描述的统计数据记录丢弃的数据包数量。规定了以下限制："
    },
    {
      "indent": 3,
      "text": "o total number of address map entries over the NAT instance. Limit is set by object natv2InstanceLimitAddressMapEntries in table natv2InstanceTable. Dropped packets are counted in natv2InstanceAddressMapEntryLimitDrops in that table.",
      "zh-CHS": "o NAT实例上的地址映射项总数。限制由表natv2InstanceTable中的对象natv2InstanceLimitAddressMapEntries设置。丢弃的数据包在该表的natv2InstanceAddressMapEntryLimitDrops中计数。"
    },
    {
      "indent": 3,
      "text": "o total number of port map entries over the NAT instance. Limit is set by object natv2InstanceLimitPortMapEntries in table natv2InstanceTable. Dropped packets are counted in natv2InstancePortMapEntryLimitDrops in that table.",
      "zh-CHS": "o NAT实例上端口映射项的总数。限制由表natv2InstanceTable中的对象natv2InstanceLimitPortMapEntries设置。丢弃的数据包在该表的natv2InstancePortMapEntryLimitDrops中计数。"
    },
    {
      "indent": 3,
      "text": "o total number of held fragments (applicable only when the NAT instance can receive fragments out of order; see [RFC4787], Section 11). Limit is set by object natv2InstanceLimitPendingFragments in table natv2InstanceTable. Dropped packets are counted by natv2InstanceFragmentDrops in the same table.",
      "zh-CHS": "o 保留片段的总数（仅当NAT实例可以接收无序的片段时适用；请参阅[RFC4787]，第11节）。限制由表natv2InstanceTable中的对象natv2InstanceLimitPendingFragments设置。丢弃的数据包由同一表中的natv2InstanceFragmentDrops计数。"
    },
    {
      "indent": 3,
      "text": "o total number of active subscribers (i.e., subscribers having at least one mapping table entry) over the NAT instance. Limit is set by object natv2InstanceLimitSubscriberActives in table natv2InstanceTable. Dropped packets are counted by natv2InstanceSubscriberActiveLimitDrops in the same table.",
      "zh-CHS": "o NAT实例上的活动订阅服务器总数（即，至少有一个映射表项的订阅服务器）。限制由表natv2InstanceTable中的对象natv2InstanceLimitSubscriberActives设置。丢弃的数据包由同一表中的natv2InstanceSubscriberActiveLimitDrops计数。"
    },
    {
      "indent": 3,
      "text": "o number of port map entries for an individual subscriber. Limit is set by object natv2SubscriberLimitPortMapEntries in table natv2SubscriberTable. Dropped packets are counted by natv2SubscriberPortMapFailureDrops in the same table. Note that, unlike in the instance table, the per-subscriber count is lumped in with the count of packets dropped because of failures to allocate a port map entry for other reasons to save on storage.",
      "zh-CHS": "o 单个订阅服务器的端口映射条目数。限制由表natv2SubscriberTable中的对象natv2SubscriberLimitPortMapEntries设置。丢弃的数据包由同一表中的natv2SubscriberPortMapFailureDrops统计。请注意，与实例表中不同的是，每个订户计数与由于分配端口映射项失败而丢弃的数据包计数合并在一起，以节省存储空间。"
    },
    {
      "indent": 0,
      "text": "3.1.2. Notifications",
      "section_title": true,
      "zh-CHS": "3.1.2. 通知"
    },
    {
      "indent": 3,
      "text": "NATV2-MIB provides five notifications, intended to provide warning of the need to provision or reallocate NAT resources. As indicated in the previous section, each notification is associated with two read-write objects: a control on the rate at which that notification is generated and a threshold value used to trigger the notification in the first place. The default setting within the MIB module specification is that all notifications are disabled. The setting of threshold values is discussed in Section 5.",
      "zh-CHS": "NATV2-MIB提供了五个通知，旨在警告需要提供或重新分配NAT资源。如前一节所述，每个通知都与两个读写对象相关联：对生成通知的速率的控制和用于首先触发通知的阈值。MIB模块规范中的默认设置是禁用所有通知。第5节讨论了阈值的设置。"
    },
    {
      "indent": 3,
      "text": "The five notifications are as follows:",
      "zh-CHS": "五份通知如下:"
    },
    {
      "indent": 3,
      "text": "o Two notifications relate to the management of address pools. One indicates that usage equals or exceeds an upper threshold and is therefore a warning that the pool may be over-utilized unless more addresses are assigned to it. The other notification indicates that usage equals or has fallen below a lower threshold, suggesting that some addresses allocated to that pool could be reallocated to other pools. Address pool usage is calculated as the percentage of the total number of ports allocated to the address pool that are already in use, for the most-mapped protocol at the time the notification is generated. The notifications identify that protocol and report the number of port map entries for that protocol in the given address pool at the moment the notification was triggered.",
      "zh-CHS": "o 两个通知与地址池的管理有关。一个表示使用率等于或超过上限阈值，因此是一个警告，表示除非为池分配更多地址，否则池可能会被过度利用。另一个通知表示使用率等于或低于较低的阈值，这表明分配给该池的某些地址可以重新分配给其他池。对于生成通知时映射最多的协议，地址池使用率计算为已在使用的分配给地址池的端口总数的百分比。通知标识该协议，并报告触发通知时给定地址池中该协议的端口映射条目数。"
    },
    {
      "indent": 3,
      "text": "o Two notifications relate to the number of address and port map entries, respectively, in total over the whole NAT instance. In both cases, the threshold that triggers the notification is an upper threshold. The notifications return the number of mapping entries of the given type, plus a cumulative counter of the number of entries created in that mapping table at the moment the notification was triggered. The intent is that the notifications provide a warning that the total number of address or port map entries is approaching the configured limit.",
      "zh-CHS": "o 两个通知分别与整个NAT实例上的地址和端口映射条目总数有关。在这两种情况下，触发通知的阈值都是较高的阈值。通知返回给定类型的映射条目数，加上触发通知时在该映射表中创建的条目数的累积计数器。其目的是通知提供一个警告，指出地址或端口映射项的总数正在接近配置的限制。"
    },
    {
      "indent": 3,
      "text": "o The final notification is generated on a per-subscriber basis when the number of port map entries for that subscriber crosses the associated threshold. The objects returned by this notification are similar to those returned for the instance-level mapping notifications. This notification is a warning that the number of port map entries for the subscriber is approaching the configured limit for that subscriber.",
      "zh-CHS": "o 当每个订户的端口映射条目数超过相关阈值时，将根据该订户生成最终通知。此通知返回的对象与实例级映射通知返回的对象类似。此通知是一个警告，表示订阅服务器的端口映射条目数正在接近该订阅服务器的配置限制。"
    },
    {
      "indent": 3,
      "text": "Here is a detailed specification of the notifications. A given notification can be disabled by setting the threshold to -1 (default).",
      "zh-CHS": "以下是通知的详细说明。通过将阈值设置为-1（默认值），可以禁用给定的通知。"
    },
    {
      "indent": 3,
      "text": "Notification: natv2NotificationPoolUsageLow. Indicates that address pool usage for the most-mapped protocol equals or is less than the threshold value.",
      "zh-CHS": "通知：natv2NotificationPoolUsageLow。指示most映射协议的地址池使用率等于或小于阈值。"
    },
    {
      "indent": 3,
      "text": "Compared value: natv2PoolNotifiedPortMapEntries as a percentage of total available ports in the pool.",
      "zh-CHS": "比较值：natv2PoolNotifiedPortMapEntries占池中总可用端口的百分比。"
    },
    {
      "indent": 3,
      "text": "Threshold: natv2PoolThresholdUsageLow in natv2PoolTable.",
      "zh-CHS": "阈值：natv2PoolThresholdUsageLow在natv2PoolTable中。"
    },
    {
      "indent": 3,
      "text": "Objects returned: natv2PoolNotifiedPortMapEntries and natv2PoolNotifiedPortMapProtocol in natv2PoolTable.",
      "zh-CHS": "返回的对象：natv2PoolNotifiedPortMapEntries和natv2PoolNotifiedPortMapProtocol在natv2PoolTable中。"
    },
    {
      "indent": 3,
      "text": "Rate control: natv2PoolNotificationInterval in natv2PoolTable.",
      "zh-CHS": "速率控制：natv2PoolTable中的natv2PoolNotificationInterval。"
    },
    {
      "indent": 3,
      "text": "Notification: natv2NotificationPoolUsageHigh. Indicates that address pool usage for the most-mapped protocol has risen to the threshold value or more.",
      "zh-CHS": "通知：natv2NotificationPoolUsageHigh。指示most映射协议的地址池使用率已上升到阈值或更高。"
    },
    {
      "indent": 3,
      "text": "Compared value: natv2PoolNotifiedPortMapEntries as a percentage of total available ports in the pool.",
      "zh-CHS": "比较值：natv2PoolNotifiedPortMapEntries占池中总可用端口的百分比。"
    },
    {
      "indent": 3,
      "text": "Threshold: natv2PoolThresholdUsageHigh in natv2PoolTable.",
      "zh-CHS": "阈值：natv2PoolThresholdUsageHigh在natv2PoolTable中。"
    },
    {
      "indent": 3,
      "text": "Objects returned: natv2PoolNotifiedPortMapEntries and natv2PoolNotifiedPortMapProtocol in natv2PoolTable.",
      "zh-CHS": "返回的对象：natv2PoolNotifiedPortMapEntries和natv2PoolNotifiedPortMapProtocol在natv2PoolTable中。"
    },
    {
      "indent": 3,
      "text": "Rate control: natv2PoolNotificationInterval in natv2PoolTable.",
      "zh-CHS": "速率控制：natv2PoolTable中的natv2PoolNotificationInterval。"
    },
    {
      "indent": 3,
      "text": "Notification: natv2NotificationInstanceAddressMapEntriesHigh. Indicates that the total number of entries in the address map table over the whole NAT instance equals or exceeds the threshold value.",
      "zh-CHS": "通知：NATv2NotificationStanceAddressApentriesHigh。指示整个NAT实例上地址映射表中的条目总数等于或超过阈值。"
    },
    {
      "indent": 3,
      "text": "Compared value: natv2InstanceAddressMapEntries in natv2InstanceTable.",
      "zh-CHS": "比较值：natv2InstanceTable中的natv2InstanceAddressMapEntries。"
    },
    {
      "indent": 3,
      "text": "Threshold: natv2InstanceThresholdAddressMapEntriesHigh in natv2InstanceTable.",
      "zh-CHS": "阈值：natv2InstanceTable中的NATv2InstanceThresholdAddressMapEntriesh高。"
    },
    {
      "indent": 3,
      "text": "Objects returned: natv2InstanceAddressMapEntries and natv2InstanceAddressMapCreations in natv2InstanceTable.",
      "zh-CHS": "返回的对象：natv2InstanceAddressMapEntries和natv2InstanceAddressMapCreations在natv2InstanceTable中。"
    },
    {
      "indent": 3,
      "text": "Rate control: natv2InstanceNotificationInterval in natv2InstanceTable.",
      "zh-CHS": "速率控制：natv2InstanceTable中的natv2InstanceNotificationInterval。"
    },
    {
      "indent": 3,
      "text": "Notification: natv2NotificationInstancePortMapEntriesHigh. Indicates that the total number of entries in the port map table over the whole NAT instance equals or exceeds the threshold value.",
      "zh-CHS": "通知：NATv2NotificationStanCeportMapEntrieshigh。指示整个NAT实例上端口映射表中的条目总数等于或超过阈值。"
    },
    {
      "indent": 3,
      "text": "Compared value: natv2InstancePortMapEntries in natv2InstanceTable.",
      "zh-CHS": "比较值：natv2InstanceTable中的natv2InstancePortMapEntries。"
    },
    {
      "indent": 3,
      "text": "Threshold: natv2InstanceThresholdPortMapEntriesHigh in natv2InstanceTable.",
      "zh-CHS": "阈值：NATv2InstanceThresholdPortMapEntrieshHigh在natv2InstanceTable中。"
    },
    {
      "indent": 3,
      "text": "Objects returned: natv2InstancePortMapEntries and natv2InstancePortMapCreations in natv2InstanceTable.",
      "zh-CHS": "返回的对象：natv2InstanceTable中的natv2InstancePortMapEntries和natv2InstancePortMapCreations。"
    },
    {
      "indent": 3,
      "text": "Rate control: natv2InstanceNotificationInterval in natv2InstanceTable.",
      "zh-CHS": "速率控制：natv2InstanceTable中的natv2InstanceNotificationInterval。"
    },
    {
      "indent": 3,
      "text": "Notification: natv2NotificationSubscriberPortMapEntriesHigh. Indicates that the total number of entries in the port map table for the given subscriber equals or exceeds the threshold value configured for that subscriber.",
      "zh-CHS": "通知：natv2NotificationSubscriberPortMapEntriesHigh。指示给定订阅服务器的端口映射表中的项目总数等于或超过为该订阅服务器配置的阈值。"
    },
    {
      "indent": 3,
      "text": "Compared value: natv2SubscriberPortMapEntries in natv2SubscriberTable.",
      "zh-CHS": "比较值：natv2SubscriberTable中的natv2SubscriberPortMapEntries。"
    },
    {
      "indent": 3,
      "text": "Threshold: natv2SubscriberThresholdPortMapEntriesHigh in natv2SubscriberTable.",
      "zh-CHS": "阈值：NATv2SubscriberThresholdPortMapEntriesh在natv2SubscriberTable中较高。"
    },
    {
      "indent": 3,
      "text": "Objects returned: natv2SubscriberPortMapEntries and natv2SubscriberPortMapCreations in natv2SubscriberTable.",
      "zh-CHS": "返回的对象：natv2SubscriberPortMapEntries和natv2SubscriberPortMapCreations在natv2SubscriberTable中。"
    },
    {
      "indent": 3,
      "text": "Rate control: natv2SubscriberNotificationInterval in natv2SubscriberTable.",
      "zh-CHS": "速率控制：natv2SubscriberNotificationInterval在natv2SubscriberTable中。"
    },
    {
      "indent": 0,
      "text": "3.1.3. State Information",
      "section_title": true,
      "zh-CHS": "3.1.3. 状态信息"
    },
    {
      "indent": 3,
      "text": "State information provides a snapshot of the content and extent of the NAT mapping tables at a given moment of time. The address and port mapping tables are described in detail below. In addition to these tables, two state variables are provided: current number of entries in the address mapping table, and current number of entries in the port mapping table. With one exception, these are provided at four levels of granularity: per NAT instance, per protocol, per address pool, and per subscriber. Address map entries are not tracked per protocol, since address mapping is protocol independent.",
      "zh-CHS": "状态信息提供给定时刻NAT映射表的内容和范围的快照。下面详细描述地址和端口映射表。除了这些表之外，还提供了两个状态变量：地址映射表中的当前条目数和端口映射表中的当前条目数。除了一个例外，它们以四个粒度级别提供：每个NAT实例、每个协议、每个地址池和每个订户。由于地址映射与协议无关，因此不会按照协议跟踪地址映射条目。"
    },
    {
      "indent": 0,
      "text": "3.1.4. Statistics",
      "section_title": true,
      "zh-CHS": "3.1.4. 统计数字"
    },
    {
      "indent": 3,
      "text": "NATV2-MIB provides a number of counters, intended to help with both the provisioning of the NAT and the debugging of problems. As with the state data, these counters are provided at the four levels of NAT instance, protocol, address pool, and subscriber when they make sense. Each counter is cumulative, beginning from a \"last discontinuity time\" recorded by an object that is usually in the table containing the counter.",
      "zh-CHS": "NATV2-MIB提供了许多计数器，旨在帮助提供NAT和调试问题。与状态数据一样，这些计数器在NAT实例、协议、地址池和订户的四个级别上提供（如果有意义）。每个计数器都是累积的，从一个对象记录的“上次不连续时间”开始，该对象通常位于包含计数器的表中。"
    },
    {
      "indent": 3,
      "text": "The basic set of counters, as reflected in the NAT instance table, is as follows:",
      "zh-CHS": "NAT实例表中反映的基本计数器集如下所示："
    },
    {
      "indent": 3,
      "text": "Translations: number of packets processed and translated (in this case, in total for the NAT instance).",
      "zh-CHS": "Translations：处理和转换的数据包数（在本例中，NAT实例的总数）。"
    },
    {
      "indent": 3,
      "text": "Address map entry creations: cumulative number of address map entries created, including static mappings.",
      "zh-CHS": "地址映射条目创建：创建的地址映射条目的累积数量，包括静态映射。"
    },
    {
      "indent": 3,
      "text": "Port map entry creations: cumulative number of port map entries created, including static mappings.",
      "zh-CHS": "端口映射条目创建：创建的端口映射条目的累积数量，包括静态映射。"
    },
    {
      "indent": 3,
      "text": "Address map limit drops: cumulative number of packets dropped rather than translated because the packet would have triggered the creation of a new address mapping, but the configured limit on number of address map entries has already been reached.",
      "zh-CHS": "Address map limit drops（地址映射限制丢弃）：由于数据包会触发新地址映射的创建，但已达到配置的地址映射条目的数量限制，因此丢弃而不是转换的数据包的累积数量。"
    },
    {
      "indent": 3,
      "text": "Port map limit drops: cumulative number of packets dropped rather than translated because the packet would have triggered the creation of a new port mapping, but the configured limit on number of port map entries has already been reached.",
      "zh-CHS": "Port map limit drops（端口映射限制丢弃）：丢弃而不是转换的数据包的累积数量，因为该数据包会触发新端口映射的创建，但已达到配置的端口映射条目数量限制。"
    },
    {
      "indent": 3,
      "text": "Active subscriber limit drops: cumulative number of packets dropped rather than translated because the packet would have triggered the creation of a new address and/or port mapping for a subscriber with no existing entries in either table, but the configured limit on number of active subscribers has already been reached.",
      "zh-CHS": "主动订阅者限制丢弃：丢弃而不是转换的数据包的累积数量，因为该数据包会触发在两个表中都没有现有条目的订阅者的新地址和/或端口映射的创建，但已达到配置的主动订阅者数量限制。"
    },
    {
      "indent": 3,
      "text": "Address mapping failure drops: cumulative number of packets dropped because the packet would have triggered the creation of a new address mapping, but no address could be allocated in the external realm concerned because all addresses from the selected address pool (or the whole realm, if no address pool has been configured for that realm) have already been fully allocated.",
      "zh-CHS": "地址映射失败丢弃：由于数据包会触发新地址映射的创建而丢弃的数据包的累积数量，但由于所选地址池（或整个域，如果没有为该域配置地址池）中的所有地址，因此无法在相关的外部域中分配地址已全部分配。"
    },
    {
      "indent": 3,
      "text": "Port mapping failure drops: cumulative number of packets dropped because the packet would have triggered the creation of a new port mapping, but no port could be allocated for the protocol concerned. The precise conditions under which these packet drops occur depend on the pooling behavior [RFC4787] configured or implemented in the NAT instance. See the DESCRIPTION clause for the natv2InstancePortMapFailureDrops object for a detailed description of the different cases. These cases were defined with care to ensure that address mapping failure could be distinguished from port mapping failure.",
      "zh-CHS": "端口映射失败丢弃：由于数据包会触发新端口映射的创建，但无法为相关协议分配任何端口，因此丢弃的数据包的累积数量。这些数据包丢失发生的确切条件取决于NAT实例中配置或实现的池行为[RFC4787]。有关不同情况的详细说明，请参阅natv2InstancePortMapFailureDrops对象的DESCRIPTION子句。这些情况的定义是为了确保地址映射失败可以与端口映射失败区分开来。"
    },
    {
      "indent": 3,
      "text": "Fragment drops: cumulative number of packets dropped because the packet contains a fragment, and the fragment behavior [RFC4787] configured or implemented in the NAT instance indicates that the packet should be dropped. The main case is a NAT instance that meets REQ-14 of [RFC4787], hence it can receive and process out-of-order fragments. In that case, dropping occurs only when the",
      "zh-CHS": "Fragment drops：由于数据包包含一个片段而丢弃的数据包的累积数量，并且在NAT实例中配置或实现的片段行为[RFC4787]指示应该丢弃该数据包。主要情况是NAT实例满足[RFC4787]的REQ-14，因此它可以接收和处理无序片段。在这种情况下，只有当"
    },
    {
      "indent": 6,
      "text": "configured limit on pending fragments provided by NATV2-MIB has already been reached. The other cases are detailed in the DESCRIPTION clause of the natv2InstanceFragmentBehavior object.",
      "zh-CHS": "已达到NATV2-MIB提供的挂起片段的配置限制。natv2InstanceFragmentBehavior对象的DESCRIPTION子句中详细介绍了其他情况。"
    },
    {
      "indent": 3,
      "text": "Other resource drops: cumulative number of packets dropped because of unavailability of some other resource. The most likely case would be packets where the upper-layer protocol is not one supported by the NAT instance.",
      "zh-CHS": "其他资源丢弃：由于某些其他资源不可用而丢弃的数据包的累积数量。最可能的情况是上层协议不受NAT实例支持的数据包。"
    },
    {
      "indent": 3,
      "text": "Table 1 indicates the granularities at which these statistics are reported.",
      "zh-CHS": "表1显示了报告这些统计数据的粒度。"
    },
    {
      "indent": 3,
      "text": "+-----------------------+------------+----------+------+------------+\n| Statistic             |    NAT     | Protocol | Pool | Subscriber |\n|                       |  Instance  |          |      |            |\n+-----------------------+------------+----------+------+------------+\n| Translations          |    Yes     |   Yes    |  No  |    Yes     |\n|                       |            |          |      |            |\n| Address map entry     |    Yes     |    No    | Yes  |    Yes     |\n| creations             |            |          |      |            |\n|                       |            |          |      |            |\n| Port map entry        |    Yes     |   Yes    | Yes  |    Yes     |\n| creations             |            |          |      |            |\n|                       |            |          |      |            |\n| Address map limit     |    Yes     |    No    |  No  |     No     |\n| drops                 |            |          |      |            |\n|                       |            |          |      |            |\n| Port map limit drops  |    Yes     |    No    |  No  |    Yes     |\n|                       |            |          |      |            |\n| Active subscriber     |    Yes     |    No    |  No  |     No     |\n| limit drops           |            |          |      |            |\n|                       |            |          |      |            |\n| Address mapping       |    Yes     |    No    | Yes  |    Yes     |\n| failure drops         |            |          |      |            |\n|                       |            |          |      |            |\n| Port mapping failure  |    Yes     |   Yes    | Yes  |    Yes     |\n| drops                 |            |          |      |            |\n|                       |            |          |      |            |\n| Fragment drops        |    Yes     |    No    |  No  |     No     |\n|                       |            |          |      |            |\n| Other resource drops  |    Yes     |    No    |  No  |     No     |\n+-----------------------+------------+----------+------+------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Table 1: Statistics Provided By Level of Granularity",
      "zh-CHS": "表1：按粒度级别提供的统计信息"
    },
    {
      "indent": 0,
      "text": "3.2. Outline of MIB Module Organization",
      "section_title": true,
      "zh-CHS": "3.2. MIB模块组织概要"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows how object identifiers are organized in the NATV2-MIB module. Under the general natv2MIB object identifier in the mib-2 tree, the objects are classed into four groups:",
      "zh-CHS": "图1显示了NATV2-MIB模块中对象标识符的组织方式。在mib-2树中的通用natv2MIB对象标识符下，对象分为四组："
    },
    {
      "indent": 3,
      "text": "natv2MIBNotifications(0): identifies the five notifications described in Section 3.1.2.",
      "zh-CHS": "natv2MIBNotifications（0）：标识第3.1.2节中描述的五个通知。"
    },
    {
      "indent": 3,
      "text": "natv2MIBDeviceObjects(1): identifies objects relating to the whole device, specifically, the subscriber table.",
      "zh-CHS": "natv2MIBDeviceObjects（1）：标识与整个设备相关的对象，特别是订户表。"
    },
    {
      "indent": 3,
      "text": "natv2MIBInstanceObjects(2): identifies objects relating to individual NAT instances. These include the NAT instance table, the protocol table, the address pool table and its address range expansion, the address map table, and the port map table.",
      "zh-CHS": "NATv2MiInstanceObjects（2）：标识与单个NAT实例相关的对象。其中包括NAT实例表、协议表、地址池表及其地址范围扩展、地址映射表和端口映射表。"
    },
    {
      "indent": 3,
      "text": "natv2MIBConformance(3): identifies the group and compliance clauses, specified for the three application scenarios described in Section 3.4.",
      "zh-CHS": "natv2MIBConformance（3）：标识针对第3.4节中描述的三种应用场景指定的组和合规性条款。"
    },
    {
      "indent": 3,
      "text": "                           natv2MIB\n                               |\n           +-------------+-------------+-------------+\n           |             |             |             |\n                         |             |             |\n           0             |             |             |\n natv2MIBNotifications   |             |             |\n    |                                  |             |\n    |                    1             |             |\n    |          natv2MIBDeviceObjects   |             |\n   Five            |                                 |\nnotifications      |                   2             |\n                   |         natv2MIBInstanceObjects |\n                   |             |\n               Subscriber        |                   3\n               table             |         natv2MIBConformance\n                                 |                   |\n                                 |                   |\n                                 Six per-NAT-        |\n                             instance tables         |\n                                                     |\n                       +----------------------+-------\n                       |                      |\n                       |                      |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "         1                      2\nnatv2MIBCompliances       natv2MIBGroups\n         |                      |\n         |                      |\n       Basic                  Basic\n       pooled                 pooled\n  carrier-grade NAT     carrier-grade NAT",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Figure 1: Organization of Object Identifiers for NATV2-MIB",
      "zh-CHS": "图1:NATV2-MIB对象标识符的组织"
    },
    {
      "indent": 0,
      "text": "3.3. Detailed MIB Module Walk-Through",
      "section_title": true,
      "zh-CHS": "3.3. 详细的MIB模块演练"
    },
    {
      "indent": 3,
      "text": "This section reviews the contents of the NATV2-MIB module. The table descriptions include references to subsections of Section 3.1 where desirable to avoid repetition of that information.",
      "zh-CHS": "本节回顾NATV2-MIB模块的内容。表格说明包括第3.1节各小节的参考，以避免重复该信息。"
    },
    {
      "indent": 0,
      "text": "3.3.1. Textual Conventions",
      "section_title": true,
      "zh-CHS": "3.3.1. 文字约定"
    },
    {
      "indent": 3,
      "text": "The module defines four key textual conventions: ProtocolNumber, Natv2SubscriberIndex, Natv2InstanceIndex, and Natv2PoolIndex. ProtocolNumber is based on the IANA registry of protocol numbers and hence is potentially reusable by other MIB modules.",
      "zh-CHS": "该模块定义了四个关键的文本约定：ProtocolNumber、Natv2SubscriberIndex、Natv2InstanceIndex和Natv2PoolIndex。ProtocolNumber基于协议编号的IANA注册表，因此可能被其他MIB模块重用。"
    },
    {
      "indent": 3,
      "text": "Objects of type Natv2SubscriberIndex identify individual subscribers served by the NAT device. The values of these identifiers are administered and, in intent, are permanently associated with their respective subscribers. Reuse of a value after a subscriber has been deleted is discouraged. The scope of the subscriber index was defined to be at the device rather than the NAT instance level to make it easier to shift subscribers between instances (e.g., for load balancing).",
      "zh-CHS": "Natv2SubscriberIndex类型的对象标识NAT设备所服务的各个订阅者。这些标识符的值被管理，并且意图与它们各自的订阅者永久关联。不鼓励在删除订阅服务器后重新使用值。订户索引的范围被定义为在设备而不是NAT实例级别，以便于在实例之间转移订户（例如，为了负载平衡）。"
    },
    {
      "indent": 3,
      "text": "Objects of type Natv2InstanceIndex identify specific NAT instances on the device. Again, these are administered values intended to be permanently associated with the NAT instances to which they have been assigned.",
      "zh-CHS": "Natv2InstanceIndex类型的对象标识设备上的特定NAT实例。同样，这些是管理值，旨在与分配给它们的NAT实例永久关联。"
    },
    {
      "indent": 3,
      "text": "Objects of type Natv2PoolIndex identify individual address pools in a given NAT instance. As with the subscriber and instance index objects, the pool identifiers are administered and intended to be permanently associated with their respective pools.",
      "zh-CHS": "Natv2PoolIndex类型的对象标识给定NAT实例中的各个地址池。与订阅者和实例索引对象一样，池标识符被管理，并打算与各自的池永久关联。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Notifications",
      "section_title": true,
      "zh-CHS": "3.3.2. 通知"
    },
    {
      "indent": 3,
      "text": "Notifications were described in Section 3.1.2.",
      "zh-CHS": "第3.1.2节描述了通知。"
    },
    {
      "indent": 0,
      "text": "3.3.3. The Subscriber Table: natv2SubscriberTable",
      "section_title": true,
      "zh-CHS": "3.3.3. 订阅服务器表：natv2SubscriberTable"
    },
    {
      "indent": 3,
      "text": "Table natv2SubscriberTable is indexed by the subscriber index. One conceptual row contains information relating to a specific subscriber: the subscriber's internal address or prefix for correlation with other management information; state and statistical information as described in Sections 3.1.3 and 3.1.4; the per-subscriber control objects described in Section 3.1.1; and natv2SubscriberDiscontinuityTime, which provides a timestamp of the latest time following, which the statistics have accumulated without discontinuity.",
      "zh-CHS": "表natv2SubscriberTable由订户索引索引。一个概念行包含与特定订阅者相关的信息：订阅者的内部地址或与其他管理信息相关的前缀；第3.1.3节和第3.1.4节所述的状态和统计信息；第3.1.1节所述的每用户控制对象；natv2SubscriberDiscontinuityTime，它提供了统计数据无中断累积的最新时间的时间戳。"
    },
    {
      "indent": 3,
      "text": "Turning back to the address information for a moment: this information includes the identity of the address realm in which the address is routable. That enables support of an arbitrary number of address realms on the same NAT instance. Address realm identifiers are administered values in the form of a limited-length SnmpAdminString. In the absence of configuration to the contrary, the default realm for all internal addresses as recorded in mapping entries is \"internal\".",
      "zh-CHS": "回到地址信息：此信息包括地址可路由的地址域的标识。这使得在同一NAT实例上支持任意数量的地址域。地址域标识符是以有限长度snmpadmin字符串形式管理的值。在没有相反配置的情况下，映射条目中记录的所有内部地址的默认域为“内部”。"
    },
    {
      "indent": 6,
      "text": "The term \"address realm\" is defined in [RFC2663], Section 2.1 and reused in subsequent NAT-related documents.",
      "zh-CHS": "术语“地址域”在[RFC2663]第2.1节中定义，并在后续NAT相关文档中重复使用。"
    },
    {
      "indent": 3,
      "text": "In the special case of Dual-Stack Lite (DS-Lite) [RFC6333], for unique matching of the subscriber data to other information in the MIB module, it is necessary that the address information should relate to the outer IPv6 header of packets going to or from the host, with the address realm being the one in which that IPv6 address is routable. The presentation of address information for other types of tunneled access to the NAT is out of scope.",
      "zh-CHS": "在双栈Lite（DS Lite）[RFC6333]的特殊情况下，为了使订户数据与MIB模块中的其他信息唯一匹配，地址信息必须与进出主机的数据包的外部IPv6报头相关，其中地址域是IPv6地址可路由的域。其他类型的NAT隧道访问的地址信息表示超出范围。"
    },
    {
      "indent": 0,
      "text": "3.3.4. The Instance Table: natv2InstanceTable",
      "section_title": true,
      "zh-CHS": "3.3.4. 实例表：natv2InstanceTable"
    },
    {
      "indent": 3,
      "text": "Table natv2InstanceTable is indexed by an object of type Natv2InstanceIndex. A conceptual row of this table provides information relating to a particular NAT instance configured on the device.",
      "zh-CHS": "表natv2InstanceTable由Natv2InstanceIndex类型的对象索引。此表的概念行提供与设备上配置的特定NAT实例相关的信息。"
    },
    {
      "indent": 3,
      "text": "Configuration information provided by this table includes an instance name of type DisplayString that may have been configured for this instance and a set of objects indicating, respectively, the port mapping, filtering, pooling, and fragment behaviors configured or implemented in the instance. These behaviors are all defined in [RFC4787]. Their values affect the interpretation of some of the statistics provided in the instance table.",
      "zh-CHS": "此表提供的配置信息包括可能已为此实例配置的DisplayString类型的实例名称和一组对象，分别指示实例中配置或实现的端口映射、筛选、池和片段行为。这些行为都在[RFC4787]中定义。它们的值会影响实例表中提供的某些统计信息的解释。"
    },
    {
      "indent": 3,
      "text": "Read-write objects listed in Section 3.1.2 set the notification rate for instance-level notifications and set the thresholds that trigger them. Additional read-write objects described in Section 3.1.1 set limits on the number of address and port mapping entries, number of pending fragments, and number of active subscribers for the instance.",
      "zh-CHS": "第3.1.2节中列出的读写对象设置实例级通知的通知速率，并设置触发它们的阈值。第3.1.1节中描述的其他读写对象对实例的地址和端口映射项的数量、挂起片段的数量以及活动订阅服务器的数量设置了限制。"
    },
    {
      "indent": 3,
      "text": "The state and statistical information provided by this table consists of the per-instance items described in Sections 3.1.3 and 3.1.4, respectively. natv2InstanceDiscontinuityTime is a timestamp giving the time beyond which all of the statistical counters in natv2InstanceTable are guaranteed to have accumulated continuously.",
      "zh-CHS": "本表提供的状态和统计信息包括第3.1.3节和第3.1.4节分别描述的每个实例项。NATv2InstanceInjunctionTime是一个时间戳，给出了natv2InstanceTable中所有统计计数器保证连续累积的时间。"
    },
    {
      "indent": 0,
      "text": "3.3.5. The Protocol Table: natv2ProtocolTable",
      "section_title": true,
      "zh-CHS": "3.3.5. 协议表：natv2ProtocolTable"
    },
    {
      "indent": 3,
      "text": "The protocol table is indexed by the NAT instance number and an object of type ProtocolNumber as described in Section 3.3.1 (i.e., an IANA-registered protocol number). The set of protocols supported by the NAT instance is implementation dependent, but they MUST include ICMP(1), TCP(6), UDP(17), and ICMPv6(58). Depending on the application, it SHOULD include IPv4 encapsulation(4), IPv6 encapsulation(41), IPsec AH(51), and SCTP(132). Support of PIM(103) is highly desirable.",
      "zh-CHS": "协议表由NAT实例号和第3.3.1节中描述的ProtocolNumber类型的对象（即IANA注册的协议号）索引。NAT实例支持的协议集取决于实现，但它们必须包括ICMP（1）、TCP（6）、UDP（17）和ICMPv6（58）。根据应用程序的不同，它应该包括IPv4封装（4）、IPv6封装（41）、IPsec AH（51）和SCTP（132）。非常需要PIM（103）的支持。"
    },
    {
      "indent": 3,
      "text": "This table includes no configuration information. The state and statistical information provided by this table consists of the per-protocol items described in Sections 3.1.3 and 3.1.4, respectively. natv2InstanceDiscontinuityTime in natv2InstanceTable is reused as the timestamp giving the time beyond which all of the statistical counters in natv2ProtocolTable are guaranteed to have accumulated continuously. The reasoning is that any event affecting the continuity of per-protocol statistics will affect the continuity of NAT instance statistics, and vice versa.",
      "zh-CHS": "此表不包含任何配置信息。本表提供的状态和统计信息包括第3.1.3节和第3.1.4节中分别描述的每个协议项。natv2InstanceTable中的NATv2InstanceInjunctionTime被重用为时间戳，给出了natv2ProtocolTable中所有统计计数器保证连续累积的时间。原因是任何影响每协议统计数据连续性的事件都会影响NAT实例统计数据的连续性，反之亦然。"
    },
    {
      "indent": 0,
      "text": "3.3.6. The Address Pool Table: natv2PoolTable",
      "section_title": true,
      "zh-CHS": "3.3.6. 地址池表：natv2PoolTable"
    },
    {
      "indent": 3,
      "text": "The address pool table is indexed by the NAT instance identifier for the instance on which it is provisioned, plus a pool index of type Natv2PoolIndex. Configuration information provided includes the address realm for which the pool provides addresses, the type of address (IPv4 or IPv6) supported by the realm, plus the port range it makes available for allocation. The same set of port numbers (or, in the ICMP case, identifier values) is made available for every protocol supported by the NAT instance. The port range is specified in terms of minimum and maximum port number.",
      "zh-CHS": "地址池表由提供该表的实例的NAT实例标识符加上Natv2PoolIndex类型的池索引编制索引。提供的配置信息包括池为其提供地址的地址域、域支持的地址类型（IPv4或IPv6）以及它为分配提供的端口范围。NAT实例支持的每个协议都提供相同的端口号集（或者，在ICMP情况下，标识符值）。端口范围按最小和最大端口号指定。"
    },
    {
      "indent": 3,
      "text": "The state and statistical information provided by this table consists of the per-pool items described in Sections 3.1.3 and 3.1.4 respectively, plus two additional state objects described below. natv2PoolTable provides the pool-specific object natv2PoolDiscontinuityTime to indicate the time since the statistical counters have accumulated continuously.",
      "zh-CHS": "本表提供的状态和统计信息包括分别在第3.1.3节和第3.1.4节中描述的每个池项目，以及下面描述的两个附加状态对象。natv2PoolTable提供特定于池的对象NATv2PoolInjuncityTime，以指示统计计数器连续累积以来的时间。"
    },
    {
      "indent": 3,
      "text": "Read-write objects to set high and low thresholds for pool usage notifications and for governing the notification rate were identified in Section 3.1.2.",
      "zh-CHS": "第3.1.2节确定了用于设置池使用通知的高阈值和低阈值以及用于控制通知速率的读写对象。"
    },
    {
      "indent": 6,
      "text": "Implementation note: the thresholds are defined in terms of percentage of available port utilization. The number of available ports in a pool is equal to (max port - min port + 1) (from the natv2PoolTable configuration information) multiplied by the number of addresses provisioned in the pool (sum of number of addresses provided by each natv2PoolRangeTable conceptual row relating to that pool). At configuration time, the thresholds can be recalculated in terms of total number of port map entries corresponding to the configured percentage, so that runtime comparisons to the current number of port map entries require no further arithmetic operations.",
      "zh-CHS": "实施说明：阈值是根据可用端口利用率的百分比定义的。池中的可用端口数等于（最大端口-最小端口+1）（来自natv2PoolTable配置信息）乘以池中提供的地址数（与该池相关的每个natv2PoolRangeTable概念行提供的地址数之和）。在配置时，可以根据与配置的百分比相对应的端口映射项总数重新计算阈值，以便运行时与当前端口映射项数的比较不需要进一步的算术运算。"
    },
    {
      "indent": 3,
      "text": "natv2PoolTable also provides two state objects that are returned with the notifications. natv2PoolNotifiedPortMapProtocol identifies the most-mapped protocol at the time the notification was triggered.",
      "zh-CHS": "natv2PoolTable还提供了两个随通知返回的状态对象。natv2PoolNotifiedPortMapProtocol标识触发通知时映射最多的协议。"
    },
    {
      "indent": 3,
      "text": "natv2PoolNotifiedPortMapEntries provides the total number of port map entries for that protocol using addresses owned by this pool at that same time.",
      "zh-CHS": "natv2PoolNotifiedPortMapEntries提供同时使用此池拥有的地址的该协议的端口映射项总数。"
    },
    {
      "indent": 0,
      "text": "3.3.7. The Address Pool Address Range Table: natv2PoolRangeTable",
      "section_title": true,
      "zh-CHS": "3.3.7. 地址池地址范围表：natv2PoolRangeTable"
    },
    {
      "indent": 3,
      "text": "natv2PoolRangeTable provides configuration information only. It is an expansion of natv2PoolTable giving the address ranges with which a given address pool has been configured. As such, it is indexed by the combination of NAT instance index, address pool index, and a conceptual row index, where each conceptual row conveys a different address range. The address range is specified in terms of lowest address, highest address rather than the usual prefix notation to provide maximum flexibility.",
      "zh-CHS": "natv2PoolRangeTable仅提供配置信息。它是natv2PoolTable的扩展，提供了配置给定地址池的地址范围。因此，它通过NAT实例索引、地址池索引和概念行索引的组合进行索引，其中每个概念行传递不同的地址范围。地址范围是根据最低地址、最高地址而不是通常的前缀符号来指定的，以提供最大的灵活性。"
    },
    {
      "indent": 0,
      "text": "3.3.8. The Address Map Table: natv2AddressMapTable",
      "section_title": true,
      "zh-CHS": "3.3.8. 地址映射表：natv2AddressMapTable"
    },
    {
      "indent": 3,
      "text": "The address map table provides a table of mappings from internal to external address at a given moment. It is indexed by the combination of NAT instance index, internal realm, internal address type (IPv4 or IPv6) in that realm, the internal address of the local host for which the map entry was created, and a conceptual row index to traverse all of the entries relating to the same internal address.",
      "zh-CHS": "地址映射表提供了在给定时刻从内部地址到外部地址的映射表。它由NAT实例索引、内部域、该域中的内部地址类型（IPv4或IPv6）、为其创建映射项的本地主机的内部地址以及用于遍历与同一内部地址相关的所有项的概念行索引的组合进行索引。"
    },
    {
      "indent": 3,
      "text": "In the special case of DS-Lite [RFC6333], the internal address and realm used in the index are those of the IPv6 outer header. The IPv4 source address for the inner header, for which [RFC6333] has reserved addresses in the 192.0.0.0/29 range, is captured in two additional objects in the corresponding conceptual row: natv2AddressMapInternalMappedAddressType and natv2AddressMapInternalMappedAddress. In cases other than DS-Lite access, these objects have no meaning. (Other tunneled access is out of scope.)",
      "zh-CHS": "在DS Lite[RFC6333]的特例中，索引中使用的内部地址和域是IPv6外部头的地址和域。[RFC6333]在192.0.0.0/29范围内为其保留地址的内部标头的IPv4源地址在相应概念行的两个附加对象中捕获：NATv2AddressApInternalMappedAddressType和NATv2AddressApInternalMappedAddress。在DS Lite访问以外的情况下，这些对象没有任何意义。（其他隧道通道超出范围。）"
    },
    {
      "indent": 3,
      "text": "The additional information provided by natv2AddressMapTable consists of the external realm, address type in that realm, and mapped external address. Depending on implementation support, the table also provides the index of the address pool from which the external address was drawn and the index of the subscriber to which the map entry belongs.",
      "zh-CHS": "natv2AddressMapTable提供的附加信息包括外部域、该域中的地址类型和映射的外部地址。根据实现支持的不同，该表还提供了从中提取外部地址的地址池的索引以及映射项所属订阅服务器的索引。"
    },
    {
      "indent": 0,
      "text": "3.3.9. The Port Map Table: natv2PortMapTable",
      "section_title": true,
      "zh-CHS": "3.3.9. 端口映射表：natv2PortMapTable"
    },
    {
      "indent": 3,
      "text": "The port map table provides a table of mappings by protocol from external port, address, and realm to internal port, address, and realm. As such, it is indexed by the combination of NAT instance index, protocol number, external realm identifier, address type in that realm, external address, and external port. The mapping from",
      "zh-CHS": "端口映射表按协议提供从外部端口、地址和域到内部端口、地址和域的映射表。因此，它通过NAT实例索引、协议编号、外部领域标识符、该领域中的地址类型、外部地址和外部端口的组合进行索引。从"
    },
    {
      "indent": 3,
      "text": "external realm, address, and port to internal realm, address, and port is unique, so no conceptual row index is needed. The indexing is designed to make it easy to trace individual sessions back to the host, based on the contents of packets observed in the external realm.",
      "zh-CHS": "外部领域、地址和端口到内部领域、地址和端口是唯一的，因此不需要概念性的行索引。索引的目的是根据在外部领域中观察到的数据包内容，轻松地将单个会话追溯到主机。"
    },
    {
      "indent": 3,
      "text": "Beyond the indexing, the information provided by the port map table consists of the internal realm, address type, address, and port number, and, depending on implementation support, the index of the subscriber to which the map entry belongs.",
      "zh-CHS": "除了索引之外，端口映射表提供的信息还包括内部域、地址类型、地址和端口号，以及映射项所属订阅服务器的索引（取决于实现支持）。"
    },
    {
      "indent": 3,
      "text": "As with the address map table, special provision is made for the case of DS-Lite [RFC6333]. The realm and outgoing source address are those for the outer header, and the address type is IPv6. Additional objects natv2PortMapInternalMappedAddressType and natv2PortMapInternalMappedAddress capture the outgoing source address in the inner header, which will be in the well-known 192.0.0.0/29 range.",
      "zh-CHS": "与地址映射表一样，对DS Lite[RFC6333]的情况作了特殊规定。域和传出源地址是外部标头的域和传出源地址，地址类型是IPv6。其他对象natv2PortMapInternalMappedAddressType和natv2PortMapInternalMappedAddress在内部标头中捕获传出源地址，该地址将位于众所周知的192.0.0.0/29范围内。"
    },
    {
      "indent": 0,
      "text": "3.4. Conformance: Three Application Scenarios",
      "section_title": true,
      "zh-CHS": "3.4. 一致性：三种应用场景"
    },
    {
      "indent": 3,
      "text": "The conformance statements in NATV2-MIB provide for three application scenarios: basic NAT, NAT supporting address pools, and CGN.",
      "zh-CHS": "NATV2-MIB中的一致性声明提供了三种应用场景：基本NAT、支持NAT的地址池和CGN。"
    },
    {
      "indent": 3,
      "text": "A basic NAT MAY limit the number of NAT instances it supports to one, but it MUST support indexing by NAT instance. Similarly, a basic NAT MAY limit the number of realms it supports to two. By definition, a basic NAT is not required to support the subscriber table, the address pool table, or the address pool address range table. Some individual objects in other tables are also not relevant to basic NAT.",
      "zh-CHS": "基本NAT可以将其支持的NAT实例数限制为一个，但必须支持NAT实例索引。类似地，基本NAT可能会将其支持的领域数量限制为两个。根据定义，基本NAT不需要支持订户表、地址池表或地址池地址范围表。其他表中的一些单独对象也与基本NAT无关。"
    },
    {
      "indent": 3,
      "text": "A NAT supporting address pools adds the address pool table and the address pool address range table to what it implements. Some individual objects in other tables also need to be implemented. A NAT supporting address pools MUST support more than two realms.",
      "zh-CHS": "支持NAT的地址池将地址池表和地址池地址范围表添加到其实现的内容中。其他表中的一些单独对象也需要实现。支持NAT的地址池必须支持两个以上的域。"
    },
    {
      "indent": 3,
      "text": "Finally, a CGN MUST support the full contents of the MIB module. That includes the subscriber table, but it also includes the special provision for DS-Lite access in the address and port map tables.",
      "zh-CHS": "最后，CGN必须支持MIB模块的全部内容。这包括subscriber表，但它还包括地址和端口映射表中DS Lite访问的特殊规定。"
    },
    {
      "indent": 0,
      "text": "4. Definitions",
      "section_title": true,
      "zh-CHS": "4. 定义"
    },
    {
      "indent": 3,
      "text": "This MIB module IMPORTs objects from [RFC2578], [RFC2579], [RFC2580], [RFC3411], and [RFC4001].",
      "zh-CHS": "此MIB模块从[RFC2578]、[RFC2579]、[RFC2580]、[RFC3411]和[RFC4001]导入对象。"
    },
    {
      "indent": 0,
      "text": "NATV2-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Integer32, Unsigned32, Counter64, mib-2, NOTIFICATION-TYPE FROM SNMPv2-SMI -- RFC 2578 TEXTUAL-CONVENTION, DisplayString, TimeStamp FROM SNMPv2-TC -- RFC 2579 MODULE-COMPLIANCE, NOTIFICATION-GROUP, OBJECT-GROUP FROM SNMPv2-CONF -- RFC 2580 SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC 3411 InetAddressType, InetAddress, InetAddressPrefixLength, InetPortNumber FROM INET-ADDRESS-MIB; -- RFC 4001",
      "zh-CHS": "从SNMPv2 SMI中导入MODULE-IDENTITY、OBJECT-TYPE、Integer32、Unsigned32、Counter64、mib-2、NOTIFICATION-TYPE--RFC 2578 text-CONVENTION、DisplayString、时间戳从SNMPv2 TC--RFC 2579 MODULE-COMPLIANCE、NOTIFICATION-GROUP、OBJECT-GROUP从SNMPv2 CONF中导入--从SNMP-FRAMEWORK-mib中导入RFC 2580 SNMPAdministring--RFC 3411 InetAddressType，InetAddress，InetAddressPrefixLength，INET-ADDRESS-MIB中的InetPortNumber；--RFC 4001"
    },
    {
      "indent": 0,
      "text": "natv2MIB MODULE-IDENTITY LAST-UPDATED \"201510020000Z\" -- 2 October 2015",
      "zh-CHS": "natv2MIB模块标识最后一次更新“2015100200000Z”-2015年10月2日"
    },
    {
      "indent": 5,
      "text": "ORGANIZATION \"IETF Behavior Engineering for Hindrance Avoidance (BEHAVE) Working Group\" CONTACT-INFO \"Working Group Email: behave@ietf.org",
      "zh-CHS": "组织“IETF行为工程避免障碍（行为）”工作组“联系信息”工作组电子邮件：behave@ietf.org"
    },
    {
      "indent": 14,
      "text": "Simon Perreault Jive Communications Quebec, QC Canada",
      "zh-CHS": "Simon Perreault Jive Communications魁北克，加拿大QC"
    },
    {
      "indent": 14,
      "text": "Email: sperreault@jive.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Tina Tsou Huawei Technologies Bantian, Longgang Shenzhen 518129 China",
      "zh-CHS": "Tina Tsou华为技术有限公司深圳龙岗坂田518129"
    },
    {
      "indent": 14,
      "text": "Email: tina.tsou.zouting@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Senthil Sivakumar Cisco Systems 7100-8 Kit Creek Road Research Triangle Park, North Carolina 27709 United States",
      "zh-CHS": "Senthil Sivakumar Cisco Systems 7100-8 Kit Creek Road Research Triangle Park，美国北卡罗来纳州27709"
    },
    {
      "indent": 14,
      "text": "Phone: +1 919 392 5158\nEmail: ssenthil@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Tom Taylor PT Taylor Consulting Ottawa Canada",
      "zh-CHS": "汤姆泰勒加拿大渥太华咨询公司"
    },
    {
      "indent": 14,
      "text": "Email: tom.taylor.stds@gmail.com\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "DESCRIPTION \"This MIB module defines the generic managed objects for NAT.",
      "zh-CHS": "DESCRIPTION“此MIB模块定义NAT的通用托管对象。"
    },
    {
      "indent": 14,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as authors of the code. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和被确定为代码作者的人员。版权所有。"
    },
    {
      "indent": 14,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info).",
      "zh-CHS": "根据IETF信托有关IETF文件的法律规定第4.c节规定的简化BSD许可证中包含的许可条款，允许以源代码和二进制格式重新分发和使用，无论是否修改(http://trustee.ietf.org/license-info)."
    },
    {
      "indent": 5,
      "text": "         This version of this MIB module is part of RFC 7659;\n         see the RFC itself for full legal notices.\"\nREVISION     \"201510020000Z\" -- 2 October 2015\nDESCRIPTION\n        \"Complete rewrite, published as RFC 7659.\n         Replaces former version published as RFC 4008.\"\n::= { mib-2 234 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Textual conventions",
      "zh-CHS": "--文本约定"
    },
    {
      "indent": 0,
      "text": "ProtocolNumber ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d\"\n    STATUS current\n    DESCRIPTION\n        \"A protocol number, from the IANA Protocol Numbers\n         registry.\"\n    REFERENCE\n        \"IANA Protocol Numbers,\n         <http://www.iana.org/assignments/protocol-numbers>\"\n    SYNTAX Unsigned32 (0..255)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2SubscriberIndex ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d\"\n    STATUS current\n    DESCRIPTION\n        \"A unique value, greater than zero, for each subscriber\n         in the managed system.  The value for each\n         subscriber MUST remain constant at least from one\n         update of the entity's natv2SubscriberDiscontinuityTime\n         object until the next update of that object.  If a\n         subscriber is deleted, its assigned index value MUST NOT\n         be assigned to another subscriber at least until\n         reinitialization of the entity's management system.\"\n    SYNTAX Unsigned32 (1..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2SubscriberIndexOrZero ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d\"\n    STATUS current\n    DESCRIPTION\n        \"This textual convention is an extension of the\n         Natv2SubscriberIndex convention.  The latter defines a\n         greater than zero value used to identify a subscriber in\n         the managed system.  This extension permits the additional\n         value of zero, which serves as a placeholder when no\n         subscriber is associated with the object.\"\n    SYNTAX Unsigned32 (0|1..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2InstanceIndex ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d\"\n    STATUS current\n    DESCRIPTION\n        \"A unique value, greater than zero, for each NAT instance\n         in the managed system.  It is RECOMMENDED that values are\n         assigned contiguously starting from 1.  The value for each\n         NAT instance MUST remain constant at least from one\n         update of the entity's natv2InstanceDiscontinuityTime\n         object until the next update of that object.  If a NAT\n         instance is deleted, its assigned index value MUST NOT",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": " be assigned to another NAT instance at least until reinitialization of the entity's management system.\" SYNTAX Unsigned32 (1..4294967295)",
      "zh-CHS": "至少在重新初始化实体的管理系统之前分配给另一个NAT实例。”语法Unsigned32（1..4294967295）"
    },
    {
      "indent": 0,
      "text": "Natv2PoolIndex ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d\"\n    STATUS current\n    DESCRIPTION\n       \"A unique value over the containing NAT instance, greater than\n        zero, for each address pool supported by that NAT instance.\n        It is RECOMMENDED that values are assigned contiguously\n        starting from 1.  The value for each address pool MUST remain\n        constant at least from one update of the entity's\n        natv2PoolDiscontinuityTime object until the next update of\n        that object.  If an address pool is deleted, its assigned\n        index value MUST NOT be assigned to another address pool for\n        the same NAT instance at least until reinitialization of the\n        entity's management system.\"\n    SYNTAX Unsigned32 (1..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2PoolIndexOrZero ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d\"\n    STATUS current\n    DESCRIPTION\n        \"This textual convention is an extension of the\n         Natv2PoolIndex convention.  The latter defines a greater\n         than zero value used to identify address pools in the\n         managed system.  This extension permits the additional\n         value of zero, which serves as a placeholder when the\n         implementation does not support address pools or no address\n         pool is configured in a given external realm.\"\n    SYNTAX Unsigned32 (0|1..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Notifications",
      "zh-CHS": "--通知"
    },
    {
      "indent": 0,
      "text": "natv2MIBNotifications OBJECT IDENTIFIER ::= { natv2MIB 0 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2NotificationPoolUsageLow NOTIFICATION-TYPE OBJECTS { natv2PoolNotifiedPortMapEntries, natv2PoolNotifiedPortMapProtocol } STATUS current DESCRIPTION \"This notification is triggered when an address pool's usage becomes less than or equal to the value of the natv2PoolThresholdUsageLow object for that pool, unless the notification has been disabled by setting the value of the threshold to -1. It is reported subject to the rate limitation specified by natv2PortMapNotificationInterval.",
      "zh-CHS": "natv2NotificationPoolUsageLow通知类型对象{natv2PoolNotifiedPortMapEntries，natv2PoolNotifiedPortMapProtocol}状态当前描述“当地址池的使用率小于或等于该池的natv2PoolThresholdUsageLow对象的值时，会触发此通知，除非已通过将阈值的值设置为-1禁用通知。根据natv2PortMapNotificationInterval规定的速率限制进行报告。"
    },
    {
      "indent": 4,
      "text": "     Address pool usage is calculated as the percentage of the\n     total number of ports allocated to the address pool that are\n     already in use, for the most-mapped protocol at the time\n     the notification is triggered.  The two returned objects are\n     members of natv2PoolTable indexed by the NAT instance and\n     pool indices for which the event is being reported.  They\n     give the number of port map entries using external addresses\n     configured on the pool for the most-mapped protocol and\n     identify that protocol at the time the notification was\n     triggered.\"\nREFERENCE\n    \"RFC 7659, Sections 3.1.2 and 3.3.6.\"\n::= { natv2MIBNotifications 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2NotificationPoolUsageHigh NOTIFICATION-TYPE OBJECTS { natv2PoolNotifiedPortMapEntries, natv2PoolNotifiedPortMapProtocol } STATUS current DESCRIPTION \"This notification is triggered when an address pool's usage becomes greater than or equal to the value of the natv2PoolThresholdUsageHigh object for that pool, unless the notification has been disabled by setting the value of the threshold to -1. It is reported subject to the rate limitation specified by natv2PortMapNotificationInterval.",
      "zh-CHS": "natv2NotificationPoolUsageHigh通知类型对象{natv2PoolNotifiedPortMapEntries，natv2PoolNotifiedPortMapProtocol}状态当前描述“当地址池的使用率大于或等于该池的natv2PoolThresholdUsageHigh对象的值时，会触发此通知，除非已通过将阈值的值设置为-1禁用通知。根据natv2PortMapNotificationInterval规定的速率限制进行报告。"
    },
    {
      "indent": 4,
      "text": "     Address pool usage is calculated as the percentage of the\n     total number of ports allocated to the address pool that are\n     already in use, for the most-mapped protocol at the time the\n     notification is triggered.  The two returned objects are\n     members of natv2PoolTable indexed by the NAT instance and\n     pool indices for which the event is being reported.  They\n     give the number of port map entries using external addresses\n     configured on the pool for the most-mapped protocol and\n     identify that protocol at the time the notification was\n     triggered.\"\nREFERENCE\n    \"RFC 7659, Sections 3.1.2 and 3.3.6.\"\n::= { natv2MIBNotifications 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2NotificationInstanceAddressMapEntriesHigh NOTIFICATION-TYPE OBJECTS { natv2InstanceAddressMapEntries, natv2InstanceAddressMapCreations } STATUS current DESCRIPTION \"This notification is triggered when the value of natv2InstanceAddressMapEntries equals or exceeds the value of the natv2InstanceThresholdAddressMapEntriesHigh object",
      "zh-CHS": "NATv2NotificationInstanceAddressMapEntries高通知类型对象{natv2InstanceAddressMapEntries，natv2InstanceAddressMapCreations}状态当前描述“当natv2InstanceAddressMapEntries的值等于或超过NATv2InstanceThresholdAddressMapEntries高对象的值时，将触发此通知"
    },
    {
      "indent": 9,
      "text": "for the NAT instance, unless disabled by setting that threshold to -1. Reporting is subject to the rate limitation given by natv2InstanceNotificationInterval.",
      "zh-CHS": "对于NAT实例，除非通过将阈值设置为-1禁用。报告受NATv2InstructionNotificationInterval规定的速率限制。"
    },
    {
      "indent": 4,
      "text": "     natv2InstanceAddressMapEntries and\n     natv2InstanceAddressMapCreations are members of table\n     natv2InstanceTable indexed by the identifier of the NAT\n     instance for which the event is being reported.  The values\n     reported are those observed at the moment the notification\n     was triggered.\"\nREFERENCE\n    \"RFC 7659, Section 3.1.2.\"\n::= { natv2MIBNotifications 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2NotificationInstancePortMapEntriesHigh NOTIFICATION-TYPE OBJECTS { natv2InstancePortMapEntries, natv2InstancePortMapCreations } STATUS current DESCRIPTION \"This notification is triggered when the value of natv2InstancePortMapEntries becomes greater than or equal to the value of natv2InstanceThresholdPortMapEntriesHigh, unless disabled by setting that threshold to -1. Reporting is subject to the rate limitation given by natv2InstanceNotificationInterval.",
      "zh-CHS": "NATv2NotificationStanCeportMapEntries高通知类型对象{natv2InstancePortMapEntries，natv2InstancePortMapCreations}状态当前描述“当natv2InstancePortMapEntries的值大于或等于NATv2InstanceThresholdPortMapEntrieshHigh的值时，会触发此通知，除非通过将阈值设置为-1禁用该阈值。报告受NATv2InstructionNotificationInterval规定的速率限制。"
    },
    {
      "indent": 4,
      "text": "     natv2InstancePortMapEntries and\n     natv2InstancePortMapCreations are members of table\n     natv2InstanceTable indexed by the identifier of the NAT\n     instance for which the event is being reported.  The values\n     reported are those observed at the moment the notification\n     was triggered.\"\n::= { natv2MIBNotifications 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2NotificationSubscriberPortMappingEntriesHigh NOTIFICATION-TYPE OBJECTS { natv2SubscriberPortMapEntries, natv2SubscriberPortMapCreations } STATUS current DESCRIPTION \"This notification is triggered when the value of natv2SubscriberPortMapEntries for an individual subscriber becomes greater than or equal to the value of the natv2SubscriberThresholdPortMapEntriesHigh object for that subscriber, unless disabled by setting that threshold to -1. Reporting is subject to the rate limitation given by natv2SubscriberNotificationInterval.",
      "zh-CHS": "natv2NotificationSubscriberPortMappingEntriesHigh通知类型对象{natv2SubscriberPortMapEntries，natv2SubscriberPortMapCreations}状态当前说明“当单个订阅服务器的natv2SubscriberPortMapEntries的值大于或等于该订阅服务器的natv2SubscriberThresholdPortMapEntriesHigh对象的值时，会触发此通知，除非通过将阈值设置为-1禁用此通知。”。报告受natv2SubscriberNotificationInterval规定的费率限制。"
    },
    {
      "indent": 4,
      "text": "     natv2SubscriberPortMapEntries and\n     natv2SubscriberPortMapCreations are members of table\n     natv2SubscriberTable indexed by the subscriber for\n     which the event is being reported.  The values\n     reported are those observed at the moment the notification\n     was triggered.\"\n::= { natv2MIBNotifications 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Device-level objects",
      "zh-CHS": "--设备级对象"
    },
    {
      "indent": 0,
      "text": "natv2MIBDeviceObjects OBJECT IDENTIFIER ::= { natv2MIB 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Subscriber table",
      "zh-CHS": "--订户表"
    },
    {
      "indent": 0,
      "text": "natv2SubscriberTable OBJECT-TYPE\n    SYNTAX SEQUENCE OF Natv2SubscriberEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Table of subscribers.  As well as the subscriber index, it\n         provides per-subscriber state and counter objects, a last\n         discontinuity time object for the counters, and a writable\n         threshold value and limit on port consumption.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.3.\"\n    ::= { natv2MIBDeviceObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberEntry OBJECT-TYPE\n    SYNTAX Natv2SubscriberEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Each entry describes a single subscriber.\"\n    INDEX { natv2SubscriberIndex }\n    ::= { natv2SubscriberTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2SubscriberEntry ::=\n    SEQUENCE {\n        natv2SubscriberIndex                  Natv2SubscriberIndex,\n        natv2SubscriberInternalRealm               SnmpAdminString,\n        natv2SubscriberInternalPrefixType          InetAddressType,\n        natv2SubscriberInternalPrefix              InetAddress,\n        natv2SubscriberInternalPrefixLength InetAddressPrefixLength,\n-- State\n        natv2SubscriberAddressMapEntries           Unsigned32,\n        natv2SubscriberPortMapEntries              Unsigned32,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Counters and last discontinuity time\n        natv2SubscriberTranslations                Counter64,\n        natv2SubscriberAddressMapCreations         Counter64,\n        natv2SubscriberPortMapCreations            Counter64,\n        natv2SubscriberAddressMapFailureDrops      Counter64,\n        natv2SubscriberPortMapFailureDrops         Counter64,\n        natv2SubscriberDiscontinuityTime           TimeStamp,\n-- Read-write controls\n        natv2SubscriberLimitPortMapEntries         Unsigned32,\n-- Disable notifications by setting threshold to -1\n        natv2SubscriberThresholdPortMapEntriesHigh Integer32,\n-- Disable limit by setting to 0\n        natv2SubscriberNotificationInterval        Unsigned32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberIndex OBJECT-TYPE\n    SYNTAX Natv2SubscriberIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"A unique value, greater than zero, for each subscriber\n         in the managed system.  The value for each\n         subscriber MUST remain constant at least from one\n         update of the entity's natv2SubscriberDiscontinuityTime\n         object until the next update of that object.  If a\n         subscriber is deleted, its assigned index value MUST NOT\n         be assigned to another subscriber at least until\n         reinitialization of the entity's management system.\"\n    ::= { natv2SubscriberEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Configuration for this subscriber: realm, internal address(es)",
      "zh-CHS": "--此订阅服务器的配置：域、内部地址"
    },
    {
      "indent": 0,
      "text": "natv2SubscriberInternalRealm OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The address realm to which this subscriber belongs. A realm defines an address space. All NATs support at least two realms.",
      "zh-CHS": "natv2SubscriberInternalRealm对象类型语法SnmpAdminString（大小（0..32））MAX-ACCESS只读状态当前描述“此订阅服务器所属的地址域。一个域定义一个地址空间。所有NAT至少支持两个域。"
    },
    {
      "indent": 9,
      "text": "The default realm for subscribers is 'internal'. Administrators can set other values for individual subscribers when they are configured. The administrator MAY configure a new value of natv2SubscriberRealm at any time subsequent to initial configuration of the subscriber. If this happens, it MUST be treated as a point of discontinuity requiring an update of natv2SubscriberDiscontinuityTime.",
      "zh-CHS": "订阅服务器的默认域为“内部”。管理员可以在配置单个订阅服务器时为其设置其他值。管理员可以在初始配置订阅服务器之后的任何时间配置natv2SubscriberRealm的新值。如果发生这种情况，必须将其视为不连续点，需要更新natv2SubscriberDiscontinuityTime。"
    },
    {
      "indent": 4,
      "text": "     When the subscriber sends a packet to the NAT through a\n     DS-Lite (RFC 6333) tunnel, this is the realm of the outer\n     packet header source address.  Other tunneled access is out\n     of scope.\"\nREFERENCE\n     \"Address realm: RFC 2663.  DS-Lite: RFC 6333.\"\nDEFVAL\n    { \"internal\" }\n::= { natv2SubscriberEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberInternalPrefixType OBJECT-TYPE\n    SYNTAX InetAddressType\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Subscriber's internal prefix type.  Any value other than\n         ipv4(1) or ipv6(2) would be unexpected.  In the case of\n         DS-Lite access, this is the prefix type (IPv6(2)) used in\n         the outer packet header.\"\n    REFERENCE\n        \"DS-Lite: RFC 6333.\"\n    ::= { natv2SubscriberEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberInternalPrefix OBJECT-TYPE\n    SYNTAX InetAddress\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Prefix assigned to a subscriber's Customer Premises Equipment\n         (CPE).  The type of this prefix is given by\n         natv2SubscriberInternalPrefixType.  Source addresses of packets\n         outgoing from the subscriber will be contained within this\n         prefix.  In the case of DS-Lite access, the source address\n         taken from the prefix will be that of the outer header.\"\n    REFERENCE\n        \"DS-Lite: RFC 6333.\"\n    ::= { natv2SubscriberEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberInternalPrefixLength OBJECT-TYPE\n    SYNTAX InetAddressPrefixLength\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Length of the prefix assigned to a subscriber's CPE, in\n         bits.  If a single address is assigned, this will be 32\n         for IPv4 and 128 for IPv6.\"\n    ::= { natv2SubscriberEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- State objects",
      "zh-CHS": "--状态对象"
    },
    {
      "indent": 0,
      "text": "natv2SubscriberAddressMapEntries OBJECT-TYPE\n    SYNTAX Unsigned32\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"The current number of address map entries for the\n         subscriber, including static mappings.  An address map entry\n         maps from a given internal address and realm to an external\n         address in a particular external realm.  This definition\n         includes 'hairpin' mappings, where the external realm is the\n         same as the internal one.  Address map entries are also\n         tracked per instance and per address pool within the\n         instance.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.8.\"\n    ::= { natv2SubscriberEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberPortMapEntries OBJECT-TYPE\n    SYNTAX Unsigned32\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"The current number of port map entries in the port map table\n         for the subscriber, including static mappings.  A port map\n         entry maps from a given external realm, address, and port\n         for a given protocol to an internal realm, address, and\n         port.  This definition includes 'hairpin' mappings, where the\n         external realm is the same as the internal one.  Port map\n         entries are also tracked per instance and per protocol and\n         address pool within the instance.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.9.\"\n    ::= { natv2SubscriberEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Counters and last discontinuity time",
      "zh-CHS": "--计数器和上次不连续时间"
    },
    {
      "indent": 0,
      "text": "natv2SubscriberTranslations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of translated packets received from or sent to this subscriber. This value MUST be monotone increasing in the periods between updates of the entity's natv2SubscriberDiscontinuityTime. If a manager detects a change in the latter since the last time it sampled this",
      "zh-CHS": "natv2SubscriberTranslations对象类型语法计数器64 MAX-ACCESS只读状态当前说明“从该订阅服务器接收或发送到该订阅服务器的已翻译数据包的累计数量。该值必须在实体的natv2SubscriberDiscontinuityTime更新之间单调递增。如果管理者自上次对此进行采样以来检测到后者发生了变化"
    },
    {
      "indent": 4,
      "text": "     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2SubscriberDiscontinuityTime.\"\n::= { natv2SubscriberEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberAddressMapCreations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of address map entries created for this subscriber, including static mappings. Address map entries are also tracked per instance and per protocol and address pool within the instance.",
      "zh-CHS": "natv2SubscriberAddressMapCreations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“为此订阅服务器创建的地址映射项的累积数量，包括静态映射。还将跟踪每个实例以及实例内每个协议和地址池的地址映射项。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in\n     the periods between updates of the entity's\n     natv2SubscriberDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2SubscriberDiscontinuityTime.\"\n::= { natv2SubscriberEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberPortMapCreations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of port map entries created for this subscriber, including static mappings. Port map entries are also tracked per instance and per protocol and address pool within the instance.",
      "zh-CHS": "natv2SubscriberPortMapCreations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“为此订阅服务器创建的端口映射项的累计数量，包括静态映射。还将跟踪每个实例以及实例内每个协议和地址池的端口映射项。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2SubscriberDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2SubscriberDiscontinuityTime.\"\n::= { natv2SubscriberEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberAddressMapFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current",
      "zh-CHS": "natv2SubscriberAddressMapFailureDrops对象类型语法计数器64最大访问只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"The cumulative number of packets originated by this subscriber that were dropped because the packet would have triggered the creation of a new address map entry, but no address could be allocated in the selected external realm because all addresses from the selected address pool (or the whole realm, if no address pool has been configured for that realm) have already been fully allocated.",
      "zh-CHS": "DESCRIPTION“此订阅者发起的由于数据包会触发新地址映射条目的创建而被丢弃的数据包的累积数量，但由于所有地址都来自所选地址池，因此无法在所选外部域中分配地址（或整个域，如果没有为该域配置地址池）已完全分配。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2SubscriberDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2SubscriberDiscontinuityTime.\"\n::= { natv2SubscriberEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberPortMapFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped because the packet would have triggered the creation of a new port mapping, but no port could be allocated for the protocol concerned. The usual case for this will be for a NAT instance that supports address pooling and the 'Paired' pooling behavior recommended by RFC 4787, where the internal endpoint has used up all of the ports allocated to it for the address it was mapped to in the selected address pool in the external realm concerned and cannot be given more ports because - policy or implementation prevents it from having a second address in the same pool, and - policy or unavailability prevents it from acquiring more ports at its originally assigned address.",
      "zh-CHS": "natv2SubscriberPortMapFailureDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于数据包会触发新端口映射的创建，但无法为相关协议分配任何端口而丢弃的数据包的累积数量。”。通常情况下，NAT实例支持地址池和RFC 4787建议的“成对”池行为，如果内部终结点已使用了为其在相关外部领域的选定地址池中映射到的地址分配给它的所有端口，并且由于-策略或实现阻止其在同一池中具有第二个地址，因此无法为其分配更多端口，和-策略或不可用性阻止它在最初分配的地址获取更多端口。"
    },
    {
      "indent": 9,
      "text": "If the NAT instance supports address pooling but its pooling behavior is 'Arbitrary' (meaning that the NAT instance can allocate a new port mapping for the given internal endpoint on any address in the selected address pool and is not bound to what it has already mapped for that endpoint), then this counter is incremented when all ports for the protocol concerned over the whole of the selected address pool are already in use.",
      "zh-CHS": "如果NAT实例支持地址池，但其池行为是“任意”的（这意味着NAT实例可以为选定地址池中的任何地址上的给定内部端点分配新端口映射，并且不绑定到它已为该端点映射的端口映射），然后，当整个选定地址池中相关协议的所有端口都已在使用时，此计数器将递增。"
    },
    {
      "indent": 9,
      "text": "As a third case, if no address pools have been configured for the external realm concerned, then this counter is incremented because all ports for the protocol involved over the whole set of addresses available for that external realm are already in use.",
      "zh-CHS": "作为第三种情况，如果没有为相关的外部领域配置地址池，则此计数器将递增，因为该外部领域可用的整个地址集上涉及的协议的所有端口都已在使用中。"
    },
    {
      "indent": 9,
      "text": "Finally, this counter is incremented if the packet would have triggered the creation of a new port mapping, but the current value of natv2SubscriberPortMapEntries equals or exceeds the value of natv2SubscriberLimitPortMapEntries for this subscriber (unless that limit is disabled).",
      "zh-CHS": "最后，如果数据包触发了新端口映射的创建，但natv2SubscriberPortMapEntries的当前值等于或超过此订户的natv2SubscriberLimitPortMapEntries的值，则此计数器将递增（除非禁用该限制）。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2SubscriberDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2SubscriberDiscontinuityTime.\"\nREFERENCE\n    \"Pooling behavior: RFC 4787, end of Section 4.1.\"\n::= { natv2SubscriberEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberDiscontinuityTime OBJECT-TYPE\n    SYNTAX TimeStamp\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Snapshot of the value of the sysUpTime object at the\n         beginning of the latest period of continuity of the\n         statistical counters associated with this subscriber.\"\n    ::= { natv2SubscriberEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Per-subscriber limit and threshold on port mappings\n-- Disabled if set to zero\nnatv2SubscriberLimitPortMapEntries OBJECT-TYPE\n    SYNTAX Unsigned32\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \"Limit on total number of port mappings active for this\n         subscriber (natv2SubscriberPortMapEntries).  Once this limit\n         is reached, packets that might have triggered new port\n         mappings are dropped.  The number of such packets dropped is\n         counted in natv2InstancePortMapFailureDrops.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Limit is disabled if set to zero.\"",
      "zh-CHS": "如果设置为零，则禁用限制。“"
    },
    {
      "indent": 4,
      "text": "DEFVAL\n     { 0 }\n::= { natv2SubscriberEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberThresholdPortMapEntriesHigh OBJECT-TYPE\n    SYNTAX Integer32\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \"Notification threshold for total number of port mappings\n         active for this subscriber.  Whenever\n         natv2SubscriberPortMapEntries is updated, if it equals or\n         exceeds natv2SubscriberThresholdPortMapEntriesHigh, the\n         notification\n         natv2NotificationSubscriberPortMappingEntriesHigh is\n         triggered, unless the notification is disabled by setting\n         the threshold to -1.  Reporting is subject to the minimum\n         inter-notification interval given by\n         natv2SubscriberNotificationInterval.  If multiple\n         notifications are triggered during one interval, the agent\n         MUST report only the one containing the highest value of\n         natv2SubscriberPortMapEntries and discard the others.\"\n    DEFVAL\n         { -1 }\n    ::= { natv2SubscriberEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2SubscriberNotificationInterval OBJECT-TYPE\n    SYNTAX Unsigned32 (1..3600)\n    UNITS\n        \"Seconds\"\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \"Minimum number of seconds between successive\n         reporting of notifications for this subscriber.  Controls\n         the reporting of\n         natv2NotificationSubscriberPortMappingEntriesHigh.\"\n    DEFVAL\n         { 60 }\n    ::= { natv2SubscriberEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Per-NAT-instance objects",
      "zh-CHS": "--每NAT实例对象"
    },
    {
      "indent": 0,
      "text": "natv2MIBInstanceObjects OBJECT IDENTIFIER ::= { natv2MIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Instance table",
      "zh-CHS": "--实例表"
    },
    {
      "indent": 0,
      "text": "natv2InstanceTable OBJECT-TYPE SYNTAX SEQUENCE OF Natv2InstanceEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Table of NAT instances. As well as state and counter objects, it provides the instance index, instance name, and the last discontinuity time object that is applicable to the counters. It also contains writable thresholds for reporting of notifications and limits on usage of resources at the level of the NAT instance.",
      "zh-CHS": "Natv2InstanceEntry的natv2InstanceTable对象类型语法序列MAX-ACCESS不可访问状态当前描述“NAT实例表。除了state和counter对象之外，它还提供了实例索引、实例名称以及适用于计数器的上次中断时间对象。它还包含用于报告通知的可写阈值以及NAT实例级别的资源使用限制。"
    },
    {
      "indent": 9,
      "text": "It is assumed that NAT instances can be created and deleted dynamically, but this MIB module does not provide the means to do so. For restrictions on assignment and maintenance of the NAT index instance, see the description of natv2InstanceIndex in the table below. For the requirements on maintenance of the values of the counters in this table, see the description of natv2InstanceDiscontinuityTime in this table.",
      "zh-CHS": "假设可以动态创建和删除NAT实例，但此MIB模块不提供这样做的方法。有关分配和维护NAT索引实例的限制，请参见下表中natv2InstanceIndex的说明。本表计数器数值维护要求见本表NATv2InstanceInjunctionTime说明。"
    },
    {
      "indent": 9,
      "text": "Each NAT instance has its own resources and behavior. The resources include memory as reflected in space for map entries, processing power as reflected in the rate of map creation and deletion, and mappable addresses in each realm that can play the role of an external realm for at least some mappings for that instance. The NAT instance table includes limits and notification thresholds that relate to memory usage for mapping at the level of the whole instance. The limit on number of subscribers with active mappings is a limit to some extent on processor usage.",
      "zh-CHS": "每个NAT实例都有自己的资源和行为。这些资源包括映射条目空间中反映的内存、映射创建和删除速率中反映的处理能力，以及每个域中的可映射地址，这些地址至少可以在该实例的某些映射中充当外部域的角色。NAT实例表包括与整个实例级别映射的内存使用量相关的限制和通知阈值。对具有活动映射的订阅服务器数量的限制在某种程度上是对处理器使用的限制。"
    },
    {
      "indent": 4,
      "text": "     The mappable 'external' addresses may or may not be\n     organized into address pools.  For a definition of address\n     pools, see the description of natv2PoolTable.  If the instance\n     does support address pools, it also has a pooling behavior.\n     Mapping, filtering, and pooling behavior are defined in the\n     descriptions of the natv2InstancePortMappingBehavior,\n     natv2InstanceFilteringBehavior, and\n     natv2InstancePoolingBehavior objects in this table.  The\n     instance also has a fragmentation behavior, defined in the\n     description of the natv2InstanceFragmentBehavior object.\"\nREFERENCE\n    \"RFC 7659, Section 3.3.4.\n     NAT behaviors: RFC 4787 (primary, UDP); RFC 5382 (TCP);\n     RFC 5508 (ICMP); and RFC 5597 (Datagram Congestion Control\n     Protocol (DCCP)).\"\n::= { natv2MIBInstanceObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceEntry OBJECT-TYPE\n    SYNTAX Natv2InstanceEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Objects related to a single NAT instance.\"\n    INDEX { natv2InstanceIndex }\n    ::= { natv2InstanceTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2InstanceEntry ::=\n    SEQUENCE {\n         natv2InstanceIndex                    Natv2InstanceIndex,\n         natv2InstanceAlias                         DisplayString,\n-- Configured behaviors\n         natv2InstancePortMappingBehavior           INTEGER,\n         natv2InstanceFilteringBehavior             INTEGER,\n         natv2InstancePoolingBehavior               INTEGER,\n         natv2InstanceFragmentBehavior              INTEGER,\n-- State\n         natv2InstanceAddressMapEntries              Unsigned32,\n         natv2InstancePortMapEntries                 Unsigned32,\n-- Statistics and discontinuity time\n         natv2InstanceTranslations                   Counter64,\n         natv2InstanceAddressMapCreations            Counter64,\n         natv2InstancePortMapCreations               Counter64,\n         natv2InstanceAddressMapEntryLimitDrops      Counter64,\n         natv2InstancePortMapEntryLimitDrops         Counter64,\n         natv2InstanceSubscriberActiveLimitDrops     Counter64,\n         natv2InstanceAddressMapFailureDrops         Counter64,\n         natv2InstancePortMapFailureDrops            Counter64,\n         natv2InstanceFragmentDrops                  Counter64,\n         natv2InstanceOtherResourceFailureDrops      Counter64,\n         natv2InstanceDiscontinuityTime              TimeStamp,\n-- Notification thresholds, disabled if set to -1\n         natv2InstanceThresholdAddressMapEntriesHigh Integer32,\n         natv2InstanceThresholdPortMapEntriesHigh    Integer32,\n         natv2InstanceNotificationInterval           Unsigned32,\n-- Limits, disabled if set to 0\n         natv2InstanceLimitAddressMapEntries         Unsigned32,\n         natv2InstanceLimitPortMapEntries            Unsigned32,\n         natv2InstanceLimitPendingFragments          Unsigned32,\n         natv2InstanceLimitSubscriberActives         Unsigned32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceIndex OBJECT-TYPE SYNTAX Natv2InstanceIndex MAX-ACCESS not-accessible STATUS current",
      "zh-CHS": "natv2InstanceIndex对象类型语法natv2InstanceIndex MAX-ACCESS不可访问状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n    \"NAT instance index.  It is up to the implementation to\n     determine which values correspond to in-service NAT\n     instances.  This object is used as an index for all tables\n     defined below.\"\n::= { natv2InstanceEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceAlias OBJECT-TYPE SYNTAX DisplayString (SIZE (0..64)) MAX-ACCESS read-only STATUS current DESCRIPTION \"This object is an 'alias' name for the NAT instance as specified by a network manager and provides a non-volatile 'handle' for the instance.",
      "zh-CHS": "natv2InstanceAlias对象类型语法DisplayString（大小（0..64））MAX-ACCESS只读状态当前描述“此对象是网络管理器指定的NAT实例的“别名”名称，并为实例提供非易失性的“句柄”。"
    },
    {
      "indent": 4,
      "text": "     An example of the value that a network manager might store\n     in this object for a NAT instance is the name/identifier of\n     the interface that brings in internal traffic for this NAT\n     instance or the name of the Virtual Routing and Forwarding\n     (VRF) for internal traffic.\"\n::= { natv2InstanceEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Configured behaviors",
      "zh-CHS": "--配置行为"
    },
    {
      "indent": 0,
      "text": "natv2InstancePortMappingBehavior OBJECT-TYPE\n    SYNTAX INTEGER {\n           endpointIndependent (0),\n           addressDependent (1),\n           addressAndPortDependent (2)\n        }\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Port mapping behavior is the policy governing the selection\n         of external address and port in a given realm for a given\n         five-tuple of source address and port, destination address\n         and port, and protocol.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "endpointIndependent(0), the behavior REQUIRED by RFC 4787, REQ-1, maps the source address and port to the same external address and port for all destination address and port combinations reached through the same external realm and using the given protocol.",
      "zh-CHS": "endpointIndependent（0），RFC 4787，REQ-1所要求的行为，将源地址和端口映射到相同的外部地址和端口，用于通过相同的外部域和使用给定协议到达的所有目标地址和端口组合。"
    },
    {
      "indent": 9,
      "text": "addressDependent(1) maps to the same external address and port for all destination ports at the same destination address reached through the same external realm and using the given protocol.",
      "zh-CHS": "addressDependent（1）映射到相同的外部地址和端口，用于通过相同的外部域并使用给定协议到达相同目标地址的所有目标端口。"
    },
    {
      "indent": 4,
      "text": "     addressAndPortDependent(2) maps to a separate external\n     address and port combination for each different\n     destination address and port combination reached through\n     the same external realm.\"\nREFERENCE\n     \"RFC 4787, Section 4.1.\"\n::= { natv2InstanceEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceFilteringBehavior OBJECT-TYPE\n    SYNTAX INTEGER {\n           endpointIndependent (0),\n           addressDependent (1),\n           addressAndPortDependent (2)\n        }\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Filtering behavior is the policy governing acceptance or\n         the dropping of packets incoming from remote sources via a\n         given external realm and destined to a specific three-tuple\n         of external address, port, and protocol at the NAT instance\n         that has been assigned in a port mapping.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "endpointIndependent(0) accepts for translation packets from all combinations of remote address and port destined to the mapped external address and port via the given external realm and using the given protocol.",
      "zh-CHS": "endpointIndependent（0）接受来自远程地址和端口的所有组合的转换数据包，这些数据包通过给定的外部域并使用给定的协议发送到映射的外部地址和端口。"
    },
    {
      "indent": 9,
      "text": "addressDependent(1) accepts for translation packets from all remote ports from the same remote source address destined to the mapped external address and port via the given external realm and using the given protocol.",
      "zh-CHS": "addressDependent（1）接受来自所有远程端口的转换数据包，这些数据包来自同一远程源地址，通过给定的外部域并使用给定的协议发送到映射的外部地址和端口。"
    },
    {
      "indent": 9,
      "text": "addressAndPortDependent(2) accepts for translation only those packets with the same remote source address, port, and protocol incoming from the same external realm as identified when the applicable port map entry was created.",
      "zh-CHS": "addressAndPortDependent（2）仅接受具有相同远程源地址、端口和协议的数据包进行转换，这些数据包来自创建适用端口映射条目时标识的相同外部领域。"
    },
    {
      "indent": 4,
      "text": " RFC 4787, REQ-8 recommends either endpointIndependent(0) or addressDependent(1) filtering behavior depending on whether application friendliness or security takes priority.\" REFERENCE \"RFC 4787, Section 5.\"",
      "zh-CHS": "RFC 4787，REQ-8建议端点独立（0）或地址依赖（1）过滤行为，这取决于应用程序友好性或安全性是否优先。“参考”RFC 4787，第5节"
    },
    {
      "indent": 4,
      "text": "::= { natv2InstanceEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstancePoolingBehavior OBJECT-TYPE\n    SYNTAX INTEGER {\n           arbitrary (0),\n           paired (1)\n        }\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Pooling behavior is the policy used to select the address\n         for a new port mapping within a given address pool to which\n         the internal address has already been mapped.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "arbitrary(0) pooling behavior means that the NAT instance may create the new port mapping using any address in the pool that has a free port for the protocol concerned.",
      "zh-CHS": "任意（0）池行为意味着NAT实例可以使用池中具有相关协议的空闲端口的任何地址创建新端口映射。"
    },
    {
      "indent": 4,
      "text": "     paired(1) pooling behavior, the behavior RECOMMENDED by RFC\n     4787, REQ-2, means that once a given internal address has\n     been mapped to a particular address in a particular pool,\n     further mappings of the same internal address to that pool\n     will reuse the previously assigned pool member address.\"\nREFERENCE\n    \"RFC 4787, near the end of Section 4.1\"\n::= { natv2InstanceEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceFragmentBehavior OBJECT-TYPE\n    SYNTAX INTEGER {\n           fragmentNone (0),\n           fragmentInOrder (1),\n           fragmentOutOfOrder (2)\n        }\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Fragment behavior is the NAT instance's capability to\n         receive and translate fragments incoming from remote\n         sources.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "fragmentNone(0) implies no capability to translate incoming fragments, so all received fragments are dropped. Each dropped fragment is counted in natv2InstanceFragmentDrops.",
      "zh-CHS": "fragmentNone（0）意味着没有翻译传入片段的能力，因此所有接收到的片段都将被丢弃。在natv2InstanceFragmentDrops中计算每个丢弃的片段。"
    },
    {
      "indent": 9,
      "text": "fragmentInOrder(1) implies the ability to translate fragments only if they are received in order, so that in particular the header is in the first packet. If a fragment",
      "zh-CHS": "fragmentInOrder（1）意味着仅当片段按顺序接收时才翻译片段的能力，尤其是头在第一个数据包中。如果是碎片"
    },
    {
      "indent": 9,
      "text": "is received out of order, it is dropped and counted in natv2InstanceFragmentDrops.",
      "zh-CHS": "如果收到的数据顺序不正确，则会将其丢弃并计入natv2InstanceFragmentDrops中。"
    },
    {
      "indent": 4,
      "text": "     fragmentOutOfOrder(2), the capability REQUIRED by RFC 4787,\n     REQ-14, implies the capability to translate fragments even\n     when they arrive out of order, subject to a protective\n     limit natv2InstanceLimitPendingFragments on total number of\n     fragments awaiting the first fragment of the chain.  If the\n     implementation supports this capability,\n     natv2InstanceFragmentDrops is incremented only when a new\n     fragment arrives but is dropped because the limit on pending\n     fragments has already been reached.\"\nREFERENCE\n    \"RFC 4787, Section 11.\"\n::= { natv2InstanceEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- State",
      "zh-CHS": "--陈述"
    },
    {
      "indent": 0,
      "text": "natv2InstanceAddressMapEntries OBJECT-TYPE\n    SYNTAX Unsigned32\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"The current number of address map entries in total over the\n         whole NAT instance, including static mappings.  An address\n         map entry maps from a given internal address and realm to an\n         external address in a particular external realm.  This\n         definition includes 'hairpin' mappings, where the external\n         realm is the same as the internal one.  Address map entries\n         are also tracked per subscriber and per address pool within\n         the instance.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.8.\n         Hairpinning: RFC 4787, Section 6.\"\n    ::= { natv2InstanceEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstancePortMapEntries OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The current number of entries in the port map table in total over the whole NAT instance, including static mappings. A port map entry maps from a given external realm, address, and port for a given protocol to an internal realm, address, and port. This definition includes 'hairpin' mappings, where the external realm is the same as the internal one. Port map",
      "zh-CHS": "natv2InstancePortMapEntries对象类型语法Unsigned32 MAX-ACCESS只读状态当前说明“整个NAT实例（包括静态映射）中端口映射表中的当前项目总数。端口映射条目将给定协议的给定外部域、地址和端口映射到内部域、地址和端口。此定义包括“发夹”映射，其中外部域与内部域相同。港口地图"
    },
    {
      "indent": 4,
      "text": "     entries are also tracked per subscriber and per protocol and\n     address pool within the instance.\"\nREFERENCE\n    \"RFC 7659, Section 3.3.9.\n     Hairpinning: RFC 4787, Section 6.\"\n::= { natv2InstanceEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Statistics",
      "zh-CHS": "--统计数字"
    },
    {
      "indent": 0,
      "text": "natv2InstanceTranslations OBJECT-TYPE\n    SYNTAX Counter64\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"The cumulative number of translated packets passing through\n         this NAT instance.  This value MUST be monotone increasing in\n         the periods between updates of\n         natv2InstanceDiscontinuityTime.  If a manager detects a\n         change in the latter since the last time it sampled this\n         counter, it SHOULD NOT make use of the difference between\n         the latest value of the counter and any value retrieved\n         before the new value of natv2InstanceDiscontinuityTime.\"\n    ::= { natv2InstanceEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceAddressMapCreations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of address map entries created by the NAT instance, including static mappings. Address map creations are also tracked per address pool within the instance and per subscriber.",
      "zh-CHS": "natv2InstanceAddressMapCreations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“NAT实例创建的地址映射项的累积数量，包括静态映射。地址映射创建也会按实例内的每个地址池和每个订阅服务器进行跟踪。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in\n     the periods between updates of\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2InstanceEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstancePortMapCreations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current",
      "zh-CHS": "natv2InstancePortMapCreations对象类型语法计数器64最大访问只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"The cumulative number of port map entries created by the NAT instance, including static mappings. Port map creations are also tracked per protocol and address pool within the instance and per subscriber.",
      "zh-CHS": "DESCRIPTION“NAT实例创建的端口映射项的累计数量，包括静态映射。还将根据实例内的每个协议和地址池以及每个订阅服务器跟踪端口映射创建。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in\n     the periods between updates of\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2InstanceEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceAddressMapEntryLimitDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped rather than translated because the packet would have triggered the creation of a new address map entry, but the limit on number of address map entries for the NAT instance given by natv2InstanceLimitAddressMapEntries has already been reached.",
      "zh-CHS": "natv2InstanceAddressMapEntryLimitDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于数据包会触发新地址映射条目的创建，但natv2InstanceLimitAddressMapEntries对NAT实例的地址映射条目数量的限制已经达到，因此丢弃而不是转换的数据包的累积数量。”。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2InstanceEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstancePortMapEntryLimitDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped rather than translated because the packet would have triggered the creation of a new port map entry, but the limit on number of port map entries for the NAT instance given by natv2InstanceLimitPortMapEntries has already been reached.",
      "zh-CHS": "natv2InstancePortMapEntryLimitDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于数据包会触发新端口映射项的创建，但natv2InstanceLimitPortMapEntries对NAT实例的端口映射项数量的限制已经达到，因此丢弃而不是转换的数据包的累积数量。”。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2InstanceEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceSubscriberActiveLimitDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped rather than translated because the packet would have triggered the creation of a new mapping for a subscriber with no other active mappings, but the limit on number of active subscribers for the NAT instance given by natv2InstanceLimitSubscriberActives has already been reached.",
      "zh-CHS": "natv2InstanceSubscriberActiveLimitDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于数据包会触发为没有其他活动映射的订户创建新映射，但natv2InstanceLimitSubscriberActives给定的NAT实例的活动订户数量限制已经达到，因此丢弃而不是转换的数据包的累积数量。”。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2InstanceEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceAddressMapFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped because the packet would have triggered the creation of a new address map entry, but no address could be allocated in the selected external realm because all addresses from the selected address pool (or the whole realm, if no address pool has been configured for that realm) have already been fully allocated.",
      "zh-CHS": "natv2InstanceAddressMapFailureDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于数据包会触发新地址映射条目的创建而丢弃的数据包的累计数量，但由于所选地址池（或整个域，如果没有为该域配置地址池）中的所有地址，因此无法在所选外部域中分配地址。”已全部分配。"
    },
    {
      "indent": 9,
      "text": "This value MUST be monotone increasing in the periods between updates of the entity's natv2InstanceDiscontinuityTime. If a manager detects a change in the latter since the last time it sampled this",
      "zh-CHS": "该值必须在实体的NATv2InstanceInjunctionTime更新之间单调递增。如果管理者自上次对此进行采样以来检测到后者发生了变化"
    },
    {
      "indent": 4,
      "text": "     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2InstanceEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstancePortMapFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped because the packet would have triggered the creation of a new port map entry, but no port could be allocated for the protocol concerned. The usual case for this will be for a NAT instance that supports address pooling and the 'Paired' pooling behavior recommended by RFC 4787, where the internal endpoint has used up all of the ports allocated to it for the address it was mapped to in the selected address pool in the external realm concerned and cannot be given more ports because - policy or implementation prevents it from having a second address in the same pool, and - policy or unavailability prevents it from acquiring more ports at its originally assigned address.",
      "zh-CHS": "natv2InstancePortMapFailureDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于数据包会触发新端口映射条目的创建，但无法为相关协议分配端口，因此丢弃的数据包的累积数量。”。通常情况下，NAT实例支持地址池和RFC 4787建议的“成对”池行为，如果内部终结点已使用了为其在相关外部领域的选定地址池中映射到的地址分配给它的所有端口，并且由于-策略或实现阻止其在同一池中具有第二个地址，因此无法为其分配更多端口，和-策略或不可用性阻止它在最初分配的地址获取更多端口。"
    },
    {
      "indent": 9,
      "text": "If the NAT instance supports address pooling but its pooling behavior is 'Arbitrary' (meaning that the NAT instance can allocate a new port mapping for the given internal endpoint on any address in the selected address pool and is not bound to what it has already mapped for that endpoint), then this counter is incremented when all ports for the protocol concerned over the whole of the selected address pool are already in use.",
      "zh-CHS": "如果NAT实例支持地址池，但其池行为是“任意”的（这意味着NAT实例可以为选定地址池中的任何地址上的给定内部端点分配新端口映射，并且不绑定到它已为该端点映射的端口映射），然后，当整个选定地址池中相关协议的所有端口都已在使用时，此计数器将递增。"
    },
    {
      "indent": 9,
      "text": "Finally, if no address pools have been configured for the external realm concerned, then this counter is incremented because all ports for the protocol involved over the whole set of addresses available for that external realm are already in use.",
      "zh-CHS": "最后，如果没有为相关的外部领域配置地址池，则此计数器将递增，因为该外部领域可用的整个地址集上涉及的协议的所有端口都已在使用中。"
    },
    {
      "indent": 9,
      "text": "This value MUST be monotone increasing in the periods between updates of the entity's natv2InstanceDiscontinuityTime. If a manager detects a change in the latter since the last time it sampled this counter, it SHOULD NOT make use of the difference between the latest value of the counter and any value retrieved before the new value of natv2InstanceDiscontinuityTime.\"",
      "zh-CHS": "该值必须在实体的NATv2InstanceInjunctionTime更新之间单调递增。如果管理器自上次对此计数器进行采样以来检测到后者发生变化，则不应使用计数器的最新值与在新值NATv2InstanceTime之前检索到的任何值之间的差值。”"
    },
    {
      "indent": 4,
      "text": "REFERENCE\n    \"Pooling behavior: RFC 4787, end of Section 4.1.\"\n::= { natv2InstanceEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceFragmentDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of fragments received by the NAT instance but dropped rather than translated. When the NAT instance supports the 'Receive Fragment Out of Order' capability as required by RFC 4787, this occurs because the fragment was received out of order and would be added to the queue of fragments awaiting the initial fragment of the chain, but the queue has already reached the limit set by natv2InstanceLimitsPendingFragments. Counting in other cases is specified in the description of natv2InstanceFragmentBehavior.",
      "zh-CHS": "natv2InstanceFragmentDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“NAT实例接收到但已删除而未转换的片段的累积数量。当NAT实例支持RFC 4787所要求的“接收片段无序”功能时，会发生这种情况，因为该片段是无序接收的，将添加到等待链初始片段的片段队列中，但队列已达到natv2InstanceLimitsPendingFragments设置的限制。natv2InstanceFragmentBehavior的描述中指定了其他情况下的计数。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\nREFERENCE\n    \"RFC 4787, Section 11.\"\n::= { natv2InstanceEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceOtherResourceFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped because of unavailability of a resource other than an address or port that would have been required to process it. The most likely case is where the upper-layer protocol in the packet is not supported by the NAT instance.",
      "zh-CHS": "natv2InstanceOtherResourceFailureDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于除处理数据包所需的地址或端口以外的资源不可用而丢弃的数据包的累积数量。最可能的情况是NAT实例不支持数据包中的上层协议。"
    },
    {
      "indent": 9,
      "text": "This value MUST be monotone increasing in the periods between updates of the entity's natv2InstanceDiscontinuityTime. If a manager detects a change in the latter since the last time it sampled this counter, it SHOULD NOT make use of the difference between the latest value of the counter and any value retrieved",
      "zh-CHS": "该值必须在实体的NATv2InstanceInjunctionTime更新之间单调递增。如果管理器自上次对此计数器进行采样以来检测到后者发生变化，则不应使用计数器的最新值与检索到的任何值之间的差值"
    },
    {
      "indent": 4,
      "text": "     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2InstanceEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceDiscontinuityTime OBJECT-TYPE\n    SYNTAX TimeStamp\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Snapshot of the value of the sysUpTime object at the\n         beginning of the latest period of continuity of the\n         statistical counters associated with this NAT instance.\"\n    ::= { natv2InstanceEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Notification thresholds, disabled by setting to -1.",
      "zh-CHS": "--通知阈值，通过设置为-1禁用。"
    },
    {
      "indent": 0,
      "text": "natv2InstanceThresholdAddressMapEntriesHigh OBJECT-TYPE\n    SYNTAX Integer32\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \"Notification threshold for total number of address map\n         entries held by this NAT instance.  Whenever\n         natv2InstanceAddressMapEntries is updated, if it equals or\n         exceeds natv2InstanceThresholdAddressMapEntriesHigh, then\n         natv2NotificationInstanceAddressMapEntriesHigh may be\n         triggered, unless the notification is disabled by setting\n         the threshold to -1.  Reporting is subject to the minimum\n         inter-notification interval given by\n         natv2InstanceNotificationInterval.  If multiple notifications\n         are triggered during one interval, the agent MUST report\n         only the one containing the highest value of\n         natv2InstanceAddressMapEntries and discard the others.\"\n    DEFVAL\n         { -1 }\n    ::= { natv2InstanceEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceThresholdPortMapEntriesHigh OBJECT-TYPE SYNTAX Integer32 MAX-ACCESS read-write STATUS current DESCRIPTION \"Notification threshold for total number of port map entries held by this NAT instance. Whenever natv2InstancePortMapEntries is updated, if it equals or exceeds natv2InstanceThresholdPortMapEntriesHigh, then natv2NotificationInstancePortMapEntriesHigh may be triggered, unless the notification is disabled by setting the threshold to -1. Reporting is subject to the minimum",
      "zh-CHS": "natv2InstanceThresholdPortMapEntriesHigh对象类型语法整数32 MAX-ACCESS读写状态当前说明“此NAT实例持有的端口映射项总数的通知阈值。每当更新natv2InstancePortMapEntries时，如果它等于或超过natv2InstanceThresholdPortMapEntriesHigh，则可能会触发NATv2NotificationStanCeportMapEntriesHigh，除非通过将阈值设置为-1禁用通知。报告以最低限度为准"
    },
    {
      "indent": 4,
      "text": "     inter-notification interval given by\n     natv2InstanceNotificationInterval.  If multiple notifications\n     are triggered during one interval, the agent MUST report\n     only the one containing the highest value of\n     natv2InstancePortMapEntries and discard the others.\"\nDEFVAL\n    { -1 }\n::= { natv2InstanceEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceNotificationInterval OBJECT-TYPE\n    SYNTAX Unsigned32 (1..3600)\n    UNITS\n        \"Seconds\"\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \"Minimum number of seconds between successive\n         notifications for this NAT instance.  Controls the reporting\n         of natv2NotificationInstanceAddressMapEntriesHigh and\n         natv2NotificationInstancePortMapEntriesHigh.\"\n    DEFVAL\n        { 10 }\n    ::= { natv2InstanceEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "-- Limits, disabled if set to 0",
      "zh-CHS": "--限制，如果设置为0，则禁用"
    },
    {
      "indent": 0,
      "text": "natv2InstanceLimitAddressMapEntries OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-write STATUS current DESCRIPTION \"Limit on total number of address map entries supported by the NAT instance. When natv2InstanceAddressMapEntries has reached this limit, subsequent packets that would normally trigger creation of a new address map entry will be dropped and counted in natv2InstanceAddressMapEntryLimitDrops. Warning of an approach to this limit can be achieved by setting natv2InstanceThresholdAddressMapEntriesHigh to a non-zero value, for example, 80% of the limit. The limit is disabled by setting its value to zero.",
      "zh-CHS": "natv2InstanceLimitAddressMapEntries对象类型语法Unsigned32 MAX-ACCESS读写状态当前说明“NAT实例支持的地址映射项总数限制。当natv2InstanceAddressMapEntries达到此限制时，通常会触发创建新地址映射条目的后续数据包将被丢弃，并在natv2InstanceAddressMapEntryLimitDrops中计数。通过将natv2InstanceThresholdAddressMapEntriesHigh设置为非零值（例如，限制的80%），可以实现接近此限制的警告。通过将其值设置为零，可以禁用该限制。"
    },
    {
      "indent": 4,
      "text": "     For further information, please see the descriptions of\n     natv2NotificationInstanceAddressMapEntriesHigh and\n     natv2InstanceAddressMapEntries.\"\nDEFVAL\n    { 0 }\n::= { natv2InstanceEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceLimitPortMapEntries OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-write STATUS current DESCRIPTION \"Limit on total number of port map entries supported by the NAT instance. When natv2InstancePortMapEntries has reached this limit, subsequent packets that would normally trigger creation of a new port map entry will be dropped and counted in natv2InstancePortMapEntryLimitDrops. Warning of an approach to this limit can be achieved by setting natv2InstanceThresholdPortMapEntriesHigh to a non-zero value, for example, 80% of the limit. The limit is disabled by setting its value to zero.",
      "zh-CHS": "natv2InstanceLimitPortMapEntries对象类型语法Unsigned32 MAX-ACCESS读写状态当前说明“限制NAT实例支持的端口映射项的总数。当natv2InstancePortMapEntries达到此限制时，通常会触发创建新端口映射条目的后续数据包将被丢弃，并在natv2InstancePortMapEntryLimitDrops中计数。通过将NATv2InstanceThresholdPortMapEntrieshHigh设置为非零值（例如限制的80%），可以警告接近此限制。通过将其值设置为零，可以禁用该限制。"
    },
    {
      "indent": 4,
      "text": "     For further information, please see the descriptions of\n     natv2NotificationInstancePortMapEntriesHigh and\n     natv2InstancePortMapEntries.\"\nDEFVAL\n    { 0 }\n::= { natv2InstanceEntry 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceLimitPendingFragments OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-write STATUS current DESCRIPTION \"Limit on number of out-of-order fragments received by the NAT instance from remote sources and held until head of chain appears. While the number of held fragments is at this limit, subsequent packets that contain fragments not relating to those already held will be dropped and counted in natv2InstancePendingFragmentLimitDrops. The limit is disabled by setting the value to zero.",
      "zh-CHS": "natv2InstanceLimitPendingFragments对象类型语法Unsigned32 MAX-ACCESS读写状态当前说明“限制NAT实例从远程源接收并保留到链头出现的无序片段的数量。当保留片段的数量处于此限制时，包含与已保留片段无关的片段的后续数据包将被丢弃，并在natv2InstancePendingFragmentLimitDrops中计数。通过将该值设置为零，可以禁用该限制。"
    },
    {
      "indent": 4,
      "text": "     Applicable only when the NAT instance supports 'Receive\n     Fragments Out of Order' behavior; leave at default\n     otherwise.  See the description of\n     natv2InstanceFragmentBehavior.\"\nREFERENCE\n     \"RFC 4787, Section 11.\"\nDEFVAL { 0 }\n::= { natv2InstanceEntry 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2InstanceLimitSubscriberActives OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-write STATUS current",
      "zh-CHS": "natv2InstanceLimitSubscriberActives对象类型语法Unsigned32 MAX-ACCESS读写状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n    \"Limit on number of total number of active subscribers\n     supported by the NAT instance.  An active subscriber is\n     defined as any subscriber with at least one map entry,\n     including static mappings.  While the number of active\n     subscribers is at this limit, subsequent packets that would\n     otherwise trigger first mappings for newly active\n     subscribers will be dropped and counted in\n     natv2InstanceSubscriberActiveLimitDrops.  The limit is\n     disabled by setting the value to zero.\"\nDEFVAL { 0 }\n::= { natv2InstanceEntry 26 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Table of counters per upper-layer protocol identified by the\n-- packet header and supported by the NAT instance.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2ProtocolTable  OBJECT-TYPE\n    SYNTAX SEQUENCE OF Natv2ProtocolEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Table of protocols with per-protocol counters.  Conceptual\n         rows of the table are indexed by the combination of the NAT\n         instance number and the IANA-assigned upper-layer protocol\n         number as given by the ProtocolNumber Textual Convention\n         (TC) and contained in the packet IP header.  It is up to the\n         agent implementation to determine and operate upon only\n         those upper-layer protocol numbers supported by the NAT\n         instance.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.5.\"\n    ::= { natv2MIBInstanceObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2ProtocolEntry OBJECT-TYPE\n    SYNTAX Natv2ProtocolEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Per-protocol counters.\"\n    INDEX { natv2ProtocolInstanceIndex,\n            natv2ProtocolNumber }\n    ::= { natv2ProtocolTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2ProtocolEntry ::=\n    SEQUENCE {\n        natv2ProtocolInstanceIndex          Natv2InstanceIndex,\n        natv2ProtocolNumber                     ProtocolNumber,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- State\n        natv2ProtocolPortMapEntries             Unsigned32,\n-- Statistics.  Discontinuity object from instance table reused here.\n        natv2ProtocolTranslations               Counter64,\n        natv2ProtocolPortMapCreations           Counter64,\n        natv2ProtocolPortMapFailureDrops        Counter64\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2ProtocolInstanceIndex OBJECT-TYPE\n    SYNTAX Natv2InstanceIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"NAT instance index.  It is up to the implementation to\n         determine and operate upon only those values that\n         correspond to in-service NAT instances.\"\n    ::= { natv2ProtocolEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2ProtocolNumber OBJECT-TYPE\n    SYNTAX ProtocolNumber\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Counters in this conceptual row apply to packets indicating\n         the upper-layer protocol identified by the value of\n         this object.  It is up to the implementation to determine and\n         operate upon only those values that correspond to protocols\n         supported by the NAT instance.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.5.\n         IANA Protocol Numbers,\n         <http://www.iana.org/assignments/protocol-numbers>\"\n    ::= { natv2ProtocolEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": " -- State natv2ProtocolPortMapEntries OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The current number of entries in the port map table in total over the whole NAT instance for a given protocol, including static mappings. A port map entry maps from a given external realm, address, and port for a given protocol to an internal realm, address, and port. This definition includes 'hairpin' mappings, where the external realm is the same as the internal one. Port map entries are also tracked per subscriber, per instance, and per address pool within the",
      "zh-CHS": "--状态natv2ProtocolPortMapEntries对象类型语法Unsigned32 MAX-ACCESS只读状态当前说明“在给定协议的整个NAT实例上，端口映射表中的当前项目总数，包括静态映射。端口映射条目将给定协议的给定外部域、地址和端口映射到内部域、地址和端口。此定义包括“发夹”映射，其中外部域与内部域相同。端口映射条目也会按订阅服务器、实例和服务器中的每个地址池进行跟踪"
    },
    {
      "indent": 4,
      "text": "     instance.\"\nREFERENCE\n    \"RFC 7659, Sections 3.3.5 and 3.3.9.\n     Hairpinning: RFC 4787, Section 6.\"\n::= { natv2ProtocolEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Statistics natv2ProtocolTranslations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets translated by the NAT instance in either direction for the given protocol.",
      "zh-CHS": "--Statistics natv2ProtocolTranslations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“NAT实例在给定协议的任意方向上翻译的数据包的累积数量。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the NAT instance\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2ProtocolEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2ProtocolPortMapCreations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of port map entries created by the NAT instance for the given protocol.",
      "zh-CHS": "natv2ProtocolPortMapCreations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“NAT实例为给定协议创建的端口映射项的累积数量。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the NAT instance\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\n::= { natv2ProtocolEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2ProtocolPortMapFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped because the packet would have triggered the creation of a new port map entry,",
      "zh-CHS": "natv2ProtocolPortMapFailureDrops对象类型语法计数器64 MAX-ACCESS只读状态当前描述“由于数据包会触发新端口映射项的创建而丢弃的数据包的累计数量，"
    },
    {
      "indent": 9,
      "text": "but no port could be allocated for the protocol concerned. The usual case for this will be for a NAT instance that supports address pooling and the 'Paired' pooling behavior recommended by RFC 4787, where the internal endpoint has used up all of the ports allocated to it for the address it was mapped to in the selected address pool in the external realm concerned and cannot be given more ports because - policy or implementation prevents it from having a second address in the same pool, and - policy or unavailability prevents it from acquiring more ports at its originally assigned address.",
      "zh-CHS": "但无法为相关协议分配端口。通常情况下，NAT实例支持地址池和RFC 4787建议的“成对”池行为，如果内部终结点已使用了为其在相关外部领域的选定地址池中映射到的地址分配给它的所有端口，并且由于-策略或实现阻止其在同一池中具有第二个地址，因此无法为其分配更多端口，和-策略或不可用性阻止它在最初分配的地址获取更多端口。"
    },
    {
      "indent": 9,
      "text": "If the NAT instance supports address pooling but its pooling behavior is 'Arbitrary' (meaning that the NAT instance can allocate a new port mapping for the given internal endpoint on any address in the selected address pool and is not bound to what it has already mapped for that endpoint), then this counter is incremented when all ports for the protocol concerned over the whole of the selected address pool are already in use.",
      "zh-CHS": "如果NAT实例支持地址池，但其池行为是“任意”的（这意味着NAT实例可以为选定地址池中的任何地址上的给定内部端点分配新端口映射，并且不绑定到它已为该端点映射的端口映射），然后，当整个选定地址池中相关协议的所有端口都已在使用时，此计数器将递增。"
    },
    {
      "indent": 9,
      "text": "Finally, if the NAT instance has no configured address pooling, then this counter is incremented because all ports for the protocol concerned over the whole of the NAT instance for the external realm concerned are already in use.",
      "zh-CHS": "最后，如果NAT实例没有配置地址池，则此计数器将递增，因为相关外部领域的整个NAT实例上的所有相关协议端口都已在使用。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the NAT instance\n     natv2InstanceDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2InstanceDiscontinuityTime.\"\nREFERENCE\n    \"RFC 4787, end of Section 4.1.\"\n::= { natv2ProtocolEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- pools",
      "zh-CHS": "--水池"
    },
    {
      "indent": 0,
      "text": "natv2PoolTable OBJECT-TYPE SYNTAX SEQUENCE OF Natv2PoolEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Table of address pools, applicable only if these are supported by the NAT instance. An address pool is a set of",
      "zh-CHS": "natv2PoolTable对象类型Natv2PoolEntry MAX-ACCESS不可访问状态当前描述“地址池表，仅当NAT实例支持时适用。地址池是一组"
    },
    {
      "indent": 4,
      "text": "    addresses and ports in a particular realm, available for\n    assignment to the 'external' portion of a mapping.  Where more\n    than one pool has been configured for the realm, policy\n    determines which subscribers and/or services are mapped to\n    which pool.  natv2PoolTable provides basic information, state,\n    statistics, and two notification thresholds for each pool.\n    natv2PoolRangeTable is an expansion table for natv2PoolTable\n    that identifies particular address ranges allocated to the\n    pool.\"\nREFERENCE\n    \"RFC 7659, Section 3.3.6.\"\n::= { natv2MIBInstanceObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolEntry OBJECT-TYPE\n    SYNTAX Natv2PoolEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Entry in the table of address pools.\"\n    INDEX { natv2PoolInstanceIndex, natv2PoolIndex }\n    ::= { natv2PoolTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2PoolEntry ::=\n    SEQUENCE {\n-- Index\n         natv2PoolInstanceIndex                 Natv2InstanceIndex,\n         natv2PoolIndex                         Natv2PoolIndex,\n-- Configuration\n         natv2PoolRealm                         SnmpAdminString,\n         natv2PoolAddressType                   InetAddressType,\n         natv2PoolMinimumPort                   InetPortNumber,\n         natv2PoolMaximumPort                   InetPortNumber,\n-- State\n         natv2PoolAddressMapEntries             Unsigned32,\n         natv2PoolPortMapEntries                Unsigned32,\n-- Statistics and discontinuity time\n         natv2PoolAddressMapCreations           Counter64,\n         natv2PoolPortMapCreations              Counter64,\n         natv2PoolAddressMapFailureDrops        Counter64,\n         natv2PoolPortMapFailureDrops           Counter64,\n         natv2PoolDiscontinuityTime             TimeStamp,\n-- Notification thresholds and objects returned by notifications\n         natv2PoolThresholdUsageLow             Integer32,\n         natv2PoolThresholdUsageHigh            Integer32,\n         natv2PoolNotifiedPortMapEntries        Unsigned32,\n         natv2PoolNotifiedPortMapProtocol       ProtocolNumber,\n         natv2PoolNotificationInterval          Unsigned32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolInstanceIndex OBJECT-TYPE\n    SYNTAX Natv2InstanceIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"NAT instance index.  It is up to the agent implementation\n         to determine and operate upon only those values that\n         correspond to in-service NAT instances.\"\n    ::= { natv2PoolEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolIndex OBJECT-TYPE\n    SYNTAX Natv2PoolIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Index of an address pool that is unique for a given NAT\n         instance.  It is up to the agent implementation to determine\n         and operate upon only those values that correspond to\n         provisioned pools.\"\n    ::= { natv2PoolEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Configuration\nnatv2PoolRealm OBJECT-TYPE\n    SYNTAX SnmpAdminString (SIZE (0..32))\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Address realm to which this pool's addresses belong.\"\n    REFERENCE\n        \"Address realms are discussed in Section 3.3.3 of\n         RFC 7659.  The primary reference is RFC 2663, Section 2.1.\"\n    ::= { natv2PoolEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolAddressType OBJECT-TYPE\n    SYNTAX InetAddressType\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Address type supplied by this address pool.  This will be the\n         same for all pools in a given realm (by definition of an\n         address realm).  Values other than ipv4(1) or ipv6(2) would\n         be unexpected.\"\n    REFERENCE\n        \"InetAddressType in RFC 4001.\"\n    ::= { natv2PoolEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolMinimumPort OBJECT-TYPE SYNTAX InetPortNumber",
      "zh-CHS": "natv2PoolMinimumPort对象类型语法InetPortNumber"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS read-only\nSTATUS current\nDESCRIPTION\n    \"Minimum port number of the range that can be allocated in\n     this pool.  Applies to all protocols supported by the NAT\n     instance.\"\nREFERENCE\n    \"InetPortNumber in RFC 4001.\"\n::= { natv2PoolEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolMaximumPort OBJECT-TYPE\n    SYNTAX InetPortNumber\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Maximum port number of the range that can be allocated in\n         this pool.  Applies to all protocols supported by the NAT\n         instance.\"\n    REFERENCE\n        \"InetPortNumber in RFC 4001.\"\n    ::= { natv2PoolEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- State\nnatv2PoolAddressMapEntries OBJECT-TYPE\n    SYNTAX Unsigned32\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"The current number of address map entries using external\n         addresses drawn from this pool, including static mappings.\n         This definition includes 'hairpin' mappings, where the\n         external realm is the same as the internal one.  Address map\n         entries are also tracked per subscriber and per instance.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.8.\n         Hairpinning: RFC 4787, Section 6.\"\n    ::= { natv2PoolEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolPortMapEntries OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The current number of entries in the port map table using external addresses and ports drawn from this pool, including static mappings. This definition includes 'hairpin' mappings, where the external realm is the same as the internal one. Port map entries are also tracked per",
      "zh-CHS": "natv2PoolPortMapEntries对象类型语法Unsigned32 MAX-ACCESS只读状态当前说明“端口映射表中使用外部地址和从此池中提取的端口（包括静态映射）的当前条目数。此定义包括“发夹”映射，其中外部域与内部域相同。端口映射条目也会根据进行跟踪"
    },
    {
      "indent": 4,
      "text": "     subscriber, per instance, and per protocol within the\n     instance.\"\nREFERENCE\n    \"RFC 7659, Section 3.3.9.\n     Hairpinning: RFC 4787, Section 6.\"\n::= { natv2PoolEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Statistics and discontinuity time natv2PoolAddressMapCreations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of address map entries created in this pool, including static mappings. Address map entries are also tracked per instance and per subscriber.",
      "zh-CHS": "--统计信息和不连续时间natv2PoolAddressMapCreations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“在此池中创建的地址映射项的累积数量，包括静态映射。还将跟踪每个实例和每个订阅服务器的地址映射项。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in\n     the periods between updates of the entity's\n     natv2PoolDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2PoolDiscontinuityTime.\"\n::= { natv2PoolEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolPortMapCreations OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of port map entries created in this pool, including static mappings. Port map entries are also tracked per instance, per protocol, and per subscriber.",
      "zh-CHS": "natv2PoolPortMapCreations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“在此池中创建的端口映射项的累计数量，包括静态映射。还将跟踪每个实例、每个协议和每个订阅服务器的端口映射项。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2PoolDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2PoolDiscontinuityTime.\"\n::= { natv2PoolEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolAddressMapFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current",
      "zh-CHS": "natv2PoolAddressMapFailureDrops对象类型语法计数器64 MAX-ACCESS只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"The cumulative number of packets originated by the subscriber that were dropped because the packet would have triggered the creation of a new address map entry, but no address could be allocated from this address pool because all addresses in the pool have already been fully allocated. Counters of this event are also provided per instance, per protocol, and per subscriber.",
      "zh-CHS": "描述订阅服务器发起的数据包的累计数量，由于该数据包会触发新地址映射条目的创建而被丢弃，但由于池中的所有地址都已被完全分配，因此无法从此地址池中分配任何地址。还为每个实例、每个协议和每个订阅者提供此事件的计数器。"
    },
    {
      "indent": 4,
      "text": "     This value MUST be monotone increasing in the periods\n     between updates of the entity's\n     natv2PoolDiscontinuityTime.  If a manager detects a\n     change in the latter since the last time it sampled this\n     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2PoolDiscontinuityTime.\"\n::= { natv2PoolEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolPortMapFailureDrops OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative number of packets dropped because the packet would have triggered the creation of a new port map entry, but no port could be allocated for the protocol concerned. The usual case for this will be for a NAT instance that supports the 'Paired' pooling behavior recommended by RFC 4787, where the internal endpoint has used up all of the ports allocated to it for the address it was mapped to in this pool and cannot be given more ports because - policy or implementation prevents it from having a second address in the same pool, and - policy or unavailability prevents it from acquiring more ports at its originally assigned address.",
      "zh-CHS": "natv2PoolPortMapFailureDrops对象类型语法计数器64 MAX-ACCESS只读状态当前说明“由于数据包会触发新端口映射条目的创建，但无法为相关协议分配端口，因此丢弃的数据包的累积数量。”。通常情况下，NAT实例支持RFC 4787建议的“成对”池行为，其中，内部终结点已使用为此池中映射到的地址分配给它的所有端口，并且无法为其分配更多端口，因为-策略或实现阻止其在同一池中拥有第二个地址，并且-策略或不可用性阻止其在其原始分配的地址获取更多端口。"
    },
    {
      "indent": 9,
      "text": "If the NAT instance pooling behavior is 'Arbitrary' (meaning that the NAT instance can allocate a new port mapping for the given internal endpoint on any address in the selected address pool and is not bound to what it has already mapped for that endpoint), then this counter is incremented when all ports for the protocol concerned over the whole of this address pool are already in use.",
      "zh-CHS": "如果NAT实例池行为是“任意”的（这意味着NAT实例可以为所选地址池中的任何地址上的给定内部端点分配新端口映射，并且不绑定到它已经为该端点映射的端口映射），然后，当整个地址池中相关协议的所有端口都已在使用时，此计数器将递增。"
    },
    {
      "indent": 9,
      "text": "This value MUST be monotone increasing in the periods between updates of the entity's natv2PoolDiscontinuityTime. If a manager detects a change in the latter since the last time it sampled this",
      "zh-CHS": "该值必须在实体的NATv2Pool更新时间之间单调递增。如果管理者自上次对此进行采样以来检测到后者发生了变化"
    },
    {
      "indent": 4,
      "text": "     counter, it SHOULD NOT make use of the difference between\n     the latest value of the counter and any value retrieved\n     before the new value of natv2PoolDiscontinuityTime.\"\nREFERENCE\n    \"Pooling behavior: RFC 4787, end of Section 4.1.\"\n::= { natv2PoolEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolDiscontinuityTime OBJECT-TYPE\n    SYNTAX TimeStamp\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Snapshot of the value of the sysUpTime object at the\n         beginning of the latest period of continuity of the\n         statistical counters associated with this address\n         pool.  This MUST be initialized when the address pool\n         is configured and MUST be updated whenever the port\n         or address ranges allocated to the pool change.\"\n    ::= { natv2PoolEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Notification thresholds and objects returned by notifications natv2PoolThresholdUsageLow OBJECT-TYPE SYNTAX Integer32 (-1|0..100) UNITS \"Percent\" MAX-ACCESS read-write STATUS current DESCRIPTION \"Threshold for reporting low utilization of the address pool. Utilization at a given instant is calculated as the percentage of ports allocated in port map entries for the most-used protocol at that instant. If utilization is less than or equal to natv2PoolThresholdUsageLow, an instance of natv2NotificationPoolUsageLow may be triggered, unless disabled by setting it to -1. Reporting is subject to the per-pool notification interval given by natv2PoolNotificationInterval. If multiple notifications are triggered during one interval, the agent MUST report only the one with the lowest value of natv2PoolNotifiedPortMapEntries and discard the others.",
      "zh-CHS": "--通知natv2PoolThresholdUsageLow对象类型语法整数32（-1 | 0..100）单位“百分比”最大访问读写状态当前说明返回的通知阈值和对象“报告地址池利用率低的阈值。给定时刻的利用率计算为在该时刻使用最多的协议的端口映射条目中分配的端口的百分比。如果利用率小于或等于natv2PoolThresholdUsageLow，则可能会触发natv2NotificationPoolUsageLow实例，除非通过将其设置为-1将其禁用。报告以natv2PoolNotificationInterval提供的每池通知间隔为准。如果在一个时间间隔内触发多个通知，则代理必须仅报告natv2PoolNotifiedPortMapEntries值最低的通知，并放弃其他通知。"
    },
    {
      "indent": 4,
      "text": " Implementation note: the percentage specified by this object can be converted to a number of port map entries at configuration time (after port and address ranges have been configured or reconfigured) and compared to the current value of natv2PoolNotifiedPortMapEntries.\" REFERENCE \"RFC 7659, Sections 3.1.2 and 3.3.6.\"",
      "zh-CHS": "实施说明：此对象指定的百分比可以在配置时（在配置或重新配置端口和地址范围后）转换为多个端口映射条目，并与natv2PoolNotifiedPortMapEntries的当前值进行比较。“参考”RFC 7659，第3.1.2节和第3.3.6节"
    },
    {
      "indent": 4,
      "text": "DEFVAL { -1 }\n::= { natv2PoolEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolThresholdUsageHigh OBJECT-TYPE SYNTAX Integer32 (-1|0..100) UNITS \"Percent\" MAX-ACCESS read-write STATUS current DESCRIPTION \"Threshold for reporting high utilization of the address pool. Utilization at a given instant is calculated as the percentage of ports allocated in port map entries for the most-used protocol at that instant. If utilization is greater than or equal to natv2PoolThresholdUsageHigh, an instance of natv2NotificationPoolUsageHigh may be triggered, unless disabled by setting it to -1.",
      "zh-CHS": "natv2PoolThresholdUsageHigh对象类型语法整数32（-1 | 0..100）单位“百分比”最大访问读写状态当前说明“报告地址池高利用率的阈值。给定时刻的利用率计算为在该时刻使用最多的协议的端口映射条目中分配的端口的百分比。如果利用率大于或等于natv2PoolThresholdUsageHigh，则可能会触发natv2NotificationPoolUsageHigh的实例，除非通过将其设置为-1将其禁用。"
    },
    {
      "indent": 9,
      "text": "Reporting is subject to the per-pool notification interval given by natv2PoolNotificationInterval. If multiple notifications are triggered during one interval, the agent MUST report only the one with the highest value of natv2PoolNotifiedPortMapEntries and discard the others. In the rare case where both upper and lower thresholds are crossed in the same interval, the agent MUST report only the upper-threshold notification.",
      "zh-CHS": "报告以natv2PoolNotificationInterval提供的每池通知间隔为准。如果在一个时间间隔内触发多个通知，则代理必须仅报告natv2PoolNotifiedPortMapEntries值最高的通知，并放弃其他通知。在极少数情况下，如果在同一时间间隔内同时跨越上阈值和下阈值，则代理必须仅报告上阈值通知。"
    },
    {
      "indent": 4,
      "text": "     Implementation note: the percentage specified by this object\n     can be converted to a number of port map entries at\n     configuration time (after port and address ranges have been\n     configured or reconfigured) and compared to the current\n     value of natv2PoolNotifiedPortMapEntries.\"\nDEFVAL { -1 }\n::= { natv2PoolEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolNotifiedPortMapEntries OBJECT-TYPE\n    SYNTAX Unsigned32\n    MAX-ACCESS accessible-for-notify\n    STATUS current\n    DESCRIPTION\n        \"Number of port map entries using addresses and ports from\n         this address pool for the most-used protocol at a given\n         instant.  One of the objects returned by\n         natv2NotificationPoolUsageLow and\n         natv2NotificationPoolUsageHigh.\"\n    ::= { natv2PoolEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolNotifiedPortMapProtocol OBJECT-TYPE SYNTAX ProtocolNumber",
      "zh-CHS": "natv2PoolNotifiedPortMapProtocol对象类型语法协议号"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS accessible-for-notify\nSTATUS current\nDESCRIPTION\n    \"The most-used protocol (i.e., with the largest number of\n     port map entries) mapped into this address pool at a given\n     instant.  One of the objects returned by\n     natv2NotificationPoolUsageLow and\n     natv2NotificationPoolUsageHigh.\"\n::= { natv2PoolEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolNotificationInterval OBJECT-TYPE\n    SYNTAX Unsigned32 (1..3600)\n    UNITS\n        \"Seconds\"\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \"Minimum number of seconds between successive\n         notifications for this address pool.  Controls the generation\n         of natv2NotificationPoolUsageLow and\n         natv2NotificationPoolUsageHigh.\"\n    DEFVAL\n        { 20 }\n    ::= { natv2PoolEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolRangeTable OBJECT-TYPE\n    SYNTAX SEQUENCE OF Natv2PoolRangeEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"This table contains address ranges used by pool entries.\n         It is an expansion of natv2PoolTable.\"\n    REFERENCE\n        \"RFC 7659, Section 3.3.7.\"\n    ::= { natv2MIBInstanceObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolRangeEntry OBJECT-TYPE\n    SYNTAX Natv2PoolRangeEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"NAT pool address range.\"\n    INDEX {\n         natv2PoolRangeInstanceIndex,\n         natv2PoolRangePoolIndex,\n         natv2PoolRangeRowIndex\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "::= { natv2PoolRangeTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2PoolRangeEntry ::=\n    SEQUENCE {\n        natv2PoolRangeInstanceIndex    Natv2InstanceIndex,\n        natv2PoolRangePoolIndex        Natv2PoolIndex,\n        natv2PoolRangeRowIndex         Unsigned32,\n        natv2PoolRangeBegin            InetAddress,\n        natv2PoolRangeEnd              InetAddress\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolRangeInstanceIndex OBJECT-TYPE\n    SYNTAX Natv2InstanceIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Index of the NAT instance on which the address pool and this\n         address range are configured.  See Natv2InstanceIndex.\"\n    ::= { natv2PoolRangeEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolRangePoolIndex OBJECT-TYPE\n    SYNTAX Natv2PoolIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Index of the address pool to which this address range\n         belongs.  See Natv2PoolIndex.\"\n    ::= { natv2PoolRangeEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolRangeRowIndex OBJECT-TYPE\n    SYNTAX Unsigned32\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Row index for successive range entries for the same\n         address pool.\"\n    ::= { natv2PoolRangeEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolRangeBegin OBJECT-TYPE\n    SYNTAX InetAddress\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Lowest address included in this range.  The type of address\n         (IPv4 or IPv6) is given by natv2PoolAddressType\n         in natv2PoolTable.\"\n    ::= { natv2PoolRangeEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PoolRangeEnd OBJECT-TYPE\n    SYNTAX InetAddress\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Highest address included in this range.  The type of address\n         (IPv4 or IPv6) is given by natv2PoolAddressType\n         in natv2PoolTable.\"\n    ::= { natv2PoolRangeEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Indexed mapping tables",
      "zh-CHS": "--索引映射表"
    },
    {
      "indent": 0,
      "text": "-- Address Map Table. Mapped from the internal to external address.",
      "zh-CHS": "--地址映射表。从内部地址映射到外部地址。"
    },
    {
      "indent": 0,
      "text": "natv2AddressMapTable OBJECT-TYPE SYNTAX SEQUENCE OF Natv2AddressMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Table of mappings from the internal to external address. By definition, this is a snapshot of NAT instance state at a given moment. Indexed by NAT instance, internal realm, and internal address in that realm. Provides the mapped external address and, depending on implementation support, identifies the address pool from which the external address and port were taken and the index of the subscriber to which the mapping has been allocated.",
      "zh-CHS": "Natv2AddressMapEntry MAX-ACCESS的natv2AddressMapTable对象类型语法序列不可访问状态当前描述“从内部地址到外部地址的映射表。根据定义，这是给定时刻NAT实例状态的快照。按NAT实例、内部域和该域中的内部地址编制索引。提供映射的外部地址，并根据实现支持，标识从中获取外部地址和端口的地址池，以及映射已分配到的订阅服务器的索引。"
    },
    {
      "indent": 4,
      "text": "     In the case of DS-Lite (RFC 6333), the indexing realm and\n     address are those of the IPv6 encapsulation rather than the\n     IPv4 inner packet.\"\nREFERENCE\n    \"RFC 7659, Section 3.3.8. DS-Lite: RFC 6333\"\n::= { natv2MIBInstanceObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapEntry OBJECT-TYPE\n    SYNTAX Natv2AddressMapEntry\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Mapping from internal to external address.\"\n    INDEX { natv2AddressMapInstanceIndex,\n            natv2AddressMapInternalRealm,\n            natv2AddressMapInternalAddressType,\n            natv2AddressMapInternalAddress,\n            natv2AddressMapRowIndex }\n    ::= { natv2AddressMapTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2AddressMapEntry ::=\n    SEQUENCE {\n        natv2AddressMapInstanceIndex       Natv2InstanceIndex,\n        natv2AddressMapInternalRealm       SnmpAdminString,\n        natv2AddressMapInternalAddressType  InetAddressType,\n        natv2AddressMapInternalAddress      InetAddress,\n        natv2AddressMapRowIndex            Unsigned32,\n        natv2AddressMapInternalMappedAddressType InetAddressType,\n        natv2AddressMapInternalMappedAddress     InetAddress,\n        natv2AddressMapExternalRealm       SnmpAdminString,\n        natv2AddressMapExternalAddressType InetAddressType,\n        natv2AddressMapExternalAddress     InetAddress,\n        natv2AddressMapExternalPoolIndex   Natv2PoolIndexOrZero,\n        natv2AddressMapSubscriberIndex     Natv2SubscriberIndexOrZero\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapInstanceIndex OBJECT-TYPE\n    SYNTAX Natv2InstanceIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Index of the NAT instance that generated this address map.\"\n    ::= { natv2AddressMapEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapInternalRealm OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Realm to which the internal address belongs. In most cases, this is the realm defining the address space of the packet being translated. However, in the case of DS-Lite (RFC 6333), this realm defines the IPv6 outer header address space. It is the combination of that outer header and the inner IPv4 packet header that is remapped to the external address and realm. The corresponding IPv4 realm is restricted in scope to the tunnel, so there is no point in identifying it. The mapped IPv4 address will normally be the well-known value 192.0.0.2, or at least lie in the reserved 192.0.0.0/29 range.",
      "zh-CHS": "natv2AddressMapInternalRealm对象类型语法SnmpAdminString（大小（0..32））MAX-ACCESS not ACCESS STATUS current DESCRIPTION“内部地址所属的域。在大多数情况下，这是定义要转换的数据包的地址空间的域。但是，对于DS Lite（RFC 6333），此域定义IPv6外部报头地址空间。它是该外部报头和内部IPv4数据包报头的组合，重新映射到外部地址和域。相应的IPv4域的作用域限于隧道，因此没有必要对其进行标识。映射的IPv4地址通常是已知的值192.0.0.2，或至少位于保留的192.0.0.0/29范围内。"
    },
    {
      "indent": 4,
      "text": " If natv2AddressMapSubscriberIndex in this table is a valid subscriber index (i.e., greater than zero), then the value of natv2AddressMapInternalRealm MUST be identical to the value of natv2SubscriberRealm associated with that index.\" REFERENCE \"DS-Lite: RFC 6333, Sections 5.7 (for well-known addresses) and 6.6 (on the need to have the IPv6 tunnel address in",
      "zh-CHS": "如果此表中的NATv2AddressAppSubscriberIndex是有效的订户索引（即大于零），则NATv2AddressAppInternalRealm的值必须与该索引关联的natv2SubscriberRealm的值相同。“参考”DS Lite:RFC 6333，第5.7节（已知地址）和第6.6节（关于需要在中设置IPv6隧道地址）"
    },
    {
      "indent": 4,
      "text": "     the NAT mapping tables).\"\n::= { natv2AddressMapEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapInternalAddressType OBJECT-TYPE SYNTAX InetAddressType MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Address type in the header of packets on the interior side of this mapping. Any value other than ipv4(1) or ipv6(2) would be unexpected.",
      "zh-CHS": "natv2AddressMapInternalAddressType对象类型语法InetAddressType MAX-ACCESS不可访问状态当前描述“此映射内部数据包标头中的地址类型。ipv4（1）或ipv6（2）以外的任何值都是意外值。"
    },
    {
      "indent": 4,
      "text": "     In the DS-Lite case, the address type is ipv6(2).\"\nREFERENCE\n    \"DS-Lite: RFC 6333, Sections 5.7 (for well-known addresses)\n     and 6.6 (on the need to have the IPv6 tunnel source\n     address in the NAT mapping tables).\"\n::= { natv2AddressMapEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapInternalAddress OBJECT-TYPE SYNTAX InetAddress (SIZE (0..16)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Source address of packets originating from the interior of the association provided by this mapping. The address type is given by natv2AddressMapInternalAddressType.",
      "zh-CHS": "natv2AddressMapInternalAddress对象类型语法InetAddress（大小（0..16））MAX-ACCESS不可访问状态当前描述“源自此映射提供的关联内部的数据包的源地址。地址类型由natv2AddressMapInternalAddressType提供。"
    },
    {
      "indent": 4,
      "text": "     In the case of DS-Lite (RFC 6333), this is the IPv6 tunnel\n     source address.  The mapping in this case is considered to\n     be from the combination of the IPv6 tunnel source address\n     natv2AddressMapInternalRealmAddress and the well-known IPv4\n     inner source address natv2AddressMapInternalMappedAddress to\n     the external address.\"\nREFERENCE\n    \"DS-Lite: RFC 6333, Sections 5.7 (for well-known addresses)\n     and 6.6 (on the need to have the IPv6 tunnel address in\n     the NAT mapping tables).\"\n::= { natv2AddressMapEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapRowIndex OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Index of a conceptual row corresponding to a mapping of the given internal realm and address to a single external realm and address. Multiple rows will be present because of a",
      "zh-CHS": "natv2AddressMapRowIndex对象类型语法Unsigned32 MAX-ACCESS不可访问状态当前描述“与给定内部域和地址到单个外部域和地址的映射相对应的概念行的索引。由于"
    },
    {
      "indent": 4,
      "text": "     promiscuous external address selection policy, policies\n     associating the same internal address with different address\n     pools, or because the same internal realm-address\n     combination is communicating with multiple external address\n     realms.\"\n::= { natv2AddressMapEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapInternalMappedAddressType OBJECT-TYPE\n    SYNTAX InetAddressType\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Internal address type actually translated by this mapping.\n         Any value other than ipv4(1) or ipv6(2) would be unexpected.\n         In the general case, this is the same as given by\n         natv2AddressMapInternalRealmAddressType.  In the\n         tunneled case, it is the address type used in the\n         encapsulated packet header.  In particular, in the DS-Lite\n         case, the mapped address type is ipv4(1).\"\n    REFERENCE\n        \"DS-Lite: RFC 6333.\"\n    ::= { natv2AddressMapEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapInternalMappedAddress OBJECT-TYPE\n    SYNTAX InetAddress\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Internal address actually translated by this mapping.  In the\n         general case, this is the same as\n         natv2AddressMapInternalRealmAddress.  The address type is\n         given by natv2AddressMapInternalMappedAddressType.  In the\n         case of DS-Lite (RFC 6333), this is the source address of\n         the encapsulated IPv4 packet, normally lying in the well-known\n         range 192.0.0.0/29.  The mapping in this case is considered\n         to be from the combination of the IPv6 tunnel source address\n         natv2AddressMapInternalRealmAddress and the well-known IPv4\n         inner source address natv2AddressMapInternalMappedAddress to\n         the external address.\"\n    REFERENCE\n        \"DS-Lite: RFC 6333, Sections 5.7 (for well-known addresses)\n         and 6.6 (on the need to have the IPv6 tunnel address in\n         the NAT mapping tables).\"\n    ::= { natv2AddressMapEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapExternalRealm OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-only",
      "zh-CHS": "natv2AddressMapExternalRealm对象类型语法SnmpAdminString（大小（0..32））MAX-ACCESS只读"
    },
    {
      "indent": 4,
      "text": "STATUS current\nDESCRIPTION\n    \"External address realm to which this mapping maps the\n     internal address.  This can be the same as the internal realm\n     in the case of a 'hairpin' connection, but otherwise will be\n     different.\"\n::= { natv2AddressMapEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapExternalAddressType OBJECT-TYPE\n    SYNTAX InetAddressType\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Address type for the external realm.  Any value other than\n         ipv4(1) or ipv6(2) would be unexpected.\"\n    ::= { natv2AddressMapEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapExternalAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"External address to which the internal address is mapped. The address type is given by natv2AddressMapExternalAddressType.",
      "zh-CHS": "natv2AddressMapExternalAddress对象类型语法InetAddress MAX-ACCESS只读状态current DESCRIPTION“内部地址映射到的外部地址。地址类型由natv2AddressMapExternalAddressType给定。"
    },
    {
      "indent": 4,
      "text": "     In the DS-Lite case, the mapping is from the combination of\n     the internal IPv6 tunnel source address as presented in this\n     table and the well-known IPv4 source address of the\n     encapsulated IPv4 packet.\"\nREFERENCE\n    \"DS-Lite: RFC 6333, Sections 5.7 (for well-known addresses)\n     and 6.6 (on the need to have the IPv6 tunnel address in\n     the NAT mapping tables).\"\n::= { natv2AddressMapEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapExternalPoolIndex OBJECT-TYPE\n    SYNTAX Natv2PoolIndexOrZero\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Index of the address pool in the external realm from which\n         the mapped external address given in\n         natv2AddressMapExternalAddress was taken.  Zero if the\n         implementation does not support address pools but has chosen\n         to support this object or if no pool was configured for the\n         given external realm.\"\n    ::= { natv2AddressMapEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2AddressMapSubscriberIndex OBJECT-TYPE\n    SYNTAX Natv2SubscriberIndexOrZero\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Index of the subscriber to which this address mapping\n         applies, or zero if no subscribers are configured on\n         this NAT instance.\"\n    ::= { natv2AddressMapEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- natv2PortMapTable",
      "zh-CHS": "--natv2PortMapTable"
    },
    {
      "indent": 0,
      "text": "natv2PortMapTable OBJECT-TYPE SYNTAX SEQUENCE OF Natv2PortMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Table of port map entries indexed by the NAT instance, protocol, and external realm and address. A port map entry associates an internal upper-layer protocol endpoint with an endpoint for the same protocol in the given external realm. By definition, this is a snapshot of NAT instance state at a given moment. The table provides the basic mapping information.",
      "zh-CHS": "Natv2PortMapEntry MAX-ACCESS的natv2PortMapTable对象类型语法序列不可访问状态当前描述由NAT实例、协议、外部域和地址索引的端口映射项表。端口映射条目将内部上层协议端点与给定外部领域中相同协议的端点相关联。根据定义，这是给定时刻NAT实例状态的快照。该表提供了基本映射信息。"
    },
    {
      "indent": 4,
      "text": "     In the case of DS-Lite (RFC 6333), the table provides the\n     internal IPv6 tunnel source address in\n     natv2PortMapInternalRealmAddress and the IPv4 source address\n     of the encapsulated packet that is actually translated in\n     natv2PortMapInternalMappedAddress.  In the general (non-DS-\n     Lite) case, those two objects will have the same value.\"\nREFERENCE\n    \"RFC 7659, Section 3.3.9.\n     DS-Lite: RFC 6333, Sections 5.7\n     (for well-known addresses) and 6.6 (on the need to have the\n     IPv6 tunnel address in the NAT mapping tables).\"\n::= { natv2MIBInstanceObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapEntry OBJECT-TYPE SYNTAX Natv2PortMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A single NAT mapping.\" INDEX { natv2PortMapInstanceIndex, natv2PortMapProtocol, natv2PortMapExternalRealm, natv2PortMapExternalAddressType,",
      "zh-CHS": "natv2PortMapEntry对象类型语法natv2PortMapEntry MAX-ACCESS不可访问状态当前描述“单个NAT映射”。索引{natv2PortMapInstanceIndex，natv2PortMapProtocol，natv2PortMapExternalRealm，natv2PortMapExternalAddressType，"
    },
    {
      "indent": 4,
      "text": "        natv2PortMapExternalAddress,\n        natv2PortMapExternalPort }\n::= { natv2PortMapTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Natv2PortMapEntry ::=\n    SEQUENCE {\n        natv2PortMapInstanceIndex        Natv2InstanceIndex,\n        natv2PortMapProtocol             ProtocolNumber,\n        natv2PortMapExternalRealm        SnmpAdminString,\n        natv2PortMapExternalAddressType  InetAddressType,\n        natv2PortMapExternalAddress      InetAddress,\n        natv2PortMapExternalPort         InetPortNumber,\n        natv2PortMapInternalRealm        SnmpAdminString,\n        natv2PortMapInternalAddressType  InetAddressType,\n        natv2PortMapInternalAddress      InetAddress,\n        natv2PortMapInternalMappedAddressType InetAddressType,\n        natv2PortMapInternalMappedAddress     InetAddress,\n        natv2PortMapInternalPort         InetPortNumber,\n        natv2PortMapExternalPoolIndex    Natv2PoolIndexOrZero,\n        natv2PortMapSubscriberIndex      Natv2SubscriberIndexOrZero\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapInstanceIndex OBJECT-TYPE\n    SYNTAX Natv2InstanceIndex\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"Index of the NAT instance that created this port map entry.\"\n    ::= { natv2PortMapEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapProtocol OBJECT-TYPE\n    SYNTAX ProtocolNumber\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"The map entry's upper-layer protocol number.\"\n    ::= { natv2PortMapEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapExternalRealm OBJECT-TYPE\n    SYNTAX SnmpAdminString (SIZE(0..32))\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"The realm to which natv2PortMapExternalAddress belongs.\"\n    ::= { natv2PortMapEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapExternalAddressType OBJECT-TYPE SYNTAX InetAddressType",
      "zh-CHS": "natv2PortMapExternalAddressType对象类型语法InetAddressType"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS not-accessible\nSTATUS current\nDESCRIPTION\n    \"Address type for the external realm.  A value other\n     than ipv4(1) or ipv6(2) would be unexpected.\"\n::= { natv2PortMapEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapExternalAddress OBJECT-TYPE SYNTAX InetAddress (SIZE (0..16)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The mapping's assigned external address. (This address is taken from the address pool identified by natv2PortMapExternalPoolIndex, if the implementation supports address pools and pools are configured for the given external realm.) This is the source address for translated outgoing packets. The address type is given by natv2PortMapExternalAddressType.\"",
      "zh-CHS": "natv2PortMapExternalAddress对象类型语法InetAddress（大小（0..16））MAX-ACCESS不可访问状态当前描述“映射的分配外部地址。（如果实现支持地址池并且为给定的外部领域配置了池，则此地址取自NATv2PortMapExternalPooldEx标识的地址池。）这是已转换传出数据包的源地址。地址类型由natv2PortMapExternalAddressType提供。”"
    },
    {
      "indent": 4,
      "text": "::= { natv2PortMapEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapExternalPort OBJECT-TYPE\n    SYNTAX InetPortNumber\n    MAX-ACCESS not-accessible\n    STATUS current\n    DESCRIPTION\n        \"The mapping's assigned external port number.  This is the\n         source port for translated outgoing packets.  If the internal\n         port number given by natv2PortMapInternalPort is zero, this\n         value MUST also be zero.  Otherwise, this MUST be a non-zero\n         value.\"\n    ::= { natv2PortMapEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapInternalRealm OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The realm to which natv2PortMapInternalRealmAddress belongs. In the general case, this realm contains the address that is being translated. In the DS-Lite (RFC 6333) case, this realm defines the IPv6 address space from which the tunnel source address is taken. The realm of the encapsulated IPv4 address is restricted in scope to the tunnel, so there is no point in identifying it separately.\" REFERENCE \"DS-Lite: RFC 6333.\"",
      "zh-CHS": "natv2PortMapInternalRealm对象类型语法SnmpAdminString（大小（0..32））MAX-ACCESS只读状态当前描述“natv2PortMapInternalRealmAddress所属的域。在一般情况下，此域包含正在转换的地址。在DS Lite（RFC 6333）中在这种情况下，此域定义了从中获取隧道源地址的IPv6地址空间。封装的IPv4地址的域在范围内仅限于隧道，因此没有必要单独标识它。“参考”DS Lite:RFC 6333"
    },
    {
      "indent": 4,
      "text": "::= { natv2PortMapEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapInternalAddressType OBJECT-TYPE\n    SYNTAX InetAddressType\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Address type for addresses in the realm identified by\n         natv2PortMapInternalRealm.\"\n    ::= { natv2PortMapEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapInternalAddress OBJECT-TYPE\n    SYNTAX InetAddress\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Source address for packets received under this mapping on\n         the internal side of the NAT instance.  In the general case,\n         this address is the same as the address given in\n         natv2PortMapInternalMappedAddress.  In the DS-Lite case,\n         natv2PortMapInternalAddress is the IPv6 tunnel source\n         address.  The address type is given\n         by natv2PortMapInternalAddressType.\"\n    REFERENCE\n        \"DS-Lite: RFC 6333, Sections 5.7 (for well-known addresses)\n         and 6.6 (on the need to have the IPv6 tunnel address in\n         the NAT mapping tables).\"\n    ::= { natv2PortMapEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapInternalMappedAddressType OBJECT-TYPE\n    SYNTAX InetAddressType\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Internal address type actually translated by this mapping.\n         Any value other than ipv4(1) or ipv6(2) would be unexpected.\n         In the general case, this is the same as given by\n         natv2AddressMapInternalAddressType.  In the DS-Lite\n         case, the address type is ipv4(1).\"\n    REFERENCE\n        \"DS-Lite: RFC 6333.\"\n   ::= { natv2PortMapEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapInternalMappedAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "NATv2PortMapInternalMappeAddress对象类型语法InetAddress MAX-ACCESS只读状态当前说明"
    },
    {
      "indent": 8,
      "text": "\"Internal address actually translated by this mapping. In the general case, this is the same as natv2PortMapInternalRealmAddress. The address type is given by natv2PortMapInternalMappedAddressType.",
      "zh-CHS": "此映射实际转换的内部地址。在一般情况下，这与natv2PortMapInternalRealmAddress相同。地址类型由natv2PortMapInternalMappedAddressType给定。"
    },
    {
      "indent": 4,
      "text": "     In the case of DS-Lite (RFC 6333), this is the source\n     address of the encapsulated IPv4 packet, normally selected\n     from the well-known range 192.0.0.0/29.  The mapping in this\n     case is considered to be from the external address to the\n     combination of the IPv6 tunnel source address\n     natv2PortMapInternalRealmAddress and the well-known IPv4\n     inner source address natv2PortMapInternalMappedAddress.\"\nREFERENCE\n    \"DS-Lite: RFC 6333, Sections 5.7 (for well-known addresses)\n     and 6.6 (on the need to have the IPv6 tunnel address in\n     the NAT mapping tables).\"\n::= { natv2PortMapEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapInternalPort OBJECT-TYPE\n    SYNTAX InetPortNumber\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"The mapping's internal port number.  If this is zero, ports\n         are not translated (i.e., the NAT instance is a pure NAT\n         rather than a Network Address and Port Translator (NAPT)).\"\n    ::= { natv2PortMapEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapExternalPoolIndex OBJECT-TYPE\n    SYNTAX Natv2PoolIndexOrZero\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n        \"Identifies the address pool from which the external address\n         in this port map entry was taken.  Zero if the implementation\n         does not support address pools but has chosen to support\n         this object or if no pools are configured for the given\n         external realm.\"\n    ::= { natv2PortMapEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PortMapSubscriberIndex OBJECT-TYPE SYNTAX Natv2SubscriberIndexOrZero MAX-ACCESS read-only STATUS current DESCRIPTION \"Subscriber using this map entry. Zero if the implementation does not support subscribers but has chosen to support this object.\"",
      "zh-CHS": "natv2PortMapSubscriberIndex对象类型语法Natv2SubscriberIndexOrZero MAX-ACCESS只读状态当前描述“使用此映射项的订阅服务器。如果实现不支持订阅服务器，但已选择支持此对象，则为零。”"
    },
    {
      "indent": 4,
      "text": "::= { natv2PortMapEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Conformance section.  Specifies three cumulatively more extensive\n-- applications: basic NAT, pooled NAT, and carrier-grade NAT.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2MIBConformance OBJECT IDENTIFIER ::= { natv2MIB 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2MIBCompliances OBJECT IDENTIFIER ::= { natv2MIBConformance 1 }\nnatv2MIBGroups      OBJECT IDENTIFIER ::= { natv2MIBConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2MIBBasicCompliance MODULE-COMPLIANCE\n    STATUS current\n    DESCRIPTION\n        \"Describes the requirements for conformance to the basic NAT\n         application of NATV2-MIB.\"\n    MODULE  -- this module\n        MANDATORY-GROUPS { natv2BasicNotificationGroup,\n                           natv2BasicInstanceLevelGroup\n                         }\n    ::= { natv2MIBCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2MIBPooledNATCompliance MODULE-COMPLIANCE\n    STATUS current\n    DESCRIPTION\n        \"Describes the requirements for conformance to the pooled NAT\n         application of NATV2-MIB.\"\n    MODULE  -- this module\n        MANDATORY-GROUPS { natv2BasicNotificationGroup,\n                           natv2BasicInstanceLevelGroup,\n                           natv2PooledNotificationGroup,\n                           natv2PooledInstanceLevelGroup\n                         }\n    ::= { natv2MIBCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2MIBCGNCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"Describes the requirements for conformance to the carrier-grade NAT application of NATV2-MIB.\" MODULE -- this module MANDATORY-GROUPS { natv2BasicNotificationGroup, natv2BasicInstanceLevelGroup, natv2PooledNotificationGroup, natv2PooledInstanceLevelGroup, natv2CGNNotificationGroup, natv2CGNDeviceLevelGroup, natv2CGNInstanceLevelGroup }",
      "zh-CHS": "natv2MIBCGNCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION“描述了与NATV2-MIB的运营商级NAT应用程序的一致性要求。”MODULE——本模块为强制性组{natv2BasicNotificationGroup、NATv2BasicInstanceLevel Group、NATv2ooledNotificationGroup、NATv2ooledInstanceLevel Group、natv2CGNNotificationGroup、NATv2CgnDeviceLevel Group、NATv2CgnInstanceLevel Group}"
    },
    {
      "indent": 4,
      "text": "::= { natv2MIBCompliances 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Groups",
      "zh-CHS": "--团体"
    },
    {
      "indent": 0,
      "text": "natv2BasicNotificationGroup NOTIFICATION-GROUP\n    NOTIFICATIONS {\n         natv2NotificationInstanceAddressMapEntriesHigh,\n         natv2NotificationInstancePortMapEntriesHigh\n    }\n    STATUS  current\n    DESCRIPTION\n        \"Notifications that MUST be supported by all NAT\n         applications.\"\n    ::= { natv2MIBGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2BasicInstanceLevelGroup OBJECT-GROUP\n    OBJECTS {\n-- from natv2InstanceTable\n              natv2InstanceAlias,\n              natv2InstancePortMappingBehavior,\n              natv2InstanceFilteringBehavior,\n              natv2InstanceFragmentBehavior,\n              natv2InstanceAddressMapEntries,\n              natv2InstancePortMapEntries,\n              natv2InstanceTranslations,\n              natv2InstanceAddressMapCreations,\n              natv2InstanceAddressMapEntryLimitDrops,\n              natv2InstanceAddressMapFailureDrops,\n              natv2InstancePortMapCreations,\n              natv2InstancePortMapEntryLimitDrops,\n              natv2InstancePortMapFailureDrops,\n              natv2InstanceFragmentDrops,\n              natv2InstanceOtherResourceFailureDrops,\n              natv2InstanceDiscontinuityTime,\n              natv2InstanceThresholdAddressMapEntriesHigh,\n              natv2InstanceThresholdPortMapEntriesHigh,\n              natv2InstanceNotificationInterval,\n              natv2InstanceLimitAddressMapEntries,\n              natv2InstanceLimitPortMapEntries,\n              natv2InstanceLimitPendingFragments,\n-- from natv2ProtocolTable\n              natv2ProtocolPortMapEntries,\n              natv2ProtocolTranslations,\n              natv2ProtocolPortMapCreations,\n              natv2ProtocolPortMapFailureDrops,\n-- from natv2AddressMapTable\n              natv2AddressMapExternalRealm,\n              natv2AddressMapExternalAddressType,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "              natv2AddressMapExternalAddress,\n-- from natv2PortMapTable\n              natv2PortMapInternalRealm,\n              natv2PortMapInternalAddressType,\n              natv2PortMapInternalAddress,\n              natv2PortMapInternalPort\n            }\n    STATUS current\n    DESCRIPTION\n        \"Per-instance objects that MUST be supported by\n         implementations of all NAT applications.\"\n    ::= { natv2MIBGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PooledNotificationGroup NOTIFICATION-GROUP\n    NOTIFICATIONS {\n         natv2NotificationPoolUsageLow,\n         natv2NotificationPoolUsageHigh\n                  }\n    STATUS  current\n    DESCRIPTION\n        \"Notifications that MUST be supported by pooled and\n         carrier-grade NAT applications.\"\n    ::= { natv2MIBGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2PooledInstanceLevelGroup OBJECT-GROUP\n    OBJECTS {\n-- from natv2InstanceTable\n                    natv2InstancePoolingBehavior,\n-- from natv2PoolTable\n                    natv2PoolRealm,\n                    natv2PoolAddressType,\n                    natv2PoolMinimumPort,\n                    natv2PoolMaximumPort,\n                    natv2PoolAddressMapEntries,\n                    natv2PoolPortMapEntries,\n                    natv2PoolAddressMapCreations,\n                    natv2PoolPortMapCreations,\n                    natv2PoolAddressMapFailureDrops,\n                    natv2PoolPortMapFailureDrops,\n                    natv2PoolDiscontinuityTime,\n                    natv2PoolThresholdUsageLow,\n                    natv2PoolThresholdUsageHigh,\n                    natv2PoolNotifiedPortMapEntries,\n                    natv2PoolNotifiedPortMapProtocol,\n                    natv2PoolNotificationInterval,\n-- from natv2PoolRangeTable\n                    natv2PoolRangeBegin,\n                    natv2PoolRangeEnd,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- from natv2AddressMapTable\n                    natv2AddressMapExternalPoolIndex,\n-- from natv2PortMapTable\n                    natv2PortMapExternalPoolIndex\n            }\n    STATUS current\n    DESCRIPTION\n        \"Per-instance objects that MUST be supported by\n         implementations of the pooled and carrier-grade\n         NAT applications.\"\n    ::= { natv2MIBGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2CGNNotificationGroup NOTIFICATION-GROUP\n    NOTIFICATIONS {\n         natv2NotificationSubscriberPortMappingEntriesHigh\n    }\n    STATUS  current\n    DESCRIPTION\n        \"Notification that MUST be supported by implementations\n         of the carrier-grade NAT application.\"\n    ::= { natv2MIBGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2CGNDeviceLevelGroup OBJECT-GROUP\n    OBJECTS {\n-- from table natv2SubscriberTable\n              natv2SubscriberInternalRealm,\n              natv2SubscriberInternalPrefixType,\n              natv2SubscriberInternalPrefix,\n              natv2SubscriberInternalPrefixLength,\n              natv2SubscriberAddressMapEntries,\n              natv2SubscriberPortMapEntries,\n              natv2SubscriberTranslations,\n              natv2SubscriberAddressMapCreations,\n              natv2SubscriberPortMapCreations,\n              natv2SubscriberAddressMapFailureDrops,\n              natv2SubscriberPortMapFailureDrops,\n              natv2SubscriberDiscontinuityTime,\n              natv2SubscriberLimitPortMapEntries,\n              natv2SubscriberThresholdPortMapEntriesHigh,\n              natv2SubscriberNotificationInterval\n            }\n    STATUS current\n    DESCRIPTION\n        \"Device-level objects that MUST be supported by the\n         carrier-grade NAT application.\"\n    ::= { natv2MIBGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natv2CGNInstanceLevelGroup OBJECT-GROUP",
      "zh-CHS": "natv2CGNInstanceLevelGroup对象组"
    },
    {
      "indent": 3,
      "text": " OBJECTS {\n-- from natv2InstanceTable\n           natv2InstanceSubscriberActiveLimitDrops,\n           natv2InstanceLimitSubscriberActives,\n-- from natv2AddressMapTable\n           natv2AddressMapInternalMappedAddressType,\n           natv2AddressMapInternalMappedAddress,\n           natv2AddressMapSubscriberIndex,\n-- from natv2PortMapTable\n           natv2PortMapInternalMappedAddressType,\n           natv2PortMapInternalMappedAddress,\n           natv2PortMapSubscriberIndex\n         }\n STATUS current\n DESCRIPTION\n     \"Per-instance objects that MUST be supported by the\n      carrier-grade NAT application.\"\n ::= { natv2MIBGroups 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "5. Operational and Management Considerations",
      "section_title": true,
      "zh-CHS": "5. 业务和管理方面的考虑"
    },
    {
      "indent": 3,
      "text": "This section covers two particular areas of operations and management: configuration requirements and transition from or coexistence with the MIB module in [RFC4008].",
      "zh-CHS": "本节涵盖了操作和管理的两个特定领域：配置需求和[RFC4008]中MIB模块的转换或与之共存。"
    },
    {
      "indent": 0,
      "text": "5.1. Configuration Requirements",
      "section_title": true,
      "zh-CHS": "5.1. 配置要求"
    },
    {
      "indent": 3,
      "text": "This MIB module assumes that the following information is configured on the NAT device by means outside the scope of the present document or is imposed by the implementation:",
      "zh-CHS": "此MIB模块假定以下信息通过本文档范围之外的方式在NAT设备上配置，或由实现强制实施："
    },
    {
      "indent": 3,
      "text": "o the set of address realms to which the device connects;",
      "zh-CHS": "o 设备连接到的一组地址域；"
    },
    {
      "indent": 3,
      "text": "o for the CGN application, per-subscriber information including subscriber index, address realm, assigned prefix or address, and (possibly) policies regarding address pool selection in the various possible address realms to which the subscriber may connect. In the particular case of DS-Lite [RFC6333] access, as well as the assigned outer-layer (IPv6) prefix or address, the subscriber information will include an inner (IPv4) source address, usually 192.0.0.2;",
      "zh-CHS": "o 对于CGN应用，每个订阅者的信息，包括订阅者索引、地址域、分配的前缀或地址，以及（可能）关于订阅者可能连接到的各种可能地址域中的地址池选择的策略。在DS Lite[RFC6333]访问的特定情况下，以及分配的外层（IPv6）前缀或地址，订户信息将包括内部（IPv4）源地址，通常为192.0.0.2；"
    },
    {
      "indent": 3,
      "text": "o the set of NAT instances running on the device, identified by NAT instance index and name;",
      "zh-CHS": "o 设备上运行的NAT实例集，由NAT实例索引和名称标识；"
    },
    {
      "indent": 3,
      "text": "o the port mapping, filtering, pooling, and fragment behavior for each NAT instance;",
      "zh-CHS": "o 每个NAT实例的端口映射、筛选、池和片段行为；"
    },
    {
      "indent": 3,
      "text": "o the set of protocols supported by each NAT instance;",
      "zh-CHS": "o 每个NAT实例支持的协议集；"
    },
    {
      "indent": 3,
      "text": "o for the pooled NAT and CGN applications, address pool information for each NAT instance, including for each pool the pool index, address realm, address type, minimum and maximum port number, the address ranges assigned to that pool, and policies for access to that pool's resources;",
      "zh-CHS": "o 对于池NAT和CGN应用程序，每个NAT实例的地址池信息，包括每个池的池索引、地址域、地址类型、最小和最大端口号、分配给该池的地址范围以及访问该池资源的策略；"
    },
    {
      "indent": 3,
      "text": "o static address and port map entries.",
      "zh-CHS": "o 静态地址和端口映射项。"
    },
    {
      "indent": 3,
      "text": "As described in previous sections, this MIB module does provide read-write objects for control of notifications (see especially Section 3.1.2) and limiting of resource consumption (Section 3.1.1). This document is written in advance of any practical experience with the setting of these values and can thus provide only general principles for how to set them.",
      "zh-CHS": "如前几节所述，此MIB模块确实提供了用于控制通知（特别请参见第3.1.2节）和限制资源消耗（第3.1.1节）的读写对象。本文件是在设定这些值的任何实际经验之前编写的，因此只能提供设定这些值的一般原则。"
    },
    {
      "indent": 3,
      "text": "By default, the MIB module definition disables notifications until they are explicitly enabled by the operator, using the associated threshold value to do so. To make use of the notifications, the operator may wish to take the following considerations into account.",
      "zh-CHS": "默认情况下，MIB模块定义禁用通知，直到操作员使用关联的阈值显式启用通知。为了利用通知，运营商可能希望考虑以下因素。"
    },
    {
      "indent": 3,
      "text": "Except for the low address pool utilization notification, the notifications imply that some sort of administrative action is required to mitigate an impending shortage of a particular resource. The choice of value for the triggering threshold needs to take two factors into account: the volatility of usage of the given resource, and the amount of time the operator needs to mitigate the potential overload situation. That time could vary from almost immediate to several weeks required to order and install new hardware or software.",
      "zh-CHS": "除了低地址池利用率通知外，这些通知意味着需要采取某种管理措施来缓解即将出现的特定资源短缺。触发阈值值的选择需要考虑两个因素：给定资源使用的波动性，以及操作员缓解潜在过载情况所需的时间。订购和安装新硬件或软件所需的时间可能从几乎立即到数周不等。"
    },
    {
      "indent": 3,
      "text": "To give a numeric example, if average utilization is going up 1% per week but can vary 10% around that average in any given hour, and it takes two weeks to carry through mitigating measures, the threshold should be set to 88% of the corresponding limit (two weeks' growth plus 10% volatility margin). If mitigating measures can be carried out immediately, this can rise to 90%. For this particular example, that change is insignificant, but in other cases the difference may be large enough to matter in terms of reduced load on the management plane.",
      "zh-CHS": "举一个数字例子，如果平均利用率每周上升1%，但在任何给定的小时内都可能在该平均值周围变化10%，并且采取缓解措施需要两周时间，则阈值应设置为相应限制的88%（两周的增长加上10%的波动幅度）。如果可以立即采取缓解措施，这可能会上升到90%。对于这个特定的例子，这种变化是微不足道的，但在其他情况下，差异可能大到足以影响管理平面上的负载减少。"
    },
    {
      "indent": 3,
      "text": "The notification rate-limit settings really depend on the operator's processes but are a tradeoff between reliably reporting the notified condition and not having it overload the management plane. Reliability rises in importance with the importance of the resource",
      "zh-CHS": "通知速率限制设置实际上取决于操作员的流程，但它是可靠报告通知条件和不使其过载管理平面之间的折衷。可靠性随着资源的重要性而增加"
    },
    {
      "indent": 3,
      "text": "involved. Thus, the default notification intervals defined in this MIB module range from 10 seconds (high reliability) for the address and port map entry thresholds up to 60 seconds (lower reliability) for the per-subscriber port entry thresholds. Experience may suggest better values.",
      "zh-CHS": "卷入的因此，此MIB模块中定义的默认通知间隔范围从地址和端口映射入口阈值的10秒（高可靠性）到每个订户端口入口阈值的60秒（低可靠性）。经验可能表明有更好的价值观。"
    },
    {
      "indent": 3,
      "text": "The limits on number of instance-level address map and port map entries and held fragments relate directly to memory allocations for these tables. The relationship between number of map entries or number of held fragments and memory required will be implementation-specific. Hence it is up to the implementor to provide specific advice on the setting of these limits.",
      "zh-CHS": "实例级地址映射和端口映射条目以及保留片段的数量限制与这些表的内存分配直接相关。映射条目数或保留片段数与所需内存之间的关系将取决于具体实现。因此，应由实施者就这些限制的设置提供具体建议。"
    },
    {
      "indent": 3,
      "text": "The limit on simultaneous number of active subscribers is indirectly related to memory consumption for map entries, but also to processor usage by the NAT instance. The best strategy for setting this limit would seem to be to leave it disabled during an initial period while observing device processor utilization, then to implement a trial setting while observing the number of blocked packets affected by the new limit. The setting may vary by NAT instance if a suitable estimator of likely load (e.g., total number of hosts served by that instance) is available.",
      "zh-CHS": "同时活动订阅者数量的限制间接与映射项的内存消耗有关，也与NAT实例的处理器使用量有关。设置此限制的最佳策略似乎是在观察设备处理器利用率的初始阶段将其禁用，然后在观察受新限制影响的阻塞数据包数量的同时实施尝试设置。如果可能的负载（例如，由该实例服务的主机总数）的合适估计器可用，则该设置可能因NAT实例而异。"
    },
    {
      "indent": 0,
      "text": "5.2. Transition from and Coexistence with NAT-MIB (RFC 4008)",
      "section_title": true,
      "zh-CHS": "5.2. NAT-MIB（RFC 4008）的转换和共存"
    },
    {
      "indent": 3,
      "text": "A manager may have to deal with a mixture of devices supporting the NAT-MIB module [RFC4008] and the NATV2-MIB module defined in the present document. It is even possible that both modules are supported on the same device. The following discussion brings out the limits of comparability between the two MIB modules. A first point to note is that NAT-MIB is primarily focused on configuration, while NATV2-MIB is primarily focused on measurements.",
      "zh-CHS": "管理者可能必须处理支持NAT-MIB模块[RFC4008]和本文档中定义的NATV2-MIB模块的混合设备。甚至可能在同一设备上支持两个模块。下面的讨论指出了两个MIB模块之间的可比性限制。需要注意的第一点是NAT-MIB主要关注配置，而NATV2-MIB主要关注测量。"
    },
    {
      "indent": 3,
      "text": "To summarize the model used by [RFC4008]:",
      "zh-CHS": "总结[RFC4008]使用的模型："
    },
    {
      "indent": 3,
      "text": "o The basic unit of NAT configuration is the interface.",
      "zh-CHS": "o NAT配置的基本单元是接口。"
    },
    {
      "indent": 3,
      "text": "o An interface connects to a single realm, either \"private\" or \"public\". In principle that means there could be multiple instances of one type of realm or the other, but the number is physically limited by the number of interfaces on the NAT device.",
      "zh-CHS": "o 一个接口连接到一个单独的领域，“私有”或“公共”。原则上，这意味着可能存在一种或另一种领域类型的多个实例，但数量受到NAT设备上接口数量的物理限制。"
    },
    {
      "indent": 3,
      "text": "o Before the NAT can operate on a given interface, an \"address map\" has to be configured on it. The address map in [RFC4008] is equivalent to the pool tables in the present document. Since just one \"address map\" is configured per interface, this is the equivalent of a single address pool per interface.",
      "zh-CHS": "o 在NAT可以在给定接口上操作之前，必须在其上配置“地址映射”。[RFC4008]中的地址映射相当于本文档中的池表。由于每个接口只配置一个“地址映射”，这相当于每个接口配置一个地址池。"
    },
    {
      "indent": 3,
      "text": "o The address binding and port binding tables are roughly equivalent to the address map and port map tables in the present document in their content, but they can be either unidirectional or bidirectional. The model in [RFC4008] shows the address binding and port binding as alternative precursors to session establishment, depending on whether the device does address translation only or address and port translation. In contrast, NATV2-MIB assumes a model where bidirectional port mappings are based on bidirectional address mappings that have conceptually been established beforehand.",
      "zh-CHS": "o 地址绑定和端口绑定表的内容大致相当于本文档中的地址映射和端口映射表，但它们可以是单向的，也可以是双向的。[RFC4008]中的模型将地址绑定和端口绑定显示为会话建立的替代先决条件，具体取决于设备是仅进行地址转换还是进行地址和端口转换。相比之下，NATV2-MIB假设一个模型，其中双向端口映射基于预先在概念上建立的双向地址映射。"
    },
    {
      "indent": 3,
      "text": "o The equivalent to an [RFC4008] session in NATV2-MIB would be a pair of port map entries. The added complexity in [RFC4008] is due to the modeling of NAT service types as defined in [RFC3489] (the symmetric NAT in particular) instead of the more granular set of behaviors described in [RFC4787]. (Note: [RFC3489] has been obsoleted by [RFC5389].)",
      "zh-CHS": "o 与NATV2-MIB中的[RFC4008]会话等效的是一对端口映射条目。[RFC4008]中增加的复杂性是由于[RFC3489]中定义的NAT服务类型建模（尤其是对称NAT），而不是[RFC4787]中描述的更精细的行为集。（注：[RFC3489]已被[RFC5389]淘汰。）"
    },
    {
      "indent": 3,
      "text": "With regard to that last point, the mapping between [RFC3489] service types and [RFC4787] NAT behaviors is as follows:",
      "zh-CHS": "关于最后一点，[RFC3489]服务类型和[RFC4787]NAT行为之间的映射如下："
    },
    {
      "indent": 3,
      "text": "o A full cone NAT exhibits endpoint-independent port mapping behavior and endpoint-independent filtering behavior.",
      "zh-CHS": "o 全锥NAT表现出端点无关的端口映射行为和端点无关的过滤行为。"
    },
    {
      "indent": 3,
      "text": "o A restricted cone NAT exhibits endpoint-independent port mapping behavior, but address-dependent filtering behavior.",
      "zh-CHS": "o 受限cone NAT表现出与端点无关的端口映射行为，但表现出与地址相关的过滤行为。"
    },
    {
      "indent": 3,
      "text": "o A port restricted cone NAT exhibits endpoint-independent port mapping behavior, but address-and-port-dependent filtering behavior.",
      "zh-CHS": "o 端口受限的cone NAT表现出与端点无关的端口映射行为，但表现出与地址和端口相关的过滤行为。"
    },
    {
      "indent": 3,
      "text": "o A symmetric NAT exhibits address-and-port-dependent port mapping and filtering behaviors.",
      "zh-CHS": "o 对称NAT表现出与地址和端口相关的端口映射和过滤行为。"
    },
    {
      "indent": 3,
      "text": "Note that these NAT types are a subset of the types that could be configured according to the [RFC4787] behavioral classification used in NATV2-MIB, but they include the two possibilities (full and restricted cone NAT) that satisfy requirements REQ-1 and REQ-8 of [RFC4787]. Note further that other behaviors defined in [RFC4787] are not considered in [RFC4008].",
      "zh-CHS": "请注意，这些NAT类型是可根据NATV2-MIB中使用的[RFC4787]行为分类配置的类型的子集，但它们包括满足[RFC4787]的REQ-1和REQ-8要求的两种可能性（完整和受限锥形NAT）。进一步注意，[RFC4787]中定义的其他行为在[RFC4008]中不考虑。"
    },
    {
      "indent": 3,
      "text": "Having established a context for discussion, we are now in a position to compare the outputs provided to management from the [RFC4008] and NATV2-MIB modules. This comparison relates to the ability to compare results if testing with both MIBs implemented on the same device during a transition period.",
      "zh-CHS": "建立了讨论环境后，我们现在可以比较[RFC4008]和NATV2-MIB模块提供给管理层的输出。如果在过渡期间在同一设备上使用两个MIB进行测试，则此比较与比较结果的能力有关。"
    },
    {
      "indent": 3,
      "text": "[RFC4008] provides three counters: incoming translations, outgoing translations, and discarded packets, at the granularities of interface, address map, and protocol, and incoming and outgoing translations at the levels of individual address bind, address port bind, and session entries. Implementation at the protocol and address map levels is optional. NATV2-MIB provides a single total (both directions) translations counter at the instance, protocol within instance, and subscriber levels. Given the differences in granularity, it appears that the only comparable measurement of translations between the two MIB modules would be through aggregation of the [RFC4008] interface counters to give a total number of translations for the NAT instance.",
      "zh-CHS": "[RFC4008]提供三个计数器：接口、地址映射和协议粒度的传入翻译、传出翻译和丢弃的数据包，以及单个地址绑定、地址端口绑定和会话条目级别的传入和传出翻译。协议和地址映射级别的实现是可选的。NATV2-MIB在实例、实例内的协议和订户级别提供了单个总（双向）翻译计数器。考虑到粒度的差异，两个MIB模块之间的翻译的唯一可比较的度量方法似乎是通过聚合[RFC4008]接口计数器来给出NAT实例的翻译总数。"
    },
    {
      "indent": 3,
      "text": "NATV2-MIB has broken out the single discard counter into a number of different counters reflecting the cause of the discard in more detail, to help in troubleshooting. Again, with the differing levels of granularity, the only comparable statistic would be through aggregation to a single value of total discards per NAT instance.",
      "zh-CHS": "NATV2-MIB将单个丢弃计数器拆分为多个不同的计数器，以更详细地反映丢弃原因，从而帮助进行故障排除。同样，在粒度级别不同的情况下，唯一可比较的统计数据是通过聚合到每个NAT实例的总丢弃量的单个值。"
    },
    {
      "indent": 3,
      "text": "Moving on to state variables, [RFC4008] offers counts of number of \"address map\" (i.e., address pool) entries used (excluding static entries) at the address map level and number of entries in the address bind and address and port bind tables, respectively. Finally, [RFC4008] provides a count of the number of sessions currently using each entry in the address and port bind table. None of these counts are directly comparable with the state values offered by NATV2-MIB, because of the exclusion of static entries at the address map level, and because of the differing models of the translation tables between [RFC4008] and the NATV2-MIB.",
      "zh-CHS": "转到状态变量，[RFC4008]分别提供在地址映射级别使用的“地址映射”（即地址池）条目的数量（不包括静态条目的数量）以及地址绑定和地址及端口绑定表中的条目的数量。最后，[RFC4008]提供了当前使用地址和端口绑定表中每个条目的会话数。由于地址映射级别排除了静态条目，并且[RFC4008]和NATV2-MIB之间的转换表模型不同，因此这些计数都不能与NATV2-MIB提供的状态值直接比较。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB module with a MAX-ACCESS clause of read-write. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection opens devices to attack. These are the tables and objects and their sensitivity/vulnerability:",
      "zh-CHS": "此MIB模块中定义了许多管理对象，其MAX-ACCESS子句为read-write。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作会使设备受到攻击。以下是表和对象及其敏感度/漏洞："
    },
    {
      "indent": 3,
      "text": "Limits: An attacker setting a very low or very high limit can easily cause a denial-of-service situation.",
      "zh-CHS": "限制：攻击者设置非常低或非常高的限制很容易造成拒绝服务情况。"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceLimitAddressMapEntries;",
      "zh-CHS": "* natv2InstanceLimitAddressMapEntries；"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceLimitPortMapEntries;",
      "zh-CHS": "* natv2InstanceLimitPortMapEntries；"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceLimitPendingFragments;",
      "zh-CHS": "* natv2InstanceLimitPendingFragments；"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceLimitSubscriberActives;",
      "zh-CHS": "* natv2InstanceLimitSubscriberActives；"
    },
    {
      "indent": 6,
      "text": "* natv2SubscriberLimitPortMapEntries.",
      "zh-CHS": "* natv2SubscriberLimitPortMapEntries。"
    },
    {
      "indent": 3,
      "text": "Notification thresholds: An attacker setting an arbitrarily low threshold can cause many useless notifications to be generated (subject to the notification interval). Setting an arbitrarily high threshold can effectively disable notifications, which could be used to hide another attack.",
      "zh-CHS": "通知阈值：攻击者设置任意低的阈值会导致生成许多无用的通知（取决于通知间隔）。设置任意高的阈值可以有效地禁用通知，该通知可用于隐藏另一次攻击。"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceThresholdAddressMapEntriesHigh;",
      "zh-CHS": "* natv2InstanceThresholdAddressMapEntriesHigh；"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceThresholdPortMapEntriesHigh;",
      "zh-CHS": "* NATv2安装阈值端口映射中心高；"
    },
    {
      "indent": 6,
      "text": "* natv2PoolThresholdUsageLow;",
      "zh-CHS": "* natv2PoolThresholdUsageLow；"
    },
    {
      "indent": 6,
      "text": "* natv2PoolThresholdUsageHigh;",
      "zh-CHS": "* natv2PoolThresholdUsageHigh；"
    },
    {
      "indent": 6,
      "text": "* natv2SubscriberThresholdPortMapEntriesHigh.",
      "zh-CHS": "* NATv2SubscriberThresholdPortMapentriesh高。"
    },
    {
      "indent": 3,
      "text": "Notification intervals: An attacker setting a low notification interval in combination with a low threshold value can cause many useless notifications to be generated.",
      "zh-CHS": "通知间隔：攻击者将低通知间隔与低阈值相结合会导致生成许多无用的通知。"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceNotificationInterval;",
      "zh-CHS": "* NATv2安装通知间隔；"
    },
    {
      "indent": 6,
      "text": "* natv2PoolNotificationInterval;",
      "zh-CHS": "* NATv2oolNotificationInterval；"
    },
    {
      "indent": 6,
      "text": "* natv2SubscriberNotificationInterval.",
      "zh-CHS": "* natv2SubscriberNotificationInterval。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. These are the tables and objects and their sensitivity/vulnerability:",
      "zh-CHS": "在某些网络环境中，此MIB模块中的某些可读对象（即具有MAX-ACCESS而非not ACCESS的对象）可能被视为敏感或易受攻击。因此，在通过SNMP通过网络发送这些对象时，控制甚至获取和/或通知对这些对象的访问，甚至可能加密这些对象的值，这一点非常重要。以下是表和对象及其敏感度/漏洞："
    },
    {
      "indent": 3,
      "text": "Objects that reveal host identities: Various objects can reveal the identity of private hosts that are engaged in a session with external end nodes. A curious outsider could monitor these to assess the number of private hosts being supported by the NAT device. Further, a disgruntled former employee of an enterprise could use the information to break into specific private hosts by intercepting the existing sessions or originating new sessions into the host. If nothing else, unauthorized monitoring of these objects will violate individual subscribers' privacy.",
      "zh-CHS": "显示主机标识的对象：各种对象可以显示与外部终端节点进行会话的专用主机的标识。一个好奇的局外人可以监视这些设备，以评估NAT设备支持的私有主机的数量。此外，不满的企业前员工可以通过拦截现有会话或向主机发起新会话，利用这些信息进入特定的私有主机。如果没有其他原因，对这些对象的未经授权的监视将侵犯个人订阅者的隐私。"
    },
    {
      "indent": 6,
      "text": "* entries in the natv2SubscriberTable;",
      "zh-CHS": "* natv2SubscriberTable中的条目；"
    },
    {
      "indent": 6,
      "text": "* entries in the natv2AddressMapTable;",
      "zh-CHS": "* natv2AddressMapTable中的条目；"
    },
    {
      "indent": 6,
      "text": "* entries in the natv2PortMapTable.",
      "zh-CHS": "* natv2PortMapTable中的条目。"
    },
    {
      "indent": 3,
      "text": "Other objects that reveal NAT state: Other managed objects in this MIB may contain information that may be sensitive from a business perspective, in that they may represent NAT capabilities, business policies, and state information.",
      "zh-CHS": "显示NAT状态的其他对象：此MIB中的其他托管对象可能包含从业务角度看可能敏感的信息，因为它们可能表示NAT功能、业务策略和状态信息。"
    },
    {
      "indent": 6,
      "text": "* natv2SubscriberLimitPortMapEntries;",
      "zh-CHS": "* natv2SubscriberLimitPortMapEntries；"
    },
    {
      "indent": 6,
      "text": "* natv2InstancePortMappingBehavior;",
      "zh-CHS": "* natv2InstancePortMappingBehavior；"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceFilteringBehavior;",
      "zh-CHS": "* NATv2安装过滤器行为；"
    },
    {
      "indent": 6,
      "text": "* natv2InstancePoolingBehavior;",
      "zh-CHS": "* NATv2安装池行为；"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceFragmentBehavior;",
      "zh-CHS": "* natv2InstanceFragmentBehavior；"
    },
    {
      "indent": 6,
      "text": "* natv2InstanceAddressMapEntries;",
      "zh-CHS": "* natv2InstanceAddressMapEntries；"
    },
    {
      "indent": 6,
      "text": "* natv2InstancePortMapEntries.",
      "zh-CHS": "* natv2InstancePortMapEntries。"
    },
    {
      "indent": 3,
      "text": "There are no objects that are sensitive in their own right, such as passwords or monetary amounts.",
      "zh-CHS": "没有任何对象本身是敏感的，例如密码或货币金额。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "zh-CHS": "SNMPv3之前的SNMP版本未包含足够的安全性。即使网络本身是安全的（例如通过使用IPsec），也无法控制安全网络上的谁可以访问和获取/设置（读取/更改/创建/删除）此MIB模块中的对象。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD provide the security features described by the\nSNMPv3 framework (see [RFC3410]), and implementations claiming\ncompliance to the SNMPv3 standard MUST include full support for\nauthentication and privacy via the User-based Security Model (USM)\n[RFC3414] with the AES cipher algorithm [RFC3826].  Implementations\nMAY also provide support for the Transport Security Model (TSM)\n[RFC5591] in combination with a secure transport such as SSH\n[RFC5592] or TLS/DTLS [RFC6353].",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to",
      "zh-CHS": "此外，不建议部署SNMPv3之前的SNMP版本。相反，建议部署SNMPv3并启用加密安全性。然后，客户/运营商有责任确保访问此MIB模块实例的SNMP实体正确配置为访问"
    },
    {
      "indent": 3,
      "text": "the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "对象仅限于那些拥有合法权限来获取或设置（更改/创建/删除）它们的主体（用户）。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has assigned an object identifier to the natv2MIB module, with prefix iso.org.dod.internet.mgmt.mib-2 in the SMI Numbers registry [SMI-NUMBERS].",
      "zh-CHS": "IANA已为natv2MIB模块分配了一个对象标识符，在SMI编号注册表[SMI-Numbers]中前缀为iso.org.dod.internet.mgmt.mib-2。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, DOI 10.17487/RFC2578, April 1999, <http://www.rfc-editor.org/info/rfc2578>.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Ed.，Perkins，D.，Ed.，和J.Schoenwaeld，Ed.“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，DOI 10.17487/RFC2578，1999年4月<http://www.rfc-editor.org/info/rfc2578>."
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Textual Conventions for SMIv2\", STD 58, RFC 2579, DOI 10.17487/RFC2579, April 1999, <http://www.rfc-editor.org/info/rfc2579>.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Ed.，Perkins，D.，Ed.，和J.Schoenwaeld，Ed.“SMIv2的文本约定”，STD 58，RFC 2579，DOI 10.17487/RFC2579，1999年4月<http://www.rfc-editor.org/info/rfc2579>."
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Conformance Statements for SMIv2\", STD 58, RFC 2580, DOI 10.17487/RFC2580, April 1999, <http://www.rfc-editor.org/info/rfc2580>.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Ed.，Perkins，D.，Ed.，和J.Schoenwaeld，Ed.“SMIv2的一致性声明”，STD 58，RFC 2580，DOI 10.17487/RFC2580，1999年4月<http://www.rfc-editor.org/info/rfc2580>."
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, DOI 10.17487/RFC3411, December 2002, <http://www.rfc-editor.org/info/rfc3411>.",
      "zh-CHS": "[RFC3411]Harrington，D.，Presohn，R.，和B.Wijnen，“描述简单网络管理协议（SNMP）管理框架的体系结构”，STD 62，RFC 3411，DOI 10.17487/RFC34112002年12月<http://www.rfc-editor.org/info/rfc3411>."
    },
    {
      "indent": 3,
      "text": "[RFC3414] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", STD 62, RFC 3414, DOI 10.17487/RFC3414, December 2002, <http://www.rfc-editor.org/info/rfc3414>.",
      "zh-CHS": "[RFC3414]Blumenthal，U.和B.Wijnen，“简单网络管理协议（SNMPv3）版本3的基于用户的安全模型（USM）”，STD 62，RFC 3414，DOI 10.17487/RFC3414，2002年12月<http://www.rfc-editor.org/info/rfc3414>."
    },
    {
      "indent": 3,
      "text": "[RFC3826] Blumenthal, U., Maino, F., and K. McCloghrie, \"The Advanced Encryption Standard (AES) Cipher Algorithm in the SNMP User-based Security Model\", RFC 3826, DOI 10.17487/RFC3826, June 2004, <http://www.rfc-editor.org/info/rfc3826>.",
      "zh-CHS": "[RFC3826]Blumenthal，U.，Maino，F.，和K.McCloghrie，“基于SNMP用户的安全模型中的高级加密标准（AES）密码算法”，RFC 3826，DOI 10.17487/RFC3826，2004年6月<http://www.rfc-editor.org/info/rfc3826>."
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., and J. Schoenwaelder, \"Textual Conventions for Internet Network Addresses\", RFC 4001, DOI 10.17487/RFC4001, February 2005, <http://www.rfc-editor.org/info/rfc4001>.",
      "zh-CHS": "[RFC4001]Daniele，M.，Haberman，B.，Routhier，S.，和J.Schoenwaeld，“互联网网络地址的文本约定”，RFC 4001，DOI 10.17487/RFC4001，2005年2月<http://www.rfc-editor.org/info/rfc4001>."
    },
    {
      "indent": 3,
      "text": "[RFC4787] Audet, F., Ed. and C. Jennings, \"Network Address Translation (NAT) Behavioral Requirements for Unicast UDP\", BCP 127, RFC 4787, DOI 10.17487/RFC4787, January 2007, <http://www.rfc-editor.org/info/rfc4787>.",
      "zh-CHS": "[RFC4787]Audet，F.，Ed.和C.Jennings，“单播UDP的网络地址转换（NAT）行为要求”，BCP 127，RFC 4787，DOI 10.17487/RFC4787，2007年1月<http://www.rfc-editor.org/info/rfc4787>."
    },
    {
      "indent": 3,
      "text": "[RFC5591] Harrington, D. and W. Hardaker, \"Transport Security Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 5591, DOI 10.17487/RFC5591, June 2009, <http://www.rfc-editor.org/info/rfc5591>.",
      "zh-CHS": "[RFC5591]Harrington，D.和W.Hardaker，“简单网络管理协议（SNMP）的传输安全模型”，STD 78，RFC 5591，DOI 10.17487/RFC55912009年6月<http://www.rfc-editor.org/info/rfc5591>."
    },
    {
      "indent": 3,
      "text": "[RFC5592] Harrington, D., Salowey, J., and W. Hardaker, \"Secure Shell Transport Model for the Simple Network Management Protocol (SNMP)\", RFC 5592, DOI 10.17487/RFC5592, June 2009, <http://www.rfc-editor.org/info/rfc5592>.",
      "zh-CHS": "[RFC5592]Harrington，D.，Salowey，J.，和W.Hardaker，“简单网络管理协议（SNMP）的安全外壳传输模型”，RFC 5592，DOI 10.17487/RFC5592，2009年6月<http://www.rfc-editor.org/info/rfc5592>."
    },
    {
      "indent": 3,
      "text": "[RFC6353] Hardaker, W., \"Transport Layer Security (TLS) Transport Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 6353, DOI 10.17487/RFC6353, July 2011, <http://www.rfc-editor.org/info/rfc6353>.",
      "zh-CHS": "[RFC6353]Hardaker，W.“简单网络管理协议（SNMP）的传输层安全（TLS）传输模型”，STD 78，RFC 6353，DOI 10.17487/RFC6353，2011年7月<http://www.rfc-editor.org/info/rfc6353>."
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, DOI 10.17487/RFC2460, December 1998, <http://www.rfc-editor.org/info/rfc2460>.",
      "zh-CHS": "[RFC2460]Deering，S.和R.Hinden，“互联网协议，第6版（IPv6）规范”，RFC 2460，DOI 10.17487/RFC2460，1998年12月<http://www.rfc-editor.org/info/rfc2460>."
    },
    {
      "indent": 3,
      "text": "[RFC2663] Srisuresh, P. and M. Holdrege, \"IP Network Address Translator (NAT) Terminology and Considerations\", RFC 2663, DOI 10.17487/RFC2663, August 1999, <http://www.rfc-editor.org/info/rfc2663>.",
      "zh-CHS": "[RFC2663]Srisuresh，P.和M.Holdrege，“IP网络地址转换器（NAT）术语和注意事项”，RFC 2663，DOI 10.17487/RFC2663，1999年8月<http://www.rfc-editor.org/info/rfc2663>."
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, DOI 10.17487/RFC3410, December 2002, <http://www.rfc-editor.org/info/rfc3410>.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.，和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 3410，DOI 10.17487/RFC3410，2002年12月<http://www.rfc-editor.org/info/rfc3410>."
    },
    {
      "indent": 3,
      "text": "[RFC3489] Rosenberg, J., Weinberger, J., Huitema, C., and R. Mahy, \"STUN - Simple Traversal of User Datagram Protocol (UDP) Through Network Address Translators (NATs)\", RFC 3489, DOI 10.17487/RFC3489, March 2003, <http://www.rfc-editor.org/info/rfc3489>.",
      "zh-CHS": "[RFC3489]Rosenberg，J.，Weinberger，J.，Huitema，C.，和R.Mahy，“STUN-通过网络地址转换器（NAT）简单遍历用户数据报协议（UDP）”，RFC 3489，DOI 10.17487/RFC3489，2003年3月<http://www.rfc-editor.org/info/rfc3489>."
    },
    {
      "indent": 3,
      "text": "[RFC4008] Rohit, R., Srisuresh, P., Raghunarayan, R., Pai, N., and C. Wang, \"Definitions of Managed Objects for Network Address Translators (NAT)\", RFC 4008, DOI 10.17487/RFC4008, March 2005, <http://www.rfc-editor.org/info/rfc4008>.",
      "zh-CHS": "[RFC4008]Rohit，R.，Srisuresh，P.，Raghunarayan，R.，Pai，N.，和C.Wang，“网络地址转换器（NAT）管理对象的定义”，RFC 4008，DOI 10.17487/RFC4008，2005年3月<http://www.rfc-editor.org/info/rfc4008>."
    },
    {
      "indent": 3,
      "text": "[RFC5389] Rosenberg, J., Mahy, R., Matthews, P., and D. Wing, \"Session Traversal Utilities for NAT (STUN)\", RFC 5389, DOI 10.17487/RFC5389, October 2008, <http://www.rfc-editor.org/info/rfc5389>.",
      "zh-CHS": "[RFC5389]Rosenberg，J.，Mahy，R.，Matthews，P.，和D.Wing，“NAT（STUN）的会话遍历实用程序”，RFC 5389，DOI 10.17487/RFC5389，2008年10月<http://www.rfc-editor.org/info/rfc5389>."
    },
    {
      "indent": 3,
      "text": "[RFC6333] Durand, A., Droms, R., Woodyatt, J., and Y. Lee, \"Dual-Stack Lite Broadband Deployments Following IPv4 Exhaustion\", RFC 6333, DOI 10.17487/RFC6333, August 2011, <http://www.rfc-editor.org/info/rfc6333>.",
      "zh-CHS": "[RFC6333]Durand，A.，Droms，R.，Woodyatt，J.，和Y.Lee，“IPv4耗尽后的双栈Lite宽带部署”，RFC 6333，DOI 10.17487/RFC6333，2011年8月<http://www.rfc-editor.org/info/rfc6333>."
    },
    {
      "indent": 3,
      "text": "[RFC7658] Perreault, S., Tsou, T., Sivakumar, S., and T. Taylor, \"Deprecation of MIB Module NAT-MIB: Managed Objects for Network Address Translators (NATs)\", RFC 7658, DOI 10.17487/RFC7658, October 2015, <http://www.rfc-editor.org/info/rfc7658>.",
      "zh-CHS": "[RFC7658]Perreault，S.，Tsou，T.，Sivakumar，S.，和T.Taylor，“MIB模块NAT-MIB的弃用：网络地址转换器（NAT）的托管对象”，RFC 7658，DOI 10.17487/RFC7658，2015年10月<http://www.rfc-editor.org/info/rfc7658>."
    },
    {
      "indent": 3,
      "text": "[SMI-NUMBERS] IANA, \"Structure of Management Information (SMI) Numbers (MIB Module Registrations)\", <http://www.iana.org/assignments/smi-number>.",
      "zh-CHS": "[SMI-NUMBERS]IANA，“管理信息（SMI）编号结构（MIB模块注册）”<http://www.iana.org/assignments/smi-number>."
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Simon Perreault Jive Communications Quebec, QC Canada",
      "zh-CHS": "Simon Perreault Jive Communications魁北克，加拿大QC"
    },
    {
      "indent": 3,
      "text": "Email: sperreault@jive.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Tina Tsou Huawei Technologies Bantian, Longgang District Shenzhen 518129 China",
      "zh-CHS": "中国深圳市龙岗区华为技术有限公司坂田518129"
    },
    {
      "indent": 3,
      "text": "Email: tina.tsou.zouting@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Senthil Sivakumar Cisco Systems 7100-8 Kit Creek Road Research Triangle Park, North Carolina 27709 United States",
      "zh-CHS": "Senthil Sivakumar Cisco Systems 7100-8 Kit Creek Road Research Triangle Park，美国北卡罗来纳州27709"
    },
    {
      "indent": 3,
      "text": "Phone: +1 919 392 5158\nEmail: ssenthil@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Tom Taylor PT Taylor Consulting Ottawa Canada",
      "zh-CHS": "汤姆泰勒加拿大渥太华咨询公司"
    },
    {
      "indent": 3,
      "text": "Email: tom.taylor.stds@gmail.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}