{
  "title": {
    "text": "RFC 7709: Requirements for Very Fast Setup of GMPLS Label Switched Paths (LSPs)",
    "zh-CHS": "RFC 7709"
  },
  "number": 7709,
  "created_at": "2021-10-31 15:32:40.159797+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     A. Malis, Ed.\nRequest for Comments: 7709                           Huawei Technologies\nCategory: Informational                                        B. Wilson\nISSN: 2070-1721                           Applied Communication Sciences\n                                                                G. Clapp\n                                                      AT&T Labs Research\n                                                               V. Shukla\n                                                  Verizon Communications\n                                                           November 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 1,
      "text": "Requirements for Very Fast Setup of GMPLS Label Switched Paths (LSPs)",
      "zh-CHS": "GMPLS标签交换路径（LSP）的快速设置要求"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Establishment and control of Label Switch Paths (LSPs) have become mainstream tools of commercial and government network providers. One of the elements of further evolving such networks is scaling their performance in terms of LSP bandwidth and traffic loads, LSP intensity (e.g., rate of LSP creation, deletion, and modification), LSP set up delay, quality-of-service differentiation, and different levels of resilience.",
      "zh-CHS": "标签交换路径（LSP）的建立和控制已成为商业和政府网络提供商的主流工具。进一步发展此类网络的要素之一是根据LSP带宽和流量负载、LSP强度（例如，LSP创建、删除和修改的速率）、LSP设置延迟、服务质量差异以及不同的恢复能力水平来扩展其性能。"
    },
    {
      "indent": 3,
      "text": "The goal of this document is to present target scaling objectives and the related protocol requirements for Generalized Multi-Protocol Label Switching (GMPLS).",
      "zh-CHS": "本文档的目标是介绍通用多协议标签交换（GMPLS）的目标扩展目标和相关协议要求。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7709.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7709."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Background  . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Motivation  . . . . . . . . . . . . . . . . . . . . . . . . .   4\n4.  Driving Applications and Their Requirements . . . . . . . . .   5\n  4.1.  Key Application Requirements  . . . . . . . . . . . . . .   5\n5.  Requirements for Very Fast Setup of GMPLS LSPs  . . . . . . .   6\n  5.1.  Protocol and Procedure Requirements . . . . . . . . . . .   6\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   7\n7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   7\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .   7\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .   8\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Generalized Multi-Protocol Label Switching (GMPLS) [RFC3471] [RFC3945] includes an architecture and a set of control-plane protocols that can be used to operate data networks ranging from packet-switch-capable networks, through those networks that use Time Division Multiplexing, to WDM networks. The Path Computation Element (PCE) architecture [RFC4655] defines functional components that can be used to compute and suggest appropriate paths in connection-oriented traffic-engineered networks. Additional wavelength switched optical networks (WSON) considerations were defined in [RFC6163].",
      "zh-CHS": "通用多协议标签交换（GMPLS）[RFC3471][RFC3945]包括一种体系结构和一组控制平面协议，可用于操作数据网络，从支持分组交换的网络到使用时分复用的网络，再到WDM网络。路径计算元素（PCE）体系结构[RFC4655]定义了可用于在面向连接的流量工程网络中计算和建议适当路径的功能组件。[RFC6163]中定义了其他波长交换光网络（WSON）注意事项。"
    },
    {
      "indent": 3,
      "text": "This document refers to the same general framework and technologies, but it adds requirements related to expediting LSP setup under heavy connection churn scenarios, while achieving low blocking under an overall distributed control plane. This document focuses on a specific problem space -- high-capacity and highly dynamic connection request scenarios -- that may require clarification and or extensions to current GMPLS protocols and procedures. In particular, the purpose of this document is to address the potential need for protocols and procedures that enable expediting the setup of LSPs in high-churn scenarios. Both single-domain and multi-domain network scenarios are considered.",
      "zh-CHS": "本文档引用了相同的通用框架和技术，但增加了在连接频繁情况下加快LSP设置的相关要求，同时在总体分布式控制平面下实现低阻塞。本文档关注一个特定的问题空间——高容量和高度动态的连接请求场景——可能需要对当前的GMPLS协议和过程进行澄清和/或扩展。特别是，本文件的目的是解决协议和程序的潜在需求，这些协议和程序能够在高流失率场景中加快LSP的设置。同时考虑了单域和多域网络场景。"
    },
    {
      "indent": 3,
      "text": "This document focuses on the following two topics: 1) the driving applications and main characteristics and requirements of this problem space, and 2) the key requirements that may be novel with respect to current GMPLS protocols.",
      "zh-CHS": "本文档主要关注以下两个主题：1）驱动应用和该问题空间的主要特征和要求，以及2）与当前GMPLS协议相关的新的关键要求。"
    },
    {
      "indent": 3,
      "text": "This document presents the objectives and related requirements for GMPLS to provide the control for networks operating with such performance requirements. While specific deployment scenarios are considered part of the presentation of objectives, the stated requirements are aimed at ensuring the control protocols are not the limiting factor in achieving a particular network's performance. Implementation dependencies are out of scope of this document.",
      "zh-CHS": "本文件介绍了GMPLS的目标和相关要求，以提供对具有此类性能要求的网络运行的控制。虽然特定部署场景被视为目标陈述的一部分，但所述要求旨在确保控制协议不是实现特定网络性能的限制因素。实现依赖项超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "Other documents may be needed to define how GMPLS protocols meet the requirements laid out in this document. Such future documents may define extensions or simply clarify how existing mechanisms may be used to address the key requirements of highly dynamic networks.",
      "zh-CHS": "可能需要其他文件来定义GMPLS协议如何满足本文件中规定的要求。这些未来的文件可能会定义扩展，或者只是澄清如何使用现有机制来满足高度动态网络的关键需求。"
    },
    {
      "indent": 0,
      "text": "2. Background",
      "section_title": true,
      "zh-CHS": "2. 出身背景"
    },
    {
      "indent": 3,
      "text": "The Defense Advanced Research Projects Agency (DARPA) Core Optical Networks (CORONET) program [Chiu] is an example target environment that includes IP and optical commercial and government networks, with a focus on highly dynamic and resilient multi-terabit core networks.",
      "zh-CHS": "国防高级研究计划局（DARPA）核心光网络（CORONET）计划[Chiu]是一个示例目标环境，包括IP和光商业及政府网络，重点关注高度动态和弹性的多特比特核心网络。"
    },
    {
      "indent": 3,
      "text": "It anticipates the need for rapid (sub-second) setup and SONET/SDH-like restoration times for high-churn (up to tens of requests per second network wide and holding times as short as one second) on-demand wavelength, sub-wavelength, and packet services for a variety of applications (e.g., grid computing, cloud computing, data visualization, fast data transfer, etc.). This must be done while meeting stringent call-blocking requirements and while minimizing the use of resources such as time slots, switch ports, wavelength conversion, etc.",
      "zh-CHS": "它预计需要快速（亚秒）设置和类似SONET/SDH的恢复时间，用于各种应用的按需波长、亚波长和数据包服务的高搅动率（网络范围内高达每秒数十个请求，保持时间短至1秒）（例如，网格计算、云计算、数据可视化、快速数据传输等）。这必须在满足严格的呼叫阻塞要求的同时完成，同时尽量减少资源的使用，如时隙、交换机端口、波长转换等。"
    },
    {
      "indent": 0,
      "text": "3. Motivation",
      "section_title": true,
      "zh-CHS": "3. 动机"
    },
    {
      "indent": 3,
      "text": "The motivation for this document, and envisioned related future documents, is two-fold:",
      "zh-CHS": "本文件以及未来相关预期文件的动机有两个方面："
    },
    {
      "indent": 3,
      "text": "1. The anticipated need for rapid setup, while maintaining low blocking, of large bandwidth and highly churned on-demand connections (in the form of sub-wavelengths, e.g., OTN ODUx, and wavelengths, e.g., OTN OCh) for a variety of applications including grid computing, cloud computing, data visualization, and intra- and inter-datacenter communications.",
      "zh-CHS": "1. 在保持低阻塞的同时，快速建立各种应用（包括网格计算、云计算、数据可视化）的大带宽和高波动的按需连接（以子波长的形式，如OTN ODUx和波长的形式，如OTN OCh）的预期需求，以及数据中心内和数据中心间的通信。"
    },
    {
      "indent": 3,
      "text": "2. The ability to set up circuit-like LSPs for large bandwidth flows with low setup delays provides an alternative to packet-based solutions implemented over static circuits that may require tying up more expensive and power-consuming resources (e.g., router ports). Reducing the LSP setup delay will reduce the minimum bandwidth threshold at which a GMPLS circuit approach is preferred over a layer 3 (e.g., IP) approach. Dynamic circuit and virtual circuit switching intrinsically provide guaranteed bandwidth, guaranteed low-latency and jitter, and faster restoration, all of which are very hard to provide in packet-only networks. Again, a key element in achieving these benefits is enabling the fastest possible circuit setup times.",
      "zh-CHS": "2. 为具有低设置延迟的大带宽流设置类似LSP的电路的能力，提供了在静态电路上实现的基于分组的解决方案的替代方案，该解决方案可能需要占用更昂贵和耗电的资源（例如，路由器端口）。减少LSP设置延迟将降低GMPLS电路方法优于第3层（例如IP）方法的最小带宽阈值。动态电路和虚拟电路交换本质上提供了有保证的带宽、有保证的低延迟和抖动以及更快的恢复，所有这些在仅分组网络中都很难提供。同样，实现这些优势的一个关键因素是实现尽可能快的电路设置时间。"
    },
    {
      "indent": 3,
      "text": "Future applications are expected to require setup times that are as fast as 100 ms in highly dynamic, national-scale network environments while meeting stringent blocking requirements and minimizing the use of resources such as switch ports, wavelength converters/ regenerators, and other network design parameters. Of course, the benefits of low setup delay diminish for connections with long holding times. For some specific applications, a trade-off may be required, as the need for rapid setup may be more important than their requirements for other features currently provided in GMPLS (e.g., robustness against setup errors).",
      "zh-CHS": "未来的应用预计将要求在高度动态的国家级网络环境中设置时间最快为100 ms，同时满足严格的阻塞要求，并最大限度地减少资源的使用，如交换机端口、波长转换器/再生器和其他网络设计参数。当然，对于保持时间较长的连接，低设置延迟的好处会减少。对于某些特定应用，可能需要权衡，因为快速设置的需要可能比GMPLS中当前提供的其他功能的要求更重要（例如，对设置错误的鲁棒性）。"
    },
    {
      "indent": 3,
      "text": "With the advent of data centers, cloud computing, video, gaming, mobile and other broadband applications, it is anticipated that connection request rates may increase, even for connections with longer holding times, either during limited time periods (such as during the restoration from a data center failure) or over the longer term, to the point where the current GMPLS procedures of path computation/selection and resource allocation may not be timely, thus leading to increased blocking or increased resource cost. Thus, extensions of GMPLS signaling and routing protocols (e.g., OSPF-TE) may also be needed to address heavy churn of connection requests (i.e., high-connection-request arrival rate) in networks with high-traffic loads, even for connections with relatively longer holding times.",
      "zh-CHS": "随着数据中心、云计算、视频、游戏、移动和其他宽带应用的出现，预计连接请求速率可能会增加，即使是在有限的时间段内（如从数据中心故障恢复期间）或更长的时间内，连接保持时间较长的连接，连接请求速率也可能会增加，目前的GMPLS路径计算/选择和资源分配程序可能不及时，从而导致阻塞增加或资源成本增加。因此，可能还需要GMPLS信令和路由协议（例如，OSPF-TE）的扩展来解决具有高流量负载的网络中连接请求的大量搅动（即，高连接请求到达率），即使对于具有相对较长保持时间的连接也是如此。"
    },
    {
      "indent": 0,
      "text": "4. Driving Applications and Their Requirements",
      "section_title": true,
      "zh-CHS": "4. 驾驶应用及其要求"
    },
    {
      "indent": 3,
      "text": "There are several emerging applications that fall under the problem space addressed here in several service areas such as provided by telecommunication carriers, government networks, enterprise networks, content providers, and cloud providers. Such applications include research and education networks / grid computing, and cloud computing. Detailing and standardizing protocols to address these applications will expedite the transition to commercial deployment.",
      "zh-CHS": "在一些服务领域，如电信运营商、政府网络、企业网络、内容提供商和云提供商提供的服务领域，有一些新兴应用程序属于本文所述的问题空间。这些应用包括研究和教育网络/网格计算和云计算。详细说明和标准化解决这些应用程序的协议将加快向商业部署的过渡。"
    },
    {
      "indent": 3,
      "text": "In the target environment, there are multiple Bandwidth-on-Demand service requests per second, such as might arise as cloud services proliferate. It includes dynamic services with connection setup requirements that range from seconds to milliseconds. The aggregate traffic demand, which is composed of both packet (IP) and circuit (wavelength and sub-wavelength) services, represents a five to twenty-fold increase over today's traffic levels for the largest of any individual carrier. Thus, the aggressive requirements must be met with solutions that are scalable, cost effective, and power efficient, while providing the desired quality of service (QoS).",
      "zh-CHS": "在目标环境中，每秒有多个按需带宽服务请求，例如，随着云服务的激增，可能会出现这种情况。它包括动态服务，连接设置要求从秒到毫秒不等。由分组（IP）和电路（波长和亚波长）服务组成的总流量需求，代表着最大的单个运营商的流量水平比今天增加了五到二十倍。因此，在提供所需的服务质量（QoS）的同时，必须通过可扩展、经济高效和节能的解决方案来满足激进的需求。"
    },
    {
      "indent": 0,
      "text": "4.1. Key Application Requirements",
      "section_title": true,
      "zh-CHS": "4.1. 关键应用要求"
    },
    {
      "indent": 3,
      "text": "There are two key performance-scaling requirements in the target environment that are the main drivers behind this document:",
      "zh-CHS": "目标环境中的两个关键性能扩展要求是本文档背后的主要驱动因素："
    },
    {
      "indent": 3,
      "text": "1. Connection request rates ranging from a few requests per second for high-capacity (e.g., 40 Gb/s, 100 Gb/s) wavelength-based LSPs to around 100 requests per second for sub-wavelength LSPs (e.g., OTN ODU0, ODU1, and ODU2).",
      "zh-CHS": "1. 连接请求速率范围从高容量（例如，40 Gb/s、100 Gb/s）基于波长的LSP每秒几次请求到亚波长LSP（例如，OTN ODU0、ODU1和ODU2）每秒大约100次请求。"
    },
    {
      "indent": 3,
      "text": "2. Connection setup delay of around 100 ms across a national or regional network. To meet this target, assuming pipelined cross-connection and worst-case propagation delay and hop count, it is",
      "zh-CHS": "2. 全国或地区网络的连接设置延迟约为100 ms。为了达到这个目标，假设管道交叉连接和最坏情况下的传播延迟和跳数，它是"
    },
    {
      "indent": 7,
      "text": "estimated that the maximum processing delay per hop is around 700 microseconds [Lehmen]. Optimal path selection and resource allocation may require somewhat longer processing (up to 5 milliseconds) in either the destination or source nodes and possibly tighter processing delays (around 500 microseconds) in intermediate nodes.",
      "zh-CHS": "估计每跳的最大处理延迟约为700微秒[Lehmen]。最佳路径选择和资源分配可能需要在目标节点或源节点中进行更长的处理（最多5毫秒），在中间节点中可能需要更严格的处理延迟（大约500微秒）。"
    },
    {
      "indent": 3,
      "text": "The model for a national network is that of the continental US with up to 100 nodes and LSPs with distances up to ~3000 km and up to 15 hops.",
      "zh-CHS": "国家网络的模型是美国大陆的模型，最多有100个节点，LSP的距离最长约3000公里，最多有15跳。"
    },
    {
      "indent": 3,
      "text": "A connection setup delay is defined here as the time between the arrival of a connection request at an ingress edge switch -- or more generally a Label Switch Router (LSR) -- and the time at which information can start flowing from that ingress switch over that connection. Note that this definition is more inclusive than the LSP setup time defined in [RFC5814] and [RFC6777], which do not include PCE path computation delays.",
      "zh-CHS": "连接设置延迟在这里被定义为连接请求到达入口边缘交换机（或者更一般地说是标签交换机路由器（LSR））与信息开始从该入口交换机通过该连接传输的时间之间的时间。请注意，此定义比[RFC5814]和[RFC6777]中定义的LSP设置时间更具包容性，后者不包括PCE路径计算延迟。"
    },
    {
      "indent": 0,
      "text": "5. Requirements for Very Fast Setup of GMPLS LSPs",
      "section_title": true,
      "zh-CHS": "5. GMPLS LSP的快速设置要求"
    },
    {
      "indent": 3,
      "text": "This section lists the protocol requirements for very fast setup of GMPLS LSPs in order to adequately support the service characteristics described in the previous sections. These requirements may be the basis for future documents, some of which may be simply informational, while others may describe specific GMPLS protocol extensions. While some of these requirements may have implications on implementations, the intent is for the requirements to apply to GMPLS protocols and their standardized mechanisms.",
      "zh-CHS": "本节列出了快速设置GMPLS LSP的协议要求，以充分支持前面章节中描述的服务特性。这些要求可能是未来文件的基础，其中一些可能只是信息性的，而另一些可能描述特定的GMPLS协议扩展。虽然其中一些要求可能对实现有影响，但其目的是将这些要求应用于GMPLS协议及其标准化机制。"
    },
    {
      "indent": 0,
      "text": "5.1. Protocol and Procedure Requirements",
      "section_title": true,
      "zh-CHS": "5.1. 协议和程序要求"
    },
    {
      "indent": 3,
      "text": "R1 The portion of the LSP establishment time related to protocol processing should scale linearly based on the number of traversed nodes.",
      "zh-CHS": "R1与协议处理相关的LSP建立时间部分应根据遍历节点的数量线性扩展。"
    },
    {
      "indent": 3,
      "text": "R2 End-to-end LSP data path availability should be bounded by the worst-case single-node data path establishment time. In other words, pipelined cross-connect processing as discussed in [RFC6383] should be enabled.",
      "zh-CHS": "R2端到端LSP数据路径可用性应受到最坏情况下单节点数据路径建立时间的限制。换句话说，应该启用[RFC6383]中讨论的流水线交叉连接处理。"
    },
    {
      "indent": 3,
      "text": "R3 LSP establishment time shall depend on the number of nodes supporting an LSP and link propagation delays and not on any off (control) path transactions, e.g., PCC-PCE and PCC-PCC communications at the time of connection setup, even when PCE-based approaches are used.",
      "zh-CHS": "R3 LSP建立时间应取决于支持LSP和链路传播延迟的节点数量，而不是连接建立时的任何非（控制）路径事务，例如PCC-PCE和PCC-PCC通信，即使使用基于PCE的方法。"
    },
    {
      "indent": 3,
      "text": "R4 LSP holding times as short as one second must be supported.",
      "zh-CHS": "必须支持短至1秒的R4 LSP保持时间。"
    },
    {
      "indent": 3,
      "text": "R5 The protocol aspects of LSP signaling must not preclude LSP request rates of tens per second.",
      "zh-CHS": "R5 LSP信令的协议方面不得排除每秒数十次的LSP请求速率。"
    },
    {
      "indent": 3,
      "text": "R6 The above requirements should be met even when there are failures in connection establishment, i.e., LSPs should be established faster than when crank-back is used.",
      "zh-CHS": "R6即使在建立连接时出现故障，也应满足上述要求，即LSP的建立速度应快于使用回拖时。"
    },
    {
      "indent": 3,
      "text": "R7 These requirements are applicable even when an LSP crosses one or more administrative domains/boundaries.",
      "zh-CHS": "R7即使LSP跨越一个或多个管理域/边界，这些要求也适用。"
    },
    {
      "indent": 3,
      "text": "R8 The above are additional requirements and do not replace existing requirements, e.g., alarm-free setup and teardown, recovery, or inter-domain confidentiality.",
      "zh-CHS": "R8以上是附加要求，不能取代现有要求，如无报警设置和拆卸、恢复或域间保密。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Being able to support very fast setup and a high-churn rate of GMPLS LSPs is not expected to adversely affect the underlying security issues associated with existing GMPLS signaling. If encryption that requires key exchange is intended to be used on the signaled LSPs, then this requirement needs to be included as a part of the protocol design process, as the usual extra round-trip time (RTT) for key exchange will have an effect on the setup and churn rate of the GMPLS LSPs. It is possible to amortize the costs of key exchange over multiple exchanges (if those occur between the same peers) so that some exchanges need not cost a full RTT and operate in so-called zero-RTT mode.",
      "zh-CHS": "能够支持GMPLS LSP的快速设置和高流失率预计不会对现有GMPLS信令相关的潜在安全问题产生不利影响。如果要在信号LSP上使用需要密钥交换的加密，则需要将此要求作为协议设计过程的一部分，因为密钥交换的通常额外往返时间（RTT）将对GMPLS LSP的设置和搅动率产生影响。可以将密钥交换的成本分摊到多个交换上（如果这些交换发生在相同的对等方之间），这样一些交换就不需要花费完整的RTT，而是以所谓的零RTT模式运行。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Ann Von Lehmen, Joe Gannett, Ron Skoog, and Haim Kobrinski of Applied Communication Sciences for their comments and assistance on this document. Lou Berger provided editorial comments on this document.",
      "zh-CHS": "作者感谢应用传播科学公司的安·冯·莱曼、乔·甘内特、罗恩·斯库格和海姆·科布林斯基对本文件的评论和帮助。Lou Berger对此文件提供了编辑意见。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, DOI 10.17487/RFC3471, January 2003, <http://www.rfc-editor.org/info/rfc3471>.",
      "zh-CHS": "[RFC3471]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令功能描述”，RFC 3471，DOI 10.17487/RFC3471，2003年1月<http://www.rfc-editor.org/info/rfc3471>."
    },
    {
      "indent": 3,
      "text": "[RFC3945] Mannie, E., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Architecture\", RFC 3945, DOI 10.17487/RFC3945, October 2004, <http://www.rfc-editor.org/info/rfc3945>.",
      "zh-CHS": "[RFC3945]Mannie，E.，Ed.“通用多协议标签交换（GMPLS）体系结构”，RFC 3945，DOI 10.17487/RFC3945，2004年10月<http://www.rfc-editor.org/info/rfc3945>."
    },
    {
      "indent": 3,
      "text": "[RFC4655] Farrel, A., Vasseur, J., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, DOI 10.17487/RFC4655, August 2006, <http://www.rfc-editor.org/info/rfc4655>.",
      "zh-CHS": "[RFC4655]Farrel，A.，Vasseur，J.，和J.Ash，“基于路径计算元素（PCE）的体系结构”，RFC 4655，DOI 10.17487/RFC4655，2006年8月<http://www.rfc-editor.org/info/rfc4655>."
    },
    {
      "indent": 3,
      "text": "[RFC5814] Sun, W., Ed. and G. Zhang, Ed., \"Label Switched Path (LSP) Dynamic Provisioning Performance Metrics in Generalized MPLS Networks\", RFC 5814, DOI 10.17487/RFC5814, March 2010, <http://www.rfc-editor.org/info/rfc5814>.",
      "zh-CHS": "[RFC5814]Sun，W.，Ed.和G.Zhang，Ed.，“通用MPLS网络中的标签交换路径（LSP）动态资源调配性能度量”，RFC 5814，DOI 10.17487/RFC5814，2010年3月<http://www.rfc-editor.org/info/rfc5814>."
    },
    {
      "indent": 3,
      "text": "[RFC6163] Lee, Y., Ed., Bernstein, G., Ed., and W. Imajuku, \"Framework for GMPLS and Path Computation Element (PCE) Control of Wavelength Switched Optical Networks (WSONs)\", RFC 6163, DOI 10.17487/RFC6163, April 2011, <http://www.rfc-editor.org/info/rfc6163>.",
      "zh-CHS": "[RFC6163]Lee，Y.，Ed.，Bernstein，G.，Ed.，和W.Imajuku，“波长交换光网络（WSON）的GMPLS和路径计算元件（PCE）控制框架”，RFC 6163，DOI 10.17487/RFC6163，2011年4月<http://www.rfc-editor.org/info/rfc6163>."
    },
    {
      "indent": 3,
      "text": "[RFC6383] Shiomoto, K. and A. Farrel, \"Advice on When It Is Safe to Start Sending Data on Label Switched Paths Established Using RSVP-TE\", RFC 6383, DOI 10.17487/RFC6383, September 2011, <http://www.rfc-editor.org/info/rfc6383>.",
      "zh-CHS": "[RFC6383]Shiomoto，K.和A.Farrel，“关于何时开始在使用RSVP-TE建立的标签交换路径上安全发送数据的建议”，RFC 6383，DOI 10.17487/RFC6383，2011年9月<http://www.rfc-editor.org/info/rfc6383>."
    },
    {
      "indent": 3,
      "text": "[RFC6777] Sun, W., Ed., Zhang, G., Ed., Gao, J., Xie, G., and R. Papneja, \"Label Switched Path (LSP) Data Path Delay Metrics in Generalized MPLS and MPLS Traffic Engineering (MPLS-TE) Networks\", RFC 6777, DOI 10.17487/RFC6777, November 2012, <http://www.rfc-editor.org/info/rfc6777>.",
      "zh-CHS": "[RFC6777]孙伟德、张国光、高强、谢国光和R.帕普尼亚，“广义MPLS和MPLS流量工程（MPLS-TE）网络中的标签交换路径（LSP）数据路径延迟度量”，RFC 6777，DOI 10.17487/RFC6777，2012年11月<http://www.rfc-editor.org/info/rfc6777>."
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[Chiu] Chiu, A., et al., \"Architectures and Protocols for Capacity Efficient, Highly Dynamic and Highly Resilient Core Networks\", Journal of Optical Communications and Networking vol. 4, No. 1, pp. 1-14, 2012, DOI 10.1364/JOCN.4.000001, <http://dx.doi.org/10.1364/JOCN.4.000001>.",
      "zh-CHS": "[Chiu]Chiu，A.，等人，“容量效率、高动态和高弹性核心网络的架构和协议”，《光通信和网络杂志》第4卷，第1期，第1-14页，2012年，DOI 10.1364/JOCN.4.00001<http://dx.doi.org/10.1364/JOCN.4.000001>."
    },
    {
      "indent": 3,
      "text": "[Lehmen] Von Lehmen, A., et al., \"CORONET: Testbeds, Demonstration, and Lessons Learned\", Journal of Optical Communications and Networking Vol. 7, Issue 3, pp. A447-A458, 2015, DOI 10.1364/JOCN.7.00A447, <http://dx.doi.org/10.1364/JOCN.7.00A447>.",
      "zh-CHS": "[Lehmen]Von Lehmen，A.等人，“CORONET：试验台、演示和经验教训”，《光通信和网络杂志》第7卷，第3期，A447-A458页，2015年，DOI 10.1364/JOCN.7.00A447<http://dx.doi.org/10.1364/JOCN.7.00A447>."
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Andrew G. Malis (editor) Huawei Technologies",
      "zh-CHS": "Andrew G.Malis（编辑）华为技术"
    },
    {
      "indent": 3,
      "text": "Email: agmalis@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Brian J. Wilson Applied Communication Sciences",
      "zh-CHS": "Brian J.Wilson应用传播科学"
    },
    {
      "indent": 3,
      "text": "Email: bwilson@appcomsci.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "George Clapp AT&T Labs Research",
      "zh-CHS": "乔治·克拉普AT&T实验室研究"
    },
    {
      "indent": 3,
      "text": "Email: clapp@research.att.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Vishnu Shukla Verizon Communications",
      "zh-CHS": "威瑞森通信公司"
    },
    {
      "indent": 3,
      "text": "Email: vishnu.shukla@verizon.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}