{
  "title": {
    "text": "RFC 7736: Content Delivery Network Interconnection (CDNI) Media Type Registration",
    "zh-CHS": "RFC 7736"
  },
  "number": 7736,
  "created_at": "2021-10-31 17:00:37.406988+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                             K. Ma\nRequest for Comments: 7736                                      Ericsson\nCategory: Informational                                    December 2015\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Content Delivery Network Interconnection (CDNI) Media Type Registration",
      "zh-CHS": "内容交付网络互连（CDNI）媒体类型注册"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines the standard media type used by the Content Delivery Network Interconnection (CDNI) protocol suite, including the registration procedure and recommended usage of the required payload-type parameter.",
      "zh-CHS": "本文档定义了内容交付网络互连（CDNI）协议套件使用的标准媒体类型，包括注册程序和所需有效负载类型参数的建议用法。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7736.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7736."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction and Scope  . . . . . . . . . . . . . . . . . . .   2\n2.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  CDNI Media Type . . . . . . . . . . . . . . . . . . . . .   3\n  2.2.  CDNI Payload-Types Parameters Registry  . . . . . . . . .   5\n3.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n4.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  4.1.  Normative References  . . . . . . . . . . . . . . . . . .   6\n  4.2.  Informative References  . . . . . . . . . . . . . . . . .   6\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .   7\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction and Scope",
      "section_title": true,
      "zh-CHS": "1. 导言和范围"
    },
    {
      "indent": 3,
      "text": "The Content Delivery Network Interconnection (CDNI) working group is developing a set of protocols to enable the interconnection of multiple content delivery networks (CDNs), as discussed in [RFC6770]. The CDNI protocol suite consists of multiple HTTP-based interfaces, many of which transfer various payloads encoded in JSON (JavaScript Object Notation) [RFC7159]. The main interfaces (i.e., CDNI Control interface, CDNI Footprint & Capabilities Advertisement interface, CDNI Request Routing Redirection interface, CDNI Metadata interface, and CDNI Logging interface) are described in [RFC7336]. It is desirable to be able to indicate the type of object carried in the HTTP entity-body without having to register separate media types for each CDNI object. To accomplish this aim, this document defines a single new media type for CDNI that includes a required payload-type parameter. A separate registry of CDNI payload-type parameters is also defined. CDNI protocol specifications may register interface-specific payload types, specifying the payload encoding and parsing semantics for that message (e.g., JSON serialization for a CDNI metadata object). The same payload-type parameter may also be used as references for other purposes (e.g., referencing CDNI metadata objects from CDNI capability advertisement objects).",
      "zh-CHS": "内容交付网络互连（CDNI）工作组正在开发一套协议，以实现多个内容交付网络（CDN）的互连，如[RFC6770]中所述。CDNI协议套件由多个基于HTTP的接口组成，其中许多接口传输以JSON（JavaScript对象表示法）编码的各种有效负载[RFC7159]。[RFC7336]中描述了主要接口（即CDNI控制接口、CDNI封装外形和功能广告接口、CDNI请求路由重定向接口、CDNI元数据接口和CDNI日志记录接口）。希望能够指示HTTP实体体中携带的对象的类型，而不必为每个CDNI对象注册单独的媒体类型。为了实现这一目标，本文档为CDNI定义了一个新的媒体类型，其中包括一个必需的有效负载类型参数。还定义了CDNI有效负载类型参数的单独注册表。CDNI协议规范可以注册特定于接口的有效负载类型，指定该消息的有效负载编码和解析语义（例如，CDNI元数据对象的JSON序列化）。相同的有效负载类型参数也可以用作其他用途的引用（例如，从CDNI功能广告对象引用CDNI元数据对象）。"
    },
    {
      "indent": 0,
      "text": "2. IANA Considerations",
      "section_title": true,
      "zh-CHS": "2. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This section contains the CDNI media type registration as well as the payload-type parameter registry definition for IANA.",
      "zh-CHS": "本节包含CDNI媒体类型注册以及IANA的有效负载类型参数注册表定义。"
    },
    {
      "indent": 0,
      "text": "2.1. CDNI Media Type",
      "section_title": true,
      "zh-CHS": "2.1. CDNI介质类型"
    },
    {
      "indent": 3,
      "text": "Type name: application",
      "zh-CHS": "类型名称：应用程序"
    },
    {
      "indent": 3,
      "text": "Subtype name: cdni",
      "zh-CHS": "子类型名称：cdni"
    },
    {
      "indent": 3,
      "text": "Required parameters:",
      "zh-CHS": "所需参数："
    },
    {
      "indent": 6,
      "text": "ptype",
      "zh-CHS": "P型"
    },
    {
      "indent": 9,
      "text": "The required parameter \"ptype\" describes the type of CDNI message contained in the message payload, as registered in the \"Content Delivery Network Interconnection (CDNI) Parameters\" registry (Section 2.2) defined below.",
      "zh-CHS": "所需参数“ptype”描述了在下文定义的“内容交付网络互连（CDNI）参数”注册表（第2.2节）中注册的消息负载中包含的CDNI消息的类型。"
    },
    {
      "indent": 3,
      "text": "Optional parameters: none",
      "zh-CHS": "可选参数：无"
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "zh-CHS": "编码注意事项："
    },
    {
      "indent": 6,
      "text": "The CDNI protocol suite includes interfaces with encoded messages that may be 8bit or binary, as well as generic logging information that may be 7bit or binary.",
      "zh-CHS": "CDNI协议套件包括与编码消息（可能是8位或二进制）以及通用日志信息（可能是7位或二进制）的接口。"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "zh-CHS": "安全考虑："
    },
    {
      "indent": 6,
      "text": "CDNI interfaces that return encoded data may be (mis)interpreted if parsed by non-CDNI or non-compliant CDNI implementations. In addition, CDNI logging information is likely to transfer large amounts of data that may overload unexpecting clients. The individual CDNI interface specifications provide more detailed analysis of security and privacy concerns, and define the requirements for authentication, authorization, confidentiality, integrity, and privacy for each interface.",
      "zh-CHS": "如果由非CDNI或不兼容的CDNI实现进行解析，则返回编码数据的CDNI接口可能（错误）解释。此外，CDNI日志记录信息可能会传输大量数据，这可能会使未预料到的客户端过载。各个CDNI接口规范提供了更详细的安全和隐私问题分析，并定义了每个接口的身份验证、授权、机密性、完整性和隐私要求。"
    },
    {
      "indent": 6,
      "text": "The application/cdni media type is a generic media type to be used by multiple CDNI interfaces for transporting different types of control and logging information. Proper validation of message data requires parsing and understanding the ptype parameter and the associated data encoding. Failure to properly validate payloads may allow data extrusion under the auspices of the application/cdni media type.",
      "zh-CHS": "application/cdni媒体类型是多个cdni接口用于传输不同类型的控制和日志信息的通用媒体类型。正确验证消息数据需要解析和理解ptype参数以及相关的数据编码。未能正确验证有效负载可能会允许在应用程序/cdni媒体类型的支持下进行数据挤出。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "zh-CHS": "互操作性注意事项："
    },
    {
      "indent": 6,
      "text": "The required ptype field is intended to fully describe the structure and parsing of CDNI messages, as enforced by the ptype registry designated expert.",
      "zh-CHS": "所需的ptype字段旨在全面描述由ptype注册中心指定的专家强制执行的CDNI消息的结构和解析。"
    },
    {
      "indent": 3,
      "text": "Published specification: RFC 7736",
      "zh-CHS": "已发布规范：RFC 7736"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "zh-CHS": "使用此媒体类型的应用程序："
    },
    {
      "indent": 6,
      "text": "CDNI is intended for use between interconnected CDNs for sharing configuration and logging data, as well as for issuing content management and redirection requests.",
      "zh-CHS": "CDNI用于互连CDN之间共享配置和日志数据，以及发出内容管理和重定向请求。"
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations: N/A",
      "zh-CHS": "片段标识符注意事项：不适用"
    },
    {
      "indent": 3,
      "text": "Additional information: N/A",
      "zh-CHS": "其他信息：不适用"
    },
    {
      "indent": 6,
      "text": "Deprecated alias names for this type: N/A",
      "zh-CHS": "此类型的已弃用别名：不适用"
    },
    {
      "indent": 6,
      "text": "Magic number(s): N/A",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "File extension(s): N/A",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Macintosh file type code(s): N/A",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "zh-CHS": "联系人和电子邮件地址，以获取更多信息："
    },
    {
      "indent": 6,
      "text": "Kevin Ma <kevin.j.ma@ericsson.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Intended usage: LIMITED USE",
      "zh-CHS": "预期用途：有限用途"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage:",
      "zh-CHS": "使用限制："
    },
    {
      "indent": 6,
      "text": "This media type is intended only for use in CDNI protocol message exchanges.",
      "zh-CHS": "此媒体类型仅用于CDNI协议消息交换。"
    },
    {
      "indent": 3,
      "text": "Author: IETF CDNI working group",
      "zh-CHS": "作者：IETF CDNI工作组"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF CDNI working group",
      "zh-CHS": "变更控制员：IETF CDNI工作组"
    },
    {
      "indent": 3,
      "text": "Provisional registration: no",
      "zh-CHS": "临时注册：否"
    },
    {
      "indent": 0,
      "text": "2.2. CDNI Payload-Types Parameters Registry",
      "section_title": true,
      "zh-CHS": "2.2. CDNI有效负载类型参数注册表"
    },
    {
      "indent": 3,
      "text": "IANA has created a new \"CDNI Payload Types\" subregistry within the \"Content Delivery Network Interconnection (CDNI) Parameters\" registry. The \"CDNI Payload Types\" namespace defines the valid values for the required \"ptype\" parameter of the \"application/cdni\" media type. The CDNI payload type is an ASCII string value that consists of only visible (printing) characters but excludes equal signs (=), double quotes (\"), and semicolons (;). It will not exceed 256 characters in length. The following Augmented Backus-Naur Form (ABNF) definition of the CDNI payload type is provided for clarity [RFC5234]",
      "zh-CHS": "IANA在“内容交付网络互连（CDNI）参数”注册表中创建了一个新的“CDNI有效负载类型”子区。“CDNI有效负载类型”命名空间定义了“应用程序/CDNI”媒体类型所需的“ptype”参数的有效值。CDNI有效负载类型是一个ASCII字符串值，仅由可见（打印）字符组成，但不包括等号（=）、双引号（“）和分号（；）。其长度不会超过256个字符。为清晰起见，提供了以下CDNI有效负载类型的扩展巴科斯瑙格式（ABNF）定义[RFC5234]"
    },
    {
      "indent": 8,
      "text": "ptype = 1*256(ptype-char)\nptype-char = %x21 / %x23-3A / %x3C / %x3E-7E\n  ; Includes ALPHA, DIGIT, and other printables\n  ; Excludes equal signs (=), double quotes (\"), semicolons (;)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Additions to the \"CDNI Payload Types\" namespace will be made via \"Specification Required\" as defined in [RFC5226]. The designated expert will verify that new type definitions do not duplicate existing type definitions (in name or functionality), prevent gratuitous additions to the namespace, and prevent any additions to the namespace that would impair the interoperability of CDNI implementations. The designated expert will review the specification, even if it is a Standards Track RFC, to verify that it contains the following information:",
      "zh-CHS": "将通过[RFC5226]中定义的“所需规范”对“CDNI有效负载类型”命名空间进行添加。指定的专家将验证新的类型定义不会与现有类型定义（在名称或功能上）重复，防止对命名空间进行无端的添加，并防止对命名空间进行任何可能损害CDNI实现互操作性的添加。指定专家将审查规范，即使是标准跟踪RFC，以验证其是否包含以下信息："
    },
    {
      "indent": 3,
      "text": "o The review will verify that the specification contains a reasonably defined purpose for the new payload type. A reasonably defined purpose will relate to an existing or proposed CDNI interface and will not duplicate the functionality of any existing CDNI protocol feature without specifying a rational reason (e.g., updating an obsolete feature), a method for detecting and handling conflicts (e.g., a versioning system with prioritization matrix), and a suggested migration path (e.g., deprecation of the overlapped feature, or justification for co-existence).",
      "zh-CHS": "o 审查将验证规范是否包含新有效载荷类型的合理定义用途。合理定义的目的将与现有或拟议的CDNI接口相关，并且在未指定合理原因（例如，更新过时的功能）、检测和处理冲突的方法（例如，具有优先级矩阵的版本控制系统）的情况下，不会复制任何现有CDNI协议功能，以及建议的迁移路径（例如，对重叠特征的弃用，或共存的理由）。"
    },
    {
      "indent": 3,
      "text": "o The review will verify that the specification contains information as to which CDNI interface the new payload type pertains or affects. The payload type may be applicable to multiple CDNI interfaces, but the justification for the new payload type will include a reasonable relationship to at least one Standards Track CDNI interface.",
      "zh-CHS": "o 审查将验证规范是否包含关于新有效负载类型所属或影响的CDNI接口的信息。有效载荷类型可能适用于多个CDNI接口，但新有效载荷类型的理由将包括与至少一个标准轨道CDNI接口的合理关系。"
    },
    {
      "indent": 3,
      "text": "o The review will verify that the specification contains sufficient detail about the data encoding (e.g., JSON serialization for new CDNI metadata or capability advertisement objects, or ABNF and description for new CDNI logging file formats) to allow senders and receivers of the new payload type to implement compliant and interoperable payload parsers.",
      "zh-CHS": "o 审查将验证规范是否包含有关数据编码的足够详细信息（例如，新CDNI元数据或功能广告对象的JSON序列化，或新CDNI日志文件格式的ABNF和说明）允许新有效负载类型的发送方和接收方实现兼容且可互操作的有效负载解析器。"
    },
    {
      "indent": 3,
      "text": "The registry contains the payload type and the specification describing the payload type. The registry will initially be unpopulated.",
      "zh-CHS": "注册表包含有效负载类型和描述有效负载类型的规范。登记处最初将无人居住。"
    },
    {
      "indent": 21,
      "text": "+--------------+---------------+\n| Payload Type | Specification |\n+--------------+---------------+\n+--------------+---------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "See the portion of Section 2.1 labeled \"Security considerations\".",
      "zh-CHS": "见第2.1节“安全注意事项”部分。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "zh-CHS": "4. 工具书类"
    },
    {
      "indent": 0,
      "text": "4.1. Normative References",
      "section_title": true,
      "zh-CHS": "4.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，DOI 10.17487/RFC5226，2008年5月<http://www.rfc-editor.org/info/rfc5226>."
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <http://www.rfc-editor.org/info/rfc5234>.",
      "zh-CHS": "[RFC5234]Crocker，D.，Ed.和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，DOI 10.17487/RFC5234，2008年1月<http://www.rfc-editor.org/info/rfc5234>."
    },
    {
      "indent": 0,
      "text": "4.2. Informative References",
      "section_title": true,
      "zh-CHS": "4.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC6770] Bertrand, G., Ed., Stephan, E., Burbridge, T., Eardley, P., Ma, K., and G. Watson, \"Use Cases for Content Delivery Network Interconnection\", RFC 6770, DOI 10.17487/RFC6770, November 2012, <http://www.rfc-editor.org/info/rfc6770>.",
      "zh-CHS": "[RFC6770]Bertrand，G.，Ed.，Stephan，E.，Burbridge，T.，Eardley，P.，Ma，K.，和G.Watson，“内容交付网络互连的用例”，RFC 6770，DOI 10.17487/RFC6770，2012年11月<http://www.rfc-editor.org/info/rfc6770>."
    },
    {
      "indent": 3,
      "text": "[RFC7159] Bray, T., Ed., \"The JavaScript Object Notation (JSON) Data Interchange Format\", RFC 7159, DOI 10.17487/RFC7159, March 2014, <http://www.rfc-editor.org/info/rfc7159>.",
      "zh-CHS": "[RFC7159]Bray，T.，Ed.“JavaScript对象表示法（JSON）数据交换格式”，RFC 7159，DOI 10.17487/RFC7159，2014年3月<http://www.rfc-editor.org/info/rfc7159>."
    },
    {
      "indent": 3,
      "text": "[RFC7336] Peterson, L., Davie, B., and R. van Brandenburg, Ed., \"Framework for Content Distribution Network Interconnection (CDNI)\", RFC 7336, DOI 10.17487/RFC7336, August 2014, <http://www.rfc-editor.org/info/rfc7336>.",
      "zh-CHS": "[RFC7336]Peterson，L.，Davie，B.，和R.van Brandenburg，编辑，“内容分发网络互连框架（CDNI）”，RFC 7336，DOI 10.17487/RFC7336，2014年8月<http://www.rfc-editor.org/info/rfc7336>."
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "This document is the culmination of the efforts of many in the CDNI working group, including (in alphabetical order): Francois Le Faucheur, Daryl Malas, Rob Murray, Ben Niven-Jenkins, Iuniana Oprescu, Jon Peterson, and Jan Seedorf.",
      "zh-CHS": "本文件是CDNI工作组中许多人努力的成果，包括（按字母顺序排列）：弗朗索瓦·勒·福彻、达里尔·马拉斯、罗布·默里、本·尼文·詹金斯、尤尼娜·奥普雷斯库、乔恩·彼得森和扬·西多夫。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Kevin J. Ma Ericsson 43 Nagog Park Acton, MA 01720 United States",
      "zh-CHS": "凯文·J·马·爱立信43美国马萨诸塞州纳戈尔公园阿克顿01720"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978-844-5100\nEmail: kevin.j.ma@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}