{
  "title": {
    "text": "RFC 7983: Multiplexing Scheme Updates for Secure Real-time Transport Protocol (SRTP) Extension for Datagram Transport Layer Security (DTLS)",
    "zh-CHS": "RFC 7983"
  },
  "number": 7983,
  "created_at": "2021-11-01 12:26:44.801903+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                 M. Petit-Huguenin\nRequest for Comments: 7983                            Impedance Mismatch\nUpdates: 5764                                               G. Salgueiro\nCategory: Standards Track                                  Cisco Systems\nISSN: 2070-1721                                           September 2016",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": " Multiplexing Scheme Updates for Secure Real-time Transport Protocol (SRTP) Extension for Datagram Transport Layer Security (DTLS)",
      "zh-CHS": "数据报传输层安全（DTLS）安全实时传输协议（SRTP）扩展的多路复用方案更新"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines how Datagram Transport Layer Security (DTLS), Real-time Transport Protocol (RTP), RTP Control Protocol (RTCP), Session Traversal Utilities for NAT (STUN), Traversal Using Relays around NAT (TURN), and ZRTP packets are multiplexed on a single receiving socket. It overrides the guidance from RFC 5764 (\"SRTP Extension for DTLS\"), which suffered from four issues described and fixed in this document.",
      "zh-CHS": "本文档定义了数据报传输层安全性（DTLS）、实时传输协议（RTP）、RTP控制协议（RTCP）、NAT会话遍历实用程序（STUN）、NAT周围使用中继的遍历（TURN）和ZRTP数据包如何在单个接收套接字上多路复用。它覆盖了RFC 5764（“DTL的SRTP扩展”）的指南，该指南存在本文档中描述和修复的四个问题。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 5764.",
      "zh-CHS": "本文档更新了RFC 5764。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7983.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7983."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "zh-CHS": "本文件可能包含2008年11月10日之前发布或公开的IETF文件或IETF贡献中的材料。控制某些材料版权的人员可能未授予IETF信托允许在IETF标准流程之外修改此类材料的权利。在未从控制此类材料版权的人员处获得充分许可的情况下，不得在IETF标准流程之外修改本文件，也不得在IETF标准流程之外创建其衍生作品，除了将其格式化以RFC形式发布或将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   4\n3.  Implicit Allocation of Codepoints for New STUN Methods  . . .   4\n4.  Multiplexing of ZRTP  . . . . . . . . . . . . . . . . . . . .   5\n5.  Implicit Allocation of New Codepoints for TLS ContentTypes  .   5\n6.  Multiplexing of TURN Channels . . . . . . . . . . . . . . . .   7\n7.  Updates to RFC 5764 . . . . . . . . . . . . . . . . . . . . .   8\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .   9\n9.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  10\n  9.1.  STUN Methods  . . . . . . . . . . . . . . . . . . . . . .  10\n  9.2.  TLS ContentType . . . . . . . . . . . . . . . . . . . . .  10\n  9.3.  Traversal Using Relays around NAT (TURN) Channel Numbers   11\n10. References  . . . . . . . . . . . . . . . . . . . . . . . . .  11\n  10.1.  Normative References . . . . . . . . . . . . . . . . . .  11\n  10.2.  Informative References . . . . . . . . . . . . . . . . .  12\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  13\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Section 5.1.2 of \"Datagram Transport Layer Security (DTLS) Extension\nto Establish Keys for the Secure Real-time Transport Protocol (SRTP)\"\n[RFC5764] defines a scheme for a Real-time Transport Protocol (RTP)\n[RFC3550] receiver to demultiplex DTLS [RFC6347], Session Traversal\nUtilities for NAT (STUN) [RFC5389], and Secure Real-time Transport\nProtocol (SRTP) / Secure Real-time Transport Control Protocol (SRTCP)\n[RFC3711] packets that are arriving on the RTP port.  Unfortunately,\nthis demultiplexing scheme has created problematic issues:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "1. It implicitly allocated codepoints for new STUN methods without an IANA registry reflecting these new allocations.",
      "zh-CHS": "1. 它隐式地为新的STUN方法分配了代码点，而没有反映这些新分配的IANA注册表。"
    },
    {
      "indent": 3,
      "text": "2. It did not take into account the fact that ZRTP [RFC6189] also needs to be demultiplexed with the other packet types explicitly mentioned in Section 5.1.2 of RFC 5764.",
      "zh-CHS": "2. 它没有考虑到ZRTP[RFC6189]也需要与RFC 5764第5.1.2节中明确提到的其他数据包类型解复用的事实。"
    },
    {
      "indent": 3,
      "text": "3. It implicitly allocated codepoints for new Transport Layer Security (TLS) ContentTypes without an IANA registry reflecting these new allocations.",
      "zh-CHS": "3. 它隐式地为新的传输层安全性（TLS）内容类型分配了代码点，而没有反映这些新分配的IANA注册表。"
    },
    {
      "indent": 3,
      "text": "4. It did not take into account the fact that the Traversal Using Relays around NAT (TURN) usage of STUN can create TURN channels that also need to be demultiplexed with the other packet types explicitly mentioned in Section 5.1.2 of RFC 5764.",
      "zh-CHS": "4. 它没有考虑到这样一个事实，即在STUN的NAT（TURN）使用周围使用中继进行的遍历可以创建TURN信道，该信道也需要与RFC 5764第5.1.2节中明确提到的其他数据包类型进行解复用。"
    },
    {
      "indent": 3,
      "text": "Having overlapping ranges between different IANA registries becomes an issue when a new codepoint is allocated in one of these registries without carefully analyzing the impact it could have on the other registries when that codepoint is demultiplexed. Among other downsides of the bad design of the demultiplexing algorithm detailed in [RFC5764], it creates a requirement for coordination between codepoint assignments where none should exist, and that is organizationally and socially undesirable. However, RFC 5764 has been widely deployed, so there must be an awareness of this issue and how it must be dealt with. Thus, even if the feature related to a codepoint is not initially thought to be useful in the context of demultiplexing, the respective IANA registry expert should at least raise a flag when the allocated codepoint irrevocably prevents multiplexing.",
      "zh-CHS": "当在其中一个注册中心中分配新的代码点时，如果没有仔细分析该代码点解复用时对其他注册中心可能产生的影响，那么不同IANA注册中心之间的重叠范围就会成为一个问题。[RFC5764]中详细说明的解复用算法的糟糕设计的其他缺点之一是，它要求在不应该存在的代码点分配之间进行协调，这在组织上和社会上都是不可取的。然而，RFC 5764已经被广泛部署，因此必须意识到这个问题以及必须如何处理它。因此，即使与码点相关的特性最初被认为在解复用的上下文中不是有用的，当分配的码点不可撤销地阻止复用时，相应的IANA注册专家至少应该升起一个标志。"
    },
    {
      "indent": 3,
      "text": "The first goal of this document is to make sure that future allocations in any of the affected protocols are done with the full knowledge of their impact on multiplexing. This is achieved by updating [RFC5764], which includes modifying the IANA registries with instructions for coordination between the protocols at risk.",
      "zh-CHS": "本文档的第一个目标是确保在完全了解其对多路复用的影响的情况下，在任何受影响的协议中进行未来的分配。这是通过更新[RFC5764]来实现的，其中包括修改IANA注册中心，并提供风险协议之间的协调说明。"
    },
    {
      "indent": 3,
      "text": "A second goal is to permit the addition of new protocols to the list of existing multiplexed protocols in a manner that does not break existing implementations.",
      "zh-CHS": "第二个目标是允许以不破坏现有实现的方式将新协议添加到现有多路复用协议列表中。"
    },
    {
      "indent": 3,
      "text": "At the time of this writing, the flaws in the demultiplexing scheme were unavoidably inherited by other documents, such as [RFC7345] and [SDP-BUNDLE]. So in addition, these and any other affected documents will need to be corrected with the updates this document provides.",
      "zh-CHS": "在撰写本文时，解复用方案中的缺陷不可避免地被其他文档继承，如[RFC7345]和[SDP-BUNDLE]。因此，除此之外，这些和任何其他受影响的文档都需要使用本文档提供的更新进行更正。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Implicit Allocation of Codepoints for New STUN Methods",
      "section_title": true,
      "zh-CHS": "3. 新STUN方法的隐式码点分配"
    },
    {
      "indent": 3,
      "text": "The demultiplexing scheme in [RFC5764] states that the receiver can identify the packet type by looking at the first byte. If the value of this first byte is 0 or 1, the packet is identified to be STUN. The problem with this implicit allocation is that it restricts the codepoints for STUN methods (as described in Section 18.1 of [RFC5389]) to values between 0x000 and 0x07F, which in turn reduces the number of possible STUN method codepoints assigned by IETF Review (i.e., the range 0x000 - 0x7FF) from 2048 to only 128 and eliminates the possibility of having STUN method codepoints assigned by Designated Expert (i.e., the range 0x800 - 0xFFF).",
      "zh-CHS": "[RFC5764]中的解复用方案表明，接收器可以通过查看第一个字节来识别数据包类型。如果第一个字节的值为0或1，则该数据包被标识为STUN。这种隐式分配的问题在于，它将STUN方法的代码点（如[RFC5389]第18.1节所述）限制在0x000和0x07F之间的值，从而减少IETF评审分配的可能STUN方法代码点的数量（即0x000-0x7FF范围）从2048到仅128，消除了指定专家指定的眩晕方法代码点的可能性（即范围0x800-0xFFF）。"
    },
    {
      "indent": 3,
      "text": "To preserve the Designated Expert range, this document allocates the values 2 and 3 to also identify STUN methods.",
      "zh-CHS": "为了保留指定的专家范围，本文件分配值2和3，以确定STUN方法。"
    },
    {
      "indent": 3,
      "text": "The IANA Registry for STUN methods has been modified to mark the codepoints from 0x100 to 0xFFF as Reserved. These codepoints can still be allocated, but require IETF Review with a document that will properly evaluate the risk of an assignment overlapping with other registries.",
      "zh-CHS": "STUN方法的IANA注册表已修改为将0x100到0xFFF之间的代码点标记为保留。这些代码点仍然可以分配，但需要IETF审查文件，该文件将正确评估分配与其他注册中心重叠的风险。"
    },
    {
      "indent": 3,
      "text": "In addition, this document also updates the IANA registry such that the STUN method codepoints assigned in the 0x080-0x0FF range are also assigned via Designated Expert. The \"STUN Methods\" registry has been changed as follows:",
      "zh-CHS": "此外，本文件还更新了IANA注册表，以便在0x080-0x0FF范围内分配的STUN方法代码点也通过指定专家进行分配。“STUN方法”注册表已更改如下："
    },
    {
      "indent": 3,
      "text": "OLD:",
      "zh-CHS": "旧的："
    },
    {
      "indent": 3,
      "text": "0x000-0x7FF IETF Review 0x800-0xFFF Designated Expert",
      "zh-CHS": "0x000-0x7FF IETF评审0x800-0xFFF指定专家"
    },
    {
      "indent": 3,
      "text": "NEW:",
      "zh-CHS": "新的："
    },
    {
      "indent": 3,
      "text": "0x000-0x07F IETF Review 0x080-0x0FF Designated Expert 0x100-0xFFF Reserved",
      "zh-CHS": "0x000-0x07F IETF评审0x080-0x0FF指定专家0x100-0xFFF保留"
    },
    {
      "indent": 0,
      "text": "4. Multiplexing of ZRTP",
      "section_title": true,
      "zh-CHS": "4. ZRTP的多路复用"
    },
    {
      "indent": 3,
      "text": "ZRTP [RFC6189] is a protocol for media path Diffie-Hellman exchange to agree on a session key and parameters for establishing unicast SRTP sessions for Voice over IP (VoIP) applications. The ZRTP protocol is media path keying because it is multiplexed on the same port as RTP and does not require support in the signaling protocol.",
      "zh-CHS": "ZRTP[RFC6189]是一种用于媒体路径Diffie-Hellman exchange的协议，用于商定会话密钥和参数，以便为IP语音（VoIP）应用程序建立单播SRTP会话。ZRTP协议是媒体路径键控，因为它与RTP在同一端口上多路复用，不需要信令协议中的支持。"
    },
    {
      "indent": 3,
      "text": "In order to prevent future documents from assigning values from the unused range to a new protocol, this document modifies the [RFC5764] demultiplexing algorithm to properly account for ZRTP [RFC6189] by allocating the values from 16 to 19 for this purpose.",
      "zh-CHS": "为了防止将来的文档将未使用范围的值分配给新协议，本文档修改了[RFC5764]解复用算法，以便通过为此目的分配16到19的值来正确解释ZRTP[RFC6189]。"
    },
    {
      "indent": 0,
      "text": "5. Implicit Allocation of New Codepoints for TLS ContentTypes",
      "section_title": true,
      "zh-CHS": "5. 为TLS ContentType隐式分配新代码点"
    },
    {
      "indent": 3,
      "text": "The demultiplexing scheme in [RFC5764] dictates that if the value of the first byte is between 20 and 63 (inclusive), then the packet is identified to be DTLS. For DTLS 1.0 [RFC4347] and DTLS 1.2 [RFC6347], that first byte corresponds to the TLS ContentType field. Considerations must be taken into account when assigning additional ContentTypes in the codepoint ranges 0 to 19 and 64 to 255, so this does not prevent demultiplexing when this functionality is desirable. Note that [RFC5764] describes a narrow use of DTLS that works as long as the specific DTLS version used abides by the restrictions on the demultiplexing byte (the ones that this document imposes on the \"TLS ContentType Registry\"). Any extension or revision to DTLS that causes it to no longer meet these constraints should consider what values may occur in the first byte of the DTLS message and what impact it would have on the multiplexing that [RFC5764] describes.",
      "zh-CHS": "[RFC5764]中的解复用方案规定，如果第一个字节的值介于20和63之间（包括20和63），则该数据包被标识为DTL。对于DTLS 1.0[RFC4347]和DTLS 1.2[RFC6347]，第一个字节对应于TLS ContentType字段。在代码点范围0到19和64到255中分配其他ContentType时，必须考虑这些因素，因此当需要此功能时，这不会阻止解复用。请注意，[RFC5764]描述了DTL的狭义用法，只要所使用的特定DTL版本遵守对解复用字节的限制（本文档对“TLS ContentType注册表”施加的限制），DTL就可以正常工作。任何使DTL不再满足这些约束的扩展或修改应该考虑DTLS消息的第一字节中可能出现的值以及它对复用[RCFC5664 ]所产生的影响。"
    },
    {
      "indent": 3,
      "text": "With respect to TLS packet identification, this document explicitly adds a warning to the codepoints from 0 to 19 and from 64 to 255 indicating that allocations in these ranges require coordination, as described in this document. The \"TLS ContentType Registry\" has been changed as follows:",
      "zh-CHS": "关于TLS数据包标识，本文件明确向0到19和64到255的代码点添加警告，表明这些范围内的分配需要协调，如本文件所述。“TLS ContentType注册表”已更改如下："
    },
    {
      "indent": 3,
      "text": "OLD:",
      "zh-CHS": "旧的："
    },
    {
      "indent": 3,
      "text": "0-19 Unassigned 20 change_cipher_spec 21 alert 22 handshake 23 application_data 24 heartbeat 25-255 Unassigned",
      "zh-CHS": "0-19未分配20更改密码规格21警报22握手23应用程序数据24心跳25-255未分配"
    },
    {
      "indent": 3,
      "text": "NEW:",
      "zh-CHS": "新的："
    },
    {
      "indent": 3,
      "text": "0-19 Unassigned (Requires coordination; see RFC 7983) 20 change_cipher_spec 21 alert 22 handshake 23 application_data 24 heartbeat 25-63 Unassigned 64-255 Unassigned (Requires coordination; see RFC 7983)",
      "zh-CHS": "0-19未分配（需要协调；请参阅RFC 7983）20更改\\u密码\\u规范21警报22握手23应用程序\\u数据24心跳25-63未分配64-255未分配（需要协调；请参阅RFC 7983）"
    },
    {
      "indent": 0,
      "text": "6. Multiplexing of TURN Channels",
      "section_title": true,
      "zh-CHS": "6. 转向信道复用"
    },
    {
      "indent": 3,
      "text": "When used with Interactive Connectivity Establishment (ICE) [RFC5245], an implementation of RFC 5764 can receive packets on the same socket from three different paths, as shown in Figure 1:",
      "zh-CHS": "当与交互式连接建立（ICE）[RFC5245]一起使用时，RFC 5764的实现可以在同一套接字上从三条不同的路径接收数据包，如图1所示："
    },
    {
      "indent": 3,
      "text": "1. Directly from the source",
      "zh-CHS": "1. 直接从源头"
    },
    {
      "indent": 3,
      "text": "2. Through a NAT",
      "zh-CHS": "2. 通过NAT"
    },
    {
      "indent": 3,
      "text": "3. Relayed by a TURN server",
      "zh-CHS": "3. 由回合服务器转播"
    },
    {
      "indent": 3,
      "text": "    +------+\n    | TURN |<------------------------+\n    +------+                         |\n       |                             |\n       | +-------------------------+ |\n       | |                         | |\n       v v                         | |\nNAT -----------                    | |\n       | | +---------------------+ | |\n       | | |                     | | |\n       v v v                     | | |\n   +----------+              +----------+\n   | RFC 5764 |              | RFC 5764 |\n   +----------+              +----------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Figure 1: Packet Reception by an Implementation of RFC 5764",
      "zh-CHS": "图1:RFC 5764实现的数据包接收"
    },
    {
      "indent": 3,
      "text": "Even if the ICE algorithm succeeded in selecting a non-relayed path, it is still possible to receive data from the TURN server. For instance, when ICE is used with aggressive nomination, the media path can quickly change until it stabilizes. Also, freeing ICE candidates is optional, so the TURN server can restart forwarding STUN connectivity checks during an ICE restart.",
      "zh-CHS": "即使ICE算法成功地选择了非中继路径，仍然可以从TURN服务器接收数据。例如，当ICE与激进提名一起使用时，媒体路径可以快速改变，直到稳定。此外，释放ICE候选对象是可选的，因此TURN服务器可以在ICE重新启动期间重新启动转发STUN连接检查。"
    },
    {
      "indent": 3,
      "text": "TURN channels are an optimization where data packets are exchanged with a 4-byte prefix instead of the standard 36-byte STUN overhead (see Section 2.5 of [RFC5766]). The problem is that the RFC 5764 demultiplexing scheme does not define what to do with packets received over a TURN channel since these packets will start with a first byte whose value will be between 64 and 127 (inclusive). If the TURN server was instructed to send data over a TURN channel, then the demultiplexing scheme specified in RFC 5764 will reject these packets. Current implementations violate RFC 5764 for values 64 to 127 (inclusive) and they instead parse packets with such values as TURN.",
      "zh-CHS": "转弯通道是一种优化，其中数据包交换采用4字节前缀，而不是标准的36字节STUN开销（见[RFC5766]第2.5节）。问题在于，RFC 5764解复用方案没有定义如何处理通过翻转通道接收的数据包，因为这些数据包将以值介于64和127（包括）之间的第一个字节开始。如果指示TURN服务器通过TURN通道发送数据，则RFC 5764中指定的解复用方案将拒绝这些数据包。当前的实现违反了RFC 5764中的值64到127（包括64到127），而是使用诸如TURN之类的值解析数据包。"
    },
    {
      "indent": 3,
      "text": "In order to prevent future documents from assigning values from the unused range to a new protocol, this document modifies the demultiplexing algorithm in RFC 5764 to properly account for TURN channels by allocating the values from 64 to 79 for this purpose. This modification restricts the TURN channel space to a more limited set of possible channels when the TURN client does the channel binding request in combination with the demultiplexing scheme described in [RFC5764].",
      "zh-CHS": "为了防止将来的文档将未使用范围的值分配给新协议，本文档修改了RFC 5764中的解复用算法，以便通过为此目的分配从64到79的值来正确考虑转弯通道。当TURN客户端结合[RFC5764]中描述的解复用方案执行信道绑定请求时，此修改将TURN信道空间限制为一组更有限的可能信道。"
    },
    {
      "indent": 0,
      "text": "7. Updates to RFC 5764",
      "section_title": true,
      "zh-CHS": "7. RFC 5764的更新"
    },
    {
      "indent": 3,
      "text": "This document updates the text in Section 5.1.2 of [RFC5764] as follows:",
      "zh-CHS": "本文件将[RFC5764]第5.1.2节中的文本更新如下："
    },
    {
      "indent": 3,
      "text": "OLD TEXT",
      "zh-CHS": "旧文本"
    },
    {
      "indent": 3,
      "text": "The process for demultiplexing a packet is as follows. The receiver looks at the first byte of the packet. If the value of this byte is 0 or 1, then the packet is STUN. If the value is in between 128 and 191 (inclusive), then the packet is RTP (or RTCP, if both RTCP and RTP are being multiplexed over the same destination port). If the value is between 20 and 63 (inclusive), the packet is DTLS. This process is summarized in Figure 3.",
      "zh-CHS": "分组解复用的过程如下所示。接收器查看数据包的第一个字节。如果该字节的值为0或1，则该数据包为STUN。如果该值介于128和191之间（包括128和191），则数据包为RTP（或RTCP，如果RTCP和RTP都在同一目标端口上多路传输）。如果该值介于20和63之间（包括20和63），则数据包为DTLS。图3总结了该过程。"
    },
    {
      "indent": 8,
      "text": "            +----------------+\n            | 127 < B < 192 -+--> forward to RTP\n            |                |\npacket -->  |  19 < B < 64  -+--> forward to DTLS\n            |                |\n            |       B < 2   -+--> forward to STUN\n            +----------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Figure 3: The DTLS-SRTP receiver's packet demultiplexing algorithm. Here the field B denotes the leading byte of the packet.",
      "zh-CHS": "图3:DTLS-SRTP接收机的数据包解复用算法。这里，字段B表示数据包的前导字节。"
    },
    {
      "indent": 3,
      "text": "END OLD TEXT",
      "zh-CHS": "结束旧文本"
    },
    {
      "indent": 3,
      "text": "NEW TEXT",
      "zh-CHS": "新文本"
    },
    {
      "indent": 3,
      "text": "The process for demultiplexing a packet is as follows. The receiver looks at the first byte of the packet. If the value of this byte is in between 0 and 3 (inclusive), then the packet is STUN. If the value is between 16 and 19 (inclusive), then the packet is ZRTP. If the value is between 20 and 63 (inclusive), then the packet is DTLS. If the value is between 64 and 79 (inclusive), then the packet is TURN Channel. If the value is in between 128 and 191 (inclusive), then the packet is RTP (or RTCP, if both RTCP and RTP are being multiplexed over the same destination port). If the value does not match any known range, then the packet MUST be dropped and an alert MAY be logged. This process is summarized in Figure 3.",
      "zh-CHS": "分组解复用的过程如下所示。接收器查看数据包的第一个字节。如果该字节的值介于0和3之间（包括0和3），则该数据包为STUN。如果该值介于16和19之间（包括16和19），则该数据包为ZRTP。如果该值介于20和63之间（包括20和63），则该数据包为DTLS。如果该值介于64和79（包括64和79）之间，则该数据包为TURN Channel。如果该值介于128和191之间（包括128和191），则数据包为RTP（或RTCP，如果RTCP和RTP都在同一目标端口上多路传输）。如果该值与任何已知范围不匹配，则必须丢弃数据包并记录警报。图3总结了该过程。"
    },
    {
      "indent": 8,
      "text": "            +----------------+\n            |        [0..3] -+--> forward to STUN\n            |                |\n            |      [16..19] -+--> forward to ZRTP\n            |                |\npacket -->  |      [20..63] -+--> forward to DTLS\n            |                |\n            |      [64..79] -+--> forward to TURN Channel\n            |                |\n            |    [128..191] -+--> forward to RTP/RTCP\n            +----------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Figure 3: The DTLS-SRTP receiver's packet demultiplexing algorithm.",
      "zh-CHS": "图3:DTLS-SRTP接收机的数据包解复用算法。"
    },
    {
      "indent": 3,
      "text": "END NEW TEXT",
      "zh-CHS": "结束新文本"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document updates existing IANA registries and adds a new range for TURN channels in the demultiplexing algorithm.",
      "zh-CHS": "本文档更新了现有IANA注册表，并在解复用算法中添加了新的转弯通道范围。"
    },
    {
      "indent": 3,
      "text": "These modifications do not introduce any specific security considerations beyond those detailed in [RFC5764].",
      "zh-CHS": "除了[RFC5764]中详述的安全注意事项外，这些修改不会引入任何特定的安全注意事项。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "zh-CHS": "9. IANA考虑"
    },
    {
      "indent": 0,
      "text": "9.1. STUN Methods",
      "section_title": true,
      "zh-CHS": "9.1. 眩晕法"
    },
    {
      "indent": 3,
      "text": "This specification contains the registration information for reserved STUN Methods codepoints, as explained in Section 3 and in accordance with the procedures defined in Section 18.1 of [RFC5389].",
      "zh-CHS": "本规范包含保留STU方法代码点的注册信息，如第3节所述，并符合[RFC5389]第18.1节规定的程序。"
    },
    {
      "indent": 3,
      "text": "Value: 0x100-0xFFF",
      "zh-CHS": "值：0x100-0xFFF"
    },
    {
      "indent": 3,
      "text": "Name: Reserved (For DTLS-SRTP multiplexing collision avoidance, see RFC 7983. Cannot be made available for assignment without IETF Review.)",
      "zh-CHS": "名称：保留（对于DTLS-SRTP多路复用冲突避免，请参阅RFC 7983。未经IETF审查，无法用于分配。）"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 5764, RFC 7983",
      "zh-CHS": "参考：RFC 5764，RFC 7983"
    },
    {
      "indent": 3,
      "text": "This specification also reassigns the ranges in the STUN Methods Registry as follows:",
      "zh-CHS": "本规范还重新分配STUN方法注册表中的范围，如下所示："
    },
    {
      "indent": 3,
      "text": "Range: 0x000-0x07F",
      "zh-CHS": "范围：0x000-0x07F"
    },
    {
      "indent": 3,
      "text": "Registration Procedures: IETF Review",
      "zh-CHS": "注册程序：IETF审查"
    },
    {
      "indent": 3,
      "text": "Range: 0x080-0x0FF",
      "zh-CHS": "范围：0x080-0x0FF"
    },
    {
      "indent": 3,
      "text": "Registration Procedures: Designated Expert",
      "zh-CHS": "登记程序：指定专家"
    },
    {
      "indent": 0,
      "text": "9.2. TLS ContentType",
      "section_title": true,
      "zh-CHS": "9.2. TLS内容类型"
    },
    {
      "indent": 3,
      "text": "This specification contains the registration information for reserved TLS ContentType codepoints, as explained in Section 5 and in accordance with the procedures defined in Section 12 of [RFC5246].",
      "zh-CHS": "本规范包含保留TLS ContentType代码点的注册信息，如第5节所述，并符合[RFC5246]第12节规定的程序。"
    },
    {
      "indent": 3,
      "text": "Value: 0-19",
      "zh-CHS": "数值：0-19"
    },
    {
      "indent": 3,
      "text": "Description: Unassigned (Requires coordination; see RFC 7983)",
      "zh-CHS": "说明：未分配（需要协调；参见RFC 7983）"
    },
    {
      "indent": 3,
      "text": "DTLS-OK: N/A",
      "zh-CHS": "DTLS-OK：不适用"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 5764, RFC 7983",
      "zh-CHS": "参考：RFC 5764，RFC 7983"
    },
    {
      "indent": 3,
      "text": "Value: 64-255",
      "zh-CHS": "数值：64-255"
    },
    {
      "indent": 3,
      "text": "Description: Unassigned (Requires coordination; see RFC 7983)",
      "zh-CHS": "说明：未分配（需要协调；参见RFC 7983）"
    },
    {
      "indent": 3,
      "text": "DTLS-OK: N/A",
      "zh-CHS": "DTLS-OK：不适用"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 5764, RFC 7983",
      "zh-CHS": "参考：RFC 5764，RFC 7983"
    },
    {
      "indent": 0,
      "text": "9.3. Traversal Using Relays around NAT (TURN) Channel Numbers",
      "section_title": true,
      "zh-CHS": "9.3. 使用NAT（转弯）通道号周围的中继进行遍历"
    },
    {
      "indent": 3,
      "text": "This specification contains the registration information for reserved codepoints in the \"Traversal Using Relays around NAT (TURN) Channel Numbers\" registry, as explained in Section 6 and in accordance with the procedures defined in Section 18 of [RFC5766].",
      "zh-CHS": "本规范包含“使用NAT（转弯）通道号周围的中继进行遍历”注册表中保留码点的注册信息，如第6节所述，并符合[RFC5766]第18节中定义的程序。"
    },
    {
      "indent": 3,
      "text": "Value: 0x5000-0xFFFF",
      "zh-CHS": "值：0x5000-0xFFFF"
    },
    {
      "indent": 3,
      "text": "Name: Reserved (For DTLS-SRTP multiplexing collision avoidance, see RFC 7983.)",
      "zh-CHS": "名称：保留（对于DTLS-SRTP多路复用冲突避免，请参阅RFC 7983。）"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 7983",
      "zh-CHS": "参考：RFC 7983"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, DOI 10.17487/RFC3550, July 2003, <http://www.rfc-editor.org/info/rfc3550>.",
      "zh-CHS": "[RFC3550]Schulzrinne，H.，Casner，S.，Frederick，R.，和V.Jacobson，“RTP：实时应用的传输协议”，STD 64，RFC 3550，DOI 10.17487/RFC3550，2003年7月<http://www.rfc-editor.org/info/rfc3550>."
    },
    {
      "indent": 3,
      "text": "[RFC3711] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, DOI 10.17487/RFC3711, March 2004, <http://www.rfc-editor.org/info/rfc3711>.",
      "zh-CHS": "[RFC3711]Baugher，M.，McGrew，D.，Naslund，M.，Carrara，E.，和K.Norrman，“安全实时传输协议（SRTP）”，RFC 3711，DOI 10.17487/RFC3711，2004年3月<http://www.rfc-editor.org/info/rfc3711>."
    },
    {
      "indent": 3,
      "text": "[RFC5245] Rosenberg, J., \"Interactive Connectivity Establishment (ICE): A Protocol for Network Address Translator (NAT) Traversal for Offer/Answer Protocols\", RFC 5245, DOI 10.17487/RFC5245, April 2010, <http://www.rfc-editor.org/info/rfc5245>.",
      "zh-CHS": "[RFC5245]Rosenberg，J.，“交互式连接建立（ICE）：提供/应答协议的网络地址转换器（NAT）遍历协议”，RFC 5245，DOI 10.17487/RFC5245，2010年4月<http://www.rfc-editor.org/info/rfc5245>."
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, DOI 10.17487/RFC5246, August 2008, <http://www.rfc-editor.org/info/rfc5246>.",
      "zh-CHS": "[RFC5246]Dierks，T.和E.Rescorla，“传输层安全（TLS）协议版本1.2”，RFC 5246，DOI 10.17487/RFC5246，2008年8月<http://www.rfc-editor.org/info/rfc5246>."
    },
    {
      "indent": 3,
      "text": "[RFC5389] Rosenberg, J., Mahy, R., Matthews, P., and D. Wing, \"Session Traversal Utilities for NAT (STUN)\", RFC 5389, DOI 10.17487/RFC5389, October 2008, <http://www.rfc-editor.org/info/rfc5389>.",
      "zh-CHS": "[RFC5389]Rosenberg，J.，Mahy，R.，Matthews，P.，和D.Wing，“NAT（STUN）的会话遍历实用程序”，RFC 5389，DOI 10.17487/RFC5389，2008年10月<http://www.rfc-editor.org/info/rfc5389>."
    },
    {
      "indent": 3,
      "text": "[RFC5764] McGrew, D. and E. Rescorla, \"Datagram Transport Layer Security (DTLS) Extension to Establish Keys for the Secure Real-time Transport Protocol (SRTP)\", RFC 5764, DOI 10.17487/RFC5764, May 2010, <http://www.rfc-editor.org/info/rfc5764>.",
      "zh-CHS": "[RFC5764]McGrew，D.和E.Rescorla，“为安全实时传输协议（SRTP）建立密钥的数据报传输层安全（DTLS）扩展”，RFC 5764，DOI 10.17487/RFC5764，2010年5月<http://www.rfc-editor.org/info/rfc5764>."
    },
    {
      "indent": 3,
      "text": "[RFC5766] Mahy, R., Matthews, P., and J. Rosenberg, \"Traversal Using Relays around NAT (TURN): Relay Extensions to Session Traversal Utilities for NAT (STUN)\", RFC 5766, DOI 10.17487/RFC5766, April 2010, <http://www.rfc-editor.org/info/rfc5766>.",
      "zh-CHS": "[RFC5766]Mahy，R.，Matthews，P.，和J.Rosenberg，“使用NAT周围的中继进行遍历（TURN）：NAT（STUN）会话遍历实用程序的中继扩展”，RFC 5766，DOI 10.17487/RFC5766，2010年4月<http://www.rfc-editor.org/info/rfc5766>."
    },
    {
      "indent": 3,
      "text": "[RFC6347] Rescorla, E. and N. Modadugu, \"Datagram Transport Layer Security Version 1.2\", RFC 6347, DOI 10.17487/RFC6347, January 2012, <http://www.rfc-editor.org/info/rfc6347>.",
      "zh-CHS": "[RFC6347]Rescorla，E.和N.Modadugu，“数据报传输层安全版本1.2”，RFC 6347，DOI 10.17487/RFC6347，2012年1月<http://www.rfc-editor.org/info/rfc6347>."
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC4347] Rescorla, E. and N. Modadugu, \"Datagram Transport Layer Security\", RFC 4347, DOI 10.17487/RFC4347, April 2006, <http://www.rfc-editor.org/info/rfc4347>.",
      "zh-CHS": "[RFC4347]Rescorla，E.和N.Modadugu，“数据报传输层安全”，RFC 4347，DOI 10.17487/RFC4347，2006年4月<http://www.rfc-editor.org/info/rfc4347>."
    },
    {
      "indent": 3,
      "text": "[RFC6189] Zimmermann, P., Johnston, A., Ed., and J. Callas, \"ZRTP: Media Path Key Agreement for Unicast Secure RTP\", RFC 6189, DOI 10.17487/RFC6189, April 2011, <http://www.rfc-editor.org/info/rfc6189>.",
      "zh-CHS": "[RFC6189]Zimmermann，P.，Johnston，A.，Ed.，和J.Callas，“ZRTP：单播安全RTP的媒体路径密钥协议”，RFC 6189，DOI 10.17487/RFC6189，2011年4月<http://www.rfc-editor.org/info/rfc6189>."
    },
    {
      "indent": 3,
      "text": "[RFC7345] Holmberg, C., Sedlacek, I., and G. Salgueiro, \"UDP Transport Layer (UDPTL) over Datagram Transport Layer Security (DTLS)\", RFC 7345, DOI 10.17487/RFC7345, August 2014, <http://www.rfc-editor.org/info/rfc7345>.",
      "zh-CHS": "[RFC7345]Holmberg，C.，Sedlacek，I.，和G.Salgueiro，“数据报传输层安全（DTLS）上的UDP传输层（UDPTL）”，RFC 7345，DOI 10.17487/RFC73452014年8月<http://www.rfc-editor.org/info/rfc7345>."
    },
    {
      "indent": 3,
      "text": "[SDP-BUNDLE] Holmberg, C., Alvestrand, H., and C. Jennings, \"Negotiating Media Multiplexing Using the Session Description Protocol (SDP)\", Work in Progress, draft-ietf-mmusic-sdp-bundle-negotiation-32, August 2016.",
      "zh-CHS": "[SDP-BUNDLE]Holmberg，C.，Alvestrand，H.，和C.Jennings，“使用会话描述协议（SDP）协商媒体多路复用”，正在进行的工作，草稿-ietf-mmusic-SDP-BUNDLE-negotiation-32，2016年8月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The implicit STUN Method codepoint allocations problem was first reported by Martin Thomson in the RTCWEB mailing list and discussed further with Magnus Westerlund.",
      "zh-CHS": "Martin Thomson在RTCWEB邮件列表中首次报告了隐式STU方法码点分配问题，并与Magnus Westerlund进行了进一步讨论。"
    },
    {
      "indent": 3,
      "text": "Thanks to Simon Perreault, Colton Shields, Cullen Jennings, Colin Perkins, Magnus Westerlund, Paul Jones, Jonathan Lennox, Varun Singh, Justin Uberti, Joseph Salowey, Martin Thomson, Ben Campbell, Stephen Farrell, Alan Johnston, Mehmet Ersue, Matt Miller, Spencer Dawkins, Joel Halpern, and Paul Kyzivat for the comments, suggestions, and questions that helped improve this document.",
      "zh-CHS": "感谢Simon Perreault、Colton Shields、Cullen Jennings、Colin Perkins、Magnus Westerlund、Paul Jones、Jonathan Lennox、Varun Singh、Justin Uberti、Joseph Salowey、Martin Thomson、Ben Campbell、Stephen Farrell、Alan Johnston、Mehmet Ersue、Matt Miller、Spencer Dawkins、Joel Halpern和Paul Kyzivat的评论和建议，以及有助于改进本文件的问题。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Marc Petit-Huguenin Impedance Mismatch",
      "zh-CHS": "Marc Petit Huguenin阻抗失配"
    },
    {
      "indent": 3,
      "text": "Email: marc@petit-huguenin.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Gonzalo Salgueiro Cisco Systems 7200-12 Kit Creek Road Research Triangle Park, NC 27709 United States of America",
      "zh-CHS": "Gonzalo Salgueiro Cisco Systems 7200-12美国北卡罗来纳州Kit Creek Road研究三角公园27709"
    },
    {
      "indent": 3,
      "text": "Email: gsalguei@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}