{
  "title": {
    "text": "RFC 7667: RTP Topologies",
    "zh-CHS": "RFC 7667"
  },
  "number": 7667,
  "created_at": "2021-10-31 12:39:27.630672+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     M. Westerlund\nRequest for Comments: 7667                                      Ericsson\nObsoletes: 5117                                                S. Wenger\nCategory: Informational                                            Vidyo\nISSN: 2070-1721                                            November 2015",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 29,
      "text": "RTP Topologies",
      "zh-CHS": "RTP拓扑"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document discusses point-to-point and multi-endpoint topologies used in environments based on the Real-time Transport Protocol (RTP). In particular, centralized topologies commonly employed in the video conferencing industry are mapped to the RTP terminology.",
      "zh-CHS": "本文档讨论基于实时传输协议（RTP）的环境中使用的点对点和多端点拓扑。特别是，视频会议行业中常用的集中式拓扑映射到RTP术语。"
    },
    {
      "indent": 3,
      "text": "This document is updated with additional topologies and replaces RFC 5117.",
      "zh-CHS": "本文档使用其他拓扑进行更新，并取代RFC 5117。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7667.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7667."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   4\n2.  Definitions . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  2.1.  Glossary  . . . . . . . . . . . . . . . . . . . . . . . .   5\n  2.2.  Definitions Related to RTP Grouping Taxonomy  . . . . . .   5\n3.  Topologies  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  3.1.  Point to Point  . . . . . . . . . . . . . . . . . . . . .   6\n  3.2.  Point to Point via Middlebox  . . . . . . . . . . . . . .   7\n    3.2.1.  Translators . . . . . . . . . . . . . . . . . . . . .   7\n    3.2.2.  Back-to-Back RTP sessions . . . . . . . . . . . . . .  11\n  3.3.  Point to Multipoint Using Multicast . . . . . . . . . . .  12\n    3.3.1.  Any-Source Multicast (ASM)  . . . . . . . . . . . . .  12\n    3.3.2.  Source-Specific Multicast (SSM) . . . . . . . . . . .  14\n    3.3.3.  SSM with Local Unicast Resources  . . . . . . . . . .  15\n  3.4.  Point to Multipoint Using Mesh  . . . . . . . . . . . . .  17\n  3.5.  Point to Multipoint Using the RFC 3550 Translator . . . .  20\n    3.5.1.  Relay - Transport Translator  . . . . . . . . . . . .  20\n    3.5.2.  Media Translator  . . . . . . . . . . . . . . . . . .  21\n  3.6.  Point to Multipoint Using the RFC 3550 Mixer Model  . . .  22\n    3.6.1.  Media-Mixing Mixer  . . . . . . . . . . . . . . . . .  24\n    3.6.2.  Media-Switching Mixer . . . . . . . . . . . . . . . .  27\n  3.7.  Selective Forwarding Middlebox  . . . . . . . . . . . . .  29\n  3.8.  Point to Multipoint Using Video-Switching MCUs  . . . . .  33\n  3.9.  Point to Multipoint Using RTCP-Terminating MCU  . . . . .  34\n  3.10. Split Component Terminal  . . . . . . . . . . . . . . . .  35\n  3.11. Non-symmetric Mixer/Translators . . . . . . . . . . . . .  38\n  3.12. Combining Topologies  . . . . . . . . . . . . . . . . . .  38\n4.  Topology Properties . . . . . . . . . . . . . . . . . . . . .  39\n  4.1.  All-to-All Media Transmission . . . . . . . . . . . . . .  39\n  4.2.  Transport or Media Interoperability . . . . . . . . . . .  40\n  4.3.  Per-Domain Bitrate Adaptation . . . . . . . . . . . . . .  40\n  4.4.  Aggregation of Media  . . . . . . . . . . . . . . . . . .  41\n  4.5.  View of All Session Participants  . . . . . . . . . . . .  41\n  4.6.  Loop Detection  . . . . . . . . . . . . . . . . . . . . .  42\n  4.7.  Consistency between Header Extensions and RTCP  . . . . .  42\n5.  Comparison of Topologies  . . . . . . . . . . . . . . . . . .  42\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .  43\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  45\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  45\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  45\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  48\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  48",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Real-time Transport Protocol (RTP) [RFC3550] topologies describe methods for interconnecting RTP entities and their processing behavior for RTP and the RTP Control Protocol (RTCP). This document tries to address past and existing confusion, especially with respect to terms not defined in RTP but in common use in the communication industry, such as the Multipoint Control Unit or MCU.",
      "zh-CHS": "实时传输协议（RTP）[RFC3550]拓扑描述了互连RTP实体的方法以及RTP和RTP控制协议（RTCP）的处理行为。本文件试图解决过去和现有的混淆，特别是关于RTP中未定义但在通信行业中常用的术语，如多点控制单元或MCU。"
    },
    {
      "indent": 3,
      "text": "When the Audio-Visual Profile with Feedback (AVPF) [RFC4585] was developed, the main emphasis lay in the efficient support of point-to-point and small multipoint scenarios without centralized multipoint control. In practice, however, most multipoint conferences operate utilizing centralized units referred to as MCUs. MCUs may implement mixer or translator functionality (in RTP [RFC3550] terminology) and signaling support. They may also contain additional application-layer functionality. This document focuses on the media transport aspects of the MCU that can be realized using RTP, as discussed below. Further considered are the properties of mixers and translators, and how some types of deployed MCUs deviate from these properties.",
      "zh-CHS": "当开发带反馈的视听配置文件（AVPF）[RFC4585]时，主要重点在于在没有集中多点控制的情况下有效支持点对点和小型多点场景。然而，在实践中，大多数多点会议使用称为MCU的集中单元进行操作。MCU可以实现混音器或转换器功能（用RTP[RFC3550]术语）和信令支持。它们还可能包含其他应用程序层功能。本文档重点介绍可以使用RTP实现的MCU的媒体传输方面，如下所述。进一步考虑混频器和转换器的属性，以及某些类型的已部署MCU如何偏离这些属性。"
    },
    {
      "indent": 3,
      "text": "This document also codifies new multipoint architectures that have recently been introduced and that were not anticipated in RFC 5117; thus, this document replaces [RFC5117]. These architectures use scalable video coding and simulcasting, and their associated centralized units are referred to as Selective Forwarding Middleboxes (SFMs). This codification provides a common information basis for future discussion and specification work.",
      "zh-CHS": "本文件还编纂了最近引入的、RFC 5117中未预期的新多点体系结构；因此，本文件取代[RFC5117]。这些体系结构使用可伸缩视频编码和同步广播，其相关的集中式单元称为选择性转发中间盒（SFM）。该编目为将来的讨论和规范工作提供了通用信息基础。"
    },
    {
      "indent": 3,
      "text": "The new topologies are Point to Point via Middlebox (Section 3.2), Source-Specific Multicast (Section 3.3.2), SSM with Local Unicast Resources (Section 3.3.3), Point to Multipoint Using Mesh (Section 3.4), Selective Forwarding Middlebox (Section 3.7), and Split Component Terminal (Section 3.10). The Point to Multipoint Using the RFC 3550 Mixer Model (Section 3.6) has been significantly expanded to cover two different versions, namely Media-Mixing Mixer (Section 3.6.1) and Media-Switching Mixer (Section 3.6.2).",
      "zh-CHS": "新的拓扑是通过中间箱点对点（第3.2节）、源特定多播（第3.3.2节）、具有本地单播资源的SSM（第3.3.3节）、使用网状网的点对多点（第3.4节）、选择性转发中间箱（第3.7节）和拆分组件终端（第3.10节）。使用RFC 3550混音器模型（第3.6节）的点对多点已显著扩展，以涵盖两种不同版本，即介质混音器（第3.6.1节）和介质切换混音器（第3.6.2节）。"
    },
    {
      "indent": 3,
      "text": "The document's attempt to clarify and explain sections of the RTP spec [RFC3550] is informal. It is not intended to update or change what is normatively specified within RFC 3550.",
      "zh-CHS": "本文件试图澄清和解释RTP规范[RFC3550]的章节，这是非正式的。其目的不是更新或更改RFC 3550中规范规定的内容。"
    },
    {
      "indent": 0,
      "text": "2. Definitions",
      "section_title": true,
      "zh-CHS": "2. 定义"
    },
    {
      "indent": 0,
      "text": "2.1. Glossary",
      "section_title": true,
      "zh-CHS": "2.1. 术语汇编"
    },
    {
      "indent": 3,
      "text": "ASM: Any-Source Multicast",
      "zh-CHS": "ASM：任何源多播"
    },
    {
      "indent": 3,
      "text": "AVPF: The extended RTP profile for RTCP-based feedback",
      "zh-CHS": "AVPF：基于RTCP的反馈的扩展RTP配置文件"
    },
    {
      "indent": 3,
      "text": "CSRC: Contributing Source",
      "zh-CHS": "中国证监会：贡献来源"
    },
    {
      "indent": 3,
      "text": "Link: The data transport to the next IP hop",
      "zh-CHS": "链接：数据传输到下一个IP跃点"
    },
    {
      "indent": 3,
      "text": "Middlebox: A device that is on the Path that media travel between two endpoints",
      "zh-CHS": "中间盒：媒体在两个端点之间传输的路径上的设备"
    },
    {
      "indent": 3,
      "text": "MCU: Multipoint Control Unit",
      "zh-CHS": "多点控制单元"
    },
    {
      "indent": 3,
      "text": "Path: The concatenation of multiple links, resulting in an end-to-end data transfer.",
      "zh-CHS": "路径：多个链接的串联，导致端到端数据传输。"
    },
    {
      "indent": 3,
      "text": "PtM: Point to Multipoint",
      "zh-CHS": "PtM：点对多点"
    },
    {
      "indent": 3,
      "text": "PtP: Point to Point",
      "zh-CHS": "PtP：点对点"
    },
    {
      "indent": 3,
      "text": "SFM: Selective Forwarding Middlebox",
      "zh-CHS": "选择性转发中间盒"
    },
    {
      "indent": 3,
      "text": "SSM: Source-Specific Multicast",
      "zh-CHS": "SSM：源特定多播"
    },
    {
      "indent": 3,
      "text": "SSRC: Synchronization Source",
      "zh-CHS": "同步源"
    },
    {
      "indent": 0,
      "text": "2.2. Definitions Related to RTP Grouping Taxonomy",
      "section_title": true,
      "zh-CHS": "2.2. 与RTP分组分类法相关的定义"
    },
    {
      "indent": 3,
      "text": "The following definitions have been taken from [RFC7656].",
      "zh-CHS": "以下定义取自[RFC7656]。"
    },
    {
      "indent": 3,
      "text": "Communication Session: A Communication Session is an association among two or more Participants communicating with each other via one or more Multimedia Sessions.",
      "zh-CHS": "通信会话：通信会话是两个或多个参与者之间通过一个或多个多媒体会话相互通信的关联。"
    },
    {
      "indent": 3,
      "text": "Endpoint: A single addressable entity sending or receiving RTP packets. It may be decomposed into several functional blocks, but as long as it behaves as a single RTP stack mentity, it is classified as a single \"endpoint\".",
      "zh-CHS": "端点：发送或接收RTP数据包的单个可寻址实体。它可以分解为多个功能块，但只要它表现为单个RTP堆栈，它就被归类为单个“端点”。"
    },
    {
      "indent": 3,
      "text": "Media Source: A Media Source is the logical source of a time progressing digital media stream synchronized to a reference clock. This stream is called a Source Stream.",
      "zh-CHS": "媒体源：媒体源是与参考时钟同步的时间推进数字媒体流的逻辑源。此流称为源流。"
    },
    {
      "indent": 3,
      "text": "Multimedia Session: A Multimedia Session is an association among a group of participants engaged in communication via one or more RTP sessions.",
      "zh-CHS": "多媒体会话：多媒体会话是一组通过一个或多个RTP会话进行通信的参与者之间的关联。"
    },
    {
      "indent": 0,
      "text": "3. Topologies",
      "section_title": true,
      "zh-CHS": "3. 拓扑"
    },
    {
      "indent": 3,
      "text": "This subsection defines several topologies that are relevant for codec control but also RTP usage in other contexts. The section starts with point-to-point cases, with or without middleboxes. Then it follows a number of different methods for establishing point-to-multipoint communication. These are structured around the most fundamental enabler, i.e., multicast, a mesh of connections, translators, mixers, and finally MCUs and SFMs. The section ends by discussing decomposited terminals, asymmetric middlebox behaviors, and combining topologies.",
      "zh-CHS": "本小节定义了与编解码器控制相关的几种拓扑，以及在其他上下文中的RTP使用。本节从点对点案例开始，包括或不包括中间盒。然后，它遵循许多不同的方法来建立点对多点通信。这些是围绕最基本的启用码构建的，即多播、连接网、转换器、混频器，最后是MCU和SFM。本节最后讨论了分解终端、不对称中间盒行为和组合拓扑。"
    },
    {
      "indent": 3,
      "text": "The topologies may be referenced in other documents by a shortcut name, indicated by the prefix \"Topo-\".",
      "zh-CHS": "在其他文档中，拓扑可通过前缀“Topo-”指示的快捷方式名称引用。"
    },
    {
      "indent": 3,
      "text": "For each of the RTP-defined topologies, we discuss how RTP, RTCP, and the carried media are handled. With respect to RTCP, we also discuss the handling of RTCP feedback messages as defined in [RFC4585] and [RFC5104].",
      "zh-CHS": "对于每个RTP定义的拓扑，我们将讨论如何处理RTP、RTCP和承载介质。关于RTCP，我们还讨论了[RFC4585]和[RFC5104]中定义的RTCP反馈消息的处理。"
    },
    {
      "indent": 0,
      "text": "3.1. Point to Point",
      "section_title": true,
      "zh-CHS": "3.1. 点对点"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Point-to-Point",
      "zh-CHS": "快捷方式名称：地形点到点"
    },
    {
      "indent": 3,
      "text": "The Point-to-Point (PtP) topology (Figure 1) consists of two endpoints, communicating using unicast. Both RTP and RTCP traffic are conveyed endpoint to endpoint, using unicast traffic only (even if, in exotic cases, this unicast traffic happens to be conveyed over an IP multicast address).",
      "zh-CHS": "点到点（PtP）拓扑（图1）由两个端点组成，使用单播进行通信。RTP和RTCP通信量都是在端点之间传输的，仅使用单播通信量（即使在特殊情况下，该单播通信量恰好通过IP多播地址传输）。"
    },
    {
      "indent": 28,
      "text": "+---+         +---+\n| A |<------->| B |\n+---+         +---+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Figure 1: Point to Point",
      "zh-CHS": "图1：点对点"
    },
    {
      "indent": 3,
      "text": "The main property of this topology is that A sends to B, and only B, while B sends to A, and only A. This avoids all complexities of handling multiple endpoints and combining the requirements stemming from them. Note that an endpoint can still use multiple RTP Synchronization Sources (SSRCs) in an RTP session. The number of RTP sessions in use between A and B can also be of any number, subject only to system-level limitations like the number range of ports.",
      "zh-CHS": "此拓扑的主要特性是A发送到B，且仅发送到B，而B发送到A，且仅发送到A。这避免了处理多个端点和组合源自它们的需求的所有复杂性。请注意，端点仍可在RTP会话中使用多个RTP同步源（SSRC）。A和B之间使用的RTP会话的数量也可以是任意数量，仅受系统级限制（如端口数量范围）的限制。"
    },
    {
      "indent": 3,
      "text": "RTCP feedback messages for the indicated SSRCs are communicated directly between the endpoints. Therefore, this topology poses minimal (if any) issues for any feedback messages. For RTP sessions that use multiple SSRCs per endpoint, it can be relevant to implement support for cross-reporting suppression as defined in \"Sending Multiple Media Streams in a Single RTP Session\" [MULTI-STREAM-OPT].",
      "zh-CHS": "指示SSRC的RTCP反馈消息在端点之间直接通信。因此，这种拓扑结构对任何反馈消息造成的问题最小（如果有的话）。对于每个端点使用多个SSRC的RTP会话，实施“在单个RTP会话中发送多个媒体流”[MULTI-STREAM-OPT]中定义的交叉报告抑制支持是相关的。"
    },
    {
      "indent": 0,
      "text": "3.2. Point to Point via Middlebox",
      "section_title": true,
      "zh-CHS": "3.2. 通过中间箱点对点"
    },
    {
      "indent": 3,
      "text": "This section discusses cases where two endpoints communicate but have one or more middleboxes involved in the RTP session.",
      "zh-CHS": "本节讨论两个端点通信但RTP会话中涉及一个或多个中间盒的情况。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Translators",
      "section_title": true,
      "zh-CHS": "3.2.1. 翻译人员"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-PtP-Translator",
      "zh-CHS": "快捷方式名称：Topo PtP转换器"
    },
    {
      "indent": 3,
      "text": "Two main categories of translators can be distinguished: Transport Translators and Media Translators. Both translator types share common attributes that separate them from mixers. For each RTP stream that the translator receives, it generates an individual RTP stream in the other domain. A translator keeps the SSRC for an RTP stream across the translation, whereas a mixer can select a single RTP stream from multiple received RTP streams (in cases like audio/ video switching) or send out an RTP stream composed of multiple mixed media received in multiple RTP streams (in cases like audio mixing or video tiling), but always under its own SSRC, possibly using the CSRC field to indicate the source(s) of the content. Mixers are more common in point-to-multipoint cases than in PtP. The reason is that in PtP use cases, the primary focus of a middlebox is enabling interoperability, between otherwise non-interoperable endpoints, such as transcoding to a codec the receiver supports, which can be done by a Media Translator.",
      "zh-CHS": "翻译人员可分为两大类：交通翻译人员和媒体翻译人员。这两种转换器类型共享将它们与混合器分开的公共属性。对于转换器接收到的每个RTP流，它在另一个域中生成一个单独的RTP流。翻译器在整个翻译过程中为RTP流保留SSRC，而混音器可以从多个接收的RTP流中选择单个RTP流（在音频/视频切换的情况下）或发送由多个RTP流中接收的多个混合媒体组成的RTP流（在音频混合或视频平铺的情况下），但始终在其自己的SSRC下，可能使用CSRC字段指示内容的来源。混频器在点对多点情况下比在PtP中更常见。原因是，在PtP用例中，中间盒的主要焦点是在其他不可互操作的端点之间实现互操作性，例如转换到接收器支持的编解码器，这可以由媒体转换器完成。"
    },
    {
      "indent": 3,
      "text": "As specified in Section 7.1 of [RFC3550], the SSRC space is common for all participants in the RTP session, independent of on which side of the translator the session resides. Therefore, it is the responsibility of the endpoints (as the RTP session participants) to run SSRC collision detection, and the SSRC is thus a field the translator cannot change. Any Source Description (SDES) information associated with an SSRC or CSRC also needs to be forwarded between the domains for any SSRC/CSRC used in the different domains.",
      "zh-CHS": "如[RFC3550]第7.1节所述，SSRC空间对于RTP会话中的所有参与者都是通用的，与会话驻留在转换器的哪一侧无关。因此，端点（作为RTP会话参与者）负责运行SSRC冲突检测，因此SSRC是翻译器无法更改的字段。对于不同域中使用的任何SSRC/CSC，还需要在域之间转发与SSRC或CSC相关的任何源描述（SDES）信息。"
    },
    {
      "indent": 3,
      "text": "A translator commonly does not use an SSRC of its own and is not visible as an active participant in the RTP session. One reason to have its own SSRC is when a translator acts as a quality monitor that sends RTCP reports and therefore is required to have an SSRC. Another example is the case when a translator is prepared to use RTCP feedback messages. This may, for example, occur in a translator",
      "zh-CHS": "翻译人员通常不使用自己的SSRC，并且在RTP会话中作为活动参与者不可见。拥有自己的SSRC的一个原因是，翻译人员充当发送RTCP报告的质量监视器，因此需要拥有SSRC。另一个例子是翻译人员准备使用RTCP反馈消息的情况。例如，这可能发生在翻译器中"
    },
    {
      "indent": 3,
      "text": "configured to detect packet loss of important video packets, and it wants to trigger repair by the media sending endpoint, by sending feedback messages. While such feedback could use the SSRC of the target for the translator (the receiving endpoint), this in turn would require translation of the target RTCP reports to make them consistent. It may be simpler to expose an additional SSRC in the session. The only concern is that endpoints failing to support the full RTP specification may have issues with multiple SSRCs reporting on the RTP streams sent by that endpoint, as this use case may be viewed as exotic by implementers.",
      "zh-CHS": "配置为检测重要视频数据包的数据包丢失，并希望通过发送反馈消息触发媒体发送端点的修复。虽然此类反馈可以将目标的SSRC用于翻译器（接收端点），但这反过来又需要翻译目标RTCP报告以使其一致。在会话中公开额外的SSRC可能更简单。唯一值得关注的是，未能支持完整RTP规范的端点可能存在多个SSRC报告该端点发送的RTP流的问题，因为该用例可能被实现者视为异国情调。"
    },
    {
      "indent": 3,
      "text": "In general, a translator implementation should consider which RTCP feedback messages or codec-control messages it needs to understand in relation to the functionality of the translator itself. This is completely in line with the requirement to also translate RTCP messages between the domains.",
      "zh-CHS": "一般来说，翻译器实现应该考虑哪一个RTCP反馈消息或编解码器控制消息，它需要理解与翻译本身的功能有关。这完全符合在域之间转换RTCP消息的要求。"
    },
    {
      "indent": 0,
      "text": "3.2.1.1. Transport Relay/Anchoring",
      "section_title": true,
      "zh-CHS": "3.2.1.1. 运输继电器/锚定"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-PtP-Relay",
      "zh-CHS": "快捷方式名称：Topo PtP继电器"
    },
    {
      "indent": 3,
      "text": "There exist a number of different types of middleboxes that might be inserted between two endpoints on the transport level, e.g., to perform changes on the IP/UDP headers, and are, therefore, basic Transport Translators. These middleboxes come in many variations including NAT [RFC3022] traversal by pinning the media path to a public address domain relay and network topologies where the RTP stream is required to pass a particular point for audit by employing relaying, or preserving privacy by hiding each peer's transport addresses to the other party. Other protocols or functionalities that provide this behavior are Traversal Using Relays around NAT (TURN) [RFC5766] servers, Session Border Gateways, and Media Processing Nodes with media anchoring functionalities.",
      "zh-CHS": "存在许多不同类型的中间盒，可以在传输级别的两个端点之间插入，例如，对IP/UDP头执行更改，因此它们是基本的传输转换器。这些中间盒有许多变体，包括通过将媒体路径固定到公共地址域中继的NAT[RFC3022]遍历和网络拓扑，其中RTP流需要通过使用中继来通过特定点进行审核，或者通过将每个对等方的传输地址隐藏到另一方来保护隐私。提供此行为的其他协议或功能是使用NAT（TURN）[RFC5766]服务器、会话边界网关和具有媒体锚定功能的媒体处理节点周围的中继进行遍历。"
    },
    {
      "indent": 21,
      "text": "+---+        +---+         +---+\n| A |<------>| T |<------->| B |\n+---+        +---+         +---+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 2: Point to Point with Translator",
      "zh-CHS": "图2：使用Translator的点对点"
    },
    {
      "indent": 3,
      "text": "A common element in these functions is that they are normally transparent at the RTP level, i.e., they perform no changes on any RTP or RTCP packet fields and only affect the lower layers. They may affect, however, the path since the RTP and RTCP packets are routed between the endpoints in the RTP session, and thereby they indirectly affect the RTP session. For this reason, one could believe that Transport Translator-type middleboxes do not need to be included in this document. This topology, however, can raise additional",
      "zh-CHS": "这些函数中的一个常见元素是，它们通常在RTP级别是透明的，即它们不会对任何RTP或RTCP数据包字段执行任何更改，只影响较低的层。但是，它们可能会影响路径，因为RTP和RTCP数据包在RTP会话中的端点之间路由，因此它们会间接影响RTP会话。因此，可以认为本文件中不需要包含运输翻译型中间盒。然而，这种拓扑结构可能会引发额外的问题"
    },
    {
      "indent": 3,
      "text": "requirements in the RTP implementation and its interactions with the signaling solution. Both in signaling and in certain RTCP fields, network addresses other than those of the relay can occur since B has a different network address than the relay (T). Implementations that cannot support this will also not work correctly when endpoints are subject to NAT.",
      "zh-CHS": "RTP实现中的需求及其与信令解决方案的交互。在信令和某些RTCP字段中，由于B的网络地址不同于中继器（T），因此可能出现中继器以外的网络地址。当端点受制于NAT时，无法支持此功能的实现也将无法正常工作。"
    },
    {
      "indent": 3,
      "text": "The Transport Relay implementations also have to take into account security considerations. In particular, source address filtering of incoming packets is usually important in relays, to prevent attackers from injecting traffic into a session, which one peer may, in the absence of adequate security in the relay, think it comes from the other peer.",
      "zh-CHS": "传输中继的实现还必须考虑安全因素。特别是，传入数据包的源地址过滤在中继中通常很重要，以防止攻击者将流量注入会话，在中继中缺乏足够安全性的情况下，一个对等方可能会认为它来自另一个对等方。"
    },
    {
      "indent": 0,
      "text": "3.2.1.2. Transport Translator",
      "section_title": true,
      "zh-CHS": "3.2.1.2. 传输转换器"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Trn-Translator",
      "zh-CHS": "快捷方式名称：Topo Trn Translator"
    },
    {
      "indent": 3,
      "text": "Transport Translators (Topo-Trn-Translator) do not modify the RTP stream itself but are concerned with transport parameters. Transport parameters, in the sense of this section, comprise the transport addresses (to bridge different domains such as unicast to multicast) and the media packetization to allow other transport protocols to be interconnected to a session (in gateways).",
      "zh-CHS": "传输转换器（Topo-Trn-Translator）不修改RTP流本身，而是与传输参数有关。在本节中，传输参数包括传输地址（用于桥接不同域，如单播到多播）和媒体分组，以允许其他传输协议互连到会话（在网关中）。"
    },
    {
      "indent": 3,
      "text": "Translators that bridge between different protocol worlds need to be concerned about the mapping of the SSRC/CSRC (Contributing Source) concept to the non-RTP protocol. When designing a translator to a non-RTP-based media transport, an important consideration is how to handle different sources and their identities. This problem space is not discussed henceforth.",
      "zh-CHS": "连接不同协议世界的翻译人员需要关注SSRC/CSC（贡献源）概念到非RTP协议的映射。在设计非RTP媒体传输的翻译器时，一个重要的考虑因素是如何处理不同的源及其身份。以后不再讨论这个问题。"
    },
    {
      "indent": 3,
      "text": "Of the Transport Translators, this memo is primarily interested in those that use RTP on both sides, and this is assumed henceforth.",
      "zh-CHS": "对于运输翻译人员，本备忘录主要关注双方都使用RTP的翻译人员，并假设从现在开始。"
    },
    {
      "indent": 3,
      "text": "The most basic Transport Translators that operate below the RTP level were already discussed in Section 3.2.1.1.",
      "zh-CHS": "第3.2.1.1节已经讨论了在RTP级别以下运行的最基本的传输转换器。"
    },
    {
      "indent": 0,
      "text": "3.2.1.3. Media Translator",
      "section_title": true,
      "zh-CHS": "3.2.1.3. 媒体翻译"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Media-Translator",
      "zh-CHS": "快捷方式名称：Topo媒体转换器"
    },
    {
      "indent": 3,
      "text": "Media Translators (Topo-Media-Translator) modify the media inside the RTP stream. This process is commonly known as transcoding. The modification of the media can be as small as removing parts of the stream, and it can go all the way to a full decoding and re-encoding (down to the sample level or equivalent) utilizing a different media",
      "zh-CHS": "媒体转换器（Topo Media Translator）修改RTP流中的媒体。这个过程通常被称为代码转换。对媒体的修改可以小到删除流的一部分，并且可以一直使用不同的媒体进行完全解码和重新编码（直至样本级别或等效级别）"
    },
    {
      "indent": 3,
      "text": "codec. Media Translators are commonly used to connect endpoints without a common interoperability point in the media encoding.",
      "zh-CHS": "编解码器。媒体转换器通常用于连接在媒体编码中没有公共互操作性点的端点。"
    },
    {
      "indent": 3,
      "text": "Stand-alone Media Translators are rare. Most commonly, a combination of Transport and Media Translator is used to translate both the media and the transport aspects of the RTP stream carrying the media between two transport domains.",
      "zh-CHS": "独立的媒体翻译人员很少。最常见的是，传输和媒体转换器的组合用于在两个传输域之间翻译承载媒体的RTP流的媒体和传输方面。"
    },
    {
      "indent": 3,
      "text": "When media translation occurs, the translator's task regarding handling of RTCP traffic becomes substantially more complex. In this case, the translator needs to rewrite endpoint B's RTCP receiver report before forwarding them to endpoint A. The rewriting is needed as the RTP stream received by B is not the same RTP stream as the other participants receive. For example, the number of packets transmitted to B may be lower than what A sends, due to the different media format and data rate. Therefore, if the receiver reports were forwarded without changes, the extended highest sequence number would indicate that B was substantially behind in reception, while it most likely would not be. Therefore, the translator must translate that number to a corresponding sequence number for the stream the translator received. Similar requirements exist for most other fields in the RTCP receiver reports.",
      "zh-CHS": "当发生媒体翻译时，翻译器处理RTCP通信量的任务变得更加复杂。在这种情况下，转换器需要在将端点B的RTCP接收器报告转发到端点A之前重写它们。需要重写，因为B接收的RTP流与其他参与者接收的RTP流不同。例如，由于不同的媒体格式和数据速率，发送到B的分组的数目可能低于A发送的分组的数目。因此，如果接收器报告在没有改变的情况下被转发，则扩展的最高序列号将指示B在接收方面实质上落后，而它很可能不会落后。因此，转换器必须将该编号转换为转换器接收到的流的相应序列号。RTCP接收方报告中的大多数其他字段也存在类似要求。"
    },
    {
      "indent": 3,
      "text": "A Media Translator may in some cases act on behalf of the \"real\" source (the endpoint originally sending the media to the translator) and respond to RTCP feedback messages. This may occur, for example, when a receiving endpoint requests a bandwidth reduction, and the Media Translator has not detected any congestion or other reasons for bandwidth reduction between the sending endpoint and itself. In that case, it is sensible that the Media Translator reacts to codec control messages itself, for example, by transcoding to a lower media rate.",
      "zh-CHS": "在某些情况下，媒体翻译器可能代表“真实”源（最初将媒体发送给翻译器的端点）并响应RTCP反馈消息。例如，当接收端点请求带宽减少，并且媒体转换器未检测到发送端点与自身之间的带宽减少的任何拥塞或其他原因时，这可能发生。在这种情况下，媒体翻译器对编解码器控制消息本身作出反应是明智的，例如，通过转码到较低的媒体速率。"
    },
    {
      "indent": 3,
      "text": "A variant of translator behavior worth pointing out is the one depicted in Figure 3 of an endpoint A sending an RTP stream containing media (only) to B. On the path, there is a device T that manipulates the RTP streams on A's behalf. One common example is that T adds a second RTP stream containing Forward Error Correction (FEC) information in order to protect A's (non FEC-protected) RTP stream. In this case, T needs to semantically bind the new FEC RTP stream to A's media-carrying RTP stream, for example, by using the same CNAME as A.",
      "zh-CHS": "值得指出的转换器行为变体如图3所示，端点A向B发送（仅）包含媒体的RTP流。在路径上，有一个设备T代表A操纵RTP流。一个常见的例子是，T添加包含前向纠错（FEC）信息的第二个RTP流以保护a的（非FEC保护的）RTP流。在这种情况下，T需要将新的FEC RTP流语义上绑定到A的承载RTP流的媒体，例如，通过使用与A相同的CNAME。"
    },
    {
      "indent": 17,
      "text": "+------+        +------+         +------+\n|      |        |      |         |      |\n|  A   |------->|  T   |-------->|  B   |\n|      |        |      |---FEC-->|      |\n+------+        +------+         +------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Figure 3: Media Translator Adding FEC",
      "zh-CHS": "图3：添加FEC的媒体转换器"
    },
    {
      "indent": 3,
      "text": "There may also be cases where information is added into the original RTP stream, while leaving most or all of the original RTP packets intact (with the exception of certain RTP header fields, such as the sequence number). One example is the injection of metadata into the RTP stream, carried in their own RTP packets.",
      "zh-CHS": "也可能存在这样的情况：信息被添加到原始RTP流中，同时保留大部分或所有原始RTP数据包完好无损（某些RTP报头字段除外，例如序列号）。一个例子是将元数据注入到RTP流中，由它们自己的RTP数据包携带。"
    },
    {
      "indent": 3,
      "text": "Similarly, a Media Translator can sometimes remove information from the RTP stream, while otherwise leaving the remaining RTP packets unchanged (again with the exception of certain RTP header fields).",
      "zh-CHS": "类似地，媒体转换器有时可以从RTP流中删除信息，而其他情况下保持其余RTP数据包不变（某些RTP头字段除外）。"
    },
    {
      "indent": 3,
      "text": "Either type of functionality where T manipulates the RTP stream, or adds an accompanying RTP stream, on behalf of A is also covered under the Media Translator definition.",
      "zh-CHS": "媒体转换器定义中还涵盖了T代表A操纵RTP流或添加伴随RTP流的任一类型的功能。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Back-to-Back RTP sessions",
      "section_title": true,
      "zh-CHS": "3.2.2. 背对背RTP会话"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Back-To-Back",
      "zh-CHS": "快捷方式名称：Topo背对背"
    },
    {
      "indent": 3,
      "text": "There exist middleboxes that interconnect two endpoints (A and B) through themselves (MB), but not by being part of a common RTP session. Instead, they establish two different RTP sessions: one between A and the middlebox and another between the middlebox and B. This topology is called Topo-Back-To-Back.",
      "zh-CHS": "存在通过自身（MB）互连两个端点（A和B）的中间盒，但不作为公共RTP会话的一部分。相反，它们建立两个不同的RTP会话：一个在A和中间盒之间，另一个在中间盒和B之间。这种拓扑称为Topo背对背。"
    },
    {
      "indent": 17,
      "text": "  |<--Session A-->|  |<--Session B-->|\n+------+        +------+         +------+\n|  A   |------->|  MB  |-------->|  B   |\n+------+        +------+         +------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Figure 4: Back-to-Back RTP Sessions through Middlebox",
      "zh-CHS": "图4：通过Middlebox的背对背RTP会话"
    },
    {
      "indent": 3,
      "text": "The middlebox acts as an application-level gateway and bridges the two RTP sessions. This bridging can be as basic as forwarding the RTP payloads between the sessions or more complex including media transcoding. The difference of this topology relative to the single RTP session context is the handling of the SSRCs and the other session-related identifiers, such as CNAMEs. With two different RTP sessions, these can be freely changed and it becomes the middlebox's responsibility to maintain the correct relations.",
      "zh-CHS": "中间盒充当应用程序级网关，并连接两个RTP会话。这种桥接可以像在会话之间转发RTP有效负载一样基本，也可以更复杂，包括媒体转码。此拓扑相对于单个RTP会话上下文的不同之处在于SSRC和其他会话相关标识符（如CNAMEs）的处理。有了两个不同的RTP会话，这些会话可以自由更改，维护正确的关系成为中间人的责任。"
    },
    {
      "indent": 3,
      "text": "The signaling or other above RTP-level functionalities referencing RTP streams may be what is most impacted by using two RTP sessions and changing identifiers. The structure with two RTP sessions also puts a congestion control requirement on the middlebox, because it becomes fully responsible for the media stream it sources into each of the sessions.",
      "zh-CHS": "通过使用两个RTP会话和更改标识符，引用RTP流的信令或其他RTP级以上功能可能是受影响最大的功能。具有两个RTP会话的结构还对中间盒提出了拥塞控制要求，因为它将完全负责它发送到每个会话中的媒体流。"
    },
    {
      "indent": 3,
      "text": "Adherence to congestion control can be solved locally on each of the two segments or by bridging statistics from the receiving endpoint through the middlebox to the sending endpoint. From an implementation point, however, the latter requires dealing with a number of inconsistencies. First, packet loss must be detected for an RTP stream sent from A to the middlebox, and that loss must be reported through a skipped sequence number in the RTP stream from the middlebox to B. This coupling and the resulting inconsistencies are conceptually easier to handle when considering the two RTP streams as belonging to a single RTP session.",
      "zh-CHS": "遵守拥塞控制可以在两个段中的每个段上本地解决，或者通过桥接从接收端点到发送端点的统计信息来解决。然而，从实现的角度来看，后者需要处理一些不一致的问题。首先，必须检测从A发送到中间箱的RTP流的数据包丢失，并且必须通过从中间箱发送到B的RTP流中跳过的序列号报告该丢失。当将两个RTP流视为属于单个RTP会话时，这种耦合和由此产生的不一致在概念上更容易处理。"
    },
    {
      "indent": 0,
      "text": "3.3. Point to Multipoint Using Multicast",
      "section_title": true,
      "zh-CHS": "3.3. 使用多播的点对多点"
    },
    {
      "indent": 3,
      "text": "Multicast is an IP-layer functionality that is available in some networks. Two main flavors can be distinguished: Any-Source Multicast (ASM) [RFC1112] where any multicast group participant can send to the group address and expect the packet to reach all group participants and Source-Specific Multicast (SSM) [RFC3569], where only a particular IP host sends to the multicast group. Each of these models are discussed below in their respective sections.",
      "zh-CHS": "多播是一种在某些网络中可用的IP层功能。可以区分两种主要类型：任何源多播（ASM）[RFC1112]，其中任何多播组参与者都可以发送到组地址并期望数据包到达所有组参与者；以及源特定多播（SSM）[RFC3569]，其中只有特定IP主机发送到多播组。下面将在各自的章节中讨论这些模型。"
    },
    {
      "indent": 0,
      "text": "3.3.1. Any-Source Multicast (ASM)",
      "section_title": true,
      "zh-CHS": "3.3.1. 任意源多播（ASM）"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-ASM (was Topo-Multicast)",
      "zh-CHS": "快捷方式名称：Topo ASM（was Topo多播）"
    },
    {
      "indent": 24,
      "text": "           +-----+\n+---+     /       \\    +---+\n| A |----/         \\---| B |\n+---+   /   Multi-  \\  +---+\n       +    cast     +\n+---+   \\  Network  /  +---+\n| C |----\\         /---| D |\n+---+     \\       /    +---+\n           +-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 5: Point to Multipoint Using Multicast",
      "zh-CHS": "图5：使用多播的点对多点"
    },
    {
      "indent": 3,
      "text": "Point to Multipoint (PtM) is defined here as using a multicast topology as a transmission model, in which traffic from any multicast group participant reaches all the other multicast group participants, except for cases such as:",
      "zh-CHS": "点对多点（PtM）在这里定义为使用多播拓扑作为传输模型，其中来自任何多播组参与者的流量到达所有其他多播组参与者，但以下情况除外："
    },
    {
      "indent": 3,
      "text": "o packet loss, or",
      "zh-CHS": "o 数据包丢失，或"
    },
    {
      "indent": 3,
      "text": "o when a multicast group participant does not wish to receive the traffic for a specific multicast group and, therefore, has not subscribed to the IP multicast group in question. This scenario can occur, for example, where a Multimedia Session is distributed using two or more multicast groups, and a multicast group participant is subscribed only to a subset of these sessions.",
      "zh-CHS": "o 当多播组参与者不希望接收特定多播组的通信量，因此没有订阅所讨论的IP多播组时。这种情况可能发生，例如，使用两个或多个多播组分发多媒体会话，并且多播组参与者仅订阅这些会话的子集。"
    },
    {
      "indent": 3,
      "text": "In the above context, \"traffic\" encompasses both RTP and RTCP traffic. The number of multicast group participants can vary between one and many, as RTP and RTCP scale to very large multicast groups (the theoretical limit of the number of participants in a single RTP session is in the range of billions). The above can be realized using ASM.",
      "zh-CHS": "在上述上下文中，“流量”包括RTP和RTCP流量。多播组参与者的数量可以在一个或多个之间变化，因为RTP和RTCP扩展到非常大的多播组（单个RTP会话中参与者数量的理论限制在数十亿范围内）。可以使用ASM实现上述功能。"
    },
    {
      "indent": 3,
      "text": "For feedback usage, it is useful to define a \"small multicast group\" as a group where the number of multicast group participants is so low (and other factors such as the connectivity is so good) that it allows the participants to use early or immediate feedback, as defined in AVPF [RFC4585]. Even when the environment would allow for the use of a small multicast group, some applications may still want to use the more limited options for RTCP feedback available to large multicast groups, for example, when there is a likelihood that the threshold of the small multicast group (in terms of multicast group participants) may be exceeded during the lifetime of a session.",
      "zh-CHS": "对于反馈使用，将“小型多播组”定义为多播组参与者数量非常少（以及其他因素，如连接性非常好），从而允许参与者使用AVPF[RFC4585]中定义的早期或即时反馈的组非常有用。即使环境允许使用小型多播组，一些应用程序可能仍然希望使用大型多播组可用的RTCP反馈的更有限选项，例如，当小型多播组的阈值（就多播组参与者而言）可能在会话的生存期内可能会超过。"
    },
    {
      "indent": 3,
      "text": "RTCP feedback messages in multicast reach, like media data, every subscriber (subject to packet losses and multicast group subscription). Therefore, the feedback suppression mechanism discussed in [RFC4585] is typically required. Each individual endpoint that is a multicast group participant needs to process every feedback message it receives, not only to determine if it is affected or if the feedback message applies only to some other endpoint but also to derive timing restrictions for the sending of its own feedback messages, if any.",
      "zh-CHS": "RTCP多播范围内的反馈消息，如媒体数据，每个订户（受数据包丢失和多播组订阅的影响）。因此，通常需要[RFC4585]中讨论的反馈抑制机制。作为多播组参与者的每个单独端点都需要处理它接收到的每个反馈消息，不仅要确定它是否受到影响，或者反馈消息是否仅适用于某个其他端点，还要确定发送自己的反馈消息（如果有）的时间限制。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Source-Specific Multicast (SSM)",
      "section_title": true,
      "zh-CHS": "3.3.2. 源特定多播（SSM）"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-SSM",
      "zh-CHS": "快捷方式名称：Topo SSM"
    },
    {
      "indent": 3,
      "text": "In Any-Source Multicast, any of the multicast group participants can send to all the other multicast group participants, by sending a packet to the multicast group. In contrast, Source-Specific Multicast [RFC3569][RFC4607] refers to scenarios where only a single source (Distribution Source) can send to the multicast group, creating a topology that looks like the one below:",
      "zh-CHS": "在任何源多播中，任何多播组参与者都可以通过向多播组发送数据包向所有其他多播组参与者发送数据。相反，特定于源的多播[RFC3569][RFC4607]指的是只有一个源（分发源）可以发送到多播组的场景，创建了如下拓扑："
    },
    {
      "indent": 10,
      "text": "+--------+       +-----+\n|Media   |       |     |       Source-Specific\n|Sender 1|<----->| D S |          Multicast\n+--------+       | I O |  +--+----------------> R(1)\n                 | S U |  |  |                    |\n+--------+       | T R |  |  +-----------> R(2)   |\n|Media   |<----->| R C |->+  |           :   |    |\n|Sender 2|       | I E |  |  +------> R(n-1) |    |\n+--------+       | B   |  |  |          |    |    |\n    :            | U   |  +--+--> R(n)  |    |    |\n    :            | T +-|          |     |    |    |\n    :            | I | |<---------+     |    |    |\n+--------+       | O |F|<---------------+    |    |\n|Media   |       | N |T|<--------------------+    |\n|Sender M|<----->|   | |<-------------------------+\n+--------+       +-----+       RTCP Unicast",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "FT = Feedback Target Transport from the Feedback Target to the Distribution Source is via unicast or multicast RTCP if they are not co-located.",
      "zh-CHS": "FT=反馈目标从反馈目标到分发源的传输是通过单播或多播RTCP进行的，如果它们不在同一位置。"
    },
    {
      "indent": 7,
      "text": "Figure 6: Point to Multipoint Using Source-Specific Multicast",
      "zh-CHS": "图6：使用特定于源的多播的点对多点"
    },
    {
      "indent": 3,
      "text": "In the SSM topology (Figure 6), a number of RTP sending endpoints (RTP sources henceforth) (1 to M) are allowed to send media to the SSM group. These sources send media to a dedicated Distribution Source, which forwards the RTP streams to the multicast group on behalf of the original RTP sources. The RTP streams reach the receiving endpoints (receivers henceforth) (R(1) to R(n)). The receivers' RTCP messages cannot be sent to the multicast group, as the SSM multicast group by definition has only a single IP sender. To support RTCP, an RTP extension for SSM [RFC5760] was defined. It uses unicast transmission to send RTCP from each of the receivers to one or more Feedback Targets (FT). The Feedback Targets relay the RTCP unmodified, or provide a summary of the participants' RTCP reports towards the whole group by forwarding the RTCP traffic to the",
      "zh-CHS": "在SSM拓扑（图6）中，允许多个RTP发送端点（RTP源）（1到M）向SSM组发送媒体。这些源将媒体发送到专用分发源，该分发源代表原始RTP源将RTP流转发到多播组。RTP流到达接收端点（此后的接收机）（R（1）到R（n））。接收方的RTCP消息无法发送到多播组，因为SSM多播组根据定义只有一个IP发送方。为了支持RTCP，定义了SSM[RFC5760]的RTP扩展。它使用单播传输将RTCP从每个接收器发送到一个或多个反馈目标（FT）。反馈目标转发未修改的RTCP，或通过将RTCP流量转发给"
    },
    {
      "indent": 3,
      "text": "Distribution Source. Figure 6 only shows a single Feedback Target integrated in the Distribution Source, but for scalability the FT can be distributed and each instance can have responsibility for subgroups of the receivers. For summary reports, however, there typically must be a single Feedback Target aggregating all the summaries to a common message to the whole receiver group.",
      "zh-CHS": "分配来源。图6仅显示了集成在分发源中的单个反馈目标，但为了可伸缩性，可以分发FT，并且每个实例都可以负责接收器的子组。但是，对于摘要报告，通常必须有一个单一的反馈目标，将所有摘要聚合为一条公共消息，发送给整个接收方组。"
    },
    {
      "indent": 3,
      "text": "The RTP extension for SSM specifies how feedback (both reception information and specific feedback events) are handled. The more general problems associated with the use of multicast, where everyone receives what the Distribution Source sends, need to be accounted for.",
      "zh-CHS": "SSM的RTP扩展指定如何处理反馈（接收信息和特定反馈事件）。需要考虑与使用多播相关的更普遍的问题，即每个人都接收分发源发送的内容。"
    },
    {
      "indent": 3,
      "text": "The aforementioned situation results in common behavior for RTP multicast:",
      "zh-CHS": "上述情况导致RTP多播的常见行为："
    },
    {
      "indent": 3,
      "text": "1. Multicast applications often use a group of RTP sessions, not one. Each endpoint needs to be a member of most or all of these RTP sessions in order to perform well.",
      "zh-CHS": "1. 多播应用程序通常使用一组RTP会话，而不是一个。每个端点都需要是大多数或所有这些RTP会话的成员，才能很好地执行。"
    },
    {
      "indent": 3,
      "text": "2. Within each RTP session, the number of media sinks is likely to be much larger than the number of RTP sources.",
      "zh-CHS": "2. 在每个RTP会话中，媒体接收器的数量可能远大于RTP源的数量。"
    },
    {
      "indent": 3,
      "text": "3. Multicast applications need signaling functions to identify the relationships between RTP sessions.",
      "zh-CHS": "3. 多播应用程序需要信令功能来识别RTP会话之间的关系。"
    },
    {
      "indent": 3,
      "text": "4. Multicast applications need signaling functions to identify the relationships between SSRCs in different RTP sessions.",
      "zh-CHS": "4. 多播应用需要信令功能来识别不同RTP会话中SSRC之间的关系。"
    },
    {
      "indent": 3,
      "text": "All multicast configurations share a signaling requirement: all of the endpoints need to have the same RTP and payload type configuration. Otherwise, endpoint A could, for example, be using payload type 97 to identify the video codec H.264, while endpoint B would identify it as MPEG-2, with unpredictable but almost certainly not visually pleasing results.",
      "zh-CHS": "所有多播配置共享一个信令需求：所有端点都需要具有相同的RTP和有效负载类型配置。否则，例如，端点A可以使用有效负载类型97来识别视频编解码器H.264，而端点B将其识别为MPEG-2，具有不可预测但几乎肯定不会令人满意的结果。"
    },
    {
      "indent": 3,
      "text": "Security solutions for this type of group communication are also challenging. First, the key management and the security protocol must support group communication. Source authentication becomes more difficult and requires specialized solutions. For more discussion on this, please review \"Options for Securing RTP Sessions\" [RFC7201].",
      "zh-CHS": "这种类型的组通信的安全解决方案也具有挑战性。首先，密钥管理和安全协议必须支持组通信。源身份验证变得更加困难，需要专门的解决方案。有关这方面的更多讨论，请查看“保护RTP会话的选项”[RFC7201]。"
    },
    {
      "indent": 0,
      "text": "3.3.3. SSM with Local Unicast Resources",
      "section_title": true,
      "zh-CHS": "3.3.3. 具有本地单播资源的SSM"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-SSM-RAMS",
      "zh-CHS": "快捷方式名称：Topo SSM RAMS"
    },
    {
      "indent": 3,
      "text": "\"Unicast-Based Rapid Acquisition of Multicast RTP Sessions\" [RFC6285] results in additional extensions to SSM topology.",
      "zh-CHS": "“基于单播的多播RTP会话的快速获取”[RFC6285]导致对SSM拓扑的额外扩展。"
    },
    {
      "indent": 3,
      "text": " -----------                                       --------------\n|           |------------------------------------>|              |\n|           |.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.->|              |\n|           |                                     |              |\n| Multicast |          ----------------           |              |\n|  Source   |         | Retransmission |          |              |\n|           |-------->|  Server (RS)   |          |              |\n|           |.-.-.-.->|                |          |              |\n|           |         |  ------------  |          |              |\n -----------          | |  Feedback  | |<.=.=.=.=.|              |\n                      | | Target (FT)| |<~~~~~~~~~| RTP Receiver |\nPRIMARY MULTICAST     |  ------------  |          |   (RTP_Rx)   |\nRTP SESSION with      |                |          |              |\nUNICAST FEEDBACK      |                |          |              |\n                      |                |          |              |\n- - - - - - - - - - - |- - - - - - - - |- - - - - |- - - - - - - |- -\n                      |                |          |              |\nUNICAST BURST         |  ------------  |          |              |\n(or RETRANSMISSION)   | |   Burst/   | |<~~~~~~~~>|              |\nRTP SESSION           | |  Retrans.  | |.........>|              |\n                      | |Source (BRS)| |<.=.=.=.=>|              |\n                      |  ------------  |          |              |\n                      |                |          |              |\n                       ----------------            --------------",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "-------> Multicast RTP Stream\n.-.-.-.> Multicast RTCP Stream\n.=.=.=.> Unicast RTCP Reports\n~~~~~~~> Unicast RTCP Feedback Messages\n.......> Unicast RTP Stream",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Figure 7: SSM with Local Unicast Resources (RAMS)",
      "zh-CHS": "图7：具有本地单播资源（RAMS）的SSM"
    },
    {
      "indent": 3,
      "text": "The rapid acquisition extension allows an endpoint joining an SSM multicast session to request media starting with the last sync point (from where media can be decoded without requiring context established by the decoding of prior packets) to be sent at high speed until such time where, after the decoding of these burst-delivered media packets, the correct media timing is established, i.e., media packets are received within adequate buffer intervals for this application. This is accomplished by first establishing a unicast PtP RTP session between the Burst/Retransmission Source (BRS) (Figure 7) and the RTP Receiver. The unicast session is used to transmit cached packets from the multicast group at higher then normal speed in order to synchronize the receiver to the ongoing multicast RTP stream. Once the RTP receiver and its decoder have caught up with the multicast session's current delivery, the receiver switches over to receiving directly from the multicast group. In",
      "zh-CHS": "快速获取扩展允许加入SSM多播会话的端点请求以高速发送从最后一个同步点开始的媒体（从该点可以解码媒体，而无需通过解码先前分组建立上下文），直到解码这些突发交付的媒体分组之后，建立了正确的媒体定时，即，在此应用程序的适当缓冲区间隔内接收媒体分组。这是通过首先在突发/重传源（BRS）（图7）和RTP接收器之间建立单播PtP RTP会话来实现的。单播会话用于以高于正常速度从多播组传输缓存的数据包，以便使接收器与正在进行的多播RTP流同步。一旦RTP接收器及其解码器赶上了多播会话的当前传送，接收器将切换到直接从多播组接收。在里面"
    },
    {
      "indent": 3,
      "text": "many deployed applications, the (still existing) PtP RTP session is used as a repair channel, i.e., for RTP Retransmission traffic of those packets that were not received from the multicast group.",
      "zh-CHS": "在许多已部署的应用程序中，（仍然存在的）PtP RTP会话被用作修复信道，即，用于那些未从多播组接收的分组的RTP重传流量。"
    },
    {
      "indent": 0,
      "text": "3.4. Point to Multipoint Using Mesh",
      "section_title": true,
      "zh-CHS": "3.4. 使用网格的点对多点"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Mesh",
      "zh-CHS": "快捷方式名称：地形网格"
    },
    {
      "indent": 29,
      "text": "+---+      +---+\n| A |<---->| B |\n+---+      +---+\n  ^         ^\n   \\       /\n    \\     /\n     v   v\n     +---+\n     | C |\n     +---+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 8: Point to Multipoint Using Mesh",
      "zh-CHS": "图8：使用网格的点对多点"
    },
    {
      "indent": 3,
      "text": "Based on the RTP session definition, it is clearly possible to have a joint RTP session involving three or more endpoints over multiple unicast transport flows, like the joint three-endpoint session depicted above. In this case, A needs to send its RTP streams and RTCP packets to both B and C over their respective transport flows. As long as all endpoints do the same, everyone will have a joint view of the RTP session.",
      "zh-CHS": "基于RTP会话定义，很明显，可以在多个单播传输流上具有涉及三个或更多端点的联合RTP会话，如上面描述的联合三端点会话。在这种情况下，A需要通过各自的传输流将其RTP流和RTCP数据包发送给B和C。只要所有端点都这样做，每个人都将拥有RTP会话的联合视图。"
    },
    {
      "indent": 3,
      "text": "This topology does not create any additional requirements beyond the need to have multiple transport flows associated with a single RTP session. Note that an endpoint may use a single local port to receive all these transport flows (in which case the sending port, IP address, or SSRC can be used to demultiplex), or it might have separate local reception ports for each of the endpoints.",
      "zh-CHS": "除了需要将多个传输流与单个RTP会话关联外，此拓扑不会产生任何额外的需求。请注意，端点可以使用单个本地端口来接收所有这些传输流（在这种情况下，可以使用发送端口、IP地址或SSRC来解复用），也可以为每个端点提供单独的本地接收端口。"
    },
    {
      "indent": 9,
      "text": "+-A--------------------+\n|+---+                 |\n||CAM|                 |                 +-B-----------+\n|+---+     +-UDP1------|                 |-UDP1------+ |\n|  |       | +-RTP1----|                 |-RTP1----+ | |\n|  V       | | +-Video-|                 |-Video-+ | | |\n|+----+    | | |       |<----------------|BV1    | | | |\n||ENC |----+-+-+--->AV1|---------------->|       | | | |\n|+----+    | | +-------|                 |-------+ | | |\n|  |       | +---------|                 |---------+ | |\n|  |       +-----------|                 |-----------+ |\n|  |                   |                 +-------------+\n|  |                   |\n|  |                   |                 +-C-----------+\n|  |       +-UDP2------|                 |-UDP2------+ |\n|  |       | +-RTP1----|                 |-RTP1----+ | |\n|  |       | | +-Video-|                 |-Video-+ | | |\n|  +-------+-+-+--->AV1|---------------->|       | | | |\n|          | | |       |<----------------|CV1    | | | |\n|          | | +-------|                 |-------+ | | |\n|          | +---------|                 |---------+ | |\n|          +-----------|                 |-----------+ |\n+----------------------+                 +-------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Figure 9: A Multi-Unicast Mesh with a Joint RTP Session",
      "zh-CHS": "图9：具有联合RTP会话的多单播网格"
    },
    {
      "indent": 3,
      "text": "Figure 9 depicts endpoint A's view of using a common RTP session when establishing the mesh as shown in Figure 8. There is only one RTP session (RTP1) but two transport flows (UDP1 and UDP2). The Media Source (CAM) is encoded and transmitted over the SSRC (AV1) across both transport layers. However, as this is a joint RTP session, the two streams must be the same. Thus, a congestion control adaptation needed for the paths A to B and A to C needs to use the most restricting path's properties.",
      "zh-CHS": "图9描述了端点A在建立网格时使用公共RTP会话的视图，如图8所示。只有一个RTP会话（RTP1），但有两个传输流（UDP1和UDP2）。媒体源（CAM）被编码并通过SSRC（AV1）跨两个传输层传输。但是，由于这是一个联合RTP会话，因此两个流必须相同。因此，路径a到B和a到C所需的拥塞控制自适应需要使用最限制路径的属性。"
    },
    {
      "indent": 3,
      "text": "An alternative structure for establishing the above topology is to use independent RTP sessions between each pair of peers, i.e., three different RTP sessions. In some scenarios, the same RTP stream may be sent from the transmitting endpoint; however, it also supports local adaptation taking place in one or more of the RTP streams, rendering them non-identical.",
      "zh-CHS": "用于建立上述拓扑的替代结构是在每对对等方之间使用独立的RTP会话，即，三个不同的RTP会话。在一些场景中，可以从发送端点发送相同的RTP流；然而，它还支持在一个或多个RTP流中发生的局部适配，从而使它们不相同。"
    },
    {
      "indent": 10,
      "text": "+-A----------------------+              +-B-----------+\n|+---+                   |              |             |\n||MIC|       +-UDP1------|              |-UDP1------+ |\n|+---+       | +-RTP1----|              |-RTP1----+ | |\n| |  +----+  | | +-Audio-|              |-Audio-+ | | |\n| +->|ENC1|--+-+-+--->AA1|------------->|       | | | |\n| |  +----+  | | |       |<-------------|BA1    | | | |\n| |          | | +-------|              |-------+ | | |\n| |          | +---------|              |---------+ | |\n| |          +-----------|              |-----------+ |\n| |          ------------|              |-------------|\n| |                      |              |-------------+\n| |                      |\n| |                      |              +-C-----------+\n| |                      |              |             |\n| |          +-UDP2------|              |-UDP2------+ |\n| |          | +-RTP2----|              |-RTP2----+ | |\n| |  +----+  | | +-Audio-|              |-Audio-+ | | |\n| +->|ENC2|--+-+-+--->AA2|------------->|       | | | |\n|    +----+  | | |       |<-------------|CA1    | | | |\n|            | | +-------|              |-------+ | | |\n|            | +---------|              |---------+ | |\n|            +-----------|              |-----------+ |\n+------------------------+              +-------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Figure 10: A Multi-Unicast Mesh with an Independent RTP Session",
      "zh-CHS": "图10：具有独立RTP会话的多单播网格"
    },
    {
      "indent": 3,
      "text": "Let's review the topology when independent RTP sessions are used from A's perspective in Figure 10 by considering both how the media is handled and how the RTP sessions are set up in Figure 10. A's microphone is captured and the audio is fed into two different encoder instances, each with a different independent RTP session, i.e., RTP1 and RTP2, respectively. The SSRCs (AA1 and AA2) in each RTP session are completely independent, and the media bitrate produced by the encoders can also be tuned differently to address any congestion control requirements differing for the paths A to B compared to A to C.",
      "zh-CHS": "在图10中，让我们从A的角度回顾一下使用独立RTP会话时的拓扑结构，同时考虑如何处理媒体以及如何在图10中设置RTP会话。A的麦克风被捕获，音频被馈送到两个不同的编码器实例中，每个实例具有不同的独立RTP会话，即RTP1和RTP2。每个RTP会话中的SSRC（AA1和AA2）是完全独立的，编码器产生的媒体比特率也可以进行不同的调整，以满足路径A到B与路径A到C不同的任何拥塞控制要求。"
    },
    {
      "indent": 3,
      "text": "From a topologies viewpoint, an important difference exists in the behavior around RTCP. First, when a single RTP session spans all three endpoints A, B, and C, and their connecting RTP streams, a common RTCP bandwidth is calculated and used for this single joint session. In contrast, when there are multiple independent RTP sessions, each RTP session has its local RTCP bandwidth allocation.",
      "zh-CHS": "从拓扑结构的角度来看，RTCP周围的行为存在重要差异。首先，当单个RTP会话跨越所有三个端点a、B和C及其连接的RTP流时，将计算公共RTP带宽并将其用于此单个联合会话。相反，当存在多个独立的RTP会话时，每个RTP会话都有其本地RTCP带宽分配。"
    },
    {
      "indent": 3,
      "text": "Further, when multiple sessions are used, endpoints not directly involved in a session do not have any awareness of the conditions in those sessions. For example, in the case of the three-endpoint",
      "zh-CHS": "此外，当使用多个会话时，未直接参与会话的端点对这些会话中的条件没有任何了解。例如，在三个端点的情况下"
    },
    {
      "indent": 3,
      "text": "configuration in Figure 8, endpoint A has no awareness of the conditions occurring in the session between endpoints B and C (whereas if a single RTP session were used, it would have such awareness).",
      "zh-CHS": "在图8中的配置中，端点A不知道端点B和C之间的会话中发生的情况（而如果使用单个RTP会话，它将具有这种意识）。"
    },
    {
      "indent": 3,
      "text": "Loop detection is also affected. With independent RTP sessions, the SSRC/CSRC cannot be used to determine when an endpoint receives its own media stream, or a mixed media stream including its own media stream (a condition known as a loop). The identification of loops and, in most cases, their avoidance, has to be achieved by other means, for example, through signaling or the use of an RTP external namespace binding SSRC/CSRC among any communicating RTP sessions in the mesh.",
      "zh-CHS": "循环检测也会受到影响。对于独立的RTP会话，SSRC/CSC不能用于确定端点何时接收其自己的媒体流，或包括其自己的媒体流的混合媒体流（称为循环的条件）。必须通过其他方式（例如，通过在mesh中的任何通信RTP会话之间发送信令或使用RTP外部名称空间绑定SSRC/csc）来实现循环的识别以及在大多数情况下避免循环。"
    },
    {
      "indent": 0,
      "text": "3.5. Point to Multipoint Using the RFC 3550 Translator",
      "section_title": true,
      "zh-CHS": "3.5. 使用RFC 3550转换器的点对多点"
    },
    {
      "indent": 3,
      "text": "This section discusses some additional usages related to point to multipoint of translators compared to the point-to-point cases in Section 3.2.1.",
      "zh-CHS": "与第3.2.1节中的点对点情况相比，本节讨论了与译者的点对多点相关的一些附加用法。"
    },
    {
      "indent": 0,
      "text": "3.5.1. Relay - Transport Translator",
      "section_title": true,
      "zh-CHS": "3.5.1. 中继传输转换器"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-PtM-Trn-Translator",
      "zh-CHS": "快捷方式名称：Topo PtM Trn Translator"
    },
    {
      "indent": 3,
      "text": "This section discusses Transport Translator-only usages to enable multipoint sessions.",
      "zh-CHS": "本节讨论仅传输转换器用于启用多点会话的用法。"
    },
    {
      "indent": 13,
      "text": "           +-----+\n+---+     /       \\     +------------+      +---+\n| A |<---/         \\    |            |<---->| B |\n+---+   /           \\   |            |      +---+\n       +  Multicast  +->| Translator |\n+---+   \\  Network  /   |            |      +---+\n| C |<---\\         /    |            |<---->| D |\n+---+     \\       /     +------------+      +---+\n           +-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Figure 11: Point to Multipoint Using Multicast",
      "zh-CHS": "图11：使用多播的点对多点"
    },
    {
      "indent": 3,
      "text": "Figure 11 depicts an example of a Transport Translator performing at least IP address translation. It allows the (non-multicast-capable) endpoints B and D to take part in an Any-Source Multicast session involving endpoints A and C, by having the translator forward their unicast traffic to the multicast addresses in use, and vice versa. It must also forward B's traffic to D, and vice versa, to provide both B and D with a complete view of the session.",
      "zh-CHS": "图11描述了至少执行IP地址转换的传输转换器的示例。它允许（不支持多播的）端点B和D参与涉及端点A和C的任何源多播会话，方法是让转换器将其单播通信转发到正在使用的多播地址，反之亦然。它还必须将B的流量转发给D，反之亦然，以便为B和D提供会话的完整视图。"
    },
    {
      "indent": 19,
      "text": "+---+      +------------+      +---+\n| A |<---->|            |<---->| B |\n+---+      |            |      +---+\n           | Translator |\n+---+      |            |      +---+\n| C |<---->|            |<---->| D |\n+---+      +------------+      +---+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Figure 12: RTP Translator (Relay) with Only Unicast Paths",
      "zh-CHS": "图12：仅具有单播路径的RTP转换器（中继）"
    },
    {
      "indent": 3,
      "text": "Another translator scenario is depicted in Figure 12. The translator in this case connects multiple endpoints through unicast. This can be implemented using a very simple Transport Translator which, in this document, is called a relay. The relay forwards all traffic it receives, both RTP and RTCP, to all other endpoints. In doing so, a multicast network is emulated without relying on a multicast-capable network infrastructure.",
      "zh-CHS": "另一个翻译器场景如图12所示。在这种情况下，转换器通过单播连接多个端点。这可以使用一个非常简单的传输转换器来实现，在本文档中，它被称为中继。中继将接收到的所有流量（RTP和RTCP）转发到所有其他端点。在这样做的过程中，模拟多播网络而不依赖于支持多播的网络基础设施。"
    },
    {
      "indent": 3,
      "text": "For RTCP feedback, this results in a similar set of considerations to those described in the ASM RTP topology. It also puts some additional signaling requirements onto the session establishment; for example, a common configuration of RTP payload types is required.",
      "zh-CHS": "对于RTCP反馈，这将导致一组与ASM RTP拓扑中描述的类似的注意事项。它还对会话建立提出了一些额外的信令要求；例如，需要RTP有效负载类型的通用配置。"
    },
    {
      "indent": 3,
      "text": "Transport Translators and relays should always consider implementing source address filtering, to prevent attackers from using the listening ports on the translator to inject traffic. The translator can, however, go one step further, especially if explicit SSRC signaling is used, to prevent endpoints from sending SSRCs other than its own (that are, for example, used by other participants in the session). This can improve the security properties of the session, despite the use of group keys that on a cryptographic level allows anyone to impersonate another in the same RTP session.",
      "zh-CHS": "传输翻译器和中继应该总是考虑实现源地址过滤，以防止攻击者使用翻译器上的侦听端口来注入流量。然而，转换器可以更进一步，特别是在使用显式SSRC信令的情况下，以防止端点发送其自身以外的SSRC（例如，会话中的其他参与者使用的SSRC）。这可以改进会话的安全属性，尽管使用了组密钥，在加密级别上允许任何人在同一RTP会话中模拟另一个组密钥。"
    },
    {
      "indent": 3,
      "text": "A translator that doesn't change the RTP/RTCP packet content can be operated without requiring it to have access to the security contexts used to protect the RTP/RTCP traffic between the participants.",
      "zh-CHS": "不改变RTP/RTCP数据包内容的转换器可以在无需访问用于保护参与者之间RTP/RTCP通信的安全上下文的情况下运行。"
    },
    {
      "indent": 0,
      "text": "3.5.2. Media Translator",
      "section_title": true,
      "zh-CHS": "3.5.2. 媒体翻译"
    },
    {
      "indent": 3,
      "text": "In the context of multipoint communications, a Media Translator is not providing new mechanisms to establish a multipoint session. It is more of an enabler, or facilitator, that ensures a given endpoint or a defined subset of endpoints can participate in the session.",
      "zh-CHS": "在多点通信环境中，媒体翻译器不提供建立多点会话的新机制。它更像是一个使能者或促进者，确保给定端点或定义的端点子集可以参与会话。"
    },
    {
      "indent": 3,
      "text": "If endpoint B in Figure 11 were behind a limited network path, the translator may perform media transcoding to allow the traffic received from the other endpoints to reach B without overloading the path. This transcoding can help the other endpoints in the multicast",
      "zh-CHS": "如果图11中的端点B位于有限的网络路径之后，转换器可以执行媒体转码，以允许从其他端点接收的流量到达B，而不会使路径过载。这种转码可以帮助多播中的其他端点"
    },
    {
      "indent": 3,
      "text": "part of the session, by not requiring the quality transmitted by A to be lowered to the bitrates that B is actually capable of receiving (and vice versa).",
      "zh-CHS": "会话的一部分，不要求A发送的质量降低到B实际能够接收的比特率（反之亦然）。"
    },
    {
      "indent": 0,
      "text": "3.6. Point to Multipoint Using the RFC 3550 Mixer Model",
      "section_title": true,
      "zh-CHS": "3.6. 使用RFC 3550混频器模型的点对多点"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Mixer",
      "zh-CHS": "快捷方式名称：Topo Mixer"
    },
    {
      "indent": 3,
      "text": "A mixer is a middlebox that aggregates multiple RTP streams that are part of a session by generating one or more new RTP streams and, in most cases, by manipulating the media data. One common application for a mixer is to allow a participant to receive a session with a reduced amount of resources.",
      "zh-CHS": "混合器是一种中间盒，它通过生成一个或多个新的RTP流以及在大多数情况下通过操纵媒体数据来聚合作为会话一部分的多个RTP流。混合器的一个常见应用是允许参与者以较少的资源量接收会话。"
    },
    {
      "indent": 13,
      "text": "           +-----+\n+---+     /       \\     +-----------+      +---+\n| A |<---/         \\    |           |<---->| B |\n+---+   /   Multi-  \\   |           |      +---+\n       +    cast     +->|   Mixer   |\n+---+   \\  Network  /   |           |      +---+\n| C |<---\\         /    |           |<---->| D |\n+---+     \\       /     +-----------+      +---+\n           +-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Figure 13: Point to Multipoint Using the RFC 3550 Mixer Model",
      "zh-CHS": "图13：使用RFC3550混频器模型的点对多点"
    },
    {
      "indent": 3,
      "text": "A mixer can be viewed as a device terminating the RTP streams received from other endpoints in the same RTP session. Using the media data carried in the received RTP streams, a mixer generates derived RTP streams that are sent to the receiving endpoints.",
      "zh-CHS": "混合器可以被视为在同一RTP会话中终止从其他端点接收的RTP流的设备。使用接收到的RTP流中携带的媒体数据，混合器生成发送到接收端点的导出RTP流。"
    },
    {
      "indent": 3,
      "text": "The content that the mixer provides is the mixed aggregate of what the mixer receives over the PtP or PtM paths, which are part of the same Communication Session.",
      "zh-CHS": "混合器提供的内容是混合器通过PtP或PtM路径接收的内容的混合聚合，PtP或PtM路径是同一通信会话的一部分。"
    },
    {
      "indent": 3,
      "text": "The mixer creates the Media Source and the source RTP stream just like an endpoint, as it mixes the content (often in the uncompressed domain) and then encodes and packetizes it for transmission to a receiving endpoint. The CSRC Count (CC) and CSRC fields in the RTP header can be used to indicate the contributors to the newly generated RTP stream. The SSRCs of the to-be-mixed streams on the mixer input appear as the CSRCs at the mixer output. That output stream uses a unique SSRC that identifies the mixer's stream. The CSRC should be forwarded between the different endpoints to allow for loop detection and identification of sources that are part of the Communication Session. Note that Section 7.1 of RFC 3550 requires",
      "zh-CHS": "混合器就像端点一样创建媒体源和源RTP流，因为它混合内容（通常在未压缩域中），然后对其进行编码和打包，以便传输到接收端点。RTP头中的CSC计数（CC）和CSC字段可用于指示新生成的RTP流的参与者。混合器输入端待混合流的SSRC在混合器输出端显示为CSRC。该输出流使用唯一的SSRC来标识混合器的流。CSC应在不同端点之间转发，以允许循环检测和识别作为通信会话一部分的源。请注意，RFC 3550第7.1节要求"
    },
    {
      "indent": 3,
      "text": "the SSRC space to be shared between domains for these reasons. This also implies that any SDES information normally needs to be forwarded across the mixer.",
      "zh-CHS": "由于这些原因，SSRC空间将在域之间共享。这也意味着任何SDES信息通常需要通过混合器转发。"
    },
    {
      "indent": 3,
      "text": "The mixer is responsible for generating RTCP packets in accordance with its role. It is an RTP receiver and should therefore send RTCP receiver reports for the RTP streams it receives and terminates. In its role as an RTP sender, it should also generate RTCP sender reports for those RTP streams it sends. As specified in Section 7.3 of RFC 3550, a mixer must not forward RTCP unaltered between the two domains.",
      "zh-CHS": "混音器负责根据其角色生成RTCP数据包。它是一个RTP接收器，因此应该为它接收和终止的RTP流发送RTCP接收器报告。作为RTP发送方，它还应该为它发送的RTP流生成RTCP发送方报告。按照RFC 3550第7.3节的规定，混音器不得在两个域之间转发未更改的RTCP。"
    },
    {
      "indent": 3,
      "text": "The mixer depicted in Figure 13 is involved in three domains that need to be separated: the Any-Source Multicast network (including endpoints A and C), endpoint B, and endpoint D. Assuming all four endpoints in the conference are interested in receiving content from all other endpoints, the mixer produces different mixed RTP streams for B and D, as the one to B may contain content received from D, and vice versa. However, the mixer may only need one SSRC per media type in each domain where it is the receiving entity and transmitter of mixed content.",
      "zh-CHS": "图13中所示的混合器涉及三个需要分离的域：任意源多播网络（包括端点A和C）、端点B和端点D。假设会议中的所有四个端点都对从所有其他端点接收内容感兴趣，混合器为B和D生成不同的混合RTP流，因为一到B可能包含从D接收的内容，反之亦然。然而，混音器在作为混合内容的接收实体和发送者的每个域中，每个媒体类型可能只需要一个SSRC。"
    },
    {
      "indent": 3,
      "text": "In the multicast domain, a mixer still needs to provide a mixed view of the other domains. This makes the mixer simpler to implement and avoids any issues with advanced RTCP handling or loop detection, which would be problematic if the mixer were providing non-symmetric behavior. Please see Section 3.11 for more discussion on this topic. The mixing operation, however, in each domain could potentially be different.",
      "zh-CHS": "在多播域中，混合器仍然需要提供其他域的混合视图。这使得混频器的实现更加简单，并避免了高级RTCP处理或循环检测的任何问题，如果混频器提供非对称行为，则会出现问题。有关此主题的更多讨论，请参见第3.11节。然而，每个域中的混合操作可能会有所不同。"
    },
    {
      "indent": 3,
      "text": "A mixer is responsible for receiving RTCP feedback messages and handling them appropriately. The definition of \"appropriate\" depends on the message itself and the context. In some cases, the reception of a codec-control message by the mixer may result in the generation and transmission of RTCP feedback messages by the mixer to the endpoints in the other domain(s). In other cases, a message is handled by the mixer locally and therefore not forwarded to any other domain.",
      "zh-CHS": "混音器负责接收RTCP反馈消息并对其进行适当处理。“适当”的定义取决于信息本身和上下文。在某些情况下，混频器接收编解码器控制消息可能导致混频器生成RTCP反馈消息并将其传输到其他域中的端点。在其他情况下，消息由混合器本地处理，因此不会转发到任何其他域。"
    },
    {
      "indent": 3,
      "text": "When replacing the multicast network in Figure 13 (to the left of the mixer) with individual unicast paths as depicted in Figure 14, the mixer model is very similar to the one discussed in Section 3.9 below. Please see the discussion in Section 3.9 about the differences between these two models.",
      "zh-CHS": "当将图13（混合器左侧）中的多播网络替换为图14中所示的单个单播路径时，混合器模型与下面第3.9节中讨论的模型非常相似。请参见第3.9节中关于这两种模型之间差异的讨论。"
    },
    {
      "indent": 19,
      "text": "+---+      +------------+      +---+\n| A |<---->|            |<---->| B |\n+---+      |            |      +---+\n           |   Mixer    |\n+---+      |            |      +---+\n| C |<---->|            |<---->| D |\n+---+      +------------+      +---+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 14: RTP Mixer with Only Unicast Paths",
      "zh-CHS": "图14：仅具有单播路径的RTP混频器"
    },
    {
      "indent": 3,
      "text": "We now discuss in more detail the different mixing operations that a mixer can perform and how they can affect RTP and RTCP behavior.",
      "zh-CHS": "我们现在更详细地讨论混频器可以执行的不同混合操作，以及它们如何影响RTP和RTCP行为。"
    },
    {
      "indent": 0,
      "text": "3.6.1. Media-Mixing Mixer",
      "section_title": true,
      "zh-CHS": "3.6.1. 介质混合混合器"
    },
    {
      "indent": 3,
      "text": "The Media-Mixing Mixer is likely the one that most think of when they hear the term \"mixer\". Its basic mode of operation is that it receives RTP streams from several endpoints and selects the stream(s) to be included in a media-domain mix. The selection can be through static configuration or by dynamic, content-dependent means such as voice activation. The mixer then creates a single outgoing RTP stream from this mix.",
      "zh-CHS": "媒体混音器很可能是大多数人听到“混音器”这个词时想到的。它的基本操作模式是从多个端点接收RTP流，并选择要包含在媒体域混合中的流。选择可以通过静态配置，也可以通过动态、内容相关的方式，如语音激活。然后，混合器从该混合中创建单个传出RTP流。"
    },
    {
      "indent": 3,
      "text": "The most commonly deployed Media-Mixing Mixer is probably the audio mixer, used in voice conferencing, where the output consists of a mixture of all the input audio signals; this needs minimal signaling to be successfully set up. From a signal processing viewpoint, audio mixing is relatively straightforward and commonly possible for a reasonable number of endpoints. Assume, for example, that one wants to mix N streams from N different endpoints. The mixer needs to decode those N streams, typically into the sample domain, and then produce N or N+1 mixes. Different mixes are needed so that each endpoint gets a mix of all other sources except its own, as this would result in an echo. When N is lower than the number of all endpoints, one may produce a mix of all N streams for the group that are currently not included in the mix; thus, N+1 mixes. These audio streams are then encoded again, RTP packetized, and sent out. In many cases, audio level normalization, noise suppression, and similar signal processing steps are also required or desirable before the actual mixing process commences.",
      "zh-CHS": "最常用的媒体混音器可能是音频混音器，用于语音会议，其中输出包括所有输入音频信号的混合；这需要最少的信令才能成功设置。从信号处理的角度来看，音频混合相对简单，并且通常可能有合理数量的端点。例如，假设要混合来自N个不同端点的N个流。混频器通常需要将这些N个流解码到样本域中，然后产生N个或N+1个混音。需要不同的混合，以便每个端点获得除其自身之外的所有其他源的混合，因为这将导致回声。当N小于所有端点的数目时，可以为当前未包括在混合中的组生成所有N个流的混合；因此，N+1混合。然后，这些音频流被再次编码、RTP打包并发送出去。在许多情况下，在实际混音过程开始之前，还需要或需要音频电平标准化、噪声抑制和类似的信号处理步骤。"
    },
    {
      "indent": 3,
      "text": "In video, the term \"mixing\" has a different interpretation than audio. It is commonly used to refer to the process of spatially combining contributed video streams, which is also known as \"tiling\". The reconstructed, appropriately scaled down videos can be spatially arranged in a set of tiles, with each tile containing the video from an endpoint (typically showing a human participant). Tiles can be of different sizes so that, for example, a particularly important",
      "zh-CHS": "在视频中，“混音”一词的解释与音频不同。它通常用于指在空间上组合贡献的视频流的过程，也被称为“平铺”。重构的、适当缩小的视频可以空间地排列在一组分片中，每个分片包含来自端点的视频（通常显示人类参与者）。瓷砖可以有不同的尺寸，因此，例如，一个"
    },
    {
      "indent": 3,
      "text": "participant, or the loudest speaker, is being shown in a larger tile than other participants. A self-view picture can be included in the tiling, which can be either locally produced or feedback from a mixer-received and reconstructed video image. Such remote loopback allows for confidence monitoring, i.e., it enables the participant to see himself/herself in the same quality as other participants see him/her. The tiling normally operates on reconstructed video in the sample domain. The tiled image is encoded, packetized, and sent by the mixer to the receiving endpoints. It is possible that a middlebox with media mixing duties contains only a single mixer of the aforementioned type, in which case all participants necessarily see the same tiled video, even if it is being sent over different RTP streams. More common, however, are mixing arrangements where an individual mixer is available for each outgoing port of the middlebox, allowing individual compositions for each receiving endpoint (a feature commonly referred to as personalized layout).",
      "zh-CHS": "与其他参与者相比，参与者或最大声的扬声器显示在更大的互动程序中。自视图图片可以包括在平铺中，其可以是本地生成的，也可以是来自混频器接收和重建的视频图像的反馈。这种远程环回允许信心监控，即，它使参与者能够以与其他参与者相同的质量看到自己。平铺通常对样本域中的重建视频进行操作。平铺图像由混合器编码、打包并发送到接收端点。具有媒体混合职责的中间盒可能只包含上述类型的单个混合器，在这种情况下，所有参与者都必须看到相同的平铺视频，即使它是通过不同的RTP流发送的。然而，更常见的是混合布置，其中单个混合器可用于中间盒的每个输出端口，允许每个接收端点的单独合成（通常称为个性化布局的特征）。"
    },
    {
      "indent": 3,
      "text": "One problem with media mixing is that it consumes both large amounts of media processing resources (for the decoding and mixing process in the uncompressed domain) and encoding resources (for the encoding of the mixed signal). Another problem is the quality degradation created by decoding and re-encoding the media, which is the result of the lossy nature of the most commonly used media codecs. A third problem is the latency introduced by the media mixing, which can be substantial and annoyingly noticeable in case of video, or in case of audio if that mixed audio is lip-synchronized with high-latency video. The advantage of media mixing is that it is straightforward for the endpoints to handle the single media stream (which includes the mixed aggregate of many sources), as they don't need to handle multiple decodings, local mixing, and composition. In fact, mixers were introduced in pre-RTP times so that legacy, single stream receiving endpoints (that, in some protocol environments, actually didn't need to be aware of the multipoint nature of the conference) could successfully participate in what a user would recognize as a multiparty video conference.",
      "zh-CHS": "媒体混合的一个问题是，它消耗大量的媒体处理资源（用于未压缩域中的解码和混合过程）和编码资源（用于混合信号的编码）。另一个问题是对媒体进行解码和重新编码所造成的质量下降，这是最常用的媒体编解码器有损特性的结果。第三个问题是媒体混合带来的延迟，在视频的情况下，或者在音频的情况下，如果混合的音频与高延迟视频同步，则延迟可能非常大且令人烦恼。媒体混合的优点是端点可以直接处理单个媒体流（包括多个源的混合聚合），因为它们不需要处理多个解码、本地混合和合成。事实上，混频器是在预RTP时代引入的，因此传统的单流接收端点（在某些协议环境中，实际上不需要知道会议的多点性质）可以成功地参与用户认为是多方视频会议的活动。"
    },
    {
      "indent": 11,
      "text": "+-A---------+          +-MIXER----------------------+\n| +-RTP1----|          |-RTP1------+        +-----+ |\n| | +-Audio-|          |-Audio---+ | +---+  |     | |\n| | |    AA1|--------->|---------+-+-|DEC|->|     | |\n| | |       |<---------|MA1 <----+ | +---+  |     | |\n| | |       |          |(BA1+CA1)|\\| +---+  |     | |\n| | +-------|          |---------+ +-|ENC|<-| B+C | |\n| +---------|          |-----------+ +---+  |     | |\n+-----------+          |                    |     | |\n                       |                    |  M  | |\n+-B---------+          |                    |  E  | |\n| +-RTP2----|          |-RTP2------+        |  D  | |\n| | +-Audio-|          |-Audio---+ | +---+  |  I  | |\n| | |    BA1|--------->|---------+-+-|DEC|->|  A  | |\n| | |       |<---------|MA2 <----+ | +---+  |     | |\n| | +-------|          |(AA1+CA1)|\\| +---+  |     | |\n| +---------|          |---------+ +-|ENC|<-| A+C | |\n+-----------+          |-----------+ +---+  |     | |\n                       |                    |  M  | |\n+-C---------+          |                    |  I  | |\n| +-RTP3----|          |-RTP3------+        |  X  | |\n| | +-Audio-|          |-Audio---+ | +---+  |  E  | |\n| | |    CA1|--------->|---------+-+-|DEC|->|  R  | |\n| | |       |<---------|MA3 <----+ | +---+  |     | |\n| | +-------|          |(AA1+BA1)|\\| +---+  |     | |\n| +---------|          |---------+ +-|ENC|<-| A+B | |\n+-----------+          |-----------+ +---+  +-----+ |\n                       +----------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Figure 15: Session and SSRC Details for Media Mixer",
      "zh-CHS": "图15：媒体混合器的会话和SSRC详细信息"
    },
    {
      "indent": 3,
      "text": "From an RTP perspective, media mixing can be a very simple process, as can be seen in Figure 15. The mixer presents one SSRC towards the receiving endpoint, e.g., MA1 to Peer A, where the associated stream is the media mix of the other endpoints. As each peer, in this example, receives a different version of a mix from the mixer, there is no actual relation between the different RTP sessions in terms of actual media or transport-level information. There are, however, common relationships between RTP1-RTP3, namely SSRC space and identity information. When A receives the MA1 stream, which is a combination of BA1 and CA1 streams, the mixer may include CSRC information in the MA1 stream to identify the Contributing Sources BA1 and CA1, allowing the receiver to identify the Contributing Sources even if this were not possible through the media itself or through other signaling means.",
      "zh-CHS": "从RTP的角度来看，媒体混合可以是一个非常简单的过程，如图15所示。混合器向接收端点呈现一个SSRC，例如，向对等方A呈现MA1，其中相关联的流是其他端点的媒体混合。在本示例中，由于每个对等方从混音器接收不同版本的混音，因此在实际媒体或传输级别信息方面，不同RTP会话之间没有实际关系。然而，RTP1-RTP3之间存在共同的关系，即SSRC空间和身份信息。当A接收到作为BA1和CA1流的组合的MA1流时，混频器可以在MA1流中包括csc信息以识别贡献源BA1和CA1，允许接收机识别贡献源，即使这不可能通过媒体本身或通过其他信令手段实现。"
    },
    {
      "indent": 3,
      "text": "The CSRC has, in turn, utility in RTP extensions, like the RTP header extension for Mixer-to-Client Audio Level Indication [RFC6465]. If",
      "zh-CHS": "反过来，CSC在RTP扩展中具有实用性，如用于混音器到客户端音频电平指示的RTP头扩展[RFC6465]。如果"
    },
    {
      "indent": 3,
      "text": "the SSRCs from the endpoint to mixer paths are used as CSRCs in another RTP session, then RTP1, RTP2, and RTP3 become one joint session as they have a common SSRC space. At this stage, the mixer also needs to consider which RTCP information it needs to expose in the different paths. In the above scenario, a mixer would normally expose nothing more than the SDES information and RTCP BYE for a CSRC leaving the session. The main goal would be to enable the correct binding against the application logic and other information sources. This also enables loop detection in the RTP session.",
      "zh-CHS": "从端点到混合器路径的SSRC在另一个RTP会话中用作CSRC，然后RTP1、RTP2和RTP3成为一个联合会话，因为它们具有公共SSRC空间。在这个阶段，混频器还需要考虑它需要在不同路径中暴露的RTCP信息。在上述场景中，混合器通常只会公开SDES信息和RTCP BYE，以便CSC离开会话。主要目标是针对应用程序逻辑和其他信息源启用正确的绑定。这还可以在RTP会话中启用循环检测。"
    },
    {
      "indent": 0,
      "text": "3.6.2. Media-Switching Mixer",
      "section_title": true,
      "zh-CHS": "3.6.2. 媒体交换混频器"
    },
    {
      "indent": 3,
      "text": "Media-Switching Mixers are used in limited functionality scenarios where no, or only very limited, concurrent presentation of multiple sources is required by the application and also in more complex multi-stream usages with receiver mixing or tiling, including combined with simulcast and/or scalability between source and mixer. An RTP mixer based on media switching avoids the media decoding and encoding operations in the mixer, as it conceptually forwards the encoded media stream as it was being sent to the mixer. It does not avoid, however, the decryption and re-encryption cycle as it rewrites RTP headers. Forwarding media (in contrast to reconstructing-mixing-encoding media) reduces the amount of computational resources needed in the mixer and increases the media quality (both in terms of fidelity and reduced latency).",
      "zh-CHS": "媒体切换混频器用于应用程序不需要或仅需要非常有限的多个源的并发呈现的有限功能场景中，也可用于接收器混音或平铺的更复杂的多流使用中，包括与同步广播和/或源和混频器之间的可伸缩性相结合。基于媒体切换的RTP混频器避免了混频器中的媒体解码和编码操作，因为从概念上讲，它在将编码的媒体流发送到混频器时转发编码的媒体流。但是，在重写RTP报头时，它不会避免解密和重新加密循环。转发媒体（与重构混合编码媒体相反）减少了混频器中所需的计算资源量，并提高了媒体质量（在保真度和减少延迟方面）。"
    },
    {
      "indent": 3,
      "text": "A Media-Switching Mixer maintains a pool of SSRCs representing conceptual or functional RTP streams that the mixer can produce. These RTP streams are created by selecting media from one of the RTP streams received by the mixer and forwarded to the peer using the mixer's own SSRCs. The mixer can switch between available sources if that is required by the concept for the source, like the currently active speaker. Note that the mixer, in most cases, still needs to perform a certain amount of media processing, as many media formats do not allow to \"tune into\" the stream at arbitrary points in their bitstream.",
      "zh-CHS": "媒体交换混合器维护一个SSRC池，表示混合器可以产生的概念性或功能性RTP流。这些RTP流是通过从混合器接收的RTP流之一中选择媒体创建的，并使用混合器自己的SSRC转发给对等方。混音器可以在可用声源之间切换，如果该声源的概念需要，例如当前活动的扬声器。注意，在大多数情况下，混频器仍然需要执行一定量的媒体处理，因为许多媒体格式不允许在其比特流中的任意点“调谐”到流中。"
    },
    {
      "indent": 3,
      "text": "To achieve a coherent RTP stream from the mixer's SSRC, the mixer needs to rewrite the incoming RTP packet's header. First, the SSRC field must be set to the value of the mixer's SSRC. Second, the sequence number must be the next in the sequence of outgoing packets it sent. Third, the RTP timestamp value needs to be adjusted using an offset that changes each time one switches the Media Source. Finally, depending on the negotiation of the RTP payload type, the value representing this particular RTP payload configuration may have to be changed if the different endpoint-to-mixer paths have not arrived on the same numbering for a given configuration. This also",
      "zh-CHS": "为了从混频器的SSRC获得一致的RTP流，混频器需要重写传入RTP包的报头。首先，SSRC字段必须设置为混合器的SSRC值。其次，序列号必须是它发送的传出数据包序列中的下一个。第三，RTP时间戳值需要使用每次切换媒体源时更改的偏移量进行调整。最后，根据RTP有效负载类型的协商，如果不同端点到混频器路径没有到达给定配置的相同编号，则表示该特定RTP有效负载配置的值可能必须改变。这也"
    },
    {
      "indent": 3,
      "text": "requires that the different endpoints support a common set of codecs, otherwise media transcoding for codec compatibility would still be required.",
      "zh-CHS": "要求不同的端点支持一组通用的编解码器，否则仍然需要进行媒体转码以实现编解码器兼容性。"
    },
    {
      "indent": 3,
      "text": "We now consider the operation of a Media-Switching Mixer that supports a video conference with six participating endpoints (A-F) where the two most recent speakers in the conference are shown to each receiving endpoint. Thus, the mixer has two SSRCs sending video to each peer, and each peer is capable of locally handling two video streams simultaneously.",
      "zh-CHS": "现在我们考虑一个媒体交换混频器的操作，它支持六个参与端点（AF）的视频会议，其中会议中的两个最近的发言者被显示给每个接收端点。因此，混频器具有向每个对等方发送视频的两个ssrc，并且每个对等方能够同时本地处理两个视频流。"
    },
    {
      "indent": 9,
      "text": "+-A---------+             +-MIXER----------------------+\n| +-RTP1----|             |-RTP1------+        +-----+ |\n| | +-Video-|             |-Video---+ |        |     | |\n| | |    AV1|------------>|---------+-+------->|  S  | |\n| | |       |<------------|MV1 <----+-+-BV1----|  W  | |\n| | |       |<------------|MV2 <----+-+-EV1----|  I  | |\n| | +-------|             |---------+ |        |  T  | |\n| +---------|             |-----------+        |  C  | |\n+-----------+             |                    |  H  | |\n                          |                    |     | |\n+-B---------+             |                    |  M  | |\n| +-RTP2----|             |-RTP2------+        |  A  | |\n| | +-Video-|             |-Video---+ |        |  T  | |\n| | |    BV1|------------>|---------+-+------->|  R  | |\n| | |       |<------------|MV3 <----+-+-AV1----|  I  | |\n| | |       |<------------|MV4 <----+-+-EV1----|  X  | |\n| | +-------|             |---------+ |        |     | |\n| +---------|             |-----------+        |     | |\n+-----------+             |                    |     | |\n                          :                    :     : :\n                          :                    :     : :\n+-F---------+             |                    |     | |\n| +-RTP6----|             |-RTP6------+        |     | |\n| | +-Video-|             |-Video---+ |        |     | |\n| | |    FV1|------------>|---------+-+------->|     | |\n| | |       |<------------|MV11 <---+-+-AV1----|     | |\n| | |       |<------------|MV12 <---+-+-EV1----|     | |\n| | +-------|             |---------+ |        |     | |\n| +---------|             |-----------+        +-----+ |\n+-----------+             +----------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Figure 16: Media-Switching RTP Mixer",
      "zh-CHS": "图16：媒体切换RTP混频器"
    },
    {
      "indent": 3,
      "text": "The Media-Switching Mixer can, similarly to the Media-Mixing Mixer, reduce the bitrate required for media transmission towards the different peers by selecting and forwarding only a subset of RTP streams it receives from the sending endpoints. In case the mixer receives simulcast transmissions or a scalable encoding of the Media Source, the mixer has more degrees of freedom to select streams or subsets of streams to forward to a receiving endpoint, both based on transport or endpoint restrictions as well as application logic.",
      "zh-CHS": "与媒体混合混合器类似，媒体切换混合器可以通过仅选择和转发其从发送端点接收的RTP流的子集来降低向不同对等方的媒体传输所需的比特率。在混频器接收到媒体源的同播传输或可伸缩编码的情况下，混频器具有更多的自由度来选择要转发到接收端点的流或流子集，这两者都基于传输或端点限制以及应用逻辑。"
    },
    {
      "indent": 3,
      "text": "To ensure that a media receiver in an endpoint can correctly decode the media in the RTP stream after a switch, a codec that uses temporal prediction needs to start its decoding from independent refresh points, or points in the bitstream offering similar functionality (like \"dirty refresh points\"). For some codecs, for example, frame-based speech and audio codecs, this is easily achieved by starting the decoding at RTP packet boundaries, as each packet boundary provides a refresh point (assuming proper packetization on the encoder side). For other codecs, particularly in video, refresh points are less common in the bitstream or may not be present at all without an explicit request to the respective encoder. The Full Intra Request [RFC5104] RTCP codec control message has been defined for this purpose.",
      "zh-CHS": "为确保端点中的媒体接收器在切换后能够正确解码RTP流中的媒体，使用时间预测的编解码器需要从独立刷新点或比特流中提供类似功能的点（如“脏刷新点”）开始解码。对于一些编解码器，例如，基于帧的语音和音频编解码器，这可以通过在RTP数据包边界处开始解码来轻松实现，因为每个数据包边界都提供了一个刷新点（假设在编码器端进行了适当的包化）。对于其他编解码器，特别是在视频中，刷新点在比特流中不太常见，或者如果没有对相应编码器的明确请求，刷新点可能根本不存在。已为此目的定义了完整的内部请求[RFC5104]RTCP编解码器控制消息。"
    },
    {
      "indent": 3,
      "text": "In this type of mixer, one could consider fully terminating the RTP sessions between the different endpoint and mixer paths. The same arguments and considerations as discussed in Section 3.9 need to be taken into consideration and apply here.",
      "zh-CHS": "在这种类型的混频器中，可以考虑完全终止不同端点和混频器路径之间的RTP会话。需要考虑第3.9节中讨论的相同论点和考虑因素，并在此处适用。"
    },
    {
      "indent": 0,
      "text": "3.7. Selective Forwarding Middlebox",
      "section_title": true,
      "zh-CHS": "3.7. 选择性转发中间盒"
    },
    {
      "indent": 3,
      "text": "Another method for handling media in the RTP mixer is to \"project\", or make available, all potential RTP sources (SSRCs) into a per-endpoint, independent RTP session. The middlebox can select which of the potential sources that are currently actively transmitting media will be sent to each of the endpoints. This is similar to the Media-Switching Mixer but has some important differences in RTP details.",
      "zh-CHS": "在RTP混合器中处理介质的另一种方法是将所有潜在的RTP源（SSRC）“投影”到每个端点的独立RTP会话中。中间盒可以选择当前正在积极传输媒体的潜在源中的哪些将被发送到每个端点。这类似于媒体切换混音器，但在RTP细节方面有一些重要的区别。"
    },
    {
      "indent": 10,
      "text": "+-A---------+             +-Middlebox-----------------+\n| +-RTP1----|             |-RTP1------+       +-----+ |\n| | +-Video-|             |-Video---+ |       |     | |\n| | |    AV1|------------>|---------+-+------>|     | |\n| | |       |<------------|BV1 <----+-+-------|  S  | |\n| | |       |<------------|CV1 <----+-+-------|  W  | |\n| | |       |<------------|DV1 <----+-+-------|  I  | |\n| | |       |<------------|EV1 <----+-+-------|  T  | |\n| | |       |<------------|FV1 <----+-+-------|  C  | |\n| | +-------|             |---------+ |       |  H  | |\n| +---------|             |-----------+       |     | |\n+-----------+             |                   |  M  | |\n                          |                   |  A  | |\n+-B---------+             |                   |  T  | |\n| +-RTP2----|             |-RTP2------+       |  R  | |\n| | +-Video-|             |-Video---+ |       |  I  | |\n| | |    BV1|------------>|---------+-+------>|  X  | |\n| | |       |<------------|AV1 <----+-+-------|     | |\n| | |       |<------------|CV1 <----+-+-------|     | |\n| | |       | :    :    : |: :  : : : : :  : :|     | |\n| | |       |<------------|FV1 <----+-+-------|     | |\n| | +-------|             |---------+ |       |     | |\n| +---------|             |-----------+       |     | |\n+-----------+             |                   |     | |\n                          :                   :     : :\n                          :                   :     : :\n+-F---------+             |                   |     | |\n| +-RTP6----|             |-RTP6------+       |     | |\n| | +-Video-|             |-Video---+ |       |     | |\n| | |    FV1|------------>|---------+-+------>|     | |\n| | |       |<------------|AV1 <----+-+-------|     | |\n| | |       | :    :    : |: :  : : : : :  : :|     | |\n| | |       |<------------|EV1 <----+-+-------|     | |\n| | +-------|             |---------+ |       |     | |\n| +---------|             |-----------+       +-----+ |\n+-----------+             +---------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 17: Selective Forwarding Middlebox",
      "zh-CHS": "图17：选择性转发中间盒"
    },
    {
      "indent": 3,
      "text": "In the six endpoint conference depicted above (in Figure 17), one can see that endpoint A is aware of five incoming SSRCs, BV1-FV1. If this middlebox intends to have a similar behavior as in Section 3.6.2 where the mixer provides the endpoints with the two latest speaking endpoints, then only two out of these five SSRCs need concurrently transmit media to A. As the middlebox selects the source in the different RTP sessions that transmit media to the endpoints, each RTP stream requires the rewriting of certain RTP header fields when being projected from one session into another. In particular, the sequence",
      "zh-CHS": "在上面描述的六个端点会议（图17）中，可以看到端点A知道五个传入的SSRC BV1-FV1。如果该中间盒打算具有与第3.6.2节中类似的行为，其中混音器向端点提供两个最新讲话端点，则这五个SSRC中只有两个需要同时向a传输媒体。由于中间盒在向端点传输媒体的不同RTP会话中选择源，当从一个会话投影到另一个会话时，每个RTP流都需要重写某些RTP头字段。特别是序列"
    },
    {
      "indent": 3,
      "text": "number needs to be consecutively incremented based on the packet actually being transmitted in each RTP session. Therefore, the RTP sequence number offset will change each time a source is turned on in an RTP session. The timestamp (possibly offset) stays the same.",
      "zh-CHS": "数字需要根据每个RTP会话中实际传输的数据包连续递增。因此，每次在RTP会话中打开源时，RTP序列号偏移量都会改变。时间戳（可能是偏移量）保持不变。"
    },
    {
      "indent": 3,
      "text": "The RTP sessions can be considered independent, resulting in that the SSRC numbers used can also be handled independently. This simplifies the SSRC collision detection and avoidance but requires tools such as remapping tables between the RTP sessions. Using independent RTP sessions is not required, as it is possible for the switching behavior to also perform with a common SSRC space. However, in this case, collision detection and handling becomes a different problem. It is up to the implementation to use a single common SSRC space or separate ones.",
      "zh-CHS": "RTP会话可以被认为是独立的，因此使用的SSRC号也可以独立处理。这简化了SSRC冲突检测和避免，但需要诸如在RTP会话之间重新映射表之类的工具。不需要使用独立的RTP会话，因为切换行为也可以在公共SSRC空间中执行。然而，在这种情况下，碰撞检测和处理成为一个不同的问题。由实现使用单个公共SSRC空间或单独的SSRC空间。"
    },
    {
      "indent": 3,
      "text": "Using separate SSRC spaces has some implications. For example, the RTP stream that is being sent by endpoint B to the middlebox (BV1) may use an SSRC value of 12345678. When that RTP stream is sent to endpoint F by the middlebox, it can use any SSRC value, e.g., 87654321. As a result, each endpoint may have a different view of the application usage of a particular SSRC. Any RTP-level identity information, such as SDES items, also needs to update the SSRC referenced, if the included SDES items are intended to be global. Thus, the application must not use SSRC as references to RTP streams when communicating with other peers directly. This also affects loop detection, which will fail to work as there is no common namespace and identities across the different legs in the Communication Session on the RTP level. Instead, this responsibility falls onto higher layers.",
      "zh-CHS": "使用单独的SSRC空间有一些含义。例如，由端点B发送到中间盒（BV1）的RTP流可以使用SSRC值12345678。当该RTP流通过中间盒发送到端点F时，它可以使用任何SSRC值，例如87654321。因此，每个端点可能对特定SSRC的应用程序使用有不同的看法。如果包含的SDES项目是全局的，则任何RTP级标识信息（如SDES项目）也需要更新引用的SSRC。因此，当与其他对等方直接通信时，应用程序不得将SSRC用作RTP流的引用。这也会影响循环检测，这将无法工作，因为在RTP级别的通信会话中，不同分支之间没有公共名称空间和标识。相反，这一责任落在了更高的层次上。"
    },
    {
      "indent": 3,
      "text": "The middlebox is also responsible for receiving any RTCP codec control requests coming from an endpoint and deciding if it can act on the request locally or needs to translate the request into the RTP session/transport leg that contains the Media Source. Both endpoints and the middlebox need to implement conference-related codec control functionalities to provide a good experience. Commonly used are Full Intra Request to request from the Media Source that switching points be provided between the sources and Temporary Maximum Media Bitrate Request (TMMBR) to enable the middlebox to aggregate congestion control responses towards the Media Source so to enable it to adjust its bitrate (obviously, only in case the limitation is not in the source to middlebox link).",
      "zh-CHS": "中间盒还负责接收来自端点的任何RTCP编解码器控制请求，并决定是否可以在本地对该请求采取行动，或者是否需要将该请求转换为包含媒体源的RTP会话/传输段。端点和中间盒都需要实现与会议相关的编解码器控制功能，以提供良好的体验。通常使用的是从媒体源发出的在源之间提供切换点的完整内部请求和临时最大媒体比特率请求（TMMBR），以使中间盒能够聚合对媒体源的拥塞控制响应，从而使其能够调整其比特率（显然，只有在源到中间包链接中没有限制的情况下）。"
    },
    {
      "indent": 3,
      "text": "The Selective Forwarding Middlebox has been introduced in recently developed videoconferencing systems in conjunction with, and to capitalize on, scalable video coding as well as simulcasting. An example of scalable video coding is Annex G of H.264, but other codecs, including H.264 AVC and VP8, also exhibit scalability, albeit",
      "zh-CHS": "最近开发的视频会议系统中引入了选择性转发中间盒，它与可伸缩视频编码以及同步广播结合使用，并充分利用了可伸缩视频编码和同步广播。可伸缩视频编码的一个示例是H.264的附录G，但其他编解码器，包括H.264 AVC和VP8，也表现出可伸缩性，尽管如此"
    },
    {
      "indent": 3,
      "text": "only in the temporal dimension. In both scalable coding and simulcast cases, the video signal is represented by a set of two or more bitstreams, providing a corresponding number of distinct fidelity points. The middlebox selects which parts of a scalable bitstream (or which bitstream, in the case of simulcasting) to forward to each of the receiving endpoints. The decision may be driven by a number of factors, such as available bitrate, desired layout, etc. Contrary to transcoding MCUs, SFMs have extremely low delay and provide features that are typically associated with high-end systems (personalized layout, error localization) without any signal processing at the middlebox. They are also capable of scaling to a large number of concurrent users, and--due to their very low delay--can also be cascaded.",
      "zh-CHS": "只有在时间维度。在可伸缩编码和同步广播两种情况下，视频信号由一组两个或多个比特流表示，提供相应数量的不同保真度点。中间盒选择可伸缩比特流的哪些部分（或者在同步广播的情况下选择哪个比特流）转发给每个接收端点。决策可能由许多因素驱动，例如可用比特率、所需布局等。与转码MCU相反，SFM具有极低的延迟，并提供通常与高端系统相关联的特性（个性化布局、错误定位），而无需在中间盒处进行任何信号处理。它们还能够扩展到大量并发用户，并且由于延迟非常低，还可以级联。"
    },
    {
      "indent": 3,
      "text": "This version of the middlebox also puts different requirements on the endpoint when it comes to decoder instances and handling of the RTP streams providing media. As each projected SSRC can, at any time, provide media, the endpoint either needs to be able to handle as many decoder instances as the middlebox received, or have efficient switching of decoder contexts in a more limited set of actual decoder instances to cope with the switches. The application also gets more responsibility to update how the media provided is to be presented to the user.",
      "zh-CHS": "当涉及到解码器实例和提供媒体的RTP流的处理时，该版本的中间件还对端点提出了不同的要求。由于每个投影的SSRC可以在任何时候提供媒体，端点或者需要能够处理与所接收的中间盒一样多的解码器实例，或者在更有限的一组实际解码器实例中具有解码器上下文的有效切换以应对切换。应用程序也有更多的责任更新如何向用户呈现所提供的媒体。"
    },
    {
      "indent": 3,
      "text": "Note that this topology could potentially be seen as a Media Translator that includes an on/off logic as part of its media translation. The topology has the property that all SSRCs present in the session are visible to an endpoint. It also has mixer aspects, as the streams it provides are not basically translated versions, but instead they have conceptual property assigned to them and can be both turned on/off as well as fully or partially delivered. Thus, this topology appears to be some hybrid between the translator and mixer model.",
      "zh-CHS": "请注意，此拓扑可能被视为一个媒体转换器，其中包含一个开/关逻辑作为其媒体转换的一部分。拓扑的属性是会话中存在的所有SSRC对端点可见。它还具有混音器特性，因为它提供的流基本上不是翻译版本，而是具有分配给它们的概念属性，可以打开/关闭，也可以完全或部分交付。因此，这种拓扑结构似乎是转换器和混音器模型之间的某种混合。"
    },
    {
      "indent": 3,
      "text": "The differences between a Selective Forwarding Middlebox and a Switching-Media Mixer (Section 3.6.2) are minor, and they share most properties. The above requirement on having a large number of decoding instances or requiring efficient switching of decoder contexts, are one point of difference. The other is how the identification is performed, where the mixer uses CSRC to provide information on what is included in a particular RTP stream that represents a particular concept. Selective forwarding gets the source information through the SSRC and instead uses other mechanisms to indicate the streams intended usage, if needed.",
      "zh-CHS": "选择性转发中间盒和交换媒体混频器（第3.6.2节）之间的区别很小，它们具有大多数相同的特性。上述关于具有大量解码实例或需要高效切换解码器上下文的要求是一个不同点。另一个是如何执行识别，其中混频器使用csc来提供关于在表示特定概念的特定RTP流中包括什么的信息。选择性转发通过SSRC获取源信息，并使用其他机制指示流的预期用途（如果需要）。"
    },
    {
      "indent": 0,
      "text": "3.8. Point to Multipoint Using Video-Switching MCUs",
      "section_title": true,
      "zh-CHS": "3.8. 使用视频交换MCU的点对多点"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Video-switch-MCU",
      "zh-CHS": "快捷方式名称：Topo视频开关MCU"
    },
    {
      "indent": 19,
      "text": "+---+      +------------+      +---+\n| A |------| Multipoint |------| B |\n+---+      |  Control   |      +---+\n           |   Unit     |\n+---+      |   (MCU)    |      +---+\n| C |------|            |------| D |\n+---+      +------------+      +---+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Figure 18: Point to Multipoint Using a Video-Switching MCU",
      "zh-CHS": "图18：使用视频切换MCU的点对多点"
    },
    {
      "indent": 3,
      "text": "This PtM topology was popular in early implementations of multipoint videoconferencing systems due to its simplicity, and the corresponding middlebox design has been known as a \"video-switching MCU\". The more complex RTCP-terminating MCUs, discussed in the next section, became the norm, however, when technology allowed implementations at acceptable costs.",
      "zh-CHS": "由于其简单性，这种PtM拓扑在多点视频会议系统的早期实现中很流行，相应的中间盒设计被称为“视频交换MCU”。然而，当技术允许以可接受的成本实施时，下一节讨论的更复杂的RTCP端接MCU成为标准。"
    },
    {
      "indent": 3,
      "text": "A video-switching MCU forwards to a participant a single media stream, selected from the available streams. The criteria for selection are often based on voice activity in the audio-visual conference, but other conference management mechanisms (like presentation mode or explicit floor control) are known to exist as well.",
      "zh-CHS": "视频交换MCU将从可用流中选择的单个媒体流转发给参与者。选择标准通常基于视听会议中的语音活动，但也存在其他会议管理机制（如演示模式或显式楼层控制）。"
    },
    {
      "indent": 3,
      "text": "The video-switching MCU may also perform media translation to modify the content in bitrate, encoding, or resolution. However, it still may indicate the original sender of the content through the SSRC. In this case, the values of the CC and CSRC fields are retained.",
      "zh-CHS": "视频切换MCU还可以执行媒体翻译以修改比特率、编码或分辨率中的内容。但是，它仍然可以通过SSRC指示内容的原始发件人。在这种情况下，保留CC和CSC字段的值。"
    },
    {
      "indent": 3,
      "text": "If not terminating RTP, the RTCP sender reports are forwarded for the currently selected sender. All RTCP receiver reports are freely forwarded between the endpoints. In addition, the MCU may also originate RTCP control traffic in order to control the session and/or report on status from its viewpoint.",
      "zh-CHS": "如果未终止RTP，则为当前选定的发送方转发RTCP发送方报告。所有RTCP接收器报告在端点之间自由转发。此外，MCU还可以发起RTCP控制通信量，以便从其角度控制会话和/或报告状态。"
    },
    {
      "indent": 3,
      "text": "The video-switching MCU has most of the attributes of a translator. However, its stream selection is a mixing behavior. This behavior has some RTP and RTCP issues associated with it. The suppression of all but one RTP stream results in most participants seeing only a subset of the sent RTP streams at any given time, often a single RTP stream per conference. Therefore, RTCP receiver reports only report on these RTP streams. Consequently, the endpoints emitting RTP streams that are not currently forwarded receive a view of the session that indicates their RTP streams disappear somewhere en",
      "zh-CHS": "视频切换MCU具有翻译器的大部分属性。然而，其流选择是一种混合行为。此行为有一些与之相关的RTP和RTCP问题。抑制除一个RTP流之外的所有RTP流导致大多数参与者在任何给定时间仅看到发送的RTP流的一个子集，通常每个会议只有一个RTP流。因此，RTCP接收器只报告这些RTP流。因此，发出当前未转发的RTP流的端点接收到会话的视图，该视图指示它们的RTP流在某个地方消失"
    },
    {
      "indent": 3,
      "text": "route. This makes the use of RTCP for congestion control, or any type of quality reporting, very problematic.",
      "zh-CHS": "路线这使得使用RTCP进行拥塞控制或任何类型的质量报告都非常困难。"
    },
    {
      "indent": 3,
      "text": "To avoid the aforementioned issues, the MCU needs to implement two features. First, it needs to act as a mixer (see Section 3.6) and forward the selected RTP stream under its own SSRC and with the appropriate CSRC values. Second, the MCU needs to modify the RTCP RRs it forwards between the domains. As a result, it is recommended that one implement a centralized video-switching conference using a mixer according to RFC 3550, instead of the shortcut implementation described here.",
      "zh-CHS": "为了避免上述问题，MCU需要实现两个功能。首先，它需要充当混合器（参见第3.6节），并在其自身的SSRC和适当的CSC值下转发所选RTP流。其次，MCU需要修改它在域之间转发的RTCP RRs。因此，建议根据RFC 3550使用混音器实现集中式视频交换会议，而不是此处描述的快捷方式实现。"
    },
    {
      "indent": 0,
      "text": "3.9. Point to Multipoint Using RTCP-Terminating MCU",
      "section_title": true,
      "zh-CHS": "3.9. 使用RTCP端接MCU的点对多点"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-RTCP-terminating-MCU",
      "zh-CHS": "快捷方式名称：Topo RTCP终止MCU"
    },
    {
      "indent": 19,
      "text": "+---+      +------------+      +---+\n| A |<---->| Multipoint |<---->| B |\n+---+      |  Control   |      +---+\n           |   Unit     |\n+---+      |   (MCU)    |      +---+\n| C |<---->|            |<---->| D |\n+---+      +------------+      +---+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Figure 19: Point to Multipoint Using Content Modifying MCUs",
      "zh-CHS": "图19：使用内容修改MCU的点对多点"
    },
    {
      "indent": 3,
      "text": "In this PtM scenario, each endpoint runs an RTP point-to-point session between itself and the MCU. This is a very commonly deployed topology in multipoint video conferencing. The content that the MCU provides to each participant is either:",
      "zh-CHS": "在这个PtM场景中，每个端点在自身和MCU之间运行一个RTP点对点会话。这是多点视频会议中非常常见的部署拓扑。MCU向每个参与者提供的内容为："
    },
    {
      "indent": 3,
      "text": "a. a selection of the content received from the other endpoints or",
      "zh-CHS": "a. 从其他端点接收的内容选择，或"
    },
    {
      "indent": 3,
      "text": "b. the mixed aggregate of what the MCU receives from the other PtP paths, which are part of the same Communication Session.",
      "zh-CHS": "b. MCU从属于同一通信会话的其他PtP路径接收的内容的混合集合。"
    },
    {
      "indent": 3,
      "text": "In case (a), the MCU may modify the content in terms of bitrate, encoding format, or resolution. No explicit RTP mechanism is used to establish the relationship between the original RTP stream of the media being sent and the RTP stream the MCU sends. In other words, the outgoing RTP streams typically use a different SSRC, and may well use a different payload type (PT), even if this different PT happens to be mapped to the same media type. This is a result of the individually negotiated RTP session for each endpoint.",
      "zh-CHS": "在情况（a）中，MCU可以根据比特率、编码格式或分辨率修改内容。没有使用明确的RTP机制来建立所发送媒体的原始RTP流与MCU发送的RTP流之间的关系。换句话说，输出RTP流通常使用不同的SSRC，并且很可能使用不同的有效负载类型（PT），即使该不同的PT恰好映射到相同的媒体类型。这是每个端点单独协商RTP会话的结果。"
    },
    {
      "indent": 3,
      "text": "In case (b), the MCU is the Media Source and generates the Source RTP Stream as it mixes the received content and then encodes and packetizes it for transmission to an endpoint. According to RTP",
      "zh-CHS": "在情况（b）中，MCU是媒体源，在混合接收到的内容时生成源RTP流，然后对其进行编码和打包以传输到端点。根据RTP"
    },
    {
      "indent": 3,
      "text": "[RFC3550], the SSRC of the contributors are to be signaled using the CSRC/CC mechanism. In practice, today, most deployed MCUs do not implement this feature. Instead, the identification of the endpoints whose content is included in the mixer's output is not indicated through any explicit RTP mechanism. That is, most deployed MCUs set the CC field in the RTP header to zero, thereby indicating no available CSRC information, even if they could identify the original sending endpoints as suggested in RTP.",
      "zh-CHS": "[RFC3550]，投稿人的SSRC将使用CSC/CC机制发出信号。实际上，目前大多数部署的MCU都没有实现此功能。相反，其内容包含在混合器输出中的端点的标识不是通过任何显式RTP机制来指示的。也就是说，大多数部署的MCU将RTP报头中的CC字段设置为零，从而表明没有可用的CSC信息，即使它们可以按照RTP中的建议识别原始发送端点。"
    },
    {
      "indent": 3,
      "text": "The main feature that sets this topology apart from what RFC 3550 describes is the breaking of the common RTP session across the centralized device, such as the MCU. This results in the loss of explicit RTP-level indication of all participants. If one were using the mechanisms available in RTP and RTCP to signal this explicitly, the topology would follow the approach of an RTP mixer. The lack of explicit indication has at least the following potential problems:",
      "zh-CHS": "将此拓扑与RFC 3550描述的拓扑区别开来的主要功能是在集中式设备（如MCU）上中断公共RTP会话。这会导致所有参与者失去明确的RTP水平指示。如果使用RTP和RTCP中可用的机制来显式地发出信号，则拓扑结构将遵循RTP混频器的方法。缺乏明确指示至少有以下潜在问题："
    },
    {
      "indent": 3,
      "text": "1. Loop detection cannot be performed on the RTP level. When carelessly connecting two misconfigured MCUs, a loop could be generated.",
      "zh-CHS": "1. 无法在RTP级别上执行循环检测。当不小心连接两个配置错误的MCU时，可能会生成循环。"
    },
    {
      "indent": 3,
      "text": "2. There is no information about active media senders available in the RTP packet. As this information is missing, receivers cannot use it. It also deprives the client of information related to currently active senders in a machine-usable way, thus preventing clients from indicating currently active speakers in user interfaces, etc.",
      "zh-CHS": "2. RTP数据包中没有关于活动媒体发送器的信息。由于缺少此信息，接收者无法使用它。它还以机器可用的方式剥夺客户端与当前活动发送者相关的信息，从而防止客户端在用户界面中指示当前活动的扬声器等。"
    },
    {
      "indent": 3,
      "text": "Note that many/most deployed MCUs (and video conferencing endpoints) rely on signaling-layer mechanisms for the identification of the Contributing Sources, for example, a SIP conferencing package [RFC4575]. This alleviates, to some extent, the aforementioned issues resulting from ignoring RTP's CSRC mechanism.",
      "zh-CHS": "注意，许多/大多数部署的MCU（和视频会议端点）依赖信令层机制来识别贡献源，例如，SIP会议包[RFC4575]。这在一定程度上缓解了由于忽视RTP的证监会机制而导致的上述问题。"
    },
    {
      "indent": 0,
      "text": "3.10. Split Component Terminal",
      "section_title": true,
      "zh-CHS": "3.10. 分体式终端"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Split-Terminal",
      "zh-CHS": "快捷方式名称：拓扑拆分端子"
    },
    {
      "indent": 3,
      "text": "In some applications, for example, in some telepresence systems, terminals may not be integrated into a single functional unit but composed of more than one subunits. For example, a telepresence room terminal employing multiple cameras and monitors may consist of multiple video conferencing subunits, each capable of handling a single camera and monitor. Another example would be a video conferencing terminal in which audio is handled by one subunit, and video by another. Each of these subunits uses its own physical network interface (for example: Ethernet jack) and network address.",
      "zh-CHS": "在一些应用中，例如，在一些临场感系统中，终端可能不集成到单个功能单元中，而是由多个子单元组成。例如，采用多个摄像机和监视器的远程呈现室终端可以由多个视频会议子单元组成，每个子单元能够处理单个摄像机和监视器。另一个例子是视频会议终端，其中音频由一个子单元处理，视频由另一个子单元处理。每个子单元都使用自己的物理网络接口（例如：以太网接口）和网络地址。"
    },
    {
      "indent": 3,
      "text": "The various (media processing) subunits need (logically and physically) to be interconnected by control functionality, but their media plane functionality may be split. These types of terminals are referred to as split component terminals. Historically, the earliest split component terminals were perhaps the independent audio and video conference software tools used over the MBONE in the late 1990s.",
      "zh-CHS": "各种（媒体处理）子单元需要（逻辑上和物理上）通过控制功能互连，但它们的媒体平面功能可能会被拆分。这些类型的端子称为拆分元件端子。历史上，最早的分离组件终端可能是20世纪90年代末MBONE上使用的独立音频和视频会议软件工具。"
    },
    {
      "indent": 3,
      "text": "An example for such a split component terminal is depicted in Figure 20. Within split component terminal A, at least audio and video subunits are addressed by their own network addresses. In some of these systems, the control stack subunit may also have its own network address.",
      "zh-CHS": "图20中描述了此类拆分组件终端的示例。在分离组件终端A内，至少音频和视频子单元由它们自己的网络地址寻址。在其中一些系统中，控制堆栈子单元也可能有自己的网络地址。"
    },
    {
      "indent": 3,
      "text": "From an RTP viewpoint, each of the subunits terminates RTP and acts as an endpoint in the sense that each subunit includes its own, independent RTP stack. However, as the subunits are semantically part of the same terminal, it is appropriate that this semantic relationship is expressed in RTCP protocol elements, namely in the CNAME.",
      "zh-CHS": "从RTP的观点来看，每个子单元终止RTP并充当端点，因为每个子单元都包含自己的独立RTP堆栈。然而，由于子单元在语义上是同一终端的一部分，因此这种语义关系在RTCP协议元素（即CNAME）中表示是合适的。"
    },
    {
      "indent": 15,
      "text": "+---------------------+\n| Endpoint A          |\n| Local Area Network  |\n|      +------------+ |\n|   +->| Audio      |<+-RTP---\\\n|   |  +------------+ |        \\    +------+\n|   |  +------------+ |         +-->|      |\n|   +->| Video      |<+-RTP-------->|  B   |\n|   |  +------------+ |         +-->|      |\n|   |  +------------+ |        /    +------+\n|   +->| Control    |<+-SIP---/\n|      +------------+ |\n+---------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 20: Split Component Terminal",
      "zh-CHS": "图20：拆分组件终端"
    },
    {
      "indent": 3,
      "text": "It is further sensible that the subunits share a common clock from which RTP and RTCP clocks are derived, to facilitate synchronization and avoid clock drift.",
      "zh-CHS": "更合理的是，子单元共享一个公共时钟，RTP和RTCP时钟从该时钟派生，以促进同步并避免时钟漂移。"
    },
    {
      "indent": 3,
      "text": "To indicate that audio and video Source Streams generated by different subunits share a common clock, and can be synchronized, the RTP streams generated from those Source Streams need to include the same CNAME in their RTCP SDES packets. The use of a common CNAME for RTP flows carried in different transport-layer flows is entirely normal for RTP and RTCP senders, and fully compliant RTP endpoints, middleboxes, and other tools should have no problem with this.",
      "zh-CHS": "为了指示由不同子单元生成的音频和视频源流共享一个公共时钟，并且可以同步，从这些源流生成的RTP流需要在其RTCP SDES数据包中包括相同的CNAME。对于RTP和RTCP发送方来说，对不同传输层流中承载的RTP流使用公共CNAME是完全正常的，完全兼容的RTP端点、中间盒和其他工具对此应该没有问题。"
    },
    {
      "indent": 3,
      "text": "However, outside of the split component terminal scenario (and perhaps a multihomed endpoint scenario, which is not further discussed herein), the use of a common CNAME in RTP streams sent from separate endpoints (as opposed to a common CNAME for RTP streams sent on different transport-layer flows between two endpoints) is rare. It has been reported that at least some third-party tools like some network monitors do not handle gracefully endpoints that use a common CNAME across multiple transport-layer flows: they report an error condition in which two separate endpoints are using the same CNAME. Depending on the sophistication of the support staff, such erroneous reports can lead to support issues.",
      "zh-CHS": "然而，在拆分组件终端场景（以及可能是多宿端点场景，本文不再进一步讨论）之外，在从单独端点发送的RTP流中使用公共CNAME（与在两个端点之间的不同传输层流上发送的RTP流的公共CNAME相反）是很少的。据报告，至少有一些第三方工具（如某些网络监视器）无法正常处理跨多个传输层流使用公共CNAME的端点：它们报告两个独立端点使用相同CNAME的错误情况。根据支持人员的复杂程度，此类错误报告可能导致支持问题。"
    },
    {
      "indent": 3,
      "text": "The aforementioned support issue can sometimes be avoided if each of the subunits of a split component terminal is configured to use a different CNAME, with the synchronization between the RTP streams being indicated by some non-RTP signaling channel rather than using a common CNAME sent in RTCP. This complicates the signaling, especially in cases where there are multiple SSRCs in use with complex synchronization requirements, as is the same in many current telepresence systems. Unless one uses RTCP terminating topologies such as Topo-RTCP-terminating-MCU, sessions involving more than one video subunit with a common CNAME are close to unavoidable.",
      "zh-CHS": "如果分割组件终端的每个子单元被配置为使用不同的CNAME，并且RTP流之间的同步由一些非RTP信令信道指示，而不是使用RTCP中发送的公共CNAME，则上述支持问题有时可以避免。这使得信令复杂化，尤其是在有多个SSRC在使用且具有复杂同步要求的情况下，就像在许多当前的远程呈现系统中一样。除非使用RTCP端接拓扑（如Topo RTCP端接MCU），否则涉及多个具有公共CNAME的视频子单元的会话几乎是不可避免的。"
    },
    {
      "indent": 3,
      "text": "The different RTP streams comprising a split terminal system can form a single RTP session or they can form multiple RTP sessions, depending on the visibility of their SSRC values in RTCP reports. If the receiver of the RTP streams sent by the split terminal sends reports relating to all of the RTP flows (i.e., to each SSRC) in each RTCP report, then a single RTP session is formed. Alternatively, if the receiver of the RTP streams sent by the split terminal does not send cross-reports in RTCP, then the audio and video form separate RTP sessions.",
      "zh-CHS": "组成拆分终端系统的不同RTP流可以形成单个RTP会话，也可以形成多个RTP会话，具体取决于其SSRC值在RTCP报告中的可见性。如果分割终端发送的RTP流的接收器发送与每个RTCP报告中的所有RTP流（即，到每个SSRC）相关的报告，则形成单个RTP会话。或者，如果分割终端发送的RTP流的接收器没有在RTCP中发送交叉报告，则音频和视频形成单独的RTP会话。"
    },
    {
      "indent": 3,
      "text": "For example, in Figure 20, B will send RTCP reports to each of the subunits of A. If the RTCP packets that B sends to the audio subunit of A include reports on the reception quality of the video as well as the audio, and similarly if the RTCP packets that B sends to the video subunit of A include reports on the reception quality of the audio as well as video, then a single RTP session is formed. However, if the RTCP packets B sends to the audio subunit of A only report on the received audio, and the RTCP packets B sends to the video subunit of A only report on the received video, then there are two separate RTP sessions.",
      "zh-CHS": "例如，在图20中，B将向A的每个子单元发送RTCP报告。如果B发送给A的音频子单元的RTCP数据包包括关于视频和音频接收质量的报告，并且类似地，如果B发送到A的视频子单元的RTCP分组包括关于音频和视频的接收质量的报告，则形成单个RTP会话。然而，如果RTCP数据包B发送到仅报告接收音频的音频子单元，并且RTCP数据包B发送到仅报告接收视频的视频子单元，则存在两个单独的RTP会话。"
    },
    {
      "indent": 3,
      "text": "Forming a single RTP session across the RTP streams sent by the different subunits of a split terminal gives each subunit visibility into reception quality of RTP streams sent by the other subunits.",
      "zh-CHS": "通过在分割终端的不同子单元发送的RTP流之间形成单个RTP会话，使得每个子单元能够看到其他子单元发送的RTP流的接收质量。"
    },
    {
      "indent": 3,
      "text": "This information can help diagnose reception quality problems, but at the cost of increased RTCP bandwidth use.",
      "zh-CHS": "此信息有助于诊断接收质量问题，但会增加RTCP带宽使用。"
    },
    {
      "indent": 3,
      "text": "RTP streams sent by the subunits of a split terminal need to use the same CNAME in their RTCP packets if they are to be synchronized, irrespective of whether a single RTP session is formed or not.",
      "zh-CHS": "如果要同步，则拆分终端的子单元发送的RTP流需要在其RTCP数据包中使用相同的CNAME，而不管是否形成单个RTP会话。"
    },
    {
      "indent": 0,
      "text": "3.11. Non-symmetric Mixer/Translators",
      "section_title": true,
      "zh-CHS": "3.11. 非对称混频器/转换器"
    },
    {
      "indent": 3,
      "text": "Shortcut name: Topo-Asymmetric",
      "zh-CHS": "快捷方式名称：拓扑不对称"
    },
    {
      "indent": 3,
      "text": "It is theoretically possible to construct an MCU that is a mixer in one direction and a translator in another. The main reason to consider this would be to allow topologies similar to Figure 13, where the mixer does not need to mix in the direction from B or D towards the multicast domains with A and C. Instead, the RTP streams from B and D are forwarded without changes. Avoiding this mixing would save media processing resources that perform the mixing in cases where it isn't needed. However, there would still be a need to mix B's media towards D. Only in the direction B -> multicast domain or D -> multicast domain would it be possible to work as a translator. In all other directions, it would function as a mixer.",
      "zh-CHS": "从理论上讲，可以构造一个MCU，它在一个方向上是混频器，在另一个方向上是转换器。考虑这一点的主要原因是允许类似于图13的拓扑结构，其中混频器不需要用A和C从B或D向多播域方向混合，相反，从B和D的RTP流没有变化地转发。避免这种混合将节省在不需要的情况下执行混合的媒体处理资源。然而，仍然需要将B的媒体混合到D。只有在方向B->multicast domain或D->multicast domain中，才有可能作为翻译器工作。在所有其他方向上，它将起到混合器的作用。"
    },
    {
      "indent": 3,
      "text": "The mixer/translator would still need to process and change the RTCP before forwarding it in the directions of B or D to the multicast domain. One issue is that A and C do not know about the mixed-media stream the mixer sends to either B or D. Therefore, any reports related to these streams must be removed. Also, receiver reports related to A's and C's RTP streams would be missing. To avoid A and C thinking that B and D aren't receiving A and C at all, the mixer needs to insert locally generated reports reflecting the situation for the streams from A and C into B's and D's sender reports. In the opposite direction, the receiver reports from A and C about B's and D's streams also need to be aggregated into the mixer's receiver reports sent to B and D. Since B and D only have the mixer as source for the stream, all RTCP from A and C must be suppressed by the mixer.",
      "zh-CHS": "混音器/转换器在将RTCP沿B或D方向转发到多播域之前，仍然需要处理和更改RTCP。一个问题是A和C不知道混合器发送给B或D的混合媒体流。因此，必须删除与这些流相关的任何报告。此外，与A和C的RTP流相关的接收器报告也将丢失。为了避免A和C认为B和D根本没有收到A和C，混合器需要将本地生成的报告插入B和D的发送者报告中，以反映A和C流的情况。相反，来自A和C的关于B和D流的接收器报告也需要聚合到发送给B和D的混合器接收器报告中。由于B和D仅将混合器作为流的源，因此混合器必须抑制来自A和C的所有RTCP。"
    },
    {
      "indent": 3,
      "text": "This topology is so problematic, and it is so easy to get the RTCP processing wrong, that it is not recommended for implementation.",
      "zh-CHS": "这种拓扑结构问题重重，而且很容易使RTCP处理出错，因此不建议实施。"
    },
    {
      "indent": 0,
      "text": "3.12. Combining Topologies",
      "section_title": true,
      "zh-CHS": "3.12. 组合拓扑"
    },
    {
      "indent": 3,
      "text": "Topologies can be combined and linked to each other using mixers or translators. However, care must be taken in handling the SSRC/CSRC space. A mixer does not forward RTCP from sources in other domains, but instead generates its own RTCP packets for each domain it mixes into, including the necessary SDES information for both the CSRCs and",
      "zh-CHS": "拓扑可以使用混合器或转换器进行组合并相互链接。但是，在处理SSRC/CSRC空间时必须小心。混频器不会从其他域中的源转发RTCP，而是为其混入的每个域生成自己的RTCP数据包，包括CSRC和CSRC所需的SDES信息"
    },
    {
      "indent": 3,
      "text": "the SSRCs. Thus, in a mixed domain, the only SSRCs seen will be the ones present in the domain, while there can be CSRCs from all the domains connected together with a combination of mixers and translators. The combined SSRC and CSRC space is common over any translator or mixer. It is important to facilitate loop detection, something that is likely to be even more important in combined topologies due to the mixed behavior between the domains. Any hybrid, like the Topo-Video-switch-MCU or Topo-Asymmetric, requires considerable thought on how RTCP is dealt with.",
      "zh-CHS": "SSRC。因此，在混合域中，看到的唯一SSRC将是域中存在的SSRC，而所有域中的CSRC可以通过混频器和转换器的组合连接在一起。组合的SSRC和CSRC空间在任何翻译器或混音器上都是通用的。重要的是促进循环检测，由于域之间的混合行为，这在组合拓扑中可能更为重要。任何混合，如Topo视频开关MCU或Topo不对称，都需要大量考虑如何处理RTCP。"
    },
    {
      "indent": 0,
      "text": "4. Topology Properties",
      "section_title": true,
      "zh-CHS": "4. 拓扑特性"
    },
    {
      "indent": 3,
      "text": "The topologies discussed in Section 3 have different properties. This section describes these properties. Note that, even if a certain property is supported within a particular topology concept, the necessary functionality may be optional to implement.",
      "zh-CHS": "第3节中讨论的拓扑具有不同的特性。本节介绍这些属性。请注意，即使特定拓扑概念中支持某个属性，也可以选择实现必要的功能。"
    },
    {
      "indent": 0,
      "text": "4.1. All-to-All Media Transmission",
      "section_title": true,
      "zh-CHS": "4.1. 全对全媒体传输"
    },
    {
      "indent": 3,
      "text": "To recapitulate, multicast, and in particular ASM, provides the functionality that everyone may send to, or receive from, everyone else within the session. SSM can provide a similar functionality by having anyone intending to participate as a sender to send its media to the SSM Distribution Source. The SSM Distribution Source forwards the media to all receivers subscribed to the multicast group. Mesh, MCUs, mixers, Selective Forwarding Middleboxes (SFMs), and translators may all provide that functionality at least on some basic level. However, there are some differences in which type of reachability they provide.",
      "zh-CHS": "概括地说，多播，特别是ASM，提供了每个人都可以向会话中的其他人发送或接收的功能。SSM可以提供类似的功能，让任何打算作为发送者参与的人将其媒体发送到SSM分发源。SSM分发源将媒体转发给订阅了多播组的所有接收器。Mesh、MCU、混频器、选择性转发中间盒（SFM）和翻译器都可以至少在一些基本级别上提供该功能。然而，它们提供的可达性类型存在一些差异。"
    },
    {
      "indent": 3,
      "text": "The topologies that come closest to emulating Any-Source IP Multicast, with all-to-all transmission capabilities, are the Transport Translator function called \"relay\" in Section 3.5, as well as the Mesh with joint RTP sessions (Section 3.4). Media Translators, Mesh with independent RTP Sessions, mixers, SFUs, and the MCU variants do not provide a fully meshed forwarding on the transport level; instead, they only allow limited forwarding of content from the other session participants.",
      "zh-CHS": "最接近模拟任何源IP多播的拓扑，具有全对全传输能力，是第3.5节中称为“中继”的传输转换器功能，以及具有联合RTP会话的网状结构（第3.4节）。媒体转换器、具有独立RTP会话的网格、混频器、SFU和MCU变体在传输级别上不提供完全网格化的转发；相反，它们只允许从其他会话参与者有限地转发内容。"
    },
    {
      "indent": 3,
      "text": "The \"all-to-all media transmission\" requires that any media transmitting endpoint considers the path to the least-capable receiving endpoint. Otherwise, the media transmissions may overload that path. Therefore, a sending endpoint needs to monitor the path from itself to any of the receiving endpoints, to detect the currently least-capable receiver and adapt its sending rate accordingly. As multiple endpoints may send simultaneously, the available resources may vary. RTCP's receiver reports help perform this monitoring, at least on a medium time scale.",
      "zh-CHS": "“全对全媒体传输”要求任何媒体传输端点考虑到能力最低的接收端点的路径。否则，媒体传输可能会使该路径过载。因此，发送端点需要监视从其自身到任何接收端点的路径，以检测当前能力最低的接收器并相应地调整其发送速率。由于多个端点可能同时发送，可用资源可能会有所不同。RTCP的接收器报告有助于执行此监控，至少在中等时间范围内。"
    },
    {
      "indent": 3,
      "text": "The resource consumption for performing all-to-all transmission varies depending on the topology. Both ASM and SSM have the benefit that only one copy of each packet traverses a particular link. Using a relay causes the transmission of one copy of a packet per endpoint-to-relay path and packet transmitted. However, in most cases, the links carrying the multiple copies will be the ones close to the relay (which can be assumed to be part of the network infrastructure with good connectivity to the backbone) rather than the endpoints (which may be behind slower access links). The Mesh topologies causes N-1 streams of transmitted packets to traverse the first-hop link from the endpoint, in a mesh with N endpoints. How long the different paths are common is highly situation dependent.",
      "zh-CHS": "执行全对全传输的资源消耗取决于拓扑结构。ASM和SSM都有这样的好处：每个数据包只有一个副本通过特定的链路。使用中继导致每个端点向中继路径和传输的数据包传输一个数据包副本。然而，在大多数情况下，承载多个副本的链路将是靠近中继器的链路（可以假定它是网络基础设施的一部分，与主干具有良好的连接），而不是端点（可能在较慢的访问链路后面）。网状拓扑使N-1个传输包流在具有N个端点的网状中从端点穿过第一跳链路。不同路径共用的时间长短在很大程度上取决于具体情况。"
    },
    {
      "indent": 3,
      "text": "The transmission of RTCP by design adapts to any changes in the number of participants due to the transmission algorithm, defined in the RTP specification [RFC3550], and the extensions in AVPF [RFC4585] (when applicable). That way, the resources utilized for RTCP stay within the bounds configured for the session.",
      "zh-CHS": "RTCP的设计传输可适应由于RTP规范[RFC3550]中定义的传输算法以及AVPF[RFC4585]中的扩展（如适用）而导致的参与者数量的任何变化。这样，用于RTCP的资源将保持在为会话配置的边界内。"
    },
    {
      "indent": 0,
      "text": "4.2. Transport or Media Interoperability",
      "section_title": true,
      "zh-CHS": "4.2. 传输或媒体互操作性"
    },
    {
      "indent": 3,
      "text": "All translators, mixers, RTCP-terminating MCUs, and Mesh with individual RTP sessions allow changing the media encoding or the transport to other properties of the other domain, thereby providing extended interoperability in cases where the endpoints lack a common set of media codecs and/or transport protocols. Selective Forwarding Middleboxes can adopt the transport and (at least) selectively forward the encoded streams that match a receiving endpoint's capability. It requires an additional translator to change the media encoding if the encoded streams do not match the receiving endpoint's capabilities.",
      "zh-CHS": "所有转换器、混频器、RTCP端接MCU和具有单个RTP会话的网格都允许将媒体编码或传输更改为其他域的其他属性，从而在端点缺少一组公共媒体编解码器和/或传输协议的情况下提供扩展互操作性。选择性转发中间盒可以采用传输，并且（至少）选择性地转发与接收端点的能力匹配的编码流。如果编码流与接收端点的功能不匹配，则需要额外的转换器来更改媒体编码。"
    },
    {
      "indent": 0,
      "text": "4.3. Per-Domain Bitrate Adaptation",
      "section_title": true,
      "zh-CHS": "4.3. 每域比特率自适应"
    },
    {
      "indent": 3,
      "text": "Endpoints are often connected to each other with a heterogeneous set of paths. This makes congestion control in a Point-to-Multipoint set problematic. In the ASM, SSM, Mesh with common RTP session, and Transport Relay scenarios, each individual sending endpoint has to adapt to the receiving endpoint behind the least-capable path, yielding suboptimal quality for the endpoints behind the more capable paths. This is no longer an issue when Media Translators, mixers, SFMs, or MCUs are involved, as each endpoint only needs to adapt to the slowest path within its own domain. The translator, mixer, SFM, or MCU topologies all require their respective outgoing RTP streams to adjust the bitrate, packet rate, etc., to adapt to the least-capable path in each of the other domains. That way one can avoid lowering the quality to the least-capable endpoint in all the domains at the cost (complexity, delay, equipment) of the mixer, SFM, or",
      "zh-CHS": "端点通常通过一组异构路径相互连接。这使得点对多点集中的拥塞控制成为问题。在ASM、SSM、具有公共RTP会话的Mesh和传输中继场景中，每个单独的发送端点必须适应能力最低路径后面的接收端点，从而为能力更强路径后面的端点提供次优质量。当涉及媒体转换器、混频器、SFM或MCU时，这不再是一个问题，因为每个端点只需要适应其自己域中最慢的路径。转换器、混频器、SFM或MCU拓扑都需要它们各自的输出RTP流来调整比特率、分组率等，以适应每个其他域中的最小能力路径。这样可以避免以混频器、SFM或其他设备的成本（复杂性、延迟、设备）将质量降低到所有域中能力最低的端点"
    },
    {
      "indent": 3,
      "text": "translator, and potentially the media sender (multicast/layered encoding and sending the different representations).",
      "zh-CHS": "转换器，可能还有媒体发送者（多播/分层编码并发送不同的表示）。"
    },
    {
      "indent": 0,
      "text": "4.4. Aggregation of Media",
      "section_title": true,
      "zh-CHS": "4.4. 媒体聚合"
    },
    {
      "indent": 3,
      "text": "In the all-to-all media property mentioned above and provided by ASM, SSM, Mesh with common RTP session, and relay, all simultaneous media transmissions share the available bitrate. For endpoints with limited reception capabilities, this may result in a situation where even a minimal, acceptable media quality cannot be accomplished, because multiple RTP streams need to share the same resources. One solution to this problem is to use a mixer, or MCU, to aggregate the multiple RTP streams into a single one, where the single RTP stream takes up less resources in terms of bitrate. This aggregation can be performed according to different methods. Mixing or selection are two common methods. Selection is almost always possible and easy to implement. Mixing requires resources in the mixer and may be relatively easy and not impair the quality too badly (audio) or quite difficult (video tiling, which is not only computationally complex but also reduces the pixel count per stream, with corresponding loss in perceptual quality).",
      "zh-CHS": "在上述由ASM、SSM、具有公共RTP会话的Mesh和中继提供的全对全媒体属性中，所有同步媒体传输共享可用比特率。对于接收能力有限的端点，这可能导致即使是最小的、可接受的媒体质量也无法实现的情况，因为多个RTP流需要共享相同的资源。该问题的一个解决方案是使用混频器或MCU将多个RTP流聚合为单个RTP流，其中单个RTP流在比特率方面占用更少的资源。可以根据不同的方法执行此聚合。混合或选择是两种常见的方法。选择几乎总是可能的，而且容易实现。混音需要混音器中的资源，并且可能相对容易且不会严重影响质量（音频）或相当困难（视频平铺，这不仅在计算上复杂，而且还减少了每个流的像素数，并相应地降低了感知质量）。"
    },
    {
      "indent": 0,
      "text": "4.5. View of All Session Participants",
      "section_title": true,
      "zh-CHS": "4.5. 所有与会者的意见"
    },
    {
      "indent": 3,
      "text": "The RTP protocol includes functionality to identify the session participants through the use of the SSRC and CSRC fields. In addition, it is capable of carrying some further identity information about these participants using the RTCP SDES. In topologies that provide a full all-to-all functionality, i.e., ASM, Mesh with common RTP session, and relay, a compliant RTP implementation offers the functionality directly as specified in RTP. In topologies that do not offer all-to-all communication, it is necessary that RTCP is handled correctly in domain bridging functions. RTP includes explicit specification text for translators and mixers, and for SFMs the required functionality can be derived from that text. However, the MCU described in Section 3.8 cannot offer the full functionality for session participant identification through RTP means. The topologies that create independent RTP sessions per endpoint or pair of endpoints, like a Back-to-Back RTP session, MESH with independent RTP sessions, and the RTCP terminating MCU (Section 3.9), with an exception of SFM, do not support RTP-based identification of session participants. In all those cases, other non-RTP-based mechanisms need to be implemented if such knowledge is required or desirable. When it comes to SFM, the SSRC namespace is not necessarily joint. Instead, identification will require knowledge of SSRC/CSRC mappings that the SFM performed; see Section 3.7.",
      "zh-CHS": "RTP协议包括通过使用SSRC和CSRC字段来识别会话参与者的功能。此外，它还能够使用RTCP SDE携带关于这些参与者的更多身份信息。在提供全方位功能的拓扑中，即ASM、具有公共RTP会话的网格和中继，符合RTP的实现直接提供RTP中指定的功能。在不提供全对全通信的拓扑中，必须在域桥接功能中正确处理RTCP。RTP包括用于转换器和混频器的明确规范文本，对于SFM，所需的功能可以从该文本派生。然而，第3.8节中描述的MCU不能通过RTP方式提供会话参与者识别的全部功能。每个端点或端点对创建独立RTP会话的拓扑，如背对背RTP会话、具有独立RTP会话的网格和RTCP终止MCU（第3.9节），SFM除外，不支持基于RTP的会话参与者标识。在所有这些情况下，如果需要或需要此类知识，则需要实施其他非RTP机制。谈到SFM，SSRC名称空间不一定是联合的。相反，识别需要了解SFM执行的SSRC/CSRC映射；见第3.7节。"
    },
    {
      "indent": 0,
      "text": "4.6. Loop Detection",
      "section_title": true,
      "zh-CHS": "4.6. 环路检测"
    },
    {
      "indent": 3,
      "text": "In complex topologies with multiple interconnected domains, it is possible to unintentionally form media loops. RTP and RTCP support detecting such loops, as long as the SSRC and CSRC identities are maintained and correctly set in forwarded packets. Loop detection will work in ASM, SSM, Mesh with joint RTP session, and relay. It is likely that loop detection works for the video-switching MCU, Section 3.8, at least as long as it forwards the RTCP between the endpoints. However, the Back-to-Back RTP sessions, Mesh with independent RTP sessions, and SFMs will definitely break the loop detection mechanism.",
      "zh-CHS": "在具有多个互连域的复杂拓扑中，可能会无意中形成媒体环路。RTP和RTCP支持检测此类循环，只要在转发的数据包中保持并正确设置SSRC和CSC标识。环路检测将在ASM、SSM、具有联合RTP会话的Mesh和中继中工作。循环检测可能适用于视频交换MCU，第3.8节，至少只要它在端点之间转发RTCP。然而，背对背的RTP会话、具有独立RTP会话的Mesh和SFM肯定会打破循环检测机制。"
    },
    {
      "indent": 0,
      "text": "4.7. Consistency between Header Extensions and RTCP",
      "section_title": true,
      "zh-CHS": "4.7. 头扩展和RTCP之间的一致性"
    },
    {
      "indent": 3,
      "text": "Some RTP header extensions have relevance not only end to end but also hop to hop, meaning at least some of the middleboxes in the path are aware of their potential presence through signaling, intercept and interpret such header extensions, and potentially also rewrite or generate them. Modern header extensions generally follow \"A General Mechanism for RTP Header Extensions\" [RFC5285], which allows for all of the above. Examples for such header extensions include the Media ID (MID) in [SDP-BUNDLE]. At the time of writing, there was also a proposal for how to include some SDES into an RTP header extension [RTCP-SDES].",
      "zh-CHS": "一些RTP报头扩展不仅具有端到端的相关性，而且还具有跳到跳的相关性，这意味着路径中的至少一些中间盒通过信令、截获和解释此类报头扩展来意识到它们的潜在存在，并且还可能重写或生成它们。现代报头扩展通常遵循“RTP报头扩展的通用机制”[RFC5285]，它允许上述所有功能。此类标头扩展的示例包括[SDP-BUNDLE]中的媒体ID（MID）。在撰写本文时，还提出了如何将一些SDE包含到RTP标头扩展[RTCP-SDE]中的建议。"
    },
    {
      "indent": 3,
      "text": "When such header extensions are in use, any middlebox that understands it must ensure consistency between the extensions it sees and/or generates and the RTCP it receives and generates. For example, the MID of the bundle is sent in an RTP header extension and also in an RTCP SDES message. This apparent redundancy was introduced as unaware middleboxes may choose to discard RTP header extensions. Obviously, inconsistency between the MID sent in the RTP header extension and in the RTCP SDES message could lead to undesirable results, and, therefore, consistency is needed. Middleboxes unaware of the nature of a header extension, as specified in [RFC5285], are free to forward or discard header extensions.",
      "zh-CHS": "当使用此类标头扩展时，任何了解它的中间盒必须确保它看到和/或生成的扩展与它接收和生成的RTCP之间的一致性。例如，捆绑包的MID以RTP头扩展名和RTCP SDES消息的形式发送。这种明显的冗余是由于不知情的中间盒可能会选择放弃RTP头扩展而引入的。显然，RTP标头扩展中发送的MID与RTCP SDES消息中发送的MID之间的不一致可能导致不希望的结果，因此需要一致性。如[RFC5285]中所述，不知道标头扩展性质的中间盒可以自由转发或放弃标头扩展。"
    },
    {
      "indent": 0,
      "text": "5. Comparison of Topologies",
      "section_title": true,
      "zh-CHS": "5. 拓扑结构的比较"
    },
    {
      "indent": 3,
      "text": "The table below attempts to summarize the properties of the different topologies. The legend to the topology abbreviations are: Topo-Point-to-Point (PtP), Topo-ASM (ASM), Topo-SSM (SSM), Topo-Trn-Translator (TT), Topo-Media-Translator (including Transport Translator) (MT), Topo-Mesh with joint session (MJS), Topo-Mesh with individual sessions (MIS), Topo-Mixer (Mix), Topo-Asymmetric (ASY), Topo-Video-switch-MCU (VSM), Topo-RTCP-terminating-MCU (RTM), and Selective Forwarding Middlebox (SFM). In the table below, Y",
      "zh-CHS": "下表试图总结不同拓扑的特性。拓扑缩写的图例为：拓扑点对点（PtP）、拓扑ASM（ASM）、拓扑SSM（SSM）、拓扑Trn转换器（TT）、拓扑媒体转换器（包括传输转换器）（MT）、具有联合会话的拓扑网格（MJS）、具有单独会话的拓扑网格（MIS）、拓扑混音器（Mix）、拓扑不对称（ASY）、拓扑视频开关MCU（VSM），Topo RTCP终端MCU（RTM）和选择性转发中间盒（SFM）。在下表中，Y"
    },
    {
      "indent": 3,
      "text": "indicates Yes or full support, N indicates No support, (Y) indicates partial support, and N/A indicates not applicable.",
      "zh-CHS": "表示是或完全支持，N表示不支持，（Y）表示部分支持，N/A表示不适用。"
    },
    {
      "indent": 3,
      "text": "Property             PtP  ASM SSM  TT MT MJS MIS Mix ASY VSM RTM SFM\n---------------------------------------------------------------------\nAll-to-All Media      N    Y  (Y)  Y  Y   Y  (Y) (Y) (Y) (Y) (Y) (Y)\nInteroperability      N/A  N   N   Y  Y   Y   Y   Y   Y   N   Y   Y\nPer-Domain Adaptation N/A  N   N   N  Y   N   Y   Y   Y   N   Y   Y\nAggregation of Media  N    N   N   N  N   N   N   Y  (Y)  Y   Y   N\nFull Session View     Y    Y   Y   Y  Y   Y   N   Y   Y  (Y)  N   Y\nLoop Detection        Y    Y   Y   Y  Y   Y   N   Y   Y  (Y)  N   N",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Please note that the Media Translator also includes the Transport Translator functionality.",
      "zh-CHS": "请注意，媒体转换器还包括传输转换器功能。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The use of mixers, SFMs, and translators has impact on security and the security functions used. The primary issue is that mixers, SFMs, and translators modify packets, thus preventing the use of integrity and source authentication, unless they are trusted devices that take part in the security context, e.g., the device can send Secure Real-time Transport Protocol (SRTP) and Secure Real-time Transport Control Protocol (SRTCP) [RFC3711] packets to endpoints in the Communication Session. If encryption is employed, the Media Translator, SFM, and mixer need to be able to decrypt the media to perform its function. A Transport Translator may be used without access to the encrypted payload in cases where it translates parts that are not included in the encryption and integrity protection, for example, IP address and UDP port numbers in a media stream using SRTP [RFC3711]. However, in general, the translator, SFM, or mixer needs to be part of the signaling context and get the necessary security associations (e.g., SRTP crypto contexts) established with its RTP session participants.",
      "zh-CHS": "混音器、SFM和转换器的使用会影响安全性和使用的安全功能。主要问题是混频器、SFM和转换器修改数据包，从而防止使用完整性和源身份验证，除非它们是参与安全上下文的受信任设备，例如，设备可以发送安全实时传输协议（SRTP）和安全实时传输控制协议（SRTCP）[RFC3711]将数据包发送到通信会话中的端点。如果采用加密，则媒体转换器、SFM和混合器需要能够解密媒体以执行其功能。在使用SRTP[RFC3711]翻译未包括在加密和完整性保护中的部分（例如，媒体流中的IP地址和UDP端口号）的情况下，可以使用传输转换器而不访问加密的有效负载。然而，一般来说，转换器、SFM或混频器需要是信令上下文的一部分，并获得与其RTP会话参与者建立的必要安全关联（例如，SRTP加密上下文）。"
    },
    {
      "indent": 3,
      "text": "Including the mixer, SFM, and translator in the security context allows the entity, if subverted or misbehaving, to perform a number of very serious attacks as it has full access. It can perform all the attacks possible (see RFC 3550 and any applicable profiles) as if the media session were not protected at all, while giving the impression to the human session participants that they are protected.",
      "zh-CHS": "在安全上下文中包括混音器、SFM和转换器允许实体（如果被破坏或行为不当）执行许多非常严重的攻击，因为它具有完全访问权限。它可以执行所有可能的攻击（请参阅RFC 3550和任何适用的配置文件），就好像媒体会话根本没有受到保护一样，同时给人的会话参与者留下他们受到保护的印象。"
    },
    {
      "indent": 3,
      "text": "Transport Translators have no interactions with cryptography that work above the transport layer, such as SRTP, since that sort of translator leaves the RTP header and payload unaltered. Media Translators, on the other hand, have strong interactions with cryptography, since they alter the RTP payload. A Media Translator in a session that uses cryptographic protection needs to perform cryptographic processing to both inbound and outbound packets.",
      "zh-CHS": "传输转换器与在传输层（如SRTP）之上工作的加密技术没有交互，因为这种转换器使RTP头和有效负载保持不变。另一方面，媒体翻译器与密码学有很强的交互作用，因为它们改变了RTP负载。使用加密保护的会话中的媒体转换器需要对入站和出站数据包执行加密处理。"
    },
    {
      "indent": 3,
      "text": "A Media Translator may need to use different cryptographic keys for the inbound and outbound processing. For SRTP, different keys are required, because an RFC 3550 Media Translator leaves the SSRC unchanged during its packet processing, and SRTP key sharing is only allowed when distinct SSRCs can be used to protect distinct packet streams.",
      "zh-CHS": "媒体转换器可能需要为入站和出站处理使用不同的加密密钥。对于SRTP，需要不同的密钥，因为RFC 3550媒体转换器在其数据包处理期间保持SSRC不变，并且只有当可以使用不同的SSRC来保护不同的数据包流时，才允许SRTP密钥共享。"
    },
    {
      "indent": 3,
      "text": "When the Media Translator uses different keys to process inbound and outbound packets, each session participant needs to be provided with the appropriate key, depending on whether they are listening to the translator or the original source. (Note that there is an architectural difference between RTP media translation, in which participants can rely on the RTP payload type field of a packet to determine appropriate processing, and cryptographically protected media translation, in which participants must use information that is not carried in the packet.)",
      "zh-CHS": "当媒体翻译器使用不同的密钥来处理入站和出站数据包时，需要向每个会话参与者提供适当的密钥，这取决于他们是在侦听翻译器还是原始源。（请注意，RTP媒体翻译（参与者可以依赖数据包的RTP有效负载类型字段来确定适当的处理）和受密码保护的媒体翻译（参与者必须使用数据包中未携带的信息）之间存在架构差异。）"
    },
    {
      "indent": 3,
      "text": "When using security mechanisms with translators, SFMs, and mixers, it is possible that the translator, SFM, or mixer could create different security associations for the different domains they are working in. Doing so has some implications:",
      "zh-CHS": "当对转换器、SFM和混频器使用安全机制时，转换器、SFM或混频器可能会为其工作的不同域创建不同的安全关联。这样做会产生一些影响："
    },
    {
      "indent": 3,
      "text": "First, it might weaken security if the mixer/translator accepts a weaker algorithm or key in one domain rather than in another. Therefore, care should be taken that appropriately strong security parameters are negotiated in all domains. In many cases, \"appropriate\" translates to \"similar\" strength. If a key-management system does allow the negotiation of security parameters resulting in a different strength of the security, then this system should notify the participants in the other domains about this.",
      "zh-CHS": "首先，如果混音器/转换器在一个域而不是另一个域中接受较弱的算法或密钥，则可能会削弱安全性。因此，应注意在所有域中协商适当的强安全参数。在许多情况下，“适当”意味着“相似”的强度。如果密钥管理系统允许协商安全参数，从而产生不同的安全强度，则该系统应将此情况通知其他域中的参与者。"
    },
    {
      "indent": 3,
      "text": "Second, the number of crypto contexts (keys and security-related state) needed (for example, in SRTP [RFC3711]) may vary between mixers, SFMs, and translators. A mixer normally needs to represent only a single SSRC per domain and therefore needs to create only one security association (SRTP crypto context) per domain. In contrast, a translator needs one security association per participant it translates towards, in the opposite domain. Considering Figure 11, the translator needs two security associations towards the multicast domain: one for B and one for D. It may be forced to maintain a set of totally independent security associations between itself and B and D, respectively, so as to avoid two-time pad occurrences. These contexts must also be capable of handling all the sources present in the other domains. Hence, using completely independent security associations (for certain keying mechanisms) may force a translator to handle N*DM keys and related state, where N is the total number of SSRCs used over all domains and DM is the total number of domains.",
      "zh-CHS": "其次，所需的加密上下文（密钥和安全相关状态）的数量（例如，在SRTP[RFC3711]中）在混频器、SFM和转换器之间可能有所不同。混合器通常只需要在每个域中表示一个SSRC，因此每个域只需要创建一个安全关联（SRTP加密上下文）。相反，翻译人员需要在相反的域中为其翻译的每个参与者建立一个安全关联。考虑到图11，翻译器需要两个多播域的安全关联：一个用于B，一个用于D。翻译器可能被迫在其自身与B和D之间分别维护一组完全独立的安全关联，以避免两次pad发生。这些上下文还必须能够处理其他域中存在的所有源。因此，使用完全独立的安全关联（对于某些键控机制）可能会迫使转换器处理N*DM密钥和相关状态，其中N是所有域上使用的SSRC总数，DM是域总数。"
    },
    {
      "indent": 3,
      "text": "The ASM, SSM, Relay, and Mesh (with common RTP session) topologies each have multiple endpoints that require shared knowledge about the different crypto contexts for the endpoints. These multiparty topologies have special requirements on the key management as well as the security functions. Specifically, source authentication in these environments has special requirements.",
      "zh-CHS": "ASM、SSM、中继和Mesh（具有公共RTP会话）拓扑都有多个端点，这些端点需要共享关于端点的不同加密上下文的知识。这些多方拓扑对密钥管理和安全功能都有特殊要求。具体来说，这些环境中的源身份验证有特殊要求。"
    },
    {
      "indent": 3,
      "text": "There exist a number of different mechanisms to provide keys to the different participants. One example is the choice between group keys and unique keys per SSRC. The appropriate keying model is impacted by the topologies one intends to use. The final security properties are dependent on both the topologies in use and the keying mechanisms' properties and need to be considered by the application. Exactly which mechanisms are used is outside of the scope of this document. Please review RTP Security Options [RFC7201] to get a better understanding of most of the available options.",
      "zh-CHS": "有许多不同的机制为不同的参与者提供密钥。一个例子是每个SSRC在组密钥和唯一密钥之间进行选择。适当的键控模型受打算使用的拓扑的影响。最终的安全属性取决于使用的拓扑和密钥机制的属性，应用程序需要考虑这些属性。具体使用哪些机制不在本文档的范围内。请查看RTP安全选项[RFC7201]，以便更好地了解大多数可用选项。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, DOI 10.17487/RFC3550, July 2003, <http://www.rfc-editor.org/info/rfc3550>.",
      "zh-CHS": "[RFC3550]Schulzrinne，H.，Casner，S.，Frederick，R.，和V.Jacobson，“RTP：实时应用的传输协议”，STD 64，RFC 3550，DOI 10.17487/RFC3550，2003年7月<http://www.rfc-editor.org/info/rfc3550>."
    },
    {
      "indent": 3,
      "text": "[RFC4585] Ott, J., Wenger, S., Sato, N., Burmeister, C., and J. Rey, \"Extended RTP Profile for Real-time Transport Control Protocol (RTCP)-Based Feedback (RTP/AVPF)\", RFC 4585, DOI 10.17487/RFC4585, July 2006, <http://www.rfc-editor.org/info/rfc4585>.",
      "zh-CHS": "[RFC4585]Ott，J.，Wenger，S.，Sato，N.，Burmeister，C.，和J.Rey，“基于实时传输控制协议（RTCP）的反馈（RTP/AVPF）的扩展RTP配置文件”，RFC 4585，DOI 10.17487/RFC4585，2006年7月<http://www.rfc-editor.org/info/rfc4585>."
    },
    {
      "indent": 3,
      "text": "[RFC7656] Lennox, J., Gross, K., Nandakumar, S., Salgueiro, G., and B. Burman, Ed., \"A Taxonomy of Grouping Semantics and Mechanisms for Real-Time Transport Protocol (RTP) Sources\", RFC 7656, November 2015, <http://www.rfc-editor.org/info/rfc7656>.",
      "zh-CHS": "[RFC7656]Lennox，J.，Gross，K.，Nandakumar，S.，Salgueiro，G.，和B.Burman，Ed.，“实时传输协议（RTP）源分组语义和机制的分类”，RFC 7656，2015年11月<http://www.rfc-editor.org/info/rfc7656>."
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[MULTI-STREAM-OPT] Lennox, J., Westerlund, M., Wu, W., and C. Perkins, \"Sending Multiple Media Streams in a Single RTP Session: Grouping RTCP Reception Statistics and Other Feedback\", Work in Progress, draft-ietf-avtcore-rtp-multi-stream-optimisation-08, October 2015.",
      "zh-CHS": "[MULTI-STREAM-OPT]Lennox，J.，Westerlund，M.，Wu，W.，和C.Perkins，“在单个RTP会话中发送多个媒体流：分组RTCP接收统计数据和其他反馈”，正在进行的工作，草稿-ietf-avtcore-RTP-MULTI-STREAM-OPTIMIZATION-082015年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1112] Deering, S., \"Host extensions for IP multicasting\", STD 5, RFC 1112, DOI 10.17487/RFC1112, August 1989, <http://www.rfc-editor.org/info/rfc1112>.",
      "zh-CHS": "[RFC1112]Deering，S.，“IP多播的主机扩展”，STD 5，RFC 1112，DOI 10.17487/RFC1112，1989年8月<http://www.rfc-editor.org/info/rfc1112>."
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, DOI 10.17487/RFC3022, January 2001, <http://www.rfc-editor.org/info/rfc3022>.",
      "zh-CHS": "[RFC3022]Srisuresh，P.和K.Egevang，“传统IP网络地址转换器（传统NAT）”，RFC 3022，DOI 10.17487/RFC3022，2001年1月<http://www.rfc-editor.org/info/rfc3022>."
    },
    {
      "indent": 3,
      "text": "[RFC3569] Bhattacharyya, S., Ed., \"An Overview of Source-Specific Multicast (SSM)\", RFC 3569, DOI 10.17487/RFC3569, July 2003, <http://www.rfc-editor.org/info/rfc3569>.",
      "zh-CHS": "[RFC3569]Bhattacharyya，S.，编辑，“源特定多播（SSM）概述”，RFC 3569，DOI 10.17487/RFC3569，2003年7月<http://www.rfc-editor.org/info/rfc3569>."
    },
    {
      "indent": 3,
      "text": "[RFC3711] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, DOI 10.17487/RFC3711, March 2004, <http://www.rfc-editor.org/info/rfc3711>.",
      "zh-CHS": "[RFC3711]Baugher，M.，McGrew，D.，Naslund，M.，Carrara，E.，和K.Norrman，“安全实时传输协议（SRTP）”，RFC 3711，DOI 10.17487/RFC3711，2004年3月<http://www.rfc-editor.org/info/rfc3711>."
    },
    {
      "indent": 3,
      "text": "[RFC4575] Rosenberg, J., Schulzrinne, H., and O. Levin, Ed., \"A Session Initiation Protocol (SIP) Event Package for Conference State\", RFC 4575, DOI 10.17487/RFC4575, August 2006, <http://www.rfc-editor.org/info/rfc4575>.",
      "zh-CHS": "[RFC4575]Rosenberg，J.，Schulzrinne，H.，和O.Levin，Ed.，“会议状态的会话启动协议（SIP）事件包”，RFC 4575，DOI 10.17487/RFC4575，2006年8月<http://www.rfc-editor.org/info/rfc4575>."
    },
    {
      "indent": 3,
      "text": "[RFC4607] Holbrook, H. and B. Cain, \"Source-Specific Multicast for IP\", RFC 4607, DOI 10.17487/RFC4607, August 2006, <http://www.rfc-editor.org/info/rfc4607>.",
      "zh-CHS": "[RFC4607]Holbrook，H.和B.Cain，“IP的源特定多播”，RFC 4607，DOI 10.17487/RFC4607，2006年8月<http://www.rfc-editor.org/info/rfc4607>."
    },
    {
      "indent": 3,
      "text": "[RFC5104] Wenger, S., Chandra, U., Westerlund, M., and B. Burman, \"Codec Control Messages in the RTP Audio-Visual Profile with Feedback (AVPF)\", RFC 5104, DOI 10.17487/RFC5104, February 2008, <http://www.rfc-editor.org/info/rfc5104>.",
      "zh-CHS": "[RFC5104]Wenger，S.，Chandra，U.，Westerlund，M.，和B.Burman，“带反馈的RTP视听配置文件（AVPF）中的编解码器控制消息”，RFC 5104，DOI 10.17487/RFC5104，2008年2月<http://www.rfc-editor.org/info/rfc5104>."
    },
    {
      "indent": 3,
      "text": "[RFC5117] Westerlund, M. and S. Wenger, \"RTP Topologies\", RFC 5117, DOI 10.17487/RFC5117, January 2008, <http://www.rfc-editor.org/info/rfc5117>.",
      "zh-CHS": "[RFC5117]Westerlund，M.和S.Westerlund，M.和S.Wenger，“RTP拓扑”，RFC 5117，DOI 10.17487/RFC5117，2008年1月<http://www.rfc-editor.org/info/rfc5117>."
    },
    {
      "indent": 3,
      "text": "[RFC5285] Singer, D. and H. Desineni, \"A General Mechanism for RTP Header Extensions\", RFC 5285, DOI 10.17487/RFC5285, July 2008, <http://www.rfc-editor.org/info/rfc5285>.",
      "zh-CHS": "[RFC5285]Singer，D.和H.Desneni，“RTP报头扩展的一般机制”，RFC 5285，DOI 10.17487/RFC5285，2008年7月<http://www.rfc-editor.org/info/rfc5285>."
    },
    {
      "indent": 3,
      "text": "[RFC5760] Ott, J., Chesterfield, J., and E. Schooler, \"RTP Control Protocol (RTCP) Extensions for Single-Source Multicast Sessions with Unicast Feedback\", RFC 5760, DOI 10.17487/RFC5760, February 2010, <http://www.rfc-editor.org/info/rfc5760>.",
      "zh-CHS": "[RFC5760]Ott，J.，Chesterfield，J.，和E.Schooler，“具有单播反馈的单源多播会话的RTP控制协议（RTCP）扩展”，RFC 5760，DOI 10.17487/RFC5760，2010年2月<http://www.rfc-editor.org/info/rfc5760>."
    },
    {
      "indent": 3,
      "text": "[RFC5766] Mahy, R., Matthews, P., and J. Rosenberg, \"Traversal Using Relays around NAT (TURN): Relay Extensions to Session Traversal Utilities for NAT (STUN)\", RFC 5766, DOI 10.17487/RFC5766, April 2010, <http://www.rfc-editor.org/info/rfc5766>.",
      "zh-CHS": "[RFC5766]Mahy，R.，Matthews，P.，和J.Rosenberg，“使用NAT周围的中继进行遍历（TURN）：NAT（STUN）会话遍历实用程序的中继扩展”，RFC 5766，DOI 10.17487/RFC5766，2010年4月<http://www.rfc-editor.org/info/rfc5766>."
    },
    {
      "indent": 3,
      "text": "[RFC6285] Ver Steeg, B., Begen, A., Van Caenegem, T., and Z. Vax, \"Unicast-Based Rapid Acquisition of Multicast RTP Sessions\", RFC 6285, DOI 10.17487/RFC6285, June 2011, <http://www.rfc-editor.org/info/rfc6285>.",
      "zh-CHS": "[RFC6285]Ver Steeg，B.，Begen，A.，Van Caenegem，T.，和Z.Vax，“基于单播的多播RTP会话快速获取”，RFC 6285，DOI 10.17487/RFC6285，2011年6月<http://www.rfc-editor.org/info/rfc6285>."
    },
    {
      "indent": 3,
      "text": "[RFC6465] Ivov, E., Ed., Marocco, E., Ed., and J. Lennox, \"A Real-time Transport Protocol (RTP) Header Extension for Mixer-to-Client Audio Level Indication\", RFC 6465, DOI 10.17487/RFC6465, December 2011, <http://www.rfc-editor.org/info/rfc6465>.",
      "zh-CHS": "[RFC6465]Ivov，E.，Ed.，Marocco，E.，Ed.，和J.Lennox，“混音器到客户端音频电平指示的实时传输协议（RTP）头扩展”，RFC 6465，DOI 10.17487/RFC6465，2011年12月<http://www.rfc-editor.org/info/rfc6465>."
    },
    {
      "indent": 3,
      "text": "[RFC7201] Westerlund, M. and C. Perkins, \"Options for Securing RTP Sessions\", RFC 7201, DOI 10.17487/RFC7201, April 2014, <http://www.rfc-editor.org/info/rfc7201>.",
      "zh-CHS": "[RFC7201]Westerlund，M.和C.Perkins，“保护RTP会话的选项”，RFC 7201，DOI 10.17487/RFC7201，2014年4月<http://www.rfc-editor.org/info/rfc7201>."
    },
    {
      "indent": 3,
      "text": "[RTCP-SDES] Westerlund, M., Burman, B., Even, R., and M. Zanaty, \"RTP Header Extension for RTCP Source Description Items\", Work in Progress, draft-ietf-avtext-sdes-hdr-ext-02, July 2015.",
      "zh-CHS": "[RTCP-SDES]Westerlund，M.，Burman，B.，Even，R.，和M.Zanaty，“RTCP源描述项的RTP头扩展”，正在进行的工作，草稿-ietf-avtext-SDES-hdr-ext-022015年7月。"
    },
    {
      "indent": 3,
      "text": "[SDP-BUNDLE] Holmberg, C., Alvestrand, H., and C. Jennings, \"Negotiating Media Multiplexing Using the Session Description Protocol (SDP)\", Work in Progress, draft-ietf-mmusic-sdp-bundle-negotiation-23, July 2015.",
      "zh-CHS": "[SDP-BUNDLE]Holmberg，C.，Alvestrand，H.，和C.Jennings，“使用会话描述协议（SDP）协商媒体多路复用”，正在进行的工作，草稿-ietf-mmusic-SDP-BUNDLE-negotiation-232015年7月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Mark Baugher, Bo Burman, Ben Campbell, Umesh Chandra, Alex Eleftheriadis, Roni Even, Ladan Gharai, Geoff Hunt, Suresh Krishnan, Keith Lantz, Jonathan Lennox, Scarlet Liuyan, Suhas Nandakumar, Colin Perkins, and Dan Wing for their help in reviewing and improving this document.",
      "zh-CHS": "作者感谢Mark Baugher、Bo Burman、Ben Campbell、Umesh Chandra、Alex Eleftheriadis、Roni Even、Ladan Gharai、Geoff Hunt、Suresh Krishnan、Keith Lantz、Jonathan Lennox、Scarlet Liuyan、Suhas Nandakumar、Colin Perkins和Dan Wing在审查和改进本文件方面提供的帮助。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Magnus Westerlund Ericsson Farogatan 2 SE-164 80 Kista Sweden",
      "zh-CHS": "Magnus Westerlund Ericsson Farogatan 2 SE-164 80瑞典基斯塔"
    },
    {
      "indent": 3,
      "text": "Phone: +46 10 714 82 87\nEmail: magnus.westerlund@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stephan Wenger Vidyo 433 Hackensack Ave Hackensack, NJ 07601 United States",
      "zh-CHS": "Stephan Wenger Vidyo美国新泽西州哈肯萨克大街433号哈肯萨克07601"
    },
    {
      "indent": 3,
      "text": "Email: stewe@stewe.org",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}