{
  "title": {
    "text": "RFC 7680: A One-Way Loss Metric for IP Performance Metrics (IPPM)",
    "zh-CHS": "RFC 7680"
  },
  "number": 7680,
  "created_at": "2021-10-31 13:30:14.198425+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          G. Almes\nRequest for Comments: 7680                                     Texas A&M\nSTD: 82                                                     S. Kalidindi\nObsoletes: 2680                                                     Ixia\nCategory: Standards Track                                   M. Zekauskas\nISSN: 2070-1721                                                Internet2\n                                                          A. Morton, Ed.\n                                                               AT&T Labs\n                                                            January 2016",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "A One-Way Loss Metric for IP Performance Metrics (IPPM)",
      "zh-CHS": "IP性能指标（IPPM）的单向损耗指标"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a metric for one-way loss of packets across Internet paths. It builds on notions introduced and discussed in the IP Performance Metrics (IPPM) Framework document, RFC 2330; the reader is assumed to be familiar with that document. This memo makes RFC 2680 obsolete.",
      "zh-CHS": "此备忘录定义了跨Internet路径的单向数据包丢失的度量。它建立在IP性能度量（IPPM）框架文件RFC 2330中介绍和讨论的概念之上；假定读者熟悉该文档。此备忘录使RFC 2680过时。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7680.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7680."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   4\n  1.1.  Motivation  . . . . . . . . . . . . . . . . . . . . . . .   5\n  1.2.  General Issues regarding Time . . . . . . . . . . . . . .   6\n2.  A Singleton Definition for One-Way Packet Loss  . . . . . . .   7\n  2.1.  Metric Name . . . . . . . . . . . . . . . . . . . . . . .   7\n  2.2.  Metric Parameters . . . . . . . . . . . . . . . . . . . .   7\n  2.3.  Metric Units  . . . . . . . . . . . . . . . . . . . . . .   7\n  2.4.  Definition  . . . . . . . . . . . . . . . . . . . . . . .   7\n  2.5.  Discussion  . . . . . . . . . . . . . . . . . . . . . . .   8\n  2.6.  Methodologies . . . . . . . . . . . . . . . . . . . . . .   9\n  2.7.  Errors and Uncertainties  . . . . . . . . . . . . . . . .  10\n  2.8.  Reporting the Metric  . . . . . . . . . . . . . . . . . .  11\n    2.8.1.  Type-P  . . . . . . . . . . . . . . . . . . . . . . .  11\n    2.8.2.  Loss Threshold  . . . . . . . . . . . . . . . . . . .  11\n    2.8.3.  Calibration Results . . . . . . . . . . . . . . . . .  11\n    2.8.4.  Path  . . . . . . . . . . . . . . . . . . . . . . . .  12\n3.  A Definition for Samples of One-Way Packet Loss . . . . . . .  12\n  3.1.  Metric Name . . . . . . . . . . . . . . . . . . . . . . .  12\n  3.2.  Metric Parameters . . . . . . . . . . . . . . . . . . . .  13\n  3.3.  Metric Units  . . . . . . . . . . . . . . . . . . . . . .  13\n  3.4.  Definition  . . . . . . . . . . . . . . . . . . . . . . .  13\n  3.5.  Discussion  . . . . . . . . . . . . . . . . . . . . . . .  13\n  3.6.  Methodologies . . . . . . . . . . . . . . . . . . . . . .  14\n  3.7.  Errors and Uncertainties  . . . . . . . . . . . . . . . .  15\n  3.8.  Reporting the Metric  . . . . . . . . . . . . . . . . . .  15\n4.  Some Statistics Definitions for One-Way Packet Loss . . . . .  15\n  4.1.  Type-P-One-way-Packet-Loss-Ratio  . . . . . . . . . . . .  15\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .  16\n6.  Changes from RFC 2680 . . . . . . . . . . . . . . . . . . . .  17\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  19\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  19\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  20\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  21\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  22",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a metric for one-way packet loss across Internet paths. It builds on notions introduced and discussed in the IPPM Framework document, [RFC2330]; the reader is assumed to be familiar with that document and its recent update [RFC7312].",
      "zh-CHS": "此备忘录定义了跨Internet路径的单向数据包丢失的度量。它以IPPM框架文件[RFC2330]中介绍和讨论的概念为基础；假定读者熟悉该文档及其最新更新[RFC7312]。"
    },
    {
      "indent": 3,
      "text": "This memo is intended to be parallel in structure to a companion document for One-way Delay (\"A One-Way Delay Metric for IP Performance Metrics (IPPM)\") [RFC7679]; the reader is assumed to be familiar with that document.",
      "zh-CHS": "本备忘录旨在在结构上与单向延迟的配套文件（“IP性能指标的单向延迟指标（IPPM）”）[RFC7679]；假定读者熟悉该文档。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119]. Although [RFC2119] was written with protocols in mind, the key words are used in this document for similar reasons. They are used to ensure the results of measurements from two different implementations are comparable and to note instances when an implementation could perturb the network.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。尽管[RFC2119]是在考虑协议的情况下编写的，但出于类似的原因，本文档中使用了关键词。它们用于确保两个不同实现的测量结果具有可比性，并用于记录一个实现可能干扰网络的实例。"
    },
    {
      "indent": 3,
      "text": "Whenever a technical term from the IPPM Framework document is first used in this memo, it will be tagged with a trailing asterisk. For example, \"term*\" indicates that \"term\" is defined in the Framework document.",
      "zh-CHS": "本备忘录中首次使用IPPM框架文件中的技术术语时，将使用尾随星号进行标记。例如，“术语*”表示在框架文档中定义了“术语”。"
    },
    {
      "indent": 3,
      "text": "The structure of the memo is as follows:",
      "zh-CHS": "备忘录的结构如下："
    },
    {
      "indent": 3,
      "text": "o A 'singleton*' analytic metric, called Type-P-One-way-Packet-Loss, is introduced to measure a single observation of packet transmission or loss.",
      "zh-CHS": "o 引入了一种称为Type-P-One-way-Packet-Loss的“singleton*”分析度量，用于测量数据包传输或丢失的单个观测值。"
    },
    {
      "indent": 3,
      "text": "o Using this singleton metric, a 'sample*' called Type-P-One-way-Packet-Loss-Poisson-Stream is introduced to measure a sequence of singleton transmissions and/or losses measured at times taken from a Poisson process, as defined in Section 11.1.1 of [RFC2330].",
      "zh-CHS": "o 根据[RFC2330]第11.1.1节中的定义，使用此单例度量，引入称为Type-P-One-way-Packet-Loss-Poisson-Stream的“样本*”，以测量单例传输序列和/或从Poisson过程中测量的损耗。"
    },
    {
      "indent": 3,
      "text": "o Using this sample, several 'statistics*' of the sample will be defined and discussed.",
      "zh-CHS": "o 使用此样本，将定义和讨论样本的几个“统计数据*”。"
    },
    {
      "indent": 3,
      "text": "This progression from singleton to sample to statistics, with clear separation among them, is important.",
      "zh-CHS": "这种从单一样本到样本再到统计的过程，在它们之间有明确的分离，是很重要的。"
    },
    {
      "indent": 0,
      "text": "1.1. Motivation",
      "section_title": true,
      "zh-CHS": "1.1. 动机"
    },
    {
      "indent": 3,
      "text": "Understanding one-way packet loss of Type-P* packets from a source host* to a destination host is useful for several reasons:",
      "zh-CHS": "了解从源主机*到目标主机*的P*型数据包的单向数据包丢失是有用的，原因如下："
    },
    {
      "indent": 3,
      "text": "o Some applications do not perform well (or at all) if end-to-end loss between hosts is large relative to some threshold value.",
      "zh-CHS": "o 如果主机之间的端到端损失相对于某个阈值较大，则某些应用程序的性能不好（或根本不好）。"
    },
    {
      "indent": 3,
      "text": "o Excessive packet loss may make it difficult to support certain real-time applications (where the precise threshold of \"excessive\" depends on the application).",
      "zh-CHS": "o 过度的数据包丢失可能使支持某些实时应用程序变得困难（其中“过度”的精确阈值取决于应用程序）。"
    },
    {
      "indent": 3,
      "text": "o The larger the value of packet loss, the more difficult it is for transport-layer protocols to sustain high bandwidths.",
      "zh-CHS": "o 数据包丢失的值越大，传输层协议就越难以维持高带宽。"
    },
    {
      "indent": 3,
      "text": "o The sensitivity of real-time applications and of transport-layer protocols to loss become especially important when very large delay-bandwidth products must be supported.",
      "zh-CHS": "o 当必须支持非常大的延迟带宽产品时，实时应用程序和传输层协议对丢失的敏感性变得尤为重要。"
    },
    {
      "indent": 3,
      "text": "The measurement of one-way loss instead of round-trip loss is motivated by the following factors:",
      "zh-CHS": "测量单向损耗而非往返损耗的原因如下："
    },
    {
      "indent": 3,
      "text": "o In today's Internet, the path from a source to a destination may be different than the path from the destination back to the source (\"asymmetric paths\"), such that different sequences of routers are used for the forward and reverse paths. Therefore, round-trip measurements actually measure the performance of two distinct paths together. Measuring each path independently highlights the performance difference between the two paths that may traverse different Internet service providers and even radically different types of networks (for example, research versus commodity networks, or networks with asymmetric link capacities, or wireless versus wireline access).",
      "zh-CHS": "o 在今天的互联网中，从源到目的地的路径可能不同于从目的地返回到源的路径（“非对称路径”），因此不同的路由器序列用于正向和反向路径。因此，往返测量实际上同时测量两条不同路径的性能。独立测量每条路径突出了两条路径之间的性能差异，这两条路径可能穿越不同的互联网服务提供商，甚至是根本不同类型的网络（例如，研究网络与商品网络，或具有不对称链路容量的网络，或无线网络与有线网络）。"
    },
    {
      "indent": 3,
      "text": "o Even when the two paths are symmetric, they may have radically different performance characteristics due to asymmetric queuing.",
      "zh-CHS": "o 即使这两条路径是对称的，由于非对称排队，它们也可能具有完全不同的性能特征。"
    },
    {
      "indent": 3,
      "text": "o Performance of an application may depend mostly on the performance in one direction. For example, a TCP-based communication will experience reduced throughput if congestion occurs in one direction of its communication. Troubleshooting may be simplified if the congested direction of TCP transmission can be identified.",
      "zh-CHS": "o 应用程序的性能可能主要取决于一个方向上的性能。例如，如果在一个通信方向发生拥塞，基于TCP的通信将经历吞吐量降低。如果可以确定TCP传输的拥塞方向，则可以简化故障排除。"
    },
    {
      "indent": 3,
      "text": "o In networks in which quality of service (QoS) is enabled, provisioning in one direction may be radically different than provisioning in the reverse direction and thus the QoS guarantees differ. Measuring the paths independently allows the verification of both guarantees.",
      "zh-CHS": "o 在启用了服务质量（QoS）的网络中，在一个方向上的供应可能与在相反方向上的供应完全不同，因此QoS保证不同。独立测量路径可以验证两种保证。"
    },
    {
      "indent": 3,
      "text": "It is outside the scope of this document to say precisely how loss metrics would be applied to specific problems.",
      "zh-CHS": "准确说明损失指标如何应用于具体问题超出了本文件的范围。"
    },
    {
      "indent": 0,
      "text": "1.2. General Issues regarding Time",
      "section_title": true,
      "zh-CHS": "1.2. 关于时间的一般性问题"
    },
    {
      "indent": 3,
      "text": "{Comment: The terminology below differs from that defined by ITU-T documents (e.g., G.810, \"Definitions and terminology for synchronization networks\" and I.356, \"B-ISDN ATM layer cell transfer performance\") but is consistent with the IPPM Framework document. In general, these differences derive from the different backgrounds; the ITU-T documents historically have a telephony origin, while the authors of this document (and the Framework document) have a computer systems background. Although the terms defined below have no direct equivalent in the ITU-T definitions, after our definitions we will provide a rough mapping. However, note one potential confusion: our definition of \"clock\" is the computer operating systems definition denoting a time-of-day clock, while the ITU-T definition of clock denotes a frequency reference.}",
      "zh-CHS": "{注释：以下术语与ITU-T文件定义的术语不同（例如，g.810，“同步网络的定义和术语”和I.356，“B-ISDN ATM层信元传输性能”）但与IPPM框架文件一致。一般来说，这些差异来自不同的背景；ITU-T文件历史上有电话来源，而本文件（和框架文件）的作者具有计算机系统背景。虽然以下定义的术语在ITU-T定义中没有直接的等效项，但在我们的定义之后，我们将提供一个粗略的映射。但是，请注意一个潜在的混淆：我们对“时钟”的定义是计算机操作系统定义，表示一天中的时间时钟，而ITU-T时钟定义表示频率参考。}"
    },
    {
      "indent": 3,
      "text": "Whenever a time (i.e., a moment in history) is mentioned here, it is understood to be measured in seconds (and fractions) relative to UTC.",
      "zh-CHS": "每当这里提到一个时间（即历史上的一个时刻）时，它都被理解为以秒（和分数）为单位相对于UTC进行测量。"
    },
    {
      "indent": 3,
      "text": "As described more fully in the Framework document, there are four distinct, but related notions of clock uncertainty:",
      "zh-CHS": "正如框架文件中更全面地描述的，时钟不确定性有四个不同但相关的概念："
    },
    {
      "indent": 3,
      "text": "synchronization*",
      "zh-CHS": "同步*"
    },
    {
      "indent": 3,
      "text": "measures the extent to which two clocks agree on what time it is. For example, the clock on one host might be 5.4 msec ahead of the clock on a second host. {Comment: A rough ITU-T equivalent is \"time error\".}",
      "zh-CHS": "测量两个时钟在时间上的一致程度。例如，一台主机上的时钟可能比另一台主机上的时钟早5.4毫秒。{注释：粗略的ITU-T等价物是“时间错误”。}"
    },
    {
      "indent": 3,
      "text": "accuracy*",
      "zh-CHS": "准确度*"
    },
    {
      "indent": 3,
      "text": "measures the extent to which a given clock agrees with UTC. For example, the clock on a host might be 27.1 msec behind UTC. {Comment: A rough ITU-T equivalent is \"time error from UTC\".}",
      "zh-CHS": "测量给定时钟与UTC一致的程度。例如，主机上的时钟可能比UTC慢27.1毫秒。{注释：粗略的ITU-T等价物是“UTC时间错误”。}"
    },
    {
      "indent": 3,
      "text": "resolution*",
      "zh-CHS": "决议*"
    },
    {
      "indent": 3,
      "text": "is a specification of the smallest unit by which the clock's time is updated. It gives a lower bound on the clock's uncertainty. For example, the clock on an old Unix host might tick only once every 10 msec and thus have a resolution of only 10 msec. {Comment: A very rough ITU-T equivalent is \"sampling period\".}",
      "zh-CHS": "是更新时钟时间的最小单位的规格。它给出了时钟不确定性的下限。例如，旧Unix主机上的时钟可能仅每10毫秒滴答一次，因此分辨率仅为10毫秒。{注释：一个非常粗略的ITU-T等价物是“采样周期”。}"
    },
    {
      "indent": 3,
      "text": "skew*",
      "zh-CHS": "歪斜*"
    },
    {
      "indent": 3,
      "text": "measures the change of accuracy, or of synchronization, with time. For example, the clock on a given host might gain 1.3 msec per hour and thus be 27.1 msec behind UTC at one time and only 25.8 msec an hour later. In this case, we say that the clock of the given host has a skew of 1.3 msec per hour relative to UTC, which threatens accuracy. We might also speak of the skew of one clock relative to another clock, which threatens synchronization. {Comment: A rough ITU-T equivalent is \"time drift\".}",
      "zh-CHS": "测量精度或同步度随时间的变化。例如，给定主机上的时钟可能每小时增加1.3毫秒，因此在某一时间比UTC慢27.1毫秒，而在一小时后仅为25.8毫秒。在这种情况下，我们说给定主机的时钟相对于UTC每小时有1.3毫秒的偏差，这威胁到准确性。我们也可以说一个时钟相对于另一个时钟的倾斜，这威胁到同步。{注释：粗略的ITU-T等价物是“时间漂移”。}"
    },
    {
      "indent": 0,
      "text": "2. A Singleton Definition for One-Way Packet Loss",
      "section_title": true,
      "zh-CHS": "2. 单向丢包的单例定义"
    },
    {
      "indent": 0,
      "text": "2.1. Metric Name",
      "section_title": true,
      "zh-CHS": "2.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-One-way-Packet-Loss",
      "zh-CHS": "P型单向丢包"
    },
    {
      "indent": 0,
      "text": "2.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "2.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host",
      "zh-CHS": "o Src，主机的IP地址"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of a host",
      "zh-CHS": "o Dst，主机的IP地址"
    },
    {
      "indent": 3,
      "text": "o T, a time",
      "zh-CHS": "o T、 一段时间"
    },
    {
      "indent": 3,
      "text": "o Tmax, a loss threshold waiting time",
      "zh-CHS": "o Tmax，损失阈值等待时间"
    },
    {
      "indent": 0,
      "text": "2.3. Metric Units",
      "section_title": true,
      "zh-CHS": "2.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-One-way-Packet-Loss is either a zero (signifying successful transmission of the packet) or a one (signifying loss).",
      "zh-CHS": "P型单向分组丢失的值是零（表示分组成功传输）或一（表示丢失）。"
    },
    {
      "indent": 0,
      "text": "2.4. Definition",
      "section_title": true,
      "zh-CHS": "2.4. 释义"
    },
    {
      "indent": 3,
      "text": ">>The *Type-P-One-way-Packet-Loss* from Src to Dst at T is 0<< means that Src sent the first bit of a Type-P packet to Dst at wire time* T and that Dst received that packet.",
      "zh-CHS": ">>在T从Src到Dst的*Type-P-One-way-Packet-Loss*为0<<意味着Src在连线时间*T将P型数据包的第一位发送到Dst，并且Dst接收到该数据包。"
    },
    {
      "indent": 3,
      "text": ">>The *Type-P-One-way-Packet-Loss* from Src to Dst at T is 1<< means that Src sent the first bit of a Type-P packet to Dst at wire time T and that Dst did not receive that packet (within the loss threshold waiting time, Tmax).",
      "zh-CHS": ">>T处从Src到Dst的*Type-P-One-way-Packet-Loss*为1<<意味着Src在连线时间T将Type-P数据包的第一位发送到Dst，并且Dst没有接收到该数据包（在丢失阈值等待时间内，Tmax）。"
    },
    {
      "indent": 0,
      "text": "2.5. Discussion",
      "section_title": true,
      "zh-CHS": "2.5. 讨论"
    },
    {
      "indent": 3,
      "text": "Thus, Type-P-One-way-Packet-Loss is 0 exactly when Type-P-One-way-Delay is a finite value, and it is 1 exactly when Type-P-One-way-Delay is undefined.",
      "zh-CHS": "因此，当Type-P-One-way-Delay为有限值时，Type-P-One-way-Packet-Loss精确为0，当Type-P-One-way-Delay未定义时，Type-P-One-way-Delay精确为1。"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "zh-CHS": "在实践中可能会出现以下问题："
    },
    {
      "indent": 3,
      "text": "o A given methodology will have to include a way to distinguish between a packet loss and a very large (but finite) delay. As noted by Mahdavi and Paxson [RFC2678], simple upper bounds (such as the 255-second theoretical upper bound on the lifetimes of IP packets [RFC791]) could be used, but good engineering, including an understanding of packet lifetimes, will be needed in practice. {Comment: Note that, for many applications of these metrics, there may be no harm in treating a large delay as packet loss. An audio playback packet, for example, that arrives only after the playback point may as well have been lost. See Section 4.1.1 of [RFC6703] for examination of unusual packet delays and application performance estimation.}",
      "zh-CHS": "o 给定的方法必须包括区分数据包丢失和非常大（但有限）延迟的方法。正如Mahdavi和Paxson[RFC2678]所指出的，可以使用简单的上界（例如IP数据包[RFC791]寿命的255秒理论上界），但在实践中需要良好的工程设计，包括对数据包寿命的理解。{注释：注意，对于这些指标的许多应用，将大延迟视为数据包丢失可能没有害处。例如，仅在播放点之后到达的音频播放数据包也可能丢失。有关异常数据包延迟的检查和应用程序性能估计，请参阅[RFC6703]的第4.1.1节。}"
    },
    {
      "indent": 3,
      "text": "o If the packet arrives but is corrupted, then it is counted as lost. {Comment: One is tempted to count the packet as received since corruption and packet loss are related but distinct phenomena. If the IP header is corrupted, however, one cannot be sure about the source or destination IP addresses and is thus on shaky grounds about knowing that the corrupted received packet corresponds to a given sent test packet. Similarly, if other parts of the packet needed by the methodology to know that the corrupted received packet corresponds to a given sent test packet, then such a packet would have to be counted as lost. It would be inconsistent to count packets with corrupted methodology-specific fields as lost, and not to count packets with other corrupted aspects in the same category.} Section 15 of [RFC2330] defines the \"standard-formed\" packet that is applicable to all metrics. Note that at this time the definition of standard-formed packets only applies to IPv4 (see also [IPPM-UPDATES]).",
      "zh-CHS": "o 如果数据包到达但已损坏，则视为丢失。{注释：由于损坏和数据包丢失是相关但不同的现象，人们很容易将数据包计算为已接收数据包。但是，如果IP头已损坏，则无法确定源或目标IP地址，因此无法确定已损坏的接收数据包是否对应于给定的已发送测试数据包。类似地，如果方法需要数据包的其他部分知道损坏的接收数据包对应于给定的发送测试数据包，则必须将此类数据包计为丢失。将具有损坏方法特定字段的数据包计为丢失，而不将具有其他损坏方面的数据包计为丢失，这将是不一致的[RFC2330]第15节定义了适用于所有度量的“标准格式”数据包。请注意，此时标准格式数据包的定义仅适用于IPv4（另请参见[IPPM-UPDATES]）。"
    },
    {
      "indent": 3,
      "text": "o If the packet is duplicated along the path (or paths) so that multiple non-corrupt copies arrive at the destination, then the packet is counted as received.",
      "zh-CHS": "o 如果数据包沿着路径（一个或多个路径）复制，以便多个未损坏的副本到达目的地，则该数据包被视为已接收。"
    },
    {
      "indent": 3,
      "text": "o If the packet is fragmented and if, for whatever reason, reassembly does not occur, then the packet will be deemed lost.",
      "zh-CHS": "o 如果数据包被分割，并且无论出于何种原因，没有重新组装，那么数据包将被视为丢失。"
    },
    {
      "indent": 0,
      "text": "2.6. Methodologies",
      "section_title": true,
      "zh-CHS": "2.6. 方法论"
    },
    {
      "indent": 3,
      "text": "As with other Type-P-* metrics, the detailed methodology will depend on the Type-P (e.g., protocol number, UDP/TCP port number, size, Differentiated Services (DS) Field [RFC2780]).",
      "zh-CHS": "与其他类型P-*指标一样，详细方法将取决于类型P（例如，协议号、UDP/TCP端口号、大小、差异化服务（DS）字段[RFC2780]）。"
    },
    {
      "indent": 3,
      "text": "Generally, for a given Type-P, one possible methodology would proceed as follows:",
      "zh-CHS": "通常，对于给定的P型，一种可能的方法如下："
    },
    {
      "indent": 3,
      "text": "o Arrange that Src and Dst have clocks that are synchronized with each other. The degree of synchronization is a parameter of the methodology and depends on the threshold used to determine loss (see below).",
      "zh-CHS": "o 安排Src和Dst具有相互同步的时钟。同步程度是该方法的一个参数，取决于用于确定损失的阈值（见下文）。"
    },
    {
      "indent": 3,
      "text": "o At the Src host, select Src and Dst IP addresses and form a test packet of Type-P with these addresses.",
      "zh-CHS": "o 在Src主机上，选择Src和Dst IP地址，并使用这些地址形成一个类型为P的测试数据包。"
    },
    {
      "indent": 3,
      "text": "o At the Dst host, arrange to receive the packet.",
      "zh-CHS": "o 在Dst主机上，安排接收数据包。"
    },
    {
      "indent": 3,
      "text": "o At the Src host, place a timestamp in the prepared Type-P packet, and send it towards Dst (ideally minimizing time before sending).",
      "zh-CHS": "o 在Src主机上，在准备好的Type-P数据包中放置一个时间戳，并将其发送到Dst（理想情况下，在发送之前最小化时间）。"
    },
    {
      "indent": 3,
      "text": "o If the packet arrives within a reasonable period of time, the one-way packet loss is taken to be zero (and take a timestamp as soon as possible upon the receipt of the packet).",
      "zh-CHS": "o 如果数据包在合理的时间段内到达，则单向数据包丢失被视为零（并且在收到数据包后尽快获取时间戳）。"
    },
    {
      "indent": 3,
      "text": "o If the packet fails to arrive within a reasonable period of time, Tmax, the one-way packet loss is taken to be one. Note that the threshold of \"reasonable\" here is a parameter of the metric.",
      "zh-CHS": "o 如果数据包未能在合理的时间段Tmax内到达，则单向数据包丢失被视为1。请注意，此处的“合理”阈值是度量的一个参数。"
    },
    {
      "indent": 3,
      "text": "{Comment: The definition of reasonable is intentionally vague and is intended to indicate a value \"Th\" so large that any value in the closed interval [Th-delta, Th+delta] is an equivalent threshold for loss. Here, delta encompasses all error in clock synchronization and timestamp acquisition and assignment along the measured path. If there is a single value, Tmax, after which the packet must be counted as lost, then we reintroduce the need for a degree of clock synchronization similar to that needed for one-way delay, and virtually all practical measurement systems combine methods for delay and loss. Therefore, if a measure of packet loss parameterized by a specific non-huge \"reasonable\" time-out value is needed, one can always measure one-way delay and see what percentage of packets from a given stream exceed a given time-out value. This point is examined in detail in [RFC6703], including analysis preferences to assign undefined delay to packets that fail to arrive with the difficulties emerging from the informal \"infinite delay\" assignment, and an estimation of an upper bound on waiting time for packets in transit. Further, enforcing a specific constant waiting time on stored",
      "zh-CHS": "{注释：合理的定义故意含糊不清，旨在表示一个值“Th”，该值太大，以致于闭合区间内的任何值[Th delta，Th+delta]是丢失的等效阈值。此处，增量包含沿测量路径的时钟同步、时间戳获取和分配中的所有错误。如果存在单个值Tmax，则必须将数据包计算为丢失，然后我们重新引入与单向de所需的时钟同步度相似的需要实际上，所有的实际测量系统都结合了延迟和丢失的方法。因此，如果一个特定的非巨大的参数化的数据包丢失的测量是“合理的”需要超时值，人们总是可以测量单向延迟，并查看给定流中超过给定超时值的数据包的百分比。这一点在[RFC6703]中进行了详细检查，包括将未定义的延迟分配给由于非正式的“无限延迟”而出现困难的数据包的分析首选项分配，以及对传输中的数据包等待时间上限的估计。此外，对存储的数据包强制执行特定的恒定等待时间"
    },
    {
      "indent": 3,
      "text": "singletons of one-way delay is compliant with this specification and may allow the results to serve more than one reporting audience.}",
      "zh-CHS": "单向延迟的单例符合本规范，并且可能允许结果服务于多个报告受众。}"
    },
    {
      "indent": 3,
      "text": "Issues such as the packet format, the means by which Dst knows when to expect the test packet, and the means by which Src and Dst are synchronized are outside the scope of this document. {Comment: We plan to document the implementation techniques of our work in much more detail elsewhere; we encourage others to do so as well.}",
      "zh-CHS": "数据包格式、Dst知道何时期望测试数据包的方法以及Src和Dst同步的方法等问题不在本文件的范围内。{评论：我们计划在其他地方更详细地记录我们工作的实施技术；我们鼓励其他人也这样做。}"
    },
    {
      "indent": 0,
      "text": "2.7. Errors and Uncertainties",
      "section_title": true,
      "zh-CHS": "2.7. 误差和不确定性"
    },
    {
      "indent": 3,
      "text": "The description of any specific measurement method should include an accounting and analysis of various sources of error or uncertainty. The Framework document provides general guidance on this point.",
      "zh-CHS": "任何特定测量方法的描述应包括对各种误差或不确定性来源的核算和分析。框架文件就这一点提供了一般性指导。"
    },
    {
      "indent": 3,
      "text": "For loss, there are three sources of error:",
      "zh-CHS": "对于损失，有三个错误来源："
    },
    {
      "indent": 3,
      "text": "o synchronization between clocks on Src and Dst.",
      "zh-CHS": "o Src和Dst上时钟之间的同步。"
    },
    {
      "indent": 3,
      "text": "o the packet-loss threshold (which is related to the synchronization between clocks).",
      "zh-CHS": "o 数据包丢失阈值（与时钟之间的同步有关）。"
    },
    {
      "indent": 3,
      "text": "o resource limits in the network interface or software on the receiving instrument.",
      "zh-CHS": "o 接收仪器网络接口或软件中的资源限制。"
    },
    {
      "indent": 3,
      "text": "The first two sources are interrelated and could result in a test packet with finite delay being reported as lost. Type-P-One-way-Packet-Loss is 1 if the test packet does not arrive, or if it does arrive and the difference between the Src timestamp and the Dst timestamp is greater than the \"reasonable period of time\" or loss threshold. If the clocks are not sufficiently synchronized, the loss threshold may not be \"reasonable\" - the packet may take much less time to arrive than its Src timestamp indicates. Similarly, if the loss threshold is set too low, then many packets may be counted as lost. The loss threshold must be high enough and the clocks synchronized well enough so that a packet that arrives is rarely counted as lost. (See the discussions in the previous two sections.)",
      "zh-CHS": "前两个源是相互关联的，可能导致有限延迟的测试数据包被报告为丢失。如果测试数据包没有到达，或者它确实到达并且Src时间戳和Dst时间戳之间的差值大于“合理时间段”或丢失阈值，则类型-P-单向-Packet-Loss为1。如果时钟没有充分同步，丢失阈值可能不“合理”-数据包到达的时间可能比其Src时间戳指示的时间少得多。类似地，如果丢失阈值设置得太低，则许多数据包可能被视为丢失。丢失阈值必须足够高，时钟同步也必须足够好，以便到达的数据包很少被视为丢失。（请参阅前两节中的讨论。）"
    },
    {
      "indent": 3,
      "text": "Since the sensitivity of packet-loss measurement alone to lack of clock synchronization is less than for delay, we refer the reader to the treatment of synchronization errors in the \"One-way Delay Metric for IPPM\" [RFC2330] for more details.",
      "zh-CHS": "由于分组丢失测量单独对时钟同步缺失的敏感性小于延迟，我们请读者参考“IPPM单向延迟度量”[RFC2330]中对同步错误的处理以了解更多细节。"
    },
    {
      "indent": 3,
      "text": "The last source of error, resource limits, cause the packet to be dropped by the measurement instrument and counted as lost when in fact the network delivered the packet in reasonable time.",
      "zh-CHS": "最后一个错误源，即资源限制，导致数据包被测量仪器丢弃，并在网络在合理时间内交付数据包时被视为丢失。"
    },
    {
      "indent": 3,
      "text": "The measurement instruments should be calibrated such that the loss threshold is reasonable for application of the metrics and the clocks are synchronized enough so the loss threshold remains reasonable.",
      "zh-CHS": "应校准测量仪器，以确保损耗阈值适用于量度，且时钟足够同步，从而使损耗阈值保持合理。"
    },
    {
      "indent": 3,
      "text": "In addition, the instruments should be checked to ensure that the possibility a packet arrives at the network interface but is lost due to congestion on the interface or to other resource exhaustion (e.g., buffers) on the instrument is low.",
      "zh-CHS": "此外，应检查仪器，以确保数据包到达网络接口但由于接口拥塞或仪器上的其他资源耗尽（如缓冲区）而丢失的可能性较低。"
    },
    {
      "indent": 0,
      "text": "2.8. Reporting the Metric",
      "section_title": true,
      "zh-CHS": "2.8. 报告指标"
    },
    {
      "indent": 3,
      "text": "The calibration and context in which the metric is measured MUST be carefully considered and SHOULD always be reported along with metric results. We now present four items to consider: Type-P of the test packets, the loss threshold, instrument calibration, and the path traversed by the test packets. This list is not exhaustive; any additional information that could be useful in interpreting applications of the metrics should also be reported (see [RFC6703] for extensive discussion of reporting considerations for different audiences).",
      "zh-CHS": "必须仔细考虑测量公制的校准和环境，并应始终与公制结果一起报告。现在，我们提出了四个需要考虑的项目：测试数据包的P型、丢失阈值、仪器校准和测试数据包穿过的路径。这份清单并非详尽无遗；还应报告可能有助于解释指标应用的任何其他信息（关于不同受众报告注意事项的广泛讨论，请参见[RFC6703]）。"
    },
    {
      "indent": 0,
      "text": "2.8.1. Type-P",
      "section_title": true,
      "zh-CHS": "2.8.1. P型"
    },
    {
      "indent": 3,
      "text": "As noted in Section 13 of the Framework document [RFC2330], the value of the metric may depend on the type of IP packets used to make the measurement, or \"Type-P\". The value of Type-P-One-way-Delay could change if the protocol (UDP or TCP), port number, size, or arrangement for special treatment (e.g., IP DS Field [RFC2780], Explicit Congestion Notification (ECN) [RFC3168], or RSVP) changes. Additional packet distinctions identified in future extensions of the Type-P definition will apply. The exact Type-P used to make the measurements MUST be accurately reported.",
      "zh-CHS": "如框架文件[RFC2330]第13节所述，度量值可能取决于用于进行测量的IP数据包的类型，或“type-P”。如果协议（UDP或TCP）、端口号、大小或特殊处理安排（例如，IP DS字段[RFC2780]、显式拥塞通知（ECN）[RFC3168]或RSVP）发生变化，则类型-P-单向延迟的值可能会发生变化。在P型定义的未来扩展中确定的附加数据包区别将适用。必须准确报告用于进行测量的准确P型。"
    },
    {
      "indent": 0,
      "text": "2.8.2. Loss Threshold",
      "section_title": true,
      "zh-CHS": "2.8.2. 损失阈值"
    },
    {
      "indent": 3,
      "text": "The threshold, Tmax, between a large finite delay and loss (or other methodology to distinguish between finite delay and loss) MUST be reported.",
      "zh-CHS": "必须报告大有限延迟和损失之间的阈值Tmax（或区分有限延迟和损失的其他方法）。"
    },
    {
      "indent": 0,
      "text": "2.8.3. Calibration Results",
      "section_title": true,
      "zh-CHS": "2.8.3. 校准结果"
    },
    {
      "indent": 3,
      "text": "The degree of synchronization between the Src and Dst clocks MUST be reported. If possible, a test packet that arrives at the Dst network interface and is reported as lost due to resource exhaustion on Dst SHOULD be reported.",
      "zh-CHS": "必须报告Src和Dst时钟之间的同步程度。如果可能，应报告到达Dst网络接口且由于Dst上的资源耗尽而报告为丢失的测试数据包。"
    },
    {
      "indent": 0,
      "text": "2.8.4. Path",
      "section_title": true,
      "zh-CHS": "2.8.4. 路径"
    },
    {
      "indent": 3,
      "text": "Finally, the path traversed by the packet SHOULD be reported, if possible. In general, it is impractical to know the precise path a given packet takes through the network. The precise path may be known for certain Type-P on short or stable paths. If Type-P includes the record route (or loose-source route) option in the IP header, and the path is short enough, and all routers* on the path support record (or loose-source) route, then the path will be precisely recorded. This is impractical because the route must be short enough, many routers do not support (or are not configured for) record route, and use of this feature would often artificially worsen the performance observed by removing the packet from common-case processing. However, partial information is still valuable context. For example, if a host can choose between two links* (and hence, two separate routes from Src to Dst), then the initial link used is valuable context. {Comment: Backbone path selection services come and go. A historical example was Merit's NetNow setup, where a Src on one Network Access Point (NAP) can reach a Dst on another NAP by either of several different backbone networks.}",
      "zh-CHS": "最后，如果可能的话，应该报告数据包经过的路径。通常，要知道给定数据包通过网络的精确路径是不切实际的。对于短路径或稳定路径上的某些P型，可能已知精确路径。如果Type-P在IP报头中包含记录路由（或松散源路由）选项，并且路径足够短，并且路径上的所有路由器*都支持记录（或松散源）路由，则将精确记录路径。这是不切实际的，因为路由必须足够短，许多路由器不支持（或未配置）记录路由，并且使用此功能通常会人为地降低从常见情况处理中删除数据包所观察到的性能。然而，部分信息仍然是有价值的。例如，如果主机可以在两条链路*（以及从Src到Dst的两条独立路由）之间进行选择，则使用的初始链路是有价值的上下文。{注释：主干路径选择服务来来去去。历史上的一个例子是Merit的NetNow设置，其中一个网络接入点（NAP）上的Src可以通过几个不同的主干网络中的任何一个到达另一个NAP上的Dst。}"
    },
    {
      "indent": 0,
      "text": "3. A Definition for Samples of One-Way Packet Loss",
      "section_title": true,
      "zh-CHS": "3. 单向丢包样本的定义"
    },
    {
      "indent": 3,
      "text": "Given the singleton metric Type-P-One-way-Packet-Loss, we now define one particular sample of such singletons. The idea of the sample is to select a particular binding of the parameters Src, Dst, and Type-P, then define a sample of values of parameter T. The means for defining the values of T is to select a beginning time T0, a final time Tf, and an average rate lambda, then define a pseudorandom Poisson process of rate lambda, whose values fall between T0 and Tf. The time interval between successive values of T will then average 1/ lambda.",
      "zh-CHS": "给定单例度量Type-P-One-way-Packet-Loss，我们现在定义这样的单例的一个特定样本。样本的思想是选择参数Src、Dst和Type-P的特定绑定，然后定义参数T值的样本。定义T值的方法是选择开始时间T0、最终时间Tf和平均速率lambda，然后定义速率lambda的伪随机泊松过程，其值介于T0和Tf之间。随后，T连续值之间的时间间隔将平均为1/lambda。"
    },
    {
      "indent": 3,
      "text": "Note that Poisson sampling is only one way of defining a sample. Poisson has the advantage of limiting bias, but other methods of sampling will be appropriate for different situations. For example, a truncated Poisson distribution may be needed to avoid reactive network state changes during intervals of inactivity, see Section 4.6 of [RFC7312]. Sometimes the goal is sampling with a known bias, and [RFC3432] describes a method for periodic sampling with random start times.",
      "zh-CHS": "请注意，泊松采样只是定义样本的一种方法。泊松法具有限制偏差的优点，但其他取样方法适用于不同的情况。例如，可能需要截断的泊松分布，以避免在非活动间隔期间发生反应性网络状态变化，请参见[RFC7312]第4.6节。有时，目标是使用已知偏差进行采样，[RFC3432]描述了一种使用随机开始时间进行周期采样的方法。"
    },
    {
      "indent": 0,
      "text": "3.1. Metric Name",
      "section_title": true,
      "zh-CHS": "3.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-One-way-Packet-Loss-Poisson-Stream",
      "zh-CHS": "P型单向丢包泊松流"
    },
    {
      "indent": 0,
      "text": "3.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "3.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host",
      "zh-CHS": "o Src，主机的IP地址"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of a host",
      "zh-CHS": "o Dst，主机的IP地址"
    },
    {
      "indent": 3,
      "text": "o T0, a time",
      "zh-CHS": "o T0，一次"
    },
    {
      "indent": 3,
      "text": "o Tf, a time",
      "zh-CHS": "o Tf，一次"
    },
    {
      "indent": 3,
      "text": "o Tmax, a loss threshold waiting time",
      "zh-CHS": "o Tmax，损失阈值等待时间"
    },
    {
      "indent": 3,
      "text": "o lambda, a rate in reciprocal seconds",
      "zh-CHS": "o λ，以倒数秒为单位的速率"
    },
    {
      "indent": 0,
      "text": "3.3. Metric Units",
      "section_title": true,
      "zh-CHS": "3.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "A sequence of pairs; the elements of each pair are:",
      "zh-CHS": "成对的序列；每对的元素包括："
    },
    {
      "indent": 3,
      "text": "o T, a time, and",
      "zh-CHS": "o T、 一次，和"
    },
    {
      "indent": 3,
      "text": "o L, either a zero or a one.",
      "zh-CHS": "o 五十、 要么是零，要么是一。"
    },
    {
      "indent": 3,
      "text": "The values of T in the sequence are monotonic increasing. Note that T would be a valid parameter to Type-P-One-way-Packet-Loss and that L would be a valid value of Type-P-One-way-Packet-Loss.",
      "zh-CHS": "序列中T的值是单调递增的。注意，T将是Type-P-One-way-Packet-Loss的有效参数，L将是Type-P-One-way-Packet-Loss的有效值。"
    },
    {
      "indent": 0,
      "text": "3.4. Definition",
      "section_title": true,
      "zh-CHS": "3.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given T0, Tf, and lambda, we compute a pseudorandom Poisson process beginning at or before T0, with average arrival rate lambda, and ending at or after Tf. Those time values greater than or equal to T0 and less than or equal to Tf are then selected. At each of the selected times in this process, we obtain one value of Type-P-One-way-Delay. The value of the sample is the sequence made up of the resulting <time, loss> pairs. If there are no such pairs, the sequence is of length zero and the sample is said to be empty.",
      "zh-CHS": "给定T0、Tf和lambda，我们计算一个伪随机泊松过程，从T0开始或之前，平均到达率lambda，到Tf结束或之后。然后选择大于或等于T0且小于或等于Tf的时间值。在该过程中的每个选定时间，我们获得一个P型单向延迟值。样本值是由结果<时间，损失>对组成的序列。如果没有这样的对，序列的长度为零，样本称为空。"
    },
    {
      "indent": 0,
      "text": "3.5. Discussion",
      "section_title": true,
      "zh-CHS": "3.5. 讨论"
    },
    {
      "indent": 3,
      "text": "The reader should be familiar with the in-depth discussion of Poisson sampling in the Framework document [RFC2330], which includes methods to compute and verify the pseudorandom Poisson process.",
      "zh-CHS": "读者应熟悉框架文件[RFC2330]中对泊松抽样的深入讨论，其中包括计算和验证伪随机泊松过程的方法。"
    },
    {
      "indent": 3,
      "text": "We specifically do not constrain the value of lambda except to note the extremes. If the rate is too large, then the measurement traffic will perturb the network and itself cause congestion. If the rate is too small, then you might not capture interesting network behavior. {Comment: We expect to document our experiences with, and suggestions",
      "zh-CHS": "我们特别不限制lambda的值，除非注意极端情况。如果速率太大，则测量流量将干扰网络，并自身导致拥塞。如果速率太小，则可能无法捕获有趣的网络行为。{评论：我们希望记录我们的经验和建议"
    },
    {
      "indent": 3,
      "text": "for, lambda elsewhere, culminating in a \"Best Current Practice\" document.}",
      "zh-CHS": "例如，lambda在其他地方发布了一份“最佳实践”文件"
    },
    {
      "indent": 3,
      "text": "Since a pseudorandom number sequence is employed, the sequence of times, and hence the value of the sample, is not fully specified. Pseudorandom number generators of good quality will be needed to achieve the desired qualities.",
      "zh-CHS": "由于采用了伪随机数序列，因此没有完全指定时间序列以及样本值。为了达到所需的质量，需要高质量的伪随机数发生器。"
    },
    {
      "indent": 3,
      "text": "The sample is defined in terms of a Poisson process both to avoid the effects of self-synchronization and also capture a sample that is statistically as unbiased as possible. The Poisson process is used to schedule the loss measurements. The test packets will generally not arrive at Dst according to a Poisson distribution, since they are influenced by the network. Time-slotted links described in Section 3.4 [RFC7312] can greatly modify the sample characteristics. The main concern is that unbiased packet streams with randomized inter-packet time intervals will be converted to some new distribution after encountering a time-slotted link, possibly with strong periodic characteristics instead.",
      "zh-CHS": "根据泊松过程定义样本，以避免自同步的影响，并捕获统计上尽可能无偏的样本。泊松过程用于安排损失测量。测试数据包通常不会根据泊松分布到达Dst，因为它们受到网络的影响。第3.4节[RFC7312]中描述的时隙链路可以极大地修改样本特征。主要关注的是，具有随机分组间时间间隔的无偏分组流在遇到时隙链路后将被转换为一些新的分布，而可能具有强周期性特征。"
    },
    {
      "indent": 3,
      "text": "{Comment: there is, of course, no claim that real Internet traffic arrives according to a Poisson arrival process.",
      "zh-CHS": "{注释：当然，没有人声称真正的互联网流量是按照泊松到达过程到达的。"
    },
    {
      "indent": 3,
      "text": "It is important to note that, in contrast to this metric, loss ratios observed by transport connections do not reflect unbiased samples. For example, TCP transmissions both (1) occur in bursts, which can induce loss due to the burst volume that would not otherwise have been observed, and (2) adapt their transmission rate in an attempt to minimize the loss ratio observed by the connection.}",
      "zh-CHS": "需要注意的是，与此指标相反，传输连接观察到的损耗率并不反映无偏样本。例如，TCP传输（1）以突发方式发生，这可能导致由于突发量而导致的损失，否则将无法观察到，以及（2）调整其传输速率以尝试最小化连接观察到的损失率。}"
    },
    {
      "indent": 3,
      "text": "All the singleton Type-P-One-way-Packet-Loss metrics in the sequence will have the same values of Src, Dst, and Type-P.",
      "zh-CHS": "序列中的所有单例Type-P-One-way-Packet-Loss度量将具有相同的Src、Dst和Type-P值。"
    },
    {
      "indent": 3,
      "text": "Note also that, given one sample that runs from T0 to Tf, and given new time values T0' and Tf' such that T0 <= T0' <= Tf' <= Tf, the subsequence of the given sample whose time values fall between T0' and Tf' are also a valid Type-P-One-way-Packet-Loss-Poisson-Stream sample.",
      "zh-CHS": "还要注意，给定一个从T0运行到Tf的样本，并且给定新的时间值T0'和Tf'，使得T0<=T0'<=Tf'<=Tf'，其时间值介于T0'和Tf'之间的给定样本的子序列也是有效的P型单向丢包泊松流样本。"
    },
    {
      "indent": 0,
      "text": "3.6. Methodologies",
      "section_title": true,
      "zh-CHS": "3.6. 方法论"
    },
    {
      "indent": 3,
      "text": "The methodologies follow directly from:",
      "zh-CHS": "这些方法直接来自："
    },
    {
      "indent": 3,
      "text": "o the selection of specific times using the specified Poisson arrival process, and",
      "zh-CHS": "o 使用指定的泊松到达过程选择特定时间，以及"
    },
    {
      "indent": 3,
      "text": "o the methodologies discussion already given for the singleton Type-P-One-way-Packet-Loss metric.",
      "zh-CHS": "o 已经给出了单例类型P单向丢包度量的方法论讨论。"
    },
    {
      "indent": 3,
      "text": "Care must be given to correctly handle out-of-order arrival of test packets; it is possible that the Src could send one test packet at TS[i], then send a second one (later) at TS[i+1] while the Dst could receive the second test packet at TR[i+1], and then receive the first one (later) at TR[i]. Metrics for reordering may be found in [RFC4737].",
      "zh-CHS": "必须注意正确处理无序到达的测试数据包；Src可能在TS[i]发送一个测试数据包，然后在TS[i+1]发送第二个（稍后），而Dst可能在TR[i+1]接收第二个测试数据包，然后在TR[i]接收第一个（稍后）。可在[RFC4737]中找到重新排序的指标。"
    },
    {
      "indent": 0,
      "text": "3.7. Errors and Uncertainties",
      "section_title": true,
      "zh-CHS": "3.7. 误差和不确定性"
    },
    {
      "indent": 3,
      "text": "In addition to sources of errors and uncertainties associated with methods employed to measure the singleton values that make up the sample, care must be given to analyze the accuracy of the Poisson arrival process of the wire times of the sending of the test packets. Problems with this process could be caused by several things, including problems with the pseudorandom number techniques used to generate the Poisson arrival process. The Framework document shows how to use the Anderson-Darling test to verify the accuracy of the Poisson process over small time frames. {Comment: The goal is to ensure that the test packets are sent \"close enough\" to a Poisson schedule and avoid periodic behavior.}",
      "zh-CHS": "除了与用于测量构成样本的单态值的方法相关的误差和不确定性来源外，还必须注意分析测试数据包发送线时间的泊松到达过程的准确性。这一过程的问题可能由多种因素引起，包括用于生成泊松到达过程的伪随机数技术的问题。框架文档展示了如何使用Anderson-Darling测试来验证小时间范围内泊松过程的准确性。{注释：目标是确保发送的测试数据包“足够接近”泊松时间表，并避免周期性行为。}"
    },
    {
      "indent": 0,
      "text": "3.8. Reporting the Metric",
      "section_title": true,
      "zh-CHS": "3.8. 报告指标"
    },
    {
      "indent": 3,
      "text": "The calibration and context for the underlying singletons MUST be reported along with the stream (see \"Reporting the Metric\" (Section 2.8) for Type-P-One-way-Packet-Loss).",
      "zh-CHS": "基本单例的校准和上下文必须与流一起报告（关于P型单向丢包，请参见“报告度量”（第2.8节）。"
    },
    {
      "indent": 0,
      "text": "4. Some Statistics Definitions for One-Way Packet Loss",
      "section_title": true,
      "zh-CHS": "4. 单向丢包的一些统计定义"
    },
    {
      "indent": 3,
      "text": "Given the sample metric Type-P-One-way-Packet-Loss-Poisson-Stream, we now offer several statistics of that sample. These statistics are offered mostly to be illustrative of what could be done. See [RFC6703] for additional discussion of statistics that are relevant to different audiences.",
      "zh-CHS": "给定样本度量类型P-One-way-Packet-Loss-Poisson-Stream，我们现在提供该样本的几种统计信息。提供这些统计数据主要是为了说明可以做些什么。有关与不同受众相关的统计数据的更多讨论，请参见[RFC6703]。"
    },
    {
      "indent": 0,
      "text": "4.1. Type-P-One-way-Packet-Loss-Ratio",
      "section_title": true,
      "zh-CHS": "4.1. P型单向丢包率"
    },
    {
      "indent": 3,
      "text": "Given a Type-P-One-way-Packet-Loss-Poisson-Stream, the average of all the L values in the stream is the ratio of losses to total packets in the stream. In addition, the Type-P-One-way-Packet-Loss-Ratio is undefined if the sample is empty.",
      "zh-CHS": "给定类型为P-单向-分组丢失-泊松流，流中所有L值的平均值是流中丢失与总分组的比率。此外，如果样本为空，则Type-P-One-way-Packet-Loss-Ratio是未定义的。"
    },
    {
      "indent": 3,
      "text": "For example, suppose we take a sample and the results are as follows:",
      "zh-CHS": "例如，假设我们抽取一个样本，结果如下："
    },
    {
      "indent": 3,
      "text": "Stream1 = <",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<T1, 0>",
      "zh-CHS": "<T1，0>"
    },
    {
      "indent": 3,
      "text": "<T2, 0>",
      "zh-CHS": "<T2，0>"
    },
    {
      "indent": 3,
      "text": "<T3, 1>",
      "zh-CHS": "<T3，1>"
    },
    {
      "indent": 3,
      "text": "<T4, 0>",
      "zh-CHS": "<T4，0>"
    },
    {
      "indent": 3,
      "text": "<T5, 0>",
      "zh-CHS": "<T5，0>"
    },
    {
      "indent": 3,
      "text": ">",
      "zh-CHS": ">"
    },
    {
      "indent": 3,
      "text": "Then, the average of loss results would be 0.2, the loss ratio.",
      "zh-CHS": "然后，损失结果的平均值为0.2，损失率。"
    },
    {
      "indent": 3,
      "text": "Note that, since healthy Internet paths should be operating at loss ratios below 1% (particularly if high delay-bandwidth products are to be sustained), the sample sizes needed might be larger than one would like. Thus, for example, if one wants to discriminate between various fractions of 1% over one-minute periods, then several hundred samples per minute might be needed. This would result in larger values of lambda than one would ordinarily want.",
      "zh-CHS": "请注意，由于健康的Internet路径应在低于1%的损耗率下运行（特别是如果要维持高延迟带宽产品），因此所需的样本量可能比人们希望的要大。因此，例如，如果想要在一分钟内区分1%的各种分数，那么每分钟可能需要几百个样本。这将导致lambda的值大于人们通常想要的值。"
    },
    {
      "indent": 3,
      "text": "Note that although the loss threshold should be set such that any errors in loss are not significant, if the possibility that a packet that arrived is counted as lost due to resource exhaustion is significant compared to the loss ratio of interest, Type-P-One-way-Packet-Loss-Ratio will be meaningless.",
      "zh-CHS": "注意，尽管应设置丢失阈值以使得丢失中的任何错误都不显著，但是如果与感兴趣的丢失率相比，到达的分组被计为由于资源耗尽而丢失的可能性显著，则Type-P-One-way-packet-loss-ratio将是无意义的。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Conducting Internet measurements raises both security and privacy concerns. This memo does not specify an implementation of the metrics, so it does not directly affect the security of the Internet nor of applications that run on the Internet. However, implementations of these metrics must be mindful of security and privacy concerns.",
      "zh-CHS": "进行互联网测量会引起安全和隐私问题。此备忘录未指定指标的实现，因此它不会直接影响Internet或在Internet上运行的应用程序的安全性。然而，这些指标的实现必须考虑安全和隐私问题。"
    },
    {
      "indent": 3,
      "text": "There are two types of security concerns: potential harm caused by the measurements and potential harm to the measurements. The measurements could cause harm because they are active and inject packets into the network. The measurement parameters MUST be carefully selected so that the measurements inject trivial amounts of additional traffic into the networks they measure. If they inject",
      "zh-CHS": "有两种类型的安全问题：由测量引起的潜在危害和对测量的潜在危害。这些测量可能会造成危害，因为它们处于活动状态，并将数据包注入网络。必须仔细选择测量参数，以便测量将少量的额外流量注入到它们测量的网络中。如果他们注射"
    },
    {
      "indent": 3,
      "text": "\"too much\" traffic, they can skew the results of the measurement and in extreme cases cause congestion and denial of service.",
      "zh-CHS": "“太多”的流量，可能会扭曲测量结果，在极端情况下会导致拥塞和拒绝服务。"
    },
    {
      "indent": 3,
      "text": "The measurements themselves could be harmed by routers giving measurement traffic a different priority than \"normal\" traffic or by an attacker injecting artificial measurement traffic. If routers can recognize measurement traffic and treat it separately, the measurements will not reflect actual user traffic. If an attacker injects artificial traffic that is accepted as legitimate, the loss ratio will be artificially lowered. Therefore, the measurement methodologies SHOULD include appropriate techniques to reduce the probability that measurement traffic can be distinguished from \"normal\" traffic. Authentication techniques, such as digital signatures, may be used where appropriate to guard against injected traffic attacks.",
      "zh-CHS": "路由器给予测量流量不同于“正常”流量的优先级，或者攻击者注入人工测量流量，可能会损害测量本身。如果路由器能够识别测量流量并单独处理，那么测量将不会反映实际的用户流量。如果攻击者注入被认为合法的人工流量，则损失率将被人为降低。因此，测量方法应包括适当的技术，以降低测量流量可与“正常”流量区分的概率。在适当的情况下，可以使用诸如数字签名之类的认证技术来防止注入流量攻击。"
    },
    {
      "indent": 3,
      "text": "When considering privacy of those involved in measurement or those whose traffic is measured, the sensitive information available to potential observers is greatly reduced when using active techniques that are within this scope of work. Passive observations of user traffic for measurement purposes raise many privacy issues. We refer the reader to the privacy considerations described in the Large Scale Measurement of Broadband Performance (LMAP) Framework [RFC7594], which covers active and passive techniques.",
      "zh-CHS": "当考虑到参与测量的人或其流量被测量的人的隐私时，当使用此工作范围内的主动技术时，潜在观察者可用的敏感信息会大大减少。出于测量目的对用户流量进行被动观测会引起许多隐私问题。我们建议读者参考大规模宽带性能测量（LMAP）框架[RFC7594]中描述的隐私注意事项，该框架涵盖主动和被动技术。"
    },
    {
      "indent": 3,
      "text": "Collecting measurements or using measurement results for reconnaissance to assist in subsequent system attacks is quite common. Access to measurement results or control of the measurement systems to perform reconnaissance should be guarded against. See Section 7 of [RFC7594] (the Security Considerations section of the LMAP Framework) for system requirements that help to avoid measurement system compromise.",
      "zh-CHS": "收集测量值或使用测量结果进行侦察以协助后续系统攻击是很常见的。应防止接触测量结果或控制测量系统进行侦察。参见[RFC7594]第7节（LMAP框架的安全注意事项部分），了解有助于避免测量系统受损的系统要求。"
    },
    {
      "indent": 0,
      "text": "6. Changes from RFC 2680",
      "section_title": true,
      "zh-CHS": "6. 对RFC 2680的更改"
    },
    {
      "indent": 3,
      "text": "The text above constitutes a revision to RFC 2680, which is now an Internet Standard.",
      "zh-CHS": "上述文本构成对RFC 2680的修订，RFC 2680现在是一个互联网标准。"
    },
    {
      "indent": 3,
      "text": "[RFC7290] provides the test plan and results supporting [RFC2680] advancement along the Standards Track, according to the process in [RFC6576]. The conclusions of [RFC7290] list four minor modifications for inclusion:",
      "zh-CHS": "[RFC7290]根据[RFC6576]中的流程，提供了支持[RFC2680]沿着标准轨道前进的测试计划和结果。[RFC7290]的结论列出了四个小的修改："
    },
    {
      "indent": 3,
      "text": "1. Section 6.2.3 of [RFC7290] asserts that the assumption of post-processing to enforce a constant waiting time threshold is compliant and that the text of the RFC should be revised slightly to include this point. The applicability of post-processing was added in the last list item of Section 2.6, above.",
      "zh-CHS": "1. [RFC7290]第6.2.3节声称，实施恒定等待时间阈值的后处理假设是符合的，RFC的文本应稍作修改，以包括这一点。在上述第2.6节的最后一个列表项中增加了后处理的适用性。"
    },
    {
      "indent": 3,
      "text": "2. Section 6.5 of [RFC7290] indicates that the Type-P-One-way-Packet-Loss-Average statistic is more commonly called a Packet Loss Ratio, so it is renamed in this document (this small discrepancy does not affect candidacy for advancement). The renaming was implemented in Section 4.1, above.",
      "zh-CHS": "2. [RFC7290]第6.5节指出，类型-P-单向-丢包-平均统计通常被称为丢包率，因此在本文件中对其进行了重命名（这一微小差异不影响晋升候选资格）。重命名在上述第4.1节中实施。"
    },
    {
      "indent": 3,
      "text": "3. The IETF has reached consensus on guidance for reporting metrics in [RFC6703], and the memo is referenced this document to incorporate recent experience where appropriate. This reference was added in the last list item of Section 2.6, in Section 2.8, and in Section 4 above.",
      "zh-CHS": "3. IETF已就[RFC6703]中的报告指标指南达成共识，本文件引用了备忘录，以在适当情况下纳入近期经验。上述第2.6节、第2.8节和第4节的最后一个列表项中添加了该参考。"
    },
    {
      "indent": 3,
      "text": "4. There are currently two errata with status \"Verified\" (EID 1528) and \"Held for Document Update\" (EID 3186) for [RFC2680], and these minor revisions were incorporated in Sections 1 and 2.7.",
      "zh-CHS": "4. [RFC2680]目前有两个状态为“已验证”（EID 1528）和“待文件更新”（EID 3186）的勘误表，这些小修订包含在第1节和第2.7节中。"
    },
    {
      "indent": 3,
      "text": "A number of updates to the [RFC2680] text have been implemented in the text to reference key IPPM RFCs that were approved after [RFC2680] (see Sections 3 and 3.6, above) and to address comments on the IPPM mailing list describing current conditions and experience.",
      "zh-CHS": "文本中对[RFC2680]文本进行了大量更新，以参考[RFC2680]之后批准的关键IPPM RFC（见上文第3节和第3.6节），并解决IPPM邮件列表中描述当前条件和经验的评论。"
    },
    {
      "indent": 3,
      "text": "1. Near the end of Section 1.1, there is an update of a network example using ATM, a clarification of TCP's affect on queue occupation, and discussion of the importance of one-way delay measurement.",
      "zh-CHS": "1. 在第1.1节末尾，更新了使用ATM的网络示例，阐明了TCP对队列占用的影响，并讨论了单向延迟测量的重要性。"
    },
    {
      "indent": 3,
      "text": "2. Clarification of the definition of \"resolution\" in Section 1.2.",
      "zh-CHS": "2. 澄清第1.2节中“决议”的定义。"
    },
    {
      "indent": 3,
      "text": "3. Explicit inclusion of the maximum waiting time input parameter in Sections 2.2, 2.4, and 3.2, reflecting recognition of this parameter in more recent RFCs and ITU-T Recommendation Y.1540.",
      "zh-CHS": "3. 第2.2节、第2.4节和第3.2节中明确包含了最大等待时间输入参数，反映了最近的RFCs和ITU-T建议Y.1540对该参数的认可。"
    },
    {
      "indent": 3,
      "text": "4. Addition of a reference to RFC 6703 in the discussion of packet lifetime and application timeouts in Section 2.5.",
      "zh-CHS": "4. 在第2.5节讨论数据包寿命和应用程序超时时，增加了对RFC 6703的参考。"
    },
    {
      "indent": 3,
      "text": "5. Replaced \"precedence\" with updated terminology (DS Field) in Sections 2.6 and 2.8.1 (with reference).",
      "zh-CHS": "5. 用第2.6节和第2.8.1节（参考）中更新的术语（DS字段）替换“优先级”。"
    },
    {
      "indent": 3,
      "text": "6. Added parenthetical guidance on minimizing the interval between timestamp placement to send time or reception time in Section 2.6. Also, the text now recognizes the timestamp acquisition process and that practical systems measure both delay and loss (thus requiring the max waiting time parameter).",
      "zh-CHS": "6. 在第2.6节中增加了关于最小化时间戳放置到发送时间或接收时间之间的间隔的附加指南。此外，文本现在识别时间戳获取过程，并且实际系统测量延迟和损失（因此需要最大等待时间参数）。"
    },
    {
      "indent": 3,
      "text": "7. Added a reference to RFC 3432 regarding periodic sampling alongside Poisson sampling in Section 3 and also noted that a truncated Poisson distribution may be needed with modern networks as described in the IPPM Framework update [RFC7312].",
      "zh-CHS": "7. 在第3节中增加了对RFC 3432的参考，涉及定期采样和泊松采样，并注意到现代网络可能需要截断泊松分布，如IPPM框架更新[RFC7312]中所述。"
    },
    {
      "indent": 3,
      "text": "8. Recognition that time-slotted links described in [RFC7312] can greatly modify the sample characteristics, in Section 3.5.",
      "zh-CHS": "8. 认识到[RFC7312]中描述的时隙链路可以极大地修改第3.5节中的样本特征。"
    },
    {
      "indent": 3,
      "text": "9. Added a reference to RFC 4737 regarding reordering metrics in the related discussion of Section 3.6, \"Methodologies\".",
      "zh-CHS": "9. 在第3.6节“方法论”的相关讨论中，增加了对RFC 4737关于重新排序指标的参考。"
    },
    {
      "indent": 3,
      "text": "10. Expanded and updated the material on privacy and added cautions on use of measurements for reconnaissance in Section 5, \"Security Considerations\".",
      "zh-CHS": "10. 扩展并更新了隐私资料，并在第5节“安全注意事项”中增加了侦察测量使用注意事项。"
    },
    {
      "indent": 3,
      "text": "Section 5.4.4 of [RFC6390] suggests a common template for performance metrics partially derived from previous IPPM and Benchmarking Methodology Working Group (BMWG) RFCs, but it also contains some new items. All of the normative parts of [RFC6390] are covered, but not quite in the same section names or orientation. Several of the informative parts are covered. Maintaining the familiar outline of IPPM literature has value and minimizes unnecessary differences between this revised RFC and current/future IPPM RFCs.",
      "zh-CHS": "[RFC6390]第5.4.4节提出了一个通用的绩效指标模板，该模板部分源自先前的IPPM和基准方法工作组（BMWG）RFC，但也包含一些新项目。[RFC6390]的所有规范性部分均已涵盖，但并不完全在相同的章节名称或方向中。介绍了其中的几个信息部分。保持熟悉的IPPM文献大纲具有价值，并将修订后的RFC和当前/未来IPPM RFC之间不必要的差异降至最低。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, DOI 10.17487/RFC0791, September 1981, <http://www.rfc-editor.org/info/rfc791>.",
      "zh-CHS": "[RFC791]Postel，J.，“互联网协议”，STD 5，RFC 791，DOI 10.17487/RFC07911981年9月<http://www.rfc-editor.org/info/rfc791>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC2330] Paxson, V., Almes, G., Mahdavi, J., and M. Mathis, \"Framework for IP Performance Metrics\", RFC 2330, DOI 10.17487/RFC2330, May 1998, <http://www.rfc-editor.org/info/rfc2330>.",
      "zh-CHS": "[RFC2330]Paxson，V.，Almes，G.，Mahdavi，J.，和M.Mathis，“IP性能度量框架”，RFC 2330，DOI 10.17487/RFC2330，1998年5月<http://www.rfc-editor.org/info/rfc2330>."
    },
    {
      "indent": 3,
      "text": "[RFC2678] Mahdavi, J. and V. Paxson, \"IPPM Metrics for Measuring Connectivity\", RFC 2678, DOI 10.17487/RFC2678, September 1999, <http://www.rfc-editor.org/info/rfc2678>.",
      "zh-CHS": "[RFC2678]Mahdavi，J.和V.Paxson，“测量连接性的IPPM度量”，RFC 2678，DOI 10.17487/RFC2678，1999年9月<http://www.rfc-editor.org/info/rfc2678>."
    },
    {
      "indent": 3,
      "text": "[RFC2680] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Packet Loss Metric for IPPM\", RFC 2680, DOI 10.17487/RFC2680, September 1999, <http://www.rfc-editor.org/info/rfc2680>.",
      "zh-CHS": "[RFC2680]Almes，G.，Kalidini，S.，和M.Zekauskas，“IPPM的单向数据包丢失度量”，RFC 2680，DOI 10.17487/RFC2680，1999年9月<http://www.rfc-editor.org/info/rfc2680>."
    },
    {
      "indent": 3,
      "text": "[RFC2780] Bradner, S. and V. Paxson, \"IANA Allocation Guidelines For Values In the Internet Protocol and Related Headers\", BCP 37, RFC 2780, DOI 10.17487/RFC2780, March 2000, <http://www.rfc-editor.org/info/rfc2780>.",
      "zh-CHS": "[RFC2780]Bradner，S.和V.Paxson，“互联网协议和相关报头中值的IANA分配指南”，BCP 37，RFC 2780，DOI 10.17487/RFC2780，2000年3月<http://www.rfc-editor.org/info/rfc2780>."
    },
    {
      "indent": 3,
      "text": "[RFC3432] Raisanen, V., Grotefeld, G., and A. Morton, \"Network performance measurement with periodic streams\", RFC 3432, DOI 10.17487/RFC3432, November 2002, <http://www.rfc-editor.org/info/rfc3432>.",
      "zh-CHS": "[RFC3432]Raisanen，V.，Grotefeld，G.，和A.Morton，“周期流的网络性能测量”，RFC 3432，DOI 10.17487/RFC3432，2002年11月<http://www.rfc-editor.org/info/rfc3432>."
    },
    {
      "indent": 3,
      "text": "[RFC6576] Geib, R., Ed., Morton, A., Fardid, R., and A. Steinmitz, \"IP Performance Metrics (IPPM) Standard Advancement Testing\", BCP 176, RFC 6576, DOI 10.17487/RFC6576, March 2012, <http://www.rfc-editor.org/info/rfc6576>.",
      "zh-CHS": "[RFC6576]Geib，R.，Ed.，Morton，A.，Fardid，R.，和A.Steinmitz，“IP性能度量（IPPM）标准推进测试”，BCP 176，RFC 6576，DOI 10.17487/RFC6576，2012年3月<http://www.rfc-editor.org/info/rfc6576>."
    },
    {
      "indent": 3,
      "text": "[RFC7312] Fabini, J. and A. Morton, \"Advanced Stream and Sampling Framework for IP Performance Metrics (IPPM)\", RFC 7312, DOI 10.17487/RFC7312, August 2014, <http://www.rfc-editor.org/info/rfc7312>.",
      "zh-CHS": "[RFC7312]Fabini，J.和A.Morton，“IP性能度量的高级流和采样框架（IPPM）”，RFC 7312，DOI 10.17487/RFC7312，2014年8月<http://www.rfc-editor.org/info/rfc7312>."
    },
    {
      "indent": 3,
      "text": "[RFC7679] Almes, G., Kalidindi, S., Zekauskas, M., and A. Morton, Ed., \"A One-Way Delay Metric for IP Performance Metrics (IPPM)\", STD 81, RFC 7679, DOI 10.17487/RFC7679, January 2016, <http://www.rfc-editor.org/info/rfc7679>.",
      "zh-CHS": "[RFC7679]Almes，G.，Kalidini，S.，Zekauskas，M.，和A.Morton，Ed.，“IP性能度量（IPPM）的单向延迟度量”，STD 81，RFC 7679，DOI 10.17487/RFC7679，2016年1月<http://www.rfc-editor.org/info/rfc7679>."
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[IPPM-UPDATES] Morton, A., Fabini, J., Elkins, N., Ackermann, M., and V. Hegde, \"Updates for IPPM's Active Metric Framework: Packets of Type-P and Standard-Formed Packets\", Work in Progress, draft-morton-ippm-2330-stdform-typep-02, December 2015.",
      "zh-CHS": "[IPPM-更新]Morton，A.，Fabini，J.，Elkins，N.，Ackermann，M.，和V.Hegde，“IPPM主动度量框架的更新：P型数据包和标准格式数据包”，正在进行的工作，草稿-Morton-IPPM-2330-stdform-typep-022015年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3168] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, DOI 10.17487/RFC3168, September 2001, <http://www.rfc-editor.org/info/rfc3168>.",
      "zh-CHS": "[RFC3168]Ramakrishnan，K.，Floyd，S.，和D.Black，“向IP添加显式拥塞通知（ECN）”，RFC 3168，DOI 10.17487/RFC3168，2001年9月<http://www.rfc-editor.org/info/rfc3168>."
    },
    {
      "indent": 3,
      "text": "[RFC4737] Morton, A., Ciavattone, L., Ramachandran, G., Shalunov, S., and J. Perser, \"Packet Reordering Metrics\", RFC 4737, DOI 10.17487/RFC4737, November 2006, <http://www.rfc-editor.org/info/rfc4737>.",
      "zh-CHS": "[RFC4737]Morton，A.，Ciavattone，L.，Ramachandran，G.，Shalunov，S.，和J.Perser，“数据包重新排序度量”，RFC 4737，DOI 10.17487/RFC4737，2006年11月<http://www.rfc-editor.org/info/rfc4737>."
    },
    {
      "indent": 3,
      "text": "[RFC6390] Clark, A. and B. Claise, \"Guidelines for Considering New Performance Metric Development\", BCP 170, RFC 6390, DOI 10.17487/RFC6390, October 2011, <http://www.rfc-editor.org/info/rfc6390>.",
      "zh-CHS": "[RFC6390]Clark，A.和B.Claise，“考虑新绩效指标开发的指南”，BCP 170，RFC 6390，DOI 10.17487/RFC6390，2011年10月<http://www.rfc-editor.org/info/rfc6390>."
    },
    {
      "indent": 3,
      "text": "[RFC6703] Morton, A., Ramachandran, G., and G. Maguluri, \"Reporting IP Network Performance Metrics: Different Points of View\", RFC 6703, DOI 10.17487/RFC6703, August 2012, <http://www.rfc-editor.org/info/rfc6703>.",
      "zh-CHS": "[RFC6703]Morton，A.，Ramachandran，G.，和G.Maguluri，“报告IP网络性能指标：不同观点”，RFC 6703，DOI 10.17487/RFC6703，2012年8月<http://www.rfc-editor.org/info/rfc6703>."
    },
    {
      "indent": 3,
      "text": "[RFC7290] Ciavattone, L., Geib, R., Morton, A., and M. Wieser, \"Test Plan and Results for Advancing RFC 2680 on the Standards Track\", RFC 7290, DOI 10.17487/RFC7290, July 2014, <http://www.rfc-editor.org/info/rfc7290>.",
      "zh-CHS": "[RFC7290]Ciavattone，L.，Geib，R.，Morton，A.，和M.Wieser，“在标准轨道上推进RFC 2680的测试计划和结果”，RFC 7290，DOI 10.17487/RFC7290，2014年7月<http://www.rfc-editor.org/info/rfc7290>."
    },
    {
      "indent": 3,
      "text": "[RFC7594] Eardley, P., Morton, A., Bagnulo, M., Burbridge, T., Aitken, P., and A. Akhter, \"A Framework for Large-Scale Measurement of Broadband Performance (LMAP)\", RFC 7594, DOI 10.17487/RFC7594, September 2015, <http://www.rfc-editor.org/info/rfc7594>.",
      "zh-CHS": "[RFC7594]Eardley，P.，Morton，A.，Bagnulo，M.，Burbridge，T.，Aitken，P.，和A.Akhter，“宽带性能的大规模测量框架（LMAP）”，RFC 7594，DOI 10.17487/RFC7594，2015年9月<http://www.rfc-editor.org/info/rfc7594>."
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "For [RFC2680], thanks are due to Matt Mathis for encouraging this work and for calling attention on so many occasions to the significance of packet loss. Thanks are due also to Vern Paxson for his valuable comments on early drafts and to Garry Couch and Will Leland for several useful suggestions.",
      "zh-CHS": "对于[RFC2680]，感谢Matt Mathis鼓励这项工作，并多次提醒人们注意数据包丢失的重要性。感谢Vern Paxson对早期草稿的宝贵意见，以及Garry Coach和Will Leland提出的一些有用建议。"
    },
    {
      "indent": 3,
      "text": "For this document, thanks to Joachim Fabini, Ruediger Geib, Nalini Elkins, and Barry Constantine for sharing their measurement experience as part of their careful reviews. Brian Carpenter and Scott Bradner provided useful feedback at IETF Last Call.",
      "zh-CHS": "对于本文档，感谢Joachim Fabini、Ruediger Geib、Nalini Elkins和Barry Constantine分享他们的测量经验，作为他们仔细审查的一部分。Brian Carpenter和Scott Bradner在IETF的最后一次通话中提供了有用的反馈。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Guy Almes Texas A&M",
      "zh-CHS": "盖伊·阿尔姆斯德克萨斯A&M"
    },
    {
      "indent": 3,
      "text": "Email: almes@acm.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Sunil Kalidindi Ixia",
      "zh-CHS": "苏尼尔卡利迪伊希亚酒店"
    },
    {
      "indent": 3,
      "text": "Email: skalidindi@ixiacom.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Matt Zekauskas Internet2",
      "zh-CHS": "Matt Zekauskas互联网2"
    },
    {
      "indent": 3,
      "text": "Email: matt@internet2.edu",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Al Morton (editor) AT&T Labs 200 Laurel Avenue South Middletown, NJ 07748 United States",
      "zh-CHS": "美国新泽西州劳雷尔大道南米德尔顿200号AT&T实验室Al Morton（编辑）07748"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 1571\nFax:   +1 732 368 1192\nEmail: acmorton@att.com\nURI:   http://home.comcast.net/~acmacm/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}