{
  "title": {
    "text": "RFC 7669: Assigning Digital Object Identifiers to RFCs",
    "zh-CHS": "RFC 7669"
  },
  "number": 7669,
  "created_at": "2021-10-31 12:50:59.078522+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                              J. Levine\nRequest for Comments: 7669                          Taughannock Networks\nCategory: Informational                                     October 2015\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Assigning Digital Object Identifiers to RFCs",
      "zh-CHS": "向RFC分配数字对象标识符"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the way that Digital Object Identifiers (DOIs) are assigned to past and future RFCs. The DOI is a widely used system that assigns unique identifiers to digital documents that can be queried and managed in a consistent fashion.",
      "zh-CHS": "本文档描述了数字对象标识符（DOI）分配给过去和未来RFC的方式。DOI是一个广泛使用的系统，它为可以以一致方式查询和管理的数字文档分配唯一标识符。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。它代表了互联网体系结构委员会（IAB）的共识。IAB批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7669.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7669."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2015 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Structure and Resolution of DOIs  . . . . . . . . . . . . . .   3\n3.  DOIs for RFCs . . . . . . . . . . . . . . . . . . . . . . . .   4\n4.  The Process of Assigning DOIs . . . . . . . . . . . . . . . .   4\n  4.1.  Getting a DOI Prefix  . . . . . . . . . . . . . . . . . .   4\n  4.2.  Retroactively Assigning DOIs  . . . . . . . . . . . . . .   5\n  4.3.  Assigning DOIs to New RFCs  . . . . . . . . . . . . . . .   5\n  4.4.  Use of DOIs in RFCs . . . . . . . . . . . . . . . . . . .   5\n  4.5.  Possible Future Work  . . . . . . . . . . . . . . . . . .   6\n5.  Internationalization  . . . . . . . . . . . . . . . . . . . .   6\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n7.  Informative References  . . . . . . . . . . . . . . . . . . .   6\nIAB Members at the Time of Approval . . . . . . . . . . . . . . .   7\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   8",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The Digital Object Identifier (DOI) system assigns unique identifiers to digital documents that can be queried and managed in a consistent fashion. The structure of DOIs is defined by ISO 26324:2012 [ISO-DOI] and is implemented by a group of registration agencies coordinated by the International DOI Foundation.",
      "zh-CHS": "数字对象标识符（DOI）系统为可以以一致方式查询和管理的数字文档分配唯一标识符。DOIS的结构由ISO26324:201[ISO-DOI]定义，并由一组由国际DOI基金会协调的注册机构实施。"
    },
    {
      "indent": 3,
      "text": "Each DOI is associated with bibliographic metadata about the object, including one or more URIs where the object can be found. The metadata is stored in a public database with entries retrieved via HTTP.",
      "zh-CHS": "每个DOI都与对象的书目元数据相关联，包括可以找到对象的一个或多个URI。元数据存储在公共数据库中，通过HTTP检索条目。"
    },
    {
      "indent": 3,
      "text": "DOIs are widely used by publishers and consumers of technical journals and other technical material published online.",
      "zh-CHS": "DOI被在线出版的技术期刊和其他技术资料的出版商和消费者广泛使用。"
    },
    {
      "indent": 3,
      "text": "Page 15 of [CITABILITY] indicates that (note that citations have been omitted):",
      "zh-CHS": "[CITABILITY]第15页指出（注意引用已被省略）："
    },
    {
      "indent": 6,
      "text": "Typical web addresses are unreliable for locating online resources, because they can move, change or disappear entirely. But persistent identifiers are fixed, with an infrastructure that allows for the location of the item to be updated. The result is that the identifier can provide persistent access to the data. DataCite provides such a service, and DOIs (used by DataCite) were by far the identifier most commonly mentioned by interviewees, closely followed by Handles (on which the DOI system is built). There was a keen preference for DOIs from interviewees because this is a system already used and understood by publishers for traditional publications and so the barrier to uptake would presumably be lower than for an entirely novel system.",
      "zh-CHS": "典型的web地址对于定位在线资源是不可靠的，因为它们可以完全移动、更改或消失。但是持久标识符是固定的，有一个允许更新项目位置的基础设施。结果是标识符可以提供对数据的持久访问。DataCite提供了这样的服务，到目前为止，DOI（DataCite使用）是受访者最常提到的标识符，紧随其后的是句柄（DOI系统是基于句柄构建的）。受访者对内政部有着强烈的偏好，因为这是一个出版商已经为传统出版物使用和理解的系统，因此接受的障碍可能比完全新颖的系统要低。"
    },
    {
      "indent": 3,
      "text": "Some scholarly publishers accept DOIs as references in published documents, and some versions of BibTeX can automatically retrieve the bibliographic data for a DOI and format it. DOIs may have other advantages, such as making it easier to find the free online versions of RFCs rather than paywalled copies when following references or using some document indexes.",
      "zh-CHS": "一些学术出版商接受DOI作为已发布文档中的参考，一些版本的BibTeX可以自动检索DOI的书目数据并对其进行格式化。DOIs可能还有其他优势，例如在遵循参考资料或使用某些文档索引时，可以更容易地找到RFC的免费在线版本，而不是付费副本。"
    },
    {
      "indent": 3,
      "text": "The benefits of DOIs apply equally to documents from all of the RFC submission streams, so all RFCs are assigned DOIs.",
      "zh-CHS": "DOI的好处同样适用于所有RFC提交流中的文档，因此所有RFC都分配有DOI。"
    },
    {
      "indent": 0,
      "text": "2. Structure and Resolution of DOIs",
      "section_title": true,
      "zh-CHS": "2. DOIs的结构和分辨率"
    },
    {
      "indent": 3,
      "text": "DOIs are an application of the Handle System defined by RFCs [RFC3650], [RFC3651], and [RFC3652]. For example, a DOI for an RFC might be as follows:",
      "zh-CHS": "DOI是由RFCs[RFC3650]、[RFC3651]和[RFC3652]定义的句柄系统的应用程序。例如，RFC的DOI可能如下所示："
    },
    {
      "indent": 6,
      "text": "10.17487/rfc1149",
      "zh-CHS": "10.17487/rfc1149"
    },
    {
      "indent": 3,
      "text": "The first part of a DOI is the number 10, which means a DOI within the Handle System, followed by a dot and a unique number assigned to a publisher, in this case 17487. This part is the DOI prefix. Following that is a slash and a text string assigned by the publisher, called the DOI suffix.",
      "zh-CHS": "DOI的第一部分是数字10，表示句柄系统中的DOI，后面是一个点和分配给发布者的唯一数字，在本例中为17487。这部分是DOI前缀。接下来是由发布者指定的斜杠和文本字符串，称为DOI后缀。"
    },
    {
      "indent": 3,
      "text": "DOIs are treated as opaque identifiers. The DOI suffixes assigned to RFCs are currently based on the \"doc-id\" field of the RFC index in XML (rfc-index.xml), but the suffix of future RFCs might be based on something else if circumstances change. Hence, the reliable way to find the DOI for an RFC is not to guess, but to look it up in the RFC index or on the RFC Editor website <https://www.rfc-editor.org/>. RFC references created from entries in the usual bibxml libraries will have DOIs included automatically.",
      "zh-CHS": "DOI被视为不透明标识符。分配给RFC的DOI后缀当前基于XML中RFC索引（RFC index.XML）的“doc id”字段，但如果情况发生变化，未来RFC的后缀可能基于其他内容。因此，找到RFC的DOI的可靠方法不是猜测，而是在RFC索引或RFC编辑器网站上查找<https://www.rfc-editor.org/>. 从常用bibxml库中的条目创建的RFC引用将自动包含DOI。"
    },
    {
      "indent": 3,
      "text": "Although the Handle System has its own protocol described in [RFC3652], the usual way to look up a DOI is to use web lookup. A proposed \"doi:\" URN was never widely implemented, so the standard way to look up a DOI is to use the public HTTP proxy at <https://dx.doi.org>. The example DOI above could be looked up at:",
      "zh-CHS": "尽管Handle系统有[RFC3652]中描述的自己的协议，但查找DOI的常用方法是使用web查找。提议的“doi:”URN从未得到广泛实现，因此查找doi的标准方法是在<https://dx.doi.org>. 可以查看上面的示例DOI："
    },
    {
      "indent": 6,
      "text": "https://dx.doi.org/10.17487/rfc1149",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Whenever a publisher assigns a DOI, it provides the bibliographic metadata for the object (henceforth called a document, since that is what they are in this context) to its registration agency that then makes it available to clients that look up DOIs. The document's metadata is typically uploaded to the registration agency in XML using an HTTP-based API. Users or publishing software can retrieve",
      "zh-CHS": "每当出版商分配DOI时，它都会向其注册机构提供对象的书目元数据（此后称为文档，因为在本文中它们就是文档），然后注册机构会将其提供给查找DOI的客户。文档的元数据通常使用基于HTTP的API以XML形式上传到注册机构。用户或发布软件可以检索"
    },
    {
      "indent": 3,
      "text": "the metadata by fetching the DOI's URL and using standard HTTP content negotiation to request application/citeproc+json, application/rdf+xml, or other bibliographic formats.",
      "zh-CHS": "元数据是通过获取DOI的URL并使用标准HTTP内容协商来请求application/citeproc+json、application/rdf+xml或其他书目格式。"
    },
    {
      "indent": 3,
      "text": "Publishers have considerable flexibility as to what resides at the URI(s) to which a DOI refers. Sometimes it's the document itself, while for commercial publishers it's typically a page with the abstract, bibliographic information, and some way to buy the actual document. Because some RFCs are in multiple formats (e.g., Postscript and text), an appropriate URI is that of the RFC Editor's info page that has the document's abstract and links to the document(s) in various formats. Hence, the URI above, when fetched via an HTTP request that accepts text/html, redirects to:",
      "zh-CHS": "对于DOI引用的URI中驻留的内容，发布者具有相当大的灵活性。有时是文档本身，而对于商业出版商来说，它通常是一个包含摘要、书目信息以及购买实际文档的某种方式的页面。由于某些RFC采用多种格式（例如Postscript和文本），因此适当的URI是RFC编辑器的信息页面的URI，该页面包含文档摘要和各种格式的文档链接。因此，当通过接受text/html的HTTP请求获取上述URI时，会重定向到："
    },
    {
      "indent": 6,
      "text": "https://www.rfc-editor.org/info/rfc1149",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "More information on the structure and use of DOIs is in the DOI Handbook [DOI-HB].",
      "zh-CHS": "有关内政部结构和使用的更多信息，请参阅内政部手册[DOI-HB]。"
    },
    {
      "indent": 0,
      "text": "3. DOIs for RFCs",
      "section_title": true,
      "zh-CHS": "3. RFC的DOI"
    },
    {
      "indent": 3,
      "text": "With DOIs assigned to each RFC, it is useful to include DOI information in the XML bibliography as a \"seriesInfo\" item, so that rendering engines can display it if desired. Online databases and indexes that include RFCs should be updated to include the DOI, e.g., the ACM Digital Library. (A practical advantage of this is that the DOI would link directly to the RFC Editor, rather than perhaps to a copy of an RFC behind a paywall.)",
      "zh-CHS": "将DOI分配给每个RFC后，将DOI信息作为“seriesInfo”项包含在XML参考书目中是很有用的，这样渲染引擎可以根据需要显示它。应更新包括RFC的在线数据库和索引，以包括DOI，例如ACM数字图书馆。（这样做的一个实际优势是内政部将直接链接到RFC编辑器，而不是可能链接到付费墙后面的RFC副本。）"
    },
    {
      "indent": 3,
      "text": "Since RFCs are immutable, existing RFCs still don't mention their own DOIs within the RFCs themselves, but putting their DOIs into indexes would provide value.",
      "zh-CHS": "由于RFC是不可变的，现有的RFC仍然没有在RFC本身中提到它们自己的DOI，但是将它们的DOI放入索引将提供价值。"
    },
    {
      "indent": 0,
      "text": "4. The Process of Assigning DOIs",
      "section_title": true,
      "zh-CHS": "4. 分配doi的过程"
    },
    {
      "indent": 3,
      "text": "There are three phases to assigning DOIs to RFCs: getting a DOI prefix, retroactively assigning DOIs to existing documents, and updating the publication process to assign DOIs as new RFCs are published.",
      "zh-CHS": "将DOI分配给RFC分为三个阶段：获取DOI前缀、追溯性地将DOI分配给现有文档以及更新发布过程以在发布新RFC时分配DOI。"
    },
    {
      "indent": 0,
      "text": "4.1. Getting a DOI Prefix",
      "section_title": true,
      "zh-CHS": "4.1. 获取DOI前缀"
    },
    {
      "indent": 3,
      "text": "There are ten registration agencies [DOI-RA] that assign DOI prefixes. Most of them serve specialized audiences or limited geographic areas, but there are a few that handle scholarly and technical materials. All registration agencies charge for DOIs to defray the cost of maintaining the metadata databases.",
      "zh-CHS": "有十家注册机构[DOI-RA]分配DOI前缀。其中大多数服务于专业观众或有限的地理区域，但也有少数服务于学术和技术材料。所有登记机构都向内政部收费，以支付维护元数据数据库的费用。"
    },
    {
      "indent": 3,
      "text": "The RFC Editor chose CrossRef, an agency widely used by journal publishers. The prices associated with CrossRef membership are on the order of $660.00 per year for membership, deposit fees of $0.15 cents per document for a bulk upload of the backfile (the existing RFCs), and $1.00 per document to deposit them as they are published.",
      "zh-CHS": "RFC编辑选择了CrossRef，这是一家期刊出版商广泛使用的机构。与CrossRef会员资格相关的价格为每年660.00美元，批量上传回填文件（现有RFC）的每个文件的押金为0.15美元，发布后的每个文件的押金为1.00美元。"
    },
    {
      "indent": 3,
      "text": "The RFC Editor's DOI prefix is 10.17487.",
      "zh-CHS": "RFC编辑器的DOI前缀为10.17487。"
    },
    {
      "indent": 0,
      "text": "4.2. Retroactively Assigning DOIs",
      "section_title": true,
      "zh-CHS": "4.2. 追溯分配DOI"
    },
    {
      "indent": 3,
      "text": "Other than paying the deposit fees, assigning DOIs to all of the existing RFCs was primarily a software problem. The RFC Production Center's internal database was updated to include a DOI field for each RFC, the schema for rfc-index.xml was updated to include a DOI field, and the scripts that create the XML and text indexes were updated to include the DOI for each RFC. A specialized DOI submission script extracted the metadata for all of the RFCs from the XML index and submitted it to the registration agency using the agency's online API.",
      "zh-CHS": "除了支付定金之外，将内政部分配给所有现有的RFC主要是一个软件问题。RFC生产中心的内部数据库更新为包含每个RFC的DOI字段，RFC-index.xml的模式更新为包含DOI字段，创建xml和文本索引的脚本更新为包含每个RFC的DOI。一个专门的DOI提交脚本从XML索引中提取所有RFC的元数据，并使用注册机构的在线API将其提交给注册机构。"
    },
    {
      "indent": 0,
      "text": "4.3. Assigning DOIs to New RFCs",
      "section_title": true,
      "zh-CHS": "4.3. 将DOI分配给新的RFC"
    },
    {
      "indent": 3,
      "text": "As RFCs are published, the publication software assigns a DOI to each new RFC. The submission script extracts the metadata for new RFCs from the XML index and submits the information for new RFCs to the registration agency.",
      "zh-CHS": "随着RFC的发布，发布软件会为每个新RFC分配一个DOI。提交脚本从XML索引中提取新RFC的元数据，并将新RFC的信息提交给注册机构。"
    },
    {
      "indent": 0,
      "text": "4.4. Use of DOIs in RFCs",
      "section_title": true,
      "zh-CHS": "4.4. 在RFC中使用DOI"
    },
    {
      "indent": 3,
      "text": "The DOI agency requests that documents that are assigned DOIs in turn include DOIs when possible when referring to other organizations' documents. DOIs can be listed using the existing seriesInfo field in the xml2rfc reference entity, and authors are requested provide DOIs for non-RFC documents when possible. The RFC Production Center might add missing DOIs when it's easy to do so, e.g., when the same reference with a DOI has appeared in a prior RFC, or a quick online search finds the DOI. Where the citation libraries include DOIs, the output (references created from those citation libraries) will include DOIs.",
      "zh-CHS": "内政部机构要求分配给内政部的文件在参考其他组织的文件时尽可能包括内政部。可以使用xml2rfc参考实体中现有的seriesInfo字段列出DOI，并要求作者在可能的情况下为非RFC文档提供DOI。RFC生产中心可能会在容易的情况下添加缺失的DOI，例如，在之前的RFC中出现了与DOI相同的引用，或者快速在线搜索找到了DOI。如果引用库包括DOI，则输出（从这些引用库创建的引用）将包括DOI。"
    },
    {
      "indent": 3,
      "text": "The RFC Style Guide [RFC-STYLE] has been updated to describe the rules for including DOIs in the References sections of RFCs.",
      "zh-CHS": "RFC样式指南[RFC-Style]已经更新，以描述在RFC的参考部分中包含DOI的规则。"
    },
    {
      "indent": 0,
      "text": "4.5. Possible Future Work",
      "section_title": true,
      "zh-CHS": "4.5. 今后可能的工作"
    },
    {
      "indent": 3,
      "text": "Since it is usually possible to retrieve the bibliographic information for a document from its DOI (as BibTeX can do, described above), it might also be worth adding this feature to xml2rfc, so a reference with only a DOI could be automatically fetched and expanded.",
      "zh-CHS": "由于通常可以从文档的DOI中检索文档的书目信息（如上所述，BibTeX可以这样做），因此将此功能添加到xml2rfc中也可能是值得的，因此可以自动获取和扩展仅包含DOI的引用。"
    },
    {
      "indent": 0,
      "text": "5. Internationalization",
      "section_title": true,
      "zh-CHS": "5. 国际化"
    },
    {
      "indent": 3,
      "text": "Adding DOIs presents no new internationalization issues.",
      "zh-CHS": "添加DOI不会带来新的国际化问题。"
    },
    {
      "indent": 3,
      "text": "Since DOIs are opaque, the characters used in any particular DOI are unimportant beyond ensuring that they can be represented where needed. The Handle System says they are UTF-8-encoded Unicode, but in practice all DOIs appear to use only printable ASCII characters. The metadata for each RFC is uploaded as UTF-8-encoded XML.",
      "zh-CHS": "因为DOI是不透明的，所以在任何特定DOI中使用的字符除了确保可以在需要的地方表示之外都不重要。Handle系统表示它们是UTF-8编码的Unicode，但实际上所有DOI似乎只使用可打印的ASCII字符。每个RFC的元数据作为UTF-8编码的XML上传。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The DOI system adds a new way to locate RFCs and a bibliographic database containing a description of each RFC. The existing locations and bibliographic info are essentially unchanged, so there is no new dependency on the DOI system.",
      "zh-CHS": "DOI系统增加了一种查找RFC的新方法和一个包含每个RFC描述的书目数据库。现有的位置和书目信息基本上没有变化，因此对内政部系统没有新的依赖。"
    },
    {
      "indent": 3,
      "text": "Were CrossRef or the DOI database to suffer a security breach, it is hypothetically possible that users would be directed to locations other than the RFC Editor's web site or would retrieve incorrect bibliographic data, but the actual RFCs would remain intact.",
      "zh-CHS": "如果CrossRef或内政部数据库遭遇安全漏洞，假设用户可能会被引导到RFC编辑网站以外的位置，或者检索不正确的书目数据，但实际的RFC将保持不变。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "zh-CHS": "7. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[CITABILITY] Kotarski, R., Reilly, S., Schrimpf, S., Smit, E., and K. Walshe, \"Report on best practices for citability of data and on evolving roles in scholarly communication\", 2012, <http://www.stm-assoc.org/2012_07_10_STM_Research_Data_ Group_Data_Citation_and_Evolving_Roles_ODE_Report.pdf>.",
      "zh-CHS": "[可引用性]Kotarski，R.，Reilly，S.，Schrimpf，S.，Smit，E.，和K.Walshe，“关于数据可引用性和学术交流中不断演变的角色的最佳实践报告”，2012年<http://www.stm-assoc.org/2012_07_10_STM_Research_Data_ 分组数据、引文和角色演变、ODE报告.pdf>。"
    },
    {
      "indent": 3,
      "text": "[DOI-HB] International DOI Foundation, \"DOI Handbook\", DOI 10.1000/182, April 2012, <http://www.doi.org/hb.html>.",
      "zh-CHS": "[Doi-Hb]国际DOI基金会，“DOI手册”，DOI 10100/182，2012年4月，<http://www.doi.org/hb.html>."
    },
    {
      "indent": 3,
      "text": "[DOI-RA] International DOI Foundation, \"DOI Registration Agencies\", July 2015, <http://www.doi.org/registration_agencies.html>.",
      "zh-CHS": "[Doi-Ra]国际DOI基金会，“DOI注册机构”，2015年7月，<http://www.doi.org/registration_agencies.html>."
    },
    {
      "indent": 3,
      "text": "[ISO-DOI] International Organization for Standardization (ISO), \"ISO 26324:2012 Information and documentation -- Digital object identifier system\", June 2012, <http://www.iso.org/iso/catalogue_detail?csnumber=43506>.",
      "zh-CHS": "[ISO-DOI]国际标准化组织（ISO），“ISO 26324:2012信息和文件——数字对象标识符系统”，2012年6月<http://www.iso.org/iso/catalogue_detail?csnumber=43506>."
    },
    {
      "indent": 3,
      "text": "[RFC-STYLE] RFC Editor, \"RFC Editor Style Guide\", <https://www.rfc-editor.org/styleguide/>.",
      "zh-CHS": "[RFC-STYLE]RFC编辑器，“RFC编辑器样式指南”<https://www.rfc-editor.org/styleguide/>."
    },
    {
      "indent": 3,
      "text": "[RFC3650] Sun, S., Lannom, L., and B. Boesch, \"Handle System Overview\", RFC 3650, DOI 10.17487/RFC3650, November 2003, <http://www.rfc-editor.org/info/rfc3650>.",
      "zh-CHS": "[RFC3650]Sun，S.，Lannom，L.和B.Boesch，“手柄系统概述”，RFC 3650，DOI 10.17487/RFC3650，2003年11月<http://www.rfc-editor.org/info/rfc3650>."
    },
    {
      "indent": 3,
      "text": "[RFC3651] Sun, S., Reilly, S., and L. Lannom, \"Handle System Namespace and Service Definition\", RFC 3651, DOI 10.17487/RFC3651, November 2003, <http://www.rfc-editor.org/info/rfc3651>.",
      "zh-CHS": "[RFC3651]Sun，S.，Reilly，S.，和L.Lannom，“句柄系统名称空间和服务定义”，RFC 3651，DOI 10.17487/RFC3651，2003年11月<http://www.rfc-editor.org/info/rfc3651>."
    },
    {
      "indent": 3,
      "text": "[RFC3652] Sun, S., Reilly, S., Lannom, L., and J. Petrone, \"Handle System Protocol (ver 2.1) Specification\", RFC 3652, DOI 10.17487/RFC3652, November 2003, <http://www.rfc-editor.org/info/rfc3652>.",
      "zh-CHS": "[RFC3652]Sun，S.，Reilly，S.，Lannom，L.，和J.Petrone，“手柄系统协议（2.1版）规范”，RFC 3652，DOI 10.17487/RFC3652，2003年11月<http://www.rfc-editor.org/info/rfc3652>."
    },
    {
      "indent": 0,
      "text": "IAB Members at the Time of Approval",
      "zh-CHS": "批准时的IAB成员"
    },
    {
      "indent": 3,
      "text": "Jari Arkko (IETF Chair) Mary Barnes Marc Blanchet Ralph Droms Ted Hardie Joe Hildebrand Russ Housley Erik Nordmark Robert Sparks Andrew Sullivan (IAB Chair) Dave Thaler Brian Trammell Suzanne Woolf",
      "zh-CHS": "Jari Arkko（IETF主席）Mary Barnes Marc Blanchet Ralph Droms Ted Hardie Joe Hildebrand Russ Housley Erik Nordmark Robert Sparks Andrew Sullivan（IAB主席）Dave Thaler Brian Trammell Suzanne Woolf"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "John Levine Taughannock Networks PO Box 727 Trumansburg, NY 14886",
      "zh-CHS": "纽约州杜鲁曼斯堡市约翰·莱文·塔甘诺克网络公司邮政信箱727号，邮编14886"
    },
    {
      "indent": 3,
      "text": "Phone: +1 831 480 2300\nEmail: standards@taugh.com\nURI:   http://jl.ly",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}