{
  "title": {
    "text": "RFC 7241: The IEEE 802/IETF Relationship",
    "zh-CHS": "RFC 7241"
  },
  "number": 7241,
  "created_at": "2021-11-02 09:22:53.913119+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                             S. Dawkins\nRequest for Comments: 7241                                        Huawei\nObsoletes: 4441                                                P. Thaler\nCategory: Informational                                         Broadcom\nISSN: 2070-1721                                             D. Romascanu\n                                                                   AVAYA\n                                                           B. Aboba, Ed.\n                                                   Microsoft Corporation\n                                                               July 2014",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "The IEEE 802/IETF Relationship",
      "zh-CHS": "ieee802/IETF关系"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the standardization cooperation between Project 802 of the Institute of Electrical and Electronics Engineers (IEEE) and the Internet Engineering Task Force (IETF). This document obsoletes RFC 4441.",
      "zh-CHS": "本文件描述了电气和电子工程师协会（IEEE）802项目与互联网工程任务组（IETF）之间的标准化合作。本文件淘汰了RFC 4441。"
    },
    {
      "indent": 3,
      "text": "Note: This document was collaboratively developed by authors from both the IEEE 802 and IETF leadership and was reviewed and approved by the IEEE 802 Executive Committee prior to publication.",
      "zh-CHS": "注：本文件由IEEE 802和IETF领导层的作者共同开发，并在出版前由IEEE 802执行委员会审查和批准。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。它代表了互联网体系结构委员会（IAB）的共识。IAB批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7241.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7241."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2014 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n   1.1. Why Cooperate? .............................................4\n2. Organization, Participation, and Membership .....................4\n   2.1. IEEE 802 ...................................................5\n   2.2. IETF .......................................................7\n   2.3. Structural Differences .....................................8\n   2.4. Cultural Differences .......................................9\n   2.5. Mailing Lists .............................................11\n3. Document Access and Cross-Referencing ..........................12\n   3.1. Access to IETF Documents ..................................12\n   3.2. Access to IEEE 802 Standards ..............................12\n   3.3. Access to IEEE 802 Working Group Drafts ...................12\n   3.4. Cross-Referencing .........................................15\n4. Guidance on Cooperation ........................................16\n   4.1. Exchange of Information about Work Items ..................16\n   4.2. Document Review and Approval ..............................20\n   4.3. Solicited Review Processes ................................23\n5. Liaison Managers and Liaison Statements ........................23\n   5.1. Liaison Managers ..........................................24\n   5.2. Liaison Statements ........................................24\n6. Protocol Parameter Allocation ..................................24\n   6.1. IANA ......................................................24\n   6.2. IEEE Registration Authority ...............................25\n   6.3. IEEE 802 Registration at the Working Group Level ..........26\n   6.4. Joint-Use Registries ......................................26\n7. Security Considerations ........................................26\n8. References .....................................................26\n   8.1. Normative References ......................................26\n   8.2. Informative References ....................................26\n9. Acknowledgments ................................................30\n10. IAB Members at the Time of Approval ...........................31\n11. IEEE 802 Executive Committee Members at the Time of Approval ..31\nAppendix A.  Current Examples of IEEE 802 and IETF Cooperation ....32\n  A.1. MIB Review .................................................32\n  A.2. AAA Review .................................................32\n  A.3  EAP Review .................................................33\nAppendix B.  Pointers to Additional Information ...................34\n  B.1. IEEE 802 Information .......................................34\n  B.2. IETF Information ...........................................34",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document contains a set of principles and guidelines that serve as the basis for coordination between Project 802 of the Institute of Electrical and Electronics Engineers (IEEE 802) and the Internet Engineering Task Force (IETF), a program under the Internet Society (ISOC) organizational umbrella [BCP101]. The objective is to encourage timely development of technical specifications that facilitate maximum interoperability with existing (fixed and mobile) Internet systems, devices, and protocols. Each organization will operate according to their own rules and procedures including rules governing IPR policy, specification elaboration, approval, and maintenance.",
      "zh-CHS": "本文件包含一套原则和指南，作为电气和电子工程师协会（IEEE 802）项目802和互联网工程任务组（IETF）之间协调的基础，该任务组是互联网协会（ISOC）组织伞下的一个项目[BCP101]。目标是鼓励及时制定技术规范，以促进与现有（固定和移动）互联网系统、设备和协议的最大互操作性。每个组织将根据自己的规则和程序运作，包括知识产权政策、规范制定、批准和维护规则。"
    },
    {
      "indent": 3,
      "text": "While this document is intended to improve cooperation between the two organizations, it does not change any of the formal practices or procedures of either organization.",
      "zh-CHS": "虽然本文件旨在改善两个组织之间的合作，但并不改变任何一个组织的任何正式做法或程序。"
    },
    {
      "indent": 0,
      "text": "1.1. Why Cooperate?",
      "section_title": true,
      "zh-CHS": "1.1. 为什么要合作？"
    },
    {
      "indent": 3,
      "text": "IEEE 802 and the IETF are independent standards organizations that each use standards produced by the other organization and develop standards dependent on those produced by the other organization. This dependency may extend to carrying attributes in protocols that reflect technologies defined by the other organization.",
      "zh-CHS": "IEEE 802和IETF是独立的标准组织，各自使用另一组织制定的标准，并根据另一组织制定的标准制定标准。这种依赖性可以扩展到在协议中承载反映其他组织定义的技术的属性。"
    },
    {
      "indent": 3,
      "text": "The dependencies between IEEE 802 and IETF standards are a motivation for cooperation between the organizations. However, since the benefits of cooperation come at the cost of coordination overhead, the benefits of coordination must outweigh the cost.",
      "zh-CHS": "IEEE 802和IETF标准之间的依赖关系是组织之间合作的动力。然而，由于合作的好处是以协调开销为代价的，因此协调的好处必须大于成本。"
    },
    {
      "indent": 3,
      "text": "The IETF benefits from coordination by obtaining improved access to IEEE 802 expertise in the widely deployed and widely used IEEE 802 Local Area Network architecture [ARCH802].",
      "zh-CHS": "IETF通过在广泛部署和广泛使用的IEEE 802局域网体系结构[ARCH802]中获得对IEEE 802专业知识的更好访问而从协作中获益。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 benefits from coordination by obtaining improved access to IETF expertise on IP datagram encapsulation, routing, transport, and security, as well as specific applications of interest to IEEE 802.",
      "zh-CHS": "IEEE802通过更好地获得IETF在IP数据报封装、路由、传输和安全方面的专业知识，以及IEEE802感兴趣的特定应用，从协作中获益。"
    },
    {
      "indent": 0,
      "text": "2. Organization, Participation, and Membership",
      "section_title": true,
      "zh-CHS": "2. 组织、参与和成员资格"
    },
    {
      "indent": 3,
      "text": "IEEE 802 and IETF are similar in some ways but different in others. When working on projects of interest to both organizations, it is important to understand the similarities and differences.",
      "zh-CHS": "IEEE 802和IETF在某些方面相似，但在其他方面不同。在处理两个组织都感兴趣的项目时，了解它们的相似性和差异是很重要的。"
    },
    {
      "indent": 0,
      "text": "2.1. IEEE 802",
      "section_title": true,
      "zh-CHS": "2.1. IEEE 802"
    },
    {
      "indent": 3,
      "text": "The IEEE Standards Association (IEEE-SA) is the standards-setting body of the IEEE. The IEEE-SA Standards Board oversees the IEEE standards development process.",
      "zh-CHS": "IEEE标准协会（IEEE-SA）是IEEE的标准制定机构。IEEE-SA标准委员会监督IEEE标准的制定过程。"
    },
    {
      "indent": 3,
      "text": "The IEEE-SA Standards Board supervises what IEEE calls \"sponsors\" -- IEEE entities that develop standards. The IEEE 802 LAN/MAN Standards Committee is a sponsor that develops and maintains networking standards and recommended practices for local, metropolitan, and other area networks, using an open and accredited process, while advocating for them on a global basis. Areas of standardization work include Ethernet, Bridging and Virtual Bridged LANs, Wireless LAN (Local Area Network), Wireless PAN (Personal Area Network), Wireless MAN (Metropolitan Area Network), Wireless Coexistence, Media Independent Handover Services, and Wireless RAN (Regional Access Network). Within IEEE 802, a Working Group provides the focus for each of these areas.",
      "zh-CHS": "IEEE-SA标准委员会监督IEEE所称的“发起人”——开发标准的IEEE实体。IEEE 802 LAN/MAN标准委员会是一个发起人，它使用开放和认可的过程，为本地、大都市和其他区域网络制定和维护网络标准和推荐做法，同时在全球范围内宣传这些标准和做法。标准化工作的领域包括以太网、桥接和虚拟桥接LAN、无线LAN（局域网）、无线PAN（个人局域网）、无线MAN（城域网）、无线共存、媒体独立切换服务和无线RAN（区域接入网）。在IEEE 802中，一个工作组为每个领域提供了关注点。"
    },
    {
      "indent": 3,
      "text": "In IEEE 802, work is done in Working Groups operating under an Executive Committee. Each Working Group is led by a Working Group Chair. Most Working Groups have one or more Task Groups. A Task Group is responsible for a project or group of projects.",
      "zh-CHS": "在IEEE 802中，工作由执行委员会下属的工作组完成。每个工作组由一名工作组主席领导。大多数工作组都有一个或多个任务组。任务组负责一个项目或一组项目。"
    },
    {
      "indent": 3,
      "text": "The Executive Committee is comprised of the Executive Committee Chair, Executive Committee Officers (e.g., Vice-Chairs, Secretaries, Treasurer), and Working Group Chairs.",
      "zh-CHS": "执行委员会由执行委员会主席、执行委员会官员（如副主席、秘书、财务主管）和工作组主席组成。"
    },
    {
      "indent": 3,
      "text": "A good place to learn more is the IEEE 802 Home Page, at <http://www.ieee802.org/>. An IEEE 802 Orientation for new participants that gives an overview of IEEE 802 process is available from the home page.",
      "zh-CHS": "了解更多信息的好地方是IEEE 802主页，位于<http://www.ieee802.org/>. 主页上提供了针对新参与者的IEEE 802指南，概述了IEEE 802过程。"
    },
    {
      "indent": 3,
      "text": "The IEEE 802 Executive Committee and all Working Groups meet three times per year at plenary sessions. Plenary sessions are held in March, July, and November. Most Working Groups hold interim meetings, usually in January, May, and September. The meeting schedule can be found at <http://www.ieee802.org/meeting/index.html>.",
      "zh-CHS": "IEEE 802执行委员会和所有工作组每年召开三次全体会议。全体会议在3月、7月和11月举行。大多数工作组通常在1月、5月和9月举行临时会议。会议日程安排见<http://www.ieee802.org/meeting/index.html>."
    },
    {
      "indent": 3,
      "text": "A Study Group is a group formed to consider starting a new project and, if new work is found to be suitable, to develop an IEEE Project Authorization Request (PAR), similar in purpose to an IETF Working Group charter. A Study Group may operate under a Working Group or under the Executive Committee depending on whether the new work under consideration falls within the scope of an existing Working Group. Study Groups are expected to exist for a limited time, usually for one or two plenary cycles, and must be authorized to continue at each plenary if they have not completed their work.",
      "zh-CHS": "一个研究小组是一组考虑开始一个新项目，如果发现新的工作是合适的，开发IEEE项目授权请求（PAR），目的类似于IETF工作组章程。研究小组可在工作组或执行委员会下运作，这取决于审议中的新工作是否属于现有工作组的范围。研究小组的存在时间有限，通常为一个或两个全体会议周期，如果尚未完成工作，则必须授权其在每次全体会议上继续进行。"
    },
    {
      "indent": 3,
      "text": "Participation in IEEE 802 Working Groups is at the level of individuals -- participants are human beings and not companies. While participation is open, individuals are required to declare their affiliation (i.e., any individual or entity that financially or materially supports the individual's participation in IEEE 802).",
      "zh-CHS": "IEEE 802工作组的参与是个人层面的——参与者是人而不是公司。虽然参与是公开的，但个人必须声明其从属关系（即，在财务或物质上支持个人参与IEEE 802的任何个人或实体）。"
    },
    {
      "indent": 3,
      "text": "Working Groups maintain membership rosters, with voting membership attained on the basis of in-person meeting attendance. Retention of voting membership generally requires continued attendance and responsiveness to letter ballots. Voting membership allows one to vote on motions and on Working Group Ballots of drafts. All drafts are also balloted by a Sponsor ballot pool before approval as standards. Joining a Sponsor ballot pool does not require participation in meetings. It is not necessary to be eligible to vote in order to comment on drafts, and the Working Group is required to consider and respond to all comments submitted during Working Group and Sponsor ballots.",
      "zh-CHS": "工作组保留会员名册，根据亲自出席会议的情况获得有表决权的会员资格。保留有表决权的成员通常需要持续出席并响应信函投票。有表决权的成员资格允许一个人就议案和工作组对草案的投票进行表决。所有草案在作为标准获得批准之前，也由发起人投票池进行投票。加入赞助商投票池不需要参加会议。不需要有资格投票来评论草案，工作组需要考虑和回应工作组提交的所有意见和赞助人投票。"
    },
    {
      "indent": 3,
      "text": "To foster ongoing communication between IEEE 802 and IETF, it is important to identify and establish contact points within each organization. IEEE 802 contact points may include:",
      "zh-CHS": "为了促进IEEE 802和IETF之间的持续通信，在每个组织内确定和建立联络点非常重要。IEEE 802接触点可包括："
    },
    {
      "indent": 3,
      "text": "IEEE 802 Working Group Chair: An IEEE 802 Working Group chair is an individual who is assigned to lead the work of IEEE 802 in a particular area. IEEE 802 Working Group chairs are elected by the Working Group and confirmed by the Executive Committee for a two-year term. The Working Group Chair provides a stable contact point for cooperation between the two organizations for a given topic.",
      "zh-CHS": "IEEE 802工作组主席：IEEE 802工作组主席是指被指派在特定领域领导IEEE 802工作的个人。IEEE 802工作组主席由工作组选举，并由执行委员会确认，任期两年。工作组主席为两个组织就某一专题开展合作提供了一个稳定的联络点。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 Task Group (or Task Force) Chair: An IEEE 802 Task Group chair is an individual who is assigned to lead the work on a specific project or group of projects within a Working Group. The Task Group Chair often serves for the duration of a project. The Task Group Chair provides a stable contact point for cooperation between the two organizations on a particular project.",
      "zh-CHS": "IEEE 802任务组（或任务组）主席：IEEE 802任务组主席是指被指派在工作组内领导特定项目或项目组工作的个人。任务组主席通常在项目期间任职。工作组主席为两个组织在特定项目上的合作提供了一个稳定的联络点。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 Study Group Chair: An IEEE 802 Study Group Chair is an individual assigned to lead consideration of new work and development of an IEEE 802 Project Authorization Request (PAR). The Study Group chair provides a stable contact point for cooperation between the two organizations on a study group topic.",
      "zh-CHS": "IEEE 802研究小组主席：IEEE 802研究小组主席是指被指定负责领导新工作和IEEE 802项目授权请求（PAR）开发的个人。研究组主席为两个组织就研究组主题进行合作提供了一个稳定的联络点。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 Liaisons: It may be beneficial to establish liaisons as additional contact points for specific topics of mutual interest. These contact points should be established early in the work effort. The IEEE 802 and IETF projects may select the same individual as their contact point, but this is not required, so that two individuals each serve as contact points for one project participating in the liaison relationship.",
      "zh-CHS": "IEEE 802联络点：建立联络点作为共同感兴趣的特定主题的额外联络点可能是有益的。这些联络点应在工作初期建立。IEEE 802和IETF项目可以选择同一个人作为其联络点，但这不是必需的，因此两个人分别作为参与联络关系的一个项目的联络点。"
    },
    {
      "indent": 3,
      "text": "Informal Contact points: Other informal contacts can provide useful cooperation points. These include Project Editors who are responsible for editing the drafts and work with the Task Group Chairs to lead tracking and resolution of issues. Joint members who are active in both the IEEE 802 and IETF projects in an area can also aid in cooperation.",
      "zh-CHS": "非正式接触点：其他非正式接触可以提供有用的合作点。其中包括项目编辑，他们负责编辑草案，并与任务组主席合作，领导跟踪和解决问题。活跃于某一领域的IEEE 802和IETF项目的联合成员也可以协助合作。"
    },
    {
      "indent": 0,
      "text": "2.2. IETF",
      "section_title": true,
      "zh-CHS": "2.2. IETF"
    },
    {
      "indent": 3,
      "text": "The IETF Standards Process is defined in [BCP9]. [BCP11] is a helpful description of organizations involved in the IETF standards process. It can still be useful as an overview, although details have changed since 1996.",
      "zh-CHS": "IETF标准过程在[BCP9]中定义。[BCP11]是对参与IETF标准过程的组织的有益描述。尽管自1996年以来细节有所改变，但它仍然可以作为一个概览。"
    },
    {
      "indent": 3,
      "text": "In the IETF, work is done in Working Groups (WGs) and is mostly carried out through open, public mailing lists rather than face-to-face meetings. The IETF Working Group process is defined in [BCP25].",
      "zh-CHS": "在IETF中，工作是在工作组（WG）中完成的，主要通过公开的公开邮件列表而不是面对面会议进行。IETF工作组流程定义见[BCP25]。"
    },
    {
      "indent": 3,
      "text": "WGs are organized into areas, and each area is managed by one or more Area Directors. Collectively, the Area Directors constitute the Internet Engineering Steering Group (IESG) [RFC3710].",
      "zh-CHS": "工作组分为多个区域，每个区域由一名或多名区域主管管理。区域总监共同组成互联网工程指导小组（IESG）[RFC3710]。"
    },
    {
      "indent": 3,
      "text": "To foster ongoing communication between IEEE 802 and IETF, it is important to identify and establish contact points within each organization. IETF contact points may include Area Directors, Working Group chairs, and other points of contact who can help communicate between IEEE 802 and IETF Working Groups.",
      "zh-CHS": "为了促进IEEE 802和IETF之间的持续通信，在每个组织内确定和建立联络点非常重要。IETF联络点可能包括区域主任、工作组主席和其他联络点，这些联络点可以帮助IEEE 802和IETF工作组之间进行沟通。"
    },
    {
      "indent": 3,
      "text": "The Internet Architecture Board (IAB) charter [BCP39] assigns the IAB several responsibilities relevant to this document:",
      "zh-CHS": "互联网体系结构委员会（IAB）章程[BCP39]赋予IAB与本文件相关的多项职责："
    },
    {
      "indent": 6,
      "text": "1. IESG Appointment Confirmation [BCP10] 2. Architectural Oversight 3. Standards Process Oversight and Appeal 4. Appointment of the RFC Series Editor [RFC6635] and Independent Submission Editor [RFC6548] 5. Appointment of the Internet Assigned Number Authority (IANA) operator [RFC6220] 6. Oversight of External Liaisons for the IETF [BCP102]",
      "zh-CHS": "1. IESG任命确认书[BCP10]2。建筑监督3。标准程序监督和上诉4。任命RFC系列编辑[RFC6635]和独立提交编辑[RFC6548]5。任命互联网分配号码管理局（IANA）运营商[RFC6220]6。监督IETF的外部联络[BCP102]"
    },
    {
      "indent": 3,
      "text": "IESG and IAB members are selected using the NomCom process defined in [BCP10]. Working Group chairs serve at the pleasure of their Area Directors, as described in [BCP25].",
      "zh-CHS": "使用[BCP10]中定义的NomCom流程选择IESG和IAB成员。如[BCP25]所述，工作组主席根据其区域主管的意愿担任职务。"
    },
    {
      "indent": 3,
      "text": "The IETF is designed to be a \"bottom-up\" protocol engineering organization -- the leadership steers and manages but does not direct work in a top-down way. Technical agreements with \"the IETF\" are based on the consensus of Working Group participants, rather than negotiated with IETF leadership.",
      "zh-CHS": "IETF被设计成一个“自下而上”的协议工程组织——领导层以自上而下的方式指导和管理工作，但不指导工作。与“IETF”的技术协议是基于工作组参与者的共识，而不是与IETF领导层协商达成的。"
    },
    {
      "indent": 3,
      "text": "IETF meets in plenary sessions three times per year. Some Working Groups schedule additional interim meetings, which may be either face-to-face or \"virtual\". Information about IETF meetings is available at <http://www.ietf.org/meeting/upcoming.html>. Information about IETF Working Group interim meetings is available on <http://www.ietf.org/meeting/interim-meetings.html>.",
      "zh-CHS": "IETF每年召开三次全体会议。一些工作组安排额外的临时会议，可以是面对面会议或“虚拟会议”。有关IETF会议的信息，请访问<http://www.ietf.org/meeting/upcoming.html>. 有关IETF工作组临时会议的信息，请访问<http://www.ietf.org/meeting/interim-meetings.html>."
    },
    {
      "indent": 3,
      "text": "The preferred way to develop specifications is to do work on mailing lists, reserving face-to-face sessions for topics that have not been resolved through previous mailing list discussion.",
      "zh-CHS": "制定规范的首选方法是对邮件列表进行处理，为之前邮件列表讨论中未解决的主题保留面对面的会议。"
    },
    {
      "indent": 3,
      "text": "Participation in the IETF is open to anyone (technically, anyone with access to email sufficient to allow subscription to one or more IETF mailing lists). All IETF participants act as individuals. There is no concept of \"IETF membership\".",
      "zh-CHS": "任何人都可以参加IETF（从技术上讲，任何人都可以访问足以允许订阅一个或多个IETF邮件列表的电子邮件）。所有IETF参与者均以个人身份行事。没有“IETF成员资格”的概念。"
    },
    {
      "indent": 3,
      "text": "A good place to learn more is the IETF Home Page, at <http://www.ietf.org/>, and especially the \"About the IETF\" page at <http://www.ietf.org/about>, selectable from the IETF Home Page.",
      "zh-CHS": "了解更多信息的好地方是IETF主页，位于<http://www.ietf.org/>，尤其是“关于IETF”页面<http://www.ietf.org/about>，可从IETF主页选择。"
    },
    {
      "indent": 3,
      "text": "The \"Tao of the IETF\" is also very helpful, especially for IEEE 802 participants who will also be participating in IETF Working Groups and attending IETF meetings. It is available at <http://www.ietf.org/tao.html>.",
      "zh-CHS": "“IETF之道”也非常有帮助，特别是对于IEEE802参与者，他们也将参加IETF工作组和IETF会议。可于<http://www.ietf.org/tao.html>."
    },
    {
      "indent": 3,
      "text": "The current list of IETF Area Directors and Working Group chairs can be found in the IETF Working Group charters, at <http://datatracker.ietf.org/wg/>.",
      "zh-CHS": "IETF区域总监和工作组主席的当前名单可在IETF工作组章程中找到，网址为<http://datatracker.ietf.org/wg/>."
    },
    {
      "indent": 0,
      "text": "2.3. Structural Differences",
      "section_title": true,
      "zh-CHS": "2.3. 结构差异"
    },
    {
      "indent": 3,
      "text": "IEEE 802 and IETF have similar structures, but the terms they use are different, and even conflicting. For example, both IEEE 802 and IETF use the term \"Working Group\", but this means very different things in the two organizations.",
      "zh-CHS": "IEEE 802和IETF具有相似的结构，但它们使用的术语不同，甚至相互冲突。例如，IEEE 802和IETF都使用术语“工作组”，但这在两个组织中的含义截然不同。"
    },
    {
      "indent": 3,
      "text": "Thumbnail comparison between IETF and IEEE 802 entities",
      "zh-CHS": "IETF和IEEE 802实体之间的缩略图比较"
    },
    {
      "indent": 3,
      "text": "IETF Area is similar to IEEE 802 Working Group IETF Working Group is similar to IEEE 802 Task Group IETF BOF is similar to IEEE 802 Study Group",
      "zh-CHS": "IETF领域类似于IEEE 802工作组IETF工作组类似于IEEE 802任务组IETF BOF类似于IEEE 802研究组"
    },
    {
      "indent": 3,
      "text": "Both IEEE 802 Working Groups and IETF Areas are large, long-lived, and relatively broadly scoped, containing more narrowly chartered entities (IEEE 802 Task Groups and IETF Working Groups), which tend to be short-lived and narrowly chartered. IEEE 802 uses Study Groups to develop proposals for new work, and these are analogous to IETF Birds of a Feather (\"BOF\") sessions.",
      "zh-CHS": "IEEE 802工作组和IETF领域都是大型、长寿命且范围相对较广的领域，包含更多的狭义特许实体（IEEE 802任务组和IETF工作组），这些实体往往是短命且狭义特许的。IEEE 802使用研究小组为新工作制定建议，这些建议类似于IETF的“羽毛鸟”（BOF）会议。"
    },
    {
      "indent": 3,
      "text": "Several IETF Areas also have one or more directorates to support the work of the Area Directors. Area Directors often ask directorate members to review documents or provide input on technical questions. These directorates are often a source of expertise on specific topics. The list of Area Directorates is at <http://www.ietf.org/iesg/directorate.html>. IEEE 802 does not have a corresponding organizational entity.",
      "zh-CHS": "几个IETF区域也有一个或多个董事会来支持区域董事会的工作。区域主管经常要求董事会成员审查文件或提供技术问题的意见。这些董事会通常是特定主题专业知识的来源。地区董事会名单载于<http://www.ietf.org/iesg/directorate.html>. IEEE 802没有相应的组织实体。"
    },
    {
      "indent": 0,
      "text": "2.4. Cultural Differences",
      "section_title": true,
      "zh-CHS": "2.4. 文化差异"
    },
    {
      "indent": 3,
      "text": "IEEE 802 and IETF have cultures that are similar but not identical. Some of the differences include:",
      "zh-CHS": "IEEE 802和IETF具有相似但不完全相同的区域性。其中一些差异包括："
    },
    {
      "indent": 3,
      "text": "Consensus and Rough Consensus: Both organizations make decisions based on consensus, but in the IETF, \"consensus\" can mean \"rough consensus, as determined by Working Group chairs\". In practice, this means that a large part of the community being asked needs to agree. Not everyone has to agree, but if someone disagrees, they need to convince other people of their point of view. If they're not able to do that, they'll be \"in the rough\" when \"rough consensus\" is declared. Although IEEE Working Groups ultimately rely on voting for decision-making, they vary widely in their use of consensus versus voting in the course of a meeting and in their attention to Robert's Rules [RONR].",
      "zh-CHS": "共识和大致共识：两个组织都是基于共识做出决策的，但在IETF中，“共识”可以指“由工作组主席确定的大致共识”。在实践中，这意味着被问到的大部分社区需要同意。不是每个人都必须同意，但是如果有人不同意，他们需要说服其他人他们的观点。如果他们不能做到这一点，那么在宣布“大致共识”时，他们将处于“大致”状态。尽管IEEE工作组最终依靠投票进行决策，但他们在会议过程中使用共识与投票的方式以及对罗伯特规则的关注程度上差异很大[RONR]。"
    },
    {
      "indent": 3,
      "text": "Running Code: David Clark coined the phrase \"We reject kings, presidents and voting. We believe in rough consensus and running code\" in 1992, to explain IETF culture. Although that's not always true today, the existence of \"running code\" as a proof of feasibility for a proposal often carries weight during technical discussions. IEEE 802 considers both technical and economic feasibility when deciding whether to approve new work, as noted in Section 4.1.7.",
      "zh-CHS": "运行代码：大卫·克拉克在1992年创造了一个短语“我们拒绝国王、总统和投票。我们相信粗略的共识和运行代码”，来解释IETF文化。尽管这在今天并不总是正确的，但“运行代码”的存在作为提案可行性的证明，在技术讨论中往往具有重要意义。如第4.1.7节所述，IEEE 802在决定是否批准新工程时考虑了技术和经济可行性。"
    },
    {
      "indent": 3,
      "text": "Decision-making: IEEE 802 Working Groups vary in their reliance upon voting versus consensus, and in the breadth of coverage of an individual motion, but ultimately, all rely upon a 75 percent vote to decide technical issues, and a 50 percent +1 vote to decide other issues. IETF Working Groups do not use voting. Working Group chairs may ask for a \"show of hands\" or \"take a hum\" to judge backing for a proposal and identify technical concerns and objections, but this is not considered \"voting\". IETF consensus and humming is discussed further in [RFC7282].",
      "zh-CHS": "决策：IEEE 802工作组对投票与协商一致的依赖程度不同，对单个动议的覆盖范围也不同，但最终，所有工作组都依赖75%的投票来决定技术问题，以及50%的+1票来决定其他问题。IETF工作组不使用投票。工作组主席可以要求“举手”或“哼哼”来判断提案的支持情况，并确定技术问题和反对意见，但这不被视为“投票”。[RFC7282]中进一步讨论了IETF共识和嗡嗡声。"
    },
    {
      "indent": 3,
      "text": "Balance between mailing lists and meetings: Both organizations make use of mailing lists. IETF Working Groups rely heavily on mailing lists, where work is done, in addition to formal meetings. The IETF requires all Working Group decisions to be made (or, often in practice, confirmed) on mailing lists -- final decisions aren't made in meetings. IEEE 802 Working Groups typically meet face-to-face about twice as often as IETF Working Groups (three IEEE 802 plenaries plus three IETF 802 interim meetings each year, compared to three IETF plenaries per year), and teleconferences are more common in IEEE 802 than in most IETF Working Groups. Most major decisions in IEEE 802 are made during plenary or interim meetings, except for procedural decisions. Attendance at meetings is critical to influencing decisions and to maintaining membership voting rights.",
      "zh-CHS": "邮件列表和会议之间的平衡：两个组织都使用邮件列表。IETF工作组在很大程度上依赖于邮件列表，在邮件列表中，除了正式会议之外，还进行工作。IETF要求所有工作组的决定都要在邮件列表上做出（或者，在实践中，通常是确认），最终决定不是在会议上做出的。IEEE 802工作组面对面会议的频率通常是IETF工作组的两倍（每年三次IEEE 802全体会议加上三次IETF 802临时会议，而每年三次IETF全体会议），并且在IEEE 802中，电话会议比在大多数IETF工作组中更为常见。IEEE 802中的大多数主要决定都是在全体会议或临时会议上作出的，但程序性决定除外。出席会议对于影响决策和维护会员投票权至关重要。"
    },
    {
      "indent": 3,
      "text": "Interim meetings: Both organizations use interim meetings (between plenary meetings). IETF Working Groups schedule interim meetings on an as-needed basis. IETF interim meetings may be face-to-face or virtual. Most IEEE 802 WGs hold regularly interim meetings three times a year in the middle of the interval between two plenary meetings. The schedules and locations of these meetings are typically known many months in advance. IEEE 802 interim meetings are face-to-face only. In addition to regularly scheduled IEEE 802 interim meetings, teleconference and ad hoc meetings are held on an as-needed basis.",
      "zh-CHS": "临时会议：两个组织都使用临时会议（在全体会议之间）。IETF工作组根据需要安排临时会议。IETF临时会议可以是面对面会议或虚拟会议。大多数IEEE 802 WGS在两次全体会议的间隔中间每年举行三次临时会议。这些会议的日程和地点通常提前几个月知道。IEEE 802临时会议仅限于面对面会议。除了定期安排的IEEE 802临时会议外，还根据需要举行电话会议和特别会议。"
    },
    {
      "indent": 3,
      "text": "Remote participation: Because the IETF doesn't make decisions at face-to-face meetings, attendance is not absolutely necessary, and some significant contributors do not attend most face-to-face IETF meetings. However, finding people interested in a proposal for new work, or soliciting backing for ideas, is often more easily accomplished face-to-face, such as in a hallway or bar. Significant contributors to IEEE 802 almost always attend face-to-face meetings; participation in IEEE 802 meetings is a condition for WG membership.",
      "zh-CHS": "远程参与：由于IETF不会在面对面会议上做出决策，因此出席并非绝对必要，一些重要的贡献者也不会出席大多数面对面IETF会议。然而，找到对新工作提案感兴趣的人，或者寻求想法的支持，通常更容易面对面地完成，比如在走廊或酒吧。IEEE 802的重要贡献者几乎总是参加面对面的会议；参加IEEE 802会议是工作组成员资格的一个条件。"
    },
    {
      "indent": 3,
      "text": "Lifetime of Standards: IEEE 802 periodically reviews existing standards. IETF Standards Track documents may be updated or obsoleted by newer Standards Track documents, but there is no formal periodic review for existing Standards Track documents. The status of specific IETF standards is available through the IETF \"Datatracker\" [DATATRACKER]. Because these status changes happen independently, standards from each organization may refer to documents that are no longer standards in the other organization.",
      "zh-CHS": "标准的生命周期：IEEE 802定期审查现有标准。IETF标准跟踪文件可能会被更新的标准跟踪文件更新或淘汰，但现有标准跟踪文件没有正式的定期审查。特定IETF标准的状态可通过IETF“Datatracker”[Datatracker]获得。由于这些状态更改是独立发生的，因此每个组织的标准可能会引用其他组织中不再是标准的文档。"
    },
    {
      "indent": 3,
      "text": "Overlapping terminology: As two independent standards development organizations, IEEE 802 and IETF have developed vocabularies that overlap. For instance, IEEE 802 \"ballots\" at several levels of the organization during document approval, while IETF documents are only \"balloted\" during IESG review. The IESG uses \"ballots\" to indicate that all technical concerns have been addressed, not to indicate that the IESG agrees with a document. The intention is to \"discuss\" technical issues with a document, and \"no\" is not one of the choices on an IESG ballot.",
      "zh-CHS": "重叠术语：作为两个独立的标准开发组织，IEEE 802和IETF开发了重叠的词汇表。例如，IEEE 802在文件批准期间在组织的多个级别进行“投票”，而IETF文件在IESG审查期间仅进行“投票”。IESG使用“投票”表示所有技术问题已得到解决，而不是表示IESG同意文件。其目的是用文件“讨论”技术问题，而“否”不是IESG投票的选择之一。"
    },
    {
      "indent": 0,
      "text": "2.5. Mailing Lists",
      "section_title": true,
      "zh-CHS": "2.5. 邮件列表"
    },
    {
      "indent": 3,
      "text": "All IETF Working Groups and all IEEE 802 Working Groups have associated mailing lists. Most IEEE 802 Task Groups also have mailing lists, but in some cases (e.g., the IEEE 802.1 Working Group), the Working Group mailing list is used for any Task Group matters.",
      "zh-CHS": "所有IETF工作组和所有IEEE 802工作组都有相关的邮件列表。大多数IEEE 802任务组也有邮件列表，但在某些情况下（如IEEE 802.1工作组），工作组邮件列表用于任何任务组事务。"
    },
    {
      "indent": 3,
      "text": "In the IETF, the mailing list is the primary vehicle for discussion and decision-making. It is recommended that IEEE 802 experts interested in particular IETF Working Group topics subscribe to and participate in these lists. IETF WG mailing lists are open to all subscribers. The IETF Working Group mailing list subscription and archive information are noted in each Working Group's charter page.",
      "zh-CHS": "在IETF中，邮件列表是讨论和决策的主要工具。建议对特定IETF工作组主题感兴趣的IEEE 802专家订阅并参与这些列表。IETF工作组邮件列表对所有订阅者开放。IETF工作组邮件列表订阅和归档信息记录在每个工作组的章程页中。"
    },
    {
      "indent": 3,
      "text": "In IEEE 802, mailing lists are typically used for meeting logistics, ballot announcements, reports, and some technical discussion. Most decision-making is at meetings, but in cases where a decision is needed between meetings, it may be done over the mailing list. Most technical discussion occurs at meetings and by generating comments on drafts that are compiled with responses in comment resolution documents.",
      "zh-CHS": "在IEEE 802中，邮件列表通常用于会议后勤、投票公告、报告和一些技术讨论。大多数决策都是在会议上做出的，但如果需要在会议之间做出决策，则可以通过邮件列表进行。大多数技术性讨论都是在会议上进行的，并通过在意见解决文件中生成对草案的评论来进行。"
    },
    {
      "indent": 3,
      "text": "Most IEEE 802 mailing lists are open to all subscribers. For the few IEEE 802 mailing lists that are not open, please see the Working Group chair to arrange for access to the mailing list.",
      "zh-CHS": "大多数IEEE 802邮件列表对所有订阅者开放。对于少数未开放的IEEE 802邮件列表，请联系工作组主席安排访问邮件列表。"
    },
    {
      "indent": 3,
      "text": "Some IEEE 802 participants refer to mailing lists as \"reflectors\".",
      "zh-CHS": "一些IEEE 802参与者将邮件列表称为“反射器”。"
    },
    {
      "indent": 0,
      "text": "3. Document Access and Cross-Referencing",
      "section_title": true,
      "zh-CHS": "3. 文件存取和相互参照"
    },
    {
      "indent": 3,
      "text": "During the course of IEEE 802 and IETF cooperation, it is important to share internal documents among the technical Working Groups. In addition, drafts of IEEE 802 standards, Internet-Drafts, and RFCs may also be distributed.",
      "zh-CHS": "在IEEE 802和IETF合作的过程中，技术工作组之间共享内部文档非常重要。此外，还可以分发IEEE 802标准草案、互联网草案和RFC。"
    },
    {
      "indent": 0,
      "text": "3.1. Access to IETF Documents",
      "section_title": true,
      "zh-CHS": "3.1. 访问IETF文件"
    },
    {
      "indent": 3,
      "text": "IETF Internet-Drafts may be located using the IETF Datatracker interface (see [DATATRACKER]) or via the IETF tools site at <http://tools.ietf.org>. RFCs may be found at either of the above sites, or via the RFC Editor web site at <http://www.rfc-editor.org>.",
      "zh-CHS": "IETF互联网草稿可使用IETF数据跟踪器接口（见[Datatracker]）或通过IETF工具网站<http://tools.ietf.org>. RFC可在上述任一网站上找到，或通过RFC编辑器网站<http://www.rfc-editor.org>."
    },
    {
      "indent": 0,
      "text": "3.2. Access to IEEE 802 Standards",
      "section_title": true,
      "zh-CHS": "3.2. 访问IEEE 802标准"
    },
    {
      "indent": 3,
      "text": "IEEE 802 standards, once approved, are published and made available for sale. They can be purchased from the IEEE Standards Store, at <http://www.techstreet.com/IEEEgate.html>. They are also available from other outlets, including the IEEE Xplore digital library, at <http://ieeexplore.ieee.org>.",
      "zh-CHS": "IEEE 802标准一经批准，即发布并出售。可从IEEE标准商店购买，网址为<http://www.techstreet.com/IEEEgate.html>. 它们也可以从其他渠道获得，包括IEEE Xplore数字图书馆<http://ieeexplore.ieee.org>."
    },
    {
      "indent": 3,
      "text": "The Get IEEE 802 program, at <http://standards.ieee.org/about/get>, grants public access to download individual IEEE 802 standards at no charge (although registration is required). IEEE 802 standards are added to the Get IEEE 802 program six months after publication. This program is approved year by year, but has been in place for several years.",
      "zh-CHS": "获取IEEE 802程序，位于<http://standards.ieee.org/about/get>，允许公众免费下载各个IEEE 802标准（尽管需要注册）。IEEE 802标准在发布六个月后添加到Get IEEE 802计划中。该计划每年都获得批准，但已经实施了几年。"
    },
    {
      "indent": 0,
      "text": "3.3. Access to IEEE 802 Working Group Drafts",
      "section_title": true,
      "zh-CHS": "3.3. 访问IEEE 802工作组草案"
    },
    {
      "indent": 3,
      "text": "The IEEE owns the copyright to drafts of standards developed within IEEE 802 standardization projects. The IEEE-SA grants permission for an IEEE 802 draft to be distributed without charge to the participants for that IEEE 802 standards development project. Typically, access is provided over the Internet under password protection, with the password provided to members of the participating WG. Requests to the relevant WG Chair for access to a draft for purposes of participation in the project are typically granted.",
      "zh-CHS": "IEEE拥有在IEEE 802标准化项目中制定的标准草案的版权。IEEE-SA授权IEEE 802草案免费分发给该IEEE 802标准开发项目的参与者。通常，访问是在密码保护下通过互联网提供的，密码提供给参与工作组的成员。通常会批准向相关工作组主席提出的获取草案以参与项目的请求。"
    },
    {
      "indent": 3,
      "text": "An alternative access mechanism which may more easily enable document access for IETF WGs cooperating with IEEE 802 was established by a liaison statement sent to the IETF in July 2004 by Paul Nikolich, Chair of IEEE 802 (available at <https://datatracker.ietf.org/ documents/LIAISON/file41.pdf>), describing the process by which IETF WGs can obtain access to IEEE 802 work in progress. IEEE 802 WG Chairs have the authority to grant membership in their WGs and can use this authority to grant membership to an IETF WG chair upon request. The IETF WG chair will be provided with access to the username/password for the IEEE 802 WG archives and is permitted to share that information with participants in the IETF WG. Since it is possible to participate in IETF without attending meetings, or even joining a mailing list, IETF WG chairs will provide the information to anyone who requests it. However, since IEEE 802 work in progress is copyrighted, copyright restrictions prohibit incorporating material into IETF documents or postings.",
      "zh-CHS": "IEEE 802主席Paul Nikolich于2004年7月向IETF发送了一份联络声明，建立了一种替代访问机制，该机制可以更容易地为与IEEE 802合作的IETF工作组访问文档（可在<https://datatracker.ietf.org/ 文件/联络/文件41.pdf>），描述IETF工作组访问IEEE 802正在进行的工作的过程。IEEE 802工作组主席有权授予其工作组成员资格，并可根据要求使用此权限授予IETF工作组主席成员资格。IETF工作组主席将有权访问IEEE 802工作组档案的用户名/密码，并被允许与IETF工作组的参与者共享该信息。由于可以在不参加会议甚至不加入邮件列表的情况下参与IETF，IETF工作组主席将向任何请求信息的人提供信息。然而，由于IEEE 802正在进行的工作受版权保护，版权限制禁止将材料纳入IETF文档或帖子。"
    },
    {
      "indent": 3,
      "text": "In addition to allowing IETF participants to access documentation resources within IEEE 802, IEEE 802 can also make selected IEEE 802 documents at any stage of development available to the IETF by attaching them to a formal liaison statement. Although a communication can point to a URL where a non-ASCII document can be downloaded, sending attachments in proprietary formats to an IETF mailing list is discouraged.",
      "zh-CHS": "除了允许IETF参与者访问IEEE 802内的文档资源外，IEEE 802还可以通过将选定的IEEE 802文档附加到正式联络声明中，使IETF在开发的任何阶段都可以使用这些文档。尽管通信可以指向可以下载非ASCII文档的URL，但不鼓励以专有格式向IETF邮件列表发送附件。"
    },
    {
      "indent": 0,
      "text": "3.3.1. IEEE 802 Documentation System",
      "section_title": true,
      "zh-CHS": "3.3.1. IEEE 802文件系统"
    },
    {
      "indent": 3,
      "text": "Each IEEE 802 standardization project is assigned to a Working Group (WG) for development. In IEEE 802, the working methods of the WGs vary in their details. The documentation system is one area in which WG operations differ, based on varying needs and traditions. In some cases, the WGs assign the core development to a subgroup (typically known as a Task Group or Task Force), and the documentation procedures may vary among the subgroups as well. Prior to project authorization, or on topics not directly related to development of a standard, the WG may consider and develop documents itself or using other subgroups (standing committees, ad hocs, etc.).",
      "zh-CHS": "每个IEEE 802标准化项目都分配给一个工作组（WG）进行开发。在IEEE 802中，WGs的工作方法在细节上有所不同。文件系统是工作组根据不同的需求和传统开展不同业务的一个领域。在某些情况下，工作组将核心开发工作分配给一个小组（通常称为工作组或工作组），各小组的文件编制程序也可能有所不同。在项目授权之前，或在与标准的开发不直接相关的主题上，WG可以考虑和开发文档本身或使用其他子组（常设委员会、AD HOC等）。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 also supports Technical Advisory Groups (TAGs) that conduct business and develop documents, although not standards. References here to WGs apply to TAGs as well.",
      "zh-CHS": "IEEE 802还支持开展业务和开发文档的技术咨询组（TAG），尽管不是标准。此处对WGs的引用也适用于标记。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Access to Internal IEEE 802 Working Group Documents",
      "section_title": true,
      "zh-CHS": "3.3.2. 访问IEEE 802工作组内部文件"
    },
    {
      "indent": 3,
      "text": "Generally, the archives of minutes and contributions to IEEE 802 groups are publicly and freely available.",
      "zh-CHS": "一般来说，IEEE 802组的会议记录和贡献档案是公开和免费的。"
    },
    {
      "indent": 3,
      "text": "Many IEEE 802 groups use a documentation system provided by IEEE and known as \"Mentor\". The list of these groups is available at the IEEE 802 Mentor Home Page: <https://mentor.ieee.org/802>. Mentor provides the following features:",
      "zh-CHS": "许多IEEE 802组使用IEEE提供的文档系统，称为“导师”。这些组的列表可在IEEE 802 Mentor主页上找到：<https://mentor.ieee.org/802>. Mentor提供以下功能："
    },
    {
      "indent": 3,
      "text": "1. The documentation system is structured and ordered, with documentation tags and unique numbering and versioning.",
      "zh-CHS": "1. 文档系统是结构化和有序的，带有文档标签和唯一的编号和版本控制。"
    },
    {
      "indent": 3,
      "text": "2. Online documentation is available.",
      "zh-CHS": "2. 可提供在线文档。"
    },
    {
      "indent": 3,
      "text": "3. Limited search functionality is provided, and publicly available search engines index the data.",
      "zh-CHS": "3. 提供了有限的搜索功能，公开可用的搜索引擎对数据进行索引。"
    },
    {
      "indent": 3,
      "text": "4. The ability to submit documents to Mentor is limited but is generally available to any interested party. An IEEE web account is required but can be easily and freely established using the IEEE Account Request page, at <http://www.ieee.org/go/create_web_account>. If submission is protected, the privilege can be requested via the Mentor system (using the \"Join group\" link on each WG Mentor page) and would typically be granted by the WG documentation manager in a manual approval.",
      "zh-CHS": "4. 向Mentor提交文件的能力有限，但通常可供任何相关方使用。需要IEEE web帐户，但可以使用IEEE帐户请求页面轻松自由地建立，网址为<http://www.ieee.org/go/create_web_account>. 如果提交受到保护，则可以通过Mentor系统请求权限（使用每个工作组Mentor页面上的“加入组”链接），通常由工作组文档经理在手动批准中授予权限。"
    },
    {
      "indent": 3,
      "text": "5. Submitted documents are immediately available to the general public at the same instant they become available for consideration by the group.",
      "zh-CHS": "5. 提交的文件立即可供公众查阅，同时供集团审议。"
    },
    {
      "indent": 3,
      "text": "IEEE 802.1 and IEEE 802.3 do not use Mentor.",
      "zh-CHS": "IEEE 802.1和IEEE 802.3不使用Mentor。"
    },
    {
      "indent": 3,
      "text": "IEEE 802.1 documents are organized in folders by year at <http://www.ieee802.org/1/files/public/>. The file names indicate the relevant project, author, date, and version. The file-naming conventions and upload link are at <http://www.ieee802.org/1/filenaming.html>. Upload is moderated.",
      "zh-CHS": "IEEE 802.1文件按年度组织在文件夹中<http://www.ieee802.org/1/files/public/>. 文件名表示相关项目、作者、日期和版本。文件命名约定和上载链接位于<http://www.ieee802.org/1/filenaming.html>. 上传是有节制的。"
    },
    {
      "indent": 3,
      "text": "IEEE 802.3 documents are accessed from the home pages of the IEEE 802.3 subgroups (i.e., Task Force or Study Group) and are organized in folders by meeting date. These home pages are available from the IEEE 802.3 home page, at <http://www.ieee802.org/3/>. Files are uploaded by emailing to the subgroup chair.",
      "zh-CHS": "IEEE 802.3文件可从IEEE 802.3子组（即工作组或研究组）的主页访问，并按会议日期组织在文件夹中。这些主页可从IEEE 802.3主页获得，网址为<http://www.ieee802.org/3/>. 文件通过电子邮件上传至小组主席。"
    },
    {
      "indent": 0,
      "text": "3.3.3. Contributions to IEEE 802 Working Groups",
      "section_title": true,
      "zh-CHS": "3.3.3. 对IEEE 802工作组的贡献"
    },
    {
      "indent": 3,
      "text": "In general, development of standards in IEEE 802 is contribution driven. In many cases, a WG or subgroup will issue a call for contributions with a specific technical solicitation, including deadlines and submission instructions. Some groups maintain specific submission procedures and specify a contribution cover sheet to clarify the status of the contribution.",
      "zh-CHS": "一般来说，IEEE 802标准的开发是由贡献驱动的。在许多情况下，工作组或小组将发出一份关于特定技术招标的捐款呼吁，包括截止日期和提交说明。一些小组维持特定的提交程序，并指定供款封面，以澄清供款的状态。"
    },
    {
      "indent": 3,
      "text": "Content for drafts of standards is submitted to WGs by individual participants or groups of participants. Content toward other group documents (such as, for example, external communication statements or foundation documents underlying a draft of a standard) might also be contribution driven. At some point, the group assembles contributed material to develop group documents, and revision takes place within group meetings or by assignment to Editors. For the most part, the contributions toward discussion as well as the group documents (including minutes and other reports) are openly available to the public.",
      "zh-CHS": "标准草案的内容由个别参与者或参与者小组提交给工作组。对其他组文件的内容（例如，外部通信语句或标准草案的基础文件）也可能是贡献驱动的。在某个时候，小组收集所提供的材料以编制小组文件，并在小组会议内或通过指派给编辑的方式进行修订。在大多数情况下，对讨论的贡献以及小组文件（包括会议记录和其他报告）都是公开的。"
    },
    {
      "indent": 0,
      "text": "3.4. Cross-Referencing",
      "section_title": true,
      "zh-CHS": "3.4. 交叉引用"
    },
    {
      "indent": 3,
      "text": "IETF and IEEE 802 each recognize the standards defined by the other organization. Standards produced by each organization can be used as references in standards produced by the other organization.",
      "zh-CHS": "IETF和IEEE 802各自识别由其他组织定义的标准。每个组织制定的标准可作为其他组织制定的标准的参考。"
    },
    {
      "indent": 3,
      "text": "IETF specifications may reference IEEE 802 work in progress, but these references should be labeled \"Work in Progress\". If the references are normative, this will block publication of the referring specification until the reference is available in a stable form.",
      "zh-CHS": "IETF规范可能引用IEEE 802正在进行的工作，但这些引用应标记为“正在进行的工作”。如果参考文件是规范性的，这将阻止参考规范的发布，直到参考文件以稳定的形式提供。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 standards may normatively reference non-expired Internet-Drafts, but IEEE 802 prefers that this be avoided if at all possible.",
      "zh-CHS": "IEEE 802标准可能规范性地引用未过期的互联网草案，但IEEE 802希望尽可能避免这种情况。"
    },
    {
      "indent": 3,
      "text": "Informative references in IEEE 802 standards are placed in a bibliography, so they may point to either approved IETF standards or IETF Internet-Drafts, if necessary.",
      "zh-CHS": "IEEE 802标准中的参考资料放在参考书目中，因此它们可能指向经批准的IETF标准或IETF互联网草案（如有必要）。"
    },
    {
      "indent": 3,
      "text": "When an IEEE 802 standard is revised, it normally retains the same number and the date is updated. Therefore, IEEE 802 standards are dated with the year of approval, e.g., IEEE Std 802.1Q(TM)-2011. There are two ways of referencing IEEE 802 standards: undated and dated references. IEEE 802 practice allows undated reference to be used when referencing a whole standard. An undated reference indicates that the most recent version of the standard should be used. A dated reference refers to a specific revision of an IEEE 802 standard. Since clauses, subclauses, tables, figures, etc., may be",
      "zh-CHS": "修订IEEE 802标准时，通常保留相同的编号，并更新日期。因此，IEEE 802标准的日期与批准年份一致，例如IEEE Std 802.1Q（TM）-2011。参考IEEE 802标准有两种方式：未注明日期的参考和注明日期的参考。IEEE 802实践允许在引用整个标准时使用未注明日期的引用。未注明日期的参考文件表示应使用本标准的最新版本。注日期的参考文件是指IEEE 802标准的特定版本。因为条款、子条款、表格、图表等可能"
    },
    {
      "indent": 3,
      "text": "renumbered when a standard is revised, a dated reference should be used when citing specific items in a standard.",
      "zh-CHS": "标准修订时重新编号，引用标准中的特定项目时应使用注明日期的参考文件。"
    },
    {
      "indent": 3,
      "text": "IETF standards may be cited by RFC number, which would also be a dated reference. If an undated reference to an IETF Internet Standard is desired, a number is also assigned in the \"STD\" series [BCP9], and these references refer to the most recent version of an IETF Internet Standard.",
      "zh-CHS": "IETF标准可以通过RFC编号引用，RFC编号也可以是注明日期的参考。如果需要对IETF互联网标准进行未注明日期的引用，则在“STD”系列[BCP9]中也会指定一个编号，这些引用是指IETF互联网标准的最新版本。"
    },
    {
      "indent": 0,
      "text": "4. Guidance on Cooperation",
      "section_title": true,
      "zh-CHS": "4. 合作指导"
    },
    {
      "indent": 3,
      "text": "This section describes how existing processes within the IETF and IEEE 802 may be used to enable cooperation between the organizations.",
      "zh-CHS": "本节描述了如何使用IETF和IEEE 802中的现有过程来实现组织之间的合作。"
    },
    {
      "indent": 3,
      "text": "Historically, much of the work of coordination has fallen on individuals attending meetings of both organizations. However, as noted in \"Transferring MIB Work from IETF Bridge MIB WG to IEEE 802.1 WG\" [RFC4663], downward pressure on travel budgets has made it increasingly difficult for participants to attend face-to-face meetings in both organizations. That pressure has continued in the intervening years. As a result, the coordination mechanisms described in this section typically do not require meeting attendance.",
      "zh-CHS": "从历史上看，大部分协调工作都落在了参加两个组织会议的个人身上。然而，正如“将MIB工作从IETF桥接MIB工作组转移到IEEE 802.1工作组”[RFC4663]中所述，差旅预算的下行压力使得参与者越来越难以在这两个组织参加面对面的会议。在这几年中，这种压力一直在持续。因此，本节所述的协调机制通常不需要出席会议。"
    },
    {
      "indent": 0,
      "text": "4.1. Exchange of Information about Work Items",
      "section_title": true,
      "zh-CHS": "4.1. 关于工作项目的信息交流"
    },
    {
      "indent": 3,
      "text": "The following sections outline a process that can be used to enable each organization to stay informed about the other's active and proposed work items.",
      "zh-CHS": "以下各节概述了一个流程，该流程可用于使每个组织随时了解其他组织的活动和提议的工作项。"
    },
    {
      "indent": 3,
      "text": "Early identification of topics of mutual interest allows the two organizations to cooperate in a productive way and helps each organization avoid developing specifications that overlap or conflict with specifications developed in the other organization. Where individuals notice a potential conflict or need for coordination, the issue should be brought to the attention of the relevant Working Group chairs and/or Area Directors.",
      "zh-CHS": "尽早确定共同感兴趣的主题可以使两个组织以富有成效的方式进行合作，并帮助每个组织避免制定与另一组织制定的规范重叠或冲突的规范。如果个人注意到潜在冲突或需要协调，则应提请相关工作组主席和/或区域主任注意该问题。"
    },
    {
      "indent": 0,
      "text": "4.1.1. How IEEE 802 Is Informed about Active IETF Work Items",
      "section_title": true,
      "zh-CHS": "4.1.1. 如何告知IEEE 802有关活动IETF工作项的信息"
    },
    {
      "indent": 3,
      "text": "The responsibility is on IEEE 802 Working Groups to review current IETF Working Groups to determine if there are any topics of mutual interest. Working Group charters and active Internet-Drafts can be found in the IETF Datatracker [DATATRACKER]. If an IEEE 802 Working Group identifies a common area of work, the IEEE 802 Working Group leadership should contact both the IETF Working Group chair and the Area Director(s) responsible. This may be accompanied by a formal liaison statement (see Section 5.2).",
      "zh-CHS": "IEEE 802工作组负责审查当前的IETF工作组，以确定是否存在任何共同感兴趣的主题。工作组章程和现行互联网草案可在IETF数据跟踪器[数据跟踪器]中找到。如果IEEE 802工作组确定了一个共同的工作领域，IEEE 802工作组领导层应联系IETF工作组主席和负责的区域主管。可随附正式联络声明（见第5.2节）。"
    },
    {
      "indent": 0,
      "text": "4.1.2. How IETF Is Informed about Active IEEE 802 Work Items",
      "section_title": true,
      "zh-CHS": "4.1.2. 如何告知IETF有关活动IEEE 802工作项的信息"
    },
    {
      "indent": 3,
      "text": "It is the responsibility of IETF Working Groups to periodically review the IEEE 802 web site to determine if there is work in progress of mutual interest.",
      "zh-CHS": "IETF工作组负责定期审查IEEE 802网站，以确定是否有共同感兴趣的工作正在进行中。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 Working Group status reports are published at the beginning and end of each plenary at <http://ieee802.org/minutes>. Each Working Group includes a list of their active projects and the status.",
      "zh-CHS": "IEEE 802工作组状态报告在每次全体会议开始和结束时在<http://ieee802.org/minutes>. 每个工作组都包含一份其活动项目和状态的列表。"
    },
    {
      "indent": 3,
      "text": "The charter of an IEEE 802 project is defined in an approved Project Authorization Request (PAR). PARs are accessible in IEEE Standards myProject, at <https://development.standards.ieee.org>. Access requires an IEEE web account, which is free and has no membership requirement.",
      "zh-CHS": "IEEE 802项目的章程在批准的项目授权请求（PAR）中定义。PAR可在IEEE标准myProject中访问，网址为<https://development.standards.ieee.org>. 访问需要IEEE web帐户，该帐户是免费的，没有会员资格要求。"
    },
    {
      "indent": 3,
      "text": "In myProject, a search on \"View Active PARs\" for 802 will bring up a list of all active IEEE 802 PARs.",
      "zh-CHS": "在myProject中，搜索802的“查看活动PAR”将显示所有活动IEEE 802 PAR的列表。"
    },
    {
      "indent": 3,
      "text": "If an IETF working group identifies a common area of work or a need for cooperation, the Working Group leadership should contact the IEEE 802 Working Group Chair and Task Group Chair. This may be accompanied by a formal liaison statement (see Section 5.2).",
      "zh-CHS": "如果IETF工作组确定了共同的工作领域或合作需求，工作组领导层应联系IEEE 802工作组主席和任务组主席。可随附正式联络声明（见第5.2节）。"
    },
    {
      "indent": 0,
      "text": "4.1.3. Overview of Notifications of New Work Proposals",
      "section_title": true,
      "zh-CHS": "4.1.3. 新工作提案通知概览"
    },
    {
      "indent": 3,
      "text": "These principles describe the notification process used by both organizations:",
      "zh-CHS": "这些原则描述了两个组织使用的通知流程："
    },
    {
      "indent": 3,
      "text": "1. For both organizations, the technical group making a proposal for new work that may conflict with, overlap with, or be dependent on the other organization is responsible for informing the top-level coordination body in the other organization that cooperation may be required.",
      "zh-CHS": "1. 对于这两个组织，提出可能与另一组织冲突、重叠或依赖另一组织的新工作建议的技术小组负责通知另一组织的最高级别协调机构，可能需要合作。"
    },
    {
      "indent": 3,
      "text": "2. For both organizations, the top-level coordination body receiving that notification is responsible for determining whether cooperation is, in fact, required, and informing the specific groups within the organization who may be affected by the proposal for new work.",
      "zh-CHS": "2. 对于这两个组织，收到通知的最高级别协调机构负责确定是否确实需要合作，并通知组织内可能受新工作提案影响的特定群体。"
    },
    {
      "indent": 3,
      "text": "These direct notifications will be the most common way that each organization is informed about proposals for new work in the other organization. Several other ways of identifying proposed new work are described in the following sections. These additional ways act",
      "zh-CHS": "这些直接通知将是每个组织了解其他组织新工作提案的最常见方式。以下章节介绍了确定拟议新工作的其他几种方法。这些额外的方式起作用"
    },
    {
      "indent": 3,
      "text": "as \"belt and suspenders\" to reduce the chances that proposals for new work in one organization escape notice in the other organization when cooperation will be required.",
      "zh-CHS": "作为“皮带和吊杆”，以减少一个组织的新工作提案在需要合作时逃过另一个组织注意的机会。"
    },
    {
      "indent": 0,
      "text": "4.1.4. The New-Work Mailing List",
      "section_title": true,
      "zh-CHS": "4.1.4. 新工作邮件列表"
    },
    {
      "indent": 3,
      "text": "Several standards development organizations (SDOs), including IETF and IEEE 802, have agreed to use a mailing list for the distribution of information about proposals for new work items among these SDOs.",
      "zh-CHS": "包括IETF和IEEE 802在内的多个标准开发组织（SDO）已同意使用邮件列表在这些SDO之间分发有关新工作项提案的信息。"
    },
    {
      "indent": 3,
      "text": "Rather than having individual IEEE 802 participants subscribe directly to New-Work, a single IEEE 802 mailing list is subscribed. Leadership of the IEEE 802 Working Groups may subscribe to this \"second-level\" IEEE 802 mailing list, which is maintained by the Executive Committee (EC).",
      "zh-CHS": "与其让单个IEEE 802参与者直接订阅新作品，不如订阅单个IEEE 802邮件列表。IEEE 802工作组的领导层可签署该“第二级”IEEE 802邮件列表，该列表由执行委员会（EC）维护。"
    },
    {
      "indent": 3,
      "text": "This mailing list is limited to representatives of SDOs proposing new work that may require cooperation with the IETF. Subscription requests may be sent to the IAB Executive Director.",
      "zh-CHS": "此邮件列表仅限于SDO代表提出可能需要与IETF合作的新工作。订阅请求可发送至IAB执行董事。"
    },
    {
      "indent": 0,
      "text": "4.1.5. How IEEE 802 Is Informed about Proposed New IETF Work Items",
      "section_title": true,
      "zh-CHS": "4.1.5. 如何向IEEE 802通报拟议的新IETF工作项"
    },
    {
      "indent": 3,
      "text": "Many proposals for new IETF work items can be identified in proposed Birds of a Feather (BOF) sessions, as well as draft charters for Working Groups. The IETF forwards all such draft charters for new and revised Working Groups and BOF session announcements to the IETF New-Work mailing list.",
      "zh-CHS": "许多新IETF工作项目的提案可以在提议的“羽毛之鸟”（BOF）会议以及工作组章程草案中确定。IETF将新工作组和修订工作组的所有此类章程草案以及BOF会议通知转发至IETF新工作邮件列表。"
    },
    {
      "indent": 0,
      "text": "4.1.6. How IEEE 802 Comments on Proposed New IETF Work Items",
      "section_title": true,
      "zh-CHS": "4.1.6. IEEE 802如何评论提议的新IETF工作项"
    },
    {
      "indent": 3,
      "text": "Each IEEE 802 Working Group Chair, or designated representative, may provide comments on these charters by responding to the IESG mailing list at iesg@ietf.org clearly indicating their IEEE 802 position and the nature of their concern.",
      "zh-CHS": "各IEEE 802工作组主席或指定代表可通过回复IESG邮件列表，在iesg@ietf.org明确表明其IEEE 802的立场及其关注的性质。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the IETF turnaround time for new Working Group charters can be as short as two weeks, although the call-for-comment period on work items that may require cooperation with IEEE 802 can be extended to allow more time for discussion within IEEE 802. This places a burden on both organizations to proactively communicate and avoid \"late surprises\" to either organization.",
      "zh-CHS": "应注意的是，新工作组章程的IETF周转时间可短至两周，但可能需要与IEEE 802合作的工作项目的征求意见期可延长，以便有更多时间在IEEE 802内进行讨论。这给两个组织都带来了一个负担，即主动沟通和避免任何一个组织“迟到的惊喜”。"
    },
    {
      "indent": 3,
      "text": "Although an IEEE 802 Working Group may not be able to develop a formal consensus response unless the notification arrives during that Working Group's meeting, the IEEE 802 Working Group chair can informally let the IETF know that IEEE 802 may have concerns about a proposed work item. The IETF will consider any informal comments received without waiting for a formal liaison statement.",
      "zh-CHS": "尽管IEEE 802工作组可能无法制定正式的共识响应，除非通知在该工作组会议期间送达，但IEEE 802工作组主席可以非正式地让IETF知道IEEE 802可能对提议的工作项目有顾虑。IETF将考虑收到任何非正式意见，而不必等待正式的联络声明。"
    },
    {
      "indent": 0,
      "text": "4.1.7. How IETF Is Informed about Proposed New IEEE 802 Work Items",
      "section_title": true,
      "zh-CHS": "4.1.7. 如何告知IETF拟议的新IEEE 802工作项"
    },
    {
      "indent": 3,
      "text": "An IEEE 802 project is initiated by approval of a Project Authorization Request (PAR), which includes a description of the scope of the work. Any IEEE 802 PARs that introduce new functionality are required to be available for review no less than 30 days prior to the Monday of the IEEE 802 plenary session where they will be considered.",
      "zh-CHS": "IEEE 802项目是通过批准项目授权请求（PAR）启动的，其中包括对工作范围的描述。任何引入新功能的IEEE 802 PAR都必须在IEEE 802全体会议（将在周一进行审议）之前至少30天提交审查。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 considers \"Five Criteria\" when deciding whether to approve new work: Broad Market Potential, Compatibility, Distinct Identity, Technical Feasibility, and Economic Feasibility. The criteria are defined in the IEEE 802 LAN/MAN Standards Committee (LMSC) Operations Manual. The PARs are accompanied by responses on the \"Five Criteria\".",
      "zh-CHS": "IEEE 802在决定是否批准新工作时考虑了“五个标准”：广泛的市场潜力、兼容性、独特的特性、技术可行性和经济可行性。这些标准在IEEE 802 LAN/MAN标准委员会（LMSC）操作手册中定义。PAR附有关于“五个标准”的答复。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 posts proposed PARs to the New-Work mailing list, prior to the IEEE 802 meetings where the PARs will be discussed. The IETF coordination body will notify technical groups about PARs of interest.",
      "zh-CHS": "IEEE 802在讨论PAR的IEEE 802会议之前，将提议的PAR发布到新的工作邮件列表中。IETF协调机构将向技术小组通报感兴趣的PAR。"
    },
    {
      "indent": 0,
      "text": "4.1.8. How IETF Comments on Proposed New IEEE 802 Work Items",
      "section_title": true,
      "zh-CHS": "4.1.8. IETF如何评论提议的新IEEE 802工作项"
    },
    {
      "indent": 3,
      "text": "Any comments on proposed PARs should be submitted to the Working Group Chair and copied to the Executive Committee chair by email not later than 5:00 PM Tuesday of the plenary session (in the time zone where the plenary is located).",
      "zh-CHS": "关于拟议PAR的任何意见应提交给工作组主席，并在全体会议周二下午5:00之前（在全体会议所在时区）通过电子邮件抄送给执行委员会主席。"
    },
    {
      "indent": 0,
      "text": "4.1.9. Other Mechanisms for Coordination",
      "section_title": true,
      "zh-CHS": "4.1.9. 其他协调机制"
    },
    {
      "indent": 3,
      "text": "From time to time, IEEE 802 and IETF may agree to use additional mechanisms for coordination between the two groups. The details of these mechanisms may vary over time, but the overarching goal is to communicate effectively as needed.",
      "zh-CHS": "IEEE 802和IETF可能不时同意在两个组之间使用额外的协调机制。这些机制的细节随着时间的推移可能会有所不同，但总体目标是根据需要进行有效沟通。"
    },
    {
      "indent": 3,
      "text": "As examples of such mechanisms, at the time this document was written, the two organizations are holding periodic conference calls between representatives of the IETF and IEEE 802 leadership teams, and are maintaining a \"living list\" of shared interests between the two organizations, along with the status of these interests and any related action items. At the time this document was written, the \"living list\" included about 20 topics being actively discussed, with more expected. These conference calls help the two organizations coordinate more effectively by allowing higher-bandwidth discussions than formal liaison statements would allow and by permitting more timely interactions than waiting for face-to-face meetings.",
      "zh-CHS": "作为此类机制的示例，在编写本文件时，两个组织正在IETF和IEEE 802领导团队的代表之间定期举行电话会议，并维护两个组织之间共同利益的“活名单”，以及这些利益和任何相关行动项目的状态。在撰写本文件时，“活名单”包括了约20个正在积极讨论的主题，预计会有更多。这些电话会议允许进行比正式联络声明更高带宽的讨论，允许进行比等待面对面会议更及时的互动，从而帮助两个组织更有效地协调。"
    },
    {
      "indent": 3,
      "text": "Minutes for these conference calls, and the \"living lists\" discussed on each call, are available at <http://www.iab.org/activities/ joint-activities/iab-ieee-coordination/>.",
      "zh-CHS": "这些电话会议的会议记录以及每次电话会议上讨论的“活动列表”可在<http://www.iab.org/activities/ 联合活动/iab ieee协调/>。"
    },
    {
      "indent": 0,
      "text": "4.2. Document Review and Approval",
      "section_title": true,
      "zh-CHS": "4.2. 文件审查和批准"
    },
    {
      "indent": 3,
      "text": "During the course of IEEE 802 and IETF cooperation, it is important for technical experts to review documents of mutual interest and, when appropriate, to provide review comments to the approving body as the document moves through the approval process.",
      "zh-CHS": "在IEEE 802和IETF合作过程中，技术专家审查共同感兴趣的文件非常重要，并在适当的情况下，在文件通过审批流程时向审批机构提供审查意见。"
    },
    {
      "indent": 0,
      "text": "4.2.1. IEEE 802 Draft Review and Balloting Processes",
      "section_title": true,
      "zh-CHS": "4.2.1. IEEE 802草案审查和投票过程"
    },
    {
      "indent": 3,
      "text": "IEEE 802 drafts are reviewed and balloted at multiple stages of the draft. Any ballot comments received from non-voters before the close of the ballot are required to be considered in the comment resolution process. The Editors, Task Group Chairs, or Working Group Chairs responsible for the project will facilitate the entering of comments from non-voters.",
      "zh-CHS": "IEEE 802草案在草案的多个阶段进行审查和投票。投票结束前收到的非投票人的任何投票意见都必须在意见解决过程中予以考虑。负责该项目的编辑、工作组主席或工作组主席将协助非投票人发表评论。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 draft reviews and ballots sometimes produce a large volume of comments. In order to handle them efficiently, spreadsheets or a comment database tool are used. It is highly recommended that balloters and others submitting comments do so with a file that can be imported into these tools. A file with the correct format is normally referenced in the ballot announcement or can be obtained from the Editor, Task Group Chair, or Working Group Chair responsible for the project. Comments on a draft should be copied to the Editor, Task Group Chair, and Working Group Chair.",
      "zh-CHS": "IEEE 802草案审查和投票有时会产生大量评论。为了有效地处理它们，使用了电子表格或注释数据库工具。强烈建议投票人和其他提交意见的人使用可导入这些工具的文件来提交意见。具有正确格式的文件通常在选票公告中引用，或者可以从负责项目的编辑、任务组主席或工作组主席处获得。对草稿的评论应抄送编辑、任务组主席和工作组主席。"
    },
    {
      "indent": 0,
      "text": "4.2.1.1. Task Group Review",
      "section_title": true,
      "zh-CHS": "4.2.1.1. 工作组审查"
    },
    {
      "indent": 3,
      "text": "During draft development, informal task group reviews (task group ballots) are conducted. Though these are called \"ballots\" by some Working Groups, the focus is on collecting and resolving comments on the draft rather than on trying to achieve a specific voting result.",
      "zh-CHS": "在起草过程中，进行非正式的工作组审查（工作组投票）。虽然有些工作组称之为“投票”，但重点是收集和解决对草案的意见，而不是试图取得具体的投票结果。"
    },
    {
      "indent": 0,
      "text": "4.2.1.2. Working Group Ballot",
      "section_title": true,
      "zh-CHS": "4.2.1.2. 工作组投票"
    },
    {
      "indent": 3,
      "text": "Once the draft is substantially complete, Working Group ballots are conducted. Working Group voting members are entitled and required to vote in Working Group ballots. Any \"disapprove\" votes are required to be accompanied by comments that indicate what the objection is and a proposed resolution. \"Approve\" votes may also be accompanied by comments. The comments submitted with a \"disapprove\" vote may be marked to indicate which comments need to \"be satisfied\" to change the vote.",
      "zh-CHS": "一旦草案基本完成，将进行工作组投票。工作组投票成员有权并被要求在工作组投票中投票。任何“不赞成”票都必须附有说明反对意见和拟议决议的评论。“批准”投票也可附有评论。以“不赞成”票提交的评论可能会被标记，以表明需要“满足”哪些评论才能更改投票。"
    },
    {
      "indent": 3,
      "text": "Initial Working Group ballots are at least 30 days. Recirculation ballots to review draft changes and comment resolutions are open at least 10 days.",
      "zh-CHS": "工作组的初步投票至少为30天。审查草案变更和评论决议的循环投票至少开放10天。"
    },
    {
      "indent": 3,
      "text": "In order to submit a WG ballot, contact the WG Chair for the submission tool currently in use, as the tools may change over time.",
      "zh-CHS": "为了提交工作组投票，请联系工作组主席以获取当前使用的提交工具，因为这些工具可能会随着时间的推移而变化。"
    },
    {
      "indent": 0,
      "text": "4.2.1.3. Sponsor Ballot",
      "section_title": true,
      "zh-CHS": "4.2.1.3. 赞助商投票"
    },
    {
      "indent": 3,
      "text": "When a draft has successfully completed Working Group ballot, it proceeds to Sponsor ballot. One may participate in IEEE 802 Sponsor ballots with an individual membership in the IEEE Standards Association (IEEE-SA) or by paying a per-ballot fee. Participants are also required to state their affiliation and the category of their relationship to the scope of the standards activity (e.g., producer, user, general interest).",
      "zh-CHS": "当草案成功完成工作组投票后，将进行发起人投票。一个人可以以IEEE标准协会（IEEE-SA）的个人成员身份参加IEEE 802赞助商投票，或者支付每次投票的费用。参与者还需要说明他们的从属关系以及他们与标准活动范围的关系类别（例如，生产者、用户、一般利益）。"
    },
    {
      "indent": 3,
      "text": "Information about IEEE-SA membership can be found at <http://standards.ieee.org/membership/>.",
      "zh-CHS": "有关IEEE-SA成员资格的信息，请访问<http://standards.ieee.org/membership/>."
    },
    {
      "indent": 3,
      "text": "Sponsor ballot is a public review. An invitation is sent to any parties known to be interested in the subject matter of the ballot. One can indicate interest in IEEE myProject (<https://development.standards.ieee.org>). An IEEE web account is freely available and is required for login. To select interest areas, go to the Projects tab and select \"Manage Activity Profile\" and check any areas of interest. IEEE 802 projects are under Computer Society; LAN/MAN Standards Committee.",
      "zh-CHS": "发起人投票是一项公开审查。向已知对投票主题感兴趣的任何一方发出邀请。可以表示对IEEE myProject感兴趣(<https://development.standards.ieee.org>). IEEE web帐户是免费的，需要登录。要选择感兴趣的区域，请转到“项目”选项卡并选择“管理活动配置文件”，然后选中任何感兴趣的区域。IEEE 802项目属于计算机协会；局域网/城域网标准委员会。"
    },
    {
      "indent": 3,
      "text": "The Sponsor ballot pool is formed from those that accept the invitation during the invitation period.",
      "zh-CHS": "发起人投票池由在邀请期内接受邀请的人组成。"
    },
    {
      "indent": 3,
      "text": "As with other ballot levels, the IETF participants who want to comment on Sponsor ballots need not be members in the Sponsor ballot pool. The Editors, Task Group Chairs, or Working Group Chairs responsible for the project will facilitate the entering of comments from IETF participants who are not members in the Sponsor ballot pool.",
      "zh-CHS": "与其他投票级别一样，希望对赞助商投票发表意见的IETF参与者不必是赞助商投票池中的成员。负责该项目的编辑、任务组主席或工作组主席将帮助非发起人投票池成员的IETF参与者输入评论。"
    },
    {
      "indent": 3,
      "text": "Any \"disapprove\" votes are required to be accompanied by comments that indicate what the objection is, along with a proposed resolution. \"Approve\" votes may also be accompanied by comments. The comments submitted with a \"disapprove\" vote may be marked to indicate which comments need to \"be satisfied\" for the commenter to change the vote from \"disapprove\".",
      "zh-CHS": "任何“不赞成”的投票都必须附有表明反对意见的评论以及提议的决议。“批准”投票也可附有评论。随“不赞成”投票一起提交的评论可能会被标记，以表明评论人需要“满足”哪些评论才能将投票从“不赞成”改为“不赞成”。"
    },
    {
      "indent": 3,
      "text": "Initial Sponsor ballots are open for at least 30 days. Recirculation ballots to review draft changes and proposed comment resolutions are open at least 10 days.",
      "zh-CHS": "初始赞助商投票至少开放30天。审查草案变更和建议意见决议的循环投票至少在10天内开放。"
    },
    {
      "indent": 0,
      "text": "4.2.1.4. Ballot Resolution",
      "section_title": true,
      "zh-CHS": "4.2.1.4. 投票决议"
    },
    {
      "indent": 3,
      "text": "At each level, the relevant group (Task Group for TG ballots, Working Group for WG and Sponsor ballots) examines the ballot comments and determines their disposition. The Editor (or editorial team) may prepare proposed dispositions. Task Group procedures vary, but at the Working Group level, the Working Group must vote 75 percent to approve the final ballot disposition in order to advance the document.",
      "zh-CHS": "在每一级，相关小组（TG投票工作组、工作组和发起人投票工作组）审查投票评论并确定其处置。编辑（或编辑团队）可以准备提议的处置。工作组的程序各不相同，但在工作组一级，工作组必须以75%的票数批准最终投票结果，以推进文件。"
    },
    {
      "indent": 0,
      "text": "4.2.2. IETF Draft Review and Approval Processes",
      "section_title": true,
      "zh-CHS": "4.2.2. IETF草案审查和批准流程"
    },
    {
      "indent": 3,
      "text": "The IETF Working Group Process is defined in [BCP25]. The overall IETF standards process is defined in [BCP9].",
      "zh-CHS": "IETF工作组流程定义见[BCP25]。整个IETF标准过程在[BCP9]中定义。"
    },
    {
      "indent": 3,
      "text": "As noted in Section 2.4, IETF Working Groups do not \"ballot\" to determine Working Group consensus to forward documents to the IESG for approval.",
      "zh-CHS": "如第2.4节所述，IETF工作组不进行“投票”，以确定工作组是否同意将文件提交IESG批准。"
    },
    {
      "indent": 3,
      "text": "Technical contributions are welcome at any point in the IETF document review and approval process, but there are some points where contribution is more likely to be effective.",
      "zh-CHS": "在IETF文件审查和批准过程中的任何时候，技术贡献都是受欢迎的，但在某些情况下，技术贡献更可能有效。"
    },
    {
      "indent": 3,
      "text": "1. When a Working Group is considering adoption of an individual draft. Adoption is often announced on the Working Group's mailing list.",
      "zh-CHS": "1. 当一个工作组正在考虑通过一个单独的草案时。收养通常在工作组的邮件列表上公布。"
    },
    {
      "indent": 3,
      "text": "2. When Working Group chairs issue a \"Working Group Last Call\" (\"WGLC\") for a draft, to confirm that the Working Group has consensus to request publication. Although this is not a mandatory step in the document review and approval process for Internet-Drafts, most IETF Working Groups do issue WGLCs for most Working Group documents. WGLC would be announced on the Working Group's mailing list.",
      "zh-CHS": "2. 当工作组主席就草案发出“工作组最后呼吁”（“WGLC”）时，以确认工作组已就要求公布达成共识。尽管这不是互联网草案文件审查和批准流程中的强制性步骤，但大多数IETF工作组确实为大多数工作组文件发布了WGLCs。工作组将在工作组的邮寄名单上公布WGLC。"
    },
    {
      "indent": 3,
      "text": "3. When the Internet Engineering Steering Group issues an \"IETF Last Call\" (\"Last Call\") for a draft. IETF Last Call is a formal and required part of the review and approval process, is addressed to the larger IETF community, and is often the first time the entire community has looked at the document. IETF Last Call is signaled on the IETF-Announce Mailing List, and comments and feedback are ordinarily directed to the IETF Discussion Mailing List.",
      "zh-CHS": "3. 当互联网工程指导小组发布草案的“IETF最后一次调用”（“最后一次调用”）时。IETF Last Call是审查和批准流程的一个正式且必需的部分，面向更大的IETF社区，通常是整个社区第一次查看该文档。IETF最后一次呼叫在IETF公告邮件列表上发出信号，评论和反馈通常指向IETF讨论邮件列表。"
    },
    {
      "indent": 3,
      "text": "In practice, earlier input is more likely to be effective input. IEEE 802 participants who are interested in work within the IETF should be monitoring that work and providing input long before Working Group Last Calls and IETF Last Calls, for best results.",
      "zh-CHS": "在实践中，较早的输入更有可能是有效的输入。对IETF内的工作感兴趣的IEEE 802参与者应在工作组最后一次呼叫和IETF最后一次呼叫之前很久监控该工作并提供输入，以获得最佳结果。"
    },
    {
      "indent": 3,
      "text": "Some IETF Working Group charters direct the Working Group to communicate with relevant IEEE 802 Task Groups.",
      "zh-CHS": "一些IETF工作组章程指示工作组与相关IEEE 802任务组进行通信。"
    },
    {
      "indent": 0,
      "text": "4.3. Solicited Review Processes",
      "section_title": true,
      "zh-CHS": "4.3. 征求意见的审查程序"
    },
    {
      "indent": 3,
      "text": "With the number of areas of cooperation between IEEE 802 and IETF increasing, the document review process has extended beyond the traditional subjects of SMI (Structure of Management Information) MIB modules and AAA (Authentication, Authorization, and Accounting) described in [RFC4441]. IESG members routinely solicit directorate reviews as a means to request the opinion of specialized experts on specific aspects of documents in IESG review (examples include security, \"MIB Doctors\", or congestion management reviews). Area Directors may also require solicited reviews from IEEE 802 or IEEE 802 Working Groups when it becomes clear that the Internet-Draft has implications that impact some area of IEEE 802's responsibility and expertise.",
      "zh-CHS": "随着IEEE 802和IETF之间合作领域数量的增加，文件审查过程已超出[RFC4441]中所述的SMI（管理信息结构）MIB模块和AAA（认证、授权和记帐）等传统主题。IESG成员定期征求董事会审查意见，以征求专业专家对IESG审查文件的特定方面的意见（例如安全、“MIB医生”或拥堵管理审查）。当互联网草案明显影响到IEEE 802责任和专业知识的某些领域时，区域主管还可能要求IEEE 802或IEEE 802工作组进行征求意见的审查。"
    },
    {
      "indent": 3,
      "text": "IEEE 802 leadership can also solicit similar reviews, but these reviews are not included as part of the formal IEEE 802 process.",
      "zh-CHS": "IEEE 802领导层也可以征求类似的审查，但这些审查不包括在正式的IEEE 802过程中。"
    },
    {
      "indent": 0,
      "text": "5. Liaison Managers and Liaison Statements",
      "section_title": true,
      "zh-CHS": "5. 联络经理和联络声明"
    },
    {
      "indent": 3,
      "text": "Both IEEE 802 and IETF work best when people participate directly in work of mutual interest, but that is not always possible, and individuals speaking as individuals may not provide effective communication between the two SDOs. From time to time, it may be appropriate for a technical body in one SDO to communicate as a body with a technical body in the other SDO. This section describes the mechanisms used to provide formal communication between the two organizations, should that become necessary.",
      "zh-CHS": "当人们直接参与共同感兴趣的工作时，IEEE 802和IETF都能发挥最好的作用，但这并不总是可能的，而且以个人身份发言的个人可能无法在两个SDO之间提供有效的通信。有时，一个SDO中的技术机构可能适合作为一个机构与另一个SDO中的技术机构进行沟通。本节描述了必要时用于在两个组织之间提供正式沟通的机制。"
    },
    {
      "indent": 3,
      "text": "The Internet Architecture Board (IAB) is responsible for liaison relationship oversight for the IETF. In IEEE 802, liaison relationship oversight is distributed, and each organization appointing liaison managers is responsible for oversight of its own liaison relationships.",
      "zh-CHS": "互联网体系结构委员会（IAB）负责IETF的联络关系监督。在IEEE 802中，联络关系监督是分布式的，每个指定联络经理的组织负责监督自己的联络关系。"
    },
    {
      "indent": 3,
      "text": "The reader should note that the role of a liaison manager in both IEEE 802 and IETF is not to \"speak for\" the appointing organization. A liaison manager is most helpful in ensuring that neither organization is surprised by what's happening in the other organization, helping to identify the right people to be talking to",
      "zh-CHS": "读者应注意，在IEEE 802和IETF中，联络经理的作用不是“代表”指定组织。联络经理最有助于确保两个组织都不会对另一个组织发生的事情感到惊讶，从而帮助确定合适的谈话对象"
    },
    {
      "indent": 3,
      "text": "in each organization, and making sure that formal liaison statements don't \"get lost\" between the two organizations. The IAB's guidance to liaison managers is available in [RFC4691]. IEEE 802 organizations appointing each liaison manager also provide guidance to those liaison managers. There is no global guidance for all IEEE 802 liaison managers.",
      "zh-CHS": "确保两个组织之间的正式联络声明不会“丢失”。IAB对联络经理的指导见[RFC4691]。任命各联络经理的IEEE 802组织也为这些联络经理提供指导。没有针对所有IEEE 802联络经理的全球指南。"
    },
    {
      "indent": 0,
      "text": "5.1. Liaison Managers",
      "section_title": true,
      "zh-CHS": "5.1. 联络经理"
    },
    {
      "indent": 3,
      "text": "The IAB appoints IETF liaison managers using the process described in [BCP102]. The current list of the IETF's liaison relationships and the liaison managers responsible for each of these relationships is available at <http://www.ietf.org/liaison/managers.html>.",
      "zh-CHS": "IAB使用[BCP102]中描述的流程任命IETF联络经理。IETF联络关系和负责每种联络关系的联络经理的当前列表可在<http://www.ietf.org/liaison/managers.html>."
    },
    {
      "indent": 3,
      "text": "IEEE liaison managers are selected by the organizations they represent, either in an election or by Working Group or Task Group Chair appointment. The current list of IEEE 802's liaison relationships and the liaison managers responsible for each of these relationships is available at <http://www.ieee802.org/liaisons.shtml>.",
      "zh-CHS": "IEEE联络经理由其所代表的组织在选举中或由工作组或任务组主席任命的方式选出。IEEE 802联络关系的当前列表以及负责这些关系的联络经理可访问<http://www.ieee802.org/liaisons.shtml>."
    },
    {
      "indent": 0,
      "text": "5.2. Liaison Statements",
      "section_title": true,
      "zh-CHS": "5.2. 联络声明"
    },
    {
      "indent": 3,
      "text": "The IEEE 802 procedure for sending and receiving liaison statements is defined by the Procedure for Coordination with Other Standards Bodies in the IEEE 802 LMSC Operations Manual (<http://ieee802.org/devdocs.shtml>).",
      "zh-CHS": "发送和接收联络声明的IEEE 802程序由IEEE 802 LMSC操作手册中与其他标准机构协调的程序定义(<http://ieee802.org/devdocs.shtml>)."
    },
    {
      "indent": 3,
      "text": "The IETF process for sending and receiving liaison statements is defined in [BCP103].",
      "zh-CHS": "[BCP103]中定义了发送和接收联络声明的IETF流程。"
    },
    {
      "indent": 0,
      "text": "6. Protocol Parameter Allocation",
      "section_title": true,
      "zh-CHS": "6. 协议参数分配"
    },
    {
      "indent": 3,
      "text": "Both IEEE 802 and IETF maintain registries of assigned protocol parameters, and some protocol parameters assigned in one organization are of interest to the other organization. This section describes the way each organization registers protocol parameters.",
      "zh-CHS": "IEEE802和IETF都维护分配的协议参数的注册表，并且在一个组织中分配的一些协议参数对另一个组织很重要。本节描述每个组织注册协议参数的方式。"
    },
    {
      "indent": 0,
      "text": "6.1. IANA",
      "section_title": true,
      "zh-CHS": "6.1. 伊安娜"
    },
    {
      "indent": 3,
      "text": "The IETF uses the Internet Assigned Numbers Authority (IANA) as a central authority that administers registries for most protocol parameter allocations. The overarching document describing this is [BCP26]. [BCP141] discusses use of IEEE 802-specific IANA parameters in IETF protocols and specifies IANA considerations for allocation of code points under the IANA OUI (Organizationally Unique Identifier).",
      "zh-CHS": "IETF使用Internet分配号码管理局（IANA）作为管理大多数协议参数分配注册表的中央管理局。描述这一点的主要文件是[BCP26]。[BCP141]讨论IETF协议中IEEE 802特定IANA参数的使用，并指定在IANA OUI（组织唯一标识符）下分配代码点的IANA注意事项。"
    },
    {
      "indent": 3,
      "text": "Requests for protocol parameter allocations from IANA are subject to assignment policies, and these policies vary from registry to registry. A variety of well-known policies are described in [BCP26], but registries are not limited to one of the well-known choices.",
      "zh-CHS": "IANA对协议参数分配的请求受分配策略的约束，这些策略因注册表而异。[BCP26]中描述了各种众所周知的策略，但注册中心并不限于其中一种众所周知的选择。"
    },
    {
      "indent": 3,
      "text": "The purpose of these allocations is to manage a namespace appropriately, so unless a registry has a policy that allows something like first come, first served (\"FCFS\") for a namespace that is effectively unbounded, requests for protocol parameter allocation will require some level of review. \"Standards Action\" is at the other extreme (an approved Standards Track RFC is required in order to obtain an allocation). Some registries require that a request for allocation pass \"Expert Review\" -- review by someone knowledgeable in the technology domain, appointed by the IESG and given specific criteria to use when reviewing requests.",
      "zh-CHS": "这些分配的目的是适当地管理一个名称空间，因此，除非注册中心有一个策略，允许对一个实际上是无界的名称空间使用“先到先得”（FCFS）之类的策略，否则协议参数分配的请求将需要一定程度的审查。“标准行动”是另一个极端（为了获得分配，需要批准的标准跟踪RFC）。一些登记处要求分配请求通过“专家审查”——由IESG任命的技术领域知识丰富的人员进行审查，并给出审查请求时使用的具体标准。"
    },
    {
      "indent": 0,
      "text": "6.2. IEEE Registration Authority",
      "section_title": true,
      "zh-CHS": "6.2. IEEE注册当局"
    },
    {
      "indent": 3,
      "text": "The IEEE Standards Association uses the IEEE Registration Authority as a central authority administering registries. The IEEE Registration Authority Committee (IEEE RAC) provides technical oversight for the IEEE Registration Authority.",
      "zh-CHS": "IEEE标准协会使用IEEE注册机构作为管理注册的中央机构。IEEE注册机构委员会（IEEE RAC）为IEEE注册机构提供技术监督。"
    },
    {
      "indent": 3,
      "text": "The list of Registries administered by the IEEE Registration Authority can be found on the IEEE RAC web site, at <http://standards.ieee.org/develop/regauth/general.html>.",
      "zh-CHS": "IEEE注册机构管理的注册列表可在IEEE RAC网站上找到，网址为<http://standards.ieee.org/develop/regauth/general.html>."
    },
    {
      "indent": 3,
      "text": "Regarding Ethertype allocation: Some IETF protocol specifications make use of Ethertypes. Ethertypes are a fairly scarce resource so allocation has the following requirements. All Ethertype requests are subject to review by a consultant to the IEEE RA, followed by IEEE RAC confirmation.",
      "zh-CHS": "关于以太网类型分配：一些IETF协议规范使用以太网类型。Ethertypes是一种相当稀缺的资源，因此分配有以下要求。所有Ethertype请求都要经过IEEE RA顾问的审查，然后由IEEE RAC确认。"
    },
    {
      "indent": 3,
      "text": "The IEEE RAC will not assign a new Ethertype to a new IETF protocol specification until the IESG has approved the protocol specification for publication as an RFC. In exceptional cases, the IEEE RA will consider \"early allocation\" of an Ethertype for an IETF protocol that is still under development when the request comes from, and has been vetted by, the IESG.",
      "zh-CHS": "在IESG批准协议规范作为RFC发布之前，IEEE RAC不会将新的Ethertype分配给新的IETF协议规范。在特殊情况下，IEEE RA将考虑对IETF协议的“早期分配”，该IETF协议在请求来自于IESG时仍在开发中。"
    },
    {
      "indent": 3,
      "text": "Note that \"playpen\" Ethertypes have been assigned in IEEE 802 [ARCH802] for use during protocol development and experimentation.",
      "zh-CHS": "请注意，“playpen”以太类型已在IEEE 802[ARCH802]中分配，以便在协议开发和实验期间使用。"
    },
    {
      "indent": 3,
      "text": "While a fee is normally charged by the IEEE Registration Authority Committee (RAC) for the allocation of an Ethertype, the IEEE RAC will consider waiving the fee for allocations relating to an IETF Standards Track document, based on a request from the IESG.",
      "zh-CHS": "虽然IEEE注册委员会（RAC）通常收取费用来分配ESETYPE，IEEE RAC将考虑放弃IETF标准跟踪文件的分配费，基于IEESG的请求。"
    },
    {
      "indent": 0,
      "text": "6.3. IEEE 802 Registration at the Working Group Level",
      "section_title": true,
      "zh-CHS": "6.3. 工作组级别的IEEE 802注册"
    },
    {
      "indent": 3,
      "text": "Each IEEE 802 Working Group has a registry of identifier values and a mechanism to allocate identifier values in its standards and approved amendments. This includes items such as Object Identifiers for managed objects and assignment for protocols defined by that Working Group, such as OpCodes. Contact the IEEE 802 Working Group Chair for the details of a given Working Group registry.",
      "zh-CHS": "每个IEEE 802工作组都有一个标识符值注册表和一个在其标准和经批准的修订中分配标识符值的机制。这包括管理对象的对象标识符和该工作组定义的协议（如操作码）的分配等项。有关给定工作组注册表的详细信息，请联系IEEE 802工作组主席。"
    },
    {
      "indent": 0,
      "text": "6.4. Joint-Use Registries",
      "section_title": true,
      "zh-CHS": "6.4. 联合使用登记册"
    },
    {
      "indent": 3,
      "text": "Because some registries are \"joint-use\" between IEEE 802 and IETF, it is necessary for each organization to review usage of registries maintained by the other organization as part of the review and approval process for standards.",
      "zh-CHS": "由于某些注册中心是IEEE 802和IETF之间的“联合使用”，因此每个组织都有必要审查由其他组织维护的注册中心的使用情况，作为标准审查和批准流程的一部分。"
    },
    {
      "indent": 3,
      "text": "If an IEEE 802 document refers to IANA registries, those references should be checked prior to Sponsor balloting. If an IETF document refers to IEEE 802 registries, those references should be checked as part of IANA Review during IETF Last Call.",
      "zh-CHS": "如果IEEE 802文件引用IANA注册，则应在发起人投票前检查这些引用。如果IETF文件引用了IEEE 802注册中心，则应在IETF最后一次呼叫期间检查这些引用，作为IANA审查的一部分。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document describes cooperation procedures and has no direct Internet security implications.",
      "zh-CHS": "本文件描述了合作程序，没有直接的互联网安全影响。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[BCP26] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[BCP26]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[BCP141] Eastlake 3rd, D. and J. Abley, \"IANA Considerations and IETF Protocol and Documentation Usage for IEEE 802 Parameters\", BCP 141, RFC 7042, October 2013.",
      "zh-CHS": "[BCP141]Eastlake 3rd，D.和J.Abley，“IEEE802参数的IANA考虑因素和IETF协议及文档使用”，BCP 141，RFC 7042，2013年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4691] Andersson, L., Ed., \"Guidelines for Acting as an IETF Liaison to Another Organization\", RFC 4691, October 2006.",
      "zh-CHS": "[RFC4691]Andersson，L.，Ed.“作为IETF与另一组织的联络人的指南”，RFC 4691，2006年10月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[ARCH802] IEEE 802, \"IEEE Standard for Local and Metropolitan Area Networks: Overview and Architecture\", IEEE 802 Std 802(TM)-2014, 2014.",
      "zh-CHS": "[ARCH802]IEEE 802，“局域网和城域网的IEEE标准：概述和体系结构”，IEEE 802 Std 802（TM）-2014年。"
    },
    {
      "indent": 3,
      "text": "[BCP9] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[BCP9]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 14,
      "text": "Dusseault, L. and R. Sparks, \"Guidance on Interoperation and Implementation Reports for Advancement to Draft Standard\", BCP 9, RFC 5657, September 2009.",
      "zh-CHS": "Dusseault，L.和R.Sparks，“推进标准草案的互操作和实施报告指南”，BCP 9，RFC 5657，2009年9月。"
    },
    {
      "indent": 14,
      "text": "Housley, R., Crocker, D., and E. Burger, \"Reducing the Standards Track to Two Maturity Levels\", BCP 9, RFC 6410, October 2011.",
      "zh-CHS": "Housley，R.，Crocker，D.，和E.Burger，“将标准轨道降低到两个成熟度水平”，BCP 9，RFC 6410，2011年10月。"
    },
    {
      "indent": 14,
      "text": "Resnick, P., \"Retirement of the \"Internet Official Protocol Standards\" Summary Document\", BCP 9, RFC 7100, December 2013.",
      "zh-CHS": "Resnick，P.，“互联网官方协议标准”的退役摘要文件，BCP 9，RFC 7100，2013年12月。"
    },
    {
      "indent": 14,
      "text": "Kolkman, O., Bradner, S., and S. Turner, \"Characterization of Proposed Standards\", BCP 9, RFC 7127, January 2014.",
      "zh-CHS": "Kolkman，O.，Bradner，S.和S.Turner，“拟定标准的特征”，BCP 9，RFC 7127，2014年1月。"
    },
    {
      "indent": 3,
      "text": "[BCP10] Galvin, J., Ed., \"IAB and IESG Selection, Confirmation, and Recall Process: Operation of the Nominating and Recall Committees\", BCP 10, RFC 3777, June 2004.",
      "zh-CHS": "[BCP10]Galvin，J.，Ed.，“IAB和IESG的选择、确认和召回过程：提名和召回委员会的运作”，BCP 10，RFC 3777，2004年6月。"
    },
    {
      "indent": 14,
      "text": "Dawkins, S., Ed., \"Nominating Committee Process: Earlier Announcement of Open Positions and Solicitation of Volunteers\", BCP 10, RFC 5633, August 2009.",
      "zh-CHS": "Dawkins，S.，Ed.，“提名委员会程序：提前公布空缺职位和招募志愿者”，BCP 10，RFC 5633，2009年8月。"
    },
    {
      "indent": 14,
      "text": "Dawkins, S., Ed., \"The Nominating Committee Process: Open Disclosure of Willing Nominees\", BCP 10, RFC 5680, October 2009.",
      "zh-CHS": "Dawkins，S.，Ed.，“提名委员会程序：自愿被提名人的公开披露”，BCP 10，RFC 56802009年10月。"
    },
    {
      "indent": 14,
      "text": "Leiba, B., \"Update to RFC 3777 to Clarify Nominating Committee Eligibility of IETF Leadership\", BCP 10, RFC 6859, January 2013.",
      "zh-CHS": "Leiba，B.“更新RFC 3777以澄清IETF领导层提名委员会资格”，BCP 10，RFC 6859，2013年1月。"
    },
    {
      "indent": 3,
      "text": "[BCP11] Hovey, R. and S. Bradner, \"The Organizations Involved in the IETF Standards Process\", BCP 11, RFC 2028, October 1996.",
      "zh-CHS": "[BCP11]Hovey，R.和S.Bradner，“参与IETF标准过程的组织”，BCP 11，RFC 2028，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[BCP25] Bradner, S., \"IETF Working Group Guidelines and Procedures\", BCP 25, RFC 2418, September 1998.",
      "zh-CHS": "[BCP25]Bradner，S.，“IETF工作组指南和程序”，BCP 25，RFC 2418，1998年9月。"
    },
    {
      "indent": 14,
      "text": "Wasserman, M., \"Updates to RFC 2418 Regarding the Management of IETF Mailing Lists\", BCP 25, RFC 3934, October 2004.",
      "zh-CHS": "Wasserman，M.，“关于IETF邮件列表管理的RFC 2418更新”，BCP 25，RFC 3934，2004年10月。"
    },
    {
      "indent": 3,
      "text": "[BCP39] Internet Architecture Board and B. Carpenter, Ed., \"Charter of the Internet Architecture Board (IAB)\", BCP 39, RFC 2850, May 2000.",
      "zh-CHS": "[BCP39]互联网架构委员会和B.Carpenter，Ed.，“互联网架构委员会（IAB）章程”，BCP 39，RFC 28502000年5月。"
    },
    {
      "indent": 3,
      "text": "[BCP101] Austein, R., Ed., and B. Wijnen, Ed., \"Structure of the IETF Administrative Support Activity (IASA)\", BCP 101, RFC 4071, April 2005.",
      "zh-CHS": "[BCP101]Austein，R.，Ed.，和B.Wijnen，Ed.，“IETF行政支持活动（IASA）的结构”，BCP 101，RFC 4071，2005年4月。"
    },
    {
      "indent": 14,
      "text": "Carpenter, B., Ed., and L. Lynch, Ed., \"BCP 101 Update for IPR Trust\", BCP 101, RFC 4371, January 2006.",
      "zh-CHS": "Carpenter，B.，Ed.，和L.Lynch，Ed.，“知识产权信托的BCP 101更新”，BCP 101，RFC 4371，2006年1月。"
    },
    {
      "indent": 3,
      "text": "[BCP102] Daigle, L., Ed., and Internet Architecture Board, \"IAB Processes for Management of IETF Liaison Relationships\", BCP 102, RFC 4052, April 2005.",
      "zh-CHS": "[BCP102]Daigle，L.，Ed.，和互联网架构委员会，“IETF联络关系管理的IAB流程”，BCP 102，RFC 4052，2005年4月。"
    },
    {
      "indent": 3,
      "text": "[BCP103] Trowbridge, S., Bradner, S., and F. Baker, \"Procedures for Handling Liaison Statements to and from the IETF\", BCP 103, RFC 4053, April 2005.",
      "zh-CHS": "[BCP103]Trowbridge，S.，Bradner，S.，和F.Baker，“处理进出IETF的联络声明的程序”，BCP 103，RFC 4053，2005年4月。"
    },
    {
      "indent": 3,
      "text": "[BCP111] Heard, C., Ed., \"Guidelines for Authors and Reviewers of MIB Documents\", BCP 111, RFC 4181, September 2005.",
      "zh-CHS": "[BCP111]Heard，C.，Ed.“MIB文件的作者和评审者指南”，BCP 111，RFC 41812005年9月。"
    },
    {
      "indent": 14,
      "text": "Heard, C., Ed., \"RFC 4181 Update to Recognize the IETF Trust\", BCP 111, RFC 4841, March 2007.",
      "zh-CHS": "Heard，C.，Ed.，“RFC 4181更新以确认IETF信任”，BCP 111，RFC 48412007年3月。"
    },
    {
      "indent": 3,
      "text": "[BCP132] Housley, R. and B. Aboba, \"Guidance for Authentication, Authorization, and Accounting (AAA) Key Management\", BCP 132, RFC 4962, July 2007.",
      "zh-CHS": "[BCP132]Housley，R.和B.Aboba，“认证、授权和记帐（AAA）密钥管理指南”，BCP 132，RFC 4962，2007年7月。"
    },
    {
      "indent": 3,
      "text": "[BCP158] DeKok, A., Ed., and G. Weber, \"RADIUS Design Guidelines\", BCP 158, RFC 6158, March 2011.",
      "zh-CHS": "[BCP158]DeKok，A.，Ed.，和G.Weber，“半径设计指南”，BCP 158，RFC 6158，2011年3月。"
    },
    {
      "indent": 3,
      "text": "[DADG] Morand, L., Ed., Fajardo, V. and H. Tschofenig, \"Diameter Applications Design Guidelines\", Work in Progress, June 2014.",
      "zh-CHS": "[DADG]Morand，L.，Ed.，Fajardo，V.和H.Tschofenig，“直径应用设计指南”，正在进行的工作，2014年6月。"
    },
    {
      "indent": 3,
      "text": "[DATATRACKER] Internet Engineering Task Force, \"IETF Datatracker\", <https://datatracker.ietf.org>.",
      "zh-CHS": "[DATATRACKER]互联网工程任务组，“IETF DATATRACKER”<https://datatracker.ietf.org>."
    },
    {
      "indent": 3,
      "text": "[IEEE80211F] IEEE, \"IEEE Trial-Use Recommended Practice for Multi-Vendor Access Point Interoperability Via an Inter-Access Point Protocol Across Distribution Systems Supporting IEEE 802.11 Operation\", IEEE 802 Std 802.11F(TM)-2003, 2003.",
      "zh-CHS": "[IEEE80211F]IEEE，“通过支持IEEE 802.11操作的配电系统间接入点协议实现多供应商接入点互操作性的IEEE试用推荐规程”，IEEE 802 Std 802.11F（TM）-2003年。"
    },
    {
      "indent": 3,
      "text": "[IEEE-802.16-Liaison1] Liaison letter from IEEE 802.16 to Bernard Aboba, March 17, 2005, <http://ieee802.org/16/liaison/docs/L80216-05_025.pdf>.",
      "zh-CHS": "[IEEE-802.16-联络1]IEEE 802.16致Bernard Aboba的联络函，2005年3月17日<http://ieee802.org/16/liaison/docs/L80216-05_025.pdf>."
    },
    {
      "indent": 3,
      "text": "[IEEE-802.16-Liaison2] Liaison letter from IEEE 802.16 to Bernard Aboba, May 5, 2005, <http://ieee802.org/16/liaison/docs/L80216-05_039.pdf>.",
      "zh-CHS": "[IEEE-802.16-联络2]IEEE 802.16致Bernard Aboba的联络函，2005年5月5日<http://ieee802.org/16/liaison/docs/L80216-05_039.pdf>."
    },
    {
      "indent": 3,
      "text": "[RFC3575] Aboba, B., \"IANA Considerations for RADIUS (Remote Authentication Dial In User Service)\", RFC 3575, July 2003.",
      "zh-CHS": "[RFC3575]Aboba，B.“RADIUS（远程认证拨入用户服务）的IANA注意事项”，RFC 3575，2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3710] Alvestrand, H., \"An IESG charter\", RFC 3710, February 2004.",
      "zh-CHS": "[RFC3710]Alvestrand，H.，“IESG宪章”，RFC 37102004年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3748] Aboba, B., Blunk, L., Vollbrecht, J., Carlson, J., and H. Levkowetz, Ed., \"Extensible Authentication Protocol (EAP)\", RFC 3748, June 2004.",
      "zh-CHS": "[RFC3748]Aboba，B.，Blunk，L.，Vollbrecht，J.，Carlson，J.，和H.Levkowetz，Ed.，“可扩展认证协议（EAP）”，RFC 3748，2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4137] Vollbrecht, J., Eronen, P., Petroni, N., and Y. Ohba, \"State Machines for Extensible Authentication Protocol (EAP) Peer and Authenticator\", RFC 4137, August 2005.",
      "zh-CHS": "[RFC4137]Vollbrecht，J.，Eronen，P.，Petroni，N.，和Y.Ohba，“可扩展认证协议（EAP）对等方和认证方的状态机”，RFC 4137，2005年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4441] Aboba, B., Ed., \"The IEEE 802/IETF Relationship\", RFC 4441, March 2006.",
      "zh-CHS": "[RFC4441]Aboba，B.，编辑，“IEEE 802/IETF关系”，RFC 44412006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4663] Harrington, D., \"Transferring MIB Work from IETF Bridge MIB WG to IEEE 802.1 WG\", RFC 4663, September 2006.",
      "zh-CHS": "[RFC4663]Harrington，D.，“将MIB工作从IETF桥接MIB工作组转移到IEEE 802.1工作组”，RFC 4663，2006年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5247] Aboba, B., Simon, D., and P. Eronen, \"Extensible Authentication Protocol (EAP) Key Management Framework\", RFC 5247, August 2008.",
      "zh-CHS": "[RFC5247]Aboba，B.，Simon，D.，和P.Eronen，“可扩展认证协议（EAP）密钥管理框架”，RFC 5247，2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6220] McPherson, D., Ed., Kolkman, O., Ed., Klensin, J., Ed., Huston, G., Ed., and Internet Architecture Board, \"Defining the Role and Function of IETF Protocol Parameter Registry Operators\", RFC 6220, April 2011.",
      "zh-CHS": "[RFC6220]McPherson，D.，Ed.，Kolkman，O.，Ed.，Klensin，J.，Ed.，Huston，G.，Ed.，和互联网架构委员会，“定义IETF协议参数注册操作员的角色和功能”，RFC 6220，2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6548] Brownlee, N., Ed., and IAB, \"Independent Submission Editor Model\", RFC 6548, June 2012.",
      "zh-CHS": "[RFC6548]Brownlee，N.，Ed.，和IAB，“独立提交编辑器模型”，RFC6548，2012年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6635] Kolkman, O., Ed., Halpern, J., Ed., and IAB, \"RFC Editor Model (Version 2)\", RFC 6635, June 2012.",
      "zh-CHS": "[RFC6635]Kolkman，O.，Ed.，Halpern，J.，Ed.，和IAB，“RFC编辑器模型（版本2）”，RFC 66352012年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6733] Fajardo, V., Ed., Arkko, J., Loughney, J., and G. Zorn, Ed., \"Diameter Base Protocol\", RFC 6733, October 2012.",
      "zh-CHS": "[RFC6733]Fajardo，V.，Ed.，Arkko，J.，Loughney，J.，和G.Zorn，Ed.，“直径基础协议”，RFC 6733，2012年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6756] Trowbridge, S., Ed., Lear, E., Ed., Fishman, G., Ed., and S. Bradner, Ed., \"Internet Engineering Task Force and International Telecommunication Union - Telecommunication Standardization Sector Collaboration Guidelines\", RFC 6756, September 2012.",
      "zh-CHS": "[RFC6756]Trowbridge，S.，Ed.，Lear，E.，Ed.，Fishman，G.，Ed.，和S.Bradner，Ed.，“互联网工程任务组和国际电信联盟-电信标准化部门协作指南”，RFC 67562012年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6929] DeKok, A. and A. Lior, \"Remote Authentication Dial In User Service (RADIUS) Protocol Extensions\", RFC 6929, April 2013.",
      "zh-CHS": "[RFC6929]DeKok，A.和A.Lior，“远程身份验证拨入用户服务（RADIUS）协议扩展”，RFC 69292013年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC7282] Resnick, P., \"On Consensus and Humming in the IETF\", RFC 7282, June 2014.",
      "zh-CHS": "[RFC7282]Resnick，P.，“关于IETF中的共识和嗡嗡声”，RFC 7282，2014年6月。"
    },
    {
      "indent": 3,
      "text": "[RONR] Robert, H., et al., \"Robert's Rules of Order Newly Revised\", 11th ed., Da Capo Press, 2011, <http://www.robertsrules.com/>.",
      "zh-CHS": "[RONR]Robert，H.等人，“Robert的新修订的秩序规则”，第11版，达卡波出版社，2011年<http://www.robertsrules.com/>."
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "zh-CHS": "9. 致谢"
    },
    {
      "indent": 3,
      "text": "This document borrows a significant amount of text, and much of its structure, from [RFC6756]. Additional text was borrowed from [RFC4441]. We are grateful to the authors and editors of both these predecessor documents.",
      "zh-CHS": "本文档大量借用了[RFC6756]中的文本及其大部分结构。从[RFC4441]中借用了其他文本。我们感谢这两份先前文件的作者和编辑。"
    },
    {
      "indent": 3,
      "text": "The initial draft of this document was assembled by a team of participants from both IEEE 802 and IETF. Team members included Dan Romascanu, Dorothy Stanley, Eric Gray, Patricia Thaler, Roger Marks, Ross Callon, Spencer Dawkins, and Subir Das.",
      "zh-CHS": "本文件的初稿由来自IEEE 802和IETF的参与者组成的团队汇编而成。团队成员包括Dan Romascanu、Dorothy Stanley、Eric Gray、Patricia Thaler、Roger Marks、Ross Callon、Spencer Dawkins和Subir Das。"
    },
    {
      "indent": 3,
      "text": "We also thank Abdussalam Baryun, Adrian Farrel, Dave Thaler, Jari Arkko, Russ Housley, Jouni Korhonen, Max Riegel, Norm Finn, Pete Resnick, Peter Yee, S. Moonesamy, and Stephen Farrell for providing review comments.",
      "zh-CHS": "我们还感谢阿卜杜萨兰国的巴伦、阿德里安·法雷尔、戴夫·泰勒、贾里·阿尔科、罗斯·霍斯利、朱尼·科霍宁、马克斯·里格尔、诺姆·芬恩、皮特·雷斯尼克、彼得·叶、S.穆内萨米和斯蒂芬·法雷尔提供了审查意见。"
    },
    {
      "indent": 0,
      "text": "10. IAB Members at the Time of Approval",
      "section_title": true,
      "zh-CHS": "10. 批准时的IAB成员"
    },
    {
      "indent": 3,
      "text": "Bernard Aboba Jari Arkko Marc Blanchet Ross Callon Alissa Cooper Joel Halpern Russ Housley Eliot Lear Xing Li Erik Nordmark Andrew Sullivan Dave Thaler Hannes Tschofenig",
      "zh-CHS": "Bernard Aboba Jari Arkko Marc Blanchet Ross Callon Alissa Cooper Joel Halpern Russ Housley Eliot Lear Xing Li Erik Nordmark Andrew Sullivan Dave Thaler Hannes Tschofenig"
    },
    {
      "indent": 0,
      "text": "11. IEEE 802 Executive Committee Members at the Time of Approval",
      "section_title": true,
      "zh-CHS": "11. 批准时的IEEE 802执行委员会成员"
    },
    {
      "indent": 3,
      "text": "Radhakrishna Canchi Clint Chaplin John D'Ambrosia Subir Das James Gilb Bob Heile Tony Jeffree Bruce Kraemer David Law John Lemon Mike Lynch Roger Marks Apurva Mody Paul Nikolich Max Riegel Jon Rosdahl Steve Shellhammer Pat Thaler Geoff Thompson",
      "zh-CHS": "Radhakrishna Canchi Clint卓别林John D'Ambrosia Subir Das James Gilb Bob Heile Tony Jeffree Bruce Kraemer David Law John Lemon Mike Lynch Roger Marks Apurva Mody Paul Nikolich Max Riegel Jon Rosdahl Steve Shellhammer Pat Thaler Geoff Thompson"
    },
    {
      "indent": 0,
      "text": "Appendix A. Current Examples of IEEE 802 and IETF Cooperation",
      "section_title": true,
      "zh-CHS": "附录A.IEEE 802和IETF合作的当前示例"
    },
    {
      "indent": 0,
      "text": "A.1. MIB Review",
      "section_title": true,
      "zh-CHS": "A.1. MIB审查"
    },
    {
      "indent": 3,
      "text": "Historically, the MIB modules for IEEE 802.1 and IEEE 802.3 were developed in the IETF Bridge MIB and Hub MIB Working Groups, respectively. With travel budgets under pressure, it has become increasingly difficult for companies to fund employees to attend both IEEE 802 and IETF meetings.",
      "zh-CHS": "过去，IEEE 802.1和IEEE 802.3的MIB模块分别在IETF桥接MIB和集线器MIB工作组中开发。由于差旅预算面临压力，公司越来越难以资助员工参加IEEE 802和IETF会议。"
    },
    {
      "indent": 3,
      "text": "As a result, an alternative was found to past arrangements that involved chartering MIB work items within an IETF WG. Instead, the work was transferred to IEEE 802 with expert support for MIB review from the IETF. The process of transfer of the MIB work from the IETF Bridge MIB WG to IEEE 802.1 WG is documented in [RFC4663].",
      "zh-CHS": "因此，找到了一种替代以往安排的方法，即在IETF工作组内租用MIB工作项。取而代之的是，这项工作在IETF对MIB审查的专家支持下转移到了IEEE 802。将MIB工作从IETF桥接MIB工作组转移到IEEE 802.1工作组的过程记录在[RFC4663]中。"
    },
    {
      "indent": 3,
      "text": "By standardizing IEEE 802 MIBs only within IEEE 802 while utilizing the IETF SNMP quality control process, the IETF and IEEE 802 seek to ensure quality while decreasing overhead. In order to encourage wider review of MIBs developed by IEEE 802 WGs, it is recommended that MIB modules developed in IEEE 802 follow the MIB guidelines [BCP111]. An IEEE 802 group may request assignment of a \"MIB Doctor\" to assist in a MIB review by contacting the IETF Operations and Management Area Director.",
      "zh-CHS": "通过仅在IEEE 802内标准化IEEE 802 MIB，同时利用IETF SNMP质量控制过程，IETF和IEEE 802寻求在降低开销的同时确保质量。为了鼓励对IEEE 802 WGs开发的MIB进行更广泛的审查，建议在IEEE 802中开发的MIB模块遵循MIB指南[BCP111]。IEEE 802组可通过联系IETF运行和管理区域总监，请求指派“MIB医生”协助MIB审查。"
    },
    {
      "indent": 0,
      "text": "A.2. AAA Review",
      "section_title": true,
      "zh-CHS": "A.2. AAA审查"
    },
    {
      "indent": 3,
      "text": "IEEE 802 WGs requiring new AAA applications should send a liaison request to the IETF. Where new attribute definitions are sufficient, rather than defining new authentication, authorization, and accounting logic and procedures, an Internet-Draft can be submitted and review can be requested from AAA-related WGs such as the RADEXT or DIME WGs.",
      "zh-CHS": "需要新AAA应用程序的IEEE 802 WGs应向IETF发送联络请求。如果新的属性定义足够，而不是定义新的身份验证、授权和记帐逻辑和程序，则可以提交互联网草案，并可以向AAA相关工作组（如RADEXT或DIME工作组）请求审查。"
    },
    {
      "indent": 3,
      "text": "In addition to the RADEXT and DIME WGs, a \"AAA doctors\" team (directorate) is currently active in the OPS Area and can be consulted for more general advice on AAA issues that cross the limits of one or the other of the RADIUS or Diameter protocols, or are more generic in nature.",
      "zh-CHS": "除RADEXT和DIME WGs外，“AAA医生”团队（董事会）目前活跃于OPS领域，可以就跨越半径或直径协议中一个或另一个协议限制的AAA问题或更一般性的AAA问题咨询更多一般性建议。"
    },
    {
      "indent": 3,
      "text": "For attributes of general utility, particularly those useful in multiple potential applications, allocation from the IETF standard attribute space is preferred to creation of IEEE 802 Vendor-Specific Attributes (VSAs). As noted in [RFC3575]: \"RADIUS defines a mechanism for Vendor-Specific extensions (Attribute 26) for functions specific only to one vendor's implementation of RADIUS, where no",
      "zh-CHS": "对于通用设施的属性，特别是在多个潜在应用中有用的属性，从IETF标准属性空间进行分配比创建IEEE 802供应商特定属性（VSA）更为可取。如[RFC3575]中所述：“RADIUS为供应商特定的扩展（属性26）定义了一种机制，用于仅针对一个供应商的RADIUS实现的功能，其中"
    },
    {
      "indent": 3,
      "text": "interoperability is deemed useful. For functions specific only to one vendor's implementation of RADIUS, the use of that should be encouraged instead of the allocation of global attribute types.\"",
      "zh-CHS": "互操作性被认为是有用的。对于仅针对一家供应商的RADIUS实现的功能，应鼓励使用该功能，而不是分配全局属性类型。”"
    },
    {
      "indent": 3,
      "text": "Where allocation of VSAs are required, it is recommended that IEEE 802 create a uniform format for all of IEEE 802, rather than having each IEEE 802 Working Group create their own VSA format. The VSA format defined in [IEEE80211F] is inappropriate for this, since the Type field is only a single octet, allowing for only 255 attributes. It is recommended that IEEE 802 Working Groups read and follow the recommendations in \"RADIUS Design Guidelines\" [BCP158] and \"Protocol Extensions\" [RFC6929] when designing and reviewing new extensions and attributes.",
      "zh-CHS": "如果需要分配VSA，建议IEEE 802为所有IEEE 802创建统一的格式，而不是让每个IEEE 802工作组创建自己的VSA格式。[IEEE80211F]中定义的VSA格式不适用于此，因为类型字段仅为一个八位字节，只允许255个属性。在设计和审查新的扩展和属性时，建议IEEE 802工作组阅读并遵循“RADIUS设计指南”[BCP158]和“协议扩展”[RFC6929]中的建议。"
    },
    {
      "indent": 3,
      "text": "\"Diameter Applications Design Guidelines\" [DADG] explains and clarifies the rules to extend the Diameter base protocol [RFC6733]. Extending Diameter can mean either the definition of a completely new Diameter application or the reuse of commands, Attribute-Value Pairs (AVPs), and AVP values in any combination for the purpose of inheriting the features of an existing Diameter application. The recommendation for reusing existing applications as much as possible is meaningful as most of the requirements defined for a new application are likely already fulfilled by existing applications. It is recommended that IEEE 802 Working Groups read and follow the recommendations in [DADG] when defining and reviewing new extensions and attributes.",
      "zh-CHS": "“Diameter应用程序设计指南”[DADG]解释并澄清了扩展Diameter基本协议[RFC6733]的规则。扩展Diameter可能意味着定义全新的Diameter应用程序，也可能意味着以任意组合重用命令、属性值对（AVP）和AVP值，以继承现有Diameter应用程序的功能。尽可能重用现有应用程序的建议是有意义的，因为为新应用程序定义的大多数需求可能已经由现有应用程序实现。在定义和审查新的扩展和属性时，建议IEEE 802工作组阅读并遵循[DADG]中的建议。"
    },
    {
      "indent": 0,
      "text": "A.3. EAP Review",
      "section_title": true,
      "zh-CHS": "A.3. EAP审查"
    },
    {
      "indent": 3,
      "text": "The Extensible Authentication Protocol (EAP), defined in [RFC3748], provides a framework within which authentication mechanisms, known as methods, can be defined. In addition to supporting authentication, EAP also provides for key derivation as described in [RFC5247]. State machines for EAP are described in [RFC4137].",
      "zh-CHS": "[RFC3748]中定义的可扩展身份验证协议（EAP）提供了一个框架，在该框架内可以定义称为方法的身份验证机制。除了支持身份验证外，EAP还提供[RFC5247]中所述的密钥派生。[RFC4137]中描述了EAP的状态机。"
    },
    {
      "indent": 3,
      "text": "As noted in [BCP132] and [RFC5247], security issues can arise in integration of EAP within lower layers. Therefore, it is recommended that IEEE 802 WGs looking to incorporate support for EAP send a liaison request to the IETF, requesting assistance in carrying out a security review. As an example, a security review of IEEE 802.16 was carried out by the EAP WG, at the request of IEEE 802.16 [IEEE-802.16-Liaison1] [IEEE-802.16-Liaison2]. Where development of new EAP authentication methods is sufficient, an Internet-Draft can be submitted and review can be requested from WGs such as the EAP Method Update (EMU) WG.",
      "zh-CHS": "如[BCP132]和[RFC5247]所述，在较低层中集成EAP时可能会出现安全问题。因此，建议希望纳入EAP支持的IEEE 802 WGs向IETF发送联络请求，请求协助进行安全审查。例如，EAP工作组应IEEE 802.16[IEEE-802.16-contraction1][IEEE-802.16-contraction2]的要求，对IEEE 802.16进行了安全审查。如果开发新的EAP认证方法已经足够，则可以提交互联网草案，并可以请求工作组（如EAP方法更新（EMU）工作组）进行审查。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Pointers to Additional Information",
      "section_title": true,
      "zh-CHS": "附录B.指向其他信息的指针"
    },
    {
      "indent": 3,
      "text": "This section provides pointers to additional useful information for participants in IEEE 802 and IETF.",
      "zh-CHS": "本节为IEEE 802和IETF的参与者提供指向其他有用信息的指针。"
    },
    {
      "indent": 0,
      "text": "B.1. IEEE 802 Information",
      "section_title": true,
      "zh-CHS": "B.1. IEEE 802信息"
    },
    {
      "indent": 3,
      "text": "IEEE 802 Home Page: <http://ieee802.org/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IEEE 802 policies and procedures:\n<http://ieee802.org/devdocs.shtml>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The IEEE 802 WG and TAG main page URLs follow this convention: They have the one- or two-digit numerical designation for the WG or TAG appended after <http://ieee802.org/>. For example the IEEE 802.1 main web page is at <http://ieee802.org/1>, while the IEEE 802.11 main web page is at <http://ieee802.org/11>.",
      "zh-CHS": "IEEE 802 WG和标记主页URL遵循此约定：它们具有一位或两位数字的数字名称，用于附加在其后面的WG或标记<http://ieee802.org/>. 例如，IEEE 802.1主网页位于<http://ieee802.org/1>，而IEEE 802.11主网页位于<http://ieee802.org/11>."
    },
    {
      "indent": 0,
      "text": "B.2. IETF Information",
      "section_title": true,
      "zh-CHS": "B.2. IETF信息"
    },
    {
      "indent": 3,
      "text": "Information on IETF procedures may be found in the documents in the informative references and at the URLs below.",
      "zh-CHS": "有关IETF程序的信息可在参考资料中的文件和以下URL中找到。"
    },
    {
      "indent": 3,
      "text": "Note: RFCs do not change after they are published. Rather, they are either obsoleted or updated by other RFCs. Such updates are tracked in the rfc-index.txt file.",
      "zh-CHS": "注：RFC在发布后不会更改。相反，它们被其他RFC淘汰或更新。此类更新在rfc-index.txt文件中进行跟踪。"
    },
    {
      "indent": 3,
      "text": "Current list and status of all RFCs:\n<http://www.rfc-editor.org/rfc-index.html>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Current list and description of all IETF Internet-Drafts:\n<ftp://ftp.ietf.org/internet-drafts/1id-abstracts.txt>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Current list of IETF Working Groups and their Charters: <http://datatracker.ietf.org/wg/> (includes Area Directors and chair contacts, mailing list information, etc.)",
      "zh-CHS": "IETF工作组及其章程的当前列表：<http://datatracker.ietf.org/wg/>（包括区域主管和主席联系人、邮件列表信息等）"
    },
    {
      "indent": 3,
      "text": "Current list of requested BOFs:\n<http://trac.tools.ietf.org/bof/trac/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "RFC Editor pages about publishing RFCs: <http://www.rfc-editor.org> (including available tools and guidance) <http://www.rfc-editor.org/pubprocess.html> is particularly helpful.",
      "zh-CHS": "关于发布RFC的RFC编辑器页面：<http://www.rfc-editor.org>（包括可用的工具和指南）<http://www.rfc-editor.org/pubprocess.html>这特别有帮助。"
    },
    {
      "indent": 3,
      "text": "Current list of liaison statements:\n<https://datatracker.ietf.org/liaison/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IETF Intellectual Property Rights Policy and Notices:\n<http://www.ietf.org/ipr/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The Tao of the IETF: <http://www.ietf.org/tao.html> (A Novice's Guide\nto the Internet Engineering Task Force)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Spencer Dawkins Huawei Technologies 1547 Rivercrest Blvd. Allen, TX 75002 USA",
      "zh-CHS": "斯宾塞·道金斯华为技术有限公司Rivercrest大道1547号。美国德克萨斯州艾伦75002"
    },
    {
      "indent": 3,
      "text": "EMail: spencerdawkins.ietf@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Patricia Thaler Broadcom Corporation 5025 Keane Drive Carmichael, CA 95608 USA",
      "zh-CHS": "Patricia Thaler Broadcom Corporation美国加利福尼亚州卡迈克尔基恩大道5025号，邮编95608"
    },
    {
      "indent": 3,
      "text": "EMail: pthaler@broadcom.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dan Romascanu AVAYA Park Atidim, Bldg. #3 Tel Aviv 61581 Israel",
      "zh-CHS": "Dan Romascanu AVAYA Park Atidim，以色列特拉维夫3号楼61581"
    },
    {
      "indent": 3,
      "text": "EMail: dromasca@avaya.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Bernard Aboba (editor) Microsoft Corporation One Microsoft Way Redmond, WA 98052 USA",
      "zh-CHS": "Bernard Aboba（编辑）微软公司美国华盛顿州雷德蒙微软大道一号，邮编：98052"
    },
    {
      "indent": 3,
      "text": "EMail: bernard_aboba@hotmail.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}