{
  "title": {
    "text": "RFC 7763: The text/markdown Media Type",
    "zh-CHS": "RFC 7763"
  },
  "number": 7763,
  "created_at": "2021-10-31 19:23:01.357958+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        S. Leonard\nRequest for Comments: 7763                                 Penango, Inc.\nCategory: Informational                                       March 2016\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "The text/markdown Media Type",
      "zh-CHS": "文本/标记媒体类型"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document registers the text/markdown media type for use with Markdown, a family of plain-text formatting syntaxes that optionally can be converted to formal markup languages such as HTML.",
      "zh-CHS": "本文档注册文本/标记媒体类型，以便与标记一起使用，标记是一系列纯文本格式语法，可以选择将其转换为HTML等正式标记语言。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7763.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc7763."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction  . . . . . . . . . . . . . . . . . . . . . . . . .  2\n  1.1. This Is Markdown! Or: Markup and Its Discontents  . . . . .  2\n  1.2. Markdown Is About Writing and Editing . . . . . . . . . . .  3\n  1.3. Definitions . . . . . . . . . . . . . . . . . . . . . . . .  5\n2. Markdown Media Type Registration Application  . . . . . . . . .  5\n3. Fragment Identifiers  . . . . . . . . . . . . . . . . . . . . .  8\n  3.1. Parameters  . . . . . . . . . . . . . . . . . . . . . . . .  8\n4.  Content Disposition and preview-type . . . . . . . . . . . . .  9\n5.  Example  . . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 10\n  6.1. Markdown Variants . . . . . . . . . . . . . . . . . . . . . 10\n7. Security Considerations . . . . . . . . . . . . . . . . . . . . 13\n8. References  . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n  8.1. Normative References  . . . . . . . . . . . . . . . . . . . 13\n  8.2. Informative References  . . . . . . . . . . . . . . . . . . 14\nAuthor's Address . . . . . . . . . . . . . . . . . . . . . . . . . 15",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 0,
      "text": "1.1. This Is Markdown! Or: Markup and Its Discontents",
      "section_title": true,
      "zh-CHS": "1.1. 这是降价！或者：加价及其不满"
    },
    {
      "indent": 3,
      "text": "In computer systems, textual data is stored and processed using a continuum of techniques. On the one end is plain text: computer-encoded text that consists only of a sequence of code points from a given standard, with no other formatting or structural information [UNICODE]. (On the other end is binary data, which computer systems store and process with bit-for-bit accuracy.) Many of these standards include control characters that are used as in-band signaling to cause effects other than the addition of a symbol (or grapheme) to the text.",
      "zh-CHS": "在计算机系统中，文本数据是使用一系列技术存储和处理的。一端是纯文本：计算机编码的文本，仅由给定标准的一系列代码点组成，没有其他格式或结构信息[UNICODE]。（另一端是二进制数据，计算机系统以逐位精度存储和处理这些数据。）这些标准中的许多标准包括控制字符，这些字符用作带内信号，以产生除在文本中添加符号（或图形）以外的效果。"
    },
    {
      "indent": 3,
      "text": "Markup offers an alternative means to encode this signaling information by overloading certain graphic characters (see, e.g., [ISO646]) with additional meanings. Therefore, markup languages allow for annotating a document in a syntactically distinguishable way from the text, while keeping the annotations printable. Markup languages are (reasonably) well-specified and tend to follow (mostly) standardized syntax rules. Examples of formal markup languages include Standard Generalized Markup Language (SGML), HTML, XML, and LaTeX. Standardized rules lead to interoperability between markup processors, but they impose skill requirements on new users that lead to markup languages becoming less accessible to beginners. These rules also reify \"validity\": content that does not conform to the rules is treated differently (i.e., is rejected) than content that conforms.",
      "zh-CHS": "标记提供了另一种方法，通过使用附加含义重载某些图形字符（例如[ISO646]），对该信令信息进行编码。因此，标记语言允许以语法上与文本不同的方式对文档进行注释，同时保持注释的可打印性。标记语言（合理地）被很好地指定，并且倾向于遵循（大部分）标准化的语法规则。正式标记语言的示例包括标准通用标记语言（SGML）、HTML、XML和LaTeX。标准化规则导致了标记处理器之间的互操作性，但它们对新用户提出了技能要求，这导致标记语言变得越来越难被初学者使用。这些规则还具体化了“有效性”：不符合规则的内容与符合规则的内容区别对待（即被拒绝）。"
    },
    {
      "indent": 3,
      "text": "In contrast to formal markup languages, lightweight markup languages use simple syntaxes; they are designed to be easy for humans to enter and understand with basic text editors. Markdown, the subject of this document, began as an /informal/ plain-text formatting syntax [MDSYNTAX] and Perl script HTML/XHTML processor [MARKDOWN] targeted at non-technical users using unspecialized tools, such as plain-text email clients. [MDSYNTAX] explicitly rejects the notion of validity: there is no such thing as \"invalid\" Markdown. If the Markdown content does not result in the \"right\" output (defined as output that the author wants, not output that adheres to some dictated system of rules), the expectation is that the author should continue experimenting by changing the content or the processor to achieve the desired output.",
      "zh-CHS": "与正式标记语言相比，轻量级标记语言使用简单的语法；它们被设计成便于人类使用基本文本编辑器进入和理解。Markdown是本文档的主题，最初是一种/非正式/纯文本格式语法[MDSYNTAX]和Perl脚本HTML/XHTML处理器[Markdown]，面向使用非专用工具（如纯文本电子邮件客户端）的非技术用户。[MDSYNTAX]明确拒绝有效性的概念：不存在“无效”的降价。如果降价内容没有产生“正确”的输出（定义为作者想要的输出，而不是遵守某些规定的规则系统的输出），那么期望是作者应该通过更改内容或处理器来继续试验，以获得所需的输出。"
    },
    {
      "indent": 3,
      "text": "Since its development in 2004 [MARKDOWN], a number of web- and Internet-facing applications have incorporated Markdown into their text-entry systems, frequently with custom extensions. Markdown has thus evolved into a kind of Internet meme [INETMEME] as different communities encounter it and adapt the syntax for their specific use cases. Markdown now represents a family of related plain-text formatting syntaxes and implementations that, while broadly compatible with humans [HUMANE], are intended to produce different kinds of outputs that push the boundaries of mutual intelligibility between software systems.",
      "zh-CHS": "自2004年开发[MARKDOWN]以来，许多面向web和Internet的应用程序已将MARKDOWN纳入其文本输入系统，通常带有自定义扩展。因此，Markdown已经演变成一种互联网模因[INETMEME]，因为不同的社区会遇到它，并根据其特定的用例调整语法。Markdown现在代表了一系列相关的纯文本格式语法和实现，这些语法和实现虽然与人类[人性化]广泛兼容，但旨在产生不同类型的输出，推动软件系统之间的相互可理解性边界。"
    },
    {
      "indent": 3,
      "text": "To support identifying and conveying Markdown, this document defines a media type and parameters that indicate the Markdown author's intent on how to interpret the content. This registration draws particular inspiration from text/troff [RFC4263], which is a plain-text formatting syntax for typesetting based on tools from the 1960s (\"RUNOFF\") and 1970s (\"nroff\", et al.). In that sense, Markdown is a kind of troff for modern computing. A companion document [RFC7764] provides additional Markdown background, philosophy, local storage strategies, and variant registrations (including examples).",
      "zh-CHS": "为了支持识别和传达标记，本文档定义了媒体类型和参数，以指示标记作者如何解释内容的意图。这种注册特别受到text/troff[RFC4263]的启发，这是一种基于1960年代（“径流”）和1970年代（“nroff”，等）工具的纯文本格式排版语法。从这个意义上说，降价是对现代计算的一种践踏。附带文档[RFC7764]提供了额外的降价背景、原理、本地存储策略和变体注册（包括示例）。"
    },
    {
      "indent": 0,
      "text": "1.2. Markdown Is About Writing and Editing",
      "section_title": true,
      "zh-CHS": "1.2. Markdown是关于写作和编辑的"
    },
    {
      "indent": 5,
      "text": "\"HTML is a *publishing* format; Markdown is a *writing* format.\n Thus, Markdown's formatting syntax only addresses issues that can\n be conveyed in plain text.\" [MDSYNTAX]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The paradigmatic use case for text/markdown is the Markdown editor: an application that presents Markdown content (which looks like an email or other piece of plain-text writing) alongside a published format, so that an author can see results instantaneously and can tweak his or her input in real time. A significant number of Markdown editors have adopted \"split-screen view\" (or \"live preview\") technology that looks like Figure 1.",
      "zh-CHS": "文本/标记的典型用例是标记编辑器：一个应用程序，它将标记内容（看起来像电子邮件或其他纯文本书写）与已发布的格式一起显示，以便作者可以立即看到结果，并实时调整输入。相当多的降价编辑器采用了“分割屏幕视图”（或“实时预览”）技术，如图1所示。"
    },
    {
      "indent": 0,
      "text": "+----------------------------------------------------------------------+\n| File  Edit  (Cloud Stuff)  (Fork Me on GitHub)  Help                 |\n+----------------------------------------------------------------------+\n| [ such-and-such identifier ]                 [ useful statistics]    |\n+----------------------------------++----------------------------------+\n| (plain text, with                || (text/html, likely               |\n|  syntax highlighting)            ||  rendered to screen)             |\n|                                  ||                                  |\n|# Introduction                    ||<h1>Introduction</h1>             |\n|                                  ||                                  |\n|## Markdown Is About Writing and  /|<h2>Markdown Is About Writing and |\n/ Editing                          ||Editing</h2>                      |\n|                                  ||                                  |\n|> HTML is a *publishing* format;  ||<blockquote><p>HTML is a          |\n|> Markdown is a *writing* format. || <em>publishing</em> format;      |\n|> Thus, Markdown's formatting     || Markdown is a <em>writing</em>   |\n|> syntax only addresses issues    || format. Thus, Markdown's         |\n|> that can be conveyed in plain   <> formatting syntax only addresses |\n|> text. [MDSYNTAX][]              || issues that can be conveyed in   |\n|                                  || plain text. <a href=\"http://darin/\n|The paradigmatic use case for     |/gfireball.net/projects/markdown/sy/\n|`text/markdown` is the Markdown   |/ntax#html\" title=\"Markdown: Syntax/\n|editor: an application that       |/: HTML\">MDSYNTAX</a>              |\n|presents Markdown content         ||</p></blockquote>                 |\n|...                               ||                                  |\n|                                  ||<p>The paradigmatic use case for  |\n|[MDSYNTAX]: http://daringfireball./| <code>text/markdown</code> is the|\n/net/projects/markdown/syntax#html || Markdown editor: an application  |\n|\"Markdown: Syntax: HTML\"          || that presents Markdown content   |\n|                                  || ...</p>                          |\n+----------------------------------++----------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 1,
      "text": "LEGEND: \"/\" embedded in a vertical line represents a line-continuation marker, since a line break is not supposed to occur in that content.",
      "zh-CHS": "图例：嵌入在垂直线中的“/”表示一个换行标记，因为该内容中不应出现换行符。"
    },
    {
      "indent": 10,
      "text": "Figure 1: Markdown Split-Screen / Live Preview Editor",
      "zh-CHS": "图1：标记分割屏幕/实时预览编辑器"
    },
    {
      "indent": 3,
      "text": "To get the best results, implementations ought to produce and consume mutually intelligible and identifiable bits of Markdown. That way, users on diverse platforms can collaborate with their tools of choice. Those tools can be desktop-based (MarkdownPad, MultiMarkdown Composer); browser-based (Dillinger, Markable); integrated widgets (Discourse, GitHub); general-purpose editors (emacs, vi); or plain old \"Notepad\". Additionally, implementations ought to have common ways to identify particular areas of Markdown content when the Markdown becomes appreciably large (e.g., book chapters and Internet-Drafts -- not just blog posts). So that users have the option to use Markdown in MIME-capable systems to convey their works in progress,",
      "zh-CHS": "为了获得最好的结果，实现应该产生和使用相互理解和可识别的降价位。这样，不同平台上的用户就可以使用他们选择的工具进行协作。这些工具可以是基于桌面的（MarkdownPad、MultiMarkdown Composer）；基于浏览器（Dillinger，可标记）；集成小部件（话语、GitHub）；通用编辑（emacs，vi）；或者普通的旧“记事本”。此外，当降价变得相当大时（例如，书籍章节和互联网草稿，而不仅仅是博客文章），实现应该有通用的方法来识别降价内容的特定区域。因此，用户可以选择在支持MIME的系统中使用降价来传达他们正在进行的作品，"
    },
    {
      "indent": 3,
      "text": "not just their finished products (for which full-blown markups ranging from text/html to application/pdf are appropriate), implementations ought to label such Markdown content with a common media type: text/markdown. This registration facilitates interoperability between these Markdown editors by conveying the syntax of the particular Markdown variant and the desired output format.",
      "zh-CHS": "not just their finished products (for which full-blown markups ranging from text/html to application/pdf are appropriate), implementations ought to label such Markdown content with a common media type: text/markdown. This registration facilitates interoperability between these Markdown editors by conveying the syntax of the particular Markdown variant and the desired output format.translate error, please retry"
    },
    {
      "indent": 0,
      "text": "1.3. Definitions",
      "section_title": true,
      "zh-CHS": "1.3. 定义"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "Since Markdown signifies a family of related formats with varying degrees of formal documentation and implementation, this specification uses the term \"variant\" to identify such formats.",
      "zh-CHS": "由于标记表示一系列具有不同程度的正式文档和实现的相关格式，因此本规范使用术语“变体”来标识此类格式。"
    },
    {
      "indent": 0,
      "text": "2. Markdown Media Type Registration Application",
      "section_title": true,
      "zh-CHS": "2. 减价媒体类型注册应用程序"
    },
    {
      "indent": 3,
      "text": "This section provides the media type registration application for the text/markdown media type (see Section 5.6 of [RFC6838]).",
      "zh-CHS": "本节提供文本/标记媒体类型的媒体类型注册应用程序（见[RFC6838]第5.6节）。"
    },
    {
      "indent": 3,
      "text": "Type name: text",
      "zh-CHS": "类型名称：text"
    },
    {
      "indent": 3,
      "text": "Subtype name: markdown",
      "zh-CHS": "子类型名称：标记"
    },
    {
      "indent": 3,
      "text": "Required parameters:",
      "zh-CHS": "所需参数："
    },
    {
      "indent": 6,
      "text": "charset: Per Section 4.2.1 of [RFC6838], charset is REQUIRED. There is no default value because neither [MDSYNTAX] nor many popular implementations at the time of this registration do either. [MDSYNTAX] clearly describes Markdown as a \"writing format\"; its syntax rules operate on characters (specifically, on punctuation) rather than code points. Many Markdown processors will get along just fine by operating on characters in the US-ASCII repertoire (specifically punctuation), blissfully oblivious to other characters or codes.",
      "zh-CHS": "字符集：根据[RFC6838]第4.2.1节，需要字符集。没有默认值，因为[MDSYNTAX]和注册时的许多流行实现都没有默认值。[MDSYNTAX]清楚地将降价描述为一种“书写格式”；它的语法规则对字符（特别是标点符号）而不是代码点进行操作。许多降价处理器通过对US-ASCII指令表中的字符（特别是标点符号）进行操作，可以很好地处理，而不必理会其他字符或代码。"
    },
    {
      "indent": 3,
      "text": "Optional parameters:",
      "zh-CHS": "可选参数："
    },
    {
      "indent": 6,
      "text": "variant: An optional identifier of the specific Markdown variant that the author intended. The value serves as a \"hint\" to the recipient, meaning that the recipient MAY interpret the Markdown as that variant, but is under no obligation to do so. When omitted, there is no hint; the interpretation is entirely up to the receiver and context. This identifier is plain US-ASCII and case-insensitive. To promote interoperability,",
      "zh-CHS": "变体：作者想要的特定标记变体的可选标识符。该值作为对接收者的“提示”，意味着接收者可以将降价解释为该变体，但没有义务这样做。省略时，没有提示；解释完全取决于接收者和上下文。此标识符为纯US-ASCII，不区分大小写。为了促进互操作性，"
    },
    {
      "indent": 9,
      "text": "identifiers can be registered in the registry defined in Section 6. If a receiver does not recognize the variant identifier, the receiver MAY present the identifier to a user to inform him or her of it.",
      "zh-CHS": "标识符可以在第6节定义的注册表中注册。如果接收者不识别变体标识符，则接收者可将标识符呈现给用户以通知他或她该标识符。"
    },
    {
      "indent": 9,
      "text": "Other parameters MAY be included with the media type. The variant SHOULD define the semantics of such other parameters. Additionally, the variant MAY be registered under another media type; this text/markdown registration does not preclude other registrations.",
      "zh-CHS": "介质类型中可能包含其他参数。变量应定义此类其他参数的语义。此外，变体可在另一媒体类型下注册；本文本/降价登记不排除其他登记。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "zh-CHS": "编码注意事项："
    },
    {
      "indent": 6,
      "text": "Markdown content is plain-text content; any octet sequence is valid as long as it conforms to the character codes of the charset parameter. See [RFC2046]. Markup characters in [MDSYNTAX] are limited to printable US-ASCII; however, other variants can define markup characters outside this range (including control characters such as NUL and characters encoded in multiple octets).",
      "zh-CHS": "标记内容是纯文本内容；只要符合charset参数的字符代码，任何八位字节序列都是有效的。见[RFC2046]。[MDSYNTAX]中的标记字符仅限于可打印的US-ASCII；但是，其他变体可以定义此范围之外的标记字符（包括控制字符，如NUL和编码为多个八位字节的字符）。"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "zh-CHS": "安全考虑："
    },
    {
      "indent": 6,
      "text": "Markdown interpreted as plain text is relatively harmless. A text editor need only display the text. The editor SHOULD take care to handle control characters appropriately and to limit the effect of the Markdown to the text-editing area itself; malicious Unicode-based Markdown could, for example, surreptitiously change the directionality of the text. An editor for normal text would already take these control characters into consideration, however.",
      "zh-CHS": "被解释为纯文本的标记相对无害。文本编辑器只需显示文本。编辑器应注意适当处理控制字符，并将标记的效果限制在文本编辑区域本身；例如，基于Unicode的恶意标记可能会秘密改变文本的方向性。然而，普通文本的编辑器已经考虑了这些控制字符。"
    },
    {
      "indent": 6,
      "text": "Markdown interpreted as a precursor to other formats, such as HTML, carries all of the security considerations as the target formats. For example, HTML can contain instructions to execute scripts, redirect the user to other web pages, download remote content, and upload personally identifiable information. Markdown also can contain islands of formal markup, such as HTML. These islands of formal markup may be passed as they are, transformed, or ignored (perhaps because the islands are conditional or incompatible) when the Markdown is processed. Since Markdown may have different interpretations depending on the tool and the environment, a better approach is to analyze (and sanitize or block) the output markup, rather than attempting to analyze the Markdown.",
      "zh-CHS": "Markdown被解释为其他格式（如HTML）的前身，它包含了作为目标格式的所有安全注意事项。例如，HTML可以包含执行脚本、将用户重定向到其他网页、下载远程内容和上载个人识别信息的指令。标记还可以包含形式化标记的孤岛，如HTML。在处理标记时，这些形式标记孤岛可以按原样传递、转换或忽略（可能是因为这些孤岛是有条件的或不兼容的）。由于标记可能有不同的解释，具体取决于工具和环境，因此更好的方法是分析（并清理或阻止）输出标记，而不是尝试分析标记。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "zh-CHS": "互操作性注意事项："
    },
    {
      "indent": 6,
      "text": "Markdown variations (some might say \"innovations\") are designed to be broadly compatible with humans (\"humane\"), but not necessarily with each other. Therefore, syntax in one Markdown derivative may be ignored or treated differently in another derivative. The overall effect is a general degradation of the output that increases with the quantity of variant-specific Markdown used in the text. When it is desirable to reflect the author's intent in the output, stick with the variant identified in the variant parameter, i.e., receivers SHOULD only accept Markdown variants that they explicitly know about, and senders SHOULD avoid use of variants that intended recipients are not known to understand.",
      "zh-CHS": "降价变体（有些人可能会说“创新”）旨在与人类广泛兼容（“人性化”），但不一定彼此兼容。因此，一个减价衍生工具中的语法可能会被忽略，或者在另一个衍生工具中以不同的方式处理。总体效果是输出的总体降级，随着文本中使用的变量特定标记数量的增加而增加。当需要在输出中反映作者的意图时，请坚持使用variant参数中标识的变量，即接收者应只接受他们明确知道的标记变量，发送者应避免使用预期接收者不了解的变量。"
    },
    {
      "indent": 3,
      "text": "Published specification: This specification; [MDSYNTAX].",
      "zh-CHS": "出版规范：本规范；[MDSYNTAX]。"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "zh-CHS": "使用此媒体类型的应用程序："
    },
    {
      "indent": 6,
      "text": "Markdown conversion tools, Markdown WYSIWYG (What You See is What You Get) editors, and plain-text editors and viewers; markup processor targets indirectly use Markdown (e.g., web browsers for Markdown converted to HTML).",
      "zh-CHS": "标记转换工具、标记所见即所得编辑器、纯文本编辑器和查看器；标记处理器目标间接使用标记（例如，将标记转换为HTML的web浏览器）。"
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations:",
      "zh-CHS": "片段标识符注意事项："
    },
    {
      "indent": 6,
      "text": "See Section 3.",
      "zh-CHS": "见第3节。"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "zh-CHS": "其他信息："
    },
    {
      "indent": 6,
      "text": "Magic number(s): None File extension(s): .md, .markdown Macintosh file type code(s): TEXT. A uniform type identifier (UTI) of \"net.daringfireball.markdown\", which conforms to \"public.plain-text\", is RECOMMENDED [MDUTI]. See [RFC7764] for other considerations.",
      "zh-CHS": "幻数：无文件扩展名：.md、.markdown Macintosh文件类型代码：文本。建议使用符合“public.plain text”的“net.daringfireball.markdown”统一类型标识符（UTI）[MDUTI]。有关其他注意事项，请参见[RFC7764]。"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "zh-CHS": "联系人和电子邮件地址，以获取更多信息："
    },
    {
      "indent": 6,
      "text": "Sean Leonard <dev+ietf@seantek.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: None.",
      "zh-CHS": "使用限制：无。"
    },
    {
      "indent": 3,
      "text": "Author/Change controller: Sean Leonard <dev+ietf@seantek.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Provisional registration? No",
      "zh-CHS": "临时登记？不"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD record the value of the variant parameter (and other parameters if defined by the variant) along with the Markdown content when the content leaves the domain of formats that are Internet media type capable. Strategies for doing so are discussed in [RFC7764].",
      "zh-CHS": "当内容离开支持Internet媒体类型的格式域时，实现应记录变量参数（以及其他参数（如果由变量定义））的值以及标记内容。[RFC7764]中讨论了这样做的策略。"
    },
    {
      "indent": 3,
      "text": "The Content-Disposition header (particularly the preview-type parameter) can be used with Markdown content. See Section 4.",
      "zh-CHS": "内容处置标题（尤其是预览类型参数）可用于标记内容。见第4节。"
    },
    {
      "indent": 0,
      "text": "3. Fragment Identifiers",
      "section_title": true,
      "zh-CHS": "3. 片段标识符"
    },
    {
      "indent": 3,
      "text": "[MARKDOWN] does not define any fragment identifiers, but some variants do, and many types of Markdown processor output (e.g., HTML or PDF) will have well-defined fragment identifiers. Which fragment identifiers are available for a given document are variant-defined.",
      "zh-CHS": "[MARKDOWN]未定义任何片段标识符，但某些变体定义了，并且许多类型的MARKDOWN处理器输出（例如HTML或PDF）将具有定义良好的片段标识符。对于给定文档，哪些片段标识符可用是变量定义的。"
    },
    {
      "indent": 3,
      "text": "When encoded in a URI, characters that are outside of the fragment production of [RFC3986] are percent-encoded. The default encoding (character set) of percent-encoded octets in URIs is the same as the Markdown content, which is identified by the charset parameter or by other contextual means. Fragment identifiers SHOULD be considered case-sensitive, which maintains consistency with HTML. Variants MAY override the guidance in this paragraph.",
      "zh-CHS": "在URI中编码时，[RFC3986]的片段生成之外的字符按百分比编码。URI中百分比编码八位字节的默认编码（字符集）与标记内容相同，标记内容由charset参数或其他上下文方式标识。片段标识符应视为区分大小写，以保持与HTML的一致性。变体可能会覆盖本段中的指南。"
    },
    {
      "indent": 3,
      "text": "At least the first equals sign \"=\" SHOULD be percent-encoded to prevent ambiguity as described in the following section.",
      "zh-CHS": "应至少对第一个等号“=”进行百分比编码，以防止歧义，如下节所述。"
    },
    {
      "indent": 0,
      "text": "3.1. Parameters",
      "section_title": true,
      "zh-CHS": "3.1. 参数"
    },
    {
      "indent": 3,
      "text": "Similar to application/pdf [RFC3778] and text/plain [RFC5147], this registration permits a parameter syntax for fragment identifiers. The syntax is a parameter name, the equals sign \"=\" (which MUST NOT be percent-encoded), and a parameter value. To the extent that multiple parameters can appear in a fragment production, the parameters SHALL be separated by the ampersand \"&\" (which MUST NOT be percent-encoded).",
      "zh-CHS": "与application/pdf[RFC3778]和text/plain[RFC5147]类似，此注册允许片段标识符的参数语法。语法是一个参数名、等号“=”（不能进行百分比编码）和一个参数值。在碎片生成中可能出现多个参数的情况下，应使用符号“&”（不得进行百分比编码）分隔参数。"
    },
    {
      "indent": 3,
      "text": "The only parameter defined in this registration is \"line\", which has the same meaning as in [RFC5147], i.e., counting is zero-based. For example: \"#line=10\" identifies the eleventh line of Markdown input. Implementers should take heed that different environments and character sets may have a wide range of code sequences to divide lines.",
      "zh-CHS": "此注册中定义的唯一参数是“line”，其含义与[RFC5147]中的相同，即计数是基于零的。例如：“line=10”标识降价输入的第十一行。实现者应该注意，不同的环境和字符集可能有广泛的代码序列来划分行。"
    },
    {
      "indent": 3,
      "text": "Markdown variants are free to define additional parameters.",
      "zh-CHS": "标记变量可以自由定义其他参数。"
    },
    {
      "indent": 0,
      "text": "4. Content Disposition and preview-type",
      "section_title": true,
      "zh-CHS": "4. 内容配置和预览类型"
    },
    {
      "indent": 3,
      "text": "The Content-Disposition header [RFC2183] conveys presentational information about a MIME entity, using a type and set of parameters. The parameter preview-type is defined here for Markdown content.",
      "zh-CHS": "内容处置头[RFC2183]使用一种类型和一组参数传递有关MIME实体的表示信息。此处为标记内容定义了参数预览类型。"
    },
    {
      "indent": 3,
      "text": "When present, preview-type indicates the Internet media type (and parameters) of the preview output desired from the processor by the author. With reference to the \"paradigmatic use case\" (i.e., collaborative Markdown editing) in Section 1.3, the preview-type parameter primarily affects the \"right-hand\" side of a Markdown editor. There is no default value: when absent, a Markdown user agent can render or display whatever it wants.",
      "zh-CHS": "如果存在预览类型，则表示作者希望从处理器获得的预览输出的Internet媒体类型（和参数）。参考第1.3节中的“范例用例”（即协作标记编辑），预览类型参数主要影响标记编辑器的“右侧”。没有默认值：当不存在时，降价用户代理可以呈现或显示它想要的任何内容。"
    },
    {
      "indent": 3,
      "text": "The value of this parameter is an Internet media type with optional parameters. The syntax (including case-sensitivity considerations) is the same as specified in [RFC2045] for the Content-Type header (with updates over time, e.g., [RFC2231] and [RFC6532]).",
      "zh-CHS": "此参数的值是具有可选参数的Internet媒体类型。语法（包括区分大小写的注意事项）与[RFC2045]中为内容类型标头指定的语法相同（随时间而更新，例如[RFC2231]和[RFC6532]）。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD anticipate and support HTML (text/html) and XHTML (application/xhtml+xml) output, to the extent that a syntax targets those markup languages. These types ought to be suitable for the majority of current purposes. However, Markdown is increasingly becoming integral to workflows where HTML is not the target output; examples range from TeX, to PDF, to Outline Processor Markup Language (OPML), and even to entire e-books (e.g., [PANDOC]).",
      "zh-CHS": "实现应该预期并支持HTML（文本/HTML）和XHTML（应用程序/XHTML+xml）输出，只要语法以这些标记语言为目标。这些类型应该适合当前的大多数用途。然而，在HTML不是目标输出的工作流中，降价越来越成为不可或缺的一部分；示例范围从TeX到PDF，从大纲处理器标记语言（OPML），甚至到整个电子书（如[PANDOC]）。"
    },
    {
      "indent": 3,
      "text": "The reflexive media type text/markdown in this parameter value means that the author does not want to invoke Markdown processing at all: the receiver SHOULD present the Markdown source as is.",
      "zh-CHS": "此参数值中的自反媒体类型text/markdown表示作者根本不想调用markdown处理：接收者应按原样呈现markdown源。"
    },
    {
      "indent": 3,
      "text": "The preview-type parameter can be used for other types of content, but the precise semantics are not defined here.",
      "zh-CHS": "preview type参数可用于其他类型的内容，但此处未定义精确的语义。"
    },
    {
      "indent": 0,
      "text": "5. Example",
      "section_title": true,
      "zh-CHS": "5. 实例"
    },
    {
      "indent": 3,
      "text": "The following is an example of Markdown as an email attachment:",
      "zh-CHS": "以下是作为电子邮件附件的降价示例："
    },
    {
      "indent": 4,
      "text": "MIME-Version: 1.0\nContent-Type: text/markdown; charset=UTF-8; variant=Original\nContent-Disposition: attachment; filename=readme.md;\n preview-type=\"application/xhtml+xml\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "Sample HTML 4 Markdown\n=============",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "This is some sample Markdown. [Hooray!][foo] (Remember that link identifiers are not case-sensitive.)",
      "zh-CHS": "这是一些降价样品。[万岁！][foo]（请记住链接标识符不区分大小写。）"
    },
    {
      "indent": 4,
      "text": "Bulleted Lists\n-------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "Here are some bulleted lists...",
      "zh-CHS": "下面是一些项目符号列表。。。"
    },
    {
      "indent": 4,
      "text": "* One Potato * Two Potato * Three Potato",
      "zh-CHS": "* 一个土豆*两个土豆*三个土豆"
    },
    {
      "indent": 4,
      "text": "- One Tomato - Two Tomato - Three Tomato",
      "zh-CHS": "- 一个西红柿-两个西红柿-三个西红柿"
    },
    {
      "indent": 4,
      "text": "More Information\n-----------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "[.markdown, .md](http://daringfireball.net/projects/markdown/) has more information.",
      "zh-CHS": "[.markdown，.md](http://daringfireball.net/projects/markdown/)有更多的信息。"
    },
    {
      "indent": 4,
      "text": "[fOo]: http://example.com/loc 'Will Not Work with Markdown.pl-1.0.1'",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has registered the media type text/markdown using the application provided in Section 2 of this document.",
      "zh-CHS": "IANA已使用本文件第2节中提供的应用程序注册了媒体类型文本/标记。"
    },
    {
      "indent": 3,
      "text": "IANA has registered preview-type in the \"Content Disposition Parameters\" subregistry of the \"Content Disposition Values and Parameters\" registry, with the following description: \"Internet media type (and parameters) of the preview output desired from a processor by the author of the MIME content\".",
      "zh-CHS": "IANA已在“内容配置值和参数”注册表的“内容配置参数”子域中注册了预览类型，描述如下：“MIME内容作者希望从处理器获得的预览输出的Internet媒体类型（和参数）”。"
    },
    {
      "indent": 0,
      "text": "6.1. Markdown Variants",
      "section_title": true,
      "zh-CHS": "6.1. 降价变体"
    },
    {
      "indent": 3,
      "text": "IANA has established a registry called \"Markdown Variants\". While the registry has been created in the context of the text/markdown media type, the registry is intended for broad community use, so protocols and systems that do not rely on Internet media types can still tag Markdown content with a common variant identifier. Each entry in this registry shall consist of basic information about the variant:",
      "zh-CHS": "IANA建立了一个名为“降价变体”的注册中心。虽然注册表是在文本/标记媒体类型的上下文中创建的，但注册表旨在广泛用于社区，因此不依赖Internet媒体类型的协议和系统仍然可以使用通用变体标识符标记标记内容。本登记册中的每个条目应包括有关变体的基本信息："
    },
    {
      "indent": 3,
      "text": "Identifier: unique identifier for the variant Name: the commonly known name of the variant Description: a prose description of the variant, including how it differs from other variants such as Original Additional Parameters*: additional Content-Type parameters Fragment Identifiers*: additional fragment identifier syntaxes and semantics References: URIs or other references to documentation Contact Information: whom to contact (email, URI, phone, address, etc.) Expiration Date^: when this provisional registration expires",
      "zh-CHS": "标识符：变量名称的唯一标识符：变量描述的通用名称：变量的散文式描述，包括它与其他变体（如原始附加参数）的区别*：附加内容类型参数片段标识符*：附加片段标识符语法和语义引用：URI或对文档的其他引用联系信息：联系谁（电子邮件、URI、电话、地址等）到期日期^：此临时注册到期时"
    },
    {
      "indent": 3,
      "text": "* (optional) ^ (if provisional)",
      "zh-CHS": "* （可选）^（如果是临时的）"
    },
    {
      "indent": 3,
      "text": "While the variant parameter is \"plain US-ASCII\" (see registration template), the Identifier field (and by implication, all registered identifiers) SHALL conform to the ABNF [RFC5234]:",
      "zh-CHS": "当变量参数为“普通US-ASCII”（参见注册模板）时，标识符字段（以及暗示的所有注册标识符）应符合ABNF[RFC5234]："
    },
    {
      "indent": 6,
      "text": "ALPHA [*VCHAR (ALPHA / DIGIT)]",
      "zh-CHS": "ALPHA[*VCHAR（ALPHA/位）]"
    },
    {
      "indent": 3,
      "text": "For style and compatibility reasons, the Identifier field SHOULD conform to the ABNF:",
      "zh-CHS": "出于样式和兼容性原因，标识符字段应符合ABNF："
    },
    {
      "indent": 6,
      "text": "ALPHA *( [\"-\" / \".\" / \"_\" / \"~\"] 1*(ALPHA / DIGIT) )",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "That is, the identifier MUST start with a letter and MAY contain punctuation in the middle, but not at the end: the last character MUST be alphanumeric. The second production uses the same characters as the \"unreserved\" rule of [RFC3986] and is designed to be compatible with characters in other identification systems, e.g., filenames. Since the identifier MAY be displayed to a user -- particularly in cases where the receiver does not recognize the identifier -- the identifier SHOULD be rationally related to the vernacular name of the variant.",
      "zh-CHS": "也就是说，标识符必须以字母开头，并且可以在中间包含标点符号，但不是在结尾处：最后一个字符必须是字母数字。第二个产品使用与[RFC3986]的“无保留”规则相同的字符，并设计为与其他标识系统中的字符兼容，例如文件名。由于标识符可能会显示给用户——特别是在接收者不识别标识符的情况下——标识符应该合理地与变体的本地名称相关。"
    },
    {
      "indent": 3,
      "text": "The Name, Description, Additional Parameters, Fragment Identifiers, References, and Contact Information fields SHALL be in a Unicode character set (e.g., UTF-8).",
      "zh-CHS": "名称、描述、附加参数、片段标识符、引用和联系信息字段应采用Unicode字符集（例如UTF-8）。"
    },
    {
      "indent": 3,
      "text": "The registry includes the registration in Section 6.1.4 (Original Markdown). [RFC7764] includes additional registrations.",
      "zh-CHS": "注册包括第6.1.4节（原始降价）中的注册。[RFC7764]包括其他注册。"
    },
    {
      "indent": 0,
      "text": "6.1.1. Reserved Identifiers",
      "section_title": true,
      "zh-CHS": "6.1.1. 保留标识符"
    },
    {
      "indent": 3,
      "text": "The registry has the following identifiers RESERVED, as they have engendered some controversy in the Markdown community. No one is allowed to register them (or any case variations of them). These identifiers are not and cannot be registered: Standard Common Markdown",
      "zh-CHS": "注册表保留了以下标识符，因为它们在降价社区中引起了一些争议。任何人都不允许注册它们（或它们的任何变体）。这些标识符未注册且无法注册：标准通用标记"
    },
    {
      "indent": 3,
      "text": "The registry includes the following text in the note field: The variant names Standard, Common, and Markdown are reserved and cannot be registered.",
      "zh-CHS": "注册表在备注字段中包含以下文本：变量名称标准、通用和标记是保留的，无法注册。"
    },
    {
      "indent": 0,
      "text": "6.1.2. Standard of Review",
      "section_title": true,
      "zh-CHS": "6.1.2. 审查标准"
    },
    {
      "indent": 3,
      "text": "Registrations are made on a First Come, First Served [RFC5226] basis by anyone with a need to interoperate. While documentation is required, any level of documentation is sufficient; thus, neither Specification Required nor Expert Review are warranted. The checks prescribed by this section can be performed automatically.",
      "zh-CHS": "任何需要互操作的人都可以在先到先得[RFC5226]的基础上进行注册。虽然需要文件，但任何级别的文件都已足够；因此，既不需要规范，也不需要专家审查。本节规定的检查可自动执行。"
    },
    {
      "indent": 3,
      "text": "All references (including contact information) MUST be verified as functional at the time of the registration.",
      "zh-CHS": "所有参考资料（包括联系信息）必须在注册时验证其功能。"
    },
    {
      "indent": 3,
      "text": "As a special \"escape valve\", registrations can be updated with IETF Review [RFC5226]. All fields may be updated except the variant identifier, which is permanent: not even case may be changed.",
      "zh-CHS": "作为一种特殊的“安全阀”，注册可通过IETF审查[RFC5226]进行更新。所有字段都可以更新，但变量标识符除外，它是永久性的：即使大小写也不能更改。"
    },
    {
      "indent": 0,
      "text": "6.1.3. Provisional Registration",
      "section_title": true,
      "zh-CHS": "6.1.3. 临时注册"
    },
    {
      "indent": 3,
      "text": "Any registrant may make a provisional registration to reserve a variant identifier. Only the variant identifier and contact information fields are required; the rest are optional. Provisional registrations expire after three months, after which time the variant identifier may be reused. To make a registration permanent, a registrant simply needs to complete a permanent registration with the same identifier as the provisional registration.",
      "zh-CHS": "任何注册人均可进行临时注册，以保留变体标识符。仅需要变量标识符和联系人信息字段；其余的是可选的。临时注册在三个月后到期，在此之后，变体标识符可以重新使用。要使注册成为永久注册，注册人只需使用与临时注册相同的标识符完成永久注册。"
    },
    {
      "indent": 0,
      "text": "6.1.4. Original Markdown",
      "section_title": true,
      "zh-CHS": "6.1.4. 原始降价"
    },
    {
      "indent": 3,
      "text": "The registry includes this initial variant. A conforming implementation that processes the variant parameter MUST recognize this variant (although the processing behavior is not defined here).",
      "zh-CHS": "注册表包含此初始变量。处理变量参数的一致性实现必须识别该变量（尽管此处未定义处理行为）。"
    },
    {
      "indent": 3,
      "text": "Identifier: Original",
      "zh-CHS": "识别码：原件"
    },
    {
      "indent": 3,
      "text": "Name: Markdown",
      "zh-CHS": "名称：降价"
    },
    {
      "indent": 3,
      "text": "Description: Gruber's original Markdown syntax.",
      "zh-CHS": "描述：格鲁伯最初的降价语法。"
    },
    {
      "indent": 3,
      "text": "References: [MARKDOWN] [MDSYNTAX]",
      "zh-CHS": "参考文献：[降价][MDSYNTAX]"
    },
    {
      "indent": 3,
      "text": "Contact Information:\n   (individual) John Gruber <http://daringfireball.net/>\n                            <comments@daringfireball.net>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "See the Security considerations entry in Section 2.",
      "zh-CHS": "请参阅第2节中的“安全注意事项”条目。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[MARKDOWN] Gruber, J., \"Daring Fireball: Markdown\", December 2004, <http://daringfireball.net/projects/markdown/>.",
      "zh-CHS": "[MARKDOWN]Gruber，J.，“勇敢的火球：MARKDOWN”，2004年12月<http://daringfireball.net/projects/markdown/>."
    },
    {
      "indent": 3,
      "text": "[MDSYNTAX] Gruber, J., \"Daring Fireball: Markdown Syntax Documentation\", December 2004, <http://daringfireball.net/projects/markdown/syntax>.",
      "zh-CHS": "[MDSYNTAX]Gruber，J.，“大胆的火球：降价语法文档”，2004年12月<http://daringfireball.net/projects/markdown/syntax>."
    },
    {
      "indent": 3,
      "text": "[MDUTI] Gruber, J., \"Daring Fireball: Uniform Type Identifier for Markdown\", August 2011, <http://daringfireball.net/linked/2011/08/05/ markdown-uti>.",
      "zh-CHS": "[MDUTI]Gruber，J.，“大胆的火球：降价的统一类型标识符”，2011年8月<http://daringfireball.net/linked/2011/08/05/ markdown uti>。"
    },
    {
      "indent": 3,
      "text": "[RFC2045] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, DOI 10.17487/RFC2045, November 1996, <http://www.rfc-editor.org/info/rfc2045>.",
      "zh-CHS": "[RFC2045]Freed，N.和N.Borenstein，“多用途互联网邮件扩展（MIME）第一部分：互联网邮件正文格式”，RFC 2045，DOI 10.17487/RFC20451996年11月<http://www.rfc-editor.org/info/rfc2045>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC2183] Troost, R., Dorner, S., and K. Moore, Ed., \"Communicating Presentation Information in Internet Messages: The Content-Disposition Header Field\", RFC 2183, DOI 10.17487/RFC2183, August 1997, <http://www.rfc-editor.org/info/rfc2183>.",
      "zh-CHS": "[RFC2183]Troost，R.，Dorner，S.，和K.Moore，Ed.，“在互联网消息中传达呈现信息：内容处置标题字段”，RFC 2183，DOI 10.17487/RFC2183，1997年8月<http://www.rfc-editor.org/info/rfc2183>."
    },
    {
      "indent": 3,
      "text": "[RFC2231] Freed, N. and K. Moore, \"MIME Parameter Value and Encoded Word Extensions: Character Sets, Languages, and Continuations\", RFC 2231, DOI 10.17487/RFC2231, November 1997, <http://www.rfc-editor.org/info/rfc2231>.",
      "zh-CHS": "[RFC2231]Freed，N.和K.Moore，“MIME参数值和编码字扩展：字符集、语言和连续体”，RFC 2231，DOI 10.17487/RFC2231，1997年11月<http://www.rfc-editor.org/info/rfc2231>."
    },
    {
      "indent": 3,
      "text": "[RFC3778] Taft, E., Pravetz, J., Zilles, S., and L. Masinter, \"The application/pdf Media Type\", RFC 3778, DOI 10.17487/RFC3778, May 2004, <http://www.rfc-editor.org/info/rfc3778>.",
      "zh-CHS": "[RFC3778]Taft，E.，Pravetz，J.，Zilles，S.，和L.Masinter，“应用程序/pdf媒体类型”，RFC 3778，DOI 10.17487/RFC3778，2004年5月<http://www.rfc-editor.org/info/rfc3778>."
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <http://www.rfc-editor.org/info/rfc3986>.",
      "zh-CHS": "[RFC3986]Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，DOI 10.17487/RFC3986，2005年1月<http://www.rfc-editor.org/info/rfc3986>."
    },
    {
      "indent": 3,
      "text": "[RFC5147] Wilde, E. and M. Duerst, \"URI Fragment Identifiers for the text/plain Media Type\", RFC 5147, DOI 10.17487/RFC5147, April 2008, <http://www.rfc-editor.org/info/rfc5147>.",
      "zh-CHS": "[RFC5147]Wilde，E.和M.Duerst，“文本/普通媒体类型的URI片段标识符”，RFC 5147，DOI 10.17487/RFC5147，2008年4月<http://www.rfc-editor.org/info/rfc5147>."
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，DOI 10.17487/RFC5226，2008年5月<http://www.rfc-editor.org/info/rfc5226>."
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <http://www.rfc-editor.org/info/rfc5234>.",
      "zh-CHS": "[RFC5234]Crocker，D.，Ed.，和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，DOI 10.17487/RFC5234，2008年1月<http://www.rfc-editor.org/info/rfc5234>."
    },
    {
      "indent": 3,
      "text": "[RFC6532] Yang, A., Steele, S., and N. Freed, \"Internationalized Email Headers\", RFC 6532, DOI 10.17487/RFC6532, February 2012, <http://www.rfc-editor.org/info/rfc6532>.",
      "zh-CHS": "[RFC6532]Yang，A.，Steele，S.，和N.Freed，“国际化电子邮件头”，RFC 6532，DOI 10.17487/RFC6532，2012年2月<http://www.rfc-editor.org/info/rfc6532>."
    },
    {
      "indent": 3,
      "text": "[RFC6838] Freed, N., Klensin, J., and T. Hansen, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 6838, DOI 10.17487/RFC6838, January 2013, <http://www.rfc-editor.org/info/rfc6838>.",
      "zh-CHS": "[RFC6838]Freed，N.，Klensin，J.和T.Hansen，“介质类型规范和注册程序”，BCP 13，RFC 6838，DOI 10.17487/RFC6838，2013年1月<http://www.rfc-editor.org/info/rfc6838>."
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[HUMANE] Atwood, J., \"Is HTML a Humane Markup Language?\", May 2008, <http://blog.codinghorror.com/ is-html-a-humane-markup-language/>.",
      "zh-CHS": "[Humanic]Atwood，J.，“HTML是一种人性化的标记语言吗？”，2008年5月<http://blog.codinghorror.com/ is-html-a-humanic-markup-language/>。"
    },
    {
      "indent": 3,
      "text": "[INETMEME] Solon, O., \"Richard Dawkins on the internet's hijacking of the word 'meme'\", June 2013, <http://www.wired.co.uk/news/archive/2013-06/20/ richard-dawkins-memes>, <http://www.webcitation.org/6HzDGE9Go>.",
      "zh-CHS": "[INETMEME]Solon，O.，“Richard Dawkins在互联网上劫持‘meme’一词”，2013年6月<http://www.wired.co.uk/news/archive/2013-06/20/ 理查德·道金斯模因><http://www.webcitation.org/6HzDGE9Go>."
    },
    {
      "indent": 3,
      "text": "[ISO646] International Organization for Standardization, \"Information technology - ISO 7-bit coded character set for information interchange\", ISO Standard 646, 1991.",
      "zh-CHS": "[ISO646]国际标准化组织，“信息技术-信息交换用ISO 7位编码字符集”，ISO标准6461991。"
    },
    {
      "indent": 3,
      "text": "[PANDOC] MacFarlane, J., \"Pandoc\", 2014, <http://johnmacfarlane.net/pandoc/>.",
      "zh-CHS": "[PANDOC]麦克法兰，J.，“PANDOC”，2014年<http://johnmacfarlane.net/pandoc/>."
    },
    {
      "indent": 3,
      "text": "[RFC2046] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types\", RFC 2046, DOI 10.17487/RFC2046, November 1996, <http://www.rfc-editor.org/info/rfc2046>.",
      "zh-CHS": "[RFC2046]Freed，N.和N.Borenstein，“多用途互联网邮件扩展（MIME）第二部分：媒体类型”，RFC 2046，DOI 10.17487/RFC2046，1996年11月<http://www.rfc-editor.org/info/rfc2046>."
    },
    {
      "indent": 3,
      "text": "[RFC4263] Lilly, B., \"Media Subtype Registration for Media Type text/troff\", RFC 4263, DOI 10.17487/RFC4263, January 2006, <http://www.rfc-editor.org/info/rfc4263>.",
      "zh-CHS": "[RFC4263]Lilly，B.，“媒体类型text/troff的媒体子类型注册”，RFC 4263，DOI 10.17487/RFC4263，2006年1月<http://www.rfc-editor.org/info/rfc4263>."
    },
    {
      "indent": 3,
      "text": "[RFC7764] Leonard, S., \"Guidance on Markdown: Design Philosophies, Stability Strategies, and Select Registrations\", RFC 7764, DOI 10.17487/RFC7764, March 2016, <http://www.rfc-editor.org/info/rfc7764>.",
      "zh-CHS": "[RFC7764]Leonard，S.，“降价指南：设计理念、稳定性策略和选择注册”，RFC 7764，DOI 10.17487/RFC7764，2016年3月<http://www.rfc-editor.org/info/rfc7764>."
    },
    {
      "indent": 3,
      "text": "[UNICODE] The Unicode Consortium, \"The Unicode Standard, Version 8.0\", (Mountain View, CA: The Unicode Consortium, 2015. ISBN 978-1-936213-10-8), <http://www.unicode.org/versions/Unicode8.0.0/>.",
      "zh-CHS": "[UNICODE]UNICODE联盟，“UNICODE标准，8.0版”（加利福尼亚州山景城：UNICODE联盟，2015年，ISBN 978-1-936213-10-8）<http://www.unicode.org/versions/Unicode8.0.0/>."
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Sean Leonard Penango, Inc. 5900 Wilshire Boulevard 21st Floor Los Angeles, CA 90036 United States",
      "zh-CHS": "Sean Leonard Penango，Inc.美国加利福尼亚州洛杉矶威尔希尔大道21楼5900号，邮编90036"
    },
    {
      "indent": 3,
      "text": "Email: dev+ietf@seantek.com\nURI:   http://www.penango.com/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}