{
  "title": {
    "text": "RFC 2503:  MIME Types for Use with the ISO ILL Protocol ",
    "zh-CHS": "RFC 2503"
  },
  "number": 2503,
  "created_at": "2021-10-23 11:20:15.991818+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     R. Moulton\nRequest for Comments: 2503                            United Kingdom\nCategory: Informational                                 M. Needleman\n                                       Data Research Associates, Inc\n                                                       February 1999",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "MIME Types for Use with the ISO ILL Protocol",
      "zh-CHS": "用于ISO ILL协议的MIME类型"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memorandum describes a set of MIME types for use with the ISO Interlibrary Loan Protocol (ISO 10160/10161). Two MIME types are specified below.",
      "zh-CHS": "本备忘录描述了一组用于ISO馆际互借协议（ISO 10160/10161）的MIME类型。下面指定了两种MIME类型。"
    },
    {
      "indent": 3,
      "text": "The first is a media type to carry objects which are BER [BER] encoded ISO ILL Protocol Data Units (PDU's). BER are the basic Encoding Rules used to encode PDU's which have been described using ASN.1 (Abstract Syntax Notation 1) [ASN.1] .",
      "zh-CHS": "第一种是一种媒体类型，用于承载由BER[BER]编码的ISO-ILL协议数据单元（PDU）的对象。BER是用于编码PDU的基本编码规则，已使用ASN.1（抽象语法符号1）[ASN.1]进行了描述。"
    },
    {
      "indent": 3,
      "text": "The second is for use with the associated document delivery instructions. Document Delivery Instructions (DDI) is an emerging protocol which enables automatic electronic delivery of items. It allows a request management system (which might have received a request for an item via the ISO Interlibrary Loan Protocol (ISO 10160/10161)) to pass details of the request, item, and delivery, to a delivery module, and to receive back reports on the delivery process or arrival of an item. It is currently being submitted to the ISO TC46/SC4/WG4 committee for approval as an ISO standard.",
      "zh-CHS": "第二个用于关联的文档交付说明。文档交付指令（DDI）是一种新兴的协议，可实现项目的自动电子交付。它允许请求管理系统（可能通过ISO馆际互借协议（ISO 10160/10161）接收项目请求）将请求、项目和交付的详细信息传递给交付模块，并接收项目交付过程或到达的反馈报告。它目前正在提交给ISO TC46/SC4/WG4委员会，作为ISO标准进行批准。"
    },
    {
      "indent": 0,
      "text": "Registration Information",
      "zh-CHS": "注册信息"
    },
    {
      "indent": 3,
      "text": "Media type name: application Media subtype name: iso-10161-ill-1 - for BER encoded ISO ILL APDU's",
      "zh-CHS": "媒体类型名称：应用媒体子类型名称：iso-10161-ill-1-用于BER编码的iso-ill APDU"
    },
    {
      "indent": 3,
      "text": "Media type name: application Media subtype name: ill-ddi - For associated Document Delivery Instructions",
      "zh-CHS": "媒体类型名称：应用程序媒体子类型名称：ill ddi-用于关联的文档传递说明"
    },
    {
      "indent": 3,
      "text": "Required Parameter: transfer-encoding",
      "zh-CHS": "必需参数：传输编码"
    },
    {
      "indent": 3,
      "text": "For BER-encoded PDU's or DDI's, the only current legal value of this parameter is:",
      "zh-CHS": "对于BER编码的PDU或DDI，此参数的当前唯一合法值为："
    },
    {
      "indent": 4,
      "text": "iso-8825-ber",
      "zh-CHS": "iso-8825-ber"
    },
    {
      "indent": 3,
      "text": "The transfer-encoding parameter describes the way the PDU has been encoded before being submitted to the transport service (in this case MIME/RFC822). The two protocols described in this RFC specify their APDU's using ASN.1 (ISO 8824:1990) and the most common way of encoding ASN.1 packets is to use the Basic Encoding Rules (BER ISO 8825)",
      "zh-CHS": "传输编码参数描述了PDU在提交到传输服务（在本例中为MIME/RFC822）之前的编码方式。本RFC中描述的两个协议使用ASN.1（ISO 8824:1990）指定了它们的APDU，最常见的ASN.1数据包编码方式是使用基本编码规则（BER ISO 8825）"
    },
    {
      "indent": 3,
      "text": "The parameter is included to allow future use of these MIME types with other encoding schemes. As an example, the ISO 10161 standard also describes an encoding method using EDIFACT. In the future, other schemes might also be employed. (Since the EDIFACT encoding is not currently in use amongst the ISO 10161 and DDI communities, a value for the transfer-encoding parameter to describe it is not being registered in this RFC.)",
      "zh-CHS": "包含该参数是为了允许将来将这些MIME类型与其他编码方案一起使用。例如，ISO 10161标准还描述了使用EDIFACT的编码方法。将来也可能采用其他方案。（由于EDIFACT编码目前未在ISO 10161和DDI社区中使用，因此描述该编码的传输编码参数值未在该RFC中注册。）"
    },
    {
      "indent": 3,
      "text": "Optional parameter: iso-10161-apdu-type",
      "zh-CHS": "可选参数：iso-10161-apdu-type"
    },
    {
      "indent": 3,
      "text": "Valid values are:",
      "zh-CHS": "有效值为："
    },
    {
      "indent": 3,
      "text": "ILL-Request Forward-Notification Shipped ILL-Answer Conditional-Reply Cancel Cancel-Reply Received Recall Returned Checked-In Overdue Renew Renew-Answer Lost Damaged Message Status-Query Status-Or-Error-Report Expired",
      "zh-CHS": "错误请求转发通知已发送错误应答有条件应答取消取消应答已接收召回已返回已签入过期续订续订应答丢失损坏邮件状态查询状态或错误报告已过期"
    },
    {
      "indent": 3,
      "text": "This parameter is optional and can be provided for informational or diagnostic purposes. The value of the PDU or DDI type can be determined from the actual data sent. The use and format of the PDU's and DDI's is defined in the relevant protocol documents which describe them.",
      "zh-CHS": "此参数是可选的，可用于信息或诊断目的。PDU或DDI类型的值可根据发送的实际数据确定。描述PDU和DDI的相关协议文件中定义了PDU和DDI的使用和格式。"
    },
    {
      "indent": 0,
      "text": "Examples",
      "zh-CHS": "例子"
    },
    {
      "indent": 3,
      "text": "Content-Type: application/iso-10161-ill-1;  transfer-encoding=iso-\n8825-ber; iso-10161-apdu-type=Recall;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Content-Type: application/ill-ddi;  transfer-encoding=iso-8825-ber;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Encoding",
      "zh-CHS": "编码"
    },
    {
      "indent": 3,
      "text": "Since BER encoded material is binary in nature, some form of encoding is needed when 7bit or 8bit transport mechanisms are employed.",
      "zh-CHS": "由于BER编码的材料本质上是二进制的，当采用7位或8位传输机制时，需要某种形式的编码。"
    },
    {
      "indent": 3,
      "text": "The recommended encoding for BER encoded PDU's is Base64",
      "zh-CHS": "BER编码PDU的建议编码为Base64"
    },
    {
      "indent": 0,
      "text": "PDU's per Message",
      "zh-CHS": "每封邮件的PDU"
    },
    {
      "indent": 3,
      "text": "When used to send BER encoded PDU's or DDI's. Each MIME body part will carry at most one BER encoded PDU or DDI. However, a single MIME message containing multiple body parts can be used to transport more than one BER PDU and or DDI.",
      "zh-CHS": "当用于发送BER编码的PDU或DDI时。每个MIME主体部分最多携带一个BER编码的PDU或DDI。但是，包含多个正文部分的单个MIME消息可用于传输多个BER PDU和/或DDI。"
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "zh-CHS": "安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no known security risks associated with transmitting BER encoded PDU's in general. However, a particular BER encoded PDU or DDI may have security considerations that make it inappropriate for transmittal through public data networks unless appropriate protection mechanisms, like encryption, are used. Such a situation might occur, for example, when organizations are exchanging documents that contain secure or classified information and it is necessary to keep information about both the material being exchanged and the exchanging partners confidential.",
      "zh-CHS": "一般来说，不存在与传输BER编码PDU相关的已知安全风险。然而，特定的BER编码PDU或DDI可能具有安全考虑，使得其不适合通过公共数据网络传输，除非使用适当的保护机制，如加密。例如，当组织交换包含安全或机密信息的文件时，可能会出现这种情况，并且有必要对所交换的材料和交换伙伴的信息保密。"
    },
    {
      "indent": 0,
      "text": "Interoperability Considerations",
      "zh-CHS": "互操作性注意事项"
    },
    {
      "indent": 3,
      "text": "BER is an international standard for encoding data meant to be transferred between two systems that may store data in different local formats internally [BER].",
      "zh-CHS": "BER是一种国际标准，用于编码在两个系统之间传输的数据，这两个系统可以在内部以不同的本地格式存储数据[BER]。"
    },
    {
      "indent": 0,
      "text": "References",
      "zh-CHS": "工具书类"
    },
    {
      "indent": 3,
      "text": "[BER] ISO/IEC 8825:1990 Information Technology - Open Systems Interconnection - Specification of Basic Encoding Rules for Abstract Syntax Notation One (ASN.1)",
      "zh-CHS": "[BER]ISO/IEC 8825:1990信息技术-开放系统互连-抽象语法符号1（ASN.1）的基本编码规则规范"
    },
    {
      "indent": 3,
      "text": "[ASN.1] ISO/IEC 8824:1990 Information Technology - Open Systems Interconnection - Specification of Abstract Syntax Notation One (ASN.1)",
      "zh-CHS": "[ASN.1]ISO/IEC 8824:1990信息技术-开放系统互连-抽象语法符号1规范（ASN.1）"
    },
    {
      "indent": 3,
      "text": "ISO 10160:1997 Information and Documentation - Open Systems Interconnection - Interlibrary Loan Application Service Definition",
      "zh-CHS": "ISO 10160:1997信息和文献-开放系统互连-馆际互借申请服务定义"
    },
    {
      "indent": 3,
      "text": "ISO 10161-1:1997 Information and Documentation - Open Systems\n        Interconnection - Interlibrary Loan Application Protocol\n        Specification - Part 1: Protocol Specification",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Additional Information:",
      "zh-CHS": "其他信息："
    },
    {
      "indent": 3,
      "text": "The National Library of Canada has been designated the maintenance agency for the ISO ILL protocol. For more information on this MIME type contact:",
      "zh-CHS": "加拿大国家图书馆被指定为ISO ILL协议的维护机构。有关此MIME类型的详细信息，请联系："
    },
    {
      "indent": 3,
      "text": "Barbara Shuh Library Network Specialist Information Analysis and Standards Information and Technology Services National Library of Canada 395 Wellington Street Ottawa, Ontario CANADA K1A 0N4",
      "zh-CHS": "Barbara Shuh图书馆网络专家信息分析和标准信息与技术服务加拿大国家图书馆加拿大安大略省渥太华惠灵顿街395号K1A 0N4"
    },
    {
      "indent": 3,
      "text": "Phone: (819) 994-6969 Fax: (819) 994-6835 EMail: barbara.shuh@nlc-bnc.ca",
      "zh-CHS": "电话：（819）994-6969传真：（819）994-6835电子邮件：芭芭拉。shuh@nlc-bnc.ca"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Ruth Moulton Consultant 65 Tetherdown London N10 1NH United Kingdom",
      "zh-CHS": "Ruth Moulton顾问公司65 Tetherdown London N10 1NH英国"
    },
    {
      "indent": 3,
      "text": "Phone: +44 (181) 883 5823\nEMail: ruth@muswell.demon.co.uk",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mark H Needleman Data Research Associates, Inc. 1276 North Warson Road P.O. Box 8495 St Louis, MO 63132-1806 USA",
      "zh-CHS": "Mark H Needleman Data Research Associates，Inc.美国密苏里州圣路易斯北华森路1276号邮政信箱8495号，邮编63132-1806"
    },
    {
      "indent": 3,
      "text": "Phone: (80)0 325-0888 (US/Canada) (314) 432-1100 x318 Fax: (314) 993-8927 Email: mneedleman@dra.com",
      "zh-CHS": "电话：（80）0325-0888（美国/加拿大）（314）432-1100 x318传真：（314）993-8927电子邮件：mneedleman@dra.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    }
  ]
}