{
  "title": {
    "text": "RFC 2456:  Definitions of Managed Objects for APPN TRAPS ",
    "zh-CHS": "RFC 2456"
  },
  "number": 2456,
  "created_at": "2021-10-23 06:29:20.861195+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     B. Clouston\nRequest for Comments: 2456                              Cisco Systems\nCategory: Standards Track                                    B. Moore\n                                                      IBM Corporation\n                                                        November 1998",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "Definitions of Managed Objects for APPN TRAPS",
      "zh-CHS": "APPN陷阱的托管对象定义"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1998年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it defines objects for receiving notifications from network devices with APPN (Advanced Peer-to-Peer Network) and DLUR (Dependent LU Requester) capabilities. This memo identifies notifications for the APPN and DLUR architecture.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别是，它定义了用于从具有APPN（高级对等网络）和DLUR（依赖LU请求者）功能的网络设备接收通知的对象。此备忘录确定了APPN和DLUR体系结构的通知。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.     Introduction  ...........................................  2\n2.     The SNMP Network Management Framework  ..................  2\n3.     Overview  ...............................................  3\n3.1      APPN TRAP MIB structure  ..............................  5\n4.     Definitions  ............................................  6\n5.     Security Considerations  ................................ 17\n6.     Intellectual Property  .................................. 17\n7.     Acknowledgments  ........................................ 18\n8.     References  ............................................. 18\n9.     Authors' Addresses  ..................................... 20\n10.    Full Copyright Statement  ............................... 21",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document is a product of the SNA NAU Services MIB Working Group. It defines a MIB module for notifications for devices with Advanced Peer-to-Peer Networking (APPN) and Dependent LU Requester (DLUR) capabilities.",
      "zh-CHS": "本文件是SNA NAU服务MIB工作组的产品。它定义了一个MIB模块，用于为具有高级对等网络（APPN）和依赖LU请求程序（DLUR）功能的设备发送通知。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [13].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[13]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. The SNMP Network Management Framework",
      "section_title": true,
      "zh-CHS": "2. SNMP网络管理框架"
    },
    {
      "indent": 3,
      "text": "The SNMP Management Framework presently consists of five major components:",
      "zh-CHS": "SNMP管理框架目前由五个主要组件组成："
    },
    {
      "indent": 3,
      "text": "o An overall architecture, described in RFC 2271 [1].",
      "zh-CHS": "o RFC 2271[1]中描述的总体架构。"
    },
    {
      "indent": 3,
      "text": "o Mechanisms for describing and naming objects and events for the purpose of management. The first version of this Structure of Management Information (SMI) is called SMIv1 and described in STD 16, RFC 1155 [2], STD 16, RFC 1212 [3] and RFC 1215 [4]. The second version, called SMIv2, is described in RFC 1902 [5], RFC 1903 [6] and RFC 1904 [7].",
      "zh-CHS": "o 为管理目的描述和命名对象和事件的机制。这种管理信息结构（SMI）的第一个版本称为SMIv1，并在STD 16、RFC 1155[2]、STD 16、RFC 1212[3]和RFC 1215[4]中进行了描述。第二个版本称为SMIv2，在RFC 1902[5]、RFC 1903[6]和RFC 1904[7]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Message protocols for transferring management information. The first version of the SNMP message protocol is called SNMPv1 and described in STD 15, RFC 1157 [8]. A second version of the SNMP message protocol, which is not an Internet standards track protocol, is called SNMPv2c and described in RFC 1901 [9] and RFC 1906 [10]. The third version of the message protocol is called SNMPv3 and described in RFC 1906 [10], RFC 2272 [11] and RFC 2274 [12].",
      "zh-CHS": "o 用于传输管理信息的消息协议。SNMP消息协议的第一个版本称为SNMPv1，在STD 15、RFC 1157[8]中进行了描述。SNMP消息协议的第二个版本不是互联网标准跟踪协议，称为SNMPv2c，在RFC 1901[9]和RFC 1906[10]中进行了描述。消息协议的第三个版本称为SNMPv3，在RFC 1906[10]、RFC 2272[11]和RFC 2274[12]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Protocol operations for accessing management information. The first set of protocol operations and associated PDU formats is described in STD 15, RFC 1157 [8]. A second set of protocol operations and associated PDU formats is described in RFC 1905 [13].",
      "zh-CHS": "o 访问管理信息的协议操作。STD 15、RFC 1157[8]中描述了第一组协议操作和相关PDU格式。RFC 1905[13]中描述了第二组协议操作和相关PDU格式。"
    },
    {
      "indent": 3,
      "text": "o A set of fundamental applications described in RFC 2273 [14] and the view-based access control mechanism described in RFC 2275 [15].",
      "zh-CHS": "o RFC 2273[14]中描述的一组基本应用程序和RFC 2275[15]中描述的基于视图的访问控制机制。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. Objects in the MIB are defined using the mechanisms defined in the SMI.",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB中的对象是使用SMI中定义的机制定义的。"
    },
    {
      "indent": 3,
      "text": "This memo specifies a MIB module that is compliant to the SMIv2. A MIB conforming to the SMIv1 can be produced through the appropriate translations. The resulting translated MIB must be semantically equivalent, except where objects or events are omitted because no translation is possible (use of Counter64). Some machine readable information in SMIv2 will be converted into textual descriptions in SMIv1 during the translation process. However, this loss of machine readable information is not considered to change the semantics of the MIB.",
      "zh-CHS": "此备忘录指定了符合SMIv2的MIB模块。通过适当的翻译，可以生成符合SMIv1的MIB。生成的已翻译MIB必须在语义上等效，除非由于无法翻译而省略了对象或事件（使用计数器64）。在翻译过程中，SMIv2中的一些机器可读信息将转换为SMIv1中的文本描述。但是，这种机器可读信息的丢失不被认为会改变MIB的语义。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "zh-CHS": "3. 概述"
    },
    {
      "indent": 3,
      "text": "This document identifies the set of objects for reporting the status of devices with APPN and DLUR capabilities via notifications.",
      "zh-CHS": "本文档确定了一组对象，用于通过通知报告具有APPN和DLUR功能的设备的状态。"
    },
    {
      "indent": 3,
      "text": "See the SNANAU APPN MIB [18] and SNANAU DLUR MIB [19] for the objects for monitoring the configuration and active characteristics of the devices with APPN and DLUR capabilities. Many objects contained in the notifications of this MIB are imported from the APPN and DLUR MIBs. Implementors of this MIB must also implement the APPN MIB. Implementations that support the appnTrapMibDlurConfGroup and the appnTrapMibDlurNotifGroup must also implement the DLUR MIB.",
      "zh-CHS": "请参阅SNANAU APPN MIB[18]和SNANAU DLUR MIB[19]，了解用于监控具有APPN和DLUR功能的设备的配置和活动特性的对象。此MIB的通知中包含的许多对象都是从APPN和DLUR MIB导入的。此MIB的实现者还必须实现APPNMIB。支持appnTrapMibDlurConfGroup和appnTrapMibDlurNotifGroup的实现还必须实现DLUR MIB。"
    },
    {
      "indent": 3,
      "text": "The SNANAU APPN MIB allows a management station to collect the network topology of an APPN network (the network nodes (NNs) in the network and all of transmission groups (TGs) between the network nodes) from an APPN device. It also allows the management station to collect the local topology (TGs to end stations, and locally defined ports and link stations) from an APPN device. While the SNANAU APPN MIB has an efficient way to poll the APPN device for updates to the network topology, using flow reduction sequence numbers (FRSNs) as a table index; it does not have a mechanism to poll the local topology tables (appnLocalTgTable, appnPortTable, and appnLsTable) for status changes.",
      "zh-CHS": "SNANAU APPN MIB允许管理站从APPN设备收集APPN网络的网络拓扑（网络中的网络节点（NN）和网络节点之间的所有传输组（TG））。它还允许管理站从APPN设备收集本地拓扑（TGs到终端站，以及本地定义的端口和链路站）。SNANAU APPN MIB使用流量减少序列号（FRSN）作为表索引，可以有效地轮询APPN设备以更新网络拓扑；它没有轮询本地拓扑表（appnLocalTgTable、appnPortTable和appnLsTable）以查看状态更改的机制。"
    },
    {
      "indent": 3,
      "text": "This MIB provides a mechanism for an APPN device to send notifications to inform the management station of status changes to rows of these tables. Status changes include operational state changes, and for TGs also include control-point to control-point (CP-CP) session state changes. A notification is defined for each type of status change for each table.",
      "zh-CHS": "此MIB为APPN设备提供了一种机制，用于发送通知，通知管理站这些表行的状态更改。状态更改包括操作状态更改，对于TGs，还包括控制点到控制点（CP-CP）会话状态更改。为每个表的每种状态更改类型定义通知。"
    },
    {
      "indent": 3,
      "text": "The port and link operational state objects have intermediate states. Notifications are only sent for transition to active or inactive state.",
      "zh-CHS": "端口和链路操作状态对象具有中间状态。仅在转换到活动或非活动状态时发送通知。"
    },
    {
      "indent": 3,
      "text": "Notifications are only sent for row creation if the state is active or operational. This is done to avoid sending a notification as the row is created with an inactive initial state, followed by another notification as the resource is activated.",
      "zh-CHS": "仅当状态为“活动”或“可操作”时，才会为行创建发送通知。这样做是为了避免在使用非活动初始状态创建行时发送通知，然后在资源激活时发送另一个通知。"
    },
    {
      "indent": 3,
      "text": "Notifications are only sent for row deletion if the last state was active or operational. In most cases, a resource must be deactivated before it can be deleted, and the deactivation will cause a notification to be sent. There is no need for a second notification to be sent for the row deletion, except for the case where the deletion occurred without deactivation. In this case, the state of the object in the notification will indicate an inactve state, since a deleted resource can no longer be active.",
      "zh-CHS": "仅当最后一个状态为活动或可操作时，才会发送行删除通知。在大多数情况下，必须先停用资源，然后才能将其删除，停用将导致发送通知。不需要为行删除发送第二次通知，除非在未停用的情况下进行删除。在这种情况下，通知中对象的状态将指示inactve状态，因为已删除的资源不能再处于活动状态。"
    },
    {
      "indent": 3,
      "text": "The purpose of the appnLocalTgCpCpStateChangeTrap notification is to identify the loss or recovery of CP-CP sessions on a TG while the TG remains operational. Thus this notification is only sent if there is a change to an appnLocalTgCpCpSession object, but not a change to the appnLocalTgOperational object. This notification is never sent for the creation or deletion of a row in the appnLocalTgTable.",
      "zh-CHS": "AppnLocalTGCPStateChangeTrap通知的目的是在TG保持运行时，识别TG上CP-CP会话的丢失或恢复。因此，仅当appnLocalTgCpCpSession对象发生更改，而appnLocalTgOperational对象未发生更改时，才会发送此通知。在appnLocalTgTable中创建或删除行时，不会发送此通知。"
    },
    {
      "indent": 3,
      "text": "Each notification always contains an object which is a count of the number of times the status of a row in table has changed since the APPN node was last reinitialized. This enables a management station to detect that it has missed a notification, if it does not get the notifications in numerical sequence. If the notifications are not in sequence, the management station should retrieve the entire table to get the correct status for all rows.",
      "zh-CHS": "每个通知始终包含一个对象，该对象是自上次重新初始化APPN节点以来表中行的状态已更改的次数计数。这使管理站能够在未按数字顺序获取通知时检测到它错过了通知。如果通知不按顺序排列，管理站应检索整个表，以获得所有行的正确状态。"
    },
    {
      "indent": 3,
      "text": "Similarly, the SNANAU DLUR MIB provides a mechanism for retrieving the configuration and status of dependent LU server (DLUS) sessions on a device with DLUR capabilities. This MIB defines a notification for a DLUR-DLUS session state change of a row in the dlurDlusTable, in the manner described above. A notification is only sent for a session state transition to active or inactive. As with the above notifications, it is only sent on row creation if the initial state is active; and on row deletion is the last state was active, in which case the notification indicates that the state is now inactive.",
      "zh-CHS": "类似地，SNANAU DLUR MIB提供了一种机制，用于检索具有DLUR功能的设备上的从属LU服务器（DLU）会话的配置和状态。此MIB以上述方式定义dlurDlusTable中某行的DLUR-DLUS会话状态更改通知。仅当会话状态转换为活动或非活动时才会发送通知。与上述通知一样，只有在初始状态为活动状态时，才会在创建行时发送通知；在行删除是最后一个处于活动状态的状态，在这种情况下，通知指示该状态现在处于非活动状态。"
    },
    {
      "indent": 3,
      "text": "The SNANAU APPN MIB also provides a mechanism for a management station to collect traffic statistics on intermediate sessions, primarily for accounting purposes. However, when the session is terminated, all statistics from the last poll until the session termination time are lost, since the row for that session is deleted from the appnIsInTable. This MIB defines a notification so that the session's final statistics can be sent to a management station. If the notification is not delivered, the final session statistics are lost. If this is a concern, polling of the appnIsInTable in the APPN",
      "zh-CHS": "SNANAU APPN MIB还为管理站提供了一种机制，用于收集中间会话的流量统计数据，主要用于记帐目的。但是，当会话终止时，从上次轮询到会话终止时间的所有统计信息都将丢失，因为该会话的行将从appnIsInTable中删除。此MIB定义了一个通知，以便将会话的最终统计信息发送到管理站。如果通知未送达，则最终会话统计信息将丢失。如果这是一个问题，则在APPN中轮询AppNiInstallable"
    },
    {
      "indent": 3,
      "text": "MIB should be increased to more likely reduce the time between the last poll and the session termination, thereby reducing the amount of data lost.",
      "zh-CHS": "应该增加MIB，以更可能地缩短上次轮询和会话终止之间的时间，从而减少数据丢失量。"
    },
    {
      "indent": 3,
      "text": "Highlights of the management functions supported by the APPN TRAP MIB module include the following:",
      "zh-CHS": "APPN TRAP MIB模块支持的管理功能要点包括："
    },
    {
      "indent": 3,
      "text": "o A notification for an APPN local TG operational state change.",
      "zh-CHS": "o APPN本地TG操作状态更改的通知。"
    },
    {
      "indent": 3,
      "text": "o A notification for an APPN local TG CP-CP session state change.",
      "zh-CHS": "o APPN本地TG CP-CP会话状态更改的通知。"
    },
    {
      "indent": 3,
      "text": "o A notification for an APPN port operational state change.",
      "zh-CHS": "o APPN端口操作状态更改的通知。"
    },
    {
      "indent": 3,
      "text": "o A notification for an APPN link station operational state change.",
      "zh-CHS": "o APPN链路站操作状态更改的通知。"
    },
    {
      "indent": 3,
      "text": "o A notification for a DLUR-DLUS session state change.",
      "zh-CHS": "o DLUR-DLUS会话状态更改的通知。"
    },
    {
      "indent": 3,
      "text": "o A notification for reporting final APPN intermediate session statistics.",
      "zh-CHS": "o 用于报告最终APPN中间会话统计信息的通知。"
    },
    {
      "indent": 3,
      "text": "This MIB module does not support:",
      "zh-CHS": "此MIB模块不支持："
    },
    {
      "indent": 3,
      "text": "o Objects to query the configuration or status of APPN nodes on demand.",
      "zh-CHS": "o 对象以按需查询APPN节点的配置或状态。"
    },
    {
      "indent": 3,
      "text": "o Notifications for changes to local topology tables not related to status.",
      "zh-CHS": "o 与状态无关的本地拓扑表更改通知。"
    },
    {
      "indent": 0,
      "text": "3.1. APPN TRAP MIB Structure",
      "section_title": true,
      "zh-CHS": "3.1. APPN陷阱MIB结构"
    },
    {
      "indent": 3,
      "text": "The APPN TRAP MIB module contains a group of notifications, and a group of supporting objects.",
      "zh-CHS": "APPN TRAP MIB模块包含一组通知和一组支持对象。"
    },
    {
      "indent": 3,
      "text": "The group of notifications consists of the following notifications:",
      "zh-CHS": "通知组由以下通知组成："
    },
    {
      "indent": 3,
      "text": "1) appnIsrAccountingDataTrap",
      "zh-CHS": "1) appnIsrAccountingDataTrap"
    },
    {
      "indent": 3,
      "text": "This notification is generated by an APPN device when an intermediate session is terminating, to report the final accounting statistics of the session.",
      "zh-CHS": "此通知由APPN设备在中间会话终止时生成，以报告会话的最终记帐统计信息。"
    },
    {
      "indent": 3,
      "text": "2) appnLocalTgOperStateChangeTrap",
      "zh-CHS": "2) AppnLocalTGOperateStateChangeTrap"
    },
    {
      "indent": 3,
      "text": "This notification identifies a change to the appnLocalTgOperational object in a row of the SNANAU APPN MIB appnLocalTgTable.",
      "zh-CHS": "此通知标识对SNANAU APPN MIB APPNLOCALTG表行中的APPNLOCALTG操作对象的更改。"
    },
    {
      "indent": 3,
      "text": "3) appnLocalTgCpCpStateChangeTrap",
      "zh-CHS": "3) AppNLocalTGCPStateChangeTrap"
    },
    {
      "indent": 3,
      "text": "This notification identifies a change to the appnLocalTgCpCpSession object in a row of the SNANAU APPN MIB appnLocalTgTable.",
      "zh-CHS": "此通知标识对SNANAU APPN MIB APPNOLOCATGTG表行中的appnLocalTgCpCpSession对象的更改。"
    },
    {
      "indent": 3,
      "text": "4) appnPortOperStateChangeTrap",
      "zh-CHS": "4) appnPortOperStateChangeTrap"
    },
    {
      "indent": 3,
      "text": "This notification identifies a change to the appnPortOperState object in a row of the SNANAU APPN MIB appnPortTable.",
      "zh-CHS": "此通知标识对SNANAU APPN MIB appnPortTable行中appnPortOperState对象的更改。"
    },
    {
      "indent": 3,
      "text": "5) appnLsOperStateChangeTrap",
      "zh-CHS": "5) appnLsOperStateChangeTrap"
    },
    {
      "indent": 3,
      "text": "This notification identifies a change to the appnLsOperState object in a row of the SNANAU APPN MIB appnLsTable.",
      "zh-CHS": "此通知标识SNANAU APPN MIB appnLsTable行中appnLsOperState对象的更改。"
    },
    {
      "indent": 3,
      "text": "6) dlurDlusStateChangeTrap",
      "zh-CHS": "6) dlurDlusStateChangeTrap"
    },
    {
      "indent": 3,
      "text": "This notification identifies a change to the dlurDlusSessnStatus object in a row of the SNANAU DLUR MIB dlurDlusTable.",
      "zh-CHS": "此通知标识对SNANAU DLUR MIB DLURDLLUSTRUSTABLE行中DLURDLUSSESSNSNSSTATUS对象的更改。"
    },
    {
      "indent": 3,
      "text": "The group of supporting objects contains the appnTrapControl object, which controls whether the APPN device generates each type of notification. Note that generation of the appnIsrAccountingDataTrap is not controlled by this object; instead it is controlled by the appnIsInGlobalCtrAdminStatus object in the SNANAU APPN MIB.",
      "zh-CHS": "支持对象组包含appnTrapControl对象，该对象控制APPN设备是否生成每种类型的通知。注意，appnIsrAccountingDataTrap的生成不受此对象控制；而是由SNANAU APPN MIB中的AppNisingLobalctAdminStatus对象控制。"
    },
    {
      "indent": 3,
      "text": "Although APPN notification generation could be controlled solely by entries in the snmpNotificationMIB, RFC 2273 [9], the appnTrapControl object exists in this MIB so that implementations are not required to implement RFC 2273 to control generation of APPN notifications. For a notification to be generated and sent as a TRAP or INFORM, the notification type must first be enabled by the appnTrapControl object. It must also not be disabled by an snmpNotificationMIB entry. The destination of notifications is not within the scope of this MIB.",
      "zh-CHS": "尽管APPN通知的生成可以仅由snmpNotificationMIB RFC 2273[9]中的条目控制，但此MIB中存在AppntraControl对象，因此实现RFC 2273控制APPN通知的生成不需要实现。要生成通知并将其作为陷阱或通知发送，通知类型必须首先由AppntraControl对象启用。snmpNotificationMIB条目也不能禁用它。通知的目标不在此MIB的范围内。"
    },
    {
      "indent": 3,
      "text": "Also contained in this group are objects for the TG, port, link, and DLUR-DLUS session notifications to indicate the number of times each of the tables has had a status change of a row since the APPN node was last reinitialized.",
      "zh-CHS": "此组中还包含TG、端口、链路和DLUR-DLUS会话通知的对象，以指示自上次重新初始化APPN节点以来每个表的行状态发生更改的次数。"
    },
    {
      "indent": 0,
      "text": "4. Definitions",
      "section_title": true,
      "zh-CHS": "4. 定义"
    },
    {
      "indent": 0,
      "text": "APPN-TRAP-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS",
      "zh-CHS": "进口"
    },
    {
      "indent": 8,
      "text": "Counter32, OBJECT-TYPE, MODULE-IDENTITY,",
      "zh-CHS": "计数器32，对象类型，模块标识，"
    },
    {
      "indent": 8,
      "text": "NOTIFICATION-TYPE FROM SNMPv2-SMI",
      "zh-CHS": "来自SNMPv2 SMI的通知类型"
    },
    {
      "indent": 8,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF",
      "zh-CHS": "来自SNMPv2 CONF的MODULE-COMPLIANCE、OBJECT-GROUP、NOTIFICATION-GROUP"
    },
    {
      "indent": 8,
      "text": "appnMIB, appnIsInP2SFmdPius, appnIsInS2PFmdPius, appnIsInP2SNonFmdPius, appnIsInS2PNonFmdPius, appnIsInP2SFmdBytes, appnIsInS2PFmdBytes, appnIsInP2SNonFmdBytes, appnIsInS2PNonFmdBytes, appnIsInSessUpTime, appnObjects, appnLocalTgOperational, appnLocalTgCpCpSession, appnPortOperState, appnLsOperState, appnCompliances, appnGroups FROM APPN-MIB",
      "zh-CHS": "appnMIB、appnIsInP2SFmdPius、appnIsInS2PFmdPius、appnIsInS2PFmdPius、appnIsInP2SFmdBytes、appnIsInS2PFmdBytes、appnIsInS2PFmdBytes、appnIsInS2PFmdBytes、APPNISINSSUPTIME、APPNojects、APPNOLCALTGOPCPSession、APPNOPORTOPERSTATE、appnLsOperState、APPNIMPLiances、APPN-MIB中的APPNOSINP2PFMDBytes"
    },
    {
      "indent": 8,
      "text": "dlurDlusSessnStatus FROM APPN-DLUR-MIB;",
      "zh-CHS": "来自APPN-DLUR-MIB的DLURDLUSSSNSN状态；"
    },
    {
      "indent": 0,
      "text": "appnTrapMIB MODULE-IDENTITY LAST-UPDATED \"9808310000Z\" -- August 31, 1998 ORGANIZATION \"IETF SNA NAU MIB WG / AIW APPN MIBs SIG\" CONTACT-INFO",
      "zh-CHS": "appnTrapMIB模块标识最后更新“980831000Z”-1998年8月31日组织“IETF SNA NAU MIB WG/AIW APPN MIBs SIG”联系信息"
    },
    {
      "indent": 16,
      "text": "\" Bob Clouston Cisco Systems 7025 Kit Creek Road P.O. Box 14987 Research Triangle Park, NC 27709, USA Tel: 1 919 472 2333 E-mail: clouston@cisco.com",
      "zh-CHS": "“Bob Clouston Cisco Systems 7025 Kit Creek Road邮政信箱14987美国北卡罗来纳州三角研究园27709电话：1919 472 2333电子邮件：clouston@cisco.com"
    },
    {
      "indent": 6,
      "text": " Bob Moore IBM Corporation 4205 S. Miami Boulevard BRQA/501 P.O. Box 12195 Research Triangle Park, NC 27709, USA Tel: 1 919 254 4436 E-mail: remoore@us.ibm.com \" DESCRIPTION \"This MIB module defines notifications to be generated by network devices with APPN capabilities. It presupposes support for the APPN MIB. It also presupposes support for the DLUR MIB for implementations that support the DLUR-related groups.\"",
      "zh-CHS": "Bob Moore IBM Corporation 4205 S.Miami Boulevard BRQA/501邮政信箱12195美国北卡罗来纳州三角研究公园27709电话：1919 254 4436电子邮件：remoore@us.ibm.com“说明”此MIB模块定义由具有APPN功能的网络设备生成的通知。它以支持APPNMIB为前提。它还假定对支持DLUR相关组的实现支持DLUR MIB。”"
    },
    {
      "indent": 0,
      "text": "::= { appnMIB 0 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- *********************************************************************\n-- Notifications\n-- *********************************************************************",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnIsrAccountingDataTrap NOTIFICATION-TYPE\n      OBJECTS  {\n                appnIsInP2SFmdPius,\n                appnIsInS2PFmdPius,\n                appnIsInP2SNonFmdPius,\n                appnIsInS2PNonFmdPius,\n                appnIsInP2SFmdBytes,\n                appnIsInS2PFmdBytes,\n                appnIsInP2SNonFmdBytes,\n                appnIsInS2PNonFmdBytes,\n                appnIsInSessUpTime\n               }\n      STATUS current\n      DESCRIPTION\n          \"When it has been enabled, this notification is generated by an\n          APPN node whenever an ISR session passing through the node is\n          taken down, regardless of whether the session went down\n          normally or abnormally.  Its purpose is to allow a management\n          application (primarily an accounting application) that is\n          monitoring the ISR counts to receive the final values of these\n          counts, so that the application can properly account for the\n          amounts the counts were incremented since the last time the\n          application polled them.  The appnIsInSessUpTime object\n          provides the total amount of time that the session was active.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "This notification is not a substitute for polling the ISR counts. In particular, the count values reported in this notification cannot be assumed to be the complete totals for the life of the session, since they may have wrapped while the session was up.",
      "zh-CHS": "此通知不能代替轮询ISR计数。特别是，不能假定此通知中报告的计数值是会话生命周期的完整总计，因为它们可能在会话结束时已包装。"
    },
    {
      "indent": 10,
      "text": "The session to which the objects in this notification apply is identified by the fully qualified CP name and PCID that make up the table index. An instance of this notification will contain exactly one instance of each of its objects, and these objects will all belong to the same conceptual row of the appnIsInTable.",
      "zh-CHS": "此通知中的对象应用到的会话由构成表索引的完全限定CP名称和PCID标识。此通知的一个实例将只包含其每个对象的一个实例，并且这些对象都将属于appnIsInTable的同一概念行。"
    },
    {
      "indent": 10,
      "text": "Generation of this notification is controlled by the same object in the APPN MIB, appnIsInGlobeCtrAdminStatus, that controls whether the count objects themselves are being incremented.\"",
      "zh-CHS": "此通知的生成由APPN MIB中的同一对象appnIsInGlobeCtrAdminStatus控制，该对象控制计数对象本身是否递增。”"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapMIB 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnLocalTgOperStateChangeTrap NOTIFICATION-TYPE\n      OBJECTS  {\n                appnLocalTgTableChanges,\n                appnLocalTgOperational\n               }\n      STATUS current\n      DESCRIPTION\n          \"When it has been enabled, this notification makes it possible\n          for an APPN topology application to get asynchronous\n          notifications of local TG operational state changes,\n          and thus to reduce the frequency with which it polls\n          for these changes.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "This notification is sent whenever there is a change to the appnLocalTgOperational object in a row of the appnLocalTgTable. This notification is only sent for row creation if the row is created with a value of 'true' for appnLocalTgOperational. This notification is only sent for row deletion if the last value of appnLocalTgOperational was 'true'. In this case, the value of appnLocalTgOperational in the notification shall be 'false', since the deletion of a row indicates that the TG is no longer operational.",
      "zh-CHS": "每当appnLocalTgTable行中的appnLocalTgOperational对象发生更改时，就会发送此通知。如果为appnLocalTgOperational创建了值为“true”的行，则仅在创建行时才会发送此通知。仅当appnLocalTgOperational的最后一个值为“true”时，才会为行删除发送此通知。在这种情况下，通知中appnLocalTgOperational的值应为“false”，因为删除一行表示TG不再可操作。"
    },
    {
      "indent": 10,
      "text": "The notification is more than a simple 'poll me now' indication. It carries both a count of local TG topology changes, and the current operational state itself. The count of changes allows an application to detect lost notifications, either when polling or upon receiving a subsequent notification, at which point it knows it must retrieve the entire appnLocalTgTable again. This is the same count as used in the appnLocalCpCpStateChangeTrap. A lost notification could indicate a local TG CP-CP session state change or an operational state change.",
      "zh-CHS": "该通知不仅仅是一个简单的“立即轮询我”指示。它携带本地TG拓扑变化的计数和当前操作状态本身。更改计数允许应用程序在轮询时或收到后续通知时检测丢失的通知，此时它知道必须再次检索整个appnLocalTgTable。这与AppNLocalCPStateChangeTrap中使用的计数相同。丢失的通知可能表示本地TG CP-CP会话状态更改或操作状态更改。"
    },
    {
      "indent": 10,
      "text": "Generation of this notification is controlled by the appnTrapControl object.\"",
      "zh-CHS": "此通知的生成由AppntraControl对象控制。“"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnLocalTgCpCpChangeTrap NOTIFICATION-TYPE\n      OBJECTS  {\n                appnLocalTgTableChanges,\n                appnLocalTgCpCpSession\n               }\n      STATUS current\n      DESCRIPTION\n          \"When it has been enabled, this notification makes it possible",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "for an APPN topology application to get asynchronous notifications of local TG control-point to control-point (CP-CP) session state changes, and thus to reduce the frequency with which it polls for these changes.",
      "zh-CHS": "用于APPN拓扑应用程序获取本地TG控制点到控制点（CP-CP）会话状态更改的异步通知，从而降低其轮询这些更改的频率。"
    },
    {
      "indent": 10,
      "text": "This notification is sent whenever there is a change to the appnLocalTgCpCpSession object but NOT the appnLocalTgOperational object in a row of the appnLocalTgTable. This notification is never sent for appnLocalTgTable row creation or deletion.",
      "zh-CHS": "每当对appnLocalTgCpCpSession对象（而不是appnLocalTgOperational对象）进行更改时，就会发送此通知。永远不会为appnLocalTgTable行的创建或删除发送此通知。"
    },
    {
      "indent": 10,
      "text": "The notification is more than a simple 'poll me now' indication. It carries both a count of local TG topology changes, and the current CP-CP session state itself. The count of changes allows an application to detect lost notifications, either when polling or upon receiving a subsequent notification, at which point it knows it must retrieve the entire appnLocalTgTable again. This is the same count as used in the appnLocalTgOperStateChangeTrap. A lost notification could indicate a local TG CP-CP session state change or an operational state change.",
      "zh-CHS": "该通知不仅仅是一个简单的“立即轮询我”指示。它携带本地TG拓扑更改计数和当前CP-CP会话状态本身。更改计数允许应用程序在轮询时或收到后续通知时检测丢失的通知，此时它知道必须再次检索整个appnLocalTgTable。这与AppnLocalTGOperateStateChangeTrap中使用的计数相同。丢失的通知可能表示本地TG CP-CP会话状态更改或操作状态更改。"
    },
    {
      "indent": 10,
      "text": "Generation of this notification is controlled by the appnTrapControl object.\"",
      "zh-CHS": "此通知的生成由AppntraControl对象控制。“"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapMIB 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnPortOperStateChangeTrap NOTIFICATION-TYPE\n      OBJECTS  {\n                appnPortTableChanges,\n                appnPortOperState\n               }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "STATUS current DESCRIPTION \"When it has been enabled, this notification makes it possible for an APPN topology application to get asynchronous notifications of port operational state changes, and thus to reduce the frequency with which it polls for these changes. This notification is only sent when a appnPortOperState has transitioned to a value of 'active' or 'inactive'.",
      "zh-CHS": "状态当前描述“启用后，此通知使APPN拓扑应用程序可以获取端口操作状态更改的异步通知，从而降低轮询这些更改的频率。仅当AppnPortPerstate转换为“active”或“inactive”值时，才会发送此通知。"
    },
    {
      "indent": 10,
      "text": "This notification is sent whenever there is a appnPortOperState object transition to 'inactive' or 'active' state in the appnPortTable. This notification is only sent for row creation if the row is created with a value of 'active' for appnPortOperState. This notification is only sent for row deletion if the last value of appnPortOperState was 'active'. In this case, the value of appnPortOperState",
      "zh-CHS": "每当appnPortTable中的AppnPortPerstate对象转换为“非活动”或“活动”状态时，就会发送此通知。仅当使用appnPortOperState的“active”值创建行时，才会为行创建发送此通知。仅当AppnPortPerstate的最后一个值为“active”时，才会发送此通知以删除行。在本例中，appnPortOperState的值"
    },
    {
      "indent": 10,
      "text": "in the notification shall be 'inactive', since the deletion of a row indicates that the port is no longer active.",
      "zh-CHS": "在通知中应为“非活动”，因为删除一行表示端口不再活动。"
    },
    {
      "indent": 10,
      "text": "The notification is more than a simple 'poll me now' indication. It carries both a count of port table changes, and the operational state itself. The count of changes allows an application to detect lost notifications, either when polling or upon receiving a subsequent notification, at which point it knows it must retrieve the entire appnPortTable again.",
      "zh-CHS": "该通知不仅仅是一个简单的“立即轮询我”指示。它携带端口表更改计数和操作状态本身。更改计数允许应用程序在轮询时或收到后续通知时检测丢失的通知，此时它知道必须再次检索整个appnPortTable。"
    },
    {
      "indent": 10,
      "text": "Generation of this notification is controlled by the appnTrapControl object.\"",
      "zh-CHS": "此通知的生成由AppntraControl对象控制。“"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapMIB 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnLsOperStateChangeTrap NOTIFICATION-TYPE\n      OBJECTS  {\n                appnLsTableChanges,\n                appnLsOperState\n               }\n      STATUS current\n      DESCRIPTION\n          \"When it has been enabled, this notification makes it possible\n          for an APPN topology application to get asynchronous\n          notifications of link station operational state changes, and\n          thus to reduce the frequency with which it polls for these\n          changes.  This notification is only sent when a appnLsOperState\n          has transitioned to a value of 'active' or 'inactive'.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "This notification is sent whenever there is a appnLsOperState object transition to 'inactive' or 'active' state in the appnLsTable. This notification is only sent for row creation if the row is created with a value of 'active' for appnLsOperState. This notification is only sent for row deletion if the last value of appnLsOperState was 'active'. In this case, the value of appnLsOperState in the notification shall be 'inactive', since the deletion of a row indicates that the link station is no longer active.",
      "zh-CHS": "每当appnLsOperState对象转换到appnLsTable中的“非活动”或“活动”状态时，就会发送此通知。仅当appnLsOperState的行创建值为“active”时，才会为行创建发送此通知。仅当appnLsOperState的最后一个值为“active”时，才会为行删除发送此通知。在这种情况下，通知中appnLsOperState的值应为“非活动”，因为删除一行表示链路站不再活动。"
    },
    {
      "indent": 10,
      "text": "The notification is more than a simple 'poll me now' indication. It carries both a count of link station table changes, and the operational state itself. The count of changes allows an application to detect lost notifications, either when polling or upon receiving a subsequent notification, at which point it knows it must retrieve the entire appnLsTable again.",
      "zh-CHS": "该通知不仅仅是一个简单的“立即轮询我”指示。它携带链路站表更改的计数和操作状态本身。更改计数允许应用程序在轮询时或收到后续通知时检测丢失的通知，此时它知道必须再次检索整个appnLsTable。"
    },
    {
      "indent": 10,
      "text": "Generation of this notification is controlled by the appnTrapControl object.\"",
      "zh-CHS": "此通知的生成由AppntraControl对象控制。“"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapMIB 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "dlurDlusStateChangeTrap NOTIFICATION-TYPE\n      OBJECTS  {\n                dlurDlusTableChanges,\n                dlurDlusSessnStatus\n               }\n      STATUS current\n      DESCRIPTION\n          \"When it has been enabled, this notification makes it possible\n          for an APPN topology application to get asynchronous\n          notifications of DLUR-DLUS session changes, and thus to reduce\n          the frequency with which it polls for these changes.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "This notification is sent whenever there is a dlurDlusSessnStatus object transition to 'inactive' or 'active' state in the dlurDlusTable. This notification is only sent for row creation if the row is created with a value of 'active' for dlurDlusSessnStatus. This notification is only sent for row deletion if the last value of dlurDlusSessnStatus was 'active'. In this case, the value of dlurDlusSessnStatus in the notification shall be 'inactive', since the deletion of a row indicates that the session is no longer active.",
      "zh-CHS": "每当DludLussessnSStatus对象在DludLustable中转换为“非活动”或“活动”状态时，就会发送此通知。仅当使用DLURDLussessnSNSSTATUS的“active”值创建行时，才会为行创建发送此通知。仅当DlUrdlusSessnSnSStatus的最后一个值为“active”时，才会为行删除发送此通知。在这种情况下，通知中dlurdlussessnsstatus的值应为“不活动”，因为删除一行表示会话不再活动。"
    },
    {
      "indent": 10,
      "text": "The notification is more than a simple 'poll me now' indication. It carries both a count of DLUR-DLUS table changes, and the session status itself. The count of changes allows an application to detect lost notifications, either when polling or upon receiving a subsequent notification, at which point it knows it must retrieve the entire dlurDlusTable again.",
      "zh-CHS": "该通知不仅仅是一个简单的“立即轮询我”指示。它携带DLUR-DLUS表更改计数和会话状态本身。更改计数允许应用程序在轮询时或收到后续通知时检测丢失的通知，此时它知道必须再次检索整个dlurDlusTable。"
    },
    {
      "indent": 10,
      "text": "Generation of this notification is controlled by the appnTrapControl object.\"",
      "zh-CHS": "此通知的生成由AppntraControl对象控制。“"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapMIB 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- *********************************************************************\n-- Supporting Objects\n-- *********************************************************************",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnTrapObjects              OBJECT IDENTIFIER ::= { appnObjects 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnTrapControl OBJECT-TYPE",
      "zh-CHS": "appnTrapControl对象类型"
    },
    {
      "indent": 6,
      "text": "SYNTAX BITS { appnLocalTgOperStateChangeTrap(0), appnLocalTgCpCpChangeTrap(1), appnPortOperStateChangeTrap(2),",
      "zh-CHS": "语法位{appnLocalTgOperStateChangeTrap（0）、AppnLocalTGCPCpcchangeTrap（1）、AppnPortPerstateChangeTrap（2），"
    },
    {
      "indent": 6,
      "text": " appnLsOperStateChangeTrap(3), dlurDlusStateChangeTrap(4) -- add other notification types here } MAX-ACCESS read-write STATUS current DESCRIPTION \"An object to turn APPN notification generation on and off. Setting a notification type's bit to 1 enables generation of notifications of that type, subject to further filtering resulting from entries in the snmpNotificationMIB. Setting this bit to 0 disables generation of notifications of that type.",
      "zh-CHS": "appnLsOperStateChangeTrap（3），DludlusStateChangeTrap（4）--在此处添加其他通知类型}MAX-ACCESS读写状态当前说明“用于打开和关闭APPN通知生成的对象。将通知类型的位设置为1可以生成该类型的通知，并根据snmpNotificationMIB中的条目进行进一步筛选。将此位设置为0将禁用生成该类型的通知。"
    },
    {
      "indent": 10,
      "text": "Note that generation of the appnIsrAccountingDataTrap is controlled by the appnIsInGlobeCtrAdminStatus object in the APPN MIB: if counts of intermediate session traffic are being kept at all, then the notification is also enabled.\"",
      "zh-CHS": "请注意，appnIsrAccountingDataTrap的生成由APPN MIB中的appnIsInGlobeCtrAdminStatus对象控制：如果中间会话流量的计数被保留，则通知也被启用。”"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnLocalTgTableChanges OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of the number of times a row in the appnLocalTgTable has changed status since the APPN node was last reinitialized. This counter is incremented whenever a condition is detected that would cause a appnLocalTgOperStateChangeTrap or appnLocalTgCpCpChangeTrap notification to be sent, whether or not those notifications are enabled.\"",
      "zh-CHS": "appnLocalTgTableChanges对象类型语法计数器32 MAX-ACCESS只读状态当前说明“自上次重新初始化APPN节点以来，appnLocalTgTable中的行更改状态的次数计数。无论是否启用这些通知，只要检测到可能导致发送AppnLocalTGOperateChangeTrap或appnLocalTgCpCpChangeTrap通知的条件，此计数器就会递增。”"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnPortTableChanges OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of the number of times a row in the appnPortTable has changed status since the APPN node was last reinitialized. This counter is incremented whenever a condition is detected that would cause a appnPortOperStateChangeTrap notification to be sent, whether or not this notification is enabled.\"",
      "zh-CHS": "appnPortTableChanges对象类型语法计数器32 MAX-ACCESS只读状态当前说明“自上次重新初始化APPN节点以来，appnPortTable中的行状态已更改的次数计数。无论是否启用此通知，只要检测到可能导致发送appnPortOperStateChangeTrap通知的条件，此计数器就会递增。”"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnLsTableChanges OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of the number of times a row in the appnLsTable has changed status since the APPN node was last reinitialized. This counter is incremented whenever a condition is detected that would cause a appnLsOperStateChangeTrap notification to be sent, whether or not this notification is enabled.\"",
      "zh-CHS": "appnLsTableChanges对象类型语法计数器32 MAX-ACCESS只读状态当前说明“自上次重新初始化APPN节点以来，appnLsTable中的行更改状态的次数计数。无论是否启用此通知，只要检测到可能导致发送appnLsOperStateChangeTrap通知的条件，此计数器就会递增。”"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "dlurDlusTableChanges OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of the number of times a row in the dlurDlusTable has changed status since the APPN node was last reinitialized. This counter is incremented whenever a condition is detected that would cause a dlurDlusStateChangeTrap notification to be sent, whether or not this notification is enabled.\"",
      "zh-CHS": "dlurDlusTableChanges对象类型语法计数器32 MAX-ACCESS只读状态当前说明“自上次重新初始化APPN节点以来，DludLustable中的行状态已更改的次数计数。无论是否启用此通知，只要检测到可能导致发送dlurDlusStateChangeTrap通知的条件，此计数器就会递增。”"
    },
    {
      "indent": 6,
      "text": "::= { appnTrapObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- *********************************************************************\n-- Conformance information\n-- *********************************************************************",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Tie into the conformance structure in the APPN MIB:\n-- appnConformance       OBJECT IDENTIFIER ::= {appnMIB 3 }\n--\n-- appnCompliances       OBJECT IDENTIFIER ::= {appnConformance 1 }\n-- appnGroups            OBJECT IDENTIFIER ::= {appnConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Compliance statement appnTrapMibCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for the SNMP entities that implement the APPN-TRAP-MIB.\"",
      "zh-CHS": "--符合性声明APPNTRAPMIB符合性模块-符合性状态当前描述“实现APPN-TRAP-MIB的SNMP实体的符合性声明。”"
    },
    {
      "indent": 7,
      "text": "MODULE -- this module",
      "zh-CHS": "模块——这个模块"
    },
    {
      "indent": 0,
      "text": "-- Conditionally mandatory groups GROUP appnTrapMibIsrNotifGroup DESCRIPTION",
      "zh-CHS": "--条件强制组组AppntrapMibisNotifGroup说明"
    },
    {
      "indent": 15,
      "text": "\"This group is mandatory for APPN nodes supporting reporting of final ISR counter values via notifications.\"",
      "zh-CHS": "“对于支持通过通知报告最终ISR计数器值的APPN节点，此组是必需的。”"
    },
    {
      "indent": 11,
      "text": "GROUP appnTrapMibTopoConfGroup DESCRIPTION \"This group is mandatory for APPN nodes supporting polling reduction for local topology.\"",
      "zh-CHS": "GROUP appnTrapMibTopoConfGroup DESCRIPTION“此组对于支持本地拓扑轮询减少的APPN节点是必需的。”"
    },
    {
      "indent": 11,
      "text": "GROUP appnTrapMibTopoNotifGroup DESCRIPTION \"This group is mandatory for APPN nodes supporting polling reduction for local topology.\"",
      "zh-CHS": "GROUP appnTrapMibTopoNotifGroup DESCRIPTION“此组对于支持本地拓扑轮询减少的APPN节点是必需的。”"
    },
    {
      "indent": 11,
      "text": "GROUP appnTrapMibDlurConfGroup DESCRIPTION \"This group is mandatory for APPN nodes supporting polling reduction for the dlurDlusTable.\"",
      "zh-CHS": "GROUP appnTrapMibDlurConfGroup DESCRIPTION“此组对于支持dlurDlusTable轮询减少的APPN节点是必需的。”"
    },
    {
      "indent": 11,
      "text": "GROUP appnTrapMibDlurNotifGroup DESCRIPTION \"This group is mandatory for APPN nodes supporting polling reduction for the dlurDlusTable.\"",
      "zh-CHS": "GROUP AppnTrapMibDllurnotifGroup DESCRIPTION“此组对于支持dlurDlusTable轮询减少的APPN节点是必需的。”"
    },
    {
      "indent": 11,
      "text": "OBJECT appnTrapControl MIN-ACCESS read-only DESCRIPTION \"An agent is not required to support a set to this object.\"",
      "zh-CHS": "OBJECT AppntraControl MIN-ACCESS只读说明“不需要代理来支持此对象的集合。”"
    },
    {
      "indent": 7,
      "text": "::= {appnCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Units of conformance\nappnTrapMibIsrNotifGroup    NOTIFICATION-GROUP\n        NOTIFICATIONS {\n                       appnIsrAccountingDataTrap\n                      }\n        STATUS  current\n        DESCRIPTION\n            \"A notification for reporting the final values of the\n            APPN MIB's ISR counters.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "::= { appnGroups 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnTrapMibTopoConfGroup OBJECT-GROUP OBJECTS { appnTrapControl, appnLocalTgTableChanges, appnPortTableChanges,",
      "zh-CHS": "appnTrapMibTopoConfGroup对象组对象{appnTrapControl，AppNrolAltTableChanges，appnPortTableChanges，"
    },
    {
      "indent": 8,
      "text": " appnLsTableChanges } STATUS current DESCRIPTION \"A collection of objects for reducing the polling associated with the local topology tables in the APPN MIB. Nodes that implement this group SHALL also implement the appnTrapMibTopoNotifGroup.\"",
      "zh-CHS": "appnLsTableChanges}STATUS current DESCRIPTION“用于减少与APPN MIB中的本地拓扑表关联的轮询的对象集合。实现此组的节点还应实现APPNTRAPMIBTOPONOTOBOTIFGROUP。”"
    },
    {
      "indent": 8,
      "text": "::= { appnGroups 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnTrapMibTopoNotifGroup NOTIFICATION-GROUP NOTIFICATIONS { appnLocalTgOperStateChangeTrap, appnLocalTgCpCpChangeTrap, appnPortOperStateChangeTrap, appnLsOperStateChangeTrap",
      "zh-CHS": "APPNTRAPMIBTOPNOTIFGROUP NOTIFGROUP NOTIFGROUP NOTIFGROUP NOTIFGROUP{APPNLOCALTGOPERSTATECHANGETP，APPNLOCALTGCPCPCHANGETP，APPNPORTOPERSTATECHANGETP，APPNLSOPERSTATECHANGETP"
    },
    {
      "indent": 8,
      "text": " } STATUS current DESCRIPTION \"A collection of notifications for reducing the polling associated with the local topology tables in the APPN MIB. Nodes that implement this group SHALL also implement the appnTrapMibTopoConfGroup.\"",
      "zh-CHS": "}STATUS current DESCRIPTION“用于减少与APPN MIB中的本地拓扑表关联的轮询的通知集合。实现此组的节点还应实现appnTrapMibTopoConfGroup。”"
    },
    {
      "indent": 8,
      "text": "::= { appnGroups 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnTrapMibDlurConfGroup  OBJECT-GROUP\n        OBJECTS  {\n                  appnTrapControl,\n                  dlurDlusTableChanges\n                 }\n        STATUS  current\n        DESCRIPTION\n            \"A collection of objects for reducing the polling\n            associated with the dlurDlusTable in the DLUR\n            MIB.  Nodes that implement this group SHALL also\n            implement the appnTrapMibDlurNotifGroup.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "::= { appnGroups 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "appnTrapMibDlurNotifGroup    NOTIFICATION-GROUP\n        NOTIFICATIONS {\n                       dlurDlusStateChangeTrap\n                      }\n        STATUS  current\n        DESCRIPTION",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "\"A notification for reducing the polling associated with the dlurDlusTable in the DLUR MIB. Nodes that implement this group SHALL also implement the appnTrapMibDlurConfGroup.\"",
      "zh-CHS": "“用于减少与DLUR MIB中的DludLustable关联的轮询的通知。实现此组的节点还应实现AppnTrapMibDlucOnfGroup。”"
    },
    {
      "indent": 8,
      "text": "::= { appnGroups 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Certain management information defined in this MIB may be considered sensitive in some network environments. Therefore, authentication of received SNMP requests and controlled access to management information SHOULD be employed in such environments. An authentication protocol is defined in [12]. A protocol for access control is defined in [15].",
      "zh-CHS": "在某些网络环境中，此MIB中定义的某些管理信息可能被视为敏感信息。因此，在这样的环境中，应该对接收到的SNMP请求进行身份验证，并控制对管理信息的访问。[12]中定义了认证协议。[15]中定义了访问控制协议。"
    },
    {
      "indent": 3,
      "text": "None of the read-only objects in the APPN TRAP MIB reports a password, user data, or anything else that is particularly sensitive. Some enterprises view their network configuration itself, as well as information about network usage and performance, as corporate assets; such enterprises may wish to restrict SNMP access to most of the objects in the MIB.",
      "zh-CHS": "APPN TRAP MIB中的只读对象都不会报告密码、用户数据或任何其他特别敏感的内容。一些企业将其网络配置本身以及有关网络使用和性能的信息视为企业资产；此类企业可能希望限制对MIB中大多数对象的SNMP访问。"
    },
    {
      "indent": 3,
      "text": "There is one read-write object in the APPN TRAP MIB, appnTrapControl. This object controls the generation of the notifications defined in the APPN TRAP MIB.",
      "zh-CHS": "APPN陷阱MIB中有一个读写对象APPNTRAP CONTROL。此对象控制APPN陷阱MIB中定义的通知的生成。"
    },
    {
      "indent": 0,
      "text": "6. Intellectual Property",
      "section_title": true,
      "zh-CHS": "6. 知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards- related documentation can be found in BCP-11 [16]. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF Secretariat.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何努力来确定任何此类权利。关于IETF在标准跟踪和标准相关文件中权利的程序信息，请参见BCP-11[16]。可从IETF秘书处获得可供发布的权利声明副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涉及实施本标准所需技术的专有权利。请将信息发送给IETF执行董事。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "This MIB module is the product of the IETF SNA NAU MIB WG and the AIW APPN/HPR MIBs SIG.",
      "zh-CHS": "该MIB模块是IETF SNA NAU MIB WG和AIW APPN/HPR MIBs SIG的产品。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing SNMP Management Frameworks\", RFC 2271, Cabletron Systems, Inc., BMC Software, Inc., IBM T. J. Watson Research, January 1998.",
      "zh-CHS": "[1] Harrington，D.，Presuhn，R.，和B.Wijnen，“描述SNMP管理框架的体系结构”，RFC 2271，Cabletron Systems，Inc.，BMC Software，Inc.，IBM T.J.Watson Research，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[2] Rose, M., and K. McCloghrie, \"Structure and Identification of Management Information for TCP/IP-based Internets\", STD 16, RFC 1155, May 1990.",
      "zh-CHS": "[2] Rose，M.和K.McCloghrie，“基于TCP/IP的互联网管理信息的结构和识别”，STD 16，RFC 1155，1990年5月。"
    },
    {
      "indent": 3,
      "text": "[3] Rose, M., and K. McCloghrie, \"Concise MIB Definitions\", STD 16, RFC 1212, March 1991.",
      "zh-CHS": "[3] Rose，M.和K.McCloghrie，“简明MIB定义”，STD 16，RFC 1212，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Rose, M., \"A Convention for Defining Traps for use with the SNMP\", RFC 1215, March 1991.",
      "zh-CHS": "[4] Rose，M.“定义用于SNMP的陷阱的约定”，RFC1215，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[5] Case, J., McCloghrie, K., Rose, M., and S. Waldbusser, \"Structure of Management Information for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1902, January 1996.",
      "zh-CHS": "[5] Case，J.，McCloghrie，K.，Rose，M.，和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的管理信息结构”，RFC 1902，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Case, J., McCloghrie, K., Rose, M., and S. Waldbusser, \"Textual Conventions for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1903, January 1996.",
      "zh-CHS": "[6] Case，J.，McCloghrie，K.，Rose，M.，和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的文本约定”，RFC 1903，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[7] Case, J., McCloghrie, K., Rose, M., and S. Waldbusser, \"Conformance Statements for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1904, January 1996.",
      "zh-CHS": "[7] Case，J.，McCloghrie，K.，Rose，M.，和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的一致性声明”，RFC 1904，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[8] Case, J., Fedor, M., Schoffstall, M., and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "zh-CHS": "[8] Case，J.，Fedor，M.，Schoffstall，M.，和J.Davin，“简单网络管理协议”，STD 15，RFC 1157，1990年5月。"
    },
    {
      "indent": 3,
      "text": "[9] Case, J., McCloghrie, K., Rose, M., and S. Waldbusser, \"Introduction to Community-based SNMPv2\", RFC 1901, January 1996.",
      "zh-CHS": "[9] Case，J.，McCloghrie，K.，Rose，M.，和S.Waldbusser，“基于社区的SNMPv2简介”，RFC 19011996年1月。"
    },
    {
      "indent": 3,
      "text": "[10] Case, J., McCloghrie, K., Rose, M., and S. Waldbusser, \"Transport Mappings for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1906, January 1996.",
      "zh-CHS": "[10] Case，J.，McCloghrie，K.，Rose，M.，和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的传输映射”，RFC 1906，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[11] Case, J., Harrington D., Presuhn R., and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2272, January 1998.",
      "zh-CHS": "[11] Case，J.，Harrington D.，Presohn R.，和B.Wijnen，“简单网络管理协议（SNMP）的消息处理和调度”，RFC 22721998年1月。"
    },
    {
      "indent": 3,
      "text": "[12] Blumenthal, U., and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2274, January 1998.",
      "zh-CHS": "[12] Blumenthal，U.和B.Wijnen，“简单网络管理协议（SNMPv3）第3版的基于用户的安全模型（USM）”，RFC 22741998年1月。"
    },
    {
      "indent": 3,
      "text": "[13] Case, J., McCloghrie, K., Rose, M., and S. Waldbusser, \"Protocol Operations for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1905, January 1996.",
      "zh-CHS": "[13] Case，J.，McCloghrie，K.，Rose，M.，和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的协议操作”，RFC 1905，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[14] Levi, D., Meyer, P., and B. Stewart, \"SNMPv3 Applications\", RFC 2273, January 1998.",
      "zh-CHS": "[14] Levi，D.，Meyer，P.和B.Stewart，“SNMPv3应用”，RFC 22731998年1月。"
    },
    {
      "indent": 3,
      "text": "[15] Wijnen, B., Presuhn, R., and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", RFC 2275, January 1998",
      "zh-CHS": "[15] Wijnen，B.，Presuhn，R.，和K.McCloghrie，“用于简单网络管理协议（SNMP）的基于视图的访问控制模型（VACM）”，RFC 22751998年1月"
    },
    {
      "indent": 3,
      "text": "[16] Hovey, R., and S. Bradner, \"The Organizations Involved in the IETF Standards Process\", BCP 11, RFC 2028, October 1996.",
      "zh-CHS": "[16] Hovey，R.和S.Bradner，“参与IETF标准过程的组织”，BCP 11，RFC 2028，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[17] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[17] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[18] Clouston, B., and B. Moore, \"Definition of Managed Objects for APPN\", RFC 2455, November 1998.",
      "zh-CHS": "[18] Clouston，B.和B.Moore，“APPN管理对象的定义”，RFC 2455，1998年11月。"
    },
    {
      "indent": 3,
      "text": "[19] Clouston, B., and B. Moore, \"Definitions of Managed Objects for DLUR\", RFC 2232, November 1997.",
      "zh-CHS": "[19] Clouston，B.和B.Moore，“DLUR管理对象的定义”，RFC 2232，1997年11月。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "9. 作者地址"
    },
    {
      "indent": 3,
      "text": "Bob Clouston Cisco Systems 7025 Kit Creek Road P.O. Box 14987 Research Triangle Park, NC 27709, USA",
      "zh-CHS": "Bob Clouston Cisco Systems 7025 Kit Creek Road美国北卡罗来纳州三角研究公园14987号邮政信箱，邮编27709"
    },
    {
      "indent": 3,
      "text": "Phone: +1 919 472 2333\nEMail: clouston@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Robert Moore Dept. BRQA/Bldg. 501/G114 IBM Corporation P.O.Box 12195 3039 Cornwallis Research Triangle Park, NC 27709, USA",
      "zh-CHS": "美国北卡罗来纳州康沃利斯研究三角公园12195 3039号IBM公司信箱501/G114号楼BRQA/BRQA部门"
    },
    {
      "indent": 3,
      "text": "Phone: +1 919 254 4436\nEMail: remoore@us.ibm.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "10. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1998年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    }
  ]
}