{
  "title": {
    "text": "RFC 2805:  Media Gateway Control Protocol Architecture and Requirements ",
    "zh-CHS": "RFC 2805"
  },
  "number": 2805,
  "created_at": "2021-10-24 14:48:47.421153+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          N. Greene\nRequest for Comments: 2805                               Nortel Networks\nCategory: Informational                                       M. Ramalho\n                                                           Cisco Systems\n                                                                B. Rosen\n                                                                 Marconi\n                                                              April 2000",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Media Gateway Control Protocol Architecture and Requirements",
      "zh-CHS": "媒体网关控制协议体系结构和要求"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes protocol requirements for the Media Gateway Control Protocol between a Media Gateway Controller and a Media Gateway.",
      "zh-CHS": "本文档描述了媒体网关控制器和媒体网关之间的媒体网关控制协议的协议要求。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction ..............................................  3\n2.  Terminology ...............................................  3\n3.  Definitions ...............................................  3\n4.  Specific functions assumed within the MG ..................  5\n5.  Per-Call Requirements .....................................  6\n   5.1.  Resource Reservation .................................  6\n   5.2.  Connection Requirements ..............................  7\n   5.3.  Media Transformations ................................  8\n   5.4.  Signal/Event Processing and Scripting ................  9\n   5.5.  QoS/CoS .............................................. 10\n   5.6.  Test Support ......................................... 11\n   5.7.  Accounting ........................................... 11\n   5.8.  Signalling Control ................................... 11\n6.  Resource Control .......................................... 12\n   6.1.  Resource Status Management ........................... 12\n   6.2.  Resource Assignment .................................. 13\n7.  Operational/Management Requirements ....................... 13\n   7.1.  Assurance of Control/Connectivity .................... 13\n   7.2.  Error Control ........................................ 14\n   7.3.  MIB Requirements ..................................... 15\n8.  General Protocol Requirements ............................. 15\n   8.1.  MG-MGC Association Requirements ...................... 16\n   8.2.  Performance Requirements ............................. 17\n9.  Transport ................................................. 17\n   9.1.  Assumptions made for underlying network .............. 17\n   9.2.  Transport Requirements ............................... 18\n10.  Security Requirements .................................... 18\n11.  Requirements specific to particular bearer types ......... 19\n   11.1.  Media-specific Bearer types ......................... 20\n      11.1.1.  Requirements for TDM PSTN (Circuit) ............ 20\n      11.1.2.  Packet Bearer type ............................. 22\n      11.1.3.  Bearer type requirements for ATM ............... 23\n   11.2.  Application-Specific Requirements ................... 26\n      11.2.1.  Trunking Gateway ............................... 26\n      11.2.2.  Access Gateway ................................. 27\n      11.2.3.  Trunking/Access Gateway with fax ports ......... 27\n      11.2.4.  Trunking/Access Gateway with text telephone .... 28\n      11.2.5.  Network Access Server .......................... 29\n      11.2.6.  Restricted Capability Gateway .................. 30\n      11.2.7.  Multimedia Gateway ............................. 31\n      11.2.8.  Audio Resource Function ........................ 32\n      11.2.9. Multipoint Control Units ........................ 42\n12.  References ............................................... 43\n13.  Acknowledgements ......................................... 43\n14.  Authors' Addresses ....................................... 44\n15.  Full Copyright Statement ................................. 45",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document describes requirements to be placed on the Media Gateway Control Protocol. When the word protocol is used on its own in this document it implicitly means the Media Gateway Control Protocol.",
      "zh-CHS": "本文档描述了媒体网关控制协议的要求。当本文档中单独使用“协议”一词时，它暗指媒体网关控制协议。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in RFC 2119 [1] and indicate requirement levels for the protocol.",
      "zh-CHS": "在本文件中，关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[1]中所述进行解释，并表示协议的要求级别。"
    },
    {
      "indent": 0,
      "text": "3. Definitions",
      "section_title": true,
      "zh-CHS": "3. 定义"
    },
    {
      "indent": 3,
      "text": "* Connection",
      "zh-CHS": "* 联系"
    },
    {
      "indent": 3,
      "text": "Under the control of a Media Gateway Controller (MGC), the Media Gateway (MG) realizes connections. In this document, connections are associations of resources hosted by the MG. They typically involve two terminations, but may involve more.",
      "zh-CHS": "在媒体网关控制器（MGC）的控制下，媒体网关（MG）实现连接。在本文档中，连接是MG托管的资源的关联。它们通常涉及两个终端，但可能涉及更多终端。"
    },
    {
      "indent": 3,
      "text": "* Line or Loop",
      "zh-CHS": "* 线或环"
    },
    {
      "indent": 3,
      "text": "An analogue or digital access connection from a user terminal which carries user media content and telephony access signalling (DP, DTMF, BRI, proprietary business set).",
      "zh-CHS": "来自用户终端的模拟或数字接入连接，承载用户媒体内容和电话接入信令（DP、DTMF、BRI、专有业务集）。"
    },
    {
      "indent": 3,
      "text": "* Media Gateway (MG) function",
      "zh-CHS": "* 媒体网关（MG）功能"
    },
    {
      "indent": 3,
      "text": "A Media Gateway (MG) function provides the media mapping and/or transcoding functions between potentially dissimilar networks, one of which is presumed to be a packet, frame or cell network. For example, an MG might terminate switched circuit network (SCN) facilities (trunks, loops), packetize the media stream, if it is not already packetized, and deliver packetized traffic to a packet network. It would perform these functions in the reverse order for media streams flowing from the packet network to the SCN.",
      "zh-CHS": "媒体网关（MG）功能提供潜在不同网络之间的媒体映射和/或转码功能，其中一个网络被假定为分组、帧或小区网络。例如，MG可能会终止交换电路网络（SCN）设施（中继线、环路），将媒体流打包（如果尚未打包），并将打包的流量传送到分组网络。对于从分组网络流向SCN的媒体流，它将以相反的顺序执行这些功能。"
    },
    {
      "indent": 3,
      "text": "Media Gateways are not limited to SCN <-> packet/frame/cell functions: A conference bridge with all packet interfaces could be an MG, as well as an (IVR) interactive voice recognition unit, an audio resource function, or a voice recognition system with a cell interface.",
      "zh-CHS": "媒体网关不限于SCN<->分组/帧/小区功能：具有所有分组接口的会议网桥可以是MG，也可以是（IVR）交互式语音识别单元、音频资源功能或具有小区接口的语音识别系统。"
    },
    {
      "indent": 3,
      "text": "* Media Gateway unit (MG-unit)",
      "zh-CHS": "* 媒体网关单元（MG单元）"
    },
    {
      "indent": 3,
      "text": "An MG-unit is a physical entity that contains an MG function and may also contain other functions, e.g. an SG function.",
      "zh-CHS": "MG单元是包含MG功能的物理实体，也可能包含其他功能，例如SG功能。"
    },
    {
      "indent": 3,
      "text": "* Media Gateway Controller (MGC) function",
      "zh-CHS": "* 媒体网关控制器（MGC）功能"
    },
    {
      "indent": 3,
      "text": "A Media Gateway Controller (MGC) function controls a MG.",
      "zh-CHS": "媒体网关控制器（MGC）功能控制媒体网关。"
    },
    {
      "indent": 3,
      "text": "* Media Resource",
      "zh-CHS": "* 媒体资源"
    },
    {
      "indent": 3,
      "text": "Examples of media resources are codecs, announcements, tones, and modems, interactive voice response (IVR) units, bridges, etc.",
      "zh-CHS": "媒体资源的示例包括编解码器、公告、铃声和调制解调器、交互式语音应答（IVR）单元、网桥等。"
    },
    {
      "indent": 3,
      "text": "* Signaling Gateway (SG) function",
      "zh-CHS": "* 信令网关（SG）功能"
    },
    {
      "indent": 3,
      "text": "An SG function receives/sends SCN native signalling at the edge of a data network. For example the SG function may relay, translate or terminate SS7 signaling in an SS7-Internet Gateway. The SG function may also be co-resident with the MG function to process SCN signalling associated with line or trunk terminations controlled by the MG, such as the \"D\" channel of an ISDN PRI trunk.",
      "zh-CHS": "SG功能在数据网络边缘接收/发送SCN本机信令。例如，SG功能可以在SS7因特网网关中中继、转换或终止SS7信令。SG功能还可以与MG功能共存，以处理与MG控制的线路或中继终端相关联的SCN信令，例如ISDN PRI中继的“D”信道。"
    },
    {
      "indent": 3,
      "text": "* Termination",
      "zh-CHS": "* 结束"
    },
    {
      "indent": 3,
      "text": "A termination is a point of entry and/or exit of media flows relative to the MG. When an MG is asked to connect two or more terminations, it understands how the flows entering and leaving each termination are related to each other.",
      "zh-CHS": "终端是媒体流相对于MG的入口和/或出口点。当MG被要求连接两个或多个终端时，它了解进入和离开每个终端的流是如何相互关联的。"
    },
    {
      "indent": 3,
      "text": "Terminations are, for instance, DS0's, ATM VCs and RTP ports. Another word for this is bearer point.",
      "zh-CHS": "例如，终端是DS0、ATM VCs和RTP端口。另一个词是承载点。"
    },
    {
      "indent": 3,
      "text": "* Trunk",
      "zh-CHS": "* 大旅行箱"
    },
    {
      "indent": 3,
      "text": "An analog or digital connection from a circuit switch which carries user media content and may carry telephony signalling (MF, R2, etc.). Digital trunks may be transported and may appear at the Media Gateway as channels within a framed bit stream, or as an ATM cell stream. Trunks are typically provisioned in groups, each member of which provides equivalent routing and service.",
      "zh-CHS": "来自电路交换机的模拟或数字连接，它承载用户媒体内容，并可能承载电话信号（MF、R2等）。数字中继可以被传输，并且可以作为帧比特流中的信道或ATM信元流出现在媒体网关上。中继通常以组的形式提供，组中的每个成员提供等效的路由和服务。"
    },
    {
      "indent": 3,
      "text": "* Type of Bearer",
      "zh-CHS": "* 持票人类型"
    },
    {
      "indent": 3,
      "text": "A Type of Bearer definition provides the detailed requirements for its particular application/bearer type. A particular class of Media Gateway, for example, would support a particular set of Bearer types.",
      "zh-CHS": "承载类型定义提供了其特定应用/承载类型的详细要求。例如，一类特定的媒体网关将支持一组特定的承载类型。"
    },
    {
      "indent": 0,
      "text": "4. Specific functions assumed within the MG",
      "section_title": true,
      "zh-CHS": "4. MG中承担的特定功能"
    },
    {
      "indent": 3,
      "text": "This section provides an environment for the definition of the general Media Gateway Control Protocol requirements.",
      "zh-CHS": "本节提供了定义一般媒体网关控制协议要求的环境。"
    },
    {
      "indent": 3,
      "text": "MGs can be architected in many different ways depending where the media conversions and transcoding (if required) are performed, the level of programmability of resources, how conferences are supported, and how associated signalling is treated. The functions assumed to be within the MG must not be biased towards a particular architecture.",
      "zh-CHS": "根据媒体转换和转码（如果需要）的执行位置、资源的可编程性级别、会议的支持方式以及相关信令的处理方式，MGs可以以多种不同的方式进行架构。假定在MG内的功能不得偏向于特定架构。"
    },
    {
      "indent": 3,
      "text": "For instance, announcements in a MG could be provided by media resources or by the bearer point resource or termination itself. Further, this difference must not be visible to MGC: The MGC must be able to issue the identical request to two different implementations and achieve the identical functionality.",
      "zh-CHS": "例如，MG中的公告可以由媒体资源或承载点资源或终端本身提供。此外，MGC不能看到这种差异：MGC必须能够向两个不同的实现发出相同的请求，并实现相同的功能。"
    },
    {
      "indent": 3,
      "text": "Depending on the application of the MG (e.g., trunking, residential), some functions listed below will be more prominent than others, and in some cases, functions may even disappear.",
      "zh-CHS": "根据MG的应用（例如中继、住宅），以下列出的一些功能将比其他功能更突出，在某些情况下，功能甚至可能消失。"
    },
    {
      "indent": 3,
      "text": "Although media adaptation is the essence of the MG, it is not necessary for it to be involved every time. An MG may join two terminations/resources of the same type (i.e., the MG behaves as a switch). The required media conversion depends on the media type supported by the resources being joined together.",
      "zh-CHS": "虽然媒体改编是MG的精髓，但并非每次都需要它参与。MG可以连接相同类型的两个终端/资源（即MG充当交换机）。所需的媒体转换取决于连接在一起的资源所支持的媒体类型。"
    },
    {
      "indent": 3,
      "text": "In addition to media adaptation function, resources have a number of unique properties, for instance:",
      "zh-CHS": "除了媒体适配功能外，资源还具有许多独特的属性，例如："
    },
    {
      "indent": 3,
      "text": "* certain types of resources have associated signalling capabilities (e.g., PRI signalling, DTMF),",
      "zh-CHS": "* 某些类型的资源具有相关的信令能力（例如，PRI信令、DTMF），"
    },
    {
      "indent": 3,
      "text": "* some resources perform maintenance functions (e.g., continuity tests),",
      "zh-CHS": "* 一些资源执行维护功能（例如，连续性测试），"
    },
    {
      "indent": 3,
      "text": "* the MGC needs to know the state changes of resources (e.g., a trunk group going out of service),",
      "zh-CHS": "* MGC需要了解资源的状态变化（例如，主干组停止服务），"
    },
    {
      "indent": 3,
      "text": "* the MG retains some control over the allocation and control of some resources (e.g., resource name space: RTP port numbers).",
      "zh-CHS": "* MG保留对某些资源的分配和控制的一些控制（例如，资源名称空间：RTP端口号）。"
    },
    {
      "indent": 3,
      "text": "Therefore, an MG realizes point-to-point connections and conferences, and supports several resource functions. These functions include media conversion, resource allocation and management, and event notifications. Handling termination associated signalling is either done using event notifications, or is handled by the signalling backhaul part of a MG-unit (i.e. NOT directly handled by the MG).",
      "zh-CHS": "因此，MG实现点对点连接和会议，并支持多种资源功能。这些功能包括媒体转换、资源分配和管理以及事件通知。处理与终端相关的信令可以使用事件通知完成，也可以由MG单元的信令回程部分处理（即，不直接由MG处理）。"
    },
    {
      "indent": 3,
      "text": "MGs must also support some level of system related functions, such as establishing and maintaining some kind of MG-MGC association. This is essential for MGC redundancy, fail-over and resource sharing.",
      "zh-CHS": "MGs还必须支持某些级别的系统相关功能，如建立和维护某种MG-MGC关联。这对于MGC冗余、故障转移和资源共享至关重要。"
    },
    {
      "indent": 3,
      "text": "Therefore, an MG is assumed to contain these functions:",
      "zh-CHS": "因此，假设MG包含以下功能："
    },
    {
      "indent": 3,
      "text": "* Reservation and release, of resources",
      "zh-CHS": "* 资源的保留和释放"
    },
    {
      "indent": 3,
      "text": "* Ability to provide state of resources",
      "zh-CHS": "* 提供资源状态的能力"
    },
    {
      "indent": 3,
      "text": "* Maintenance of resources - It must be possible to make maintenance operations independent of other termination functions, for instance, some maintenance states should not affect the resources associated with that resource . Examples of maintenance functions are loopbacks and continuity tests.",
      "zh-CHS": "* 资源维护-必须能够使维护操作独立于其他终止功能，例如，某些维护状态不应影响与该资源关联的资源。维护功能的示例包括环回和连续性测试。"
    },
    {
      "indent": 3,
      "text": "* Connection management, including connection state.",
      "zh-CHS": "* 连接管理，包括连接状态。"
    },
    {
      "indent": 3,
      "text": "* Media processing, using media resources: these provide services such as transcoding, conferencing, interactive voice recognition units, audio resource function units. Media resources may or may not be directly part of other resources.",
      "zh-CHS": "* 媒体处理，使用媒体资源：提供转码、会议、交互式语音识别单元、音频资源功能单元等服务。媒体资源可能是也可能不是其他资源的直接部分。"
    },
    {
      "indent": 3,
      "text": "* Incoming digit analysis for terminations, interpretation of scripts for terminations",
      "zh-CHS": "* 终端的输入数字分析，终端脚本的解释"
    },
    {
      "indent": 3,
      "text": "* Event detection and signal insertion for per-channel signalling",
      "zh-CHS": "* 每通道信令的事件检测和信号插入"
    },
    {
      "indent": 3,
      "text": "* Ability to configure signalling backhauls (for example, a Sigtran backhaul)",
      "zh-CHS": "* 能够配置信令回程（例如，Sigtran回程）"
    },
    {
      "indent": 3,
      "text": "* Management of the association between the MGC and MG, or between the MGC and MG resources.",
      "zh-CHS": "* 管理MGC和MG之间或MGC和MG资源之间的关联。"
    },
    {
      "indent": 0,
      "text": "5. Per-Call Requirements",
      "section_title": true,
      "zh-CHS": "5. 每次通话要求"
    },
    {
      "indent": 0,
      "text": "5.1. Resource Reservation",
      "section_title": true,
      "zh-CHS": "5.1. 资源储备"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support reservation of bearer terminations and media resources for use by a particular call and support their subsequent release (which may be implicit or explicit).",
      "zh-CHS": "a. 支持保留特定呼叫使用的承载终端和媒体资源，并支持其后续释放（可能是隐式的或显式的）。"
    },
    {
      "indent": 3,
      "text": "b. Allow release in a single exchange of messages, of all resources associated with a particular set of connectivity and/or associations between a given number terminations.",
      "zh-CHS": "b. 允许在单个消息交换中释放与特定连接集和/或给定数量终端之间关联的所有资源。"
    },
    {
      "indent": 3,
      "text": "c. The MG is not required (or allowed) by the protocol to maintain a sense of future time: a reservation remains in effect until explicitly released by the MGC.",
      "zh-CHS": "c. 协议不要求（或允许）MG保持未来时间感：保留在MGC明确发布之前保持有效。"
    },
    {
      "indent": 0,
      "text": "5.2. Connection Requirements",
      "section_title": true,
      "zh-CHS": "5.2. 连接要求"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support connections involving packet and circuit bearer terminations in any combination, including \"hairpin\" connections (connections between two circuit connections within the same MG).",
      "zh-CHS": "a. 支持任何组合中涉及数据包和电路承载终端的连接，包括“发夹”连接（同一MG内两个电路连接之间的连接）。"
    },
    {
      "indent": 3,
      "text": "b. Support connections involving TDM, Analogue, ATM, IP or FR transport in any combination.",
      "zh-CHS": "b. 支持任何组合中涉及TDM、模拟、ATM、IP或FR传输的连接。"
    },
    {
      "indent": 3,
      "text": "c. Allow the specification of bearer plane (e.g. Frame Relay, IP, etc.) on a call by call basis.",
      "zh-CHS": "c. 允许在逐个呼叫的基础上指定承载平面（例如帧中继、IP等）。"
    },
    {
      "indent": 3,
      "text": "d. Support unidirectional, symmetric bi-directional, and asymmetric bi-directional flows of media.",
      "zh-CHS": "d. 支持介质的单向、对称双向和非对称双向流。"
    },
    {
      "indent": 3,
      "text": "e. Support multiple media types (e.g. audio, text, video, T.120).",
      "zh-CHS": "e. 支持多种媒体类型（例如音频、文本、视频、T.120）。"
    },
    {
      "indent": 3,
      "text": "f. Support point-to-point and point-to-multipoint connections.",
      "zh-CHS": "f. 支持点对点和点对多点连接。"
    },
    {
      "indent": 3,
      "text": "g. Support creation and modification of more complex flow topologies e.g. conference bridge capabilities. Be able to add or delete media streams during a call or session, and be able to add or subtract participants to/from a call or session.",
      "zh-CHS": "g. 支持创建和修改更复杂的流拓扑，例如会议桥功能。能够在通话或会话期间添加或删除媒体流，并能够在通话或会话中添加或减少参与者。"
    },
    {
      "indent": 3,
      "text": "h. Support inclusion of media resources into call or session as required. Depending on the protocol and resource type, media resources may be implicitly included, class-assigned, or individually assigned.",
      "zh-CHS": "h. 支持根据需要将媒体资源包含到呼叫或会话中。根据协议和资源类型，媒体资源可以隐式包括、类分配或单独分配。"
    },
    {
      "indent": 3,
      "text": "i. Provide unambiguous specification of which media flows pass through a point and which are blocked at a given point in time, if the protocol permits multiple flows to pass through the same point.",
      "zh-CHS": "i. 如果协议允许多个流通过同一点，则提供明确的规范，说明哪些媒体流通过一个点，哪些媒体流在给定时间点被阻止。"
    },
    {
      "indent": 3,
      "text": "j. Allow modifications of an existing termination, for example, use of higher compression to compensate for insufficient bandwidth or changing transport network connections.",
      "zh-CHS": "j. 允许修改现有终端，例如，使用更高的压缩来补偿带宽不足或传输网络连接发生变化。"
    },
    {
      "indent": 3,
      "text": "k. Allow the MGC to specify that a given connection has higher priority than other connections.",
      "zh-CHS": "k. 允许MGC指定给定连接的优先级高于其他连接。"
    },
    {
      "indent": 3,
      "text": "l. Allow a reference to a port/termination on the MG to be a logical identifier,",
      "zh-CHS": "l. 允许引用MG上的端口/终端作为逻辑标识符，"
    },
    {
      "indent": 8,
      "text": "with a one-to-one mapping between a logical identifier and a physical port.",
      "zh-CHS": "逻辑标识符和物理端口之间的一对一映射。"
    },
    {
      "indent": 3,
      "text": "m. Allow the MG to report events such as resource reservation and connection completion.",
      "zh-CHS": "m. 允许MG报告资源保留和连接完成等事件。"
    },
    {
      "indent": 0,
      "text": "5.3. Media Transformations",
      "section_title": true,
      "zh-CHS": "5.3. 媒体转型"
    },
    {
      "indent": 3,
      "text": "The Protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support mediation/adaptation of flows between different types of transport",
      "zh-CHS": "a. 支持在不同类型的传输之间调解/调整流"
    },
    {
      "indent": 3,
      "text": "b. Support invocation of additional processing such as echo cancellation.",
      "zh-CHS": "b. 支持调用附加处理，如回声消除。"
    },
    {
      "indent": 3,
      "text": "c. Support mediation of flows between different content encoding (codecs, encryption/decryption)",
      "zh-CHS": "c. 支持不同内容编码（编解码器、加密/解密）之间的流中介"
    },
    {
      "indent": 3,
      "text": "d. Allow the MGC to specify whether text telephony/FAX/data modem traffic is to be terminated at the MG, modulated/demodulated, and converted to packets or forwarded by the MG in the media flow as voice band traffic.",
      "zh-CHS": "d. 允许MGC指定文本电话/传真/数据调制解调器通信是否在MG处终止、调制/解调、转换为数据包或由MG在媒体流中作为语音带通信转发。"
    },
    {
      "indent": 3,
      "text": "e. Allow the MGC to specify that Dual-Tone MultiFrequency (DTMF) digits or other line and trunk signals and general Multi-Frequency (MF) tones are to be processed in the MG and how these digits/signals/tones are to be handled. The MGC must be able to specify any of the following handling of such digits/signals/tones:",
      "zh-CHS": "e. 允许MGC指定在MG中处理双音多频（DTMF）数字或其他线路和中继信号以及通用多频（MF）音调，以及如何处理这些数字/信号/音调。MGC必须能够指定此类数字/信号/音调的以下任何处理方式："
    },
    {
      "indent": 3,
      "text": "1. The digits/signals/tones are to be encoded normally in the audio RTP stream (e.g., no analysis of the digits/signals/tones).",
      "zh-CHS": "1. 数字/信号/音调通常在音频RTP流中进行编码（例如，不分析数字/信号/音调）。"
    },
    {
      "indent": 3,
      "text": "2. Analyzed and sent to the MGC.",
      "zh-CHS": "2. 分析并发送给MGC。"
    },
    {
      "indent": 3,
      "text": "3. Received from the MGC and inserted in the line-side audio stream.",
      "zh-CHS": "3. 从MGC接收并插入线路侧音频流。"
    },
    {
      "indent": 3,
      "text": "4. Analyzed and sent as part of a separate RTP stream (e.g., DTMF digits sent via a RTP payload separate from the audio RTP stream).",
      "zh-CHS": "4. 作为单独RTP流的一部分进行分析和发送（例如，通过与音频RTP流分离的RTP有效负载发送DTMF数字）。"
    },
    {
      "indent": 3,
      "text": "5. Taken from a separate RTP stream and inserted in the line-side audio stream.",
      "zh-CHS": "5. 取自单独的RTP流，并插入线路侧音频流。"
    },
    {
      "indent": 3,
      "text": "6. Handled according to a script of instructions. For all but the first case, an option to mute the digits/signals/tones with silence, comfort noise, or other means (e.g., notch filtering of some telephony tones) must be provided. As detection of these events may take up to tens of milliseconds, the first few milliseconds of such digit/signal/tone may be encoded and sent in the audio RTP stream before the digit/signal/tone can be verified. Therefore muting of such digits/signals/tones in the audio RTP stream with silence or comfort noise is understood to occur at the earliest opportunity after the digit/signal/tone is verified.",
      "zh-CHS": "6. 根据指令脚本处理。对于除第一种情况外的所有情况，必须提供一个选项，使用静音、舒适噪音或其他方式（例如，某些电话铃声的陷波滤波）使数字/信号/铃声静音。由于这些事件的检测可能需要长达数十毫秒，在验证数字/信号/音调之前，可以对此类数字/信号/音调的前几毫秒进行编码并在音频RTP流中发送。因此，可以理解，在数字/信号/音调被验证之后，音频RTP流中的此类数字/信号/音调在静音或舒适噪声下的静音在最早的机会发生。"
    },
    {
      "indent": 3,
      "text": "f. Allow the MGC to specify signalled flow characteristics on circuit as well as on packet bearer connections, e.g. u-law/a-law.",
      "zh-CHS": "f. 允许MGC在电路和分组承载连接上指定信号流特性，例如u-law/a-law。"
    },
    {
      "indent": 3,
      "text": "g. Allow for packet/cell transport adaptation only (no media adaptation) e.g. mid-stream (packet-to-packet) transpacketization/transcoding, or ATM AAL5 to and from ATM AAL2 adaptation.",
      "zh-CHS": "g. 仅允许分组/信元传输自适应（无媒体自适应），例如中流（分组到分组）传输分组/转码，或ATM AAL5与ATM AAL2之间的自适应。"
    },
    {
      "indent": 3,
      "text": "h. Allow the transport of audio normalization levels as a setup parameter, e.g., for conference bridging.",
      "zh-CHS": "h. 允许传输音频标准化级别作为设置参数，例如用于会议桥接。"
    },
    {
      "indent": 3,
      "text": "i. Allow conversion to take place between media types e.g., text to speech and speech to text.",
      "zh-CHS": "i. 允许在媒体类型之间进行转换，例如文本到语音和语音到文本。"
    },
    {
      "indent": 0,
      "text": "5.4. Signal/Event Processing and Scripting",
      "section_title": true,
      "zh-CHS": "5.4. 信号/事件处理和脚本编写"
    },
    {
      "indent": 3,
      "text": "The Protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Allow the MGC to enable/disable monitoring for specific supervision events at specific circuit terminations",
      "zh-CHS": "a. 允许MGC在特定电路终端启用/禁用特定监控事件的监控"
    },
    {
      "indent": 3,
      "text": "b. Allow the MGC to enable/disable monitoring for specific events within specified media streams",
      "zh-CHS": "b. 允许MGC启用/禁用对指定媒体流中特定事件的监视"
    },
    {
      "indent": 3,
      "text": "c. Allow reporting of detected events on the MG to the MGC. The protocol should provide the means to minimize the messaging required to report commonly-occurring event sequences.",
      "zh-CHS": "c. 允许向MGC报告MG上检测到的事件。协议应提供尽可能减少报告常见事件序列所需的消息传递的方法。"
    },
    {
      "indent": 3,
      "text": "d. Allow the MGC to specify other actions (besides reporting) that the MG should take upon detection of specified events.",
      "zh-CHS": "d. 允许MGC指定MG在检测到指定事件时应采取的其他行动（除了报告）。"
    },
    {
      "indent": 3,
      "text": "e. Allow the MGC to enable and/or mask events.",
      "zh-CHS": "e. 允许MGC启用和/或屏蔽事件。"
    },
    {
      "indent": 3,
      "text": "f. Provide a way for MGC to positively acknowledge event notification.",
      "zh-CHS": "f. 为MGC提供一种积极确认事件通知的方式。"
    },
    {
      "indent": 3,
      "text": "g. Allow the MGC to specify signals (e.g., supervision, ringing) to be applied at circuit terminations.",
      "zh-CHS": "g. 允许MGC指定在电路终端应用的信号（例如，监控、振铃）。"
    },
    {
      "indent": 3,
      "text": "h. Allow the MGC to specify content of extended duration (announcements, continuous tones) to be inserted into specified media flows.",
      "zh-CHS": "h. 允许MGC指定要插入到指定媒体流中的延长持续时间的内容（公告、连续铃声）。"
    },
    {
      "indent": 3,
      "text": "i. Allow the MGC to specify alternative conditions (detection of specific events, timeouts) under which the insertion of extended-duration signals should cease.",
      "zh-CHS": "i. 允许MGC指定替代条件（检测特定事件、超时），在此条件下，延长持续时间信号的插入应停止。"
    },
    {
      "indent": 3,
      "text": "j. Allow the MGC to download, and specify a script to be invoked on the occurrence of an event.",
      "zh-CHS": "j. 允许MGC下载并指定事件发生时要调用的脚本。"
    },
    {
      "indent": 3,
      "text": "k. Specify common events and signals to maximize MG/MGC interworking.",
      "zh-CHS": "k. 指定公共事件和信号，以最大化MG/MGC互通。"
    },
    {
      "indent": 3,
      "text": "l. Provide an extension mechanism for implementation defined events and signals with, for example, IANA registration procedures. It may be useful to have an Organizational Identifier (i.e. ITU, ETSI, ANSI, ) as part of the registration mechanism.",
      "zh-CHS": "l. 为实现定义的事件和信号提供扩展机制，例如IANA注册过程。将组织标识符（即ITU、ETSI、ANSI等）作为注册机制的一部分可能很有用。"
    },
    {
      "indent": 3,
      "text": "m. The protocol shall allow the MGC to request the arming of a mid-call trigger even after the call has been set up.",
      "zh-CHS": "m. 协议应允许MGC即使在呼叫建立后，也请求解除呼叫中触发器的武装。"
    },
    {
      "indent": 0,
      "text": "5.5. QoS/CoS",
      "section_title": true,
      "zh-CHS": "5.5. 服务质量/成本"
    },
    {
      "indent": 3,
      "text": "The Protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support the establishment of a bearer channel with a specified QoS/CoS.",
      "zh-CHS": "a. 支持建立具有指定QoS/CoS的承载信道。"
    },
    {
      "indent": 3,
      "text": "b. Support the ability to specify QoS for the connection between MGs, and by direction.",
      "zh-CHS": "b. 支持为MG之间的连接指定QoS的能力，以及按方向指定QoS的能力。"
    },
    {
      "indent": 3,
      "text": "c. Support a means to change QoS during a connection, as a whole and by direction.",
      "zh-CHS": "c. 支持在连接过程中改变QoS的方法，包括整体和方向。"
    },
    {
      "indent": 3,
      "text": "d. Allow the MGC to set QOS thresholds and receive notification when such thresholds cannot be maintained.",
      "zh-CHS": "d. 允许MGC设置QOS阈值，并在无法维持此类阈值时接收通知。"
    },
    {
      "indent": 3,
      "text": "e. Allow the jitter buffer parameters on RTP channels to be specified at connection setup.",
      "zh-CHS": "e. 允许在连接设置时指定RTP通道上的抖动缓冲区参数。"
    },
    {
      "indent": 0,
      "text": "5.6. Test Support",
      "section_title": true,
      "zh-CHS": "5.6. 测试支持"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support of the different types of PSTN Continuity Testing (COT) for both the originating and terminating ends of the circuit connection (2-wire and 4- wire).",
      "zh-CHS": "a. 对电路连接的起始端和终止端（2线和4线）支持不同类型的PSTN连续性测试（COT）。"
    },
    {
      "indent": 3,
      "text": "b. Specifically support test line operation (e.g. 103, 105, 108).",
      "zh-CHS": "b. 专门支持测试线操作（例如103、105、108）。"
    },
    {
      "indent": 0,
      "text": "5.7. Accounting",
      "section_title": true,
      "zh-CHS": "5.7. 会计"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support a common identifier to mark resources related to one connection.",
      "zh-CHS": "a. 支持公共标识符来标记与一个连接相关的资源。"
    },
    {
      "indent": 3,
      "text": "b. Support collection of specified accounting information from MGs.",
      "zh-CHS": "b. 支持从MGs收集指定的会计信息。"
    },
    {
      "indent": 3,
      "text": "c. Provide the mechanism for the MGC to specify that the MG report accounting information automatically at end of call, in mid-call upon request, at specific time intervals as specified by the MGC and at unit usage thresholds as specified by the MGC.",
      "zh-CHS": "c. 为MGC提供一种机制，规定MG在通话结束时、通话中期、MGC规定的特定时间间隔和MGC规定的单位使用阈值自动报告会计信息。"
    },
    {
      "indent": 3,
      "text": "d. Specifically support collection of:",
      "zh-CHS": "d. 特别支持收集："
    },
    {
      "indent": 3,
      "text": "* start and stop time, by media flow,",
      "zh-CHS": "* 启动和停止时间，根据介质流，"
    },
    {
      "indent": 3,
      "text": "* volume of content carried (e.g. number of packets/cells transmitted, number received with and without error, inter-arrival jitter), by media flow,",
      "zh-CHS": "* 媒体流承载的内容量（例如，传输的数据包/小区数量、有无错误接收的数量、到达间抖动），"
    },
    {
      "indent": 3,
      "text": "* QOS statistics, by media flow.",
      "zh-CHS": "* QOS统计，按媒体流。"
    },
    {
      "indent": 3,
      "text": "e. Allow the MGC to have some control over which statistics are reported, to enable it to manage the amount of information transferred.",
      "zh-CHS": "e. 允许MGC对报告的统计数据进行某种控制，以使其能够管理传输的信息量。"
    },
    {
      "indent": 0,
      "text": "5.8. Signalling Control",
      "section_title": true,
      "zh-CHS": "5.8. 信号控制"
    },
    {
      "indent": 3,
      "text": "Establishment and provisioning of signalling backhaul channels (via SIGTRAN for example) is out of scope. However, the MG must be capable of supporting detection of events, and application of signals associated with basic analogue line, and CAS type signalling. The protocol must:",
      "zh-CHS": "信令回程信道（例如通过SIGTRAN）的建立和供应超出范围。但是，MG必须能够支持事件检测、与基本模拟线路相关的信号应用以及CAS型信号。议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support the signalling requirements of analogue lines and Channel Associated Signaling (CAS).",
      "zh-CHS": "a. 支持模拟线路和信道相关信令（CAS）的信令要求。"
    },
    {
      "indent": 3,
      "text": "b. Support national variations of such signalling.",
      "zh-CHS": "b. 支持此类信号的国家变体。"
    },
    {
      "indent": 3,
      "text": "c. Provide mechanisms to support signalling without requiring MG-MGC timing constraints beyond that specified in this document.",
      "zh-CHS": "c. 提供支持信令的机制，而无需MG-MGC时间限制超出本文件规定。"
    },
    {
      "indent": 3,
      "text": "d. Must not create a situation where the MGC and the MG must be homologated together as a mandatory requirement of using the protocol;",
      "zh-CHS": "d. 不得造成MGC和MG必须作为使用协议的强制性要求一起认证的情况；"
    },
    {
      "indent": 8,
      "text": "i.e. it must be possible to optionally conceal signaling type variation from the MGC.",
      "zh-CHS": "i、 e.必须能够选择性地隐藏MGC的信号类型变化。"
    },
    {
      "indent": 0,
      "text": "6. Resource Control",
      "section_title": true,
      "zh-CHS": "6. 资源控制"
    },
    {
      "indent": 0,
      "text": "6.1. Resource Status Management",
      "section_title": true,
      "zh-CHS": "6.1. 资源状态管理"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Allow the MG to report changes in status of physical entities supporting bearer terminations, media resources, and facility-associated signalling channels, due to failures, recovery, or administrative action. It must be able to report whether a termination is in service or out of service.",
      "zh-CHS": "a. 允许MG报告由于故障、恢复或管理操作而导致的支持承载终止、媒体资源和设施相关信令信道的物理实体状态的变化。它必须能够报告终止是在使用中还是停止使用。"
    },
    {
      "indent": 3,
      "text": "b. Support administrative blocking and release of TDM circuit terminations.",
      "zh-CHS": "b. 支持TDM电路终端的管理阻塞和释放。"
    },
    {
      "indent": 3,
      "text": "Note: as the above point only relates to ISUP-controlled circuits, it may be unnecessary to require this since the MGC controls their use. However, it may be meaningful for MF and R2-signalled trunks, where supervisory states are set to make the trunks unavailable at the far end.",
      "zh-CHS": "注：由于上述要点仅涉及ISUP控制的电路，因此可能不需要这样做，因为MGC控制它们的使用。然而，这对于MF和R2信号中继可能是有意义的，在MF和R2信号中继中，监控状态设置为使中继在远端不可用。"
    },
    {
      "indent": 3,
      "text": "c. Provide a method for the MGC to request that the MG release all resources under the control of a particular MGC currently in use, or reserved, for any or all connections.",
      "zh-CHS": "c. 为MGC提供一种方法，以请求MG释放当前正在使用的或为任何或所有连接保留的特定MGC控制下的所有资源。"
    },
    {
      "indent": 3,
      "text": "d. Provide an MG Resource Discovery mechanism which must allow an MGC to discover what resources the MG has. Expressing resources can be an arbitrarily difficult problem and the initial release of the protocol may have a simplistic view of resource discovery.",
      "zh-CHS": "d. 提供MG资源发现机制，该机制必须允许MGC发现MG拥有的资源。表示资源可能是一个任意困难的问题，协议的初始版本可能对资源发现有一个过于简单的看法。"
    },
    {
      "indent": 8,
      "text": "At a minimum, resource discovery must enumerate the names of available circuit terminations and the allowed values for parameters supported by terminations.",
      "zh-CHS": "资源发现至少必须枚举可用电路终端的名称以及终端支持的参数的允许值。"
    },
    {
      "indent": 8,
      "text": "The protocol should be defined so that simple gateways could respond with a relatively short, pre-stored response to the discovery request mechanism. In general, if the protocol defines a mechanism that allows the MGC to specify a setting or parameter for a resource or connection in the MG, and MGs are not required to support all possible values for that setting or parameter, then the discovery mechanism should provide the MGC with a method to determine what possible values such settings or parameters are supported in a particular MG.",
      "zh-CHS": "应该定义协议，以便简单网关可以对发现请求机制做出相对较短的预存储响应。通常，如果协议定义了一种机制，允许MGC为MG中的资源或连接指定设置或参数，并且MG不需要支持该设置或参数的所有可能值，然后，发现机制应为MGC提供一种方法，以确定特定MG中支持的此类设置或参数的可能值。"
    },
    {
      "indent": 3,
      "text": "e. Provide a mechanism to discover the current available resources in the MG, where resources are dynamically consumed by connections and the MGC cannot reasonably or reliably track the consumption of such resources. It should also be possible to discover resources currently in use, in order to reconcile inconsistencies between the MGC and the MG.",
      "zh-CHS": "e. 提供一种发现MG中当前可用资源的机制，其中资源由连接动态消耗，MGC无法合理或可靠地跟踪此类资源的消耗。还应该能够发现当前正在使用的资源，以协调MGC和MG之间的不一致。"
    },
    {
      "indent": 3,
      "text": "f. Not require an MGC to implement an SNMP manager function in order to discover capabilities of an MG that may be specified during context establishment.",
      "zh-CHS": "f. 不需要MGC实现SNMP管理器功能，以便发现在上下文建立期间可能指定的MG功能。"
    },
    {
      "indent": 0,
      "text": "6.2. Resource Assignment",
      "section_title": true,
      "zh-CHS": "6.2. 资源分配"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Provide a way for the MG to indicate that it was unable to perform a requested action because of resource exhaustion, or because of temporary resource unavailability.",
      "zh-CHS": "a. 为MG提供一种方式，表明由于资源耗尽或临时资源不可用而无法执行请求的操作。"
    },
    {
      "indent": 3,
      "text": "b. Provide an ability for the MGC to indicate to an MG the resource to use for a call (e.g. DS0) exactly, or indicate a set of resources (e.g. pick a DS0 on a T1 line or a list of codec types) via a \"wild card\" mechanism from which the MG can select a specific resource for a call (e.g. the 16th timeslot, or G.723).",
      "zh-CHS": "b. 使MGC能够通过“通配符”机制向MG准确指示用于呼叫的资源（如DS0），或指示一组资源（如T1线路上的DS0或编解码器类型列表），MG可以从中为呼叫选择特定资源（如第16时隙或g.723）。"
    },
    {
      "indent": 3,
      "text": "c. Allow the use of DNS names and IP addresses to identify MGs and MGCs. This shall not preclude using other identifiers for MGs or MGCs when other non IP transport technologies for the protocol are used.",
      "zh-CHS": "c. 允许使用DNS名称和IP地址来标识MG和MGC。当使用协议的其他非IP传输技术时，这不应排除使用MGs或MGC的其他标识符。"
    },
    {
      "indent": 0,
      "text": "7. Operational/Management Requirements",
      "section_title": true,
      "zh-CHS": "7. 业务/管理要求"
    },
    {
      "indent": 0,
      "text": "7.1. Assurance of Control/Connectivity",
      "section_title": true,
      "zh-CHS": "7.1. 控制/连通性保证"
    },
    {
      "indent": 3,
      "text": "To provide assurance of control and connectivity, the protocol must provide the means to minimize duration of loss of control due to loss of contact, or state mismatches.",
      "zh-CHS": "为了提供控制和连接的保证，协议必须提供最小化因失去联系或状态不匹配而导致的控制丢失持续时间的方法。"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support detection and recovery from loss of contact due to failure/congestion of communication links or due to MG or MGC failure.",
      "zh-CHS": "a. 支持检测和恢复因通信链路故障/拥塞或MG或MGC故障导致的联系中断。"
    },
    {
      "indent": 8,
      "text": "Note that failover arrangements are one of the mechanisms which could be used to meet this requirement.",
      "zh-CHS": "请注意，故障切换安排是可用于满足此要求的机制之一。"
    },
    {
      "indent": 3,
      "text": "b. Support detection and recovery from loss of synchronized view of resource and connection states between MGCs and MGs. (e.g. through the use of audits).",
      "zh-CHS": "b. 支持MGCs和MGs之间资源和连接状态的同步视图丢失的检测和恢复。（例如，通过使用审计）。"
    },
    {
      "indent": 3,
      "text": "c. Provide a means for MGC and MG to provide each other with booting and reboot indications, and what the MG's configuration is.",
      "zh-CHS": "c. 为MGC和MG提供一种相互提供引导和重新引导指示的方法，以及MG的配置。"
    },
    {
      "indent": 3,
      "text": "d. Permit more than one backup MGC and provide an orderly way for the MG to contact one of its backups.",
      "zh-CHS": "d. 允许多个备份MGC，并为MG提供一种有序的方式来联系其一个备份。"
    },
    {
      "indent": 3,
      "text": "e. Provide for an orderly switchback to the primary MGC after it recovers. How MGCs coordinate resources between themselves is outside the scope of the protocol.",
      "zh-CHS": "e. 在主MGC恢复后，提供有序的切换至主MGC。MGC之间如何协调资源超出了协议的范围。"
    },
    {
      "indent": 3,
      "text": "f. Provide a mechanism so that when an MGC fails, connections already established can be maintained. The protocol does not have to provide a capability to maintain connections in the process of being connected, but not actually connected when the failure occurs.",
      "zh-CHS": "f. 提供一种机制，以便在MGC出现故障时，可以维护已建立的连接。协议不必提供在连接过程中保持连接的能力，但在发生故障时不需要实际连接。"
    },
    {
      "indent": 3,
      "text": "g. The Protocol must allow the recovery or redistribution of traffic without call loss.",
      "zh-CHS": "g. 协议必须允许在不丢失呼叫的情况下恢复或重新分配通信量。"
    },
    {
      "indent": 0,
      "text": "7.2. Error Control",
      "section_title": true,
      "zh-CHS": "7.2. 差错控制"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Allow for the MG to report reasons for abnormal failure of lower layer connections e.g. TDM circuit failure, ATM VCC failure.",
      "zh-CHS": "a. 允许MG报告下层连接异常故障的原因，例如TDM电路故障、ATM VCC故障。"
    },
    {
      "indent": 3,
      "text": "b. Allow for the MG to report Usage Parameter Control (UPC) events.",
      "zh-CHS": "b. 允许MG报告使用参数控制（UPC）事件。"
    },
    {
      "indent": 3,
      "text": "c. Provide means to ameliorate potential synchronization or focused overload of supervisory/signaling events that can be detrimental to either MG or MGC operation. Power restoration or signaling transport re-establishment are typical sources of potentially detrimental signaling showers from MG to MGC or vice-versa.",
      "zh-CHS": "c. 提供改善可能对MG或MGC运行有害的监控/信号事件的潜在同步或集中过载的方法。电源恢复或信号传输重建是从MG到MGC或从MG到MGC的潜在有害信号阵雨的典型来源。"
    },
    {
      "indent": 3,
      "text": "d. Allow the MG to notify the MGC that a termination was terminated and communicate a reason when a terminations is taken out-of-service unilaterally by the MG due to abnormal events.",
      "zh-CHS": "d. 允许MG通知MGC终止，并在MG因异常事件单方面停止服务时告知原因。"
    },
    {
      "indent": 3,
      "text": "e. Allow the MGC to acknowledge that a termination has been taken out-of-service.",
      "zh-CHS": "e. 允许MGC确认终止已停止服务。"
    },
    {
      "indent": 3,
      "text": "f. Allow the MG to request the MGC to release a termination and communicate a reason.",
      "zh-CHS": "f. 允许MG请求MGC解除终止并告知原因。"
    },
    {
      "indent": 3,
      "text": "g. Allow the MGC to specify, as a result of such a request its decision to take termination down, leave it as is or modify it.",
      "zh-CHS": "g. 允许MGC在收到此类请求后，指定终止、保留或修改的决定。"
    },
    {
      "indent": 0,
      "text": "7.3. MIB Requirements",
      "section_title": true,
      "zh-CHS": "7.3. MIB要求"
    },
    {
      "indent": 3,
      "text": "The Protocol must define a common MG MIB, which must be extensible, but must:",
      "zh-CHS": "协议必须定义公共MG MIB，该MIB必须是可扩展的，但必须："
    },
    {
      "indent": 3,
      "text": "a. Provide information on:",
      "zh-CHS": "a. 提供以下信息："
    },
    {
      "indent": 3,
      "text": "* mapping between resources and supporting physical entities.",
      "zh-CHS": "* 资源和支持物理实体之间的映射。"
    },
    {
      "indent": 3,
      "text": "* statistics on quality of service on the control and signalling backhaul interfaces.",
      "zh-CHS": "* 控制和信令回程接口的服务质量统计。"
    },
    {
      "indent": 3,
      "text": "* statistics required for traffic engineering within the MG.",
      "zh-CHS": "* MG内交通工程所需的统计数据。"
    },
    {
      "indent": 3,
      "text": "b. The protocol must allow the MG to provide to the MGC all information the MGC needs to provide in its MIB.",
      "zh-CHS": "b. 协议必须允许MG向MGC提供MGC需要在其MIB中提供的所有信息。"
    },
    {
      "indent": 3,
      "text": "c. MG MIB must support implementation of H.341 by either the MG, MGC, or both acting together.",
      "zh-CHS": "c. MG MIB必须支持MG、MGC或两者共同执行H.341。"
    },
    {
      "indent": 0,
      "text": "8. General Protocol Requirements",
      "section_title": true,
      "zh-CHS": "8. 一般议定书要求"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support multiple operations to be invoked in one message and treated as a single transaction.",
      "zh-CHS": "a. 支持在一条消息中调用多个操作并将其视为单个事务。"
    },
    {
      "indent": 3,
      "text": "b. Be both modular and extensible. Not all implementations may wish to support all of the possible extensions for the protocol. This will permit lightweight implementations for specialized tasks where processing resources are constrained. This could be accomplished by defining particular profiles for particular uses of the protocol.",
      "zh-CHS": "b. 既要模块化，又要可扩展。并非所有实现都希望支持协议的所有可能扩展。这将允许在处理资源受限的情况下对特定任务进行轻量级实现。这可以通过为协议的特定用途定义特定的概要文件来实现。"
    },
    {
      "indent": 3,
      "text": "c. Be flexible in allocation of intelligence between MG and MGC. For example, an MGC may want to allow the MG to assign particular MG resources in some implementations, while in others, the MGC may want to be the one to assign MG resources for use.",
      "zh-CHS": "c. 灵活分配MG和MGC之间的情报。例如，MGC可能希望允许MG在某些实现中分配特定的MG资源，而在其他实现中，MGC可能希望成为分配MG资源以供使用的人。"
    },
    {
      "indent": 3,
      "text": "d. Support scalability from very small to very large MGs: The protocol must support MGs with capacities ranging from one to millions of terminations.",
      "zh-CHS": "d. 支持从非常小的MGs到非常大的MGs的可扩展性：协议必须支持容量从一个终端到数百万个终端的MGs。"
    },
    {
      "indent": 3,
      "text": "e. Support scalability from very small to very large MGC span of control: The protocol should support MGCs that control from one MG to a few tens of thousands of MGs.",
      "zh-CHS": "e. 支持从非常小到非常大的MGC控制范围的可伸缩性：协议应支持从一个MG控制到数万个MG的MGC。"
    },
    {
      "indent": 3,
      "text": "f. Support the needs of a residential gateway that supports one to a few lines, and the needs of a large PSTN gateway supporting tens of thousands of lines. Protocol mechanisms favoring one extreme or the other should be minimized in favor of more general purpose mechanism applicable to a wide range of MGs. Where special purpose mechanisms are proposed to optimize a subset of implementations, such mechanisms should be defined as optional, and should have minimal impact on the rest of the protocol.",
      "zh-CHS": "f. 支持支持一到几条线路的住宅网关的需求，以及支持数万条线路的大型PSTN网关的需求。应尽量减少有利于一个极端或另一个极端的协议机制，以利于更通用的机制适用于广泛的MG。如果建议使用专用机制来优化实现子集，则此类机制应定义为可选的，并且对协议其余部分的影响应最小。"
    },
    {
      "indent": 3,
      "text": "g. Facilitate MG and MGC version upgrades independently of one another. The protocol must include a version identifier in the initial message exchange.",
      "zh-CHS": "g. 促进MG和MGC版本的独立升级。协议必须在初始消息交换中包含版本标识符。"
    },
    {
      "indent": 3,
      "text": "h. Facilitate the discovery of the protocol capabilities of the one entity to the other.",
      "zh-CHS": "h. 促进发现一个实体对另一个实体的协议功能。"
    },
    {
      "indent": 3,
      "text": "i. Specify commands as optional (they can be ignored) or mandatory (the command must be rejected), and within a command, to specify parameters as optional (they can be ignored) or mandatory (the command must be rejected).",
      "zh-CHS": "i. 将命令指定为可选（可以忽略）或必需（必须拒绝该命令），并在命令内将参数指定为可选（可以忽略）或必需（必须拒绝该命令）。"
    },
    {
      "indent": 0,
      "text": "8.1. MG-MGC Association Requirements",
      "section_title": true,
      "zh-CHS": "8.1. MG-MGC协会要求"
    },
    {
      "indent": 3,
      "text": "The Protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support the establishment of a control relationship between an MGC and an MG.",
      "zh-CHS": "a. 支持在MGC和MG之间建立控制关系。"
    },
    {
      "indent": 3,
      "text": "b. Allow multiple MGCs to send control messages to an MG. Thus, the protocol must allow control messages from multiple signalling addresses to a single MG.",
      "zh-CHS": "b. 允许多个MGC向MG发送控制消息。因此，协议必须允许从多个信令地址向单个MG发送控制消息。"
    },
    {
      "indent": 3,
      "text": "c. Provide a method for the MG to tell an MGC that the MG received a command for a resource that is under the control of a different MGC.",
      "zh-CHS": "c. 为MG提供一种方法，以告知MGC MG收到了针对受不同MGC控制的资源的命令。"
    },
    {
      "indent": 3,
      "text": "d. Support a method for the MG to control the rate of requests it receives from the MGC (e.g. windowing techniques, exponential back-off).",
      "zh-CHS": "d. 支持MG控制其从MGC接收的请求速率的方法（例如窗口技术、指数退避）。"
    },
    {
      "indent": 3,
      "text": "e. Support a method for the MG to tell an MGC that it cannot handle any more requests.",
      "zh-CHS": "e. 支持MG告诉MGC它无法处理更多请求的方法。"
    },
    {
      "indent": 0,
      "text": "8.2. Performance Requirements",
      "section_title": true,
      "zh-CHS": "8.2. 性能要求"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Minimize message exchanges between MG and MGC, for example during boot/reboot, and during continuity tests.",
      "zh-CHS": "a. 尽量减少MG和MGC之间的消息交换，例如在引导/重新引导期间以及在连续性测试期间。"
    },
    {
      "indent": 3,
      "text": "b. Support Continuity test constraints which are a maximum of 200ms cross-MGC IAM (IAM is the name given to an SS7 connection setup msg) propagation delay, and a maximum of 200ms from end of dialing to IAM emission.",
      "zh-CHS": "b. 支持连续性测试约束，即最大200ms交叉MGC IAM（IAM是SS7连接设置消息的名称）传播延迟，以及从拨号结束到IAM发射的最大200ms。"
    },
    {
      "indent": 3,
      "text": "c. Make efficient use of the underlying transport mechanism. For example, protocol PDU sizes vs. transport MTU sizes needs to be considered in designing the protocol.",
      "zh-CHS": "c. 有效利用底层的传输机制。例如，在设计协议时，需要考虑协议PDU大小与传输MTU大小。"
    },
    {
      "indent": 3,
      "text": "d. Not contain inherent architectural or signaling constraints that would prohibit peak calling rates on the order of 140 calls/second on a moderately loaded network.",
      "zh-CHS": "d. 不包含固有的架构或信令约束，这些约束将禁止在中等负载的网络上每秒140次呼叫的峰值呼叫速率。"
    },
    {
      "indent": 3,
      "text": "e. Allow for default/provisioned settings so that commands need only contain non-default parameters.",
      "zh-CHS": "e. 允许默认/已设置的设置，以便命令只需要包含非默认参数。"
    },
    {
      "indent": 0,
      "text": "9. Transport",
      "section_title": true,
      "zh-CHS": "9. 运输"
    },
    {
      "indent": 0,
      "text": "9.1. Assumptions made for underlying network",
      "section_title": true,
      "zh-CHS": "9.1. 对基础网络的假设"
    },
    {
      "indent": 8,
      "text": "The protocol must assume that the underlying network:",
      "zh-CHS": "协议必须假定基础网络："
    },
    {
      "indent": 3,
      "text": "a. May be over large shared networks: proximity assumptions are not allowed.",
      "zh-CHS": "a. 可能在大型共享网络上：不允许接近性假设。"
    },
    {
      "indent": 3,
      "text": "b. Does not assure reliable delivery of messages.",
      "zh-CHS": "b. 无法确保消息的可靠传递。"
    },
    {
      "indent": 3,
      "text": "c. Does not guarantee ordering of messages: Sequenced delivery of messages associated with the same source of events is not assumed.",
      "zh-CHS": "c. 不保证消息的顺序：不假定与同一事件源关联的消息的顺序传递。"
    },
    {
      "indent": 3,
      "text": "d. Does not prevent duplicate transmissions.",
      "zh-CHS": "d. 不能防止重复传输。"
    },
    {
      "indent": 0,
      "text": "9.2. Transport Requirements",
      "section_title": true,
      "zh-CHS": "9.2. 运输要求"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Provide the ability to abort delivery of obsolete messages at the sending end if their transmission has not been successfully completed. For example, aborting a command that has been overtaken by events.",
      "zh-CHS": "a. 如果过时消息的传输未成功完成，则提供在发送端中止其传递的功能。例如，中止已被事件取代的命令。"
    },
    {
      "indent": 3,
      "text": "b. Support priority messages: The protocol shall allow a command precedence to allow priority messages to supercede non-priority messages.",
      "zh-CHS": "b. 支持优先级消息：协议应允许命令优先级，以允许优先级消息取代非优先级消息。"
    },
    {
      "indent": 3,
      "text": "c. Support of large fan-out at the MGC.",
      "zh-CHS": "c. 在MGC处支持大型扇形输出。"
    },
    {
      "indent": 3,
      "text": "d. Provide a way for one entity to correlate commands and responses with the other entity.",
      "zh-CHS": "d. 为一个实体提供将命令和响应与另一个实体关联的方法。"
    },
    {
      "indent": 3,
      "text": "e. Provide a reason for any command failure.",
      "zh-CHS": "e. 提供任何命令失败的原因。"
    },
    {
      "indent": 3,
      "text": "f. Provide that loss of a packet not stall messages not related to the message(s) contained in the packet lost.",
      "zh-CHS": "f. 提供数据包丢失不会暂停与数据包丢失中包含的消息无关的消息。"
    },
    {
      "indent": 3,
      "text": "Note that there may be enough protocol reliability requirements here to warrant a separate reliable transport layer be written apart from the Media Gateway Control Protocol. Also need to compare Megaco reliable transport requirements with similar Sigtran requirements.",
      "zh-CHS": "请注意，此处可能有足够的协议可靠性要求，以保证在媒体网关控制协议之外写入单独的可靠传输层。还需要将Megaco可靠传输要求与类似的Sigtran要求进行比较。"
    },
    {
      "indent": 0,
      "text": "10. Security Requirements",
      "section_title": true,
      "zh-CHS": "10. 安全要求"
    },
    {
      "indent": 3,
      "text": "Security mechanisms may be specified as provided in underlying transport mechanisms, such as IPSEC. The protocol, or such mechanisms, must:",
      "zh-CHS": "可以按照底层传输机制（如IPSEC）中的规定指定安全机制。议定书或此类机制必须："
    },
    {
      "indent": 3,
      "text": "a. Allow for mutual authentication at the start of an MGC-MG association",
      "zh-CHS": "a. 允许在MGC-MG关联开始时进行相互身份验证"
    },
    {
      "indent": 3,
      "text": "b. Allow for preservation of the of control messages once the association has been established.",
      "zh-CHS": "b. 允许在建立关联后保留控制消息的副本。"
    },
    {
      "indent": 3,
      "text": "c. Allow for optional confidentiality protection of control messages. The mechanism should allow a choice in the algorithm to be used.",
      "zh-CHS": "c. 允许对控制消息进行可选的保密保护。该机制应允许选择要使用的算法。"
    },
    {
      "indent": 3,
      "text": "d. Operate across untrusted domains in a secure fashion.",
      "zh-CHS": "d. 以安全的方式跨不受信任的域操作。"
    },
    {
      "indent": 3,
      "text": "e. Support non-repudiation for a customer-located MG talking to a network operator's MGC.",
      "zh-CHS": "e. 支持与网络运营商MGC对话的客户MG的不可否认性。"
    },
    {
      "indent": 3,
      "text": "f. Define mechanisms to mitigate denial of service attacks",
      "zh-CHS": "f. 定义缓解拒绝服务攻击的机制"
    },
    {
      "indent": 3,
      "text": "Note: the protocol document will need to include an extended discussion of security requirements, offering more precision on each threat and giving a complete picture of the defense including non-protocol measures such as configuration.",
      "zh-CHS": "注：协议文件需要包括对安全要求的扩展讨论，对每种威胁提供更精确的信息，并提供完整的防御方案，包括非协议措施，如配置。"
    },
    {
      "indent": 3,
      "text": "g. It would be desirable for the protocol to be able to pass through commonly-used firewalls.",
      "zh-CHS": "g. 该协议最好能够通过常用的防火墙。"
    },
    {
      "indent": 0,
      "text": "11. Requirements specific to particular bearer types",
      "section_title": true,
      "zh-CHS": "11. 特定承载类型的特定要求"
    },
    {
      "indent": 3,
      "text": "The bearer types listed in Table 1 can be packaged into different types of MGs. Examples are listed in the following sections. How they are packaged is outside the scope of the general Media Gateway control protocol. The protocol must support all types of bearer types listed in Table 1.",
      "zh-CHS": "表1中列出的承载类型可以打包成不同类型的MG。以下各节列出了示例。它们的打包方式超出了通用媒体网关控制协议的范围。协议必须支持表1中列出的所有类型的承载类型。"
    },
    {
      "indent": 17,
      "text": "Table 1: Bearer Types and Applications",
      "zh-CHS": "表1：承载类型和应用"
    },
    {
      "indent": 5,
      "text": "Bearer Type                   Applications       Transit Network\n================================================================\nTrunk+ISUP                    trunking/access    IP, ATM, FR\n                              Voice,Fax,NAS,\n                              Multimedia",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Trunk+MF trunking/access IP, ATM, FR Voice,Fax,NAS, Multimedia",
      "zh-CHS": "中继+MF中继/接入IP、ATM、FR语音、传真、NAS、多媒体"
    },
    {
      "indent": 5,
      "text": "ISDN trunking/access IP, ATM, FR Voice,Fax,NAS, Multimedia",
      "zh-CHS": "ISDN中继/接入IP、ATM、FR语音、传真、NAS、多媒体"
    },
    {
      "indent": 5,
      "text": "Analogue Voice,Fax, IP, ATM, FR Text Telephony",
      "zh-CHS": "模拟语音、传真、IP、ATM、FR文本电话"
    },
    {
      "indent": 5,
      "text": "Termination in a Restricted Voice,Fax, IP, ATM, FR Capability Gateway Text Telephony",
      "zh-CHS": "受限语音、传真、IP、ATM、FR功能网关文本电话中的终端"
    },
    {
      "indent": 5,
      "text": "Application Termination IVR,ARF, Announcement Server, Voice Recognition Server,...",
      "zh-CHS": "应用程序终止IVR、ARF、公告服务器、语音识别服务器，。。。"
    },
    {
      "indent": 5,
      "text": "Multimedia H.323 H.323 Multimedia IP, ATM, FR Gateway and MCU",
      "zh-CHS": "多媒体H.323 H.323多媒体IP、ATM、FR网关和MCU"
    },
    {
      "indent": 5,
      "text": "Multimedia H.320 H.323 GW and MCU ISDN, IP, ATM, FR",
      "zh-CHS": "多媒体H.320 H.323 GW和MCU ISDN、IP、ATM、FR"
    },
    {
      "indent": 0,
      "text": "11.1. Media-specific Bearer Types",
      "section_title": true,
      "zh-CHS": "11.1. 媒体特定承载类型"
    },
    {
      "indent": 3,
      "text": "This section describes requirements for handling terminations attached to specific types of networks.",
      "zh-CHS": "本节描述了处理连接到特定类型网络的终端的要求。"
    },
    {
      "indent": 0,
      "text": "11.1.1. Requirements for TDM PSTN (Circuit)",
      "section_title": true,
      "zh-CHS": "11.1.1. 对TDM PSTN（电路）的要求"
    },
    {
      "indent": 3,
      "text": "This bearer type is applicable to a Trunking GW, Access GW, ...",
      "zh-CHS": "该承载类型适用于中继GW、接入GW等。。。"
    },
    {
      "indent": 3,
      "text": "The protocol must allow:",
      "zh-CHS": "该议定书必须允许："
    },
    {
      "indent": 3,
      "text": "a. the MGC to specify the encoding to use on the attached circuit.",
      "zh-CHS": "a. MGC指定要在连接的电路上使用的编码。"
    },
    {
      "indent": 3,
      "text": "b. In general, if something is set by a global signalling protocol (e.g. ISUP allows mu-Law or A-Law to be signaled using ISUP) then it must be settable by the protocol.",
      "zh-CHS": "b. 一般来说，如果某个东西是由全局信令协议设置的（例如，ISUP允许使用ISUP向mu-Law或a-Law发送信令），那么它必须是可由协议设置的。"
    },
    {
      "indent": 3,
      "text": "c. TDM attributes:",
      "zh-CHS": "c. TDM属性："
    },
    {
      "indent": 3,
      "text": "* Echo cancellation,",
      "zh-CHS": "* 回音消除，"
    },
    {
      "indent": 3,
      "text": "* PCM encoding or other voice compression (e.g. mu-law or A-law),",
      "zh-CHS": "* PCM编码或其他语音压缩（如mu法则或A法则），"
    },
    {
      "indent": 3,
      "text": "* encryption,",
      "zh-CHS": "* 加密，"
    },
    {
      "indent": 3,
      "text": "* rate adaptation (e.g. V.110, or V.120).",
      "zh-CHS": "* 速率自适应（例如V.110或V.120）。"
    },
    {
      "indent": 3,
      "text": "d. for incoming calls, identification of a specific TDM circuit (timeslot and facility).",
      "zh-CHS": "d. 对于来电，识别特定的TDM电路（时隙和设施）。"
    },
    {
      "indent": 3,
      "text": "e. for calls outgoing to the circuit network, identification of a specific circuit or identification of a circuit group with the indication that the MG must select and return the identification of an available member of that group.",
      "zh-CHS": "e. 对于传出电路网络的呼叫，识别特定电路或识别电路组，并指示MG必须选择并返回该组可用成员的标识。"
    },
    {
      "indent": 3,
      "text": "f. specification of the default encoding of content passing to and from a given circuit, possibly on a logical or physical circuit group basis.",
      "zh-CHS": "f. 在逻辑或物理电路组的基础上，对从给定电路传入或传出的内容进行默认编码的规范。"
    },
    {
      "indent": 3,
      "text": "g. specification at any point during the life of a connection of variable aspects of the content encoding, particularly including channel information capacity.",
      "zh-CHS": "g. 在内容编码的可变方面（尤其包括信道信息容量）的连接寿命期间的任何点的规范。"
    },
    {
      "indent": 3,
      "text": "h. specification at any point during the life of a connection of loss padding to be applied to incoming and outgoing media streams at the circuit termination.",
      "zh-CHS": "h. 在电路终端的输入和输出媒体流上应用损耗填充连接寿命期间的任何点的规范。"
    },
    {
      "indent": 3,
      "text": "i. specification at any point during the life of a connection of the applicability of echo cancellation to the outgoing media stream.",
      "zh-CHS": "i. 在连接生命周期内的任何一点上，对传出媒体流回声消除的适用性进行规范。"
    },
    {
      "indent": 3,
      "text": "j. Multi-rate calls to/from the SCN.",
      "zh-CHS": "j. 与SCN之间的多速率呼叫。"
    },
    {
      "indent": 3,
      "text": "k. H-channel (n x 64K) calls to/from the SCN.",
      "zh-CHS": "k. 与SCN之间的H通道（n x 64K）呼叫。"
    },
    {
      "indent": 3,
      "text": "l. B channel aggregation protocols for creating high speed channels for multimedia over the SCN.",
      "zh-CHS": "l. 用于通过SCN为多媒体创建高速通道的B通道聚合协议。"
    },
    {
      "indent": 3,
      "text": "m. Modem terminations and negotiations.",
      "zh-CHS": "m. 调制解调器终止和协商。"
    },
    {
      "indent": 3,
      "text": "The protocol may also allow:",
      "zh-CHS": "该议定书还可允许："
    },
    {
      "indent": 3,
      "text": "n. specification of sub-channel media streams,",
      "zh-CHS": "n. 子信道媒体流的规范，"
    },
    {
      "indent": 3,
      "text": "o. specification of multi-channel media streams.",
      "zh-CHS": "o. 多通道媒体流的规范。"
    },
    {
      "indent": 0,
      "text": "11.1.2. Packet Bearer Type",
      "section_title": true,
      "zh-CHS": "11.1.2. 包承载类型"
    },
    {
      "indent": 3,
      "text": "The protocol must be able to specify:",
      "zh-CHS": "协议必须能够指定："
    },
    {
      "indent": 3,
      "text": "a. ingress and egress coding (i.e. the way packets coming in and out are encoded) (including encryption).",
      "zh-CHS": "a. 入口和出口编码（即进出数据包的编码方式）（包括加密）。"
    },
    {
      "indent": 3,
      "text": "b. near and far-end ports and other session parameters for RTP and RTCP.",
      "zh-CHS": "b. RTP和RTCP的近端和远端端口以及其他会话参数。"
    },
    {
      "indent": 3,
      "text": "The protocol must support reporting of:",
      "zh-CHS": "协议必须支持以下方面的报告："
    },
    {
      "indent": 3,
      "text": "c. re-negotiation of codec for cause - for further study",
      "zh-CHS": "c. 重新协商编解码器的原因-供进一步研究"
    },
    {
      "indent": 3,
      "text": "d. on Trunking and Access Gateways, resources capable of more than one active connection at a time must also be capable of mixing and packet duplication.",
      "zh-CHS": "d. 在中继和访问网关上，一次能够进行多个活动连接的资源还必须能够进行混合和数据包复制。"
    },
    {
      "indent": 3,
      "text": "The protocol must allow:",
      "zh-CHS": "该议定书必须允许："
    },
    {
      "indent": 3,
      "text": "e. specification of parameters for outgoing and incoming packet flows at separate points in the life of the connection (because far-end port addresses are typically obtained through a separate signalling exchange before or after the near-end port addresses are assigned).",
      "zh-CHS": "e. 在连接的生命周期中，在不同的点上为传出和传入数据包流指定参数（因为远端端口地址通常是在分配近端端口地址之前或之后通过单独的信令交换获得的）。"
    },
    {
      "indent": 3,
      "text": "f. the possibility for each Media Gateway to allocate the ports on which it will receive packet flows (including RTCP as well as media streams) and report its allocations to the Media Gateway Controller for signalling to the far end. Note that support of different IP backbone providers on a per call basis would require that the ports on which packets flow be selected by the MGC. (but only if the IP address of the MG is different for each backbone provider).",
      "zh-CHS": "f. 每个媒体网关分配其将接收数据包流（包括RTCP和媒体流）的端口，并将其分配报告给媒体网关控制器以向远端发送信令的可能性。注意，在每次呼叫的基础上支持不同的IP主干网提供商将要求MGC选择数据包在其上流动的端口。（但前提是每个主干网提供商的MG IP地址不同）。"
    },
    {
      "indent": 3,
      "text": "g. the specification at any point during the life of a connection of RTP payload type and RTP session number for each RTP-encapsulated media flow.",
      "zh-CHS": "g. 在每个RTP封装媒体流的RTP有效负载类型和RTP会话号的连接寿命期间的任何时间点的规范。"
    },
    {
      "indent": 3,
      "text": "h. the ability to specify whether outgoing flows are to be uni-cast or multi-cast. Note that on an IP network this information is implicit in the destination address, but in other networks this is a connection parameter.",
      "zh-CHS": "h. 能够指定传出流是单播还是多播。请注意，在IP网络上，此信息隐含在目标地址中，但在其他网络中，这是一个连接参数。"
    },
    {
      "indent": 3,
      "text": "i. invoking of encryption/decryption on media flows and specification of the associated algorithm and key.",
      "zh-CHS": "i. 对媒体流调用加密/解密，并指定相关算法和密钥。"
    },
    {
      "indent": 3,
      "text": "The protocol should also allow:",
      "zh-CHS": "议定书还应允许："
    },
    {
      "indent": 3,
      "text": "j. the MGC to configure non-RTP (proprietary or other) encapsulated packet flows.",
      "zh-CHS": "j. MGC配置非RTP（专有或其他）封装的数据包流。"
    },
    {
      "indent": 0,
      "text": "11.1.3. Bearer type requirements for ATM",
      "section_title": true,
      "zh-CHS": "11.1.3. ATM的承载类型要求"
    },
    {
      "indent": 3,
      "text": "This bearer type is applicable to Trunking GW, Access GW, ....",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "11.1.3.1. Addressing",
      "section_title": true,
      "zh-CHS": "11.1.3.1. 寻址"
    },
    {
      "indent": 3,
      "text": "a. The protocol must be able to specify the following termination attributes:",
      "zh-CHS": "a. 协议必须能够指定以下终止属性："
    },
    {
      "indent": 3,
      "text": "* VC identifier,",
      "zh-CHS": "* VC标识符，"
    },
    {
      "indent": 3,
      "text": "* VC identifier plus AAL2 slot, and variant of these allowing the gateway to choose (part of) the identifier,",
      "zh-CHS": "* VC标识符加上AAL2插槽，以及允许网关选择（部分）标识符的变体，"
    },
    {
      "indent": 3,
      "text": "* remote termination network address, remote MG name.",
      "zh-CHS": "* 远程终端网络地址，远程MG名称。"
    },
    {
      "indent": 3,
      "text": "b. Allow specification of an ATM termination which is to be assigned to an MG connection as a VC identifier, a VC identifier plus AAL2 slot, a wild-carded variant of either of these. A remote termination network address, or a remote MG name could also be used when the MG can select the VC and change the VC during the life of the connection by using ATM signalling.",
      "zh-CHS": "b. 允许将分配给MG连接的ATM终端指定为VC标识符、VC标识符加上AAL2插槽、任意一个的通配符变体。当MG可以通过使用ATM信令选择VC并在连接寿命期间更改VC时，也可以使用远程终端网络地址或远程MG名称。"
    },
    {
      "indent": 3,
      "text": "c. Provide an indication by the MG of the VC identifier and possibly AAL2 slot of the termination actually assigned to a connection.",
      "zh-CHS": "c. 由MG提供VC标识符的指示，可能还有实际分配给连接的终端的AAL2插槽。"
    },
    {
      "indent": 3,
      "text": "d. Provide a means to refer subsequently to that termination.",
      "zh-CHS": "d. 提供随后提及该终止的方式。"
    },
    {
      "indent": 3,
      "text": "e. Refer to an existing VCC as the physical interface + Virtual Path Identifier (VPI) + Virtual Circuit Identifier (VCI).",
      "zh-CHS": "e. 将现有VCC称为物理接口+虚拟路径标识符（VPI）+虚拟电路标识符（VCI）。"
    },
    {
      "indent": 3,
      "text": "f. Where the VCC is locally established (SVCs signalled by the Gateway through UNI or PNNI signalling or similar), the VCC must be indirectly referred to in terms which are of significance to both ends of the VCC. For example, a global name or the ATM address of the ATM devices at each end of the VCC. However, it is possible/probable that there may be several VCCs between a given pair of ATM devices. Therefore the ATM address pair must be further resolved by a VCC identifier unambiguous within the context of the ATM address pair.",
      "zh-CHS": "f. 如果VCC是本地建立的（网关通过UNI或PNNI信令或类似方式发送SVC信号），则必须以对VCC两端都具有重要意义的术语间接提及VCC。例如，VCC两端ATM设备的全局名称或ATM地址。然而，在给定的一对ATM设备之间可能存在多个VCC。因此，ATM地址对必须由在ATM地址对上下文中明确的VCC标识符进一步解析。"
    },
    {
      "indent": 3,
      "text": "g. refer to a VCC as the Remote GW ATM End System Address + VCCI.",
      "zh-CHS": "g. 将VCC称为远程GW ATM终端系统地址+VCCI。"
    },
    {
      "indent": 3,
      "text": "h. allow the VCCI to be selected by the MG or imposed on the MG.",
      "zh-CHS": "h. 允许MG选择VCCI或施加在MG上。"
    },
    {
      "indent": 3,
      "text": "i. support all ATM addressing variants (e.g. ATM End System Address (AESA) and E.164).",
      "zh-CHS": "i. 支持所有ATM寻址变体（例如ATM终端系统地址（AESA）和e.164）。"
    },
    {
      "indent": 0,
      "text": "11.1.3.2. Connection related requirements",
      "section_title": true,
      "zh-CHS": "11.1.3.2. 连接相关要求"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Allow for the de-coupling of creation/deletion of the narrow-band connection from the creation/deletion of the underlying VCC.",
      "zh-CHS": "a. 允许窄带连接的创建/删除与基础VCC的创建/删除分离。"
    },
    {
      "indent": 3,
      "text": "b. Allow for efficient disconnection of all connections associated with a physical port or VCC. As an example, this could aggregate disconnections across a broadband circuit which experienced a physical error.",
      "zh-CHS": "b. 允许有效断开与物理端口或VCC相关的所有连接。例如，这可能会在遇到物理错误的宽带电路上聚合断开。"
    },
    {
      "indent": 3,
      "text": "c. Allow the connection established using this protocol to be carried over a VCC, which may be a:",
      "zh-CHS": "c. 允许使用此协议建立的连接通过VCC进行，VCC可以是："
    },
    {
      "indent": 3,
      "text": "* PVC or SPVC,",
      "zh-CHS": "* PVC或SPVC，"
    },
    {
      "indent": 3,
      "text": "* an SVC established on demand, either by the MGC itself or by a broker acting on its behalf or,",
      "zh-CHS": "* 由MGC自身或代表其行事的经纪人根据要求设立的SVC，或，"
    },
    {
      "indent": 3,
      "text": "* an SVC originated as required by the local MG, or by the remote end to the local MG through UNI or PNNI signalling.",
      "zh-CHS": "* 根据本地MG的要求，或通过UNI或PNNI信令，由本地MG的远程端发起SVC。"
    },
    {
      "indent": 3,
      "text": "d. Allow ATM transport parameters and QoS parameters to be passed to the MG.",
      "zh-CHS": "d. 允许将ATM传输参数和QoS参数传递给MG。"
    },
    {
      "indent": 3,
      "text": "e. Allow blocking and unblocking of a physical interface, a VCC or an AAL1/AAL2 channel.",
      "zh-CHS": "e. 允许阻塞和解除阻塞物理接口、VCC或AAL1/AAL2通道。"
    },
    {
      "indent": 3,
      "text": "The protocol should:",
      "zh-CHS": "议定书应："
    },
    {
      "indent": 3,
      "text": "f. Where a VCC is required to be established on a per narrow-band call basis, allow all necessary information to be passed in one message.",
      "zh-CHS": "f. 如果需要在每个窄带呼叫的基础上建立VCC，则允许在一条消息中传递所有必要的信息。"
    },
    {
      "indent": 0,
      "text": "11.1.3.3. Media adaptation",
      "section_title": true,
      "zh-CHS": "11.1.3.3. 媒体改编"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Allow AAL parameters to be passed to the MG.",
      "zh-CHS": "a. 允许将AAL参数传递给MG。"
    },
    {
      "indent": 3,
      "text": "b. Allow AAL1/AAL2 multiple narrow-band calls to be mapped to a single VCC. For AAL2, these calls are differentiated within each VCC by a AAL2 channel identifier. An AAL2 connection may span more than 1 VCC and transit AAL2 switching devices. ITU Q.2630.1 [2] defines an end-to-end identifier called the Served User Generated Reference (SUGR). It carries information from the originating user of the AAL2 signalling protocol to the terminating user transparently and unmodified.",
      "zh-CHS": "b. 允许AAL1/AAL2多个窄带呼叫映射到单个VCC。对于AAL2，这些调用在每个VCC中由AAL2通道标识符区分。AAL2连接可以跨越1个以上的VCC和传输AAL2交换设备。ITU Q.2630.1[2]定义了一个称为服务用户生成参考（SUGR）的端到端标识符。它将AAL2信令协议的始发用户的信息透明地、未经修改地传送给终端用户。"
    },
    {
      "indent": 3,
      "text": "c. Allow unambiguous binding of a narrow band call to an AAL2 connection identifier, or AAL1 channel, within the specified VCC.",
      "zh-CHS": "c. 允许将窄带调用明确绑定到指定VCC内的AAL2连接标识符或AAL1通道。"
    },
    {
      "indent": 3,
      "text": "d. Allow the AAL2 connection identifier, or AAL1 channel, to be selected by the MG or imposed on the MG.",
      "zh-CHS": "d. 允许MG选择AAL2连接标识符或AAL1通道，或将其施加在MG上。"
    },
    {
      "indent": 3,
      "text": "e. Allow the use of the AAL2 channel identifier (cid) instead of the AAL2 connection identifier.",
      "zh-CHS": "e. 允许使用AAL2通道标识符（cid）而不是AAL2连接标识符。"
    },
    {
      "indent": 3,
      "text": "f. Allow the AAL2 voice profile to be imposed or negotiated before the start of the connection. AAL2 allows for variable length packets and varying packet rates, with multiple codecs possible within a given profile. Thus a given call may upgrade or downgrade the codec within the lifetime of the call. Idle channels may generate zero bandwidth. Thus an AAL2 VCC may vary in bandwidth and possibly exceed its contract. Congestion controls within a gateway may react to congestion by modifying codec rates/types.",
      "zh-CHS": "f. 允许在连接开始之前强制或协商AAL2语音配置文件。AAL2允许可变长度的数据包和不同的数据包速率，在给定的配置文件中可以使用多个编解码器。因此，给定的呼叫可能在呼叫的生存期内升级或降级编解码器。空闲信道可能产生零带宽。因此，AAL2 VCC的带宽可能会有所不同，并可能超过其合同。网关内的拥塞控制可通过修改编解码器速率/类型对拥塞作出反应。"
    },
    {
      "indent": 3,
      "text": "g. Allow the MGC to instruct the MG on how individual narrow-band calls behave under congestion.",
      "zh-CHS": "g. 允许MGC向MG指示单个窄带呼叫在拥塞情况下的行为。"
    },
    {
      "indent": 3,
      "text": "h. Allow for the MGC to specify an AAL5 bearer, with the following choices:",
      "zh-CHS": "h. 允许MGC使用以下选项指定AAL5承载："
    },
    {
      "indent": 3,
      "text": "* Per ATM Forum standard AF-VTOA-0083 [4],",
      "zh-CHS": "* 根据ATM论坛标准AF-VTOA-0083[4]，"
    },
    {
      "indent": 3,
      "text": "* RTP with IP/UDP,",
      "zh-CHS": "* 具有IP/UDP的RTP，"
    },
    {
      "indent": 3,
      "text": "* RTP without IP/IDP per H.323v2 Annex C [5],",
      "zh-CHS": "* 按照H.323v2附录C[5]的要求，不带IP/IDP的RTP，"
    },
    {
      "indent": 3,
      "text": "* Compressed RTP per ATM Forum AF-SAA-0124.000 [6].",
      "zh-CHS": "* 根据ATM论坛AF-SAA-0124.000[6]压缩RTP。"
    },
    {
      "indent": 3,
      "text": "i. Allow unambiguous binding of a narrow band call to an AAL1 channel within the specified VCC. (In AAL1, multiple narrow-band calls may be mapped to a single VCC.)",
      "zh-CHS": "i. 允许将窄带呼叫明确绑定到指定VCC内的AAL1通道。（在AAL1中，多个窄带呼叫可以映射到单个VCC。）"
    },
    {
      "indent": 0,
      "text": "11.1.3.4. Reporting requirements",
      "section_title": true,
      "zh-CHS": "11.1.3.4. 报告要求"
    },
    {
      "indent": 3,
      "text": "The protocol should:",
      "zh-CHS": "议定书应："
    },
    {
      "indent": 3,
      "text": "a. Allow any end-of-call statistics to show loss/restoration of underlying VCC within the calls duration, together with duration of loss.",
      "zh-CHS": "a. 允许任何呼叫结束统计信息显示呼叫持续时间内基础VCC的丢失/恢复以及丢失持续时间。"
    },
    {
      "indent": 3,
      "text": "b. Allow notification, as requested by MGC, of any congestion avoidance actions taken by the MG.",
      "zh-CHS": "b. 允许根据MGC的要求通知MG采取的任何拥塞避免措施。"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "c. Allow for ATM VCCs or AAL2 channels to be audited by the MGC.",
      "zh-CHS": "c. 允许MGC审核ATM VCC或AAL2通道。"
    },
    {
      "indent": 3,
      "text": "d. Allow changes in status of ATM VCCs or AAL2 channels to be notified as requested by the MGC.",
      "zh-CHS": "d. 允许根据MGC的请求通知ATM VCC或AAL2信道的状态变化。"
    },
    {
      "indent": 3,
      "text": "e. Allow the MGC to query the resource and endpoint availability. Resources may include VCCs, and DSPs. VCCs may be up or down. End-points may be connection-free, connected or unavailable.",
      "zh-CHS": "e. 允许MGC查询资源和端点可用性。资源可能包括VCC和DSP。VCC可能上升或下降。端点可以是无连接的、已连接的或不可用的。"
    },
    {
      "indent": 0,
      "text": "11.1.3.5. Functional requirements",
      "section_title": true,
      "zh-CHS": "11.1.3.5. 功能要求"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Allow an MGC to reserve a bearer, and specify a route for it through the network.",
      "zh-CHS": "a. 允许MGC保留承载，并为其指定通过网络的路由。"
    },
    {
      "indent": 0,
      "text": "11.2. Application-Specific Requirements",
      "section_title": true,
      "zh-CHS": "11.2. 特定于应用程序的要求"
    },
    {
      "indent": 0,
      "text": "11.2.1. Trunking Gateway",
      "section_title": true,
      "zh-CHS": "11.2.1. 中继网关"
    },
    {
      "indent": 3,
      "text": "A Trunking Gateway is an interface between SCN networks and Voice over IP or Voice over ATM networks. Such gateways typically interface to SS7 or other NNI signalling on the SCN and manage a large number of digital circuits.",
      "zh-CHS": "中继网关是SCN网络和IP语音或ATM语音网络之间的接口。此类网关通常与SS7或SCN上的其他NNI信令连接，并管理大量数字电路。"
    },
    {
      "indent": 3,
      "text": "The protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Provide circuit and packet-side loopback.",
      "zh-CHS": "a. 提供电路和包侧环回。"
    },
    {
      "indent": 3,
      "text": "b. Provide circuit-side n x 64kbs connections.",
      "zh-CHS": "b. 提供电路侧n x 64kbs连接。"
    },
    {
      "indent": 3,
      "text": "c. Provide subrate and multirate connections for further study.",
      "zh-CHS": "c. 为进一步研究提供子速率和多速率连接。"
    },
    {
      "indent": 3,
      "text": "d. Provide the capability to support Reporting/generation of per-trunk CAS signalling (DP, DTMF, MF, R2, J2, and national variants).",
      "zh-CHS": "d. 提供支持报告/生成每中继CAS信令（DP、DTMF、MF、R2、J2和国家变体）的能力。"
    },
    {
      "indent": 3,
      "text": "e. Provide the capability to support reporting of detected DTMF events either digit-by-digit, as a sequence of detected digits with a flexible mechanism For the MG to determine the likely end of dial string, or in a separate RTP stream.",
      "zh-CHS": "e. 提供支持逐位报告检测到的DTMF事件的功能，作为检测到的数字序列，MG可通过灵活的机制确定拨号字符串的可能结尾，或在单独的RTP流中。"
    },
    {
      "indent": 3,
      "text": "f. Provide the capability to support ANI and DNIS generation and reception.",
      "zh-CHS": "f. 提供支持ANI和DNIS生成和接收的能力。"
    },
    {
      "indent": 0,
      "text": "11.2.2. Access Gateway",
      "section_title": true,
      "zh-CHS": "11.2.2. 接入网关"
    },
    {
      "indent": 3,
      "text": "An Access Gateway connects UNI interfaces like ISDN (PRI and BRI) or traditional analog voice terminal interfaces, to a Voice over IP or Voice over ATM network, or Voice over Frame Relay network.",
      "zh-CHS": "接入网关将诸如ISDN（PRI和BRI）或传统模拟语音终端接口等UNI接口连接到IP语音或ATM语音网络或帧中继语音网络。"
    },
    {
      "indent": 3,
      "text": "The Protocol must:",
      "zh-CHS": "议定书必须："
    },
    {
      "indent": 3,
      "text": "a. Support detection and generation of analog line signaling (hook-state, ring generation).",
      "zh-CHS": "a. 支持检测和生成模拟线路信令（挂钩状态、环生成）。"
    },
    {
      "indent": 3,
      "text": "b. Provide the capability to support reporting of detected DTMF events either digit-by-digit, as a sequence of detected digits with a flexible mechanism For the MG to determine the likely end of dial string, or in a separate RTP stream.",
      "zh-CHS": "b. 提供支持逐位报告检测到的DTMF事件的功能，作为检测到的数字序列，MG可通过灵活的机制确定拨号字符串的可能结尾，或在单独的RTP流中。"
    },
    {
      "indent": 3,
      "text": "c. Not require scripting mechanisms, event buffering, digit map storage when implementing restricted function (1-2 line) gateways with very limited capabilities.",
      "zh-CHS": "c. 在实现功能非常有限的受限功能（1-2行）网关时，不需要脚本机制、事件缓冲、数字映射存储。"
    },
    {
      "indent": 3,
      "text": "d. Provide the capability to support CallerID generation and reception.",
      "zh-CHS": "d. 提供支持CallerID生成和接收的功能。"
    },
    {
      "indent": 3,
      "text": "Proxying of the protocol is for further study.",
      "zh-CHS": "协议代理有待进一步研究。"
    },
    {
      "indent": 0,
      "text": "11.2.3. Trunking/Access Gateway with fax ports",
      "section_title": true,
      "zh-CHS": "11.2.3. 带传真端口的中继/访问网关"
    },
    {
      "indent": 3,
      "text": "a. the protocol must be able to indicate detection of fax media.",
      "zh-CHS": "a. 协议必须能够指示传真媒体的检测。"
    },
    {
      "indent": 3,
      "text": "b. the protocol must be able to specify T.38 for the transport of the fax.",
      "zh-CHS": "b. 协议必须能够指定传真传输的T.38。"
    },
    {
      "indent": 3,
      "text": "c. the protocol must be able to specify G.711 encoding for transport of fax tones across a packet network.",
      "zh-CHS": "c. 协议必须能够指定G.711编码，以便通过分组网络传输传真音。"
    },
    {
      "indent": 0,
      "text": "11.2.4. Trunking/Access Gateway with text telephone access ports",
      "section_title": true,
      "zh-CHS": "11.2.4. 带文本电话接入端口的中继/接入网关"
    },
    {
      "indent": 3,
      "text": "An access gateway with ports capable of text telephone communication, must provide communication between text telephones in the SCN and text conversation channels in the packet network.",
      "zh-CHS": "具有文本电话通信端口的接入网关必须提供SCN中的文本电话和分组网络中的文本会话信道之间的通信。"
    },
    {
      "indent": 3,
      "text": "Text telephone capability of ports is assumed to be possible to combine with other options for calls as described in section 11.2.6 (e.) on \"Adaptable NASes\".",
      "zh-CHS": "假设端口的文本电话功能可以与第11.2.6（e）节“自适应NASE”中所述的其他呼叫选项相结合。"
    },
    {
      "indent": 3,
      "text": "The port is assumed to adjust for the differences in the supported text telephone protocols, so that the text media stream can be communicated T.140 coded in the packet network without further transcoding [7].",
      "zh-CHS": "假定端口针对支持的文本电话协议中的差异进行调整，以便文本媒体流可以在分组网络中进行T.140编码的通信，而无需进一步转码[7]。"
    },
    {
      "indent": 3,
      "text": "The protocol must be capable of reporting the type of text telephone that is connected to the SCN port. The foreseen types are the same as the ones supported by ITU-T V.18: DTMF, EDT, Baudot-45, Baudot-50, Bell, V.21, Minitel and V.18. It should be possible to control which protocols are supported. The SCN port is assumed to contain ITU-T V.18 functionality [8].",
      "zh-CHS": "协议必须能够报告连接到SCN端口的文本电话类型。预计的类型与ITU-T V.18支持的类型相同：DTMF、EDT、Baudot-45、Baudot-50、Bell、V.21、Minitel和V.18。应该可以控制支持哪些协议。假定SCN端口包含ITU-T V.18功能[8]。"
    },
    {
      "indent": 3,
      "text": "The protocol must be able to control the following functionality levels of text telephone support:",
      "zh-CHS": "协议必须能够控制文本电话支持的以下功能级别："
    },
    {
      "indent": 3,
      "text": "a. Simple text-only support: The call is set into text mode from the beginning of the call, in order to conduct a text-only conversation.",
      "zh-CHS": "a. 简单纯文本支持：为了进行纯文本对话，从通话一开始就将通话设置为文本模式。"
    },
    {
      "indent": 3,
      "text": "b. Alternating text-voice support: The call may begin in voice mode or text mode and, at any moment during the call, change mode on request by the SCN user. On the packet side, the two media streams for voice and text must be opened, and it must be possible to control the feeding of each stream by the protocol.",
      "zh-CHS": "b. 交替文本语音支持：呼叫可以在语音模式或文本模式下开始，并且在呼叫过程中的任何时候，根据SCN用户的请求更改模式。在分组端，必须打开语音和文本的两个媒体流，并且必须能够通过协议控制每个流的馈送。"
    },
    {
      "indent": 3,
      "text": "c. Simultaneous text and voice support: The call is performed in a mode when simultaneous text and voice streams are supported. The call may start in voice mode and during the call change state to a text-and-voice call.",
      "zh-CHS": "c. 同时支持文本和语音：在同时支持文本和语音流的模式下执行呼叫。通话可以在语音模式下开始，并在通话期间将状态更改为文本和语音通话。"
    },
    {
      "indent": 3,
      "text": "A port may implement only level a, or any level combination of a, b and c, always including level a.",
      "zh-CHS": "一个端口只能实现级别A，或A、b和c的任何级别组合，始终包括级别A。"
    },
    {
      "indent": 3,
      "text": "The protocol must support:",
      "zh-CHS": "该议定书必须支持："
    },
    {
      "indent": 3,
      "text": "d. A text based alternative to the interactive voice response, or audio resource functionality of the gateway when the port is used in text telephone mode.",
      "zh-CHS": "d. 在文本电话模式下使用端口时，网关的交互式语音响应或音频资源功能的基于文本的替代方案。"
    },
    {
      "indent": 3,
      "text": "e. Selection of what national translation table to be used between the Unicode based T.140 and the 5-7 bit based text telephone protocols.",
      "zh-CHS": "e. 选择基于Unicode的T.140和基于5-7位的文本电话协议之间要使用的国家翻译表。"
    },
    {
      "indent": 3,
      "text": "f. Control of the V.18 probe message to be used on incoming calls.",
      "zh-CHS": "f. 控制用于传入呼叫的V.18 probe消息。"
    },
    {
      "indent": 0,
      "text": "11.2.5. Network Access Server",
      "section_title": true,
      "zh-CHS": "11.2.5. 网络访问服务器"
    },
    {
      "indent": 3,
      "text": "A NAS is an access gateway, or Media Gateway (MG), which terminates modem signals or synchronous HDLC connections from a network (e.g. SCN or xDSL network) and provides data access to the packet network. Only those requirements specific to a NAS are described here.",
      "zh-CHS": "NAS是一个访问网关或媒体网关（MG），它终止来自网络（例如SCN或xDSL网络）的调制解调器信号或同步HDLC连接，并提供对分组网络的数据访问。此处仅描述NAS特有的要求。"
    },
    {
      "indent": 3,
      "text": "Figure 1 provides a reference architecture for a Network Access Server (NAS). Signaling comes into the MGC and the MGC controls the NAS.",
      "zh-CHS": "图1提供了网络访问服务器（NAS）的参考体系结构。信令进入MGC，MGC控制NAS。"
    },
    {
      "indent": 15,
      "text": "           +-------+        +-------+\nSignaling  |       |        |       |\n-----------+  MGC  +        |  AAA  |\n           |       |        |       |\n           +---+---+        +--+----+\n               |               |\n         Megaco|_______________|\n                               |\n                               |\n           +---+---+         ~~|~~~\n Bearer    |       |        (      )\n-----------+  NAS  +-------(   IP   )\n           |       |        (      )\n           +-------+         ~~~~~~",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 18,
      "text": "Figure 1: NAS reference architecture",
      "zh-CHS": "图1:NAS参考体系结构"
    },
    {
      "indent": 3,
      "text": "The Protocol must support:",
      "zh-CHS": "该议定书必须支持："
    },
    {
      "indent": 3,
      "text": "a. Callback capabilities:",
      "zh-CHS": "a. 回调功能："
    },
    {
      "indent": 3,
      "text": "* Callback",
      "zh-CHS": "* 回拨"
    },
    {
      "indent": 3,
      "text": "b. Modem calls. The protocol must be able to specify the modem type(s) to be used for the call.",
      "zh-CHS": "b. 调制解调器呼叫。协议必须能够指定用于呼叫的调制解调器类型。"
    },
    {
      "indent": 3,
      "text": "c. Carriage of bearer information. The protocol must be able to specify the data rate of the TDM connection (e.g., 64 kbit/s, 56 kbit/s, 384 kbit/s), if this is available from the SCN.",
      "zh-CHS": "c. 承载信息的运输。协议必须能够指定TDM连接的数据速率（例如，64 kbit/s、56 kbit/s、384 kbit/s），前提是可以从SCN获得该速率。"
    },
    {
      "indent": 3,
      "text": "d. Rate Adaptation: The protocol must be able to specify the type of rate adaptation to be used for the call including indicating the subrate, if this is available from the SCN (e.g. 56K, or V.110 signaled in Bearer capabilities with subrate connection of 19.2kbit/s).",
      "zh-CHS": "d. 速率适配：协议必须能够指定用于呼叫的速率适配类型，包括指示子速率（如果可以从SCN获得）（例如，在承载能力中以19.2kbit/s的子速率连接发送56K或V.110信号）。"
    },
    {
      "indent": 3,
      "text": "e. Adaptable NASes: The protocol must be able to support multiple options for an incoming call to allow the NAS to dynamically select the proper type of call. For example, an incoming ISDN call coded for \"Speech\" Bearer Capability could actually be a voice, modem, fax, text telephone, or 56 kbit/s synchronous call. The protocol should allow the NAS to report back to the MGC the actual type of call once it is detected.",
      "zh-CHS": "e. 自适应NASS：协议必须能够支持传入呼叫的多个选项，以允许NAS动态选择适当的呼叫类型。例如，编码为“语音”承载能力的传入ISDN呼叫实际上可以是语音、调制解调器、传真、文本电话或56 kbit/s同步呼叫。协议应允许NAS在检测到实际的呼叫类型后向MGC报告。"
    },
    {
      "indent": 3,
      "text": "The 4 basic types of bearer for a NAS are:",
      "zh-CHS": "NAS的4种基本承载类型为："
    },
    {
      "indent": 3,
      "text": "1. Circuit Mode, 64-kbps, 8-khz structured, Speech",
      "zh-CHS": "1. 电路模式，64 kbps，8-khz结构化，语音"
    },
    {
      "indent": 3,
      "text": "2. Circuit Mode, 64-kbps, 8-khz structured, 3.1-khz, Audio",
      "zh-CHS": "2. 电路模式，64 kbps，8-khz结构化，3.1-khz，音频"
    },
    {
      "indent": 3,
      "text": "3. Circuit Mode, 64-kbps, 8-khz structured, Unrestricted Digital Transmission-Rate Adapted from 56-kbps",
      "zh-CHS": "3. 电路模式，64 kbps，8-khz结构化，不受限制的数字传输速率，适用于56 kbps"
    },
    {
      "indent": 3,
      "text": "4. Circuit Mode, 64-kbps, 8-khz structure, Unrestricted Digital Transmission",
      "zh-CHS": "4. 电路模式，64 kbps，8-khz结构，无限制数字传输"
    },
    {
      "indent": 3,
      "text": "f. Passage of Called and Calling Party Number information to the NAS from the MGC. Also, passage of Charge Number/Billing Number, Redirecting Number, and Original Call Number, if known, to the NAS from the MGC. If there are other Q.931 fields that need to be passed from the MGC to the MG, then it should be possible to pass them [9].",
      "zh-CHS": "f. 将被叫方和主叫方号码信息从MGC传送到NAS。此外，收费号码/账单号码、重定向号码和原始呼叫号码（如果已知）从MGC传送到NAS。如果有其他Q.931字段需要从MGC传递到MG，那么应该可以传递它们[9]。"
    },
    {
      "indent": 3,
      "text": "g. Ability for the MGC to direct the NAS to connect to a specific tunnel, for example to an LNS, or to an AAA server.",
      "zh-CHS": "g. MGC引导NAS连接到特定隧道的能力，例如连接到LNS或AAA服务器。"
    },
    {
      "indent": 3,
      "text": "h. When asked by the MGC, be able to report capability information, for example, connection types (V.34/V90/Synch ISDN..), AAA mechanism (RADIUS/DIAMETER/..), access type (PPP/SLIP/..) after restart or upgrade.",
      "zh-CHS": "h. 当MGC要求时，能够报告能力信息，例如，重新启动或升级后的连接类型（V.34/V90/Synch ISDN..）、AAA机制（半径/直径/）、访问类型（PPP/SLIP/）。"
    },
    {
      "indent": 0,
      "text": "11.2.6. Restricted Capability Gateway",
      "section_title": true,
      "zh-CHS": "11.2.6. 受限能力网关"
    },
    {
      "indent": 3,
      "text": "The requirements here may also be applied to small analog gateways, and to cable/xDSL modems. See also the section on access gateways.",
      "zh-CHS": "此处的要求也适用于小型模拟网关和电缆/xDSL调制解调器。另请参见访问网关部分。"
    },
    {
      "indent": 3,
      "text": "The Protocol must support:",
      "zh-CHS": "该议定书必须支持："
    },
    {
      "indent": 3,
      "text": "a. The ability to provide a scaled down version of the protocol. When features of the protocol are not supported, an appropriate error message must be sent. Appropriate default action must be defined. Where this is defined may be outside the scope of the protocol.",
      "zh-CHS": "a. 能够提供协议的缩小版本。当协议的功能不受支持时，必须发送相应的错误消息。必须定义适当的默认操作。如有定义，则可能超出协议范围。"
    },
    {
      "indent": 3,
      "text": "b. The ability to provide device capability information to the MGC with respect to the use of the protocol.",
      "zh-CHS": "b. 向MGC提供有关协议使用的设备能力信息的能力。"
    },
    {
      "indent": 0,
      "text": "11.2.7. Multimedia Gateway",
      "section_title": true,
      "zh-CHS": "11.2.7. 多媒体网关"
    },
    {
      "indent": 3,
      "text": "The protocol must have sufficient capability to support a multimedia gateway. H.320 and H.324 are characterized by a single data stream with multiple media streams multiplexed on it.",
      "zh-CHS": "协议必须具有足够的能力来支持多媒体网关。H.320和H.324的特征是具有多路复用的多个媒体流的单个数据流。"
    },
    {
      "indent": 3,
      "text": "If the mapping is from H.320 or H.324 on the circuit side, and H.323 on the packet side, it is assumed that the MG knows how to map respective subchannels from H.320/H.324 side to streams on packet side. If extra information is required when connecting two terminations, then it must be supplied so that the connections are not ambiguous.",
      "zh-CHS": "如果映射来自电路侧的H.320或H.324，以及分组侧的H.323，则假设MG知道如何将各个子信道从H.320/H.324侧映射到分组侧的流。如果在连接两个终端时需要额外的信息，则必须提供该信息，以便连接不会模棱两可。"
    },
    {
      "indent": 3,
      "text": "The Multimedia Gateway:",
      "zh-CHS": "多媒体网关："
    },
    {
      "indent": 3,
      "text": "1) should support Bonding Bearer channel aggregation,",
      "zh-CHS": "1) 应支持绑定承载通道聚合，"
    },
    {
      "indent": 3,
      "text": "2) must support 2xB (and possibly higher rates) aggregation via H.221,",
      "zh-CHS": "2) 必须通过H.221支持2xB（可能更高的速率）聚合，"
    },
    {
      "indent": 3,
      "text": "3) must be able to dynamically change the size of audio, video and data channels within the h.320 multiplex,",
      "zh-CHS": "3) 必须能够动态改变h.320多路复用内音频、视频和数据通道的大小，"
    },
    {
      "indent": 3,
      "text": "4) must react to changes in the H.320 multiplex on 20 msec boundaries,",
      "zh-CHS": "4) 必须在20毫秒边界上对H.320多路传输的变化作出反应，"
    },
    {
      "indent": 3,
      "text": "5) must support TCS4/IIS BAS commands,",
      "zh-CHS": "5) 必须支持TCS4/IIS BAS命令，"
    },
    {
      "indent": 3,
      "text": "6) must support detection and creation of DTMF tones,",
      "zh-CHS": "6) 必须支持检测和创建DTMF音调，"
    },
    {
      "indent": 3,
      "text": "7) should support SNMP MIBS as specified in H.341 [3]",
      "zh-CHS": "7) 应支持H.341[3]中规定的SNMP MIB"
    },
    {
      "indent": 3,
      "text": "a. If some of the above cannot be handled by the MGC to MG protocol due to timing constraints, then it is likely that the H.245 to H.242 processing must take place in the MG. Otherwise, support for this functionality in the multimedia gateway are protocol requirements.",
      "zh-CHS": "a. 如果由于时间限制，MGC-to-MG协议无法处理上述部分内容，则H.245到H.242处理可能必须在MG中进行。否则，在多媒体网关中支持此功能是协议要求。"
    },
    {
      "indent": 3,
      "text": "b. It must be possible on a call by call basis for the protocol to specify different applications. Thus, one call might be PSTN to PSTN under SS7 control, while the next might be ISDN/H.320 under SS7 control to H.323. This is only one example; the key requirement is that the protocol not prevent such applications.",
      "zh-CHS": "b. 协议必须能够在逐个调用的基础上指定不同的应用程序。因此，一个呼叫可能是SS7控制下的PSTN到PSTN，而下一个呼叫可能是SS7控制下的ISDN/H.320到H.323。这只是一个例子；关键要求是协议不阻止此类应用。"
    },
    {
      "indent": 0,
      "text": "11.2.8. Audio Resource Function",
      "section_title": true,
      "zh-CHS": "11.2.8. 音频资源功能"
    },
    {
      "indent": 3,
      "text": "An Audio Resource Function (ARF) consists of one or more functional modules which can be deployed on an stand alone media gateway server IVR, Intelligent Peripheral, speech/speaker recognition unit, etc. or a traditional media gateway. Such a media gateway is known as an Audio Enabled Gateway (AEG) if it performs tasks defined in one or more of the following ARF functional modules:",
      "zh-CHS": "音频资源功能（ARF）由一个或多个功能模块组成，可部署在独立媒体网关服务器IVR、智能外围设备、语音/说话人识别单元等或传统媒体网关上。如果此类媒体网关执行以下一个或多个ARF功能模块中定义的任务，则称为音频启用网关（AEG）："
    },
    {
      "indent": 19,
      "text": "Play Audio, DTMF Collect, Record Audio, Speech Recognition, Speaker Verification/Identification, Auditory Feature Extraction/Recognition, or Audio Conferencing.",
      "zh-CHS": "播放音频、DTMF采集、录制音频、语音识别、说话人验证/识别、听觉特征提取/识别或音频会议。"
    },
    {
      "indent": 3,
      "text": "Additional ARF function modules that support human to machine communications through the use of telephony tones (e.g., DTMF) or auditory means (e.g. speech) may be appended to the AEG definition in future versions of these requirements.",
      "zh-CHS": "在这些要求的未来版本中，可将通过使用电话铃声（如DTMF）或听觉手段（如语音）支持人机通信的附加ARF功能模块附加到AEG定义中。"
    },
    {
      "indent": 3,
      "text": "Generic scripting packages for any module must support all the requirements for that module. Any package extension for a given module must include, by inheritance or explicit reference, the requirements for that given module.",
      "zh-CHS": "任何模块的通用脚本包都必须支持该模块的所有要求。给定模块的任何包扩展必须通过继承或显式引用包含该给定模块的需求。"
    },
    {
      "indent": 3,
      "text": "The protocol requirements for each of the ARF modules are provided in the following subsections.",
      "zh-CHS": "以下小节提供了每个ARF模块的协议要求。"
    },
    {
      "indent": 0,
      "text": "11.2.8.1. Play Audio Module",
      "section_title": true,
      "zh-CHS": "11.2.8.1. 播放音频模块"
    },
    {
      "indent": 3,
      "text": "a. Be able to provide the following basic operation:",
      "zh-CHS": "a. 能够提供以下基本操作："
    },
    {
      "indent": 3,
      "text": "- request an ARF MG to play an announcement.",
      "zh-CHS": "- 请求ARF MG播放公告。"
    },
    {
      "indent": 3,
      "text": "b. Be able to specify these play characteristics:",
      "zh-CHS": "b. 能够指定这些播放特征："
    },
    {
      "indent": 3,
      "text": "- Play volume",
      "zh-CHS": "- 播放音量"
    },
    {
      "indent": 3,
      "text": "- Play speed",
      "zh-CHS": "- 播放速度"
    },
    {
      "indent": 3,
      "text": "- Play iterations",
      "zh-CHS": "- 播放迭代"
    },
    {
      "indent": 3,
      "text": "- Interval between play iterations",
      "zh-CHS": "- 播放迭代之间的间隔"
    },
    {
      "indent": 3,
      "text": "- Play duration",
      "zh-CHS": "- 播放时间"
    },
    {
      "indent": 3,
      "text": "c. Permit the specification of voice variables such as DN, number, date, time, etc. The protocol must allow specification of both the value (eg 234-3456), and well as the type (Directory number).",
      "zh-CHS": "c. 允许指定语音变量，如DN、数字、日期、时间等。协议必须允许指定值（如234-3456）和类型（目录号）。"
    },
    {
      "indent": 3,
      "text": "d. Using the terminology that a segment is a unit of playable speech, or is an abstraction that is resolvable to a unit of playable speech, permit specification of the following segment types:",
      "zh-CHS": "d. 使用段是可播放语音单元或可解析为可播放语音单元的抽象的术语，允许指定以下段类型："
    },
    {
      "indent": 3,
      "text": "- A provisioned recording.",
      "zh-CHS": "- 提供的录音。"
    },
    {
      "indent": 3,
      "text": "- A block of text to be converted to speech.",
      "zh-CHS": "- 要转换为语音的文本块。"
    },
    {
      "indent": 3,
      "text": "- A block of text to be displayed on a device.",
      "zh-CHS": "- 要在设备上显示的文本块。"
    },
    {
      "indent": 3,
      "text": "- A length of silence qualified by duration.",
      "zh-CHS": "- 以持续时间限定的沉默时间。"
    },
    {
      "indent": 3,
      "text": "- An algorithmically generated tone.",
      "zh-CHS": "- 算法生成的音调。"
    },
    {
      "indent": 3,
      "text": "- A voice variable, specified by type and value. Given a variable type and value, the IVR/ARF unit would dynamically assemble the phrases required for its playback.",
      "zh-CHS": "- 语音变量，由类型和值指定。给定一个变量类型和值，IVR/ARF单元将动态组合回放所需的短语。"
    },
    {
      "indent": 3,
      "text": "- An abstraction that represents a sequence of audio segments. Nesting of these abstractions must also be permitted.",
      "zh-CHS": "- 表示音频段序列的抽象。还必须允许嵌套这些抽象。"
    },
    {
      "indent": 3,
      "text": "An example of this abstraction is a sequence of audio segments, the first of which is a recording of the words \"The number you have dialed\", followed by a Directory Number variable, followed by a recording of the words \"is no longer in service\".",
      "zh-CHS": "这种抽象的一个例子是音频段序列，第一个是记录“您拨打的号码”，然后是目录号变量，然后是记录“不再使用”字样。"
    },
    {
      "indent": 3,
      "text": "- An abstraction that represents a set of audio segments and which is resolved to a single segment by a qualifier. Nesting of these abstractions must be permitted.",
      "zh-CHS": "- 一种抽象，表示一组音频段，并通过限定符解析为单个段。必须允许嵌套这些抽象。"
    },
    {
      "indent": 3,
      "text": "For example take a set of audio segments recorded in different languages all of which express the semantic concept \"The number you have dialed is no longer in service\". The set is resolved by a language qualifier. If the qualifier is \"French\", the set resolves to the French version of this announcement.",
      "zh-CHS": "例如，以不同语言录制的一组音频片段为例，所有这些音频片段都表达了语义概念“您拨打的号码不再服务”。该集合由语言限定符解析。如果限定符为“法语”，则集合解析为本公告的法语版本。"
    },
    {
      "indent": 3,
      "text": "In the case of a nested abstraction consisting of a set qualified by language at one level and and a set qualified by gender at another level, it would be possible to specify that an announcement be played in French and spoken by a female voice.",
      "zh-CHS": "在嵌套抽象的情况下，由一个级别的语言限定集和另一个级别的性别限定集组成，可以指定用法语播放公告，并由女声讲话。"
    },
    {
      "indent": 3,
      "text": "e. Provide two different methods of audio specification:",
      "zh-CHS": "e. 提供两种不同的音频规格说明方法："
    },
    {
      "indent": 3,
      "text": "- Direct specification of the audio components to be played by specifying the sequence of segments in the command itself.",
      "zh-CHS": "- 通过在命令本身中指定片段序列，直接指定要播放的音频组件。"
    },
    {
      "indent": 3,
      "text": "- Indirect specification of the audio components to be played by reference to a single identifier that resolves to a provisioned sequence of audio segments.",
      "zh-CHS": "- 通过引用解析为已提供的音频段序列的单个标识符来间接指定要播放的音频组件。"
    },
    {
      "indent": 0,
      "text": "11.2.8.2. DTMF Collect Module",
      "section_title": true,
      "zh-CHS": "11.2.8.2. DTMF采集模块"
    },
    {
      "indent": 3,
      "text": "The DTMF Collect Module must support all of the requirements in the Play Module in addition to the following requirements:",
      "zh-CHS": "除以下要求外，DTMF采集模块还必须支持播放模块中的所有要求："
    },
    {
      "indent": 3,
      "text": "a. Be able to provide the following basic operation:",
      "zh-CHS": "a. 能够提供以下基本操作："
    },
    {
      "indent": 3,
      "text": "- request an AEG to play an announcement, which may optionally terminated by DTMF, and then collect DTMF",
      "zh-CHS": "- 请求AEG播放公告，该公告可选择性地由DTMF终止，然后收集DTMF"
    },
    {
      "indent": 3,
      "text": "b. Be able to specify these event collection characteristics:",
      "zh-CHS": "b. 能够指定以下事件集合特征："
    },
    {
      "indent": 3,
      "text": "- The number of attempts to give the user to enter a valid DTMF pattern.",
      "zh-CHS": "- 尝试让用户输入有效DTMF模式的次数。"
    },
    {
      "indent": 3,
      "text": "c. With respect to digit timers, allow the specification of:",
      "zh-CHS": "c. 对于数字计时器，允许指定："
    },
    {
      "indent": 3,
      "text": "- Time allowed to enter the first digit.",
      "zh-CHS": "- 允许输入第一位数字的时间。"
    },
    {
      "indent": 3,
      "text": "- Time allowed for user to enter each digit subsequent to the first digit.",
      "zh-CHS": "- 允许用户在第一个数字之后输入每个数字的时间。"
    },
    {
      "indent": 3,
      "text": "- Time allowed for user to enter a digit once the maximum expected number of digits has been entered.",
      "zh-CHS": "- 一旦输入了预期的最大位数，允许用户输入位数的时间。"
    },
    {
      "indent": 3,
      "text": "d. To be able to allow multiple prompt operations DTMF digit collection, voice recording (if supported), and/or speech recognition analysis (if supported) provide the following types of prompts:",
      "zh-CHS": "d. 为了能够允许多个提示操作，DTMF数字采集、语音记录（如果支持）和/或语音识别分析（如果支持）提供以下类型的提示："
    },
    {
      "indent": 3,
      "text": "- Initial Prompt",
      "zh-CHS": "- 初始提示"
    },
    {
      "indent": 3,
      "text": "- Reprompt",
      "zh-CHS": "- 责备"
    },
    {
      "indent": 3,
      "text": "- Error prompt",
      "zh-CHS": "- 错误提示"
    },
    {
      "indent": 3,
      "text": "- Failure announcement",
      "zh-CHS": "- 失败公告"
    },
    {
      "indent": 3,
      "text": "- Success announcement.",
      "zh-CHS": "- 成功公告。"
    },
    {
      "indent": 3,
      "text": "e. To allow digit pattern matching, allow the specification of:",
      "zh-CHS": "e. 要允许数字模式匹配，请允许指定："
    },
    {
      "indent": 3,
      "text": "- maximum number of digits to collect.",
      "zh-CHS": "- 要收集的最大位数。"
    },
    {
      "indent": 3,
      "text": "- minimum number of digits to collect.",
      "zh-CHS": "- 要收集的最小位数。"
    },
    {
      "indent": 3,
      "text": "- a digit pattern using a regular expression.",
      "zh-CHS": "- 使用正则表达式的数字模式。"
    },
    {
      "indent": 3,
      "text": "f. To allow digit buffer control, allow the specification of:",
      "zh-CHS": "f. 要允许数字缓冲区控制，请允许指定："
    },
    {
      "indent": 3,
      "text": "- Ability to clear digit buffer prior to playing initial prompt (default is not to clear buffer).",
      "zh-CHS": "- 能够在播放初始提示之前清除数字缓冲区（默认情况下不清除缓冲区）。"
    },
    {
      "indent": 3,
      "text": "- Default clearing of buffer following playing of un-interruptible announcement segment.",
      "zh-CHS": "- 播放不可中断的公告段后默认清除缓冲区。"
    },
    {
      "indent": 3,
      "text": "- Default clearing of buffer before playing a re-prompt in response to previous invalid input.",
      "zh-CHS": "- 在播放响应先前无效输入的重新提示之前，默认清除缓冲区。"
    },
    {
      "indent": 3,
      "text": "g. Provide a method to specify DTMF interruptibility on a per audio segment basis.",
      "zh-CHS": "g. 提供一种基于每个音频段指定DTMF可中断性的方法。"
    },
    {
      "indent": 3,
      "text": "h. Allow the specification of definable key sequences for DTMF digit collection to:",
      "zh-CHS": "h. 允许指定DTMF数字采集的可定义键序列："
    },
    {
      "indent": 3,
      "text": "- Discard collected digits in progress, replay the prompt, and resume DTMF digit collection.",
      "zh-CHS": "- 丢弃正在收集的数字，重播提示，然后恢复DTMF数字收集。"
    },
    {
      "indent": 3,
      "text": "- Discard collected digits in progress and resume DTMF digit collection.",
      "zh-CHS": "- 丢弃正在收集的数字并恢复DTMF数字收集。"
    },
    {
      "indent": 3,
      "text": "- Terminate the current operation and return the terminating key sequence to the MGC.",
      "zh-CHS": "- 终止当前操作并将终止键序列返回给MGC。"
    },
    {
      "indent": 3,
      "text": "i. Provide a way to ask the ARF MG to support the following definable keys for digit collection and recording. These keys would then be able to be acted upon by the ARF MG:",
      "zh-CHS": "i. 提供一种方法，要求ARF MG支持以下可定义的数字采集和记录键。然后，ARF MG可以对这些键进行操作："
    },
    {
      "indent": 3,
      "text": "- A key to terminate playing of an announcement in progress.",
      "zh-CHS": "- 终止正在播放的公告的键。"
    },
    {
      "indent": 3,
      "text": "- A set of one or more keys that can be accepted as the first digit to be collected.",
      "zh-CHS": "- 一组一个或多个键，可作为要收集的第一个数字。"
    },
    {
      "indent": 3,
      "text": "- A key that signals the end of user input. The key may or may not be returned to the MGC along with the input already collected.",
      "zh-CHS": "- 表示用户输入结束的键。密钥可能会也可能不会与已收集的输入一起返回给MGC。"
    },
    {
      "indent": 3,
      "text": "- Keys to stop playing the current announcement and resume playing at the beginning of the first segment of the announcement, last segment of the announcement, previous segment of the announcement, next segment of the announcement, or the current announcement segment.",
      "zh-CHS": "- 停止播放当前公告并在公告的第一段、最后一段、上一段、下一段或当前公告段开始时继续播放的按键。"
    },
    {
      "indent": 0,
      "text": "11.2.8.3. Record Audio Module",
      "section_title": true,
      "zh-CHS": "11.2.8.3. 录音音频模块"
    },
    {
      "indent": 3,
      "text": "The Record Module must support all of the requirements in the Play Module as in addition to the following requirements:",
      "zh-CHS": "除以下要求外，录制模块还必须支持播放模块中的所有要求："
    },
    {
      "indent": 3,
      "text": "a. Be able to provide the following basic operation:",
      "zh-CHS": "a. 能够提供以下基本操作："
    },
    {
      "indent": 3,
      "text": "- request an AEG to play an announcement and then record voice.",
      "zh-CHS": "- 请求AEG播放公告，然后录制语音。"
    },
    {
      "indent": 3,
      "text": "b. Be able to specify these event collection characteristics:",
      "zh-CHS": "b. 能够指定以下事件集合特征："
    },
    {
      "indent": 3,
      "text": "- The number of attempts to give the user to make a recording.",
      "zh-CHS": "- 尝试让用户进行录制的次数。"
    },
    {
      "indent": 3,
      "text": "c. With respect to recording timers, allow the specification of:",
      "zh-CHS": "c. 关于记录计时器，允许指定："
    },
    {
      "indent": 3,
      "text": "- Time to wait for the user to initially speak.",
      "zh-CHS": "- 等待用户最初发言的时间。"
    },
    {
      "indent": 3,
      "text": "- The amount of silence necessary following the last speech segment for the recording to be considered complete.",
      "zh-CHS": "- 在最后一段讲话之后，认为录音已完成所需的沉默量。"
    },
    {
      "indent": 3,
      "text": "- The maximum allowable length of the recording (not including pre- and post- speech silence).",
      "zh-CHS": "- 录音的最大允许长度（不包括演讲前和演讲后的沉默）。"
    },
    {
      "indent": 3,
      "text": "d. To be able to allow multiple prompt operations for DTMF digit collection (if supported), voice recording (if supported), speech recognition analysis (if supported) and/or speech verification/identification (if supported) and then to provide the following types of prompts:",
      "zh-CHS": "d. 能够对DTMF数字采集（如果支持）、语音记录（如果支持）、语音识别分析（如果支持）和/或语音验证/识别（如果支持）进行多个提示操作，然后提供以下类型的提示："
    },
    {
      "indent": 3,
      "text": "- Initial Prompt",
      "zh-CHS": "- 初始提示"
    },
    {
      "indent": 3,
      "text": "- Reprompt",
      "zh-CHS": "- 责备"
    },
    {
      "indent": 3,
      "text": "- Error prompt",
      "zh-CHS": "- 错误提示"
    },
    {
      "indent": 3,
      "text": "- Failure announcement",
      "zh-CHS": "- 失败公告"
    },
    {
      "indent": 3,
      "text": "- Success announcement.",
      "zh-CHS": "- 成功公告。"
    },
    {
      "indent": 3,
      "text": "e. Allow the specification of definable key sequences for digit recording or speech recognition analysis (if supported) to:",
      "zh-CHS": "e. 允许为数字记录或语音识别分析（如果支持）指定可定义的键序列："
    },
    {
      "indent": 3,
      "text": "- Discard recording in progress, replay the prompt, and resume recording.",
      "zh-CHS": "- 放弃正在进行的录制，重播提示，然后继续录制。"
    },
    {
      "indent": 3,
      "text": "- Discard recording in progress and resume recording.",
      "zh-CHS": "- 放弃正在进行的录制并继续录制。"
    },
    {
      "indent": 3,
      "text": "- Terminate the current operation and return the terminating key sequence to the MGC.",
      "zh-CHS": "- 终止当前操作并将终止键序列返回给MGC。"
    },
    {
      "indent": 3,
      "text": "f. Provide a way to ask the ARF MG to support the following definable keys for recording. These keys would then be able to be acted upon by the ARF MG:",
      "zh-CHS": "f. 提供一种方法，要求ARF MG支持以下可定义的录制键。然后，ARF MG可以对这些键进行操作："
    },
    {
      "indent": 3,
      "text": "- A key to terminate playing of an announcement in progress.",
      "zh-CHS": "- 终止正在播放的公告的键。"
    },
    {
      "indent": 3,
      "text": "- A key that signals the end of user input. The key may or may not be returned to the MGC along with the input already collected.",
      "zh-CHS": "- 表示用户输入结束的键。密钥可能会也可能不会与已收集的输入一起返回给MGC。"
    },
    {
      "indent": 3,
      "text": "- Keys to stop playing the current announcement and resume playing at the beginning of the first segment of the announcement, last segment of the announcement, previous segment of the announcement, next segment of the announcement, or the current announcement segment.",
      "zh-CHS": "- 停止播放当前公告并在公告的第一段、最后一段、上一段、下一段或当前公告段开始时继续播放的按键。"
    },
    {
      "indent": 3,
      "text": "g. While audio prompts are usually provisioned in IVR/ARF MGs, support changing the provisioned prompts in a voice session rather than a data session. In particular, with respect to audio management:",
      "zh-CHS": "g. 虽然音频提示通常在IVR/ARF MGs中设置，但支持在语音会话而不是数据会话中更改设置的提示。特别是在音频管理方面："
    },
    {
      "indent": 3,
      "text": "- A method to replace provisioned audio with audio recorded during a call. The newly recorded audio must be accessible using the identifier of the audio it replaces.",
      "zh-CHS": "- 用呼叫期间录制的音频替换提供的音频的方法。新录制的音频必须使用其替换的音频的标识符进行访问。"
    },
    {
      "indent": 3,
      "text": "- A method to revert from replaced audio to the original provisioned audio.",
      "zh-CHS": "- 将替换音频还原为原始配置音频的方法。"
    },
    {
      "indent": 3,
      "text": "- A method to take audio recorded during a call and store it such that it is accessible to the current call only through its own newly created unique identifier.",
      "zh-CHS": "- 一种方法，用于获取通话期间录制的音频并将其存储，以便当前通话只能通过其自己新创建的唯一标识符访问该音频。"
    },
    {
      "indent": 3,
      "text": "- A method to take audio recorded during a call and store it such that it is accessible to any subsequent call through its own newly created identifier.",
      "zh-CHS": "- 一种方法，用于获取通话过程中录制的音频并将其存储，以便任何后续通话都可以通过其自己新创建的标识符访问该音频。"
    },
    {
      "indent": 0,
      "text": "11.2.8.4. Speech Recognition Module",
      "section_title": true,
      "zh-CHS": "11.2.8.4. 语音识别模块"
    },
    {
      "indent": 3,
      "text": "The speech recognition module can be used for a number of speech recognition applications, such as:",
      "zh-CHS": "语音识别模块可用于多种语音识别应用，例如："
    },
    {
      "indent": 3,
      "text": "- Limited Vocabulary Isolated Speech Recognition (e.g., \"yes\", \"no\", the number \"four\"),",
      "zh-CHS": "- 词汇量有限的孤立语音识别（例如，“是”、“否”、数字“四”），"
    },
    {
      "indent": 3,
      "text": "- Limited Vocabulary Continuous Speech Feature Recognition (e.g., the utterance \"four hundred twenty-three dollars\"),and/or",
      "zh-CHS": "- 词汇量有限的连续语音特征识别（例如，话语“423美元”），和/或"
    },
    {
      "indent": 3,
      "text": "- Continuous Speech Recognition (e.g., unconstrained speech recognition tasks).",
      "zh-CHS": "- 连续语音识别（例如，无约束语音识别任务）。"
    },
    {
      "indent": 3,
      "text": "The Speech Recognition Module must support all of the requirements in the Play Module as in addition to the following requirements:",
      "zh-CHS": "除以下要求外，语音识别模块还必须支持播放模块中的所有要求："
    },
    {
      "indent": 3,
      "text": "a. Be able to provide the following basic operation: request an AEG to play an announcement and then perform speech recognition analysis.",
      "zh-CHS": "a. 能够提供以下基本操作：请求AEG播放公告，然后执行语音识别分析。"
    },
    {
      "indent": 3,
      "text": "b. Be able to specify these event collection characteristics:",
      "zh-CHS": "b. 能够指定以下事件集合特征："
    },
    {
      "indent": 3,
      "text": "- The number of attempts to give to perform speech recognition task.",
      "zh-CHS": "- 执行语音识别任务的尝试次数。"
    },
    {
      "indent": 3,
      "text": "c. With respect to speech recognition analysis timers, allow the specification of:",
      "zh-CHS": "c. 对于语音识别分析计时器，允许指定："
    },
    {
      "indent": 3,
      "text": "- Time to wait for the user to initially speak.",
      "zh-CHS": "- 等待用户最初发言的时间。"
    },
    {
      "indent": 3,
      "text": "- The amount of silence necessary following the last speech segment for the speech recognition analysis segment to be considered complete.",
      "zh-CHS": "- 最后一个语音段之后，语音识别分析段被视为完成所需的静音量。"
    },
    {
      "indent": 3,
      "text": "- The maximum allowable length of the speech recognition analysis (not including pre- and post- speech silence).",
      "zh-CHS": "- 语音识别分析允许的最大长度（不包括语音前和语音后的静音）。"
    },
    {
      "indent": 3,
      "text": "d. To be able to allow multiple prompt operations for DTMF digit collection (if supported), voice recording (if supported), and/or speech recognition analysis and then to provide the following types of prompts:",
      "zh-CHS": "d. 能够对DTMF数字采集（如果支持）、语音录制（如果支持）和/或语音识别分析进行多个提示操作，然后提供以下类型的提示："
    },
    {
      "indent": 3,
      "text": "- Initial Prompt",
      "zh-CHS": "- 初始提示"
    },
    {
      "indent": 3,
      "text": "- Reprompt",
      "zh-CHS": "- 责备"
    },
    {
      "indent": 3,
      "text": "- Error prompt",
      "zh-CHS": "- 错误提示"
    },
    {
      "indent": 3,
      "text": "- Failure announcement",
      "zh-CHS": "- 失败公告"
    },
    {
      "indent": 3,
      "text": "- Success announcement.",
      "zh-CHS": "- 成功公告。"
    },
    {
      "indent": 3,
      "text": "e. Allow the specification of definable key sequences for digit recording (if supported) or speech recognition analysis to:",
      "zh-CHS": "e. 允许为数字记录（如果支持）或语音识别分析指定可定义的键序列，以便："
    },
    {
      "indent": 3,
      "text": "- Discard in process analysis, replay the prompt, and resume analysis.",
      "zh-CHS": "- 放弃进程内分析，重播提示，然后继续分析。"
    },
    {
      "indent": 3,
      "text": "- Discard recording in progress and resume analysis.",
      "zh-CHS": "- 放弃正在进行的记录并恢复分析。"
    },
    {
      "indent": 3,
      "text": "- Terminate the current operation and return the terminating key sequence to the MGC.",
      "zh-CHS": "- 终止当前操作并将终止键序列返回给MGC。"
    },
    {
      "indent": 3,
      "text": "f. Provide a way to ask the ARF MG to support the following definable keys for speech recognition analysis. These keys would then be able to be acted upon by the ARF MG:",
      "zh-CHS": "f. 提供一种方法，要求ARF MG支持以下用于语音识别分析的可定义键。然后，ARF MG可以对这些键进行操作："
    },
    {
      "indent": 3,
      "text": "- A key to terminate playing of an announcement in progress.",
      "zh-CHS": "- 终止正在播放的公告的键。"
    },
    {
      "indent": 3,
      "text": "- A key that signals the end of user input. The key may or may not be returned to the MGC along with the input already collected.",
      "zh-CHS": "- 表示用户输入结束的键。密钥可能会也可能不会与已收集的输入一起返回给MGC。"
    },
    {
      "indent": 3,
      "text": "- Keys to stop playing the current announcement and resume playing at the beginning of the first segment of the announcement, last segment of the announcement, previous segment of the announcement, next segment of the announcement, or the current announcement segment.",
      "zh-CHS": "- 停止播放当前公告并在公告的第一段、最后一段、上一段、下一段或当前公告段开始时继续播放的按键。"
    },
    {
      "indent": 0,
      "text": "11.2.8.5. Speaker Verification/Identification Module",
      "section_title": true,
      "zh-CHS": "11.2.8.5. 扬声器验证/识别模块"
    },
    {
      "indent": 3,
      "text": "The speech verification/identification module returns parameters that indicate either the likelihood of the speaker to be the person that they claim to be (verification task) or the likelihood of the speaker being one of the persons contained in a set of previously characterized speakers (identification task).",
      "zh-CHS": "语音验证/识别模块返回参数，这些参数指示说话人成为其声称的人的可能性（验证任务）或说话人成为包含在一组先前特征化的说话人中的人之一的可能性（识别任务）。"
    },
    {
      "indent": 3,
      "text": "The Speaker Verification/Identification Module must support all of the requirements in the Play Module in addition to the following requirements:",
      "zh-CHS": "除以下要求外，扬声器验证/识别模块必须支持播放模块中的所有要求："
    },
    {
      "indent": 3,
      "text": "a. Be able to download parameters, such as speaker templates (verification task) or sets of potential speaker templates (identification task), either prior to the session or in mid-session.",
      "zh-CHS": "a. 能够在会话之前或会话中期下载参数，如说话人模板（验证任务）或潜在说话人模板集（识别任务）。"
    },
    {
      "indent": 3,
      "text": "b. Be able to download application specific software to the ARF either prior to the session or in mid-session.",
      "zh-CHS": "b. 能够在会话之前或会话中期将特定于应用程序的软件下载到ARF。"
    },
    {
      "indent": 3,
      "text": "c. Be able to return parameters indicating either the likelihood of the speaker to be the person that they claim to be (verification task) or the likelihood of the speaker being one of the persons contained in a set of previously characterized speakers (identification task).",
      "zh-CHS": "c. 能够返回参数，指示说话人成为其声称的人的可能性（验证任务）或说话人成为一组先前具有特征的说话人中包含的人之一的可能性（识别任务）。"
    },
    {
      "indent": 3,
      "text": "d. Be able to provide the following basic operation: request an AEG to play an announcement and then perform speech verification/identification analysis.",
      "zh-CHS": "d. 能够提供以下基本操作：请求AEG播放公告，然后执行语音验证/识别分析。"
    },
    {
      "indent": 3,
      "text": "e. Be able to specify these event collection characteristics: The number of attempts to give to perform speech verification/identification task.",
      "zh-CHS": "e. 能够指定这些事件收集特征：执行语音验证/识别任务的尝试次数。"
    },
    {
      "indent": 3,
      "text": "f. With respect to speech verification/identification analysis timers, allow the specification of:",
      "zh-CHS": "f. 关于语音验证/识别分析计时器，允许指定："
    },
    {
      "indent": 3,
      "text": "- Time to wait for the user to initially speak.",
      "zh-CHS": "- 等待用户最初发言的时间。"
    },
    {
      "indent": 3,
      "text": "- The amount of silence necessary following the last speech segment for the speech verification/identification analysis segment to be considered complete.",
      "zh-CHS": "- 在最后一个语音段之后，语音验证/识别分析段被视为完成所需的静音量。"
    },
    {
      "indent": 3,
      "text": "- The maximum allowable length of the speech verification/identification analysis (not including pre- and post- speech silence).",
      "zh-CHS": "- 语音验证/识别分析的最大允许长度（不包括演讲前和演讲后的沉默）。"
    },
    {
      "indent": 3,
      "text": "g. To be able to allow multiple prompt operations for DTMF digit collection (if supported), voice recording, (if supported), speech recognition analysis (if supported) and/or speech verification/identification and provide the following types of prompts:",
      "zh-CHS": "g. 能够对DTMF数字采集（如果支持）、语音记录（如果支持）、语音识别分析（如果支持）和/或语音验证/识别进行多个提示操作，并提供以下类型的提示："
    },
    {
      "indent": 3,
      "text": "- Initial Prompt",
      "zh-CHS": "- 初始提示"
    },
    {
      "indent": 3,
      "text": "- Reprompt",
      "zh-CHS": "- 责备"
    },
    {
      "indent": 3,
      "text": "- Error prompt",
      "zh-CHS": "- 错误提示"
    },
    {
      "indent": 3,
      "text": "- Failure announcement",
      "zh-CHS": "- 失败公告"
    },
    {
      "indent": 3,
      "text": "- Success announcement.",
      "zh-CHS": "- 成功公告。"
    },
    {
      "indent": 3,
      "text": "h. Allow the specification of definable key sequences for digit recording (if supported) or speech recognition (if supported) in the speech verification/identification analysis to:",
      "zh-CHS": "h. 允许在语音验证/识别分析中为数字记录（如果支持）或语音识别（如果支持）指定可定义的键序列，以便："
    },
    {
      "indent": 3,
      "text": "- Discard speech verification/identification in analysis, replay the prompt, and resume analysis.",
      "zh-CHS": "- 在分析中放弃语音验证/识别，重放提示，然后继续分析。"
    },
    {
      "indent": 3,
      "text": "- Discard speech verification/identification analysis in progress and resume analysis.",
      "zh-CHS": "- 放弃正在进行的语音验证/识别分析和恢复分析。"
    },
    {
      "indent": 3,
      "text": "- Terminate the current operation and return the terminating key sequence to the MGC.",
      "zh-CHS": "- 终止当前操作并将终止键序列返回给MGC。"
    },
    {
      "indent": 3,
      "text": "i. Provide a way to ask the ARF MG to support the following definable keys for speech verification/identification analysis. These keys would then be able to be acted upon by the ARF MG:",
      "zh-CHS": "i. 提供一种方法，要求ARF MG支持以下用于语音验证/识别分析的可定义密钥。然后，ARF MG可以对这些键进行操作："
    },
    {
      "indent": 3,
      "text": "- A key to terminate playing of an announcement in progress.",
      "zh-CHS": "- 终止正在播放的公告的键。"
    },
    {
      "indent": 3,
      "text": "- A key that signals the end of user input. The key may or may not be returned to the MGC along with the input already collected.",
      "zh-CHS": "- 表示用户输入结束的键。密钥可能会也可能不会与已收集的输入一起返回给MGC。"
    },
    {
      "indent": 3,
      "text": "- Keys to stop playing the current announcement and resume speech verification/identification at the beginning of the first segment of the announcement, last segment of the announcement, previous segment of the announcement, next segment of the announcement, or the current announcement segment.",
      "zh-CHS": "- 停止播放当前公告并在公告的第一段、最后一段、前一段、下一段或当前公告段开始时恢复语音验证/识别的按键。"
    },
    {
      "indent": 0,
      "text": "11.2.8.6. Auditory Feature Extraction/Recognition Module",
      "section_title": true,
      "zh-CHS": "11.2.8.6. 听觉特征提取/识别模块"
    },
    {
      "indent": 3,
      "text": "The auditory feature extraction/recognition module is engineered to continuously monitor the auditory stream for the appearance of particular auditory signals or speech utterances of interest and to report these events (and optionally a signal feature representation of these events) to network servers or MGCs.",
      "zh-CHS": "听觉特征提取/识别模块被设计成连续监测听觉流中特定听觉信号或感兴趣语音的出现，并向网络服务器或MGC报告这些事件（以及可选的这些事件的信号特征表示）。"
    },
    {
      "indent": 3,
      "text": "The Auditory Feature Extraction/Recognition Module must support the following requirements:",
      "zh-CHS": "听觉特征提取/识别模块必须支持以下要求："
    },
    {
      "indent": 3,
      "text": "a. Be able to download application specific software to the ARF either prior to the session or in mid-session.",
      "zh-CHS": "a. 能够在会话之前或会话中期将特定于应用程序的软件下载到ARF。"
    },
    {
      "indent": 3,
      "text": "b. Be able to download parameters, such as a representation of the auditory feature to extract/recognize, for prior to the session or in mid-session.",
      "zh-CHS": "b. 能够在会话之前或会话中期下载参数，例如要提取/识别的听觉特征的表示。"
    },
    {
      "indent": 3,
      "text": "c. Be able to return parameters indicating the auditory event found or a representation of the feature found (i.e., auditory feature).",
      "zh-CHS": "c. 能够返回指示所发现听觉事件或所发现特征（即听觉特征）表示的参数。"
    },
    {
      "indent": 0,
      "text": "11.2.8.7. Audio Conferencing Module",
      "section_title": true,
      "zh-CHS": "11.2.8.7. 音频会议模块"
    },
    {
      "indent": 3,
      "text": "The protocol must support:",
      "zh-CHS": "该议定书必须支持："
    },
    {
      "indent": 3,
      "text": "a. a mechanism to create multi-point conferences of audio only and multimedia conferences in the MG.",
      "zh-CHS": "a. 在MG中创建仅音频会议和多媒体会议的多点会议的机制。"
    },
    {
      "indent": 3,
      "text": "b. audio mixing; mixing multiple audio streams into a new composite audio stream",
      "zh-CHS": "b. 音频混音；将多个音频流混合到新的合成音频流中"
    },
    {
      "indent": 3,
      "text": "c. audio switching; selection of incoming audio stream to be sent out to all conference participants.",
      "zh-CHS": "c. 音频交换；选择要发送给所有会议参与者的传入音频流。"
    },
    {
      "indent": 0,
      "text": "11.2.9. Multipoint Control Units",
      "section_title": true,
      "zh-CHS": "11.2.9. 多点控制单元"
    },
    {
      "indent": 3,
      "text": "The protocol must support:",
      "zh-CHS": "该议定书必须支持："
    },
    {
      "indent": 3,
      "text": "a. a mechanism to create multi-point conferences of audio only and multimedia conferences in the MG.",
      "zh-CHS": "a. 在MG中创建仅音频会议和多媒体会议的多点会议的机制。"
    },
    {
      "indent": 3,
      "text": "b. audio mixing; mixing multiple audio streams into a new composite audio stream",
      "zh-CHS": "b. 音频混音；将多个音频流混合到新的合成音频流中"
    },
    {
      "indent": 3,
      "text": "c. audio switching; selection of incoming audio stream to be sent out to all conference participants.",
      "zh-CHS": "c. 音频交换；选择要发送给所有会议参与者的传入音频流。"
    },
    {
      "indent": 3,
      "text": "d. video switching; selection of video stream to be sent out to all conference participants",
      "zh-CHS": "d. 视频交换；选择要发送给所有会议参与者的视频流"
    },
    {
      "indent": 3,
      "text": "e. lecture video mode; a video selection option where on video source is sent out to all conference users",
      "zh-CHS": "e. 讲座视频模式；一个视频选择选项，其中视频源发送给所有会议用户"
    },
    {
      "indent": 3,
      "text": "f. multi-point of T.120 data conferencing.",
      "zh-CHS": "f. 多点T.120数据会议。"
    },
    {
      "indent": 3,
      "text": "g. The ability for the MG to function as an H.323 MP, and for the MGC to function as an H.323 MC, connected by this protocol (MEGACOP/H.248). It should be possible for audio, data, and video MG/MPs to be physically separate while being under the control of a single MGC/H.323 MC.",
      "zh-CHS": "g. MG作为H.323 MP运行的能力，以及MGC作为H.323 MC运行的能力，通过此协议连接（MEGACOP/H.248）。在单个MGC/H.323 MC的控制下，音频、数据和视频MG/MPs应该可以物理分离。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "zh-CHS": "12. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] ITU-T Recommendation Q.2630.1, AAL type 2 Signalling Protocol (Capability Set 1), December 1999.",
      "zh-CHS": "[2] ITU-T建议Q.2630.1，AAL第2类信令协议（能力集1），1999年12月。"
    },
    {
      "indent": 3,
      "text": "[3] ITU-T Recommendation H.341, Line Transmission of Non-Telephone Signals, May 1999.",
      "zh-CHS": "[3] ITU-T建议H.341，非电话信号的线路传输，1999年5月。"
    },
    {
      "indent": 3,
      "text": "[4] ATM Forum Technical Committee, af-vtoa-0083.001, Voice and Telephony Over ATM to the Desktop Specification, March 1999.",
      "zh-CHS": "[4] ATM论坛技术委员会，af-vtoa-0083.001，基于桌面规范的ATM语音和电话，1999年3月。"
    },
    {
      "indent": 3,
      "text": "[5] ITU-T Recommendation H.323v3, Packet-based Multimedia Communications Systems (includes Annex C - H.323 on ATM), September 1999.",
      "zh-CHS": "[5] ITU-T建议H.323v3，基于分组的多媒体通信系统（包括ATM上的附录C-H.323），1999年9月。"
    },
    {
      "indent": 3,
      "text": "[6] ATM Forum Technical Committee, af-saa-0124.000, Gateway for H.323 Media Transport Over ATM, May 1999.",
      "zh-CHS": "[6] ATM论坛技术委员会，af-saa-0124.000，ATM上H.323媒体传输网关，1999年5月。"
    },
    {
      "indent": 3,
      "text": "[7] ITU-T Recommendation T.140, Protocol for Multimedia Application Text Conversation, February 1998.",
      "zh-CHS": "[7] ITU-T建议T.140，多媒体应用文本对话协议，1998年2月。"
    },
    {
      "indent": 3,
      "text": "[8] ITU-T Recommendation V.18, Operational and Interworking Requirements for DCEs Operating in Text Telephone Mode, February 1998.",
      "zh-CHS": "[8] ITU-T建议V.18，在文本电话模式下运行的DCE的操作和互通要求，1998年2月。"
    },
    {
      "indent": 3,
      "text": "[9] ITU-T Recommendation Q.931, Digital Subscriber Signalling System No. 1 (DSS 1) - ISDN User - Network Interface Layer 3 Specification for Basic Call Control, May 1998.",
      "zh-CHS": "[9] ITU-T建议Q.931，数字用户信号发送系统第1号（DSS 1）——ISDN用户——基本呼叫控制的网络接口层3规范，1998年5月。"
    },
    {
      "indent": 0,
      "text": "14. Acknowledgements",
      "section_title": true,
      "zh-CHS": "14. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to acknowledge the many contributors who debated the Media Gateway Control Architecture and Requirements on the IETF Megaco and Sigtran mailing lists. Contributions to this document have also been made through internet-drafts and discussion with members of ETSI Tiphon, ITU-T SG16, TIA TR41.3.4, the ATM Forum, and the Multiservice Switching Forum.",
      "zh-CHS": "作者想感谢许多就IETF Megaco和Sigtran邮件列表中的媒体网关控制体系结构和要求进行辩论的贡献者。本文件还通过互联网草案以及与ETSI Tiphon、ITU-T SG16、TIA TR41.3.4、ATM论坛和多服务交换论坛成员的讨论做出了贡献。"
    },
    {
      "indent": 0,
      "text": "15. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "15. 作者地址"
    },
    {
      "indent": 3,
      "text": "Nancy Greene Nortel Networks P.O. Box 3511 Stn C Ottawa, ON, Canada K1Y 4H7",
      "zh-CHS": "Nancy Greene Nortel Networks邮政信箱3511加拿大安大略省渥太华市Stn C邮编K1Y 4H7"
    },
    {
      "indent": 3,
      "text": "Phone: (514) 271-7221 EMail: ngreene@nortelnetworks.com",
      "zh-CHS": "电话：（514）271-7221电子邮件：ngreene@nortelnetworks.com"
    },
    {
      "indent": 3,
      "text": "Michael A. Ramalho Cisco Systems 1802 Rue de la Port Wall Township, NJ",
      "zh-CHS": "Michael A.Ramalho思科系统公司，新泽西州沃尔港镇街1802号"
    },
    {
      "indent": 3,
      "text": "Phone: +1.732.449.5762\nEMail: mramalho@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Brian Rosen Marconi 1000 FORE Drive, Warrendale, PA 15086",
      "zh-CHS": "布莱恩·罗森·马可尼宾夕法尼亚州沃伦代尔市1000号前驱，邮编15086"
    },
    {
      "indent": 3,
      "text": "Phone: (724) 742-6826 EMail: brosen@eng.fore.com",
      "zh-CHS": "电话：（724）742-6826电子邮件：brosen@eng.fore.com"
    },
    {
      "indent": 0,
      "text": "16. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "16. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}