{
  "title": {
    "text": "RFC 2392:  Content-ID and Message-ID Uniform Resource Locators ",
    "zh-CHS": "RFC 2392"
  },
  "number": 2392,
  "created_at": "2021-10-23 00:55:14.363096+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        E. Levinson\nRequest for Comments: 2392                                   August 1998\nObsoletes: 2111\nCategory: Standards Track",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Content-ID and Message-ID Uniform Resource Locators",
      "zh-CHS": "内容ID和消息ID统一资源定位器"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1998年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Uniform Resource Locator (URL) schemes, \"cid:\" and \"mid:\" allow references to messages and the body parts of messages. For example, within a single multipart message, one HTML body part might include embedded references to other parts of the same message.",
      "zh-CHS": "统一资源定位器（URL）方案“cid:”和“mid:”允许引用消息和消息的正文部分。例如，在单个多部分消息中，一个HTML正文部分可能包含对同一消息其他部分的嵌入引用。"
    },
    {
      "indent": 0,
      "text": "Changes from (RFC 2111)",
      "zh-CHS": "更改自（RFC 2111）"
    },
    {
      "indent": 3,
      "text": "Clarified the example on page 3 on of converting cid URLs to Content-IDs. The example now uses a cid URL instead of an mid.",
      "zh-CHS": "澄清了第3页关于将cid URL转换为内容ID的示例。该示例现在使用cid URL而不是mid URL。"
    },
    {
      "indent": 3,
      "text": "Corrected the example messages to have the correct Content-ID form; they now use the angle brackets. Added a Message-ID header to the second example.",
      "zh-CHS": "更正示例消息，使其具有正确的内容ID格式；他们现在使用尖括号。在第二个示例中添加了消息ID头。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The use of [MIME] within email to convey Web pages and their associated images requires a URL scheme to permit the HTML to refer to the images or other data included in the message. The Content-ID Uniform Resource Locator, \"cid:\", serves that purpose.",
      "zh-CHS": "在电子邮件中使用[MIME]传递网页及其相关图像需要URL方案，以允许HTML引用消息中包含的图像或其他数据。内容ID统一资源定位器“cid:”用于此目的。"
    },
    {
      "indent": 3,
      "text": "Similarly Net News readers use Message-IDs to link related messages together. The Message-ID URL provides a scheme, \"mid:\", to refer to such messages as a \"resource\".",
      "zh-CHS": "类似地，网络新闻阅读器使用消息ID将相关消息链接在一起。消息ID URL提供了一个方案“mid:”，将此类消息称为“资源”。"
    },
    {
      "indent": 3,
      "text": "The \"mid\" (Message-ID) and \"cid\" (Content-ID) URL schemes provide identifiers for messages and their body parts. The \"mid\" scheme uses (a part of) the message-id of an email message to refer to a specific message. The \"cid\" scheme refers to a specific body part of a message; its use is generally limited to references to other body parts in the same message as the referring body part. The \"mid\" scheme may also refer to a specific body part within a designated message, by including the content-ID's address.",
      "zh-CHS": "“mid”（消息ID）和“cid”（内容ID）URL方案为消息及其主体部分提供标识符。“mid”方案使用电子邮件的消息id（部分）来引用特定消息。“cid”方案是指消息的特定主体部分；它的使用通常仅限于在与引用主体部分相同的消息中引用其他主体部分。“mid”方案还可以通过包括内容ID的地址来指代指定消息内的特定主体部分。"
    },
    {
      "indent": 3,
      "text": "A note on terminology. The terms \"body part\" and \"MIME entity\" are used interchangeably. They refer to the headers and body of a MIME message, either the message itself or one of the body parts contained in a Multipart message.",
      "zh-CHS": "关于术语的说明。术语“身体部位”和“MIME实体”可以互换使用。它们是指MIME消息的头和正文，消息本身或包含在多部分消息中的正文部分之一。"
    },
    {
      "indent": 0,
      "text": "2. The MID and CID URL Schemes",
      "section_title": true,
      "zh-CHS": "2. MID和CID URL方案"
    },
    {
      "indent": 3,
      "text": "RFC 1738 [URL] reserves the \"mid\" and \"cid\" schemes for Message-ID and Content-ID respectively. This memorandum defines the syntax for those URLs. Because they use the same syntactic elements they are presented together.",
      "zh-CHS": "RFC 1738[URL]分别为消息ID和内容ID保留“mid”和“cid”方案。本备忘录定义了这些URL的语法。因为它们使用相同的语法元素，所以它们一起呈现。"
    },
    {
      "indent": 3,
      "text": "The URLs take the form",
      "zh-CHS": "URL采用以下形式："
    },
    {
      "indent": 5,
      "text": "content-id    = url-addr-spec",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "message-id    = url-addr-spec",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "url-addr-spec = addr-spec ; URL encoding of RFC 822 addr-spec",
      "zh-CHS": "url地址规范=地址规范；RFC 822地址规范的URL编码"
    },
    {
      "indent": 5,
      "text": "cid-url = \"cid\" \":\" content-id",
      "zh-CHS": "cid url=“cid”“：”内容id"
    },
    {
      "indent": 5,
      "text": "mid-url       = \"mid\" \":\" message-id [ \"/\" content-id ]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Notes: In Internet mail messages, the addr-spec in a Content-ID [MIME] or Message-ID [822] header is enclosed in angle brackets (<>). Since addr-spec in a Message-ID or Content-ID might contain characters not allowed within a URL; any such character (including \"/\", which is reserved within the \"mid\" scheme) must be hex-encoded using the %hh escape mechanism in [URL].",
      "zh-CHS": "注意：在Internet邮件消息中，内容ID[MIME]或消息ID[822]头中的addr规范用尖括号括起来（<>）。由于消息ID或内容ID中的addr spec可能包含URL中不允许的字符；任何此类字符（包括“/”，保留在“mid”方案中）必须使用[URL]中的%hh转义机制进行十六进制编码。"
    },
    {
      "indent": 3,
      "text": "A \"mid\" URL with only a \"message-id\" refers to an entire message. With the appended \"content-id\", it refers to a body part within a message, as does a \"cid\" URL. The Content-ID of a MIME body part is required to be globally unique. However, in many systems that store messages, body parts are not indexed independently their context (message). The \"mid\" URL long form was designed to supply the context needed to support interoperability with such systems.",
      "zh-CHS": "只有“消息id”的“mid”URL指的是整个消息。随附的“内容id”指的是消息中的主体部分，“cid”URL也是如此。MIME正文部分的内容ID必须是全局唯一的。然而，在许多存储消息的系统中，身体部位并不是独立于其上下文（消息）编制索引的。“mid”URL长表单旨在提供支持与此类系统互操作性所需的上下文。"
    },
    {
      "indent": 3,
      "text": "A implementation conforming to this specification is required to support the \"mid\" URL long form (message-id/content-id). Conforming implementations can choose to, but are not required to, take advantage of the content-id's uniqueness and interpret a \"cid\" URL to refer to any body part within the message store.",
      "zh-CHS": "需要符合本规范的实现来支持“mid”URL长格式（消息id/内容id）。一致性实现可以选择（但不要求）利用内容id的唯一性，并解释“cid”URL以引用消息存储中的任何正文部分。"
    },
    {
      "indent": 3,
      "text": "In limited circumstances (e.g., within multipart/alternate), a single message may contain several body parts that have the same Content-ID. That occurs, for example, when identical data can be accessed through different methods. In those cases, conforming implementations are required to use the rules of the containing MIME entity (e.g., multipart/alternate) to select the body part to which the Content-ID refers.",
      "zh-CHS": "在有限的情况下（例如，在多部分/备选方案中），单个消息可能包含多个具有相同内容ID的正文部分。例如，当可以通过不同的方法访问相同的数据时，会发生这种情况。在这些情况下，一致性实现需要使用包含MIME实体的规则（例如，multipart/alternate）来选择内容ID引用的主体部分。"
    },
    {
      "indent": 3,
      "text": "A \"cid\" URL is converted to the corresponding Content-ID message header [MIME] by removing the \"cid:\" prefix, converting the % encoded character to their equivalent US-ASCII characters, and enclosing the remaining parts with an angle bracket pair, \"<\" and \">\". For example, \"cid:foo4%25foo1@bar.net\" corresponds to",
      "zh-CHS": "通过删除“cid:”前缀，将%编码字符转换为其等效的US-ASCII字符，并用尖括号对“<”和“>”将“cid”URL转换为相应的内容ID消息头[MIME]。例如，“cid:foo4%25foo1@bar.net“相当于"
    },
    {
      "indent": 5,
      "text": "Content-ID: <foo4%25foo1@bar.net>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Reversing the process and converting URL special characters to their % encodings produces the original cid.",
      "zh-CHS": "反转此过程并将URL特殊字符转换为其%编码将生成原始cid。"
    },
    {
      "indent": 3,
      "text": "A \"mid\" URL is converted to a Message-ID or Message-ID/Content-ID pair in a similar fashion.",
      "zh-CHS": "“mid”URL以类似的方式转换为消息ID或消息ID/内容ID对。"
    },
    {
      "indent": 3,
      "text": "Both message-id and content-id are required to be globally unique. That is, no two different messages will ever have the same Message-ID addr-spec; no different body parts will ever have the same Content-ID addr-spec. A common technique used by many message systems is to use a time and date stamp along with the local host's domain name, e.g., 950124.162336@XIson.com.",
      "zh-CHS": "消息id和内容id都要求全局唯一。也就是说，没有两个不同的消息具有相同的消息ID addr spec；任何不同的身体部位都不会有相同的内容ID addr-spec。许多消息系统使用的一种常见技术是在本地主机的域名（例如950124）上使用时间和日期戳。162336@XIson.com."
    },
    {
      "indent": 3,
      "text": "Some Examples",
      "zh-CHS": "一些例子"
    },
    {
      "indent": 3,
      "text": "The following message contains an HTML body part that refers to an image contained in another body part. Both body parts are contained in a Multipart/Related MIME entity. The HTML IMG tag contains a cidurl which points to the image.",
      "zh-CHS": "下面的消息包含一个HTML主体部分，它引用了另一个主体部分中包含的图像。两个主体部分都包含在多部分/相关MIME实体中。HTML IMG标记包含一个指向图像的cidurl。"
    },
    {
      "indent": 5,
      "text": "From: foo1@bar.net\nTo: foo2@bar.net\nSubject: A simple example\nMime-Version: 1.0\nContent-Type: multipart/related; boundary=\"boundary-example-1\";\n              type=Text/HTML",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "--boundary-example 1\nContent-Type: Text/HTML; charset=US-ASCII",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "to the other body part, for example through a statement such as:\n<IMG SRC=\"cid:foo4*foo1@bar.net\" ALT=\"IETF logo\">",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "--boundary-example-1",
      "zh-CHS": "--边界-示例-1"
    },
    {
      "indent": 5,
      "text": "Content-ID: <foo4*foo1@bar.net>\nContent-Type: IMAGE/GIF\nContent-Transfer-Encoding: BASE64",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "R0lGODlhGAGgAPEAAP/////ZRaCgoAAAACH+PUNvcHlyaWdodCAoQykgMTk5 NSBJRVRGLiBVbmF1dGhvcml6ZWQgZHVwbGljYXRpb24gcHJvaGliaXRlZC4A etc...",
      "zh-CHS": "R0LGODLHGAGGAPEAP/////Zracgoaaach+PUNvcHlyaWdodCAoQykgMTk5 NSBjrRGlibvbmf1dghvcml6zwqgzhvwbgljyxrpb24gchvgliaxrlzc4a等。。。"
    },
    {
      "indent": 5,
      "text": "--boundary-example-1--",
      "zh-CHS": "--边界-示例-1--"
    },
    {
      "indent": 3,
      "text": "The following message points to another message (hopefully still in the recipient's message store).",
      "zh-CHS": "下面的消息指向另一条消息（希望仍在收件人的消息存储中）。"
    },
    {
      "indent": 5,
      "text": "From: bar@none.com\nTo: phooey@all.com\nSubject: Here's how to do it\nMessage-ID: <970701.32784@VIers.none.com>\nContent-type: text/html; charset=usascii",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<A HREF= \"mid:960830.1639@XIson.com/partA.960830.1639@XIson.com\"> previous message</A>, shows how the approach you propose can be used to accomplish ...",
      "zh-CHS": "<A HREF=“mid:960830。1639@XIson.com/第960830部分。1639@XIson.com“>上一条信息</A>，显示了如何使用您提出的方法来实现。。。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The URLs defined here provide an addressing or referencing mechanism. The values of these URLs disclose no more about the originators environment than the corresponding Message-ID and Content-ID values. Where concern exists about such disclosures the originator of a message using mid and cid URLs must take precautions to insure that confidential information is not disclosed. Those precautions should already be in place to handle existing mail use of the Message-ID and Content-ID.",
      "zh-CHS": "此处定义的URL提供寻址或引用机制。这些URL的值除了相应的消息ID和内容ID值外，不会透露更多关于发起人环境的信息。如果存在对此类披露的担忧，则使用mid和cid URL的邮件的发起者必须采取预防措施，以确保不披露机密信息。这些预防措施应该已经到位，以处理邮件ID和Content-ID的现有邮件使用。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "zh-CHS": "4. 工具书类"
    },
    {
      "indent": 3,
      "text": "[822] Crocker, D., \"Standard for the Format of ARPA Internet Text Messages\", August 1982, STD 11, RFC 822, August 1982.",
      "zh-CHS": "[822]Crocker，D.，“ARPA互联网文本信息格式标准”，1982年8月，STD 11，RFC 822，1982年8月。"
    },
    {
      "indent": 3,
      "text": "[MIME] Borenstein, N., and N. Freed, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "zh-CHS": "[MIME]Borenstein，N.和N.Freed，“多用途互联网邮件扩展（MIME）第一部分：互联网邮件正文格式”，RFC 20451996年11月。"
    },
    {
      "indent": 3,
      "text": "[URL] Berners-Lee, T., Masinter, L., and M. McCahill, \"Uniform Resource Locators (URL)\", RFC 1738, December 1994.",
      "zh-CHS": "[URL]Berners Lee，T.，Masinter，L.，和M.McCahill，“统一资源定位器（URL）”，RFC 17381994年12月。"
    },
    {
      "indent": 3,
      "text": "[MULREL] Levinson, E., \"The MIME Multipart/Related Content-type\", RFC 2387, August 1998.",
      "zh-CHS": "[Mullel]Levinson，E.，“MIME多部分/相关内容类型”，RFC 2387，1998年8月。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "The original concept of \"mid\" and \"cid\" URLs were part of the Tim Berners-Lee's original vision of the World Wide Web. The ideas and design have benefited greatly by discussions with Harald Alvestrand, Dan Connolly, Roy Fielding, Larry Masinter, Jacob Palme, and others in the MHTML working group.",
      "zh-CHS": "“mid”和“cid”URL的最初概念是Tim Berners-Lee对万维网最初设想的一部分。与Harald Alvestrand、Dan Connolly、Roy Fielding、Larry Masinter、Jacob Palme和MHTML工作组中的其他人讨论后，这些想法和设计受益匪浅。"
    },
    {
      "indent": 0,
      "text": "6. Author's Address",
      "section_title": true,
      "zh-CHS": "6. 作者地址"
    },
    {
      "indent": 3,
      "text": "Edward Levinson 47 Clive Street Metuchen, NJ 08840-1060 USA",
      "zh-CHS": "Edward Levinson美国新泽西州梅图臣克莱夫街47号，邮编08840-1060"
    },
    {
      "indent": 3,
      "text": "Phone: +1 908 549 3716\nEMail: XIson@cnj.digex.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "7. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1998年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    }
  ]
}