{
  "title": {
    "text": "RFC 2968:  Mesh of Multiple DAG servers - Results from TISDAG ",
    "zh-CHS": "RFC 2968"
  },
  "number": 2968,
  "created_at": "2021-10-25 05:05:56.529544+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          L. Daigle\nRequest for Comments: 2968                                      T. Eklof\nCategory: Informational                                     October 2000",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Mesh of Multiple DAG servers - Results from TISDAG",
      "zh-CHS": "多个DAG服务器的网格-TISDAG的结果"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Common Indexing Protocol ([CIP1]) is designed to facilitate the creation not only of query referral indexes, but also of meshes of (loosely) affiliated referral indexes. The purpose of such a mesh of servers is to implement some kind of distributed sharing of indexing and/or searching tasks across different servers. So far, the TISDAG (Technical Infrastructure for Swedish Directory Access Gateways) project ([TISDAG], [DAGEXP]) has focused on creating a single referral index; the obvious next step is to integrate that into a larger set of interoperating services.",
      "zh-CHS": "通用索引协议（[CIP1]）的设计目的不仅是为了方便创建查询引用索引，而且还方便创建（松散）关联引用索引的网格。这种服务器网格的目的是在不同的服务器之间实现索引和/或搜索任务的某种分布式共享。到目前为止，TISDAG（瑞典目录访问网关技术基础设施）项目（[TISDAG]，[DAGEP]）的重点是创建一个单一的推荐索引；显然，下一步是将其集成到一组更大的互操作服务中。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 0,
      "text": "1.1 Overview of mesh possibilities",
      "section_title": true,
      "zh-CHS": "1.1 网格可能性概述"
    },
    {
      "indent": 3,
      "text": "Two different possibilities are possible for extending the TISDAG service to a mesh model (or some combination of both). First, it should be possible to create a mesh of DAG-based services. Or, it might be interesting to use the mesh architecture to incorporate access to other types of services (e.g., the Norwegian Directory of Directories). In either case, the basic principle for establishing a mesh is that interoperating services should exchange index objects, according to the architecture of the mesh (e.g., hierarchical, or graph-like, preferably without loops!).",
      "zh-CHS": "将TISDAG服务扩展到网格模型（或两者的某种组合）可能有两种不同的可能性。首先，应该可以创建基于DAG的服务的网格。或者，使用mesh体系结构合并对其他类型服务（例如，挪威目录目录）的访问可能会很有趣。在任何一种情况下，建立网格的基本原则都是，互操作服务应根据网格的体系结构（例如，分层或类似图形，最好没有循环！）交换索引对象。"
    },
    {
      "indent": 3,
      "text": "As is outlined in the CIP documentation ([CIP1]), many possibilities exist for mechanisms for creating indexes over multiple referral servers -- for example, WDSP index objects could be passed along",
      "zh-CHS": "正如CIP文档（[CIP1]）中所概述的，在多个引用服务器上创建索引的机制存在许多可能性——例如，可以传递WDSP索引对象"
    },
    {
      "indent": 3,
      "text": "untouched, or a referral index server's contents could be aggregated into a new index object, generating referrals back to that server.",
      "zh-CHS": "未触及，或者引用索引服务器的内容可以聚合到新的索引对象中，从而生成返回该服务器的引用。"
    },
    {
      "indent": 3,
      "text": "The proposal is that the mesh should be constructed using index objects aggregated over participating services' servers. That is, referrals will be generated to other recognized services, not their individual participants. This can be done as a hierarchy or a level mesh one-layer deep, but the important reason for not simply passing forward index objects (unaggregated) is that individual services may support different ranges of access protocols, have particular security requirements, etc. Referrals should be directed to a CAP or CAPs -- either the standard ones used by the DAG system, or new ones established to support particular semantics of remote systems (e.g., other query types, etc). Within a given DAG system, referrals to these remote servers will look just like any other referral, although a particular SAP or SAPs may be established to provide query fulfillment (again, to enable translations between variations of service, to allow secure access if the relationship between the services is restricted, etc).",
      "zh-CHS": "建议使用在参与服务的服务器上聚合的索引对象来构建网格。也就是说，转介将产生到其他认可的服务，而不是他们的个人参与者。这可以作为一个层次或一层网格来完成，但不只是传递前向索引对象（未聚合）的重要原因是，单个服务可能支持不同范围的访问协议，具有特定的安全要求，引用应指向一个或多个CAP——DAG系统使用的标准CAP，或为支持远程系统的特定语义而建立的新CAP（例如，其他查询类型等）。在给定的DAG系统中，对这些远程服务器的引用看起来与任何其他引用一样，尽管可以建立一个或多个特定的SAP以提供查询实现（同样，在不同的服务之间进行转换，在服务之间的关系受到限制时允许安全访问等）。"
    },
    {
      "indent": 3,
      "text": "In the following scenarios of mesh traversal, the assumption is that the primary service in discussion (Country A in Scenario 1, Country B in Scenario 2) is a DAG-based service. The scenarios are presented in the light of interoperating DAG services, but in most cases it would be equally applicable if the remote service was provided by some other service architecture. Again, the key element for establishing a mesh of any sort is the exchange of the CIP index object, not internal system architecture.",
      "zh-CHS": "在以下网格遍历场景中，假设讨论中的主要服务（场景1中的国家A，场景2中的国家B）是基于DAG的服务。这些场景是根据互操作DAG服务来呈现的，但在大多数情况下，如果远程服务由其他服务体系结构提供，则同样适用。同样，建立任何类型网格的关键元素是CIP索引对象的交换，而不是内部系统架构。"
    },
    {
      "indent": 0,
      "text": "1.1.1 Scenario 1: Top Down",
      "section_title": true,
      "zh-CHS": "1.1.1 场景1：自上而下"
    },
    {
      "indent": 3,
      "text": "Suppose 2 countries tie their services together. A user makes a query in Country A. A certain number of hits are made against the index objects of A's WDSPs. There is also a hit in the aggregate index of Country B. There are 3 possible cases under which this must be handled:",
      "zh-CHS": "假设两个国家将其服务捆绑在一起。用户在A国进行查询。对A的WDSP的索引对象进行一定数量的点击。B国的综合指数也受到影响。有3种可能的情况必须处理："
    },
    {
      "indent": 3,
      "text": "Case 1:",
      "zh-CHS": "案例1："
    },
    {
      "indent": 3,
      "text": "Country A and Country B are running services that are essentially the same -- in terms of protocols, queries, and schema that are supported. In this case, one referral should be generated per protocol supported by Country B's service. The referral can be passed back as far as the client, if its protocol supports referrals. Alternatively, the CAP may chain the referral through an appropriate SAP, in the usual fashion. In other words, the CAPs of Country B's service act as WDSPs to Country A's service.",
      "zh-CHS": "国家A和国家B运行的服务本质上是相同的——在所支持的协议、查询和模式方面。在这种情况下，应根据B国服务支持的协议生成一份转诊。如果其协议支持转介，则转介可以传回客户端。或者，CAP可以按照通常的方式通过适当的SAP链接转诊。换句话说，B国服务的上限相当于A国服务的WDSP。"
    },
    {
      "indent": 3,
      "text": "Consider the following illustration (only relevant CAPs, SAPs, etc, are shown; others suppressed for lack of room):",
      "zh-CHS": "考虑下面的插图（仅显示相关的上限、SAPS等）；其他由于缺乏空间而被抑制："
    },
    {
      "indent": 6,
      "text": "       +-----------------+\n  (1)  |-----+ Country A |     +-------+\n------>|Prot1|   DAG     |     |A-WSDP1|\n<------| CAP |     +-----|     | Prot1 |\n  (2)  |-----+     |Prot1|     +-------+\n       |           | SAP |\n----+  |           +-----|     +-------+\n (3)|  |    +-------+    |     |A-WDSP2|\n    |  |    | RI-A  |    |     | Prot1 |\n    |  +-----------------+     +-------+\n    |\n    |                          +-------+\n    |                          |A-WDSP3|\n    |                          | Prot2 |\n    +----------------+         +-------+\n                     |          [...]\n                     |\n                     |         +-----------------+\n                     |         |-----+ Country B |     +-------+\n                     +-------->|Prot1|   DAG     |     |B-WSDP1|\n                               | CAP |     +-----|     | Prot2 |\n                               |-----+     |Prot1|     +-------+\n                               |           | SAP |\n                               |           +-----|     +-------+\n                               |    +-------+    |     |B-WDSP2|\n                               |    | RI-B  |    |     | Prot1 |\n                               +-----------------+     +-------+\n                                                        [...]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where Prot[i] is some particular query protocol RI-A has an index over all A-WDSP[i] and RI-B RI-B has an index over all B-WDSP[i] (1) is the query to the Country A DAG system, which yields a referral based on the index object from RI-B (2) is that referral (3) is the resolution of that referral, which the client takes to the Country B DAG system directly (to find out which, if any, B-WDSP[i] have relevant information)",
      "zh-CHS": "其中，Prot[i]是某个特定的查询协议，RI-A在所有A-WDSP[i]上有一个索引，RI-B RI-B在所有B-WDSP[i]上有一个索引，（1）是对国家A DAG系统的查询，该系统基于来自RI-B的索引对象生成引用（2）是引用（3）是该引用的解析，客户直接将其带到B国DAG系统（以了解B-WDSP[i]是否有相关信息）"
    },
    {
      "indent": 3,
      "text": "Case 2:",
      "zh-CHS": "案例2："
    },
    {
      "indent": 3,
      "text": "Country A and Country B are running services that address the same service type (e.g., whitepages), but are not using an identical collection of protocols, allowed queries, or schema. The index object that Country B sent to Country A's DAG service must be constructed in terms of Country A's service, in order for appropriate hits to be generated against the index object (i.e. for referrals to Country B's service). However, to resolve the referral, it will be necessary to do some further protocol/schema/query mapping. This can be done by a special SAP established within Country A's service, that maps Country A's service into the published service of Country B. Country A may then elect to support only one of Country B's access protocols, and the designated SAP will always contact one type of CAP at Country B.",
      "zh-CHS": "国家/地区A和国家/地区B正在运行服务，这些服务针对相同的服务类型（例如，白页），但不使用相同的协议集合、允许的查询或模式。国家B发送给国家A的DAG服务的索引对象必须根据国家A的服务进行构造，以便针对索引对象生成适当的点击（即，用于向国家B的服务进行转介）。但是，要解决引用问题，需要进一步进行协议/模式/查询映射。这可以通过在a国服务内建立的特殊SAP来实现，该SAP将a国的服务映射到B国的已发布服务中。然后，a国可以选择只支持B国的一种访问协议，指定的SAP将始终联系B国的一种CAP。"
    },
    {
      "indent": 3,
      "text": "Alternatively, Country B can establish a particular CAP that does the mapping from Country A's service into something that is most appropriate against the internal structure of its service. In this case, Country A's referral will be to a special CAP in Country B's service (which, again, will look like a WDSP to the Country A service); in fact, the referral may be handled directly by the client software. The difference between the two possible approaches lies in the responsibility of managing the relationship between the 2 service types. On the one hand, Country A could handle it if it knows its service as well as the published access to Country B. On the other, Country B could be responsible for establishing a CAP for every country that may want to connect to it. The latter can, in some cases, be justified by the amount of internal optimization that can be done, and because it reduces the overhead for Country A's service (can pass the referral directly back to the client software).",
      "zh-CHS": "或者，B国可以建立一个特定的CAP，将a国的服务映射为最适合其服务内部结构的内容。在这种情况下，A国的转介将被转介到B国服务中的一个特殊CAP（同样，对于A国服务，它看起来像一个WDSP）；事实上，客户机软件可以直接处理转诊。这两种可能的方法之间的区别在于管理这两种服务类型之间关系的责任。一方面，如果A国知道它的服务以及对B国公布的访问权限，它可以处理该问题。另一方面，B国可以负责为每个可能希望连接到它的国家建立上限。在某些情况下，后者可以通过可以完成的内部优化数量来证明，因为它减少了A国服务的开销（可以将转介直接传递回客户端软件）。"
    },
    {
      "indent": 3,
      "text": "Consider the following illustration (only relevant CAPs, SAPs, etc, are shown; others suppressed for lack of room):",
      "zh-CHS": "考虑下面的插图（仅显示相关的上限、SAPS等）；其他由于缺乏空间而被抑制："
    },
    {
      "indent": 6,
      "text": "       +-----------------+\n  (1)  |-----+ Country A |     +-------+\n------>|Prot1|   DAG     |     |A-WSDP1|\n<------| CAP |     +-----|     | Prot1 |\n  (2)  |-----+     |Prot1|     +-------+\n       |           | SAP |\n----+  |           +-----|     +-------+\n (3)|  |    +-------+    |     |A-WDSP2|\n    |  |    | RI-A  |    |     | Prot1 |\n    |  +-----------------+     +-------+\n    |\n    |                          +-------+\n    |                          |A-WDSP3|\n    |                          | Prot2 |\n    +----------------+         +-------+\n                     |          [...]\n                     |\n                     |         +-----------------+\n                     |         |-----+ Country B |     +-------+\n                     |         |Prot3|   DAG     |     |B-WSDP1|\n                     |         | CAP |     +-----|     | Prot3 |\n                     |         |-----+     |Prot3|     +-------+\n                     |         |---------+ | SAP |\n                     |         |Country A| +-----|\n                     +-------->|CAP:Prot1|       |\n                               |---------+       |     +-------+\n                               |    +-------+    |     |B-WDSP2|\n                               |    | RI-B  |    |     | Prot3 |\n                               +-----------------+     +-------+\n                                                        [...]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where Prot[i] is some particular query protocol RI-A has an index over all A-WDSP[i] and RI-B RI-B has an index over all B-WDSP[i] (1) is the query to the Country A DAG system, which yields a referral based on the index object from RI-B (2) is that referral (3) is the resolution of that referral, which the client takes to the Country B DAG system directly, but to a CAP that is specifically designed to accommodate protocols from Country A's service, and map it (and schema) into Country B's service. Likely, all Country B referrals will be chained for the Country A client",
      "zh-CHS": "其中，Prot[i]是某个特定的查询协议，RI-A在所有A-WDSP[i]上有一个索引，RI-B RI-B在所有B-WDSP[i]上有一个索引，（1）是对国家A DAG系统的查询，该系统基于来自RI-B的索引对象生成引用（2）是引用（3）是该引用的解析，客户机直接将其带到B国DAG系统，但带到专门设计用于容纳a国服务协议的CAP，并将其（和模式）映射到B国服务。很可能，所有B国转介都将针对A国客户进行链接"
    },
    {
      "indent": 3,
      "text": "Case 3:",
      "zh-CHS": "案例3："
    },
    {
      "indent": 3,
      "text": "The third possibility is, in fact, a refinement of the first. If Country A and Country B are running services that are every way identical except for the data (WDSPs covered), then it may make sense to NOT aggregate Country B's WDSP index objects, but to copy them to Country A's server. Then, Country A's CAPs might be given access to the SAPs of Country B in order to carry out chaining directly at the remote service (instead of implicating Country A's SAPs and Country B's CAPs, as in the first example above). The answer does not come from technology -- it depends entirely on the nature of the relationship that can be established between Country A and Country B's services.",
      "zh-CHS": "事实上，第三种可能性是对第一种可能性的改进。如果国家A和国家B运行的服务除数据（包含的WDSP）外完全相同，则不聚合国家B的WDSP索引对象，而是将它们复制到国家A的服务器可能是有意义的。然后，国家A的CAP可以访问国家B的SAP，以便直接在远程服务上执行链接（而不是像上面的第一个示例那样涉及国家A的SAP和国家B的CAP）。答案并不来自技术——它完全取决于A国和B国服务之间可以建立的关系的性质。"
    },
    {
      "indent": 0,
      "text": "1.1.2 Scenario 2: Working Up",
      "section_title": true,
      "zh-CHS": "1.1.2 情景2：准备工作"
    },
    {
      "indent": 3,
      "text": "The above scenario implicitly assumes that Country A's server had received index objects from Country B's server. This will be the case if Country A's server is higher in the levels of a hierarchy of services (established by agreements between the service operators), or if the network is comprised of servers that share their index objects with all others, for example. In the latter case, searching at any one of the servers in the service yields the full range of results -- referrals will be made to any other server that might have data that fulfills the user's query. The sharing of the index objects is a mechanism to allow each server to manage local data, while enabling distributed load-sharing on the basic query handling.",
      "zh-CHS": "上述场景隐含地假设国家A的服务器已从国家B的服务器接收到索引对象。例如，如果国家A的服务器在服务层次结构中的级别较高（由服务运营商之间的协议建立），或者如果网络由与所有其他服务器共享其索引对象的服务器组成，则会出现这种情况。在后一种情况下，在服务中的任何一台服务器上进行搜索都会得到完整的结果——将引用到可能具有满足用户查询的数据的任何其他服务器。索引对象的共享是一种机制，允许每个服务器管理本地数据，同时在基本查询处理上启用分布式负载共享。"
    },
    {
      "indent": 3,
      "text": "However, if a hierarchical, or at least not-completely-connected model is used for the server network, queries carried out at a level other than the top of the hierarchy, or in one particular branch of the hierarchy, will not actually be matched against all index objects. Therefore, there may be other servers to which the query should be directed if the full space needs to be searched. Suppose, for example, that in the above example Country B is in fact lower in the hierarchy than Country A. A user sending a query to Country B's service may be content to limit the scope of the query to that country's information (this is true in enough real-life situations that this hierarchical relationship becomes an effective mechanism for scoping queries and avoiding having to flood the entire network with every single query or keep full copies of all data in every server).",
      "zh-CHS": "但是，如果服务器网络使用分层模型，或至少不完全连接的模型，则在层次结构顶部以外的级别或层次结构的一个特定分支中执行的查询实际上不会与所有索引对象匹配。因此，如果需要搜索整个空间，则可能存在查询应指向的其他服务器。例如，假设在上述示例中，国家B的层次结构实际上低于国家A。向国家B的服务发送查询的用户可能满足于将查询范围限制为该国家的信息（这在足够多的实际情况下是正确的，这种分层关系成为一种有效的机制，用于确定查询的范围，避免每次查询都充斥整个网络，或在每台服务器中保留所有数据的完整副本）。"
    },
    {
      "indent": 3,
      "text": "Still in theoretical stages, the DAG/IP provides control constructs to allow DAG components to act according to the topology of the mesh. A CAP might use the \"polled-by\" system command to establish what other servers in the mesh exist in higher levels (and therefore would be worth contacting if the scope of the search is to be increased).",
      "zh-CHS": "仍处于理论阶段的DAG/IP提供了控制构造，以允许DAG组件根据网格的拓扑进行操作。CAP可能会使用“polled by”系统命令来确定网格中存在哪些更高级别的其他服务器（因此，如果要扩大搜索范围，则值得联系）。"
    },
    {
      "indent": 3,
      "text": "In the example above, a CAP in Country B's system could determine that Country A's service was polling Country B, and therefore make it a logical target for expanding the scope of the query. More experience (primarily with server mesh topologies) is necessary before it will be clear how to best make use of these capabilities:",
      "zh-CHS": "在上面的示例中，国家B系统中的CAP可以确定国家a的服务正在轮询国家B，从而使其成为扩展查询范围的逻辑目标。在明确如何最好地利用这些功能之前，需要更多的经验（主要是服务器网格拓扑）："
    },
    {
      "indent": 7,
      "text": ". should the CAP always broaden the scope? only if there are no local referrals? under user direction? . should the CAP use a local SAP to contact the remote service's CAP? . is it better to completely connect the mesh of servers, or produce some kind of hierarchy? . etc",
      "zh-CHS": ". 上限是否应该总是扩大范围？只有在没有本地转介的情况下？在用户指导下。CAP是否应使用本地SAP联系远程服务的CAP。是完全连接服务器的网状结构更好，还是产生某种层次结构更好。等"
    },
    {
      "indent": 0,
      "text": "2. Other considerations",
      "section_title": true,
      "zh-CHS": "2. 其他考虑"
    },
    {
      "indent": 3,
      "text": "Depending on the context in which a mesh is established (e.g., between national white pages services, or different units of a corporate organization, etc), it may be useful to allow individual WDSPs to indicate whether they are willing to have their data included in a DAG system's aggregated index object (i.e., allowing the DAG system to receive referrals from other systems in the mesh).",
      "zh-CHS": "根据建立网格的上下文（例如，在国家白页服务或公司组织的不同单位之间等），允许单个WDSP指示其是否愿意将其数据包括在DAG系统的聚合索引对象中可能是有用的（即，允许DAG系统接收来自mesh中其他系统的转诊）。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document describes different configurations for sharing information between information services. It introduces no security considerations beyond those attendant in (and addressed by) particular directory service access protocols.",
      "zh-CHS": "本文档描述了在信息服务之间共享信息的不同配置。除了在特定目录服务访问协议中（并由特定目录服务访问协议解决）的伴随因素之外，它不引入任何安全考虑因素。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "zh-CHS": "4. 致谢"
    },
    {
      "indent": 3,
      "text": "The work described in this document was carried out as part of an on-going project of Ericsson. For further information regarding that project, contact:",
      "zh-CHS": "本文件中描述的工作是作为爱立信正在进行的项目的一部分进行的。有关该项目的更多信息，请联系："
    },
    {
      "indent": 6,
      "text": "Bjorn Larsson bjorn.x.larsson@era.ericsson.se",
      "zh-CHS": "比约恩·拉尔森比约恩.x。larsson@era.ericsson.se"
    },
    {
      "indent": 0,
      "text": "5. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "5. 作者地址"
    },
    {
      "indent": 3,
      "text": "Leslie L. Daigle Thinking Cat Enterprises",
      "zh-CHS": "莱斯利·L·戴格尔思维猫企业"
    },
    {
      "indent": 3,
      "text": "EMail:  leslie@thinkingcat.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Thommy Eklof Hotsip AB",
      "zh-CHS": "托米·埃克洛夫酒店"
    },
    {
      "indent": 3,
      "text": "EMail: thommy.eklof@hotsip.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 3,
      "text": "Request For Comments (RFC) and Internet Draft documents are available from numerous mirror sites.",
      "zh-CHS": "许多镜像站点都提供了征求意见（RFC）和互联网草稿文档。"
    },
    {
      "indent": 3,
      "text": "[CIP1] Allen, J. and M. Mealling, \"The Architecture of the Common Indexing Protocol (CIP)\", RFC 2651, August 1999.",
      "zh-CHS": "[CIP1]Allen，J.和M.Melling，“公共索引协议（CIP）的架构”，RFC 26511999年8月。"
    },
    {
      "indent": 3,
      "text": "[TISDAG] Daigle, L. and R. Hedberg \"Technical Infrastructure for Swedish Directory Access Gateways (TISDAG),\" RFC 2967, October 2000.",
      "zh-CHS": "[TISDAG]Daigle，L.和R.Hedberg，“瑞典目录访问网关（TISDAG）的技术基础设施”，RFC 2967，2000年10月。"
    },
    {
      "indent": 3,
      "text": "[DAGEXP] Eklof, T. and L. Daigle, \"Wide Area Directory Deployment Experiences\", RFC 2969, October 2000.",
      "zh-CHS": "[DAGEXP]Eklof，T.和L.Daigle，“广域目录部署经验”，RFC 2969，2000年10月。"
    },
    {
      "indent": 3,
      "text": "[NDD] Hedberg, R. and H. Alvestrand, \"Technical Specification, The Norwegian Directory of Directories (NDD)\", Work in Progress.",
      "zh-CHS": "[NDD]Hedberg，R.和H.Alvestrand，“技术规范，挪威目录目录（NDD）”，正在进行的工作。"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "7. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}