{
  "title": {
    "text": "RFC 2850:  Charter of the Internet Architecture Board (IAB) ",
    "zh-CHS": "RFC 2850"
  },
  "number": 2850,
  "created_at": "2021-10-24 19:21:19.850881+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                        Internet Architecture Board\nRequest for Comments: 2850                          B. Carpenter, Editor\nObsoletes: 1601                                                 May 2000\nBCP: 39\nCategory: Best Current Practice",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Charter of the Internet Architecture Board (IAB)",
      "zh-CHS": "互联网架构委员会（IAB）章程"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo documents the composition, selection, roles, and organization of the Internet Architecture Board. It replaces RFC 1601.",
      "zh-CHS": "本备忘录记录了互联网架构委员会的组成、选择、角色和组织。它取代了RFC1601。"
    },
    {
      "indent": 0,
      "text": "Table of Contents:",
      "zh-CHS": "目录："
    },
    {
      "indent": 3,
      "text": "1. IAB Membership...............................................2\n1.1  Selection of full IAB members..............................2\n1.2 Ex-Officio and Liaison members..............................2\n2.  The Role of the IAB.........................................3\n2.1 Architectural oversight in more detail......................4\n3. IAB Organization.............................................5\n3.1 IAB chair...................................................5\n3.2 Executive Director..........................................5\n3.3 Selection of the IRTF chair.................................5\n3.4 Liaisons within the IETF....................................5\n3.5 Decision taking.............................................6\n3.6 Openness and confidentiality................................6\nSecurity Considerations.........................................6\nSummary of Changes from RFC 1601................................6\nReferences......................................................7\nAuthor's Address................................................7\nFull Copyright Statement........................................8",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. IAB Membership",
      "section_title": true,
      "zh-CHS": "1. 国际律师协会会员"
    },
    {
      "indent": 3,
      "text": "The Internet Architecture Board (IAB) shall consist of thirteen full members, composed of the chair of the Internet Engineering Task Force (IETF), and of twelve sitting members. The IETF chair, who is also the chair of the Internet Engineering Steering Group (IESG), may participate in all official IAB actions except the approval of IESG members and appeals against IESG decisions. Ex-officio and liaison members of the IAB may also attend IAB meetings but shall not participate in determination of official actions.",
      "zh-CHS": "互联网架构委员会（IAB）应由13名正式成员组成，其中包括互联网工程任务组（IETF）主席和12名现任成员。IETF主席同时也是互联网工程指导小组（IESG）主席，除IESG成员的批准和对IESG决定的上诉外，IETF主席可参与所有官方IAB行动。IAB的当然成员和联络成员也可以参加IAB会议，但不得参与官方行动的确定。"
    },
    {
      "indent": 3,
      "text": "Members of the IAB shall serve as individuals, and not as representatives of any company, agency, or other organization. Members of the IAB shall owe no fiduciary duty of loyalty or care to IAB, IETF, IRTF or IESG.",
      "zh-CHS": "IAB成员应作为个人，而不是任何公司、机构或其他组织的代表。IAB成员对IAB、IETF、IRTF或IESG不承担任何忠实或谨慎的信托责任。"
    },
    {
      "indent": 0,
      "text": "1.1 Selection of full IAB members",
      "section_title": true,
      "zh-CHS": "1.1 遴选国际律师协会正式会员"
    },
    {
      "indent": 3,
      "text": "Full IAB members, including the IETF chair, are selected and appointed according to the procedures defined in [BCP 10] . Normally, six sitting members are appointed each year to sit for two years, and the IETF chair is appointed every two years.",
      "zh-CHS": "IAB的正式成员，包括IETF主席，根据[BCP 10]中规定的程序进行挑选和任命。通常，每年任命六名现任成员，任期两年，IETF主席每两年任命一次。"
    },
    {
      "indent": 3,
      "text": "There is no limit to the number of terms that a member of the IAB may serve, subject to the process defined by [BCP 10].",
      "zh-CHS": "根据[BCP 10]规定的流程，IAB成员可以服务的条款数量没有限制。"
    },
    {
      "indent": 3,
      "text": "Mid-term vacancies are filled as defined in [BCP 10] and do not affect the IAB's power to take decisions.",
      "zh-CHS": "中期空缺按照[BCP 10]的定义填补，不影响IAB的决策权。"
    },
    {
      "indent": 0,
      "text": "1.2 Ex-Officio and Liaison members",
      "section_title": true,
      "zh-CHS": "1.2 当然委员及联络委员"
    },
    {
      "indent": 3,
      "text": "Ex-officio and liaison members of the IAB have no standing to participate in IAB decisions but are expected to participate in IAB discussions as appropriate to their roles. However, an ex-officio position may be held by a full member, who does not thereby lose his or her standing to participate in IAB decisions.",
      "zh-CHS": "IAB的当然成员和联络成员无权参与IAB的决策，但应根据其角色参与IAB的讨论。但是，当然职位可由正式成员担任，该成员不会因此失去参与IAB决策的资格。"
    },
    {
      "indent": 3,
      "text": "The chair of the Internet Research Task Force (IRTF) is an ex-officio member of the IAB. The IAB has an Executive Director who is an ex-officio member of the IAB.",
      "zh-CHS": "互联网研究工作组（IRTF）主席是IAB的当然成员。IAB有一名执行董事，他是IAB的当然成员。"
    },
    {
      "indent": 3,
      "text": "The Internet Society, the RFC Editor, the IANA and the IESG each appoints a liaison member to the IAB. These liaison positions may not be held by a full member of the IAB.",
      "zh-CHS": "互联网协会、RFC编辑、IANA和IESG各自为IAB任命一名联络员。这些联络职位不得由IAB的正式成员担任。"
    },
    {
      "indent": 3,
      "text": "Vacancies in the liaison and ex officio positions do not affect the IAB's power to take decisions.",
      "zh-CHS": "联络和当然职位的空缺不影响IAB的决策权。"
    },
    {
      "indent": 0,
      "text": "2. The Role of the IAB",
      "section_title": true,
      "zh-CHS": "2. IAB的作用"
    },
    {
      "indent": 3,
      "text": "The IAB is chartered both as a committee of the IETF and as an advisory body of the Internet Society. Its responsibilities include:",
      "zh-CHS": "IAB既是IETF的一个委员会，也是互联网协会的一个咨询机构。其职责包括："
    },
    {
      "indent": 3,
      "text": "(a) IESG Appointment",
      "zh-CHS": "(a) IESG任命"
    },
    {
      "indent": 3,
      "text": "The IETF nominating committee established under [BCP 10] annually provides a list of candidates for vacant IESG seats and for the IETF Chair if vacant. The IAB reviews the candidates, consenting to some, all, or none.",
      "zh-CHS": "根据[BCP 10]成立的IETF提名委员会每年提供IESG空缺席位和IETF主席（如果空缺）的候选人名单。IAB审查候选人，同意部分、全部或不同意。"
    },
    {
      "indent": 3,
      "text": "(b) Architectural Oversight",
      "zh-CHS": "(b) 建筑监督"
    },
    {
      "indent": 3,
      "text": "The IAB provides oversight of the architecture for the protocols and procedures used by the Internet. This point is expanded in Section 2.1 below.",
      "zh-CHS": "IAB对互联网使用的协议和程序的架构进行监督。下文第2.1节对此进行了阐述。"
    },
    {
      "indent": 3,
      "text": "(c) Standards Process Oversight and Appeal",
      "zh-CHS": "(c) 标准程序监督和上诉"
    },
    {
      "indent": 3,
      "text": "The IAB provides oversight of the process used to create Internet Standards [BCP 9].",
      "zh-CHS": "IAB对用于创建互联网标准的流程进行监督[BCP 9]。"
    },
    {
      "indent": 3,
      "text": "The IAB serves as an appeal board for complaints of improper execution of the standards process, with powers defined in [BCP 9].",
      "zh-CHS": "IAB作为投诉标准流程执行不当的上诉委员会，其权力定义见[BCP 9]。"
    },
    {
      "indent": 3,
      "text": "(d) RFC Series and IANA",
      "zh-CHS": "(d) RFC系列与IANA"
    },
    {
      "indent": 3,
      "text": "The RFC Editor executes editorial management and publication of the IETF \"Request for Comment\" (RFC) document series, which is the permanent document repository of the IETF. The RFC series constitutes the archival publication channel for Internet Standards and for other contributions by the Internet research and engineering community. RFCs are available free of charge to anyone via the Internet. The IAB must approve the appointment of an organization to act as RFC Editor and the general policy followed by the RFC Editor.",
      "zh-CHS": "RFC编辑器执行IETF“征求意见”（RFC）文件系列的编辑管理和发布，该文件系列是IETF的永久性文件存储库。RFC系列构成了互联网标准和互联网研究与工程界其他贡献的档案出版渠道。任何人都可以通过互联网免费获得RFC。IAB必须批准任命一个组织担任RFC编辑，以及RFC编辑遵循的一般政策。"
    },
    {
      "indent": 3,
      "text": "The Internet Assigned Numbers Authority (IANA) administers various protocol parameters used by IETF protocols, delegating this administration as appropriate. The IAB must approve the appointment of an organization to act as IANA on behalf of the IETF. The IANA takes technical direction on IETF protocols from the IESG.",
      "zh-CHS": "互联网分配号码管理局（IANA）管理IETF协议使用的各种协议参数，并酌情授权该管理。IAB必须批准任命一个组织代表IETF担任IANA。IANA从IESG获得IETF协议的技术指导。"
    },
    {
      "indent": 3,
      "text": "(e) ISOC Liaison",
      "zh-CHS": "(e) ISOC联络"
    },
    {
      "indent": 3,
      "text": "The IAB acts as a source of advice and guidance to the Board of Trustees and Officers of the Internet Society concerning technical, architectural, procedural, and (where appropriate) policy matters",
      "zh-CHS": "IAB是向董事会和互联网协会官员提供有关技术、架构、程序和（适当时）政策事项的建议和指导的来源"
    },
    {
      "indent": 3,
      "text": "pertaining to the Internet and its enabling technologies. If necessary the IAB may convene panels of knowledgeable people, hold hearings, and otherwise pursue the investigation of specific questions or topics presented to it by the Internet Society.",
      "zh-CHS": "用于修饰或说明互联网及其使能技术。如有必要，IAB可召集知识渊博的人士组成的小组，举行听证会，并对互联网协会向其提出的具体问题或主题进行调查。"
    },
    {
      "indent": 3,
      "text": "(f) External Liaison",
      "zh-CHS": "(f) 对外联络"
    },
    {
      "indent": 3,
      "text": "The IAB acts as representative of the interests of the IETF and the Internet Society in technical liaison relationships with other organizations concerned with standards and other technical and organizational issues relevant to the world-wide Internet. Liaisons are kept as informal as possible and must be of demonstrable value in improving the quality of IETF specifications. Individual members of the IETF are appointed as liaisons to other organizations by the IAB or IESG as appropriate.",
      "zh-CHS": "IAB代表IETF和互联网协会的利益，与涉及标准和其他与全球互联网相关的技术和组织问题的其他组织建立技术联络关系。联络应尽可能非正式，并且在提高IETF规范的质量方面必须具有明显的价值。IETF的个别成员由IAB或IESG（视情况而定）指定为与其他组织的联络人。"
    },
    {
      "indent": 0,
      "text": "2.1 Architectural oversight in more detail",
      "section_title": true,
      "zh-CHS": "2.1 更详细的架构监督"
    },
    {
      "indent": 3,
      "text": "A major role of the IAB is long range planning and coordination between different areas of IETF activity. The IAB, both collectively and on an individual basis, is expected to pay attention to important long-term issues in the Internet, and to make sure that these issues are brought to the attention of the group(s) that are in a position to address them. It is also expected to play a role in assuring that the people responsible for evolving the Internet and its technology are aware of the essential elements of the Internet architecture.",
      "zh-CHS": "IAB的主要作用是IETF活动不同领域之间的长期规划和协调。IAB应集体或单独关注互联网上的重要长期问题，并确保将这些问题提请有能力解决这些问题的集团注意。它还将发挥作用，确保负责发展互联网及其技术的人员了解互联网架构的基本要素。"
    },
    {
      "indent": 3,
      "text": "IAB members pay special attention to emerging activities in the IETF and to \"Birds of a Feather\" sessions at IETF meetings. The IAB assists the IESG in evaluating such activities and in determining whether an IETF or an IRTF group is more appropriate. When a new IETF working group is proposed, the IESG will forward a preliminary version of the charter to the IAB for review of architectural consistency and integrity. The IAB shall review these proposed charters and give feedback to the IESG as appropriate.",
      "zh-CHS": "IAB成员特别关注IETF中出现的活动以及IETF会议上的“羽毛鸟”会议。IAB协助IESG评估此类活动，并确定IETF或IRTF组是否更合适。当提议成立新的IETF工作组时，IESG将向IAB提交章程的初步版本，以审查架构的一致性和完整性。IAB应审查这些拟议章程，并酌情向IESG提供反馈。"
    },
    {
      "indent": 3,
      "text": "Pursuant to the architectural oversight function, the IAB sponsors and organizes the Internet Research Task Force (IRTF) [BCP 8]. The IAB reviews proposed IRTF groups.",
      "zh-CHS": "根据架构监督职能，IAB赞助并组织互联网研究工作队（IRTF）[BCP 8]。IAB审查提议的IRTF组。"
    },
    {
      "indent": 3,
      "text": "The IAB will convene invitational workshops to perform in-depth reviews of particular architectural issues. Such reviews may include consideration of relevant IETF and IRTF activities, and of work in other organizations, and for this purpose the workshop may invite presentations by qualified parties on the design goals and decisions, technology choices, and other pertinent aspects of these activities. The results of such a review will be a report which may give advice to the IETF community and the IESG.",
      "zh-CHS": "IAB将召开邀请研讨会，对特定建筑问题进行深入审查。此类审查可能包括对相关IETF和IRTF活动以及其他组织工作的考虑，为此，研讨会可能邀请合格各方就设计目标和决策、技术选择以及这些活动的其他相关方面进行介绍。此类审查的结果将是一份报告，可向IETF社区和IESG提供建议。"
    },
    {
      "indent": 3,
      "text": "The IAB may organize ad hoc bodies of independent technical experts to adjudicate technical disputes.",
      "zh-CHS": "IAB可以组织由独立技术专家组成的特设机构来裁决技术争议。"
    },
    {
      "indent": 0,
      "text": "3. IAB Organization",
      "section_title": true,
      "zh-CHS": "3. 国际律师协会组织"
    },
    {
      "indent": 0,
      "text": "3.1 IAB chair",
      "section_title": true,
      "zh-CHS": "3.1 IAB椅"
    },
    {
      "indent": 3,
      "text": "The members of the IAB shall select one of its full members to serve as the chair of the IAB, with all of the duties and responsibilities normally associated with such a position. The term of the IAB chair shall be one year, with no restriction on renewal. The chair of the IAB may be removed at any time by the affirmative vote of two-thirds of the members of the IAB, or as a result of his or her departure from the IAB.",
      "zh-CHS": "IAB成员应从其正式成员中选出一名担任IAB主席，承担通常与该职位相关的所有职责。IAB主席的任期为一年，不受续任限制。IAB主席可在任何时候通过IAB三分之二成员的赞成票或因其离开IAB而被免职。"
    },
    {
      "indent": 3,
      "text": "The chair of the IAB shall have the authority to manage the activities and meetings of the IAB.",
      "zh-CHS": "IAB主席有权管理IAB的活动和会议。"
    },
    {
      "indent": 0,
      "text": "3.2 Executive Director",
      "section_title": true,
      "zh-CHS": "3.2 执行董事"
    },
    {
      "indent": 3,
      "text": "The chair of the IAB shall have the authority to appoint an honorary Executive Director (ExecD) for a one-year renewable term, and to remove him or her. The ExecD shall administer the internal operation of the IAB, e.g., organization of meetings and reporting of their results.",
      "zh-CHS": "IAB主席有权任命一名名誉执行董事（ExecD），任期一年，可连任，并将其免职。执行董事应管理IAB的内部运作，例如组织会议并报告会议结果。"
    },
    {
      "indent": 3,
      "text": "The ExecD is an ex-officio member as defined in Section 1.2.",
      "zh-CHS": "执行董事是第1.2节规定的当然成员。"
    },
    {
      "indent": 0,
      "text": "3.3 Selection of the IRTF chair",
      "section_title": true,
      "zh-CHS": "3.3 IRTF主席的选择"
    },
    {
      "indent": 3,
      "text": "The IAB shall have the authority to appoint the chair of the Internet Research Task Force (IRTF) for a two-year renewable term, and to remove him or her. The IRTF chair shall be responsible for the management and organization of the IRTF according to [BCP 8].",
      "zh-CHS": "IAB有权任命互联网研究工作组（IRTF）主席，任期两年，可连任，并将其免职。IRTF主席应根据[BCP 8]负责IRTF的管理和组织。"
    },
    {
      "indent": 3,
      "text": "The IRTF chair is an ex-officio member as defined in Section 1.2.",
      "zh-CHS": "IRTF主席是第1.2节定义的当然成员。"
    },
    {
      "indent": 0,
      "text": "3.4 Liaisons within the IETF",
      "section_title": true,
      "zh-CHS": "3.4 IETF内部的联络"
    },
    {
      "indent": 3,
      "text": "The chair of the IAB and another full IAB member (other than the IETF chair), to be selected by the IAB, shall serve as liaisons to the IESG. In addition, the IESG will appoint one of its members (other than the IETF chair) to serve as a liaison to the IAB. The IESG liaison may attend IAB meetings.",
      "zh-CHS": "IAB主席和另一名正式IAB成员（IETF主席除外），由IAB选择，应作为IESG的联络人。此外，IESG将任命一名成员（IETF主席除外）担任IAB的联络人。IESG联络人可参加IAB会议。"
    },
    {
      "indent": 3,
      "text": "Vacancies in these liaison seats have no effect on the IAB's or the IESG's powers to make decisions.",
      "zh-CHS": "这些联络席位的空缺不影响IAB或IESG的决策权。"
    },
    {
      "indent": 0,
      "text": "3.5 Decision taking",
      "section_title": true,
      "zh-CHS": "3.5 决策"
    },
    {
      "indent": 3,
      "text": "The IAB attempts to reach all decisions unanimously. If unanimity cannot be achieved, the chair may conduct informal polls to determine consensus. The IAB may make decisions and take action if at least seven full members concur and there are no more than two dissents.",
      "zh-CHS": "IAB试图一致达成所有决定。如果无法达成一致意见，主席可进行非正式投票以确定共识。如果至少有七名正式成员同意，且不超过两名持不同意见，IAB可以做出决定并采取行动。"
    },
    {
      "indent": 3,
      "text": "The IAB may reach decisions by face to face meeting, teleconference, Internet communication, or any combination of the above.",
      "zh-CHS": "IAB可通过面对面会议、电话会议、互联网通信或上述任何组合作出决定。"
    },
    {
      "indent": 0,
      "text": "3.6 Openness and confidentiality",
      "section_title": true,
      "zh-CHS": "3.6 公开和保密"
    },
    {
      "indent": 3,
      "text": "The IAB publishes minutes of all its meetings on the Internet, and conducts an open meeting at every IETF meeting. It publishes all its findings as RFCs, Internet Drafts or messages to the IETF mailing list. However, discussion of personnel matters and possibly legal and financial matters may sometimes be required to be kept confidential, and the chair may, with the consent of the full members, exclude liaison and ex officio members from such discussions.",
      "zh-CHS": "IAB在互联网上发布所有会议记录，并在每次IETF会议上举行公开会议。它将所有发现作为RFC、互联网草案或信息发布到IETF邮件列表中。但是，有时可能需要对人事事项以及可能的法律和财务事项的讨论保密，主席可在全体成员同意的情况下，将联络员和当然成员排除在此类讨论之外。"
    },
    {
      "indent": 3,
      "text": "Specifically, the IAB makes use of the second level domain iab.org and the URL http://www.iab.org to publish information.",
      "zh-CHS": "具体而言，IAB使用二级域IAB.org和URLhttp://www.iab.org 发布信息。"
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "zh-CHS": "安全考虑"
    },
    {
      "indent": 3,
      "text": "This memo does not raise any known security threats.",
      "zh-CHS": "这份备忘录没有提出任何已知的安全威胁。"
    },
    {
      "indent": 0,
      "text": "Summary of Changes from RFC 1601",
      "zh-CHS": "RFC 1601变更汇总表"
    },
    {
      "indent": 3,
      "text": "This document replaces [RFC 1601]. The principal change is the removal of material now covered in [BCP 8], [BCP 9] and [BCP 10], with many consequent editorial changes. Additional changes are:",
      "zh-CHS": "本文件取代[RFC 1601]。主要的变化是删除了[BCP 8]、[BCP 9]和[BCP 10]中的内容，并随之进行了许多编辑性修改。其他改动包括："
    },
    {
      "indent": 6,
      "text": "- description of decision making when unanimity cannot be achieved - note on openness and confidentiality - addition of liaison seats for the Internet Society and the IANA - revised text concerning the IANA and the RFC Editor - clarifications following legal review",
      "zh-CHS": "- 无法达成一致意见时的决策说明-关于公开性和保密性的说明-增加互联网协会和IANA的联络席位-关于IANA和RFC编辑的修订文本-法律审查后的澄清"
    },
    {
      "indent": 0,
      "text": "References",
      "zh-CHS": "工具书类"
    },
    {
      "indent": 3,
      "text": "[RFC 1601] Huitema, C., \"Charter of the Internet Architecture Board (IAB)\", RFC 1601, March 1994.",
      "zh-CHS": "[RFC 1601]Huitema，C.，“互联网架构委员会（IAB）章程”，RFC 16011994年3月。"
    },
    {
      "indent": 3,
      "text": "[BCP 8] Weinrib, A., and J. Postel, \"IRTF Research Group Guidelines and Procedures\", BCP 8, RFC 2014, October 1996.",
      "zh-CHS": "[BCP 8]Weinrib，A.和J.Postel，“IRTF研究小组指南和程序”，BCP 8，RFC 2014，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[BCP 9] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[BCP 9]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[BCP 10] Galvin, J., \"IAB and IESG Selection, Confirmation, and Recall Process: Operation of the Nominating and Recall Committees\", BCP 10, RFC 2282, February 1998.",
      "zh-CHS": "[BCP 10]Galvin，J.，“IAB和IESG的选择、确认和召回过程：提名和召回委员会的运作”，BCP 10，RFC 2282，1998年2月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Brian E. Carpenter IBM c/o iCAIR Suite 150 1890 Maple Avenue Evanston IL 60201 USA",
      "zh-CHS": "Brian E.Carpenter IBM c/o iCAIR 150套房美国伊利诺伊州埃文斯顿枫叶大道1890号60201"
    },
    {
      "indent": 3,
      "text": "EMail: brian@icair.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}