{
  "title": {
    "text": "RFC 2665:  Definitions of Managed Objects for the Ethernet-like Interface Types ",
    "zh-CHS": "RFC 2665"
  },
  "number": 2665,
  "created_at": "2021-10-24 03:09:02.596564+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           J. Flick\nRequest for Comments: 2665                       Hewlett-Packard Company\nObsoletes: 2358                                               J. Johnson\nCategory: Standards Track                               RedBack Networks\n                                                             August 1999",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Definitions of Managed Objects for the Ethernet-like Interface Types",
      "zh-CHS": "类以太网接口类型的托管对象定义"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. This memo obsoletes RFC 2358, \"Definitions of Managed Objects for the Ethernet-like Interface Types\". This memo extends that specification by including management information useful for the management of 1000 Mb/s and full-duplex Ethernet interfaces.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。本备忘录废除了RFC 2358“类似以太网接口类型的托管对象定义”。本备忘录扩展了该规范，包括对管理1000 Mb/s和全双工以太网接口有用的管理信息。"
    },
    {
      "indent": 3,
      "text": "Ethernet technology, as defined by the 802.3 Working Group of the IEEE, continues to evolve, with scalable increases in speed, new types of cabling and interfaces, and new features. This evolution may require changes in the managed objects in order to reflect this new functionality. This document, as with other documents issued by this working group, reflects a certain stage in the evolution of Ethernet technology. In the future, this document might be revised, or new documents might be issued by the Ethernet Interfaces and Hub MIB Working Group, in order to reflect the evolution of Ethernet technology.",
      "zh-CHS": "根据IEEE 802.3工作组的定义，以太网技术不断发展，速度不断提高，布线和接口类型不断增加，功能不断增加。这种演变可能需要对托管对象进行更改，以反映这种新功能。与本工作组发布的其他文件一样，本文件反映了以太网技术发展的某个阶段。将来，以太网接口和集线器MIB工作组可能会修订本文件，或发布新的文件，以反映以太网技术的发展。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ................................................    2\n2.  The SNMP Management Framework ..............................    3\n3.  Overview ...................................................    4\n3.1.  Relation to MIB-2 ........................................    4\n3.2.  Relation to the Interfaces MIB ...........................    5\n3.2.1.  Layering Model .........................................    5\n3.2.2.  Virtual Circuits .......................................    5\n3.2.3.  ifTestTable ............................................    5\n3.2.4.  ifRcvAddressTable ......................................    6\n3.2.5.  ifPhysAddress ..........................................    6\n3.2.6.  ifType .................................................    6\n3.2.7.  Specific Interface MIB Objects .........................    7\n3.3.  Relation to the 802.3 MAU MIB ............................   11\n3.4.  dot3StatsEtherChipSet ....................................   11\n3.5.  Mapping of IEEE 802.3 Managed Objects ....................   12\n4.  Definitions ................................................   16\n5.  Intellectual Property ......................................   39\n6.  Acknowledgements ...........................................   40\n7.  References .................................................   41\n8.  Security Considerations ....................................   43\n9.  Authors' Addresses .........................................   44\nA.  Change Log .................................................   45\nA.1.  Changes since RFC 2358 ...................................   45\nA.2.  Changes between RFC 1650 and RFC 2358 ....................   46\nB.  Full Copyright Statement ...................................   47",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it defines objects for managing Ethernet-like interfaces.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别是，它定义了用于管理类以太网接口的对象。"
    },
    {
      "indent": 3,
      "text": "This memo also includes a MIB module. This MIB module extends the list of managed objects specified in the earlier version of this MIB: RFC 2358 [23].",
      "zh-CHS": "此备忘录还包括一个MIB模块。此MIB模块扩展了此MIB早期版本中指定的托管对象列表：RFC 2358[23]。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [26].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[26]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. The SNMP Management Framework",
      "section_title": true,
      "zh-CHS": "2. SNMP管理框架"
    },
    {
      "indent": 3,
      "text": "The SNMP Management Framework presently consists of five major components:",
      "zh-CHS": "SNMP管理框架目前由五个主要组件组成："
    },
    {
      "indent": 3,
      "text": "o An overall architecture, described in RFC 2571 [1].",
      "zh-CHS": "o RFC 2571[1]中描述的总体架构。"
    },
    {
      "indent": 3,
      "text": "o Mechanisms for describing and naming objects and events for the purpose of management. The first version of this Structure of Management Information (SMI) is called SMIv1 and described in STD 16, RFC 1155 [2], STD 16, RFC 1212 [3] and RFC 1215 [4]. The second version, called SMIv2, is described in STD 58, RFC 2578 [5], STD 58, RFC 2579 [6] and STD 58, RFC 2580 [7].",
      "zh-CHS": "o 为管理目的描述和命名对象和事件的机制。这种管理信息结构（SMI）的第一个版本称为SMIv1，并在STD 16、RFC 1155[2]、STD 16、RFC 1212[3]和RFC 1215[4]中进行了描述。第二个版本称为SMIv2，在STD 58、RFC 2578[5]、STD 58、RFC 2579[6]和STD 58、RFC 2580[7]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Message protocols for transferring management information. The first version of the SNMP message protocol is called SNMPv1 and described in STD 15, RFC 1157 [8]. A second version of the SNMP message protocol, which is not an Internet standards track protocol, is called SNMPv2c and described in RFC 1901 [9] and RFC 1906 [10]. The third version of the message protocol is called SNMPv3 and described in RFC 1906 [10], RFC 2572 [11] and RFC 2574 [12].",
      "zh-CHS": "o 用于传输管理信息的消息协议。SNMP消息协议的第一个版本称为SNMPv1，在STD 15、RFC 1157[8]中进行了描述。SNMP消息协议的第二个版本不是互联网标准跟踪协议，称为SNMPv2c，在RFC 1901[9]和RFC 1906[10]中进行了描述。消息协议的第三个版本称为SNMPv3，在RFC 1906[10]、RFC 2572[11]和RFC 2574[12]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Protocol operations for accessing management information. The first set of protocol operations and associated PDU formats is described in STD 15, RFC 1157 [8]. A second set of protocol operations and associated PDU formats is described in RFC 1905 [13].",
      "zh-CHS": "o 访问管理信息的协议操作。STD 15、RFC 1157[8]中描述了第一组协议操作和相关PDU格式。RFC 1905[13]中描述了第二组协议操作和相关PDU格式。"
    },
    {
      "indent": 3,
      "text": "o A set of fundamental applications described in RFC 2573 [14] and the view-based access control mechanism described in RFC 2575 [15].",
      "zh-CHS": "o RFC 2573[14]中描述的一组基本应用程序和RFC 2575[15]中描述的基于视图的访问控制机制。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. Objects in the MIB are defined using the mechanisms defined in the SMI.",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB中的对象是使用SMI中定义的机制定义的。"
    },
    {
      "indent": 3,
      "text": "This memo specifies a MIB module that is compliant to the SMIv2. A MIB conforming to the SMIv1 can be produced through the appropriate translations. The resulting translated MIB must be semantically equivalent, except where objects or events are omitted because no translation is possible (use of Counter64). Some machine readable information in SMIv2 will be converted into textual descriptions in SMIv1 during the translation process. However, this loss of machine readable information is not considered to change the semantics of the MIB.",
      "zh-CHS": "此备忘录指定了符合SMIv2的MIB模块。通过适当的翻译，可以生成符合SMIv1的MIB。生成的已翻译MIB必须在语义上等效，除非由于无法翻译而省略了对象或事件（使用计数器64）。在翻译过程中，SMIv2中的一些机器可读信息将转换为SMIv1中的文本描述。但是，这种机器可读信息的丢失不被认为会改变MIB的语义。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "zh-CHS": "3. 概述"
    },
    {
      "indent": 3,
      "text": "Instances of these object types represent attributes of an interface to an ethernet-like communications medium. At present, ethernet-like media are identified by the following values of the ifType object in the Interfaces MIB [25]:",
      "zh-CHS": "这些对象类型的实例表示类以太网通信介质接口的属性。目前，类以太网介质由接口MIB[25]中ifType对象的以下值标识："
    },
    {
      "indent": 12,
      "text": "ethernetCsmacd(6) iso88023Csmacd(7) starLan(11)",
      "zh-CHS": "ethernetCsmacd（6）iso88023Csmacd（7）starLan（11）"
    },
    {
      "indent": 3,
      "text": "The definitions presented here are based on Section 30, \"10 Mb/s, 100 Mb/s and 1000 Mb/s Management\", and Annex 30A, \"GDMO Specification for 802.3 managed object classes\" of IEEE Std. 802.3, 1998 Edition [16], as originally interpreted by Frank Kastenholz then of Interlan in [17]. Implementors of these MIB objects should note that IEEE Std. 802.3 [16] explicitly describes (in the form of Pascal pseudocode) when, where, and how various MAC attributes are measured. The IEEE document also describes the effects of MAC actions that may be invoked by manipulating instances of the MIB objects defined here.",
      "zh-CHS": "此处给出的定义基于IEEE标准802.3（1998年版）[16]第30节“10 Mb/s、100 Mb/s和1000 Mb/s管理”和附录30A“802.3受管对象类的GDMO规范”，最初由当时的因特拉公司的Frank Kastenholz在[17]中解释。这些MIB对象的实现者应该注意，IEEE标准802.3[16]明确描述了（以Pascal伪代码的形式）测量各种MAC属性的时间、地点和方式。IEEE文档还描述了MAC操作的效果，这些操作可通过操作此处定义的MIB对象实例来调用。"
    },
    {
      "indent": 3,
      "text": "To the extent that some of the attributes defined in [16] are represented by previously defined objects in MIB-2 [24] or in the Interfaces MIB [25], such attributes are not redundantly represented by objects defined in this memo. Among the attributes represented by objects defined in other memos are the number of octets transmitted or received on a particular interface, the number of frames transmitted or received on a particular interface, the promiscuous status of an interface, the MAC address of an interface, and multicast information associated with an interface.",
      "zh-CHS": "如果[16]中定义的某些属性由MIB-2[24]或接口MIB[25]中先前定义的对象表示，则此类属性不会由本备忘录中定义的对象冗余表示。其他备忘录中定义的对象表示的属性包括在特定接口上传输或接收的八位字节数、在特定接口上传输或接收的帧数、接口的混杂状态、接口的MAC地址以及与接口相关联的多播信息。"
    },
    {
      "indent": 0,
      "text": "3.1. Relation to MIB-2",
      "section_title": true,
      "zh-CHS": "3.1. 与MIB-2的关系"
    },
    {
      "indent": 3,
      "text": "This section applies only when this MIB is used in conjunction with the \"old\" (RFC 1213) [24] interface group.",
      "zh-CHS": "仅当此MIB与“旧”（RFC 1213）[24]接口组一起使用时，本节才适用。"
    },
    {
      "indent": 3,
      "text": "The relationship between an ethernet-like interface and an interface in the context of MIB-2 is one-to-one. As such, the value of an ifIndex object instance can be directly used to identify corresponding instances of the objects defined herein.",
      "zh-CHS": "类以太网接口与MIB-2上下文中的接口之间的关系是一对一的。因此，ifIndex对象实例的值可直接用于识别本文定义的对象的对应实例。"
    },
    {
      "indent": 3,
      "text": "For agents which implement the (now deprecated) ifSpecific object, an instance of that object that is associated with an ethernet-like interface has the OBJECT IDENTIFIER value:",
      "zh-CHS": "对于实现（现已弃用）ifSpecific对象的代理，与类以太网接口关联的该对象的实例具有对象标识符值："
    },
    {
      "indent": 9,
      "text": "dot3    OBJECT IDENTIFER ::= { transmission 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "3.2. Relation to the Interfaces MIB",
      "section_title": true,
      "zh-CHS": "3.2. 与接口MIB的关系"
    },
    {
      "indent": 3,
      "text": "The Interface MIB [25] requires that any MIB which is an adjunct of the Interface MIB clarify specific areas within the Interface MIB. These areas were intentionally left vague in the Interface MIB to avoid over constraining the MIB, thereby precluding management of certain media-types.",
      "zh-CHS": "接口MIB[25]要求作为接口MIB附属的任何MIB澄清接口MIB内的特定区域。这些区域在接口MIB中故意保持模糊，以避免过度约束MIB，从而排除对某些媒体类型的管理。"
    },
    {
      "indent": 3,
      "text": "Section 3.3 of [25] enumerates several areas which a media-specific MIB must clarify. Each of these areas is addressed in a following subsection. The implementor is referred to [25] in order to understand the general intent of these areas.",
      "zh-CHS": "[25]第3.3节列举了媒体特定MIB必须澄清的几个方面。以下小节将介绍这些领域中的每一个领域。为了理解这些领域的总体意图，请参考[25]。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Layering Model",
      "section_title": true,
      "zh-CHS": "3.2.1. 分层模型"
    },
    {
      "indent": 3,
      "text": "This MIB does not provide for layering. There are no sublayers.",
      "zh-CHS": "此MIB不提供分层。没有子层。"
    },
    {
      "indent": 3,
      "text": "EDITOR'S NOTE:",
      "zh-CHS": "编者按："
    },
    {
      "indent": 3,
      "text": "One could foresee the development of an 802.2 and enet-transceiver MIB. They could be higher and lower sublayers, respectively. All that THIS document should do is allude to the possibilities and urge the implementor to be aware of the possibility and that they may have requirements which supersede the requirements in this document.",
      "zh-CHS": "人们可以预见802.2和enet收发器MIB的发展。它们可以分别是较高和较低的亚层。本文件所要做的只是提及可能性，并敦促实施者意识到这种可能性，他们可能有取代本文件要求的要求。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Virtual Circuits",
      "section_title": true,
      "zh-CHS": "3.2.2. 虚拟电路"
    },
    {
      "indent": 3,
      "text": "This medium does not support virtual circuits and this area is not applicable to this MIB.",
      "zh-CHS": "此介质不支持虚拟电路，此区域不适用于此MIB。"
    },
    {
      "indent": 0,
      "text": "3.2.3. ifTestTable",
      "section_title": true,
      "zh-CHS": "3.2.3. IFtestable"
    },
    {
      "indent": 3,
      "text": "This MIB defines two tests for media which are instrumented with this MIB; TDR and Loopback. Implementation of these tests is not required. Many common interface chips do not support one or both of these tests.",
      "zh-CHS": "此MIB定义了使用此MIB检测的媒体的两个测试；TDR和环回。不需要执行这些测试。许多通用接口芯片不支持这两种测试中的一种或两种。"
    },
    {
      "indent": 3,
      "text": "These two tests are provided as a convenience, allowing a common method to invoke the test.",
      "zh-CHS": "提供这两个测试是为了方便起见，允许一个通用方法调用该测试。"
    },
    {
      "indent": 3,
      "text": "Standard MIBs do not include objects in which to return the results of the TDR test. Any needed objects MUST be provided in the vendor specific MIB.",
      "zh-CHS": "标准MIB不包括返回TDR测试结果的对象。必须在特定于供应商的MIB中提供所需的任何对象。"
    },
    {
      "indent": 3,
      "text": "Note that the ifTestTable is now deprecated. Work is underway to define a replacement MIB for system and interface testing. It is expected that the tests defined in this document will be usable in this replacement MIB.",
      "zh-CHS": "请注意，ifTestTable现在已弃用。为系统和接口测试定义替换MIB的工作正在进行中。预计本文档中定义的测试将可用于此替换MIB。"
    },
    {
      "indent": 0,
      "text": "3.2.4. ifRcvAddressTable",
      "section_title": true,
      "zh-CHS": "3.2.4. ifRcvAddressTable"
    },
    {
      "indent": 3,
      "text": "This table contains all IEEE 802.3 addresses, unicast, multicast, and broadcast, for which this interface will receive packets and forward them up to a higher layer entity for local consumption. The format of the address, contained in ifRcvAddressAddress, is the same as for ifPhysAddress.",
      "zh-CHS": "此表包含所有IEEE 802.3地址、单播、多播和广播，此接口将接收数据包并将其转发到更高层实体以供本地使用。ifRcvAddressAddress中包含的地址格式与ifPhysAddress的格式相同。"
    },
    {
      "indent": 3,
      "text": "In the event that the interface is part of a MAC bridge, this table does not include unicast addresses which are accepted for possible forwarding out some other port. This table is explicitly not intended to provide a bridge address filtering mechanism.",
      "zh-CHS": "如果接口是MAC网桥的一部分，此表不包括单播地址，这些地址可被接受用于转发其他端口。此表明确不是为了提供网桥地址过滤机制。"
    },
    {
      "indent": 0,
      "text": "3.2.5. ifPhysAddress",
      "section_title": true,
      "zh-CHS": "3.2.5. Iffhysaddress"
    },
    {
      "indent": 3,
      "text": "This object contains the IEEE 802.3 address which is placed in the source-address field of any Ethernet, Starlan, or IEEE 802.3 frames that originate at this interface. Usually this will be kept in ROM on the interface hardware. Some systems may set this address via software.",
      "zh-CHS": "此对象包含IEEE 802.3地址，该地址位于源自此接口的任何以太网、Starlan或IEEE 802.3帧的源地址字段中。通常这将保存在接口硬件上的ROM中。某些系统可能通过软件设置此地址。"
    },
    {
      "indent": 3,
      "text": "In a system where there are several such addresses the designer has a tougher choice. The address chosen should be the one most likely to be of use to network management (e.g. the address placed in ARP responses for systems which are primarily IP systems).",
      "zh-CHS": "在有多个这样的地址的系统中，设计者有一个更艰难的选择。选择的地址应该是最有可能用于网络管理的地址（例如，对于主要是IP系统的系统，ARP响应中的地址）。"
    },
    {
      "indent": 3,
      "text": "If the designer truly can not chose, use of the factory- provided ROM address is suggested.",
      "zh-CHS": "如果设计者确实无法选择，建议使用工厂提供的ROM地址。"
    },
    {
      "indent": 3,
      "text": "If the address can not be determined, an octet string of zero length should be returned.",
      "zh-CHS": "如果无法确定地址，则应返回长度为零的八位字节字符串。"
    },
    {
      "indent": 3,
      "text": "The address is stored in binary in this object. The address is stored in \"canonical\" bit order, that is, the Group Bit is positioned as the low-order bit of the first octet. Thus, the first byte of a multicast address would have the bit 0x01 set.",
      "zh-CHS": "地址以二进制形式存储在此对象中。地址以“规范”位顺序存储，即组位定位为第一个八位字节的低位。因此，多播地址的第一个字节将设置位0x01。"
    },
    {
      "indent": 0,
      "text": "3.2.6. ifType",
      "section_title": true,
      "zh-CHS": "3.2.6. ifType"
    },
    {
      "indent": 3,
      "text": "This MIB applies to interfaces which have any of the following ifType values:",
      "zh-CHS": "此MIB适用于具有以下任一ifType值的接口："
    },
    {
      "indent": 12,
      "text": "ethernetCsmacd(6) iso88023Csmacd(7) starLan(11)",
      "zh-CHS": "ethernetCsmacd（6）iso88023Csmacd（7）starLan（11）"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that all Ethernet-like interfaces use an ifType of ethernetCsmacd(6) regardless of the speed that the interface is running or the link-layer encapsulation in use. iso88023Csmacd(7) and starLan(11) are supported for backwards compatability.",
      "zh-CHS": "建议所有类似以太网的接口使用ethernetCsmacd（6）的ifType，无论接口的运行速度或使用的链路层封装如何。支持iso88023Csmacd（7）和starLan（11）以实现向后兼容性。"
    },
    {
      "indent": 3,
      "text": "There are three other interface types defined in the IANAifType-MIB for Ethernet. They are fastEther(62), fastEtherFX(69), and gigabitEthernet(117). This document takes the position that an Ethernet is an Ethernet, and Ethernet interfaces SHOULD always have the same value of ifType. Information on the particular flavor of Ethernet that an interface is running is available from ifSpeed in the Interfaces MIB, and ifMauType in the 802.3 MAU MIB. An Ethernet-like interface SHOULD NOT use the fastEther(62), fastEtherFX(69), or gigabitEthernet(117) ifTypes.",
      "zh-CHS": "IANAifType MIB中为以太网定义了三种其他接口类型。它们是FastEthernet（62）、FastEthernerFX（69）和千兆以太网（117）。本文档认为以太网就是以太网，以太网接口应始终具有相同的ifType值。接口正在运行的以太网的特定风格的信息可从接口MIB中的ifSpeed和802.3 MAU MIB中的ifMauType获得。类似以太网的接口不应使用FastEthernet（62）、FastEthernetFX（69）或千兆以太网（117）IFTYPE。"
    },
    {
      "indent": 3,
      "text": "Interfaces with any of the supported ifType values map to the EtherLike-MIB in the same manner. There are no implementation differences.",
      "zh-CHS": "具有任何支持的ifType值的接口都以相同的方式映射到类以太MIB。没有实现差异。"
    },
    {
      "indent": 0,
      "text": "3.2.7. Specific Interface MIB Objects",
      "section_title": true,
      "zh-CHS": "3.2.7. 特定接口MIB对象"
    },
    {
      "indent": 3,
      "text": "The following table provides specific implementation guidelines for applying the interface group objects to ethernet-like media.",
      "zh-CHS": "下表提供了将接口组对象应用于类似以太网的介质的具体实现指南。"
    },
    {
      "indent": 6,
      "text": "Object Guidelines",
      "zh-CHS": "对象指南"
    },
    {
      "indent": 6,
      "text": "ifIndex Each ethernet-like interface is represented by an ifEntry. The dot3StatsTable in this MIB module is indexed by dot3StatsIndex. The interface identified by a particular value of dot3StatsIndex is the same interface as identified by the same value of ifIndex.",
      "zh-CHS": "ifIndex每个类似以太网的接口由ifEntry表示。此MIB模块中的dot3StatsTable由dot3StatsIndex索引。由dot3StatsIndex的特定值标识的接口与由ifIndex的相同值标识的接口相同。"
    },
    {
      "indent": 6,
      "text": "ifDescr Refer to [25].",
      "zh-CHS": "如果需要，请参阅[25]。"
    },
    {
      "indent": 6,
      "text": "ifType Refer to section 3.2.6.",
      "zh-CHS": "如果类型相同，请参考第3.2.6节。"
    },
    {
      "indent": 6,
      "text": "ifMtu 1500 octets. NOTE: This is the MTU as seen by the MAC client. When a higher layer protocol, like IP, is running over Ethernet, this is the MTU that will be seen by that higher layer protocol. However, when using the IEEE 802.2 LLC protocol, higher layer protocols will see a different MTU. In particular, an LLC type 1 client protocol will see",
      "zh-CHS": "ifMtu 1500八位字节。注意：这是MAC客户端看到的MTU。当一个更高层的协议（如IP）在以太网上运行时，这就是该更高层协议将看到的MTU。然而，当使用IEEE 802.2 LLC协议时，高层协议将看到不同的MTU。特别是，LLC 1型客户端协议将看到"
    },
    {
      "indent": 33,
      "text": "an MTU of 1497 octets, and a protocol running over SNAP will see an MTU of 1492 octets.",
      "zh-CHS": "MTU为1497个八位字节，协议在SNAP上运行时，MTU为1492个八位字节。"
    },
    {
      "indent": 6,
      "text": "ifSpeed The current operational speed of the interface in bits per second. For current ethernet-like interfaces, this will be equal to 1,000,000 (1 million), 10,000,000 (10 million), 100,000,000 (100 million), or 1,000,000,000 (1 billion). If the interface implements auto-negotiation, auto-negotiation is enabled for this interface, and the interface has not yet negotiated to an operational speed, this object SHOULD reflect the maximum speed supported by the interface. Note that this object MUST NOT indicate a doubled value when operating in full-duplex mode. It MUST indicate the correct line speed regardless of the current duplex mode. The duplex mode of the interface may be determined by examining either the dot3StatsDuplexStatus object in this MIBmodule, or the ifMauType object in the 802.3 MAU MIB.",
      "zh-CHS": "ifSpeed接口的当前操作速度，单位为位/秒。对于当前类似以太网的接口，这将等于1000000（100万）、10000000（1000万）、100000000（1亿）或100000000（10亿）。如果接口实现自动协商，则此接口已启用自动协商，且接口尚未协商到操作速度，则此对象应反映接口支持的最大速度。请注意，在全双工模式下操作时，此对象不得指示加倍值。无论当前的双工模式如何，它都必须指示正确的线路速度。接口的双工模式可以通过检查此MIB模块中的dot3StatsDuplexStatus对象或802.3 MAU MIB中的ifMauType对象来确定。"
    },
    {
      "indent": 6,
      "text": "ifPhysAddress Refer to section 3.2.5.",
      "zh-CHS": "如果需要，请参考第3.2.5节。"
    },
    {
      "indent": 6,
      "text": "ifAdminStatus Write access is not required. Support for 'testing' is not required.",
      "zh-CHS": "不需要ifAdminStatus写访问权限。不需要支持“测试”。"
    },
    {
      "indent": 6,
      "text": "ifOperStatus The operational state of the interface. Support for 'testing' is not required. The value 'dormant' has no meaning for an ethernet-like interface.",
      "zh-CHS": "ifOperStatus接口的操作状态。不需要支持“测试”。“休眠”值对于类似以太网的接口没有意义。"
    },
    {
      "indent": 6,
      "text": "ifLastChange Refer to [25].",
      "zh-CHS": "如需更改，请参阅[25]。"
    },
    {
      "indent": 6,
      "text": "ifInOctets The number of octets in valid MAC frames received on this interface, including the MAC header and FCS. This does include the number of octets in valid MAC Control frames received on this interface.",
      "zh-CHS": "ifInOctets在该接口上接收的有效MAC帧中的八位字节数，包括MAC报头和FCS。这确实包括在该接口上接收的有效MAC控制帧中的八位字节数。"
    },
    {
      "indent": 6,
      "text": "ifInUcastPkts Refer to [25]. Note that this does not include MAC Control frames, since MAC Control frames are consumed by the interface layer and are not passed to any higher layer protocol.",
      "zh-CHS": "如需更多信息，请参阅[25]。注意，这不包括MAC控制帧，因为MAC控制帧由接口层消耗，并且不传递给任何更高层协议。"
    },
    {
      "indent": 6,
      "text": "ifInDiscards Refer to [25].",
      "zh-CHS": "如有指示，请参阅[25]。"
    },
    {
      "indent": 6,
      "text": "ifInErrors The sum for this interface of dot3StatsAlignmentErrors, dot3StatsFCSErrors, dot3StatsFrameTooLongs, dot3StatsInternalMacReceiveErrors and dot3StatsSymbolErrors.",
      "zh-CHS": "IFINERROR此接口的dot3StatsAlignmentErrors、dot3StatsFCSErrors、DOT3STATSFRAMETOLONGS、DOT3STATSINTERNALMACERRORS和dot3StatsSymbolErrors之和。"
    },
    {
      "indent": 6,
      "text": "ifInUnknownProtos Refer to [25].",
      "zh-CHS": "如果不知道，请参考[25]。"
    },
    {
      "indent": 6,
      "text": "ifOutOctets The number of octets transmitted in valid MAC frames on this interface, including the MAC header and FCS. This does include the number of octets in valid MAC Control frames transmitted on this interface.",
      "zh-CHS": "ifOutOctets：此接口上有效MAC帧中传输的八位字节数，包括MAC报头和FCS。这包括在该接口上传输的有效MAC控制帧中的八位字节数。"
    },
    {
      "indent": 6,
      "text": "ifOutUcastPkts Refer to [25]. Note that this does not include MAC Control frames, since MAC Control frames are generated by the interface layer, and are not passed from any higher layer protocol.",
      "zh-CHS": "如有疑问，请参阅[25]。注意，这不包括MAC控制帧，因为MAC控制帧由接口层生成，并且不从任何更高层协议传递。"
    },
    {
      "indent": 6,
      "text": "ifOutDiscards Refer to [25].",
      "zh-CHS": "ifOutDiscards参考[25]。"
    },
    {
      "indent": 6,
      "text": "ifOutErrors The sum for this interface of: dot3StatsSQETestErrors, dot3StatsLateCollisions, dot3StatsExcessiveCollisions, dot3StatsInternalMacTransmitErrors and dot3StatsCarrierSenseErrors.",
      "zh-CHS": "IoutErrors此接口的总和：Dot3StatsQetestErrors、dot3StatsLateCollisions、Dot3StatsAccessiveCollisions、Dot3StatsInternalActTransmitErrors和Dot3StatsCarriersensErrors。"
    },
    {
      "indent": 6,
      "text": "ifName Locally-significant textual name for the interface (e.g. lan0).",
      "zh-CHS": "ifName接口的本地有效文本名称（例如lan0）。"
    },
    {
      "indent": 6,
      "text": "ifInMulticastPkts Refer to [25]. Note that this does not include MAC Control frames, since MAC Control frames are consumed by the interface layer and are not passed to any higher layer protocol.",
      "zh-CHS": "如需更多信息，请参阅[25]。注意，这不包括MAC控制帧，因为MAC控制帧由接口层消耗，并且不传递给任何更高层协议。"
    },
    {
      "indent": 6,
      "text": "ifInBroadcastPkts Refer to [25]. Note that this does not include MAC Control frames, since MAC Control frames are generated by the interface layer, and are not passed from any higher layer protocol.",
      "zh-CHS": "IFINBROADCASTPKT请参阅[25]。注意，这不包括MAC控制帧，因为MAC控制帧由接口层生成，并且不从任何更高层协议传递。"
    },
    {
      "indent": 6,
      "text": "ifOutMulticastPkts Refer to [25]. Note that this does not include MAC Control frames, since MAC Control frames are consumed by the interface layer and are not passed to any higher layer protocol.",
      "zh-CHS": "IfoutMulticastPKT请参阅[25]。注意，这不包括MAC控制帧，因为MAC控制帧由接口层消耗，并且不传递给任何更高层协议。"
    },
    {
      "indent": 6,
      "text": "ifOutBroadcastPkts Refer to [25]. Note that this does not include MAC Control frames, since MAC Control frames are generated by the interface layer, and are not passed from any higher layer protocol.",
      "zh-CHS": "如果需要，请参阅[25]。注意，这不包括MAC控制帧，因为MAC控制帧由接口层生成，并且不从任何更高层协议传递。"
    },
    {
      "indent": 6,
      "text": "ifHCInOctets 64-bit versions of counters. Required ifHCOutOctets for ethernet-like interfaces that are capable of operating at 20Mbit/sec or faster, even if the interface is currently operating at less than 20Mbit/sec.",
      "zh-CHS": "ifHCInOctets计数器的64位版本。对于能够以20Mbit/sec或更快速度运行的以太网类接口，即使该接口当前的运行速度小于20Mbit/sec，也需要ifHCOutOctets。"
    },
    {
      "indent": 6,
      "text": "ifHCInUcastPkts 64-bit versions of packet counters. ifHCInMulticastPkts Required for ethernet-like interfaces ifHCInBroadcastPkts that are capable of operating at ifHCOutUcastPkts 640Mbit/sec or faster, even if the ifHCOutMulticastPkts interface is currently operating at ifHCOutBroadcastPkts less than 640Mbit/sec.",
      "zh-CHS": "ifHCInUcastPkts 64位版本的数据包计数器。类以太网接口ifHCInBroadcastPkts需要ifHCInMulticastPkts，能够以640Mbit/s或更快的速度运行，即使IFHCOUTPUTMulticastPKTS接口当前以低于640Mbit/s的速度运行。"
    },
    {
      "indent": 6,
      "text": "ifLinkUpDownTrapEnable Refer to [25]. Default is 'enabled'",
      "zh-CHS": "如果链接上下可删除，请参阅[25]。默认值为“已启用”"
    },
    {
      "indent": 6,
      "text": "ifHighSpeed The current operational speed of the interface in millions of bits per second. For current ethernet-like interfaces, this will be equal to 1, 10, 100, or 1,000. If the interface implements auto-negotiation, auto-negotiation is enabled for this interface, and the interface has not yet negotiated to an operational speed, this object SHOULD reflect the maximum speed supported by the interface. Note that this object MUST NOT indicate a doubled value when operating in full-duplex mode. It MUST indicate the",
      "zh-CHS": "ifHighSpeed接口的当前操作速度，单位为百万位/秒。对于当前类似以太网的接口，这将等于1、10、100或1000。如果接口实现自动协商，则此接口已启用自动协商，且接口尚未协商到操作速度，则此对象应反映接口支持的最大速度。请注意，在全双工模式下操作时，此对象不得指示加倍值。它必须指明"
    },
    {
      "indent": 33,
      "text": "correct line speed regardless of the current duplex mode. The duplex mode of the interface may be determined by examining either the dot3StatsDuplexStatus object in this MIB module, or the ifMauType object in the 802.3 MAU MIB.",
      "zh-CHS": "无论当前的双工模式如何，都要正确的线路速度。接口的双工模式可通过检查此MIB模块中的dot3StatsDuplexStatus对象或802.3 MAU MIB中的ifMauType对象来确定。"
    },
    {
      "indent": 6,
      "text": "ifPromiscuousMode Refer to [25].",
      "zh-CHS": "如果是混杂模式，请参阅[25]。"
    },
    {
      "indent": 6,
      "text": "ifConnectorPresent This will normally be 'true'.",
      "zh-CHS": "如果ConnectorPresent，则通常为“true”。"
    },
    {
      "indent": 6,
      "text": "ifAlias Refer to [25].",
      "zh-CHS": "如果需要，请参阅[25]。"
    },
    {
      "indent": 6,
      "text": "ifCounterDiscontinuityTime Refer to [25]. Note that a discontinuity in the Interface MIB counters may also indicate a discontinuity in some or all of the counters in this MIB that are associated with that interface.",
      "zh-CHS": "如果需要，请参阅[25]。请注意，接口MIB计数器中的不连续性也可能表示此MIB中与该接口关联的部分或所有计数器中的不连续性。"
    },
    {
      "indent": 6,
      "text": "ifStackHigherLayer Refer to section 3.2.1. ifStackLowerLayer ifStackStatus",
      "zh-CHS": "如果是StackHigherLayer，请参考第3.2.1节。ifStackLowerLayer ifStackStatus"
    },
    {
      "indent": 6,
      "text": "ifRcvAddressAddress Refer to section 3.2.4. ifRcvAddressStatus ifRcvAddressType",
      "zh-CHS": "ifRcvAddressAddress参考第3.2.4节。IFRCVAddress状态IFRCVAddress类型"
    },
    {
      "indent": 0,
      "text": "3.3. Relation to the 802.3 MAU MIB",
      "section_title": true,
      "zh-CHS": "3.3. 与802.3 MAU MIB的关系"
    },
    {
      "indent": 3,
      "text": "Support for the mauModIfCompl2 compliance statement of the MAU-MIB [27] is REQUIRED for Ethernet-like interfaces. This MIB is needed in order to allow applications to determine the current MAU type in use by the interface, and to control autonegotiation and duplex mode for the interface. Implementing this MIB module without implementing the MAU-MIB would leave applications with no standard way to determine the media type in use, and no standard way to control the duplex mode of the interface.",
      "zh-CHS": "类以太网接口需要支持MAU-MIB[27]的mauModIfCompl2合规性声明。需要此MIB以允许应用程序确定接口使用的当前MAU类型，并控制接口的自动协商和双工模式。在不实现MAU-MIB的情况下实现此MIB模块将使应用程序无法确定使用的介质类型，也无法控制接口的双工模式。"
    },
    {
      "indent": 0,
      "text": "3.4. dot3StatsEtherChipSet",
      "section_title": true,
      "zh-CHS": "3.4. DOT3StateSether芯片组"
    },
    {
      "indent": 3,
      "text": "This document defines an object called dot3StatsEtherChipSet, which is used to identify the MAC hardware used to communicate on an interface. Previous versions of this document contained a number of OID assignments for some existing Ethernet chipsets. Maintaining",
      "zh-CHS": "本文档定义了一个名为dot3StateSetherChipset的对象，用于标识用于在接口上通信的MAC硬件。本文档的早期版本包含一些现有以太网芯片组的OID分配。维护"
    },
    {
      "indent": 3,
      "text": "that list as part of this document has proven to be problematic, so the OID assignments contained in prevous versions of this document have now been moved to a separate document [28].",
      "zh-CHS": "该列表作为本文件的一部分已被证明是有问题的，因此本文件先前版本中包含的OID分配现在已移至单独的文件[28]。"
    },
    {
      "indent": 3,
      "text": "The dot3StatsEtherChipSet object has now been deprecated. Implementation feedback indicates that this object is much more useful in theory than in practice. The object's utility in debugging network problems in the field appears to be limited. In those cases where it may be useful, it is not sufficient, since it identifies only the MAC chip, and not the PHY, PMD, or driver. The administrative overhead involved in maintaining a central registry of chipset OIDs cannot be justified for an object whose usefulness is questionable at best.",
      "zh-CHS": "Dot3StateSetherChipset对象现已被弃用。实现反馈表明，该对象在理论上比在实践中更有用。该对象在现场调试网络问题方面的效用似乎有限。在可能有用的情况下，这是不够的，因为它只识别MAC芯片，而不识别PHY、PMD或驱动程序。维护芯片组OID的中央注册表所涉及的管理开销对于一个用途最多也值得怀疑的对象来说是不合理的。"
    },
    {
      "indent": 3,
      "text": "Implementations which continue to support this object for the purpose of backwards compatability may continue to use the values defined in [28]. For chipsets not listed in [28], implementors should assign OBJECT IDENTIFIERS within that part of the registration tree delegated to individual enterprises.",
      "zh-CHS": "为了向后兼容而继续支持该对象的实现可以继续使用[28]中定义的值。对于[28]中未列出的芯片组，实施者应在委托给单个企业的注册树部分内分配对象标识符。"
    },
    {
      "indent": 0,
      "text": "3.5. Mapping of IEEE 802.3 Managed Objects",
      "section_title": true,
      "zh-CHS": "3.5. IEEE 802.3托管对象的映射"
    },
    {
      "indent": 3,
      "text": "IEEE 802.3 Managed Object Corresponding SNMP Object",
      "zh-CHS": "IEEE 802.3管理对象对应的SNMP对象"
    },
    {
      "indent": 3,
      "text": "oMacEntity\n .aMACID                          dot3StatsIndex or\n                                  IF-MIB - ifIndex\n .aFramesTransmittedOK            IF-MIB - ifOutUCastPkts +\n                                           ifOutMulticastPkts +\n                                           ifOutBroadcastPkts*\n .aSingleCollisionFrames          dot3StatsSingleCollisionFrames\n .aMultipleCollisionFrames        dot3StatsMultipleCollisionFrames\n .aFramesReceivedOK               IF-MIB - ifInUcastPkts +\n                                           ifInMulticastPkts +\n                                           ifInBroadcastPkts*\n .aFrameCheckSequenceErrors       dot3StatsFCSErrors\n .aAlignmentErrors                dot3StatsAlignmentErrors\n .aOctetsTransmittedOK            IF-MIB - ifOutOctets*\n .aFramesWithDeferredXmissions    dot3StatsDeferredTransmissions\n .aLateCollisions                 dot3StatsLateCollisions\n .aFramesAbortedDueToXSColls      dot3StatsExcessiveCollisions\n .aFramesLostDueToIntMACXmitError dot3StatsInternalMacTransmitErrors\n .aCarrierSenseErrors             dot3StatsCarrierSenseErrors\n .aOctetsReceivedOK               IF-MIB - ifInOctets*\n .aFramesLostDueToIntMACRcvError  dot3StatsInternalMacReceiveErrors\n .aPromiscuousStatus              IF-MIB - ifPromiscuousMode\n .aReadMulticastAddressList       IF-MIB - ifRcvAddressTable\n .aMulticastFramesXmittedOK       IF-MIB - ifOutMulticastPkts*",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": ".aBroadcastFramesXmittedOK       IF-MIB - ifOutBroadcastPkts*\n.aMulticastFramesReceivedOK      IF-MIB - ifInMulticastPkts*\n.aBroadcastFramesReceivedOK      IF-MIB - ifInBroadcastPkts*\n.aFrameTooLongErrors             dot3StatsFrameTooLongs\n.aReadWriteMACAddress            IF-MIB - ifPhysAddress\n.aCollisionFrames                dot3CollFrequencies\n.aDuplexStatus                   dot3StatsDuplexStatus\n.acAddGroupAddress               IF-MIB - ifRcvAddressTable\n.acDeleteGroupAddress            IF-MIB - ifRcvAddressTable\n.acExecuteSelfTest               dot3TestLoopBack",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "oPHYEntity .aPHYID dot3StatsIndex or IF-MIB - ifIndex .aSQETestErrors dot3StatsSQETestErrors .aSymbolErrorDuringCarrier dot3StatsSymbolErrors",
      "zh-CHS": "oPHYEntity.aPHYID dot3StatsIndex或IF-MIB-ifIndex.aSQETestErrors dot3StatsSQETestErrors.asymbolerrorringcarrier dot3statsssymbolerrors"
    },
    {
      "indent": 3,
      "text": "oMACControlEntity .aMACControlID dot3StatsIndex or IF-MIB - ifIndex .aMACControlFunctionsSupported dot3ControlFunctionsSupported and dot3ControlFunctionsEnabled .aUnsupportedOpcodesReceived dot3ControlInUnknownOpcodes",
      "zh-CHS": "oMACControlEntity.aMACControlID dot3StatsIndex或IF-MIB-ifIndex.AmacControlFunctions支持的Dot3ControlFunctions支持和Dot3ControlFunctions启用。AunSupportedOpCodes接收的dot3ControlInUnknownOpcodes"
    },
    {
      "indent": 3,
      "text": "oPAUSEEntity .aPAUSEMACCtrlFramesTransmitted dot3OutPauseFrames .aPAUSEMACCtrlFramesReceived dot3InPauseFrames",
      "zh-CHS": "oPAUSEEntity.aPAUSEMACCtrlFramesTransmitted Dot3OutpuseFrames.ApauseMacCtrlFramesReceivedDot3InpuseFrames"
    },
    {
      "indent": 3,
      "text": "* Note that the octet counters in IF-MIB do not exactly match the definition of the octet counters in IEEE 802.3. aOctetsTransmittedOK and aOctetsReceivedOK count only the octets in the clientData and Pad fields, whereas ifInOctets and ifOutOctets include the entire MAC frame, including MAC header and FCS. However, the IF-MIB counters can be derived from the IEEE 802.3 counters as follows:",
      "zh-CHS": "* 请注意，IF-MIB中的八位计数器与IEEE 802.3中八位计数器的定义不完全匹配。AOCTETSTRASTIMETEDOK和aOctetsReceivedOK仅统计clientData和Pad字段中的八位字节，而ifInOctets和IFOUTPoctets包括整个MAC帧，包括MAC标头和FCS。但是，IF-MIB计数器可以从IEEE 802.3计数器派生，如下所示："
    },
    {
      "indent": 5,
      "text": "ifInOctets = aOctetsReceivedOK + (18 * aFramesReceivedOK)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "ifOutOctets = aOctetsTransmittedOK + (18 * aFramesTransmittedOK)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Also note that the packet counters in the IF-MIB do not exactly match the definition of the frame counters in IEEE 802.3. aFramesTransmittedOK counts the number of frames successfully transmitted on the interface, whereas ifOutUcastPkts, ifOutMulticastPkts and ifOutBroadcastPkts count the number of transmit requests made from a higher layer, whether or not the transmit attempt was successful. This means that packets counted by ifOutErrors or ifOutDiscards are also be counted by ifOut*castPkts, but are not be counted by aFramesTransmittedOK. This also means",
      "zh-CHS": "还要注意，IF-MIB中的数据包计数器与IEEE 802.3中的帧计数器定义不完全匹配。AFRAMESTRANSMITETEDOK统计接口上成功传输的帧数，而ifOutUcastPkts、IFOUTSMulticastPKTS和IFOUTSBroadcastPKTS统计从更高层发出的传输请求数，无论传输尝试是否成功。这意味着由ifouterror或ifOutDiscards计数的数据包也由ifOut*castPkts计数，但不由aFramesTransmittedOK计数。这也意味着"
    },
    {
      "indent": 3,
      "text": "that, since MAC Control frames are generated by a sublayer internal to the interface layer rather than by a higher layer, they are not counted by ifOut*castPkts, but are counted by aFramesTransmittedOK.",
      "zh-CHS": "也就是说，由于MAC控制帧是由接口层内部的子层而不是更高的层生成的，因此它们不由ifOut*castPkts计数，而是由aFramesTransmittedOK计数。"
    },
    {
      "indent": 3,
      "text": "Similarly, aFramesReceivedOK counts the number of frames received successfully by the interface, whether or not they are passed to a higher layer, whereas ifInUcastPkts, ifInMulticastPkts and ifInBroadcastPkts count only the number of packets passed to a higher layer. This means that packets counted by ifInDiscards or ifInUnknownProtos are also counted by aFramesReceivedOK, but are not counted by ifIn*castPkts. This also menas that, since MAC Control frames are consumed by a sublayer internal to the interface layer and not passed to a higher layer, they are not counted by ifIn*castPkts, but are counted by aFramesReceivedOK.",
      "zh-CHS": "类似地，aFramesReceivedOK统计接口成功接收的帧数，无论它们是否传递到更高层，而ifInUcastPkts、ifInMulticastPkts和ifInBroadcastPkts仅统计传递到更高层的数据包数。这意味着由ifInDiscards或ifInUnknownProtos计数的数据包也由aFramesReceivedOK计数，但不由ifIn*castPkts计数。这还意味着，由于MAC控制帧由接口层内部的子层使用，并且没有传递到更高的层，因此它们不由ifIn*castPkts计数，而是由aFramesReceivedOK计数。"
    },
    {
      "indent": 3,
      "text": "Another difference to keep in mind between the IF-MIB counters and IEEE 802.3 counters is that in the IEEE 802.3 document, the frame counters and octet counters are always incremented together. aOctetsTransmittedOK counts the number of octets in frames that were counted by aFramesTransmittedOK. aOctetsReceivedOK counts the number of octets in frames that were counted by aFramesReceivedOK. This is not the case with the IF-MIB counters. The IF-MIB octet counters count the number of octets sent to or received from the layer below this interface, whereas the packet counters count the number of packets sent to or received from the layer above. Therefore, received MAC Control frames, ifInDiscards, and ifInUnknownProtos are counted by ifInOctets, but not ifIn*castPkts. Transmitted MAC Control frames are counted by ifOutOctets, but not ifOut*castPkts. ifOutDiscards and ifOutErrors are counted by ifOut*castPkts, but not ifOutOctets.",
      "zh-CHS": "要记住的另一个区别是IF-MIB计数器和IEEE 802.3计数器之间的区别是，在IEEE 802.3文档中，帧计数器和八位字节计数器总是一起递增。AOCTETSTRANSMITETDOK统计由AFRAMESTRANSMITETDOK统计的帧中的八位字节数。aOctetsReceivedOK统计由aFramesReceivedOK统计的帧中的八位字节数。IF-MIB计数器的情况并非如此。IF-MIB八位字节计数器统计发送到该接口下面的层或从该接口下面的层接收到的八位字节数，而数据包计数器统计发送到上面的层或从上面的层接收到的数据包数。因此，接收到的MAC控制帧、IFindiscard和IFinKnownProtos由ifInOctets计数，而不是ifIn*castPkts计数。传输的MAC控制帧按ifOutOctets计数，但不按ifOut*castPkts计数。ifOutDiscards和ifOutErrors由ifOut*castPkts计数，但不由ifOutOctets计数。"
    },
    {
      "indent": 3,
      "text": "The following IEEE 802.3 managed objects have been removed from this MIB module as a result of implementation feedback:",
      "zh-CHS": "由于实施反馈，以下IEEE 802.3受管对象已从此MIB模块中删除："
    },
    {
      "indent": 3,
      "text": "oMacEntity .aFramesWithExcessiveDeferral .aInRangeLengthErrors .aOutOfRangeLengthField .aMACEnableStatus .aTransmitEnableStatus .aMulticastReceiveStatus .acInitializeMAC",
      "zh-CHS": "oMacEntity.aFrameswithExcessedeferal.AinRange Lengthers.aAuto-FrangelLengthField.aMACEnableStatus.aTransmitEnableStatus.aMulticastReceiveStatus.aInitializeMac"
    },
    {
      "indent": 3,
      "text": "Please see [19] for the detailed reasoning on why these objects were removed.",
      "zh-CHS": "有关移除这些对象的详细原因，请参见[19]。"
    },
    {
      "indent": 3,
      "text": "In addition, the following IEEE 802.3 managed objects have not been included in this MIB for the following reasons.",
      "zh-CHS": "此外，由于以下原因，此MIB中未包含以下IEEE 802.3受管对象。"
    },
    {
      "indent": 3,
      "text": "IEEE 802.3 Managed Object Disposition",
      "zh-CHS": "IEEE 802.3受管对象配置"
    },
    {
      "indent": 3,
      "text": "oMACEntity .aMACCapabilities Can be derived from MAU-MIB - ifMauTypeListBits",
      "zh-CHS": "omaccentity.aMACCapabilities可以从MAU-MIB-ifMauTypeListBits派生"
    },
    {
      "indent": 3,
      "text": "oPHYEntity .aPhyType Can be derived from MAU-MIB - ifMauType",
      "zh-CHS": "隐晶质。隐晶质可以从MAU-MIB-ifMauType派生"
    },
    {
      "indent": 4,
      "text": ".aPhyTypeList Can be derived from MAU-MIB - ifMauTypeListBits",
      "zh-CHS": ".aPhyTypeList可以从MAU-MIB-ifMauTypeListBits派生"
    },
    {
      "indent": 4,
      "text": ".aMIIDetect Not considered useful.",
      "zh-CHS": ".aMIIDetect不被认为是有用的。"
    },
    {
      "indent": 4,
      "text": ".aPhyAdminState Can already obtain interface state from IF-MIB - ifOperStatus and MAU state from MAU-MIB - ifMauStatus. Providing an additional state for the PHY was not considered useful.",
      "zh-CHS": ".aPhyAdminState已经可以从IF-MIB-ifOperStatus获取接口状态，从MAU-MIB-ifMauStatus获取MAU状态。为PHY提供附加状态被认为是无用的。"
    },
    {
      "indent": 4,
      "text": ".acPhyAdminControl Can already control interface state from IF-MIB - ifAdminStatus and MAU state from MAU-MIB - ifMauStatus. Providing separate admin control of the PHY was not considered useful.",
      "zh-CHS": ".acPhyAdminControl已经可以从IF-MIB-ifAdminStatus控制接口状态，从MAU-MIB-ifMauStatus控制MAU状态。对PHY提供单独的管理控制被认为是无用的。"
    },
    {
      "indent": 3,
      "text": "oMACControlEntity .aMACControlFramesTransmitted Can be determined by summing the OutFrames counters for the individual control functions",
      "zh-CHS": "oMACControlEntity.aMACControlFramesTransmitted可以通过对各个控制函数的OutFrame计数器求和来确定"
    },
    {
      "indent": 4,
      "text": ".aMACControlFramesReceived Can be determined by summing the InFrames counters for the individual control functions",
      "zh-CHS": ".A接收到的AccontrolFrames可通过对各个控制功能的InFrames计数器求和来确定"
    },
    {
      "indent": 3,
      "text": "oPAUSEEntity .aPAUSELinkDelayAllowance Not considered useful.",
      "zh-CHS": "ApauseEntity.ApauseLinkDelayAllowment被认为是无用的。"
    },
    {
      "indent": 0,
      "text": "4. Definitions",
      "section_title": true,
      "zh-CHS": "4. 定义"
    },
    {
      "indent": 3,
      "text": "EtherLike-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, OBJECT-IDENTITY, Counter32, mib-2, transmission FROM SNMPv2-SMI MODULE-COMPLIANCE, OBJECT-GROUP FROM SNMPv2-CONF ifIndex, InterfaceIndex FROM IF-MIB;",
      "zh-CHS": "导入模块标识、对象类型、对象标识、计数器32、mib-2、来自SNMPv2 SMI模块的传输、来自SNMPv2 CONF ifIndex的对象组、来自IF-mib的接口索引；"
    },
    {
      "indent": 7,
      "text": "etherMIB MODULE-IDENTITY LAST-UPDATED \"9908240400Z\" -- August 24, 1999 ORGANIZATION \"IETF Ethernet Interfaces and Hub MIB Working Group\" CONTACT-INFO \"WG E-mail: hubmib@hprnd.rose.hp.com To subscribe: hubmib-request@hprnd.rose.hp.com",
      "zh-CHS": "etherMIB模块标识最后更新的“9908240400Z”-1999年8月24日组织“IETF以太网接口和集线器MIB工作组”联系信息工作组电子邮件：hubmib@hprnd.rose.hp.com订阅：hubmib-request@hprnd.rose.hp.com"
    },
    {
      "indent": 19,
      "text": " Chair: Dan Romascanu Postal: Lucent Technologies Atidum Technology Park, Bldg. 3 Tel Aviv 61131 Israel Tel: +972 3 645 8414 E-mail: dromasca@lucent.com",
      "zh-CHS": "主席：Dan Romascanu邮政：朗讯科技阿蒂杜姆科技园特拉维夫3号楼61131以色列电话：+972 3 645 8414电子邮件：dromasca@lucent.com"
    },
    {
      "indent": 18,
      "text": "Editor: John Flick Postal: Hewlett-Packard Company 8000 Foothills Blvd. M/S 5557 Roseville, CA 95747-5557 USA Tel: +1 916 785 4018 Fax: +1 916 785 1199 E-mail: johnf@rose.hp.com",
      "zh-CHS": "编辑：约翰·弗利克邮政：惠普公司8000山麓大道。M/S 5557加利福尼亚州罗斯维尔95747-5557美国电话：+1 916 785 4018传真：+1 916 785 1199电子邮件：johnf@rose.hp.com"
    },
    {
      "indent": 18,
      "text": "Editor: Jeffrey Johnson Postal: RedBack Networks 2570 North First Street, Suite 410 San Jose, CA, 95131 USA Tel: +1 408 571 2699 Fax: +1 408 571 2698 E-Mail: jeff@redbacknetworks.com\"",
      "zh-CHS": "编辑：Jeffrey Johnson Postal:RedBack Networks 2570 North First Street，410 Suite，San Jose，CA，95131美国电话：+1 408 571 2699传真：+1 408 571 2698电子邮件：jeff@redbacknetworks.com\""
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"The MIB module to describe generic objects for",
      "zh-CHS": "DESCRIPTION“用于描述通用对象的MIB模块"
    },
    {
      "indent": 23,
      "text": "Ethernet-like network interfaces.",
      "zh-CHS": "类似以太网的网络接口。"
    },
    {
      "indent": 23,
      "text": "The following reference is used throughout this MIB module:",
      "zh-CHS": "在整个MIB模块中使用以下参考："
    },
    {
      "indent": 23,
      "text": "[IEEE 802.3 Std] refers to: IEEE Std 802.3, 1998 Edition: 'Information technology - Telecommunications and information exchange between systems - Local and metropolitan area networks - Specific requirements - Part 3: Carrier sense multiple access with collision detection (CSMA/CD) access method and physical layer specifications', September 1998.",
      "zh-CHS": "[IEEE 802.3标准]参考：IEEE标准802.3，1998年版：“信息技术-系统间电信和信息交换-局域网和城域网-特定要求-第3部分：带冲突检测的载波侦听多址（CSMA/CD）接入方法和物理层规范”，1998年9月。"
    },
    {
      "indent": 23,
      "text": "Of particular interest is Clause 30, '10Mb/s, 100Mb/s and 1000Mb/s Management'.\"",
      "zh-CHS": "特别令人感兴趣的是第30条，“10Mb/s、100Mb/s和1000Mb/s管理”"
    },
    {
      "indent": 11,
      "text": "REVISION \"9908240400Z\" -- August 24, 1999 DESCRIPTION \"Updated to include support for 1000 Mb/sec interfaces and full-duplex interfaces. This version published as RFC 2665.\"",
      "zh-CHS": "修订版“9908240400Z”-1999年8月24日描述“已更新，包括对1000 Mb/s接口和全双工接口的支持。此版本发布为RFC 2665。”"
    },
    {
      "indent": 11,
      "text": "REVISION \"9806032150Z\" DESCRIPTION \"Updated to include support for 100 Mb/sec interfaces. This version published as RFC 2358.\"",
      "zh-CHS": "修订版“9806032150Z”说明“已更新，包括对100 Mb/秒接口的支持。此版本发布为RFC 2358。”"
    },
    {
      "indent": 11,
      "text": "REVISION \"9402030400Z\" DESCRIPTION \"Initial version, published as RFC 1650.\"",
      "zh-CHS": "修订版“940203400Z”说明“初始版本，发布为RFC 1650。”"
    },
    {
      "indent": 11,
      "text": "::= { mib-2 35 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherMIBObjects OBJECT IDENTIFIER ::= { etherMIB 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3    OBJECT IDENTIFIER ::= { transmission 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- the Ethernet-like Statistics group",
      "zh-CHS": "--类以太网统计组"
    },
    {
      "indent": 7,
      "text": "dot3StatsTable OBJECT-TYPE SYNTAX SEQUENCE OF Dot3StatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Statistics for a collection of ethernet-like interfaces attached to a particular system. There will be one row in this table for each",
      "zh-CHS": "dot3StatsTable Dot3StatsEntry MAX-ACCESS的对象类型语法序列不可访问状态当前描述“连接到特定系统的类以太网接口集合的统计信息。此表中每个接口将有一行"
    },
    {
      "indent": 11,
      "text": "            ethernet-like interface in the system.\"\n::= { dot3 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsEntry OBJECT-TYPE\n    SYNTAX     Dot3StatsEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION \"Statistics for a particular interface to an\n                ethernet-like medium.\"\n    INDEX       { dot3StatsIndex }\n    ::= { dot3StatsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Dot3StatsEntry ::=\n    SEQUENCE {\n        dot3StatsIndex                      InterfaceIndex,\n        dot3StatsAlignmentErrors            Counter32,\n        dot3StatsFCSErrors                  Counter32,\n        dot3StatsSingleCollisionFrames      Counter32,\n        dot3StatsMultipleCollisionFrames    Counter32,\n        dot3StatsSQETestErrors              Counter32,\n        dot3StatsDeferredTransmissions      Counter32,\n        dot3StatsLateCollisions             Counter32,\n        dot3StatsExcessiveCollisions        Counter32,\n        dot3StatsInternalMacTransmitErrors  Counter32,\n        dot3StatsCarrierSenseErrors         Counter32,\n        dot3StatsFrameTooLongs              Counter32,\n        dot3StatsInternalMacReceiveErrors   Counter32,\n        dot3StatsEtherChipSet               OBJECT IDENTIFIER,\n        dot3StatsSymbolErrors               Counter32,\n        dot3StatsDuplexStatus               INTEGER\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsIndex OBJECT-TYPE\n    SYNTAX      InterfaceIndex\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION \"An index value that uniquely identifies an\n                interface to an ethernet-like medium.  The\n                interface identified by a particular value of\n                this index is the same interface as identified\n                by the same value of ifIndex.\"\n    REFERENCE   \"RFC 2233, ifIndex\"\n    ::= { dot3StatsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsAlignmentErrors OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current",
      "zh-CHS": "dot3StatsAlignmentErrors对象类型语法计数器32 MAX-ACCESS只读状态当前"
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"A count of frames received on a particular interface that are not an integral number of octets in length and do not pass the FCS check.",
      "zh-CHS": "描述“特定接口上接收的帧计数，其长度不是八位字节的整数，且未通过FCS检查。"
    },
    {
      "indent": 23,
      "text": "The count represented by an instance of this object is incremented when the alignmentError status is returned by the MAC service to the LLC (or other MAC user). Received frames for which multiple error conditions obtain are, according to the conventions of IEEE 802.3 Layer Management, counted exclusively according to the error status presented to the LLC.",
      "zh-CHS": "当MAC服务将alignmentError状态返回给LLC（或其他MAC用户）时，此对象实例表示的计数将增加。根据IEEE 802.3层管理的约定，获得多个错误条件的接收帧仅根据呈现给LLC的错误状态进行计数。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment for 8-bit wide group encoding schemes.",
      "zh-CHS": "对于8位宽组编码方案，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.7,\n            aAlignmentErrors\"\n::= { dot3StatsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsFCSErrors OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of frames received on a particular interface that are an integral number of octets in length but do not pass the FCS check. This count does not include frames received with frame-too-long or frame-too-short error.",
      "zh-CHS": "dot3StatsFCSErrors对象类型语法计数器32 MAX-ACCESS只读状态当前描述“在特定接口上接收的帧计数，其长度为八位字节的整数，但未通过FCS检查。此计数不包括接收到的帧过长或帧过短错误。"
    },
    {
      "indent": 23,
      "text": "The count represented by an instance of this object is incremented when the frameCheckError status is returned by the MAC service to the LLC (or other MAC user). Received frames for which multiple error conditions obtain are, according to the conventions of IEEE 802.3 Layer Management, counted exclusively according to the error status presented to the LLC.",
      "zh-CHS": "当MAC服务向LLC（或其他MAC用户）返回frameCheckError状态时，此对象实例表示的计数将增加。根据IEEE 802.3层管理的约定，获得多个错误条件的接收帧仅根据呈现给LLC的错误状态进行计数。"
    },
    {
      "indent": 23,
      "text": "Note: Coding errors detected by the physical layer for speeds above 10 Mb/s will cause the frame to fail the FCS check. Discontinuities in the value of this counter can occur at re-initialization of the management",
      "zh-CHS": "注：当速度超过10 Mb/s时，物理层检测到的编码错误将导致帧无法通过FCS检查。重新初始化管理时，此计数器的值可能会出现不连续"
    },
    {
      "indent": 11,
      "text": "            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.6,\n            aFrameCheckSequenceErrors.\"\n::= { dot3StatsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsSingleCollisionFrames OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of successfully transmitted frames on a particular interface for which transmission is inhibited by exactly one collision.",
      "zh-CHS": "dot3StatsSingleCollisionFrames对象类型语法计数器32 MAX-ACCESS只读状态当前描述“特定接口上成功传输的帧计数，对于该接口，传输仅被一次冲突禁止。"
    },
    {
      "indent": 23,
      "text": "A frame that is counted by an instance of this object is also counted by the corresponding instance of either the ifOutUcastPkts, ifOutMulticastPkts, or ifOutBroadcastPkts, and is not counted by the corresponding instance of the dot3StatsMultipleCollisionFrames object.",
      "zh-CHS": "由此对象的实例计数的帧也由ifOutUcastPkts、IFOUTPMulticastPKTS或IFOUTProadcastPKTS的相应实例计数，而不由dot3StatsMultipleCollisionFrames对象的相应实例计数。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment when the interface is operating in full-duplex mode.",
      "zh-CHS": "当接口在全双工模式下运行时，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.3,\n            aSingleCollisionFrames.\"\n::= { dot3StatsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsMultipleCollisionFrames OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of successfully transmitted frames on a particular interface for which transmission is inhibited by more than one collision.",
      "zh-CHS": "dot3StatsMultipleCollisionFrames对象类型语法计数器32 MAX-ACCESS只读状态当前描述“在一个特定接口上成功传输的帧计数，对于该接口，传输被多个冲突禁止。"
    },
    {
      "indent": 23,
      "text": "A frame that is counted by an instance of this object is also counted by the corresponding instance of either the ifOutUcastPkts, ifOutMulticastPkts, or ifOutBroadcastPkts, and is not counted by the corresponding instance of the dot3StatsSingleCollisionFrames object.",
      "zh-CHS": "由此对象的实例计数的帧也由ifOutUcastPkts、IFOUTPMulticastPKTS或IFOUTProadcastPKTS的相应实例计数，而不由dot3StatsSingleCollisionFrames对象的相应实例计数。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment when the interface is operating in full-duplex mode.",
      "zh-CHS": "当接口在全双工模式下运行时，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.4,\n            aMultipleCollisionFrames.\"\n::= { dot3StatsEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsSQETestErrors OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of times that the SQE TEST ERROR message is generated by the PLS sublayer for a particular interface. The SQE TEST ERROR is set in accordance with the rules for verification of the SQE detection mechanism in the PLS Carrier Sense Function as described in IEEE Std. 802.3, 1998 Edition, section 7.2.4.6.",
      "zh-CHS": "DOT3StatssQETESERRORS对象类型语法计数器32 MAX-ACCESS只读状态当前说明“PLS子层为特定接口生成SQE测试错误消息的次数。根据IEEE标准802.3，1998版，第7.2.4.6节中描述的PLS载波检测功能中SQE检测机制验证规则设置SQE测试错误。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment on interfaces operating at speeds greater than 10 Mb/s, or on interfaces operating in full-duplex mode.",
      "zh-CHS": "在速度大于10 Mb/s的接口上，或在全双工模式下的接口上，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 7.2.4.6, also 30.3.2.1.4,\n            aSQETestErrors.\"\n::= { dot3StatsEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsDeferredTransmissions OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of frames for which the first transmission attempt on a particular interface is delayed because the medium is busy. The count represented by an instance of this object does not include frames involved in collisions.",
      "zh-CHS": "dot3StatsDeferredTransmissions对象类型语法计数器32 MAX-ACCESS只读状态当前描述“由于介质忙，特定接口上的第一次传输尝试延迟的帧计数。此对象实例表示的计数不包括冲突中涉及的帧。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment when the interface is operating in full-duplex mode.",
      "zh-CHS": "当接口在全双工模式下运行时，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.9,\n            aFramesWithDeferredXmissions.\"\n::= { dot3StatsEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsLateCollisions OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of times that a collision is detected on a particular interface later than one slotTime into the transmission of a packet.",
      "zh-CHS": "dot3StatsLateCollisions对象类型语法计数器32 MAX-ACCESS只读状态当前描述“在数据包传输的一个时隙之后，在特定接口上检测到冲突的次数。"
    },
    {
      "indent": 23,
      "text": "A (late) collision included in a count represented by an instance of this object is also considered as a (generic) collision for purposes of other collision-related statistics.",
      "zh-CHS": "包含在此对象实例表示的计数中的（延迟）冲突也被视为（通用）冲突，以用于其他与冲突相关的统计。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment when the interface is operating in full-duplex mode.",
      "zh-CHS": "当接口在全双工模式下运行时，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.10,\n            aLateCollisions.\"\n::= { dot3StatsEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsExcessiveCollisions OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of frames for which transmission on a particular interface fails due to excessive collisions. This counter does not increment when the interface is operating in full-duplex mode.",
      "zh-CHS": "Dot3StatsAccessiveCollisions对象类型语法计数器32 MAX-ACCESS只读状态当前描述“特定接口上传输因过度冲突而失败的帧计数。当接口在全双工模式下运行时，此计数器不会递增。"
    },
    {
      "indent": 11,
      "text": " Discontinuities in the value of this counter can occur at re-initialization of the management system, and at other times as indicated by the value of ifCounterDiscontinuityTime.\" REFERENCE \"[IEEE 802.3 Std.], 30.3.1.1.11,",
      "zh-CHS": "该计数器值的不连续性可在管理系统重新初始化时出现，也可在IFCounterInterruptionTime值指示的其他时间出现。“参考”[IEEE 802.3标准]，30.3.1.1.11，"
    },
    {
      "indent": 11,
      "text": "            aFramesAbortedDueToXSColls.\"\n::= { dot3StatsEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsInternalMacTransmitErrors OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of frames for which transmission on a particular interface fails due to an internal MAC sublayer transmit error. A frame is only counted by an instance of this object if it is not counted by the corresponding instance of either the dot3StatsLateCollisions object, the dot3StatsExcessiveCollisions object, or the dot3StatsCarrierSenseErrors object.",
      "zh-CHS": "DOT3STATSINTERNALMactTransmitErrors对象类型语法计数器32 MAX-ACCESS只读状态当前说明“由于内部MAC子层传输错误，在特定接口上传输失败的帧计数。如果帧未由dot3StatsLateCollisions对象、Dot3StatsAccessiveCollisions对象或dot3StatsCarrierSenseErrors对象的相应实例计数，则仅由该对象的实例计数。"
    },
    {
      "indent": 23,
      "text": "The precise meaning of the count represented by an instance of this object is implementation-specific. In particular, an instance of this object may represent a count of transmission errors on a particular interface that are not otherwise counted.",
      "zh-CHS": "此对象的实例表示的计数的确切含义是特定于实现的。特别地，该对象的实例可以表示特定接口上的传输错误的计数，否则这些错误不会被计数。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.12,\n            aFramesLostDueToIntMACXmitError.\"\n::= { dot3StatsEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsCarrierSenseErrors OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of times that the carrier sense condition was lost or never asserted when attempting to transmit a frame on a particular interface.",
      "zh-CHS": "dot3StatsCarrierSenseErrors对象类型语法计数器32 MAX-ACCESS只读状态当前描述“尝试在特定接口上传输帧时，载波检测条件丢失或从未断言的次数。"
    },
    {
      "indent": 23,
      "text": "The count represented by an instance of this object is incremented at most once per transmission attempt, even if the carrier sense condition fluctuates during a transmission attempt.",
      "zh-CHS": "由该对象的实例表示的计数在每次传输尝试中最多增加一次，即使载波检测条件在传输尝试期间波动。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment when the interface is operating in full-duplex mode.",
      "zh-CHS": "当接口在全双工模式下运行时，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.13,\n            aCarrierSenseErrors.\"\n::= { dot3StatsEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- { dot3StatsEntry 12 } is not assigned",
      "zh-CHS": "--未分配{dot3StatsEntry 12}"
    },
    {
      "indent": 7,
      "text": "dot3StatsFrameTooLongs OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of frames received on a particular interface that exceed the maximum permitted frame size.",
      "zh-CHS": "dot3StatsFrameTooLongs对象类型语法计数器32 MAX-ACCESS只读状态当前描述“在特定接口上接收到的超过最大允许帧大小的帧计数。"
    },
    {
      "indent": 23,
      "text": "The count represented by an instance of this object is incremented when the frameTooLong status is returned by the MAC service to the LLC (or other MAC user). Received frames for which multiple error conditions obtain are, according to the conventions of IEEE 802.3 Layer Management, counted exclusively according to the error status presented to the LLC.",
      "zh-CHS": "当MAC服务将FrameToolLong状态返回给LLC（或其他MAC用户）时，此对象实例表示的计数将增加。根据IEEE 802.3层管理的约定，获得多个错误条件的接收帧仅根据呈现给LLC的错误状态进行计数。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.25,\n            aFrameTooLongErrors.\"\n::= { dot3StatsEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- { dot3StatsEntry 14 } is not assigned",
      "zh-CHS": "--未分配{dot3StatsEntry 14}"
    },
    {
      "indent": 7,
      "text": "-- { dot3StatsEntry 15 } is not assigned",
      "zh-CHS": "--未分配{dot3StatsEntry 15}"
    },
    {
      "indent": 7,
      "text": "dot3StatsInternalMacReceiveErrors OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of frames for which reception on a particular interface fails due to an internal MAC sublayer receive error. A frame is only counted by an instance of this object if it is not counted by the corresponding instance of",
      "zh-CHS": "dot3StatsInternalMacReceiveErrors对象类型语法计数器32 MAX-ACCESS只读状态当前描述“由于内部MAC子层接收错误而在特定接口上接收失败的帧计数。如果某个帧未由相应的MAC子层接收错误计数，则该帧仅由该对象的实例计数"
    },
    {
      "indent": 23,
      "text": "either the dot3StatsFrameTooLongs object, the dot3StatsAlignmentErrors object, or the dot3StatsFCSErrors object.",
      "zh-CHS": "dot3StatsFrameTooLongs对象、dot3StatsAlignmentErrors对象或Dot3StatsSecurErrors对象。"
    },
    {
      "indent": 23,
      "text": "The precise meaning of the count represented by an instance of this object is implementation-specific. In particular, an instance of this object may represent a count of receive errors on a particular interface that are not otherwise counted.",
      "zh-CHS": "此对象的实例表示的计数的确切含义是特定于实现的。特别地，该对象的实例可以表示特定接口上未被计数的接收错误的计数。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.15,\n            aFramesLostDueToIntMACRcvError.\"\n::= { dot3StatsEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsEtherChipSet OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      deprecated\n    DESCRIPTION \"******** THIS OBJECT IS DEPRECATED ********",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "            This object contains an OBJECT IDENTIFIER\n            which identifies the chipset used to\n            realize the interface. Ethernet-like\n            interfaces are typically built out of\n            several different chips. The MIB implementor\n            is presented with a decision of which chip\n            to identify via this object. The implementor\n            should identify the chip which is usually\n            called the Medium Access Control chip.\n            If no such chip is easily identifiable,\n            the implementor should identify the chip\n            which actually gathers the transmit\n            and receive statistics and error\n            indications. This would allow a\n            manager station to correlate the\n            statistics and the chip generating\n            them, giving it the ability to take\n            into account any known anomalies\n            in the chip.\"\n::= { dot3StatsEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsSymbolErrors OBJECT-TYPE SYNTAX Counter32",
      "zh-CHS": "dot3StatsSymbolErrors对象类型语法计数器32"
    },
    {
      "indent": 11,
      "text": "MAX-ACCESS read-only STATUS current DESCRIPTION \"For an interface operating at 100 Mb/s, the number of times there was an invalid data symbol when a valid carrier was present.",
      "zh-CHS": "MAX-ACCESS只读状态当前描述”对于以100 Mb/s速度运行的接口，存在有效载波时出现无效数据符号的次数。"
    },
    {
      "indent": 23,
      "text": "For an interface operating in half-duplex mode at 1000 Mb/s, the number of times the receiving media is non-idle (a carrier event) for a period of time equal to or greater than slotTime, and during which there was at least one occurrence of an event that causes the PHY to indicate 'Data reception error' or 'carrier extend error' on the GMII.",
      "zh-CHS": "对于以1000 Mb/s的速度在半双工模式下运行的接口，接收媒体在等于或大于时隙时间的时间段内处于非空闲状态（载波事件）的次数，并且在此期间至少发生了一次导致PHY在GMII上指示“数据接收错误”或“载波扩展错误”的事件。"
    },
    {
      "indent": 23,
      "text": "For an interface operating in full-duplex mode at 1000 Mb/s, the number of times the receiving media is non-idle a carrier event) for a period of time equal to or greater than minFrameSize, and during which there was at least one occurrence of an event that causes the PHY to indicate 'Data reception error' on the GMII.",
      "zh-CHS": "对于以1000 Mb/s全双工模式运行的接口，接收媒体在等于或大于minFrameSize的时间段内非空闲（载波事件）的次数，并且在此期间至少发生一次导致PHY在GMII上指示“数据接收错误”的事件。"
    },
    {
      "indent": 23,
      "text": "The count represented by an instance of this object is incremented at most once per carrier event, even if multiple symbol errors occur during the carrier event. This count does not increment if a collision is present.",
      "zh-CHS": "此对象实例表示的计数在每个载波事件中最多增加一次，即使在载波事件期间发生多个符号错误。如果存在碰撞，此计数不会增加。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.2.1.5,\n            aSymbolErrorDuringCarrier.\"\n::= { dot3StatsEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3StatsDuplexStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    unknown(1),\n                    halfDuplex(2),\n                    fullDuplex(3)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION \"The current mode of operation of the MAC\n                entity.  'unknown' indicates that the current\n                duplex mode could not be determined.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "Management control of the duplex mode is accomplished through the MAU MIB. When an interface does not support autonegotiation, or when autonegotiation is not enabled, the duplex mode is controlled using ifMauDefaultType. When autonegotiation is supported and enabled, duplex mode is controlled using ifMauAutoNegAdvertisedBits. In either case, the currently operating duplex mode is reflected both in this object and in ifMauType.",
      "zh-CHS": "双工模式的管理控制通过MAU MIB完成。当接口不支持自动协商或未启用自动协商时，双工模式使用ifmaudaulttype控制。当支持并启用自动协商时，使用ifMauAutoNegAdvertisedBits控制双工模式。在任何一种情况下，当前运行的双工模式都会反映在此对象和ifMauType中。"
    },
    {
      "indent": 11,
      "text": "            Note that this object provides redundant\n            information with ifMauType.  Normally, redundant\n            objects are discouraged.  However, in this\n            instance, it allows a management application to\n            determine the duplex status of an interface\n            without having to know every possible value of\n            ifMauType.  This was felt to be sufficiently\n            valuable to justify the redundancy.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.32,\n            aDuplexStatus.\"\n::= { dot3StatsEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- the Ethernet-like Collision Statistics group",
      "zh-CHS": "--类以太网冲突统计组"
    },
    {
      "indent": 7,
      "text": "-- Implementation of this group is optional; it is appropriate\n-- for all systems which have the necessary metering",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3CollTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF Dot3CollEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION \"A collection of collision histograms for a\n                particular set of interfaces.\"\n    REFERENCE   \"[IEEE 802.3 Std.], 30.3.1.1.30,\n                aCollisionFrames.\"\n    ::= { dot3 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3CollEntry OBJECT-TYPE SYNTAX Dot3CollEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A cell in the histogram of per-frame collisions for a particular interface. An instance of this object represents the frequency of individual MAC frames for which the transmission (successful or otherwise) on a particular interface is accompanied by a",
      "zh-CHS": "dot3CollEntry对象类型语法dot3CollEntry MAX-ACCESS不可访问状态当前描述“特定接口的每帧冲突直方图中的一个单元格。此对象的一个实例表示传输（成功或不成功）的各个MAC帧的频率在一个特定的接口上，有一个"
    },
    {
      "indent": 11,
      "text": "            particular number of media collisions.\"\nINDEX       { ifIndex, dot3CollCount }\n::= { dot3CollTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Dot3CollEntry ::=\n    SEQUENCE {\n        dot3CollCount        INTEGER,\n        dot3CollFrequencies  Counter32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- { dot3CollEntry 1 } is no longer in use",
      "zh-CHS": "--{dot3CollEntry 1}不再使用"
    },
    {
      "indent": 7,
      "text": "dot3CollCount OBJECT-TYPE\n    SYNTAX      INTEGER (1..16)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION \"The number of per-frame media collisions for\n                which a particular collision histogram cell\n                represents the frequency on a particular\n                interface.\"\n    ::= { dot3CollEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3CollFrequencies OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of individual MAC frames for which the transmission (successful or otherwise) on a particular interface occurs after the frame has experienced exactly the number of collisions in the associated dot3CollCount object.",
      "zh-CHS": "dot3CollFrequencies对象类型语法计数器32 MAX-ACCESS只读状态当前描述“在特定接口上传输（成功或不成功）的单个MAC帧的计数，该帧在关联的dot3CollCount对象中经历的冲突数正好相等。"
    },
    {
      "indent": 23,
      "text": "For example, a frame which is transmitted on interface 77 after experiencing exactly 4 collisions would be indicated by incrementing only dot3CollFrequencies.77.4. No other instance of dot3CollFrequencies would be incremented in this example.",
      "zh-CHS": "例如，在经历4次碰撞后在接口77上传输的帧将仅通过增加dot3CollFrequencies.77.4来表示。在此示例中，不会增加dot3CollFrequencies的其他实例。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment when the interface is operating in full-duplex mode.",
      "zh-CHS": "当接口在全双工模式下运行时，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\n::= { dot3CollEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3ControlTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF Dot3ControlEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION \"A table of descriptive and status information\n                about the MAC Control sublayer on the\n                ethernet-like interfaces attached to a\n                particular system.  There will be one row in\n                this table for each ethernet-like interface in\n                the system which implements the MAC Control\n                sublayer.  If some, but not all, of the\n                ethernet-like interfaces in the system implement\n                the MAC Control sublayer, there will be fewer\n                rows in this table than in the dot3StatsTable.\"\n    ::= { dot3 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3ControlEntry OBJECT-TYPE\n    SYNTAX      Dot3ControlEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION \"An entry in the table, containing information\n                about the MAC Control sublayer on a single\n                ethernet-like interface.\"\n    INDEX       { dot3StatsIndex }\n    ::= { dot3ControlTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Dot3ControlEntry ::=\n    SEQUENCE {\n        dot3ControlFunctionsSupported       BITS,\n        dot3ControlInUnknownOpcodes         Counter32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3ControlFunctionsSupported OBJECT-TYPE\n    SYNTAX      BITS {\n                    pause(0)   -- 802.3x flow control\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION \"A list of the possible MAC Control functions\n                implemented for this interface.\"\n    REFERENCE   \"[IEEE 802.3 Std.], 30.3.3.2,\n                aMACControlFunctionsSupported.\"\n    ::= { dot3ControlEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3ControlInUnknownOpcodes OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current",
      "zh-CHS": "dot3ControlInUnknownOpcodes对象类型语法计数器32 MAX-ACCESS只读状态当前"
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"A count of MAC Control frames received on this interface that contain an opcode that is not supported by this device.",
      "zh-CHS": "DESCRIPTION“此接口上接收的MAC控制帧计数，其中包含此设备不支持的操作码。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.3.5,\n            aUnsupportedOpcodesReceived\"\n::= { dot3ControlEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3PauseTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF Dot3PauseEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION \"A table of descriptive and status information\n                about the MAC Control PAUSE function on the\n                ethernet-like interfaces attached to a\n                particular system. There will be one row in\n                this table for each ethernet-like interface in\n                the system which supports the MAC Control PAUSE\n                function (i.e., the 'pause' bit in the\n                corresponding instance of\n                dot3ControlFunctionsSupported is set).  If some,\n                but not all, of the ethernet-like interfaces in\n                the system implement the MAC Control PAUSE\n                function (for example, if some interfaces only\n                support half-duplex), there will be fewer rows\n                in this table than in the dot3StatsTable.\"\n    ::= { dot3 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3PauseEntry OBJECT-TYPE\n    SYNTAX      Dot3PauseEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION \"An entry in the table, containing information\n                about the MAC Control PAUSE function on a single\n                ethernet-like interface.\"\n    INDEX       { dot3StatsIndex }\n    ::= { dot3PauseTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Dot3PauseEntry ::=\n    SEQUENCE {\n        dot3PauseAdminMode                  INTEGER,\n        dot3PauseOperMode                   INTEGER,\n        dot3InPauseFrames                   Counter32,\n        dot3OutPauseFrames                  Counter32",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "}",
      "zh-CHS": "}"
    },
    {
      "indent": 7,
      "text": "dot3PauseAdminMode OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    disabled(1),\n                    enabledXmit(2),\n                    enabledRcv(3),\n                    enabledXmitAndRcv(4)\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION \"This object is used to configure the default\n                administrative PAUSE mode for this interface.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "This object represents the administratively-configured PAUSE mode for this interface. If auto-negotiation is not enabled or is not implemented for the active MAU attached to this interface, the value of this object determines the operational PAUSE mode of the interface whenever it is operating in full-duplex mode. In this case, a set to this object will force the interface into the specified mode.",
      "zh-CHS": "此对象表示此接口的管理配置的暂停模式。如果连接到此接口的活动MAU未启用或未实现自动协商，则无论何时在全双工模式下操作，此对象的值都将确定接口的操作暂停模式。在这种情况下，设置此对象将强制接口进入指定模式。"
    },
    {
      "indent": 23,
      "text": "If auto-negotiation is implemented and enabled for the MAU attached to this interface, the PAUSE mode for this interface is determined by auto-negotiation, and the value of this object denotes the mode to which the interface will automatically revert if/when auto-negotiation is later disabled. Note that when auto-negotiation is running, administrative control of the PAUSE mode may be accomplished using the ifMauAutoNegCapAdvertisedBits object in the MAU-MIB.",
      "zh-CHS": "如果为连接到此接口的MAU实现并启用了自动协商，则此接口的暂停模式由自动协商确定，并且此对象的值表示在以后禁用自动协商时接口将自动恢复到的模式。请注意，在运行自动协商时，可以使用MAU-MIB中的ifMauAutoNegCapAdvertisedBits对象来完成暂停模式的管理控制。"
    },
    {
      "indent": 23,
      "text": "Note that the value of this object is ignored when the interface is not operating in full-duplex mode.",
      "zh-CHS": "请注意，当接口未在全双工模式下运行时，将忽略此对象的值。"
    },
    {
      "indent": 11,
      "text": "            An attempt to set this object to\n            'enabledXmit(2)' or 'enabledRcv(3)' will fail\n            on interfaces that do not support operation\n            at greater than 100 Mb/s.\"\n::= { dot3PauseEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3PauseOperMode OBJECT-TYPE",
      "zh-CHS": "DOT3PausePerMode对象类型"
    },
    {
      "indent": 11,
      "text": "SYNTAX      INTEGER {\n                disabled(1),\n                enabledXmit(2),\n                enabledRcv(3),\n                enabledXmitAndRcv(4)\n            }\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION \"This object reflects the PAUSE mode currently\n            in use on this interface, as determined by\n            either (1) the result of the auto-negotiation\n            function or (2) if auto-negotiation is not\n            enabled or is not implemented for the active MAU\n            attached to this interface, by the value of\n            dot3PauseAdminMode.  Interfaces operating at\n            100 Mb/s or less will never return\n            'enabledXmit(2)' or 'enabledRcv(3)'.  Interfaces\n            operating in half-duplex mode will always return\n            'disabled(1)'.  Interfaces on which\n            auto-negotiation is enabled but not yet\n            completed should return the value\n            'disabled(1)'.\"\n::= { dot3PauseEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3InPauseFrames OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of MAC Control frames received on this interface with an opcode indicating the PAUSE operation.",
      "zh-CHS": "dot3InPauseFrames对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此接口上接收的MAC控制帧计数，操作码指示暂停操作。"
    },
    {
      "indent": 11,
      "text": "            This counter does not increment when the\n            interface is operating in half-duplex mode.\n            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.4.3,\n            aPAUSEMACCtrlFramesReceived.\"\n::= { dot3PauseEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3OutPauseFrames OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"A count of MAC Control frames transmitted on this interface with an opcode indicating the",
      "zh-CHS": "dot3OutPauseFrames对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此接口上传输的MAC控制帧计数，操作码指示"
    },
    {
      "indent": 23,
      "text": "PAUSE operation.",
      "zh-CHS": "暂停操作。"
    },
    {
      "indent": 23,
      "text": "This counter does not increment when the interface is operating in half-duplex mode.",
      "zh-CHS": "当接口在半双工模式下工作时，此计数器不递增。"
    },
    {
      "indent": 11,
      "text": "            Discontinuities in the value of this counter can\n            occur at re-initialization of the management\n            system, and at other times as indicated by the\n            value of ifCounterDiscontinuityTime.\"\nREFERENCE   \"[IEEE 802.3 Std.], 30.3.4.2,\n            aPAUSEMACCtrlFramesTransmitted.\"\n::= { dot3PauseEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- 802.3 Tests",
      "zh-CHS": "--802.3测试"
    },
    {
      "indent": 7,
      "text": "dot3Tests   OBJECT IDENTIFIER ::= { dot3 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3Errors  OBJECT IDENTIFIER ::= { dot3 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- TDR Test",
      "zh-CHS": "--TDR试验"
    },
    {
      "indent": 7,
      "text": "dot3TestTdr OBJECT-IDENTITY STATUS current DESCRIPTION \"The Time-Domain Reflectometry (TDR) test is specific to ethernet-like interfaces of type 10Base5 and 10Base2. The TDR value may be useful in determining the approximate distance to a cable fault. It is advisable to repeat this test to check for a consistent resulting TDR value, to verify that there is a fault.",
      "zh-CHS": "dot3TestTdr对象标识状态当前描述“时域反射计（TDR）测试针对10Base5和10Base2类型的以太网类接口。TDR值可能有助于确定电缆故障的大致距离。建议重复此测试，以检查产生的TDR值是否一致，以验证是否存在故障。"
    },
    {
      "indent": 11,
      "text": "            A TDR test returns as its result the time\n            interval, measured in 10 MHz ticks or 100 nsec\n            units, between the start of TDR test\n            transmission and the subsequent detection of a\n            collision or deassertion of carrier.  On\n            successful completion of a TDR test, the result\n            is stored as the value of an appropriate\n            instance of an appropriate vendor specific MIB\n            object, and the OBJECT IDENTIFIER of that\n            instance is stored in the appropriate instance\n            of the appropriate test result code object\n            (thereby indicating where the result has been\n            stored).\"\n::= { dot3Tests 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- Loopback Test",
      "zh-CHS": "--环回测试"
    },
    {
      "indent": 7,
      "text": "dot3TestLoopBack OBJECT-IDENTITY STATUS current DESCRIPTION \"This test configures the MAC chip and executes an internal loopback test of memory, data paths, and the MAC chip logic. This loopback test can only be executed if the interface is offline. Once the test has completed, the MAC chip should be reinitialized for network operation, but it should remain offline.",
      "zh-CHS": "dot3TestLoopBack对象标识状态当前描述“此测试配置MAC芯片，并执行内存、数据路径和MAC芯片逻辑的内部环回测试。此环回测试只能在接口脱机时执行。一旦测试完成，MAC芯片应重新初始化以进行网络操作，但应保持脱机状态。"
    },
    {
      "indent": 11,
      "text": "            If an error occurs during a test, the\n            appropriate test result object will be set\n            to indicate a failure.  The two OBJECT\n            IDENTIFIER values dot3ErrorInitError and\n            dot3ErrorLoopbackError may be used to provided\n            more information as values for an appropriate\n            test result code object.\"\n::= { dot3Tests 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3ErrorInitError OBJECT-IDENTITY\n    STATUS      current\n    DESCRIPTION \"Couldn't initialize MAC chip for test.\"\n    ::= { dot3Errors 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3ErrorLoopbackError OBJECT-IDENTITY\n    STATUS      current\n    DESCRIPTION \"Expected data not received (or not received\n                correctly) in loopback test.\"\n    ::= { dot3Errors 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- { dot3 8 }, the dot3ChipSets tree, is defined in [28]",
      "zh-CHS": "--[28]中定义了dot3ChipSets树{dot3 8}"
    },
    {
      "indent": 7,
      "text": "-- conformance information",
      "zh-CHS": "--一致性信息"
    },
    {
      "indent": 7,
      "text": "etherConformance OBJECT IDENTIFIER ::= { etherMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherGroups      OBJECT IDENTIFIER ::= { etherConformance 1 }\netherCompliances OBJECT IDENTIFIER ::= { etherConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- compliance statements",
      "zh-CHS": "--合规声明"
    },
    {
      "indent": 7,
      "text": "etherCompliance MODULE-COMPLIANCE\n    STATUS      deprecated\n    DESCRIPTION \"******** THIS COMPLIANCE IS DEPRECATED ********",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "The compliance statement for managed network entities which have ethernet-like network interfaces.",
      "zh-CHS": "具有类似以太网的网络接口的受管网络实体的符合性声明。"
    },
    {
      "indent": 23,
      "text": "This compliance is deprecated and replaced by dot3Compliance.\"",
      "zh-CHS": "此合规性已被弃用，并被dot3Compliance取代。”"
    },
    {
      "indent": 11,
      "text": "MODULE -- this module MANDATORY-GROUPS { etherStatsGroup }",
      "zh-CHS": "MODULE--此模块是必需的-GROUPS{etherStatsGroup}"
    },
    {
      "indent": 11,
      "text": "    GROUP       etherCollisionTableGroup\n    DESCRIPTION \"This group is optional. It is appropriate\n                for all systems which have the necessary\n                metering. Implementation in such systems is\n                highly recommended.\"\n::= { etherCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "ether100MbsCompliance MODULE-COMPLIANCE\n    STATUS      deprecated\n    DESCRIPTION \"******** THIS COMPLIANCE IS DEPRECATED ********",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "The compliance statement for managed network entities which have 100 Mb/sec ethernet-like network interfaces.",
      "zh-CHS": "具有100 Mb/s以太网式网络接口的受管网络实体的合规性声明。"
    },
    {
      "indent": 23,
      "text": "This compliance is deprecated and replaced by dot3Compliance.\"",
      "zh-CHS": "此合规性已被弃用，并被dot3Compliance取代。”"
    },
    {
      "indent": 11,
      "text": "MODULE -- this module MANDATORY-GROUPS { etherStats100MbsGroup }",
      "zh-CHS": "MODULE——此模块为强制组{EtherstStats100MBsgroup}"
    },
    {
      "indent": 11,
      "text": "    GROUP       etherCollisionTableGroup\n    DESCRIPTION \"This group is optional. It is appropriate\n                for all systems which have the necessary\n                metering. Implementation in such systems is\n                highly recommended.\"\n::= { etherCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "dot3Compliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for managed network entities which have ethernet-like network interfaces.\"",
      "zh-CHS": "dot3Compliance MODULE-COMPLIANCE STATUS当前描述“具有类似以太网的网络接口的受管网络实体的符合性声明”"
    },
    {
      "indent": 11,
      "text": "MODULE -- this module MANDATORY-GROUPS { etherStatsBaseGroup }",
      "zh-CHS": "MODULE--此模块是必需的-GROUPS{EtherstStatsBaseGroup}"
    },
    {
      "indent": 15,
      "text": "GROUP etherDuplexGroup DESCRIPTION \"This group is mandatory for all ethernet-like network interfaces which are capable of operating in full-duplex mode. It is highly recommended for all",
      "zh-CHS": "组etherDuplexGroup DESCRIPTION“此组对于能够在全双工模式下运行的所有类似以太网的网络接口都是必需的。强烈建议所有用户使用此组"
    },
    {
      "indent": 27,
      "text": "ethernet-like network interfaces.\"",
      "zh-CHS": "类似以太网的网络接口。”"
    },
    {
      "indent": 15,
      "text": "GROUP etherStatsLowSpeedGroup DESCRIPTION \"This group is mandatory for all ethernet-like network interfaces which are capable of operating at 10 Mb/s or slower in half-duplex mode.\"",
      "zh-CHS": "GROUP EtherstStatsLowSpeedGroup DESCRIPTION“此组对于所有能够在半双工模式下以10 Mb/s或更低速度运行的类似以太网的网络接口是必需的。”"
    },
    {
      "indent": 15,
      "text": "GROUP etherStatsHighSpeedGroup DESCRIPTION \"This group is mandatory for all ethernet-like network interfaces which are capable of operating at 100 Mb/s or faster.\"",
      "zh-CHS": "GROUP EtherstStatsHighSpeedGroup DESCRIPTION“对于能够以100 Mb/s或更快速度运行的所有类似以太网的网络接口，此组是必需的。”"
    },
    {
      "indent": 15,
      "text": "GROUP etherControlGroup DESCRIPTION \"This group is mandatory for all ethernet-like network interfaces that support the MAC Control sublayer.\"",
      "zh-CHS": "GROUP etherControlGroup DESCRIPTION“此组对于支持MAC控制子层的所有类似以太网的网络接口都是必需的。”"
    },
    {
      "indent": 15,
      "text": "GROUP etherControlPauseGroup DESCRIPTION \"This group is mandatory for all ethernet-like network interfaces that support the MAC Control PAUSE function.\"",
      "zh-CHS": "GROUP etherControlPauseGroup DESCRIPTION“此组对于支持MAC控制暂停功能的所有类似以太网的网络接口都是必需的。”"
    },
    {
      "indent": 15,
      "text": "GROUP etherCollisionTableGroup DESCRIPTION \"This group is optional. It is appropriate for all ethernet-like network interfaces which are capable of operating in half-duplex mode and have the necessary metering. Implementation in systems with such interfaces is highly recommended.\"",
      "zh-CHS": "GROUP etherCollisionTableGroup DESCRIPTION“此组是可选的。它适用于能够在半双工模式下运行并具有必要计量的所有类似以太网的网络接口。强烈建议在具有此类接口的系统中实施。”"
    },
    {
      "indent": 11,
      "text": "::= { etherCompliances 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "-- units of conformance",
      "zh-CHS": "--一致性单位"
    },
    {
      "indent": 7,
      "text": "etherStatsGroup OBJECT-GROUP OBJECTS { dot3StatsIndex, dot3StatsAlignmentErrors, dot3StatsFCSErrors, dot3StatsSingleCollisionFrames, dot3StatsMultipleCollisionFrames, dot3StatsSQETestErrors, dot3StatsDeferredTransmissions, dot3StatsLateCollisions, dot3StatsExcessiveCollisions, dot3StatsInternalMacTransmitErrors, dot3StatsCarrierSenseErrors, dot3StatsFrameTooLongs,",
      "zh-CHS": "EtherstStatsGroup对象组对象{dot3StatsIndex，dot3StatsAlignmentErrors，DOT3STATSCSSERRORS，dot3StatsSingleCollisionFrames，dot3StatsMultipleCollisionFrames，DOT3STATSQETERRORS，DOT3STATSEDERREEDTRANSMISSION，DOT3STATSALECTERRONSE，DOT3STATSALESCESSIVE CLISTIVE，DOT3STATSINTERNALMACTRANSERRORS，DOT3STATSRAMESTOOLONG，"
    },
    {
      "indent": 11,
      "text": "              dot3StatsInternalMacReceiveErrors,\n              dot3StatsEtherChipSet\n            }\nSTATUS      deprecated\nDESCRIPTION \"********* THIS GROUP IS DEPRECATED **********",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "A collection of objects providing information applicable to all ethernet-like network interfaces.",
      "zh-CHS": "提供适用于所有类似以太网的网络接口的信息的对象集合。"
    },
    {
      "indent": 11,
      "text": "            This object group has been deprecated and\n            replaced by etherStatsBaseGroup and\n            etherStatsLowSpeedGroup.\"\n::= { etherGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherCollisionTableGroup OBJECT-GROUP\n    OBJECTS     { dot3CollFrequencies\n                }\n    STATUS      current\n    DESCRIPTION \"A collection of objects providing a histogram\n                of packets successfully transmitted after\n                experiencing exactly N collisions.\"\n    ::= { etherGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherStats100MbsGroup OBJECT-GROUP\n    OBJECTS     { dot3StatsIndex,\n                  dot3StatsAlignmentErrors,\n                  dot3StatsFCSErrors,\n                  dot3StatsSingleCollisionFrames,\n                  dot3StatsMultipleCollisionFrames,\n                  dot3StatsDeferredTransmissions,\n                  dot3StatsLateCollisions,\n                  dot3StatsExcessiveCollisions,\n                  dot3StatsInternalMacTransmitErrors,\n                  dot3StatsCarrierSenseErrors,\n                  dot3StatsFrameTooLongs,\n                  dot3StatsInternalMacReceiveErrors,\n                  dot3StatsEtherChipSet,\n                  dot3StatsSymbolErrors\n                }\n    STATUS      deprecated\n    DESCRIPTION \"********* THIS GROUP IS DEPRECATED **********",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "A collection of objects providing information applicable to 100 Mb/sec ethernet-like network interfaces.",
      "zh-CHS": "提供适用于100 Mb/s以太网类网络接口的信息的对象集合。"
    },
    {
      "indent": 23,
      "text": "This object group has been deprecated and",
      "zh-CHS": "此对象组已被弃用，并且"
    },
    {
      "indent": 11,
      "text": "            replaced by etherStatsBaseGroup and\n            etherStatsHighSpeedGroup.\"\n::= { etherGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherStatsBaseGroup OBJECT-GROUP\n    OBJECTS     { dot3StatsIndex,\n                  dot3StatsAlignmentErrors,\n                  dot3StatsFCSErrors,\n                  dot3StatsSingleCollisionFrames,\n                  dot3StatsMultipleCollisionFrames,\n                  dot3StatsDeferredTransmissions,\n                  dot3StatsLateCollisions,\n                  dot3StatsExcessiveCollisions,\n                  dot3StatsInternalMacTransmitErrors,\n                  dot3StatsCarrierSenseErrors,\n                  dot3StatsFrameTooLongs,\n                  dot3StatsInternalMacReceiveErrors\n                }\n    STATUS      current\n    DESCRIPTION \"A collection of objects providing information\n                applicable to all ethernet-like network\n                interfaces.\"\n    ::= { etherGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherStatsLowSpeedGroup OBJECT-GROUP OBJECTS { dot3StatsSQETestErrors } STATUS current DESCRIPTION \"A collection of objects providing information applicable to ethernet-like network interfaces capable of operating at 10 Mb/s or slower in half-duplex mode.\"",
      "zh-CHS": "EtherstStatsLowSpeedGroup对象组对象{dot3StatsSqeTesterErrors}状态当前描述“一组对象，提供适用于在半双工模式下以10 Mb/s或更低速度运行的类以太网网络接口的信息。”"
    },
    {
      "indent": 11,
      "text": "::= { etherGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherStatsHighSpeedGroup OBJECT-GROUP\n    OBJECTS     { dot3StatsSymbolErrors }\n    STATUS      current\n    DESCRIPTION \"A collection of objects providing information\n                applicable to ethernet-like network interfaces\n                capable of operating at 100 Mb/s or faster.\"\n    ::= { etherGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherDuplexGroup OBJECT-GROUP OBJECTS { dot3StatsDuplexStatus } STATUS current DESCRIPTION \"A collection of objects providing information about the duplex mode of an ethernet-like network interface.\"",
      "zh-CHS": "etherDuplexGroup对象组对象{dot3StatsDuplexStatus}状态当前描述“提供类似以太网的网络接口的双工模式信息的对象集合。”"
    },
    {
      "indent": 11,
      "text": "::= { etherGroups 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherControlGroup OBJECT-GROUP\n    OBJECTS     { dot3ControlFunctionsSupported,\n                  dot3ControlInUnknownOpcodes\n                }\n    STATUS      current\n    DESCRIPTION \"A collection of objects providing information\n                about the MAC Control sublayer on ethernet-like\n                network interfaces.\"\n    ::= { etherGroups 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "etherControlPauseGroup OBJECT-GROUP\n    OBJECTS     { dot3PauseAdminMode,\n                  dot3PauseOperMode,\n                  dot3InPauseFrames,\n                  dot3OutPauseFrames\n                }\n    STATUS      current\n    DESCRIPTION \"A collection of objects providing information\n                about and control of the MAC Control PAUSE\n                function on ethernet-like network interfaces.\"\n    ::= { etherGroups 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "5. Intellectual Property",
      "section_title": true,
      "zh-CHS": "5. 知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何努力来确定任何此类权利。有关IETF在标准跟踪和标准相关文件中权利的程序信息，请参见BCP-11。可从IETF秘书处获得可供发布的权利声明副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涉及实施本标准所需技术的专有权利。请将信息发送给IETF执行董事。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "This document was produced by the IETF Ethernet Interfaces and Hub MIB Working Group, whose efforts were greatly advanced by the contributions of the following people:",
      "zh-CHS": "本文件由IETF以太网接口和集线器MIB工作组编制，以下人员的贡献极大地推动了其工作："
    },
    {
      "indent": 6,
      "text": "Lynn Kubinec Steve McRobert Dan Romascanu Andrew Smith Geoff Thompson",
      "zh-CHS": "林恩·库比内克·史蒂夫·麦克罗伯特·丹·罗马斯坎努·安德鲁·史密斯·杰夫·汤普森"
    },
    {
      "indent": 3,
      "text": "This document is based on the Proposed Standard Ethernet MIB, RFC 2358 [23], edited by John Flick of Hewlett-Packard and Jeffrey Johnson of RedBack Networks and produced by the 802.3 Hub MIB Working Group. It extends that document by providing support for full-duplex Ethernet interfaces and 1000 Mb/sec Ethernet interfaces as outlined in [16].",
      "zh-CHS": "本文件基于提议的标准以太网MIB RFC 2358[23]，由惠普的John Flick和RedBack Networks的Jeffrey Johnson编辑，由802.3集线器MIB工作组编制。它通过提供对全双工以太网接口和1000 Mb/s以太网接口的支持扩展了该文档，如[16]所述。"
    },
    {
      "indent": 3,
      "text": "RFC 2358, in turn, is almost completely based on both the Standard Ethernet MIB, RFC 1643 [21], and the Proposed Standard Ethernet MIB using the SNMPv2 SMI, RFC 1650 [22], both of which were edited by Frank Kastenholz of FTP Software and produced by the Interfaces MIB Working Group. RFC 2358 extends those documents by providing support for 100 Mb/sec ethernet interfaces.",
      "zh-CHS": "反过来，RFC 2358几乎完全基于标准以太网MIB RFC 1643[21]和使用SNMPv2 SMI RFC 1650[22]的拟议标准以太网MIB，两者均由FTP软件的Frank Kastenholz编辑，并由接口MIB工作组制作。RFC2358通过支持100MB/秒的以太网接口扩展了这些文档。"
    },
    {
      "indent": 3,
      "text": "RFC 1643 and RFC 1650, in turn, are based on the Draft Standard Ethernet MIB, RFC 1398 [20], also edited by Frank Kastenholz and produced by the Ethernet MIB Working Group.",
      "zh-CHS": "RFC 1643和RFC 1650依次基于标准以太网MIB草案RFC 1398[20]，该草案也由Frank Kastenholz编辑并由以太网MIB工作组制作。"
    },
    {
      "indent": 3,
      "text": "RFC 1398, in turn, is based on the Proposed Standard Ethernet MIB, RFC 1284 [18], which was edited by John Cook of Chipcom and produced by the Transmission MIB Working Group. The Ethernet MIB Working Group gathered implementation experience of the variables specified in RFC 1284, documented that experience in RFC 1369 [19], and used that information to develop this revised MIB.",
      "zh-CHS": "反过来，RFC 1398基于提议的标准以太网MIB RFC 1284[18]，由Chipcom的John Cook编辑，并由传输MIB工作组制作。以太网MIB工作组收集了RFC 1284中规定的变量的实施经验，在RFC 1369[19]中记录了该经验，并利用该信息开发了该修订的MIB。"
    },
    {
      "indent": 3,
      "text": "RFC 1284, in turn, is based on a document written by Frank Kastenholz, then of Interlan, entitled IEEE 802.3 Layer Management Draft M compatible MIB for TCP/IP Networks [17]. This document was modestly reworked, initially by the SNMP Working Group, and then by the Transmission Working Group, to reflect the current conventions for defining objects for MIB interfaces. James Davin, of the MIT Laboratory for Computer Science, and Keith McCloghrie of Hughes LAN Systems, contributed to later drafts of this memo. Marshall Rose of Performance Systems International, Inc. converted the document into",
      "zh-CHS": "反过来，RFC 1284是基于当时Interlan的Frank Kastenholz编写的一份文件，题为IEEE 802.3层管理草案M兼容TCP/IP网络MIB[17]。该文档最初由SNMP工作组，然后由传输工作组进行了适当的修改，以反映定义MIB接口对象的当前约定。麻省理工学院计算机科学实验室的詹姆斯·戴文（James Davin）和休斯局域网系统（Hughes LAN Systems）的基思·麦克洛赫里（Keith McCloghrie）为这份备忘录的后续草稿做出了贡献。Performance Systems International，Inc.的Marshall Rose将该文件转换为"
    },
    {
      "indent": 3,
      "text": "RFC 1212 [3] concise format. Anil Rijsinghani of DEC contributed text that more adequately describes the TDR test. Thanks to Frank Kastenholz of Interlan and Louis Steinberg of IBM for their experimentation.",
      "zh-CHS": "RFC 1212[3]简明格式。DEC的Anil Rijsinghani提供了更充分地描述TDR测试的文本。感谢因特拉的弗兰克·卡斯滕霍尔茨和IBM的路易斯·斯坦伯格的实验。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Harrington, D., Presuhn, R. and B. Wijnen, \"An Architecture for Describing SNMP Management Frameworks\", RFC 2571, May 1999.",
      "zh-CHS": "[1] Harrington，D.，Presohn，R.和B.Wijnen，“描述SNMP管理框架的体系结构”，RFC 2571，1999年5月。"
    },
    {
      "indent": 3,
      "text": "[2] Rose, M. and K. McCloghrie, \"Structure and Identification of Management Information for TCP/IP-based Internets\", STD 16, RFC 1155, May 1990.",
      "zh-CHS": "[2] Rose，M.和K.McCloghrie，“基于TCP/IP的互联网管理信息的结构和识别”，STD 16，RFC 1155，1990年5月。"
    },
    {
      "indent": 3,
      "text": "[3] Rose, M. and K. McCloghrie, \"Concise MIB Definitions\", STD 16, RFC 1212, March 1991.",
      "zh-CHS": "[3] Rose，M.和K.McCloghrie，“简明MIB定义”，STD 16，RFC 1212，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Rose, M., \"A Convention for Defining Traps for use with the SNMP\", RFC 1215, March 1991.",
      "zh-CHS": "[4] Rose，M.“定义用于SNMP的陷阱的约定”，RFC1215，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[5] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[5] McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[6] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[6] McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[7] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[7] McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S Waldbusser，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 3,
      "text": "[8] Case, J., Fedor, M., Schoffstall, M. and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "zh-CHS": "[8] Case，J.，Fedor，M.，Schoffstall，M.和J.Davin，“简单网络管理协议”，STD 15，RFC 1157，1990年5月。"
    },
    {
      "indent": 3,
      "text": "[9] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Introduction to Community-based SNMPv2\", RFC 1901, January 1996.",
      "zh-CHS": "[9] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“基于社区的SNMPv2简介”，RFC 19011996年1月。"
    },
    {
      "indent": 3,
      "text": "[10] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Transport Mappings for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1906, January 1996.",
      "zh-CHS": "[10] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的传输映射”，RFC 1906，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[11] Case, J., Harrington D., Presuhn R. and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2572, May 1999.",
      "zh-CHS": "[11] Case，J.，Harrington D.，Presohn R.和B.Wijnen，“简单网络管理协议（SNMP）的消息处理和调度”，RFC 2572，1999年5月。"
    },
    {
      "indent": 3,
      "text": "[12] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2574, May 1999.",
      "zh-CHS": "[12] Blumenthal，U.和B.Wijnen，“简单网络管理协议（SNMPv3）第3版的基于用户的安全模型（USM）”，RFC 2574，1999年5月。"
    },
    {
      "indent": 3,
      "text": "[13] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Protocol Operations for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1905, January 1996.",
      "zh-CHS": "[13] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的协议操作”，RFC 1905，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[14] Levi, D., Meyer, P. and B. Stewart, \"SNMPv3 Applications\", RFC 2573, May 1999.",
      "zh-CHS": "[14] Levi，D.，Meyer，P.和B.Stewart，“SNMPv3应用”，RFC2573，1999年5月。"
    },
    {
      "indent": 3,
      "text": "[15] Wijnen, B., Presuhn, R. and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", RFC 2575, May 1999.",
      "zh-CHS": "[15] Wijnen，B.，Presuhn，R.和K.McCloghrie，“用于简单网络管理协议（SNMP）的基于视图的访问控制模型（VACM）”，RFC 2575，1999年5月。"
    },
    {
      "indent": 3,
      "text": "[16] IEEE, IEEE Std 802.3, 1998 Edition: \"Information technology - Telecommunications and information exchange between systems - Local and metropolitan area networks - Specific requirements - Part 3: Carrier sense multiple access with collision detection (CSMA/CD) access method and physical layer specifications\" (incorporating ANSI/IEEE Std. 802.3, 1996 Edition, IEEE Std. 802.3r-1996, 802.3u-1995, 802.3x&y-1997, 802.3z-1998, and 802.3aa-1998), September 1998.",
      "zh-CHS": "[16] IEEE，IEEE标准802.3，1998年版：“信息技术-系统间电信和信息交换-局域网和城域网-特殊要求-第3部分：带冲突检测的载波侦听多址（CSMA/CD）接入方法和物理层规范”（合并ANSI/IEEE标准802.3，1996年版，IEEE标准802.3r-1996，802.3u-1995，802.3x&y-1997，802.3z-1998和802.3aa-1998），1998年9月。"
    },
    {
      "indent": 3,
      "text": "[17] Kastenholz, F., \"IEEE 802.3 Layer Management Draft compatible MIB for TCP/IP Networks\", electronic mail message to mib-wg@nnsc.nsf.net, 9 June 1989.",
      "zh-CHS": "[17] Kastenholz，F.，“适用于TCP/IP网络的IEEE 802.3层管理草案兼容MIB”，发送至MIB的电子邮件-wg@nnsc.nsf.net，1989年6月9日。"
    },
    {
      "indent": 3,
      "text": "[18] Cook, J., \"Definitions of Managed Objects for Ethernet-Like Interface Types\", RFC 1284, December 1991.",
      "zh-CHS": "[18] Cook，J.，“类似以太网接口类型的托管对象定义”，RFC 1284，1991年12月。"
    },
    {
      "indent": 3,
      "text": "[19] Kastenholz, F., \"Implementation Notes and Experience for The Internet Ethernet MIB\", RFC 1369, October 1992.",
      "zh-CHS": "[19] Kastenholz，F.，“因特网以太网MIB的实施说明和经验”，RFC 1369，1992年10月。"
    },
    {
      "indent": 3,
      "text": "[20] Kastenholz, F., \"Definitions of Managed Objects for the Ethernet-like Interface Types\", RFC 1398, January 1993.",
      "zh-CHS": "[20] Kastenholz，F.，“类似以太网接口类型的托管对象定义”，RFC 1398，1993年1月。"
    },
    {
      "indent": 3,
      "text": "[21] Kastenholz, F., \"Definitions of Managed Objects for the Ethernet-like Interface Types\", STD 50, RFC 1643, July 1994.",
      "zh-CHS": "[21] Kastenholz，F.，“类似以太网接口类型的托管对象定义”，STD 50，RFC 1643，1994年7月。"
    },
    {
      "indent": 3,
      "text": "[22] Kastenholz, F., \"Definitions of Managed Objects for the Ethernet-like Interface Types using SMIv2\", RFC 1650, August 1994.",
      "zh-CHS": "[22] Kastenholz，F.，“使用SMIv2的类以太网接口类型的托管对象定义”，RFC1650，1994年8月。"
    },
    {
      "indent": 3,
      "text": "[23] Flick, J. and J. Johnson, \"Definitions of Managed Objects for the Ethernet-like Interface Types\", RFC 2358, June 1998.",
      "zh-CHS": "[23] Flick，J.和J.Johnson，“类似以太网接口类型的托管对象定义”，RFC 2358，1998年6月。"
    },
    {
      "indent": 3,
      "text": "[24] McCloghrie, K. and M. Rose, Editors, \"Management Information Base for Network Management of TCP/IP-based internets: MIB-II\", STD 17, RFC 1213, March 1991.",
      "zh-CHS": "[24] McCloghrie，K.和M.Rose，编辑，“基于TCP/IP的互联网网络管理的管理信息库：MIB-II”，STD 17，RFC 1213，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[25] McCloghrie, K., and F. Kastenholz, \"The Interfaces Group MIB using SMIv2\", RFC 2233, November 1997.",
      "zh-CHS": "[25] McCloghrie，K.和F.Kastenholz，“使用SMIv2的接口组MIB”，RFC 2233，1997年11月。"
    },
    {
      "indent": 3,
      "text": "[26] Bradner, S., \"Key words for use in RFCs to Indicate Requirements Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[26] Bradner，S.“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[27] Smith, A., Flick, J., deGraaf, K., Romascanu, D., McMaster, D., McCloghrie, K. and S. Roberts, \"Definitions of Managed Objects for IEEE 802.3 Medium Attachment Units (MAUs)\", RFC 2668, August 1999.",
      "zh-CHS": "[27] Smith，A.，Flick，J.，deGraaf，K.，Romascan，D.，McMaster，D.，McCloghrie，K.和S.Roberts，“IEEE 802.3介质连接单元（MAU）的受管对象定义”，RFC 2668，1999年8月。"
    },
    {
      "indent": 3,
      "text": "[28] Flick, J., \"Definitions of Object Identifiers for Identifying Ethernet Chip Sets\", RFC 2666, August 1999.",
      "zh-CHS": "[28] Flick，J.，“识别以太网芯片组的对象标识符的定义”，RFC 2666，1999年8月。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are two management objects defined in this MIB that have a MAX-ACCESS clause of read-write. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "zh-CHS": "此MIB中定义了两个具有读写MAX-ACCESS子句的管理对象。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作可能会对网络操作产生负面影响。"
    },
    {
      "indent": 3,
      "text": "There are a number of managed objects in this MIB that may be considered to contain sensitive information. In particular, the dot3StatsEtherChipSet object may be considered sensitive in many environments, since it would allow an intruder to obtain information about which vendor's equipment is in use on the network. Note that this object has been deprecated. However, some implementors may still choose to implement it for backwards compatability.",
      "zh-CHS": "此MIB中有许多托管对象可能被认为包含敏感信息。特别是，Dot3StateSetherChipset对象在许多环境中可能被视为敏感对象，因为它允许入侵者获取有关网络上使用的供应商设备的信息。请注意，此对象已被弃用。然而，一些实现者可能仍然选择实现它以实现向后兼容性。"
    },
    {
      "indent": 3,
      "text": "Therefore, it may be important in some environments to control read access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. Not all versions of SNMP provide features for such a secure environment.",
      "zh-CHS": "因此，在某些环境中，控制对这些对象的读取访问，甚至可能在通过SNMP通过网络发送这些对象时加密这些对象的值可能很重要。并非所有版本的SNMP都为这种安全环境提供功能。"
    },
    {
      "indent": 3,
      "text": "SNMPv1 by itself is such an insecure environment. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is allowed to access and GET (read) the objects in this MIB.",
      "zh-CHS": "SNMPv1本身就是这样一个不安全的环境。即使网络本身是安全的（例如通过使用IPSec），即使如此，也无法控制安全网络上的谁可以访问和获取（读取）此MIB中的对象。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the implementors consider the security features as provided by the SNMPv3 framework. Specifically, the use of the User-based Security Model RFC 2574 [12] and the View-based Access Control Model RFC 2575 [15] is recommended.",
      "zh-CHS": "建议执行者考虑SNMPv3框架提供的安全特性。具体而言，建议使用基于用户的安全模型RFC 2574[12]和基于视图的访问控制模型RFC 2575[15]。"
    },
    {
      "indent": 3,
      "text": "It is then a customer/user responsibility to ensure that the SNMP entity giving access to an instance of this MIB, is properly configured to give access to those objects only to those principals (users) that have legitimate rights to access them.",
      "zh-CHS": "然后，客户/用户有责任确保授予对此MIB实例访问权限的SNMP实体正确配置为仅授予具有合法访问权限的主体（用户）对这些对象的访问权限。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "9. 作者地址"
    },
    {
      "indent": 3,
      "text": "John Flick Hewlett-Packard Company 8000 Foothills Blvd. M/S 5557 Roseville, CA 95747-5557",
      "zh-CHS": "约翰·弗利克惠普公司8000山麓大道。加利福尼亚州罗斯维尔市南5557号，邮编95747-5557"
    },
    {
      "indent": 3,
      "text": "Phone: +1 916 785 4018\nEMail: johnf@rose.hp.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jeffrey Johnson RedBack Networks 2570 North First Street, Suite 410 San Jose, CA, 95131, USA",
      "zh-CHS": "Jeffrey Johnson RedBack Networks美国加利福尼亚州圣何塞市北第一街2570号410室，邮编95131"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 571 2699\nEMail: jeff@redbacknetworks.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "A. Change Log",
      "zh-CHS": "A.更改日志"
    },
    {
      "indent": 0,
      "text": "A.1. Changes since RFC 2358",
      "section_title": true,
      "zh-CHS": "A.1. 自RFC 2358以来的变化"
    },
    {
      "indent": 3,
      "text": "This section enumerates changes made to RFC 2358 to produce this document.",
      "zh-CHS": "本节列举了为编制本文件而对RFC 2358所做的更改。"
    },
    {
      "indent": 7,
      "text": "(1) Section 2 has been replaced with the current SNMP Management Framework boilerplate.",
      "zh-CHS": "(1) 第2节已替换为当前的SNMP管理框架样板。"
    },
    {
      "indent": 7,
      "text": "(2) The ifMtu mapping has been clarified.",
      "zh-CHS": "(2) ifMtu映射已得到澄清。"
    },
    {
      "indent": 7,
      "text": "(3) The relationship between the IEEE 802.3 octet counters and the IF-MIB octet counters has been clarified.",
      "zh-CHS": "(3) IEEE 802.3八位字节计数器和IF-MIB八位字节计数器之间的关系已经澄清。"
    },
    {
      "indent": 7,
      "text": "(4) REFERENCE clauses have been updated to reflect the actual IEEE 802.3 managed object that each MIB object is based on.",
      "zh-CHS": "(4) 参考条款已更新，以反映每个MIB对象所基于的实际IEEE 802.3托管对象。"
    },
    {
      "indent": 7,
      "text": "(5) The following object DESCRIPTION clauses have been updated to reflect that they do not increment in",
      "zh-CHS": "(5) 以下对象描述子句已更新，以反映它们在"
    },
    {
      "indent": 12,
      "text": "full-duplex mode: dot3StatsSingleCollisionFrames, dot3StatsMultipleCollisionFrames, dot3StatsSQETestErrors, dot3StatsDeferredTransmissions, dot3StatsLateCollisions, dot3StatsExcessiveCollisions, dot3StatsCarrierSenseErrors, dot3CollFrequencies.",
      "zh-CHS": "全双工模式：dot3StatsSingleCollisionFrames、dot3StatsMultipleCollisionFrames、Dot3StatsQetesterrors、Dot3StatsFerredTransmissions、Dot3StatsSlateCollisions、Dot3StatsAccessiveCollisions、dot3StatsCarrierSenseErrors、Dot3Collections。"
    },
    {
      "indent": 7,
      "text": "(6) The following object DESCRIPTION clauses have been updated to reflect behaviour on full-duplex and 1000 Mb/s interfaces: dot3StatsAlignmentErrors, dot3StatsFCSErrors, dot3StatsSQETestErrors, dot3StatsLateCollisions, dot3StatsSymbolErrors.",
      "zh-CHS": "(6) 以下对象描述子句已更新，以反映全双工和1000 Mb/s接口上的行为：dot3StatsAlignmentErrors、DOT3STATSFSCSERRORS、DOT3STATSQETERRORS、DOT3STATSSLATECLINSIONS、dot3StatsSymbolErrors。"
    },
    {
      "indent": 7,
      "text": "(7) Two new tables, dot3ControlTable and dot3PauseTable, have been added.",
      "zh-CHS": "(7) 添加了两个新表：dot3ControlTable和DOT3AUSETABLE。"
    },
    {
      "indent": 7,
      "text": "(8) A new object, dot3StatsDuplexStatus, has been added.",
      "zh-CHS": "(8) 添加了一个新对象dot3StatsDuplexStatus。"
    },
    {
      "indent": 7,
      "text": "(9) The object groups and compliances have been restructured.",
      "zh-CHS": "(9) 对象组和合规性已重新调整。"
    },
    {
      "indent": 6,
      "text": "(10) The dot3StatsEtherChipSet object has been deprecated.",
      "zh-CHS": "（10） Dot3StateSetherChipset对象已被弃用。"
    },
    {
      "indent": 6,
      "text": "(11) The dot3ChipSets have been moved to a separate document.",
      "zh-CHS": "（11） Dot3Chipset已移动到单独的文档中。"
    },
    {
      "indent": 0,
      "text": "A.2. Changes between RFC 1650 and RFC 2358",
      "section_title": true,
      "zh-CHS": "A.2. RFC 1650和RFC 2358之间的变化"
    },
    {
      "indent": 3,
      "text": "This section enumerates changes made to RFC 1650 to produce RFC 2358.",
      "zh-CHS": "本节列举了为生成RFC 2358而对RFC 1650所做的更改。"
    },
    {
      "indent": 7,
      "text": "(1) The MODULE-IDENTITY has been updated to reflect the changes in the MIB.",
      "zh-CHS": "(1) 模块标识已更新，以反映MIB中的更改。"
    },
    {
      "indent": 7,
      "text": "(2) A new object, dot3StatsSymbolErrors, has been added.",
      "zh-CHS": "(2) 添加了一个新对象dot3StatssSymbolErrors。"
    },
    {
      "indent": 7,
      "text": "(3) The definition of the object dot3StatsIndex has been converted to use the SMIv2 OBJECT-TYPE macro.",
      "zh-CHS": "(3) 对象dot3StatsIndex的定义已转换为使用SMIv2对象类型宏。"
    },
    {
      "indent": 7,
      "text": "(4) A new conformance group, etherStats100MbsGroup, has been added.",
      "zh-CHS": "(4) 添加了一个新的一致性组EtherstStats100MBsgroup。"
    },
    {
      "indent": 7,
      "text": "(5) A new compliance statement, ether100MbsCompliance, has been added.",
      "zh-CHS": "(5) 添加了新的合规性声明Ether100MBCompliance。"
    },
    {
      "indent": 7,
      "text": "(6) The Acknowledgements were extended to provide a more complete history of the origin of this document.",
      "zh-CHS": "(6) 对确认书进行了扩展，以提供本文件来源的更完整历史。"
    },
    {
      "indent": 7,
      "text": "(7) The discussion of ifType has been expanded.",
      "zh-CHS": "(7) 关于ifType的讨论已经展开。"
    },
    {
      "indent": 7,
      "text": "(8) A section on mapping of Interfaces MIB objects has been added.",
      "zh-CHS": "(8) 增加了一个关于接口MIB对象映射的部分。"
    },
    {
      "indent": 7,
      "text": "(9) A section defining the relationship of this MIB to the MAU MIB has been added.",
      "zh-CHS": "(9) 已添加定义此MIB与MAU MIB关系的部分。"
    },
    {
      "indent": 6,
      "text": "(10) A section on the mapping of IEEE 802.3 managed objects to this MIB and the Interfaces MIB has been added.",
      "zh-CHS": "（10） 增加了一节，介绍IEEE 802.3受管对象到该MIB和接口MIB的映射。"
    },
    {
      "indent": 6,
      "text": "(11) Converted the dot3Tests, dot3Errors, and dot3ChipSets OIDs to use the OBJECT-IDENTITY macro.",
      "zh-CHS": "（11） 已将dot3Tests、dot3Errors和dot3ChipSets OID转换为使用OBJECT-IDENTITY宏。"
    },
    {
      "indent": 6,
      "text": "(12) Added to the list of registered dot3ChipSets.",
      "zh-CHS": "（12） 已添加到已注册的Dot3Chipset列表中。"
    },
    {
      "indent": 6,
      "text": "(13) An intellectual property notice and copyright notice were added, as required by RFC 2026.",
      "zh-CHS": "（13） 根据RFC 2026的要求，增加了知识产权声明和版权声明。"
    },
    {
      "indent": 0,
      "text": "B. Full Copyright Statement",
      "zh-CHS": "B.完整的版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}