{
  "title": {
    "text": "RFC 2247:  Using Domains in LDAP/X.500 Distinguished Names ",
    "zh-CHS": "RFC 2247"
  },
  "number": 2247,
  "created_at": "2021-10-22 12:41:21.598688+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           S. Kille\nRequest for Comments: 2247                                    Isode Ltd.\nCategory: Standards Track                                        M. Wahl\n                                                     Critical Angle Inc.\n                                                             A. Grimstad\n                                                                    AT&T\n                                                                R. Huber\n                                                                    AT&T\n                                                             S. Sataluri\n                                                                    AT&T\n                                                            January 1998",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Using Domains in LDAP/X.500 Distinguished Names",
      "zh-CHS": "使用LDAP/X.500可分辨名称中的域"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1998年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "zh-CHS": "1. 摘要"
    },
    {
      "indent": 3,
      "text": "The Lightweight Directory Access Protocol (LDAP) uses X.500- compatible distinguished names [3] for providing unique identification of entries.",
      "zh-CHS": "轻量级目录访问协议（LDAP）使用X.500兼容的可分辨名称[3]来提供条目的唯一标识。"
    },
    {
      "indent": 3,
      "text": "This document defines an algorithm by which a name registered with the Internet Domain Name Service [2] can be represented as an LDAP distinguished name.",
      "zh-CHS": "本文档定义了一种算法，通过该算法，向Internet域名服务[2]注册的名称可以表示为LDAP可分辨名称。"
    },
    {
      "indent": 0,
      "text": "2. Background",
      "section_title": true,
      "zh-CHS": "2. 出身背景"
    },
    {
      "indent": 3,
      "text": "The Domain (Nameserver) System (DNS) provides a hierarchical resource labeling system. A name is made up of an ordered set of components, each of which are short strings. An example domain name with two components would be \"CRITICAL-ANGLE.COM\".",
      "zh-CHS": "域（名称服务器）系统（DNS）提供了一个分层的资源标签系统。名称由一组有序的组件组成，每个组件都是短字符串。有两个组件的域名示例是“CRITICAL-ANGLE.COM”。"
    },
    {
      "indent": 3,
      "text": "LDAP-based directories provide a more general hierarchical naming framework. A primary difference in specification of distinguished names from domain names is that each component of an distinguished name has an explicit attribute type indication.",
      "zh-CHS": "基于LDAP的目录提供了更通用的分层命名框架。区分名称规范与域名规范的主要区别在于，区分名称的每个组件都有一个明确的属性类型指示。"
    },
    {
      "indent": 3,
      "text": "X.500 does not mandate any particular naming structure. It does contain suggested naming structures which are based on geographic and national regions, however there is not currently an established registration infrastructure in many regions which would be able to assign or ensure uniqueness of names.",
      "zh-CHS": "X.500不要求任何特定的命名结构。它确实包含基于地理区域和国家区域的建议命名结构，但是，目前许多区域还没有能够指定或确保名称唯一性的既定登记基础设施。"
    },
    {
      "indent": 3,
      "text": "The mechanism described in this document automatically provides an enterprise a distinguished name for each domain name it has obtained for use in the Internet. These distinguished names may be used to identify objects in an LDAP directory.",
      "zh-CHS": "本文档中描述的机制会自动为企业提供一个可分辨名称，该名称是企业获得的用于Internet的每个域名的专有名称。这些可分辨名称可用于标识LDAP目录中的对象。"
    },
    {
      "indent": 3,
      "text": "An example distinguished name represented in the LDAP string format [3] is \"DC=CRITICAL-ANGLE,DC=COM\". As with a domain name, the most significant component, closest to the root of the namespace, is written last.",
      "zh-CHS": "LDAP字符串格式[3]中表示的示例可分辨名称是“DC=CRITICAL-ANGLE，DC=COM”。与域名一样，最重要的组件（最接近名称空间的根）最后写入。"
    },
    {
      "indent": 3,
      "text": "This document does not define how to represent objects which do not have domain names. Nor does this document define the procedure to locate an enterprise's LDAP directory server, given their domain name. Such procedures may be defined in future RFCs.",
      "zh-CHS": "本文档不定义如何表示没有域名的对象。本文档也没有定义查找给定域名的企业LDAP目录服务器的过程。此类程序可在未来的RFC中定义。"
    },
    {
      "indent": 0,
      "text": "3. Mapping Domain Names into Distinguished Names",
      "section_title": true,
      "zh-CHS": "3. 将域名映射为可分辨名称"
    },
    {
      "indent": 3,
      "text": "This section defines a subset of the possible distinguished name structures for use in representing names allocated in the Internet Domain Name System. It is possible to algorithmically transform any Internet domain name into a distinguished name, and to convert these distinguished names back into the original domain names.",
      "zh-CHS": "本节定义了可分辨名称结构的子集，用于表示在Internet域名系统中分配的名称。可以通过算法将任何互联网域名转换为可分辨名称，并将这些可分辨名称转换回原始域名。"
    },
    {
      "indent": 3,
      "text": "The algorithm for transforming a domain name is to begin with an empty distinguished name (DN) and then attach Relative Distinguished Names (RDNs) for each component of the domain, most significant (e.g. rightmost) first. Each of these RDNs is a single AttributeTypeAndValue, where the type is the attribute \"DC\" and the value is an IA5 string containing the domain name component.",
      "zh-CHS": "转换域名的算法是以空的可分辨名称（DN）开始，然后为域的每个组件附加相对可分辨名称（RDN），首先是最重要的（例如最右边的）。这些RDN中的每一个都是单个AttributeTypeAndValue，其中类型是属性“DC”，值是包含域名组件的IA5字符串。"
    },
    {
      "indent": 3,
      "text": "Thus the domain name \"CS.UCL.AC.UK\" can be transformed into",
      "zh-CHS": "因此，域名“CS.UCL.AC.UK”可以转换为"
    },
    {
      "indent": 8,
      "text": "DC=CS,DC=UCL,DC=AC,DC=UK",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Distinguished names in which there are one or more RDNs, all containing only the attribute type DC, can be mapped back into domain names. Note that this document does not define a domain name equivalence for any other distinguished names.",
      "zh-CHS": "存在一个或多个RDN的可分辨名称（所有RDN仅包含属性类型DC）可以映射回域名。请注意，本文档没有为任何其他可分辨名称定义域名等效。"
    },
    {
      "indent": 0,
      "text": "4. Attribute Type Definition",
      "section_title": true,
      "zh-CHS": "4. 属性类型定义"
    },
    {
      "indent": 3,
      "text": "The DC (short for domainComponent) attribute type is defined as follows:",
      "zh-CHS": "DC（domainComponent的缩写）属性类型定义如下："
    },
    {
      "indent": 4,
      "text": "( 0.9.2342.19200300.100.1.25 NAME 'dc' EQUALITY caseIgnoreIA5Match SUBSTR caseIgnoreIA5SubstringsMatch SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )",
      "zh-CHS": "（0.9.2342.19200300.100.1.25名称“dc”相等caseIgnoreIA5Match SUBSTR caseIgnoreIA5SubstringsMatch语法1.3.6.1.4.1.1466.115.121.1.26单值）"
    },
    {
      "indent": 3,
      "text": "The value of this attribute is a string holding one component of a domain name. The encoding of IA5String for use in LDAP is simply the characters of the string itself. The equality matching rule is case insensitive, as is today's DNS.",
      "zh-CHS": "此属性的值是一个字符串，其中包含域名的一个组件。LDAP中使用的IA5String的编码只是字符串本身的字符。与今天的DNS一样，相等匹配规则不区分大小写。"
    },
    {
      "indent": 0,
      "text": "5. Object Class Definitions",
      "section_title": true,
      "zh-CHS": "5. 对象类定义"
    },
    {
      "indent": 3,
      "text": "An object with a name derived from its domain name using the algorithm of section 3 is represented as an entry in the directory. The \"DC\" attribute is present in the entry and used as the RDN.",
      "zh-CHS": "使用第3节的算法从其域名派生名称的对象表示为目录中的一个条目。条目中存在“DC”属性，并用作RDN。"
    },
    {
      "indent": 3,
      "text": "An attribute can only be present in an entry held by an LDAP server when that attribute is permitted by the entry's object class.",
      "zh-CHS": "只有当LDAP服务器持有的条目的对象类允许该属性时，该属性才能出现在该条目中。"
    },
    {
      "indent": 3,
      "text": "This section defines two object classes. The first, dcObject, is intended to be used in entries for which there is an appropriate structural object class. For example, if the domain represents a particular organization, the entry would have as its structural object class 'organization', and the 'dcObject' class would be an auxiliary class. The second, domain, is a structural object class used for entries in which no other information is being stored. The domain object class is typically used for entries that are placeholders or whose domains do not correspond to real-world entities.",
      "zh-CHS": "本节定义了两个对象类。第一个是dcObject，用于有适当结构对象类的条目中。例如，如果域表示一个特定的组织，则条目将具有作为其结构对象类的“organization”，而“Dobject”类将是一个辅助类。第二个域是一个结构对象类，用于不存储其他信息的条目。域对象类通常用于作为占位符或其域与实际实体不对应的条目。"
    },
    {
      "indent": 0,
      "text": "5.1. The dcObject object class",
      "section_title": true,
      "zh-CHS": "5.1. dcObject对象类"
    },
    {
      "indent": 3,
      "text": "The dcObject object class permits the dc attribute to be present in an entry. This object class is defined as auxiliary, as it would typically be used in conjunction with an existing structural object class, such as organization, organizationalUnit or locality.",
      "zh-CHS": "dcObject对象类允许dc属性出现在条目中。该对象类被定义为辅助对象，因为它通常与现有的结构对象类（如organization、organizationalUnit或Location）结合使用。"
    },
    {
      "indent": 3,
      "text": "The following object class, along with the dc attribute, can be added to any entry.",
      "zh-CHS": "以下对象类以及dc属性可以添加到任何条目中。"
    },
    {
      "indent": 3,
      "text": "( 1.3.6.1.4.1.1466.344 NAME 'dcObject' SUP top AUXILIARY MUST dc )",
      "zh-CHS": "（1.3.6.1.4.1.1466.344名称“dcObject”辅助必须为dc）"
    },
    {
      "indent": 3,
      "text": "An example entry would be:",
      "zh-CHS": "一个例子是："
    },
    {
      "indent": 3,
      "text": "dn: dc=critical-angle,dc=com objectClass: top objectClass: organization objectClass: dcObject dc: critical-angle o: Critical Angle Inc.",
      "zh-CHS": "dn:dc=临界角度，dc=com对象类：顶级对象类：组织对象类：dcObject dc:临界角度o:临界角度公司。"
    },
    {
      "indent": 0,
      "text": "5.2. The domain object class",
      "section_title": true,
      "zh-CHS": "5.2. 域对象类"
    },
    {
      "indent": 3,
      "text": "If the entry does not correspond to an organization, organizational unit or other type of object for which an object class has been defined, then the \"domain\" object class can be used. The \"domain\" object class requires that the \"DC\" attribute be present, and permits several other attributes to be present in the entry.",
      "zh-CHS": "如果条目与已定义对象类的组织、组织单位或其他类型的对象不对应，则可以使用“域”对象类。“域”对象类要求“DC”属性存在，并允许条目中存在其他几个属性。"
    },
    {
      "indent": 3,
      "text": "The entry will have as its structural object class the \"domain\" object class.",
      "zh-CHS": "条目的结构对象类为“域”对象类。"
    },
    {
      "indent": 0,
      "text": "( 0.9.2342.19200300.100.4.13 NAME 'domain' SUP top STRUCTURAL MUST dc MAY ( userPassword $ searchGuide $ seeAlso $ businessCategory $ x121Address $ registeredAddress $ destinationIndicator $ preferredDeliveryMethod $ telexNumber $ teletexTerminalIdentifier $ telephoneNumber $ internationaliSDNNumber $ facsimileTelephoneNumber $ street $ postOfficeBox $ postalCode $ postalAddress $ physicalDeliveryOfficeName $ st $ l $ description $ o $ associatedName ) )",
      "zh-CHS": "（0.9.2342.19200300.100.4.13名称“域”辅助结构必须为dc-MAY（用户密码$searchGuide$另请参见$businessCategory$X121地址$registeredAddress$destinationIndicator$preferredDeliveryMethod$telexNumber$teletexTerminalIdentifier$telephoneNumber$internationaliSDNNumber$facsimileTelephoneNumber$street$postOfficeBox$postalCode$postalAddress$physicalDeliveryOfficeName$st$l$d说明$o$associatedName）"
    },
    {
      "indent": 3,
      "text": "The optional attributes of the domain class are used for describing the object represented by this domain, and may also be useful when searching. These attributes are already defined for use with LDAP [4].",
      "zh-CHS": "域类的可选属性用于描述由该域表示的对象，在搜索时也可能有用。这些属性已定义为与LDAP一起使用[4]。"
    },
    {
      "indent": 3,
      "text": "An example entry would be:",
      "zh-CHS": "一个例子是："
    },
    {
      "indent": 3,
      "text": "dn: dc=tcp,dc=critical-angle,dc=com\nobjectClass: top\nobjectClass: domain\ndc: tcp\ndescription: a placeholder entry used with SRV records",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The DC attribute is used for naming entries of the domain class, and this can be represented in X.500 servers by the following name form rule.",
      "zh-CHS": "DC属性用于命名域类的条目，这可以在X.500服务器中通过以下名称形式规则表示。"
    },
    {
      "indent": 4,
      "text": "( 1.3.6.1.4.1.1466.345 NAME 'domainNameForm' OC domain MUST ( dc ) )",
      "zh-CHS": "（1.3.6.1.4.1.1466.345名称'domainNameForm'OC域必须（dc））"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] The Directory: Selected Attribute Types. ITU-T Recommendation X.520, 1993.",
      "zh-CHS": "[1] 目录：选定的属性类型。ITU-T建议X.520，1993年。"
    },
    {
      "indent": 3,
      "text": "[2] Mockapetris, P., \" Domain Names - Concepts and Facilities,\" STD 13, RFC 1034, November 1987.",
      "zh-CHS": "[2] Mockapetris，P.，“域名-概念和设施”，STD 13，RFC 1034，1987年11月。"
    },
    {
      "indent": 3,
      "text": "[3] Kille, S., and M. Wahl, \" Lightweight Directory Access Protocol (v3): UTF-8 String Representation of Distinguished Names\", RFC 2253, December 1997.",
      "zh-CHS": "[3] Kille，S.和M.Wahl，“轻量级目录访问协议（v3）：可分辨名称的UTF-8字符串表示”，RFC 2253，1997年12月。"
    },
    {
      "indent": 3,
      "text": "[4] Wahl, M., \"A Summary of the X.500(96) User Schema for use with LDAP\", RFC 2256, December 1997.",
      "zh-CHS": "[4] Wahl，M.，“用于LDAP的X.500（96）用户模式摘要”，RFC 2256，1997年12月。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This memo describes how attributes of objects may be discovered and retrieved. Servers should ensure that an appropriate security policy is maintained.",
      "zh-CHS": "本备忘录描述了如何发现和检索对象的属性。服务器应确保维护适当的安全策略。"
    },
    {
      "indent": 3,
      "text": "An enterprise is not restricted in the information which it may store in DNS or LDAP servers. A client which contacts an untrusted server may have incorrect or misleading information returned (e.g. an organization's server may claim to hold naming contexts representing domain names which have not been delegated to that organization).",
      "zh-CHS": "企业可能存储在DNS或LDAP服务器中的信息不受限制。与不受信任的服务器联系的客户端可能返回了错误或误导性的信息（例如，组织的服务器可能声称拥有表示未委托给该组织的域名的命名上下文）。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "8. 作者地址"
    },
    {
      "indent": 3,
      "text": "Steve Kille Isode Ltd. The Dome The Square Richmond, Surrey TW9 1DT England",
      "zh-CHS": "Steve Kille Isode有限公司位于英格兰萨里郡里士满广场的圆顶"
    },
    {
      "indent": 3,
      "text": "Phone:  +44-181-332-9091\nEMail:  S.Kille@ISODE.COM",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mark Wahl Critical Angle Inc. 4815 W. Braker Lane #502-385 Austin, TX 78759 USA",
      "zh-CHS": "马克·瓦尔临界角公司，美国德克萨斯州奥斯汀市布雷克巷西4815号，502-385号，邮编78759"
    },
    {
      "indent": 3,
      "text": "Phone: (1) 512 372 3160 EMail: M.Wahl@critical-angle.com",
      "zh-CHS": "电话：（1）5123723160电邮：M。Wahl@critical-angle.com"
    },
    {
      "indent": 3,
      "text": "Al Grimstad AT&T Room 1C-429, 101 Crawfords Corner Road Holmdel, NJ 07733-3030 USA",
      "zh-CHS": "美国新泽西州霍姆德尔克劳福德角路101号阿尔·格里姆斯塔德电话电报公司1C-429室，邮编：07733-3030"
    },
    {
      "indent": 3,
      "text": "EMail: alg@att.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Rick Huber AT&T Room 1B-433, 101 Crawfords Corner Road Holmdel, NJ 07733-3030 USA",
      "zh-CHS": "Rick Huber美国新泽西州霍姆德尔克劳福德角路101号电话电报室1B-433 07733-3030"
    },
    {
      "indent": 3,
      "text": "EMail: rvh@att.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Sri Sataluri AT&T Room 4G-202, 101 Crawfords Corner Road Holmdel, NJ 07733-3030 USA",
      "zh-CHS": "Sri Sataluri AT&T美国新泽西州霍姆德尔克劳福德角路101号4G-202室07733-3030"
    },
    {
      "indent": 3,
      "text": "EMail: sri@att.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "9. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1998年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    }
  ]
}