{
  "title": {
    "text": "RFC 2606:  Reserved Top Level DNS Names ",
    "zh-CHS": "RFC 2606"
  },
  "number": 2606,
  "created_at": "2021-10-23 20:34:28.640495+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     D. Eastlake\nRequest for Comments: 2606                                  A. Panitz\nBCP: 32                                                     June 1999\nCategory: Best Current Practice",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "Reserved Top Level DNS Names",
      "zh-CHS": "保留顶级DNS名称"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "To reduce the likelihood of conflict and confusion, a few top level domain names are reserved for use in private testing, as examples in documentation, and the like. In addition, a few second level domain names reserved for use as examples are documented.",
      "zh-CHS": "为了减少冲突和混淆的可能性，保留了一些顶级域名，以便在私人测试中使用，例如文档中的示例等。此外，还记录了一些保留用作示例的二级域名。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction............................................1\n2. TLDs for Testing, & Documentation Examples..............2\n3. Reserved Example Second Level Domain Names..............2\n4. IANA Considerations.....................................3\n5. Security Considerations.................................3\nReferences.................................................3\nAuthors' Addresses.........................................4\nFull Copyright Statement...................................5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The global Internet Domain Name System is documented in [RFC 1034, 1035, 1591] and numerous additional Requests for Comment. It defines a tree of names starting with root, \".\", immediately below which are top level domain names such as \".com\" and \".us\". Below top level domain names there are normally additional levels of names.",
      "zh-CHS": "全球互联网域名系统记录在[RFC 1034、1035、1591]和许多其他评论请求中。它定义了一个以根“.”开头的名称树，紧接着是顶级域名，如“.com”和“.us”。在顶级域名下面通常还有其他级别的域名。"
    },
    {
      "indent": 0,
      "text": "2. TLDs for Testing, & Documentation Examples",
      "section_title": true,
      "zh-CHS": "2. 测试和文档示例的TLD"
    },
    {
      "indent": 3,
      "text": "There is a need for top level domain (TLD) names that can be used for creating names which, without fear of conflicts with current or future actual TLD names in the global DNS, can be used for private testing of existing DNS related code, examples in documentation, DNS related experimentation, invalid DNS names, or other similar uses.",
      "zh-CHS": "需要可用于创建名称的顶级域名（TLD），而无需担心与全局DNS中当前或未来的实际TLD名称冲突，可用于现有DNS相关代码的私人测试、文档中的示例、DNS相关实验、无效DNS名称或其他类似用途。"
    },
    {
      "indent": 3,
      "text": "For example, without guidance, a site might set up some local additional unused top level domains for testing of its local DNS code and configuration. Later, these TLDs might come into actual use on the global Internet. As a result, local attempts to reference the real data in these zones could be thwarted by the local test versions. Or test or example code might be written that accesses a TLD that is in use with the thought that the test code would only be run in a restricted testbed net or the example never actually run. Later, the test code could escape from the testbed or the example be actually coded and run on the Internet. Depending on the nature of the test or example, it might be best for it to be referencing a TLD permanently reserved for such purposes.",
      "zh-CHS": "例如，如果没有指导，站点可能会设置一些本地其他未使用的顶级域，以测试其本地DNS代码和配置。稍后，这些TLD可能会在全球互联网上实际使用。因此，本地测试版本可能会阻止本地尝试引用这些区域中的真实数据。或者，编写的测试或示例代码可能访问正在使用的TLD，并认为测试代码只能在受限的测试床网络中运行，或者示例从未实际运行。稍后，测试代码可以从测试床中转义出来，或者示例可以实际编码并在Internet上运行。根据测试或示例的性质，最好是引用为此类目的而永久保留的TLD。"
    },
    {
      "indent": 3,
      "text": "To safely satisfy these needs, four domain names are reserved as listed and described below.",
      "zh-CHS": "为了安全地满足这些需求，保留了四个域名，如下所列和所述。"
    },
    {
      "indent": 14,
      "text": " .test .example .invalid .localhost",
      "zh-CHS": ".test.example.invalid.localhost"
    },
    {
      "indent": 6,
      "text": "\".test\" is recommended for use in testing of current or new DNS related code.",
      "zh-CHS": "建议在测试当前或新的DNS相关代码时使用“.test”。"
    },
    {
      "indent": 6,
      "text": "\".example\" is recommended for use in documentation or as examples.",
      "zh-CHS": "建议在文档中或作为示例使用“.example”。"
    },
    {
      "indent": 6,
      "text": "\".invalid\" is intended for use in online construction of domain names that are sure to be invalid and which it is obvious at a glance are invalid.",
      "zh-CHS": "“.invalid”用于在线构造肯定无效且一目了然无效的域名。"
    },
    {
      "indent": 6,
      "text": "The \".localhost\" TLD has traditionally been statically defined in host DNS implementations as having an A record pointing to the loop back IP address and is reserved for such use. Any other use would conflict with widely deployed code which assumes this use.",
      "zh-CHS": "在主机DNS实现中，“.localhost”TLD传统上被静态定义为具有指向环回IP地址的A记录，并保留供此类使用。任何其他用途都会与广泛部署的代码相冲突，这些代码假定使用此用途。"
    },
    {
      "indent": 0,
      "text": "3. Reserved Example Second Level Domain Names",
      "section_title": true,
      "zh-CHS": "3. 保留示例二级域名"
    },
    {
      "indent": 3,
      "text": "The Internet Assigned Numbers Authority (IANA) also currently has the following second level domain names reserved which can be used as examples.",
      "zh-CHS": "互联网分配号码管理局（IANA）目前还保留了以下二级域名，可作为示例。"
    },
    {
      "indent": 8,
      "text": "example.com example.net example.org",
      "zh-CHS": "example.com example.net example.org"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has agreed to the four top level domain name reservations specified in this document and will reserve them for the uses indicated.",
      "zh-CHS": "IANA已同意本文件中规定的四个顶级域名保留，并将保留它们用于指定用途。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Confusion and conflict can be caused by the use of a current or future top level domain name in experimentation or testing, as an example in documentation, to indicate invalid names, or as a synonym for the loop back address. Test and experimental software can escape and end up being run against the global operational DNS. Even examples used \"only\" in documentation can end up being coded and released or cause conflicts due to later real use and the possible acquisition of intellectual property rights in such \"example\" names.",
      "zh-CHS": "在实验或测试中使用当前或将来的顶级域名（如文档中的示例）来指示无效名称或作为回送地址的同义词，可能会导致混淆和冲突。测试和实验软件可以逃逸，并最终针对全局操作DNS运行。即使是文档中“仅”使用的示例，也可能最终被编码和发布，或者由于以后的实际使用以及可能获得此类“示例”名称的知识产权而导致冲突。"
    },
    {
      "indent": 3,
      "text": "The reservation of several top level domain names for these purposes will minimize such confusion and conflict.",
      "zh-CHS": "为这些目的保留几个顶级域名将最大限度地减少这种混乱和冲突。"
    },
    {
      "indent": 0,
      "text": "References",
      "zh-CHS": "工具书类"
    },
    {
      "indent": 3,
      "text": "[RFC 1034] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, November 1987.",
      "zh-CHS": "[RFC 1034]Mockapetris，P.，“域名-概念和设施”，STD 13，RFC 1034，1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC 1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, November 1987.",
      "zh-CHS": "[RFC 1035]Mockapetris，P.，“域名-实现和规范”，STD 13，RFC 1035，1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC 1591] Postel, J., \"Domain Name System Structure and Delegation\", RFC 1591, March 1994.",
      "zh-CHS": "[RFC 1591]Postel，J.，“域名系统结构和授权”，RFC 15911994年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Donald E. Eastlake 3rd IBM 65 Shindegan Hill Road, RR #1 Carmel, NY 10512",
      "zh-CHS": "纽约州卡梅尔市新德干山路65号东湖第三IBM公司，邮编10512"
    },
    {
      "indent": 3,
      "text": "Phone: +1 914-276-1668(h)\n       +1 914-784-7913(w)\nFAX:   +1 914-784-3833(3)\nEMail: dee3@us.ibm.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Aliza R. Panitz 500 Stamford Dr. No. 310 Newark, DE 19711 USA",
      "zh-CHS": "Aliza R.Panitz 500斯坦福德310号博士，美国德19711纽瓦克"
    },
    {
      "indent": 3,
      "text": "Phone: +1 302-738-1554\nEMail: buglady@fuschia.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}