{
  "title": {
    "text": "RFC 2954:  Definitions of Managed Objects for Frame Relay Service ",
    "zh-CHS": "RFC 2954"
  },
  "number": 2954,
  "created_at": "2021-10-25 03:28:04.627029+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        K. Rehbehn\nRequest for Comments: 2954                              Megisto Systems\nObsoletes: 1604                                               D. Fowler\nCategory: Standards Track                              Syndesis Limited\n                                                           October 2000",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "Definitions of Managed Objects for Frame Relay Service",
      "zh-CHS": "帧中继服务的托管对象定义"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines an extension to the Management Information Base (MIB) for use with network management protocols in Transmission Control Protocol/Internet Protocol-based (TCP/IP) internets. In particular, it defines objects for managing the frame relay service.",
      "zh-CHS": "本备忘录定义了管理信息库（MIB）的扩展，用于传输控制协议/基于Internet协议（TCP/IP）的Internet中的网络管理协议。特别是，它定义了用于管理帧中继服务的对象。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 1604.",
      "zh-CHS": "本文件废除了RFC 1604。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1 The SNMP Management Framework ................................   2\n2 Overview .....................................................   3\n2.1 Scope of MIB ...............................................   3\n2.2 Transiting Multiple Frame Relay Networks ...................   5\n2.3 Access Control .............................................   5\n2.4 Frame Relay Service MIB Terminology ........................   6\n2.5 Relation to Other MIBs .....................................   8\n2.5.1 System Group .............................................   8\n2.5.2 Interfaces Table (ifTable, ifXtable) .....................   8\n2.5.3 Stack Table for DS1/E1 Environment .......................  12\n2.5.4 Stack Table for V.35 Environments ........................  14\n2.5.5 The Frame Relay/ATM PVC Service Interworking MIB .........  14\n2.6 Textual Convention Change ..................................  15\n3 Object Definitions ...........................................  15\n3.1 The Frame Relay Service Logical Port .......................  17",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "3.2 Frame Relay Management VC Signaling ........................  22\n3.3 Frame Relay PVC End-Points .................................  32\n3.4 Frame Relay PVC Connections ................................  45\n3.5 Frame Relay Accounting .....................................  53\n3.6 Frame Relay Network Service Notifications ..................  56\n3.7 Conformance Information ....................................  57\n4 Acknowledgments ..............................................  67\n5 References ...................................................  67\n6 Security Considerations ......................................  69\n7 Authors' Addresses ...........................................  70\nAPPENDIX A Update Information ..................................  71\nIntellectual Property Rights ...................................  75\nFull Copyright Statement .......................................  76",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. The SNMP Management Framework",
      "section_title": true,
      "zh-CHS": "1. SNMP管理框架"
    },
    {
      "indent": 3,
      "text": "The SNMP Management Framework presently consists of five major components:",
      "zh-CHS": "SNMP管理框架目前由五个主要组件组成："
    },
    {
      "indent": 3,
      "text": "o An overall architecture, described in RFC 2571 [1].",
      "zh-CHS": "o RFC 2571[1]中描述的总体架构。"
    },
    {
      "indent": 3,
      "text": "o Mechanisms for describing and naming objects and events for the purpose of management. The first version of this Structure of Management Information (SMI) is called SMIv1 and described in STD 16, RFC 1155 [2], STD 16, RFC 1212 [3] and RFC 1215 [4]. The second version, called SMIv2, is described in STD 58, RFC 2578 [5], STD 58, RFC 2579 [6] and STD 58, RFC 2580 [7].",
      "zh-CHS": "o 为管理目的描述和命名对象和事件的机制。这种管理信息结构（SMI）的第一个版本称为SMIv1，并在STD 16、RFC 1155[2]、STD 16、RFC 1212[3]和RFC 1215[4]中进行了描述。第二个版本称为SMIv2，在STD 58、RFC 2578[5]、STD 58、RFC 2579[6]和STD 58、RFC 2580[7]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Message protocols for transferring management information. The first version of the SNMP message protocol is called SNMPv1 and described in STD 15, RFC 1157 [8]. A second version of the SNMP message protocol, which is not an Internet standards track protocol, is called SNMPv2c and described in RFC 1901 [9] and RFC 1906 [10]. The third version of the message protocol is called SNMPv3 and described in RFC 1906 [10], RFC 2572 [11] and RFC 2574 [12].",
      "zh-CHS": "o 用于传输管理信息的消息协议。SNMP消息协议的第一个版本称为SNMPv1，在STD 15、RFC 1157[8]中进行了描述。SNMP消息协议的第二个版本不是互联网标准跟踪协议，称为SNMPv2c，在RFC 1901[9]和RFC 1906[10]中进行了描述。消息协议的第三个版本称为SNMPv3，在RFC 1906[10]、RFC 2572[11]和RFC 2574[12]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Protocol operations for accessing management information. The first set of protocol operations and associated PDU formats is described in STD 15, RFC 1157 [8]. A second set of protocol operations and associated PDU formats is described in RFC 1905 [13].",
      "zh-CHS": "o 访问管理信息的协议操作。STD 15、RFC 1157[8]中描述了第一组协议操作和相关PDU格式。RFC 1905[13]中描述了第二组协议操作和相关PDU格式。"
    },
    {
      "indent": 3,
      "text": "o A set of fundamental applications described in RFC 2573 [14] and the view-based access control mechanism described in RFC 2575 [15].",
      "zh-CHS": "o RFC 2573[14]中描述的一组基本应用程序和RFC 2575[15]中描述的基于视图的访问控制机制。"
    },
    {
      "indent": 3,
      "text": "A more detailed introduction to the current SNMP Management Framework can be found in RFC 2570 [16].",
      "zh-CHS": "有关当前SNMP管理框架的更详细介绍，请参见RFC 2570[16]。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. Objects in the MIB are defined using the mechanisms defined in the SMI.",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB中的对象是使用SMI中定义的机制定义的。"
    },
    {
      "indent": 3,
      "text": "This memo specifies a MIB module that is compliant to the SMIv2. A MIB conforming to the SMIv1 can be produced through the appropriate translations. The resulting translated MIB must be semantically equivalent, except where objects or events are omitted because no translation is possible (use of Counter64). Some machine readable information in SMIv2 will be converted into textual descriptions in SMIv1 during the translation process. However, this loss of machine readable information is not considered to change the semantics of the MIB.",
      "zh-CHS": "此备忘录指定了符合SMIv2的MIB模块。通过适当的翻译，可以生成符合SMIv1的MIB。生成的已翻译MIB必须在语义上等效，除非由于无法翻译而省略了对象或事件（使用计数器64）。在翻译过程中，SMIv2中的一些机器可读信息将转换为SMIv1中的文本描述。但是，这种机器可读信息的丢失不被认为会改变MIB的语义。"
    },
    {
      "indent": 0,
      "text": "2. Overview",
      "section_title": true,
      "zh-CHS": "2. 概述"
    },
    {
      "indent": 3,
      "text": "These objects are used to manage a frame relay Service. At present, this applies to the following value of the ifType variable in the IF-MIB [26]:",
      "zh-CHS": "这些对象用于管理帧中继服务。目前，这适用于IF-MIB[26]中ifType变量的以下值："
    },
    {
      "indent": 8,
      "text": "frameRelayService (44)",
      "zh-CHS": "帧中继服务（44）"
    },
    {
      "indent": 3,
      "text": "This section provides an overview and background of how to use this MIB and other potential MIBs to manage a frame relay service.",
      "zh-CHS": "本节提供如何使用此MIB和其他潜在MIB来管理帧中继服务的概述和背景。"
    },
    {
      "indent": 0,
      "text": "2.1. Scope of MIB",
      "section_title": true,
      "zh-CHS": "2.1. MIB的范围"
    },
    {
      "indent": 3,
      "text": "The Frame Relay Service MIB supports Customer Network Management (CNM) of a frame relay network service. Through the use of this and other related MIBs, a frame relay service customer's NMS can monitor the customer's UNI/NNI logical ports and PVCs. It provides customers with access to configuration data, performance monitoring information, and fault detection for the delivered frame relay service. As an option, an SNMP agent supporting the Frame Relay Service MIB may allow customer-initiated PVC management operations such as creation, deletion, modification, activation, and deactivation of individual PVCs. However, internal aspects of the network (e.g., switching elements, line cards, and network routing tables) are beyond the scope of this MIB.",
      "zh-CHS": "帧中继服务MIB支持帧中继网络服务的客户网络管理（CNM）。通过使用此MIB和其他相关MIB，帧中继服务客户的NMS可以监视客户的UNI/NNI逻辑端口和PVC。它为客户提供了对配置数据、性能监控信息和所交付帧中继服务的故障检测的访问。作为一个选项，支持帧中继服务MIB的SNMP代理可以允许客户发起的PVC管理操作，例如单个PVC的创建、删除、修改、激活和停用。但是，网络的内部方面（例如，交换元件、线路卡和网络路由表）超出了本MIB的范围。"
    },
    {
      "indent": 3,
      "text": "The Frame Relay Service MIB models all interfaces and PVCs delivered by a frame relay service within a single virtual SNMP system for the purpose of comprehensively representing the customer's frame relay service. The customer's interfaces and PVCs may physically exist on one or more devices within the network topology. An SNMP agent",
      "zh-CHS": "帧中继服务MIB对单个虚拟SNMP系统中的帧中继服务提供的所有接口和PVC进行建模，以全面表示客户的帧中继服务。客户的接口和PVC可能实际存在于网络拓扑中的一个或多个设备上。SNMP代理"
    },
    {
      "indent": 3,
      "text": "providing support for the Frame Relay Service MIB as well as other appropriate MIBs to model a single virtual frame relay network service is referred to as a Frame Relay Service (FRS) agent. Internal communication mechanisms between the FRS agent and individual devices within the frame relay network delivering the service are implementation specific and beyond the scope of this MIB.",
      "zh-CHS": "为帧中继服务MIB以及其他适当的MIB提供支持以对单个虚拟帧中继网络服务进行建模被称为帧中继服务（FRS）代理。FRS代理和帧中继网络内提供服务的各个设备之间的内部通信机制是特定于实现的，超出了本MIB的范围。"
    },
    {
      "indent": 3,
      "text": "The customer's NMS will typically access the SNMP agent implementing the Frame Relay Service MIB over a frame relay permanent virtual connection (PVC). SNMP access over a frame relay PVC is achieved through the use of SNMP over UDP over IP encapsulated in Frame Relay according to STD 55, RFC2427 and ITU X.36 Annex D [23]. Alternate access mechanisms and SNMP agent implementations are possible.",
      "zh-CHS": "客户的NMS通常通过帧中继永久虚拟连接（PVC）访问实现帧中继服务MIB的SNMP代理。根据STD 55、RFC2427和ITU X.36附录D[23]，通过使用封装在帧中继中的IP UDP上的SNMP通过帧中继PVC实现SNMP访问。可以使用其他访问机制和SNMP代理实现。"
    },
    {
      "indent": 3,
      "text": "This MIB will NOT be implemented on user equipment (e.g., DTE). Such devices are managed using the Frame Relay DTE MIB (RFC2115[18]). However, concentrators may use the Frame Relay Service MIB instead of the Frame Relay DTE MIB.",
      "zh-CHS": "此MIB不会在用户设备（如DTE）上实施。此类设备使用帧中继DTE MIB（RFC2115[18]）进行管理。然而，集中器可以使用帧中继服务MIB而不是帧中继DTE MIB。"
    },
    {
      "indent": 3,
      "text": "This MIB does not define managed objects for the physical layer. Existing physical layer MIBs (e.g., DS1 MIB) and Interface MIB will be used as needed in FRS Agent implementations.",
      "zh-CHS": "此MIB不为物理层定义托管对象。现有的物理层MIB（例如DS1 MIB）和接口MIB将根据需要在FRS代理实现中使用。"
    },
    {
      "indent": 3,
      "text": "This MIB supports frame relay PVCs. This MIB may be extended at a later time to handle frame relay SVCs.",
      "zh-CHS": "此MIB支持帧中继PVC。该MIB可在以后扩展以处理帧中继SVC。"
    },
    {
      "indent": 3,
      "text": "A switch implementation may support this MIB for the purpose of configuration and control of the frame relay service beyond the scope of traditional customer network management applications. A number of objects (e.g. frLportTypeAdmin) support administrative actions that impact the operation of frame relay switch equipment in the network. This is reflected in the differences between the two MIB compliance modules:",
      "zh-CHS": "交换机实现可以支持该MIB，以便在传统客户网络管理应用程序的范围之外配置和控制帧中继服务。许多对象（如frLportTypeAdmin）支持影响网络中帧中继交换机设备运行的管理操作。这反映在两个MIB合规性模块之间的差异中："
    },
    {
      "indent": 6,
      "text": "o the frame relay service compliance module (frnetservCompliance), and",
      "zh-CHS": "o 帧中继服务符合性模块（frnetservCompliance），以及"
    },
    {
      "indent": 6,
      "text": "o the frame relay switch compliance module (frnetSwitchCompliance).",
      "zh-CHS": "o 帧中继开关符合性模块（frnetSwitchCompliance）。"
    },
    {
      "indent": 3,
      "text": "The frame relay service compliance module does not support the administrative control objects used for switch management.",
      "zh-CHS": "帧中继服务符合性模块不支持用于交换机管理的管理控制对象。"
    },
    {
      "indent": 0,
      "text": "2.2. Transiting Multiple Frame Relay Networks",
      "section_title": true,
      "zh-CHS": "2.2. 传输多帧中继网络"
    },
    {
      "indent": 3,
      "text": "This MIB is only used to manage a single frame relay service offering from one network service provider. Therefore, if a customer PVC traverses multiple networks, then the customer must poll a different FRS agent within each frame relay network to retrieve the end-to-end view of service.",
      "zh-CHS": "此MIB仅用于管理一个网络服务提供商提供的单帧中继服务。因此，如果客户PVC穿越多个网络，则客户必须在每个帧中继网络内轮询不同的FRS代理，以检索服务的端到端视图。"
    },
    {
      "indent": 3,
      "text": "Figure 1 illustrates a customer (\"User B\") NMS accessing FRS agents in three different frame relay networks (I, J, and K).",
      "zh-CHS": "图1说明了在三个不同的帧中继网络（I、J和K）中访问FRS代理的客户（“用户B”）NMS。"
    },
    {
      "indent": 0,
      "text": "                +-------------------------------------+\n                | Customer Network Management Station |\n                |            (SNMP based)             |\n                +-------------------------------------+\n                    ^              ^               ^\n                    |              |               |\n                    |              |               |\n           UNI      |      NNI     |       NNI     |       UNI\n            |       ^       |      ^        |      ^\n            | +-----------+ | +-----------+ | +-----------+ |\n            | |           | | |           | | |           | |\nOriginating | |   FR      | | |   FR      | | |   FR      | |Terminating\n +--------+ | | Network I | | | Network J | | | Network K | | +--------+\n |        | | |           | | |           | | |           | | |        |\n |        |---|           |---|           |---|           |---| User B |\n |        | | |           | | |           | | |           | | |        |\n |     ////////////////////////////////////////////////////////////    |\n |        | | |           | | |           | | |           | | |        |\n +--------+ | +-----------+ | +-----------+ | +-----------+ | +--------+\n            |               |               |               |\n            |               |               |               |\n            | PVC Segment 1 | PVC Segment 2 | PVC Segment 3 |\n            |<------------->|<------------->|<------------->|\n            |                                               |\n            |              Multi-network PVC                |\n            |<--------------------------------------------->|\n            |  NNI = Network-to Network Interface           |\n               UNI = User-to-Network Interface",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Figure 1, Multi-network PVC",
      "zh-CHS": "图1，多网络PVC"
    },
    {
      "indent": 0,
      "text": "2.3. Access Control",
      "section_title": true,
      "zh-CHS": "2.3. 访问控制"
    },
    {
      "indent": 3,
      "text": "A frame relay network is shared amongst many frame relay subscribers. Each subscriber will only have access to their information (e.g., information with respect to their interfaces and PVCs). The FRS agent should provide instance level granularity for MIB views.",
      "zh-CHS": "帧中继网络在许多帧中继用户之间共享。每个订户只能访问其信息（例如，有关其接口和PVC的信息）。FRS代理应该为MIB视图提供实例级粒度。"
    },
    {
      "indent": 0,
      "text": "2.4. Frame Relay Service MIB Terminology",
      "section_title": true,
      "zh-CHS": "2.4. 帧中继服务MIB术语"
    },
    {
      "indent": 3,
      "text": "Access Channel - An access channel generically refers to the DS1/E1 or DS3/E3-based UNI access channel or NNI access channel across which frame relay data transits. An access channel is the access pathway for a single stream of user data.",
      "zh-CHS": "接入信道-接入信道通常指帧中继数据传输所经过的基于DS1/E1或DS3/E3的UNI接入信道或NNI接入信道。访问通道是单个用户数据流的访问路径。"
    },
    {
      "indent": 3,
      "text": "Within a given DS1 line, an access channel can denote any one of the following:",
      "zh-CHS": "在给定的DS1线路内，接入信道可以表示以下任一项："
    },
    {
      "indent": 3,
      "text": "o Unchannelized DS1 - the entire DS1 line is considered an access channel. Each access channel is comprised of 24 DS0 time slots.",
      "zh-CHS": "o 未经退火的DS1-整个DS1线路被视为接入信道。每个接入通道由24个DS0时隙组成。"
    },
    {
      "indent": 3,
      "text": "o Channelized DS1 - an access channel is any one of 24 channels. Each access channel is comprised of a single DS0 time slot.",
      "zh-CHS": "o 信道化DS1-接入信道是24个信道中的任意一个。每个访问通道由单个DS0时隙组成。"
    },
    {
      "indent": 3,
      "text": "o Fractional DS1 - an access channel is a grouping of NxDS0 time slots (NX56/64 Kbps, where N = 1-23 DS0 Time slots per Fractional DS1 Access Channel) that may be assigned in consecutive or non-consecutive order.",
      "zh-CHS": "o 分数DS1-接入信道是一组NxDS0时隙（NX56/64 Kbps，其中每个分数DS1接入信道N=1-23个DS0时隙），可按连续或非连续顺序分配。"
    },
    {
      "indent": 3,
      "text": "Within a given E1 line, a channel can denote any one of the following:",
      "zh-CHS": "在给定的E1线路内，信道可以表示以下任一项："
    },
    {
      "indent": 3,
      "text": "o Unchannelized E1 - the entire E1 line is considered a single access channel. Each access channel is comprised of 31 E1 time slots.",
      "zh-CHS": "o 未经退火的E1-整个E1线路被视为单个接入信道。每个接入信道由31个E1时隙组成。"
    },
    {
      "indent": 3,
      "text": "o Channelized E1 - an access channel is any one of 31 channels. Each access channel is comprised of a single E1 time slot.",
      "zh-CHS": "o 信道化E1-接入信道是31个信道中的任意一个。每个接入信道由单个E1时隙组成。"
    },
    {
      "indent": 3,
      "text": "o Fractional E1 - an access channel is a grouping of N E1 time slots (NX64 Kbps, where N = 1-30 E1 time slots per FE1 access channel) that may be assigned in consecutive or non-consecutive order.",
      "zh-CHS": "o 分数E1-接入信道是N个E1时隙（NX64 Kbps，其中每个FE1接入信道N=1-30个E1时隙）的分组，可按连续或非连续顺序分配。"
    },
    {
      "indent": 3,
      "text": "Within a given unformatted line, the entire unformatted line is considered an access channel. Examples include RS-232, V.35, V.36 and X.21 (non-switched), and unframed E1 (G.703 without G.704).",
      "zh-CHS": "在给定的未格式化线路中，整个未格式化线路被视为接入信道。示例包括RS-232、V.35、V.36和X.21（非交换）以及无框架E1（不带G.704的G.703）。"
    },
    {
      "indent": 3,
      "text": "Access Rate - The data rate of the access channel, expressed in bits/second. The speed of the user access channel determines how rapidly the end user can inject data into the network.",
      "zh-CHS": "访问速率—访问通道的数据速率，以位/秒表示。用户访问通道的速度决定了最终用户将数据注入网络的速度。"
    },
    {
      "indent": 3,
      "text": "Bc - The Committed Burst Size (Bc) is the maximum amount of subscriber data (expressed in bits) that the network agrees to transfer, under normal conditions, during a time interval Tc.",
      "zh-CHS": "Bc-提交的突发大小（Bc）是指在正常情况下，在一个时间间隔Tc内，网络同意传输的最大订户数据量（以位表示）。"
    },
    {
      "indent": 3,
      "text": "Be - The Excess Burst Size (Be) is the maximum amount of subscriber data (expressed in bits) in excess of Bc that the network will attempt to deliver during the time interval Tc. This data (Be) is delivered in general with a lower probability than Bc.",
      "zh-CHS": "Be-过量突发大小（Be）是指在时间间隔Tc期间，网络将尝试传送的超过Bc的最大订户数据量（以位表示）。该数据（Be）通常以比Bc更低的概率交付。"
    },
    {
      "indent": 3,
      "text": "CIR - The Committed Information Rate (CIR) is the subscriber data rate (expressed in bits/second) that the network commits to deliver under normal network conditions. CIR is averaged over the time interval Tc (CIR = Bc/Tc).",
      "zh-CHS": "CIR—提交的信息速率（CIR）是网络在正常网络条件下提交的用户数据速率（以位/秒表示）。CIR是在时间间隔Tc（CIR=Bc/Tc）上的平均值。"
    },
    {
      "indent": 3,
      "text": "DLCI - Data Link Connection Identifier",
      "zh-CHS": "DLCI-数据链路连接标识符"
    },
    {
      "indent": 3,
      "text": "Logical Port - This term is used to model the frame relay \"interface\" on a device.",
      "zh-CHS": "逻辑端口-该术语用于对设备上的帧中继“接口”进行建模。"
    },
    {
      "indent": 3,
      "text": "NNI - Network to Network Interface",
      "zh-CHS": "NNI-网络到网络接口"
    },
    {
      "indent": 3,
      "text": "Permanent Virtual Connection (PVC) - A virtual connection that has its end-points and bearer capabilities defined at subscription time.",
      "zh-CHS": "永久虚拟连接（PVC）-在订阅时定义其端点和承载能力的虚拟连接。"
    },
    {
      "indent": 3,
      "text": "Time slot (E1) - An octet within the 256-bit information field in each E1 frame is defined as a time slot. Time slots are position sensitive within the 256-bit information field. Fractional E1 service is provided in contiguous or non-contiguous time slot increments.",
      "zh-CHS": "时隙（E1）-每个E1帧中256位信息字段内的八位字节定义为时隙。在256位信息字段中，时隙是位置敏感的。分数E1服务以连续或非连续时隙增量提供。"
    },
    {
      "indent": 3,
      "text": "Time slot (DS0) - An octet within the 192-bit information field in each DS1 frame is defined as a time slot. Time slots are position sensitive within the 192-bit information field. Fractional DS1 service is provided in contiguous or non-contiguous time slot increments.",
      "zh-CHS": "时隙（DS0）-每个DS1帧中192位信息字段中的八位字节定义为时隙。在192位信息字段中，时隙是位置敏感的。分数DS1服务以连续或非连续时隙增量提供。"
    },
    {
      "indent": 3,
      "text": "UNI - User to Network Interface",
      "zh-CHS": "用户到网络接口"
    },
    {
      "indent": 3,
      "text": "N391 - Full status (status of all PVCs) polling counter",
      "zh-CHS": "N391-完全状态（所有PVC的状态）轮询计数器"
    },
    {
      "indent": 3,
      "text": "N392 - Error threshold",
      "zh-CHS": "N392-错误阈值"
    },
    {
      "indent": 3,
      "text": "N393 - Monitored events count",
      "zh-CHS": "N393-监视的事件计数"
    },
    {
      "indent": 3,
      "text": "T391 - Link integrity verification polling timer",
      "zh-CHS": "T391-链路完整性验证轮询计时器"
    },
    {
      "indent": 3,
      "text": "T392 - Polling verification timer",
      "zh-CHS": "T392-轮询验证计时器"
    },
    {
      "indent": 3,
      "text": "nT3 - Status enquiry timer",
      "zh-CHS": "nT3-状态查询计时器"
    },
    {
      "indent": 3,
      "text": "nN3 - Maximum status enquiry counter",
      "zh-CHS": "nN3-最高状态查询柜台"
    },
    {
      "indent": 0,
      "text": "2.5. Relation to Other MIBs",
      "section_title": true,
      "zh-CHS": "2.5. 与其他MIB的关系"
    },
    {
      "indent": 0,
      "text": "2.5.1. System Group",
      "section_title": true,
      "zh-CHS": "2.5.1. 系统组"
    },
    {
      "indent": 3,
      "text": "Use the System Group of the SNMPv2-MIB [27] to describe the Frame Relay Service (FRS) agent. The FRS agent may be monitoring many frame relay devices in one network. The System Group does not describe frame relay devices monitored by the FRS agent.",
      "zh-CHS": "使用SNMPv2 MIB的系统组[27]来描述帧中继服务（FRS）代理。FRS代理可以监视一个网络中的多个帧中继设备。系统组不描述FRS代理监控的帧中继设备。"
    },
    {
      "indent": 3,
      "text": "sysDescr: ASCII string describing the FRS agent. Can be up to 255 characters long. This field is generally used to indicate the network providers identification and type of service offered.",
      "zh-CHS": "sysDescr：描述FRS代理的ASCII字符串。最长可达255个字符。此字段通常用于指示网络提供商标识和提供的服务类型。"
    },
    {
      "indent": 3,
      "text": "sysObjectID: Unique OBJECT IDENTIFIER (OID) for the FRS agent.",
      "zh-CHS": "sysObjectID:FRS代理的唯一对象标识符（OID）。"
    },
    {
      "indent": 3,
      "text": "sysUpTime: Clock in the FRS agent; TimeTicks in 1/100s of a second. Elapsed type since the FRS agent came on line.",
      "zh-CHS": "系统正常运行时间：FRS代理中的时钟；时间以1/100秒为单位。自FRS代理联机以来已用的类型。"
    },
    {
      "indent": 3,
      "text": "sysContact: Contact for the FRS agent. ASCII string of up to 255 characters.",
      "zh-CHS": "sysContact:FRS代理的联系人。最多255个字符的ASCII字符串。"
    },
    {
      "indent": 3,
      "text": "sysName: Domain name of the FRS agent, for example, acme.com",
      "zh-CHS": "sysName：FRS代理的域名，例如acme.com"
    },
    {
      "indent": 3,
      "text": "sysLocation: Location of the FRS agent. ASCII string of up to 255 characters.",
      "zh-CHS": "sysLocation：FRS代理的位置。最多255个字符的ASCII字符串。"
    },
    {
      "indent": 3,
      "text": "sysServices: Services of the managed device. The value \"2\", which implies that the frame relay network is providing a subnetwork level service, is recommended.",
      "zh-CHS": "sysServices：受管设备的服务。建议使用值“2”，这意味着帧中继网络正在提供子网级服务。"
    },
    {
      "indent": 0,
      "text": "2.5.2. Interfaces Table (ifTable, ifXtable)",
      "section_title": true,
      "zh-CHS": "2.5.2. 接口表（ifTable、ifXtable）"
    },
    {
      "indent": 3,
      "text": "This specifies how the Interfaces Group defined in the IF MIB [26] shall be used for the management of frame relay based interfaces, and in conjunction with the Frame Relay Service MIB module. This memo assumes the interpretation of the evolution of the Interfaces group to be in accordance with: \"The interfaces table (ifTable) contains information on the managed resource's interfaces. Each sub-layer below the internetwork layer of a network interface is considered an interface.\" Thus, the ifTable allows the following frame relay-based interfaces to be represented as table entries:",
      "zh-CHS": "这规定了如何使用IF MIB[26]中定义的接口组来管理基于帧中继的接口，并与帧中继服务MIB模块结合使用。本备忘录假设对接口组演变的解释符合：“接口表（ifTable）包含有关受管资源接口的信息。网络接口互联层下的每个子层都被视为接口。”因此，ifTable允许以下基于帧中继的接口表示为表项："
    },
    {
      "indent": 3,
      "text": "- Frame relay interfaces in equipment (e.g., switches, routers or networks) supporting frame relay. This level is concerned with generic frame counts and not with individual virtual connections.",
      "zh-CHS": "- 支持帧中继的设备（如交换机、路由器或网络）中的帧中继接口。此级别与通用帧计数有关，而与单个虚拟连接无关。"
    },
    {
      "indent": 3,
      "text": "In accordance with the guidelines of ifTable, frame counts per virtual connection are not covered by ifTable, and are considered interface specific and covered in the Frame Relay Service MIB module. In order to interrelate the ifEntries properly, the Interfaces Stack Group shall be supported.",
      "zh-CHS": "根据ifTable的指导原则，每个虚拟连接的帧计数不包含在ifTable中，而是被视为特定于接口的，并包含在帧中继服务MIB模块中。为了正确地关联IFI条目，应支持接口堆栈组。"
    },
    {
      "indent": 3,
      "text": "Some specific interpretations of ifTable for frame relay follow.",
      "zh-CHS": "以下是帧中继ifTable的一些具体解释。"
    },
    {
      "indent": 3,
      "text": "Object                 Use for the generic Frame Relay layer\n======                 =============================================\nifIndex                Each frame relay port is represented by an\n                       ifEntry.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ifDescr Description of the frame relay interface. ASCII string describing the UNI/NNI logical port. Can be up to 255 characters long.",
      "zh-CHS": "帧中继接口的ifDescr说明。描述UNI/NNI逻辑端口的ASCII字符串。最长可达255个字符。"
    },
    {
      "indent": 3,
      "text": "ifType The value allocated for Frame Relay Service is equal to 44.",
      "zh-CHS": "ifType为帧中继服务分配的值等于44。"
    },
    {
      "indent": 3,
      "text": "ifMtu Set to maximum frame size in octets for this frame relay logical port.",
      "zh-CHS": "ifMtu设置为此帧中继逻辑端口的最大帧大小（以八位字节为单位）。"
    },
    {
      "indent": 3,
      "text": "ifSpeed Peak bandwidth in bits per second available for use. This could be the speed of the logical port and not the access rate. Actual user information transfer rate (i.e., access rate) of the UNI or NNI logical port in bits per second (this is not the clocking speed). For example, it is 1,536,000 bits per second for a DS1-based UNI/NNI logical port and 1,984,000 bits per second for an E1-based UNI/NNI logical port.",
      "zh-CHS": "ifSpeed峰值带宽（以每秒比特数为单位）可供使用。这可能是逻辑端口的速度，而不是访问速率。UNI或NNI逻辑端口的实际用户信息传输速率（即访问速率），单位为比特/秒（这不是时钟速度）。例如，基于DS1的UNI/NNI逻辑端口为每秒1536000位，基于E1的UNI/NNI逻辑端口为每秒1984000位。"
    },
    {
      "indent": 3,
      "text": "ifPhysAddress The primary address for this logical port assigned by the frame relay interface provider. An octet string of zero length if no address is used for this logical port.",
      "zh-CHS": "ifPhysAddress帧中继接口提供程序为此逻辑端口分配的主地址。如果此逻辑端口未使用地址，则长度为零的八位字节字符串。"
    },
    {
      "indent": 3,
      "text": "ifAdminStatus The desired administrative status of the frame relay logical port.",
      "zh-CHS": "ifAdminStatus帧中继逻辑端口的所需管理状态。"
    },
    {
      "indent": 3,
      "text": "ifOperStatus The current operational status of the Frame Relay UNI or NNI logical port.",
      "zh-CHS": "ifOperStatus帧中继UNI或NNI逻辑端口的当前操作状态。"
    },
    {
      "indent": 3,
      "text": "ifLastChange The value of sysUptime at the last re-initialization of the logical port. The value of sysUpTime at the time the logical port entered its current operational state. If the current state was entered prior to the last re-initialization of the local network management subsystem, then this object contains a zero value.",
      "zh-CHS": "IFLAST在最后一次重新初始化逻辑端口时更改sysUptime的值。逻辑端口进入其当前操作状态时的sysUpTime值。如果当前状态是在上次重新初始化本地网络管理子系统之前输入的，则此对象包含零值。"
    },
    {
      "indent": 3,
      "text": "ifInOctets The number of received octets. This counter only counts octets from the beginning of the frame relay header field to the end of user data.",
      "zh-CHS": "ifInOctets接收到的八位字节数。此计数器仅统计从帧中继头字段开始到用户数据结束的八位字节数。"
    },
    {
      "indent": 3,
      "text": "ifInUcastPkts The number of received unerrored, unicast frames.",
      "zh-CHS": "ifInUcastPkts接收到的未经错误的单播帧数。"
    },
    {
      "indent": 3,
      "text": "ifInDiscards The number of received frames discarded. Specifically, frames discarded due to ingress buffer congestion and traffic policing.",
      "zh-CHS": "i指示丢弃的接收帧数。特别是，由于入口缓冲区拥塞和流量管理而丢弃的帧。"
    },
    {
      "indent": 3,
      "text": "ifInErrors The number of received frames that are discarded because of an error. Specifically, frames that are too long or too short, frames that are not a multiple of 8 bits in length, frames with an invalid or unrecognized DLCI, frames with an abort sequence, frames with improper flag delimitation, and frame that fail FCS.",
      "zh-CHS": "IFinerror由于错误而丢弃的接收帧数。具体而言，是指太长或太短的帧、长度不是8位倍数的帧、具有无效或无法识别的DLCI的帧、具有中止序列的帧、具有不正确标志定界的帧以及FCS失败的帧。"
    },
    {
      "indent": 3,
      "text": "ifInUnknownProtos The number of packets discarded because of an unknown or unsupported protocol. For Frame Relay Service interfaces, this counter will always be zero.",
      "zh-CHS": "ifInUnknownProtos由于未知或不受支持的协议而丢弃的数据包数。对于帧中继服务接口，此计数器将始终为零。"
    },
    {
      "indent": 3,
      "text": "ifOutOctets The number of transmitted octets. This counter only counts octets from the beginning of the frame relay header field to the end of user data.",
      "zh-CHS": "ifOutOctets传输的八位字节数。此计数器仅统计从帧中继头字段开始到用户数据结束的八位字节数。"
    },
    {
      "indent": 3,
      "text": "ifOutUcastpkts The number of unerrored, unicast frames sent.",
      "zh-CHS": "ifOutUcastpkts发送的未出错单播帧数。"
    },
    {
      "indent": 3,
      "text": "ifOutDiscards The number of frames discarded in the egress direction. Possible reasons are as follows: policing, congestion.",
      "zh-CHS": "IfoutDiscard在出口方向上丢弃的帧数。可能的原因如下：治安、拥挤。"
    },
    {
      "indent": 3,
      "text": "ifOutErrors The number of frames discarded in the egress direction because of an error. Specifically, frames that are aborted due to a transmitter underrun.",
      "zh-CHS": "iOutErrors由于错误而在出口方向丢弃的帧数。特别是，由于发射机欠载而中止的帧。"
    },
    {
      "indent": 3,
      "text": "ifName This variable is not applicable for Frame Relay Service interfaces, therefore, this variable contains a zero-length string.",
      "zh-CHS": "ifName此变量不适用于帧中继服务接口，因此，此变量包含长度为零的字符串。"
    },
    {
      "indent": 3,
      "text": "ifInMulticastPkts The number of received unerrored, multicast frames.",
      "zh-CHS": "ifInMulticastPkts接收到的未错误多播帧数。"
    },
    {
      "indent": 3,
      "text": "ifInBroadcastPkts This variable is not applicable for Frame Relay Service interfaces, therefore, this counter is always zero.",
      "zh-CHS": "ifInBroadcastPkts此变量不适用于帧中继服务接口，因此，此计数器始终为零。"
    },
    {
      "indent": 3,
      "text": "ifOutMulticastPkts The number of sent unerrored, multicast frames.",
      "zh-CHS": "ifOutMulticastPkts发送的未出错多播帧数。"
    },
    {
      "indent": 3,
      "text": "ifOutBroadcastPkts This variable is not applicable for Frame Relay Service interfaces, therefore, this counter is always zero.",
      "zh-CHS": "ifOutBroadcastPkts此变量不适用于帧中继服务接口，因此，此计数器始终为零。"
    },
    {
      "indent": 3,
      "text": "ifHCInOctets Only used for DS3-based (and greater) Frame Relay logical ports. The number of received octets. This counter only counts octets from the beginning of the frame relay header field to the end of user data.",
      "zh-CHS": "ifHCInOctets仅用于基于DS3（及更高版本）的帧中继逻辑端口。接收到的八位字节数。此计数器仅统计从帧中继头字段开始到用户数据结束的八位字节数。"
    },
    {
      "indent": 3,
      "text": "ifHCOutOctets Only used for DS3-based (and greater) Frame Relay logical ports. The number of transmitted octets. This counter only counts octets from the beginning of the frame relay header field to the end of user data.",
      "zh-CHS": "ifHCOutOctets仅用于基于DS3（及更高版本）的帧中继逻辑端口。传输的八位字节数。此计数器仅统计从帧中继头字段开始到用户数据结束的八位字节数。"
    },
    {
      "indent": 3,
      "text": "ifLinkUpDownTrapEnable Set to true(1). It is recommended that the underlying physical layer notifications be disabled since both are not required. Notifications are enabled at the frame relay service layer specifically because PVC notifications are not to be sent if the frame relay interface fails. Without a linkUp/linkDown notification, the management station would receive no notification of the failure.",
      "zh-CHS": "ifLinkUpDownTrapEnable设置为true（1）。建议禁用底层物理层通知，因为这两种通知都不是必需的。在帧中继服务层启用通知，这是因为如果帧中继接口出现故障，则不会发送PVC通知。如果没有向上/向下链接通知，管理站将不会收到故障通知。"
    },
    {
      "indent": 3,
      "text": "ifHighSpeed Set to the user data rate of the frame relay logical port in millions of bits per second. If the user data rate is less than 1 Mbps, then this value is zero.",
      "zh-CHS": "ifHighSpeed设置为帧中继逻辑端口的用户数据速率，单位为百万位/秒。如果用户数据速率小于1 Mbps，则该值为零。"
    },
    {
      "indent": 3,
      "text": "ifPromiscuousMode Set to false(2).",
      "zh-CHS": "ifPromiscuousMode设置为false（2）。"
    },
    {
      "indent": 3,
      "text": "ifConnectorPresent Set to false(2).",
      "zh-CHS": "ifConnectorPresent设置为false（2）。"
    },
    {
      "indent": 3,
      "text": "Frame relay network service interfaces support the Interface Stack Group. Frame relay network service interfaces do not support any other groups or objects in the Interfaces group of the IF MIB.",
      "zh-CHS": "帧中继网络服务接口支持接口堆栈组。帧中继网络服务接口不支持IF MIB接口组中的任何其他组或对象。"
    },
    {
      "indent": 0,
      "text": "2.5.3. Stack Table for DS1/E1 Environment",
      "section_title": true,
      "zh-CHS": "2.5.3. DS1/E1环境的堆栈表"
    },
    {
      "indent": 3,
      "text": "This section describes by example how to use ifStackTable to represent the relationship of frame relay service to ds0 and ds0Bundles with ds1 interfaces [20].",
      "zh-CHS": "本节通过示例说明如何使用ifStackTable表示帧中继服务与ds0的关系，以及ds0捆绑包与ds1接口的关系[20]。"
    },
    {
      "indent": 3,
      "text": "Example: A frame relay service is being carried on 4 ds0s of a ds1.",
      "zh-CHS": "示例：在ds1的4个DS0上执行帧中继服务。"
    },
    {
      "indent": 5,
      "text": "+---------------------+\n| Frame Relay Service |\n+---------------------+\n           |\n+---------------------+\n| ds0Bundle           |\n+---------------------+\n  |     |     |     |\n+---+ +---+ +---+ +---+\n|ds0| |ds0| |ds0| |ds0|\n+---+ +---+ +---+ +---+\n  |     |     |     |\n+---------------------+\n| ds1                 |\n+---------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The assignment of the index values could for example be:",
      "zh-CHS": "例如，索引值的分配可以是："
    },
    {
      "indent": 8,
      "text": "ifIndex Description 1 FrameRelayService (type 44) 2 ds0Bundle (type 82) 3 ds0 #1 (type 81) 4 ds0 #2 (type 81) 5 ds0 #3 (type 81) 6 ds0 #4 (type 81) 7 ds1 (type 18)",
      "zh-CHS": "I索引描述1帧中继服务（类型44）2 ds0捆绑包（类型82）3 ds0#1（类型81）4 ds0#2（类型81）5 ds0#3（类型81）6 ds0#4（类型81）7 ds1（类型18）"
    },
    {
      "indent": 3,
      "text": "The ifStackTable is then used to show the relationships between the various interfaces.",
      "zh-CHS": "然后使用ifStackTable显示各种接口之间的关系。"
    },
    {
      "indent": 8,
      "text": "ifStackTable Entries",
      "zh-CHS": "ifStackTable条目"
    },
    {
      "indent": 8,
      "text": "HigherLayer LowerLayer 0 1 1 2 2 3 2 4 2 5 2 6 3 7 4 7 5 7 6 7 7 0",
      "zh-CHS": "高层低层01 12 3 2 4 2 5 2 6 3 7 4 7 7 7 0"
    },
    {
      "indent": 3,
      "text": "In the case where the frame relay service is using a single ds0, then the ds0Bundle is not required.",
      "zh-CHS": "如果帧中继服务使用单个ds0，则不需要ds0捆绑包。"
    },
    {
      "indent": 5,
      "text": "+---------------------+\n| Frame Relay Service |\n+---------------------+\n  |\n+---+\n|ds0|\n+---+\n  |\n+---------------------+\n| ds1                 |\n+---------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The assignment of the index values could for example be:",
      "zh-CHS": "例如，索引值的分配可以是："
    },
    {
      "indent": 8,
      "text": "ifIndex Description 1 FrameRelayService (type 44) 2 ds0 (type 81) 3 ds1 (type 18)",
      "zh-CHS": "IFIX说明1帧中继服务（44型）2 ds0（81型）3 ds1（18型）"
    },
    {
      "indent": 3,
      "text": "The ifStackTable is then used to show the relationships between the various interfaces.",
      "zh-CHS": "然后使用ifStackTable显示各种接口之间的关系。"
    },
    {
      "indent": 8,
      "text": "ifStackTable Entries",
      "zh-CHS": "ifStackTable条目"
    },
    {
      "indent": 8,
      "text": "HigherLayer LowerLayer 0 1 1 2 2 3 3 0",
      "zh-CHS": "上层下层0112200"
    },
    {
      "indent": 0,
      "text": "2.5.4. Stack Table for V.35 Environments",
      "section_title": true,
      "zh-CHS": "2.5.4. V.35环境的堆栈表"
    },
    {
      "indent": 3,
      "text": "This section describes by example how to use ifStackTable to represent the relationship of frame relay service with V.35 interfaces.",
      "zh-CHS": "本节通过示例介绍如何使用ifStackTable表示帧中继服务与V.35接口的关系。"
    },
    {
      "indent": 8,
      "text": "+---------------------+\n| Frame Relay Service |\n+---------------------+\n           |\n+---------------------+\n| v35                 |\n+---------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "An example of index values in this case could be:",
      "zh-CHS": "这种情况下的索引值示例如下："
    },
    {
      "indent": 11,
      "text": "ifIndex Description 1 FrameRelayService (type 44) 2 v35 (type 33)",
      "zh-CHS": "IFIX说明1帧中继服务（44型）2 v35（33型）"
    },
    {
      "indent": 3,
      "text": "Note type 33 (RS232-like MIB) is used instead of type 45 (V.35). V35 does not pertain to this environment.",
      "zh-CHS": "注：使用33型（RS232，如MIB）代替45型（V.35）。V35不适用于此环境。"
    },
    {
      "indent": 3,
      "text": "The ifStackTable is then used to show the relationships between the various interfaces.",
      "zh-CHS": "然后使用ifStackTable显示各种接口之间的关系。"
    },
    {
      "indent": 11,
      "text": "ifStackTable Entries",
      "zh-CHS": "ifStackTable条目"
    },
    {
      "indent": 11,
      "text": "HigherLayer LowerLayer 0 1 1 2 2 0",
      "zh-CHS": "上层下层0112200"
    },
    {
      "indent": 0,
      "text": "2.5.5. The Frame Relay/ATM PVC Service Interworking MIB",
      "section_title": true,
      "zh-CHS": "2.5.5. 帧中继/atmpvc业务互通MIB"
    },
    {
      "indent": 3,
      "text": "Connections between two frame relay endpoints are represented with an entry in the frPVCConnectTable of this MIB. Both endpoints are represented with rows in the frPVCEndptTable. The frPVCEndptConnectIdentifier object of each endpoint points to the frPVCConnectTable cross-connect table row for the connection.",
      "zh-CHS": "两个帧中继端点之间的连接用此MIB的frPVCConnectTable中的一个条目表示。两个端点都用frPVCEndptTable中的行表示。每个端点的frPVCEndptConnectIdentifier对象指向连接的frPVCConnectTable交叉连接表行。"
    },
    {
      "indent": 3,
      "text": "In contrast, a connection that spans frame relay and ATM endpoints is represented with an entry in the frAtmIwfConnectionTable of the FR/ATM PVC Service Interworking MIB defined in [28].",
      "zh-CHS": "相反，跨越帧中继和ATM端点的连接用[28]中定义的FR/ATM PVC服务互通MIB的FRAMIWFCONNECTIONTABLE中的条目表示。"
    },
    {
      "indent": 3,
      "text": "In the case of an inter-worked connection, the frPVCEndptConnectIdentifier object is set to zero. Instead, the frPVCEndptAtmIwfConnIndex object is set to the index of the FR/ATM IWF cross-connect table row.",
      "zh-CHS": "对于工作间连接，frPVCEndptConnectIdentifier对象设置为零。相反，FRPVCENDPTATMIWFCONNDINDEX对象设置为FR/ATM IWF交叉连接表行的索引。"
    },
    {
      "indent": 3,
      "text": "The frame relay PVC cross-connect table (frPVCConnectTable) does not contain an entry for the FR/ATM inter-worked connection.",
      "zh-CHS": "帧中继PVC交叉连接表（frPVCConnectTable）不包含FR/ATM互连连接的条目。"
    },
    {
      "indent": 0,
      "text": "2.6. Textual Convention Change",
      "section_title": true,
      "zh-CHS": "2.6. 文本约定变更"
    },
    {
      "indent": 3,
      "text": "Version 1 of the Frame Relay Service MIB contains MIB objects defined with the DisplayString textual convention. In version 2 of this MIB, the syntax for these objects has been updated to use the (now preferred) SnmpAdminString textual convention. The new TC provides support for a greater variety of international character sets.",
      "zh-CHS": "帧中继服务MIB的版本1包含使用DisplayString文本约定定义的MIB对象。在该MIB的版本2中，这些对象的语法已更新为使用（现在首选）SNMPAdministring文本约定。新的TC支持更多种类的国际字符集。"
    },
    {
      "indent": 3,
      "text": "The working group realizes that this change is not strictly supported by SMIv2. In our judgment, the alternative of deprecating the old objects and defining new objects would have a more adverse impact on backward compatibility and interoperability, given the particular semantics of these objects.",
      "zh-CHS": "工作组意识到，SMIv2并不严格支持此更改。根据我们的判断，考虑到这些对象的特定语义，弃用旧对象和定义新对象的替代方案将对向后兼容性和互操作性产生更不利的影响。"
    },
    {
      "indent": 0,
      "text": "3. Object Definitions",
      "section_title": true,
      "zh-CHS": "3. 对象定义"
    },
    {
      "indent": 0,
      "text": "FRNETSERV-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, NOTIFICATION-TYPE, transmission, Counter32, Integer32 FROM SNMPv2-SMI TimeStamp, RowStatus FROM SNMPv2-TC MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF InterfaceIndex, ifIndex FROM IF-MIB SnmpAdminString FROM SNMP-FRAMEWORK-MIB;",
      "zh-CHS": "从SNMPv2 SMI时间戳导入MODULE-IDENTITY、OBJECT-TYPE、NOTIFICATION-TYPE、transmission、Counter32、Integer32，从SNMPv2 TC MODULE-COMPLIANCE导入RowStatus，从SNMPv2 CONF InterfaceIndex导入OBJECT-GROUP、NOTIFICATION-GROUP，从IF-MIB导入ifIndex，从SNMP-FRAMEWORK-MIB导入snmpadmin；"
    },
    {
      "indent": 8,
      "text": "frnetservMIB MODULE-IDENTITY LAST-UPDATED \"200009280000Z\" -- September 28, 2000 ORGANIZATION \"IETF Frame Relay Service MIB Working Group\" CONTACT-INFO \"WG Charter: http://www.ietf.org/html.charters/frnetmib-charter WG-email: frnetmib@sunroof.eng.sun.com",
      "zh-CHS": "frnetservMIB模块标识最后更新“20000928000Z”-2000年9月28日组织“IETF帧中继服务MIB工作组”联系信息工作组章程：http://www.ietf.org/html.charters/frnetmib-charter 工作组电子邮件：frnetmib@sunroof.eng.sun.com"
    },
    {
      "indent": 17,
      "text": "Subscribe:\n  frnetmib-request@sunroof.eng.sun.com\nEmail Archive:\n  ftp://ftp.ietf.org/ietf-mail-archive/frnetmib",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Chair: Andy Malis Vivace Networks, Inc. Email: Andy.Malis@vivacenetworks.com",
      "zh-CHS": "主席：Andy Malis Vivace Networks，Inc.电子邮件：Andy。Malis@vivacenetworks.com"
    },
    {
      "indent": 17,
      "text": "WG editor: Kenneth Rehbehn Megisto Systems, Inc. Email: krehbehn@megisto.com",
      "zh-CHS": "工作组编辑：Kenneth Rehbehn Megisto Systems，Inc.电子邮件：krehbehn@megisto.com"
    },
    {
      "indent": 17,
      "text": "Co-author: David Fowler Syndesis Limited, EMail: fowler@syndesis.com\"",
      "zh-CHS": "合著者：David Fowler Syndesis Limited，电子邮件：fowler@syndesis.com\""
    },
    {
      "indent": 12,
      "text": "DESCRIPTION \"The MIB module to describe generic objects for Frame Relay Network Service.\"",
      "zh-CHS": "DESCRIPTION“用于描述帧中继网络服务的通用对象的MIB模块。”"
    },
    {
      "indent": 12,
      "text": "-- -- Revision History -- REVISION \"200009280000Z\" DESCRIPTION \"Published as RFC 2954.",
      "zh-CHS": "--——修订历史——修订版“20000928000Z”说明，作为RFC 2954出版。"
    },
    {
      "indent": 17,
      "text": "The major new features of this revision include:",
      "zh-CHS": "本次修订的主要新特点包括："
    },
    {
      "indent": 21,
      "text": "o Support for read-write capability to provision switch components providing service,",
      "zh-CHS": "o 支持读写功能，以提供提供服务的交换机组件，"
    },
    {
      "indent": 21,
      "text": "o Support for cross-connection via a frame relay to ATM service interworking function,",
      "zh-CHS": "o 支持通过帧中继交叉连接到ATM服务互通功能，"
    },
    {
      "indent": 21,
      "text": "o Support for frame relay fragmentation,",
      "zh-CHS": "o 支持帧中继分段，"
    },
    {
      "indent": 21,
      "text": "o Additional frame counters to track frame loss.",
      "zh-CHS": "o 用于跟踪帧丢失的其他帧计数器。"
    },
    {
      "indent": 17,
      "text": "Refer to Appendix A for a comprehensive list of changes since RFC 1604.\"",
      "zh-CHS": "参考附录A，了解自RFC 1604以来的全面变更列表。”"
    },
    {
      "indent": 12,
      "text": "REVISION \"199311161200Z\"\nDESCRIPTION\n     \"Published as RFC 1604.\"\n::= { transmission 44 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "frnetservObjects\n    OBJECT IDENTIFIER ::= { frnetservMIB 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "frnetservTraps\n    OBJECT IDENTIFIER ::= { frnetservMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "frnetservTrapsPrefix\n    OBJECT IDENTIFIER ::= { frnetservTraps 0 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "--\n-- The Frame Relay Service Logical Port\n--\nfrLportTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF FrLportEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The Frame Relay Logical Port Information table is\n            an interface-specific addendum to the generic\n            ifTable of the Interface MIB.\"\n    ::= { frnetservObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportEntry OBJECT-TYPE\n    SYNTAX      FrLportEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"An entry in the Frame Relay Logical Port\n            Information table.\"\n    INDEX   {   ifIndex }\n    ::= { frLportTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "FrLportEntry ::=\n    SEQUENCE {\n        frLportNumPlan            INTEGER,\n        frLportContact            SnmpAdminString,\n        frLportLocation           SnmpAdminString,\n        frLportType               INTEGER,\n        frLportAddrDLCILen        INTEGER,\n        frLportVCSigProtocol      INTEGER,\n        frLportVCSigPointer       OBJECT IDENTIFIER,\n        frLportDLCIIndexValue     Integer32,\n        frLportTypeAdmin          INTEGER,\n        frLportVCSigProtocolAdmin INTEGER,\n        frLportFragControl        INTEGER,\n        frLportFragSize           Integer32\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportNumPlan OBJECT-TYPE\n    SYNTAX      INTEGER {\n                other(1),\n                e164(2),\n                x121(3),\n                none(4)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the network\n            address numbering plan for this UNI/NNI logical\n            port. The network address is the object\n            ifPhysAddress. The value none(4) implies that\n            there is no ifPhysAddress.  The FRS agent will\n            return an octet string of zero length for\n            ifPhysAddress.  The value other(1) means that an\n            address has been assigned to this interface, but\n            the numbering plan is not enumerated here.\"\n    REFERENCE   \"E.164 [29]\n                 X.121 [30]\"\n    ::= { frLportEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportContact  OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the network\n            contact for this UNI/NNI logical port.\"\n    ::= { frLportEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportLocation OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the frame\n            relay network location for this UNI/NNI logical\n            port.\"\n    ::= { frLportEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportType     OBJECT-TYPE\n    SYNTAX      INTEGER {\n                uni(1),\n                nni(2)\n                }\n    MAX-ACCESS  read-only",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "STATUS      current\nDESCRIPTION\n        \"The value of this object identifies the type of\n        network interface for this logical port.\"\n::= { frLportEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportAddrDLCILen OBJECT-TYPE\n    SYNTAX      INTEGER {\n                twoOctets10Bits(1),\n                threeOctets10Bits(2),\n                threeOctets16Bits(3),\n                fourOctets17Bits(4),\n                fourOctets23Bits(5)\n                }\n    UNITS       \"Octets\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the Q.922\n            Address field length and DLCI length for this\n            UNI/NNI logical port.\"\n    REFERENCE   \"Q.922 [25]\"\n    ::= { frLportEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportVCSigProtocol OBJECT-TYPE\n    SYNTAX      INTEGER {\n                none(1),\n                lmi(2),\n                ansiT1617D(3),\n                ansiT1617B(4),\n                ccittQ933A(5)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the Local\n            In-Channel Signaling Protocol that is used for\n            this frame relay UNI/NNI logical port.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "none(1): Interface does not use a PVC signaling protocol",
      "zh-CHS": "无（1）：接口不使用PVC信令协议"
    },
    {
      "indent": 20,
      "text": "lmi(2): Interface operates the Stratacom/ Nortel/DEC Local Management Interface Specification protocol",
      "zh-CHS": "lmi（2）：接口操作Stratacom/Nortel/DEC本地管理接口规范协议"
    },
    {
      "indent": 20,
      "text": "ansiT1617D(3): Interface operates the ANSI T1.617 Annex D PVC status protocol",
      "zh-CHS": "ansiT1617D（3）：接口操作ANSI T1.617附录D PVC状态协议"
    },
    {
      "indent": 0,
      "text": " ansiT1617B(4): Interface operates the ANSI T1.617 Annex B procedures",
      "zh-CHS": "ansiT1617B（4）：接口操作ANSI T1.617附录B程序"
    },
    {
      "indent": 14,
      "text": "        ccittQ933A(5):  Interface operates the ITU Q.933\n                        Annex A PVC status protocol\"\nREFERENCE   \"LMI [24]\n             T1.617 Annex D [17],\n             Q.933 Annex A [22]\"\n::= { frLportEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportVCSigPointer OBJECT-TYPE SYNTAX OBJECT IDENTIFIER MAX-ACCESS read-only STATUS deprecated DESCRIPTION \"The value of this object is used as a pointer to the table that contains the Local In-Channel Signaling Protocol parameters and errors for this UNI/NNI logical port.",
      "zh-CHS": "frLportVCSigPointer对象类型语法对象标识符MAX-ACCESS只读状态不推荐说明“此对象的值用作指向包含此UNI/NNI逻辑端口的本地通道内信令协议参数和错误的表的指针。"
    },
    {
      "indent": 12,
      "text": "        This object has been deprecated to reflect the\n        fact that the local in-channel signaling\n        parameters are accessed from a single table\n        (frMgtVCSigTable) that includes parameters for all\n        possible signaling protocols.  Early design\n        anticipated multiple tables, one for each\n        signaling protocol.\"\n::= { frLportEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportDLCIIndexValue OBJECT-TYPE SYNTAX Integer32 (16..4194303) MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains a hint to be used for frPVCEndptDLCIIndex when creating entries in the frPVCEndptTable. The SYNTAX of this object matches the SYNTAX of the frPVCEndptDLCIIndex - an object that is restricted to legal Q.922 DLCI values for the size of the address field.",
      "zh-CHS": "frLportDLCIIndexValue对象类型语法整数32（16..4194303）最大访问只读状态当前说明“此对象包含在frPVCEndptTable中创建条目时用于FRPVCENDPTDLCIDEX的提示。此对象的语法与frPVCEndptDLCIIndex的语法相匹配，frPVCEndptDLCIIndex是一个仅限于地址字段大小的合法Q.922 DLCI值的对象。"
    },
    {
      "indent": 20,
      "text": "The value 0 indicates that no unassigned entries are available.",
      "zh-CHS": "值0表示没有可用的未分配项。"
    },
    {
      "indent": 20,
      "text": "To obtain the frPVCEndptDLCIIndex value for a new entry, the manager issues a management protocol retrieval operation to obtain the current value of",
      "zh-CHS": "要获取新条目的frPVCEndptDLCIIndex值，管理器将发出管理协议检索操作以获取的当前值"
    },
    {
      "indent": 20,
      "text": "this object. After each retrieval, the agent must modify the value to the next unassigned index to prevent assignment of the same value to multiple management systems.",
      "zh-CHS": "这个物体。每次检索后，代理必须将该值修改为下一个未分配索引，以防止将相同的值分配给多个管理系统。"
    },
    {
      "indent": 12,
      "text": "        A management system should repeat the read to\n        obtain a new value should an attempt to create the\n        new row using the previously returned hint fail.\"\nREFERENCE   \"Q.922 [25]\"\n::= { frLportEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportTypeAdmin   OBJECT-TYPE\n    SYNTAX      INTEGER {\n                uni(1),\n                nni(2)\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object desired identifies the\n            type of network interface for this logical port.\"\n      ::= { frLportEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportVCSigProtocolAdmin OBJECT-TYPE\n    SYNTAX      INTEGER {\n                none(1),\n                lmi(2),\n                ansiT1617D(3),\n                ansiT1617B(4),\n                ccittQ933A(5)\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            Local In-Channel Signaling Protocol that is used\n            for this frame relay UNI/NNI logical port.  This\n            value must be made the active protocol as soon as\n            possible on the device.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "        Refer to frLportVCSigProtocol for a description of\n        each signaling protocol choices.\"\nREFERENCE   \"LMI [24]\n             T1.617 Annex D [17],\n             Q.933 Annex A [22]\"\n::= { frLportEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportFragControl OBJECT-TYPE",
      "zh-CHS": "frLportFragControl对象类型"
    },
    {
      "indent": 12,
      "text": "SYNTAX      INTEGER {\n            on(1),\n            off(2)\n            }\nMAX-ACCESS  read-write\nSTATUS      current\nDESCRIPTION\n        \"This object controls the transmission and\n        reception of fragmentation frames for this UNI or\n        NNI interface.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "on(1) Frames are fragmented using the interface fragmentation format Note: The customer side of the interface must also be configured to fragment frames.",
      "zh-CHS": "在（1）上，使用接口分段格式对帧进行分段注意：接口的客户端也必须配置为对帧进行分段。"
    },
    {
      "indent": 12,
      "text": "        off(2)  Frames are not fragmented using the\n                interface fragmentation format.\"\nREFERENCE   \"FRF.12 [21]\"\nDEFVAL { off }\n::= { frLportEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frLportFragSize OBJECT-TYPE\n    SYNTAX      Integer32 (0..4096)\n    UNITS       \"Octets\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is the size in octets of\n            the maximum size of each fragment to be sent when\n            fragmenting.  This object is only used by the\n            fragmentation transmitter, and the two sides of\n            the interface may differ.  The fragment size\n            includes the octets for the frame relay header,\n            the UI octet, the NLPID, the fragmentation header,\n            and the fragment payload. If frLportFragControl is\n            set to off, this value should be zero.\"\n    REFERENCE   \"FRF.12 [21]\"\n    DEFVAL { 0 }\n    ::= { frLportEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- -- Frame Relay Management VC Signaling --",
      "zh-CHS": "----帧中继管理VC信令--"
    },
    {
      "indent": 8,
      "text": "frMgtVCSigTable OBJECT-TYPE SYNTAX SEQUENCE OF FrMgtVCSigEntry",
      "zh-CHS": "FrMgtVCSigEntry的frMgtVCSigTable对象类型语法序列"
    },
    {
      "indent": 12,
      "text": "MAX-ACCESS  not-accessible\nSTATUS      current\nDESCRIPTION\n        \"The Frame Relay Management VC Signaling\n        Parameters and Errors table.\"\n::= { frnetservObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigEntry OBJECT-TYPE\n    SYNTAX      FrMgtVCSigEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"An entry in the Frame Relay Management VC\n            Signaling Parameters Errors table.\"\n    INDEX       { ifIndex }\n    ::= { frMgtVCSigTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "FrMgtVCSigEntry ::=\n    SEQUENCE {\n        frMgtVCSigProced             INTEGER,\n        frMgtVCSigUserN391           INTEGER,\n        frMgtVCSigUserN392           INTEGER,\n        frMgtVCSigUserN393           INTEGER,\n        frMgtVCSigUserT391           INTEGER,\n        frMgtVCSigNetN392            INTEGER,\n        frMgtVCSigNetN393            INTEGER,\n        frMgtVCSigNetT392            INTEGER,\n        frMgtVCSigNetnN4             INTEGER,\n        frMgtVCSigNetnT3             INTEGER,\n        frMgtVCSigUserLinkRelErrors  Counter32,\n        frMgtVCSigUserProtErrors     Counter32,\n        frMgtVCSigUserChanInactive   Counter32,\n        frMgtVCSigNetLinkRelErrors   Counter32,\n        frMgtVCSigNetProtErrors      Counter32,\n        frMgtVCSigNetChanInactive    Counter32,\n        frMgtVCSigProcedAdmin        INTEGER,\n        frMgtVCSigUserN391Admin      INTEGER,\n        frMgtVCSigUserN392Admin      INTEGER,\n        frMgtVCSigUserN393Admin      INTEGER,\n        frMgtVCSigUserT391Admin      INTEGER,\n        frMgtVCSigNetN392Admin       INTEGER,\n        frMgtVCSigNetN393Admin       INTEGER,\n        frMgtVCSigNetT392Admin       INTEGER,\n        frMgtVCSigNetnT3Admin        INTEGER\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigProced OBJECT-TYPE SYNTAX INTEGER {",
      "zh-CHS": "frMgtVCSigProced对象类型语法整数{"
    },
    {
      "indent": 12,
      "text": " u2nnet(1), bidirect(2), u2nuser(3) } MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of this object identifies the local in-channel signaling procedural role that is used for this UNI/NNI logical port. Bidirectional procedures implies that both user-side and network-side procedural roles are used.",
      "zh-CHS": "u2nnet（1）、bidirect（2）、u2user（3）}MAX-ACCESS只读状态当前描述“此对象的值标识用于此UNI/NNI逻辑端口的本地通道内信令过程角色。双向过程意味着同时使用用户端和网络端过程角色。"
    },
    {
      "indent": 20,
      "text": "u2nnet(1) Logical port operates user to network procedure in the role of the network side",
      "zh-CHS": "u2nnet（1）逻辑端口以网络端的角色操作用户到网络的过程"
    },
    {
      "indent": 20,
      "text": "bidirect(2) Logical port operates the bidirectional procedure (both user and network side roles)",
      "zh-CHS": "双向（2）逻辑端口操作双向过程（用户和网络端角色）"
    },
    {
      "indent": 12,
      "text": "        u2nuser(3)  Logical port operates user to network\n                    procedure in the role of the user\n                    side\"\nREFERENCE   \"Q.933 Annex A [22],\n             T1.617 Annex D [17]\"\n::= { frMgtVCSigEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserN391 OBJECT-TYPE\n    SYNTAX      INTEGER (1..255)\n    UNITS       \"Polls\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the User-side\n            N391 full status polling cycle value for this\n            UNI/NNI logical port.  If the logical port is not\n            performing user-side (bidirectional) procedures,\n            then this object is not instantiated and an\n            attempt to read will result in the noSuchInstance\n            exception response.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17]\"\n    DEFVAL { 6 }\n    ::= { frMgtVCSigEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserN392 OBJECT-TYPE SYNTAX INTEGER (1..10)",
      "zh-CHS": "frMgtVCSigUserN392对象类型语法整数（1..10）"
    },
    {
      "indent": 12,
      "text": "UNITS       \"Events\"\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n        \"The value of this object identifies the User-side\n        N392 error threshold value for this UNI/NNI\n        logical port.  If the logical port is not\n        performing user-side (bidirectional) procedures,\n        then this object is not instantiated.\"\nREFERENCE   \"Q.933 Annex A [22],\n             T1.617 Annex D [17]\"\nDEFVAL { 3 }\n::= { frMgtVCSigEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserN393 OBJECT-TYPE\n    SYNTAX      INTEGER (1..10)\n    UNITS       \"Events\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the User-side\n            N393 monitored events count value for this UNI/NNI\n            logical port.  If the logical port is not\n            performing user-side (bidirectional) procedures,\n            then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17]\"\n    DEFVAL { 4 }\n    ::= { frMgtVCSigEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserT391 OBJECT-TYPE\n    SYNTAX      INTEGER (5..30)\n    UNITS       \"Seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the User-side\n            T391 link integrity verification polling timer\n            value for this UNI/NNI logical port.  If the\n            logical port is not performing user-side\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17]\"\n    DEFVAL { 10 }\n    ::= { frMgtVCSigEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetN392 OBJECT-TYPE SYNTAX INTEGER (1..10)",
      "zh-CHS": "frMgtVCSigNetN392对象类型语法整数（1..10）"
    },
    {
      "indent": 12,
      "text": "UNITS       \"Events\"\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n        \"The value of this object identifies the Network-\n        side N392 error threshold value (nN2 for LMI) for\n        this UNI/NNI logical port.  If the logical port is\n        not performing network-side procedures, then this\n        object is not instantiated.\"\nREFERENCE   \"Q.933 Annex A [22],\n             T1.617 Annex D [17],\n             LMI [24]\"\nDEFVAL { 3 }\n::= { frMgtVCSigEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetN393 OBJECT-TYPE\n    SYNTAX      INTEGER (1..10)\n    UNITS       \"Events\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the Network-\n            side N393 monitored events count value (nN3 for\n            LMI) for this UNI/NNI logical port.  If the\n            logical port is not performing network-side\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17],\n                 LMI [24]\"\n    DEFVAL { 4 }\n    ::= { frMgtVCSigEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetT392 OBJECT-TYPE\n    SYNTAX      INTEGER (5..30)\n    UNITS       \"Seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the Network-\n            side T392 polling verification timer value (nT2\n            for LMI)  for this UNI/NNI logical port.  If the\n            logical port is not performing network-side\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17],\n                 LMI [24]\"\n    DEFVAL { 15 }\n    ::= { frMgtVCSigEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetnN4 OBJECT-TYPE SYNTAX INTEGER (5..5) UNITS \"Events\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of this object identifies the Network-side nN4 maximum status enquires received value for this UNI/NNI logical port. If the logical port is not performing network-side procedures or is not performing LMI procedures, then this object is not instantiated.",
      "zh-CHS": "frMgtVCSigNetnN4对象类型语法整数（5..5）单位“事件”最大访问只读状态当前说明“此对象的值标识此UNI/NNI逻辑端口的网络端nN4最大状态查询接收值。如果逻辑端口未执行网络端过程或未执行LMI过程，则不会实例化此对象。"
    },
    {
      "indent": 12,
      "text": "        This object applies only to LMI and always has a\n        value of 5.\"\nREFERENCE   \"LMI [24]\"\n::= { frMgtVCSigEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetnT3 OBJECT-TYPE SYNTAX INTEGER (5 | 10 | 15 | 20 | 25 | 30) UNITS \"Seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of this object identifies the Network-side nT3 timer (for nN4 status enquires received) value for this UNI/NNI logical port. If the logical port is not performing network-side procedures or is not performing LMI procedures, then this object is not instantiated.",
      "zh-CHS": "frMgtVCSigNetnT3对象类型语法整数（5 | 10 | 15 | 20 | 25 | 30）单位“秒”最大访问只读状态当前描述“此对象的值标识网络端nT3计时器（用于接收到的nN4状态查询）此UNI/NNI逻辑端口的值。如果逻辑端口未执行网络端过程或未执行LMI过程，则不会实例化此对象。"
    },
    {
      "indent": 14,
      "text": "        This object applies only to LMI.\"\nREFERENCE   \"LMI [24]\"\nDEFVAL { 20 }\n::= { frMgtVCSigEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserLinkRelErrors OBJECT-TYPE SYNTAX Counter32 UNITS \"Errors\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of user-side local in-channel signaling link reliability errors (i.e., non-receipt of Status/Status Enquiry messages or invalid sequence numbers in a Link Integrity Verification Information Element) for this UNI/NNI logical port. If the logical port is not",
      "zh-CHS": "FRMGTVCSIGUSERLINKRERRORS对象类型语法计数器32个单元“错误”MAX-ACCESS只读状态当前描述“用户端本地信道内信令链路可靠性错误的数量（即，未收到状态/状态查询消息或链路完整性验证信息元素中的无效序列号）用于此UNI/NNI逻辑端口。如果逻辑端口不是"
    },
    {
      "indent": 12,
      "text": "        performing user-side procedures, then this object\n        is not instantiated.\"\n::= { frMgtVCSigEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserProtErrors OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Errors\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of user-side local in-channel\n            signaling protocol errors (i.e., protocol\n            discriminator, unnumbered information, message\n            type, call reference, and mandatory information\n            element errors) for this UNI/NNI logical port. If\n            the logical port is not performing user-side\n            procedures, then this object is not instantiated.\"\n    ::= { frMgtVCSigEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "frMgtVCSigUserChanInactive OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Events\"\n    MAX-ACCESS  read-only\n      STATUS      current\n      DESCRIPTION\n              \"The number of times the user-side channel was\n              declared inactive (i.e., N392 errors in N393\n              events) for this UNI/NNI logical port. If the\n              logical port is not performing user-side\n              procedures, then this object is not instantiated.\"\n      ::= { frMgtVCSigEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetLinkRelErrors OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Errors\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of network-side local in-channel\n            signaling link reliability errors (i.e., non-\n            receipt of Status/Status Enquiry messages or\n            invalid sequence numbers in a Link Integrity\n            Verification Information Element) for this UNI/NNI\n            logical port.\"\n    ::= { frMgtVCSigEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetProtErrors OBJECT-TYPE SYNTAX Counter32",
      "zh-CHS": "FRMGTVCSIGNETPROTERRS对象类型语法计数器32"
    },
    {
      "indent": 12,
      "text": "UNITS       \"Errors\"\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n        \"The number of network-side local in-channel\n        signaling protocol errors (i.e., protocol\n        discriminator, message type, call reference, and\n        mandatory information element errors) for this\n        UNI/NNI logical port.\"\n::= { frMgtVCSigEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetChanInactive OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Events\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of times the network-side channel was\n            declared inactive (i.e., N392 errors in N393\n            events) for this UNI/NNI logical port.\"\n    ::= { frMgtVCSigEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigProcedAdmin OBJECT-TYPE\n    SYNTAX      INTEGER {\n                u2nnet(1),\n                bidirect(2),\n                u2nuser(3)\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the local\n            in-channel signaling procedural role that is used\n            for this UNI/NNI logical port.  Bidirectional\n            procedures implies that both user-side and\n            network-side procedural roles are used.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "u2nnet(1) Logical port operates user to network procedure in the role of the network side",
      "zh-CHS": "u2nnet（1）逻辑端口以网络端的角色操作用户到网络的过程"
    },
    {
      "indent": 20,
      "text": "bidirect(2) Logical port operates the bidirectional procedure (both user and network side roles)",
      "zh-CHS": "双向（2）逻辑端口操作双向过程（用户和网络端角色）"
    },
    {
      "indent": 20,
      "text": "u2nuser(3) Logical port operates user to network procedure in the role of the user side\"",
      "zh-CHS": "U2用户（3）逻辑端口以用户端的角色操作用户到网络过程”"
    },
    {
      "indent": 12,
      "text": "REFERENCE   \"Q.933 Annex A [22],\n             T1.617 Annex D [17]\"\nDEFVAL { u2nnet }\n::= { frMgtVCSigEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserN391Admin OBJECT-TYPE\n    SYNTAX      INTEGER (1..255)\n    UNITS       \"Polls\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            User-side N391 full status polling cycle value for\n            this UNI/NNI logical port.  If the logical port is\n            not performing user-side (bidirectional)\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17]\"\n    ::= { frMgtVCSigEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserN392Admin OBJECT-TYPE\n    SYNTAX      INTEGER (1..10)\n    UNITS       \"Events\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            User-side N392 error threshold value for this\n            UNI/NNI logical port.  If the logical port is not\n            performing user-side (bidirectional) procedures,\n            then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17]\"\n    ::= { frMgtVCSigEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserN393Admin OBJECT-TYPE SYNTAX INTEGER (1..10) UNITS \"Events\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The value of this object identifies the desired User-side N393 monitored events count value for this UNI/NNI logical port. If the logical port is not performing user-side (bidirectional) procedures, then this object is not instantiated.\" REFERENCE \"Q.933 Annex A [22], T1.617 Annex D [17]\"",
      "zh-CHS": "frMgtVCSigUserN393Admin对象类型语法整数（1..10）单位“事件”最大访问读写状态当前描述“此对象的值标识此UNI/NNI逻辑端口的所需用户端N393监视事件计数值。如果逻辑端口未执行用户端（双向）程序，则该对象未实例化。“参考”Q.933附录A[22]，T1.617附录D[17]"
    },
    {
      "indent": 12,
      "text": "::= { frMgtVCSigEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserT391Admin OBJECT-TYPE\n    SYNTAX      INTEGER (5..30)\n    UNITS       \"Seconds\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            User-side T391 link integrity verification polling\n            timer value for this UNI/NNI logical port.  If the\n            logical port is not performing user-side\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17]\"\n    ::= { frMgtVCSigEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetN392Admin OBJECT-TYPE\n    SYNTAX      INTEGER (1..10)\n    UNITS       \"Events\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            Network-side N392 error threshold value (nN2 for\n            LMI) for this UNI/NNI logical port.  If the\n            logical port is not performing network-side\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17],\n                 LMI [24]\"\n    ::= { frMgtVCSigEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetN393Admin OBJECT-TYPE\n    SYNTAX      INTEGER (1..10)\n    UNITS       \"Events\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            Network-side N393 monitored events count value\n            (nN3 for LMI) for this UNI/NNI logical port.  If\n            the logical port is not performing network-side\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17],\n                 LMI [24]\"\n    ::= { frMgtVCSigEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetT392Admin OBJECT-TYPE\n    SYNTAX      INTEGER (5..30)\n    UNITS       \"Seconds\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            Network-side T392 polling verification timer value\n            (nT2 for LMI)  for this UNI/NNI logical port. If\n            the logical port is not performing network-side\n            procedures, then this object is not instantiated.\"\n    REFERENCE   \"Q.933 Annex A [22],\n                 T1.617 Annex D [17],\n                 LMI [24]\"\n    ::= { frMgtVCSigEntry 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetnT3Admin OBJECT-TYPE\n    SYNTAX      INTEGER (5 | 10 | 15 | 20 | 25 | 30)\n    UNITS       \"Seconds\"\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            Network-side nT3 timer (for nN4 status enquires\n            received) value for this UNI/NNI logical port. If\n            the logical port is not performing network-side\n            procedures or is not performing LMI procedures,\n            then this object is not instantiated.  This object\n            applies only to LMI.\"\n    REFERENCE   \"LMI [24]\"\n    ::= { frMgtVCSigEntry 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- -- Frame Relay PVC End-points --",
      "zh-CHS": "----机架继电器PVC端点--"
    },
    {
      "indent": 8,
      "text": "frPVCEndptTable OBJECT-TYPE SYNTAX SEQUENCE OF FrPVCEndptEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The Frame Relay PVC End-Point table. This table is used to model a PVC end-point. This table contains the traffic parameters and statistics for a PVC end-point.",
      "zh-CHS": "FRPVCENDPTRY MAX-ACCESS的FRPVCENDPTRABLE对象类型语法序列不可访问状态当前描述“帧中继PVC端点表。此表用于为PVC端点建模。此表包含PVC端点的流量参数和统计信息。"
    },
    {
      "indent": 20,
      "text": "This table is used to identify the traffic parameters for a bi-directional PVC segment end-",
      "zh-CHS": "此表用于确定双向PVC段端的交通参数-"
    },
    {
      "indent": 20,
      "text": "point, and it also provides statistics for a PVC segment end-point.",
      "zh-CHS": "点，它还提供PVC段终点的统计信息。"
    },
    {
      "indent": 20,
      "text": "A PVC segment end-point is identified by a UNI/NNI logical port index value and DLCI index value.",
      "zh-CHS": "PVC段端点由UNI/NNI逻辑端口索引值和DLCI索引值标识。"
    },
    {
      "indent": 20,
      "text": "If the frame relay service provider allows the frame relay CNM subscriber to create, modify or delete PVCs using SNMP, then this table is used to identify and reserve the requested traffic parameters of each PVC segment end-point. The Connection table is used to 'connect' the end-points together. Not all implementations will support the capability of creating/modifying/deleting PVCs using SNMP as a feature of frame relay CNM service.",
      "zh-CHS": "如果帧中继服务提供商允许帧中继CNM订户使用SNMP创建、修改或删除PVC，则此表用于标识和保留每个PVC段端点的请求流量参数。连接表用于将端点“连接”在一起。并非所有实现都支持使用SNMP作为帧中继CNM服务的一项功能来创建/修改/删除PVC。"
    },
    {
      "indent": 20,
      "text": "Uni-directional PVCs are modeled with zero valued traffic parameters in one of the directions (In or Out direction) in this table.",
      "zh-CHS": "单向PVC使用本表中一个方向（向内或向外）的零值交通参数建模。"
    },
    {
      "indent": 20,
      "text": "To create a PVC, the following procedures shall be followed:",
      "zh-CHS": "要创建PVC，应遵循以下程序："
    },
    {
      "indent": 20,
      "text": "1) Create the entries for the PVC segment endpoints in the frPVCEndptTable by specifying the traffic parameters for the bi-directional PVC segment endpoints. As shown in figure 2, a point-to-point PVC has two endpoints, thus two entries in this table. Uni-directional PVCs are modeled with zero valued traffic parameters in one direction; all the `In' direction parameters for one frame relay PVC End-point or all the `Out' direction parameters for the other frame relay PVC Endpoint.",
      "zh-CHS": "1) 通过指定双向PVC段端点的流量参数，在frPVCEndptTable中为PVC段端点创建条目。如图2所示，点到点PVC有两个端点，因此该表中有两个条目。单向PVC采用单向零值交通参数建模；一个帧中继PVC端点的所有“In”方向参数或另一个帧中继PVC端点的所有“Out”方向参数。"
    },
    {
      "indent": 21,
      "text": "   In    _____________________________  Out\n  >>>>>>|                             |>>>>>>>>\n  ______|    Frame Relay Network      |________\n   Out  |                             |  In\n  <<<<<<|_____________________________|<<<<<<<<\nFrame Relay                         Frame Relay\n    PVC                                 PVC\n  Endpoint                            Endpoint",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 32,
      "text": "Figure 2, PVC Terminology",
      "zh-CHS": "图2，PVC术语"
    },
    {
      "indent": 12,
      "text": "        2)  Go to the Frame Relay Connection Group.\"\n::= { frnetservObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptEntry OBJECT-TYPE\n    SYNTAX      FrPVCEndptEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"An entry in the Frame Relay PVC Endpoint table.\"\n    INDEX   { ifIndex, frPVCEndptDLCIIndex }\n    ::= { frPVCEndptTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "FrPVCEndptEntry ::=\n    SEQUENCE {\n        frPVCEndptDLCIIndex            Integer32,\n        frPVCEndptInMaxFrameSize       Integer32,\n        frPVCEndptInBc                 Integer32,\n        frPVCEndptInBe                 Integer32,\n        frPVCEndptInCIR                Integer32,\n        frPVCEndptOutMaxFrameSize      Integer32,\n        frPVCEndptOutBc                Integer32,\n        frPVCEndptOutBe                Integer32,\n        frPVCEndptOutCIR               Integer32,\n        frPVCEndptConnectIdentifier    Integer32,\n        frPVCEndptRowStatus            RowStatus,\n        frPVCEndptRcvdSigStatus        INTEGER,\n        frPVCEndptInFrames             Counter32,\n        frPVCEndptOutFrames            Counter32,\n        frPVCEndptInDEFrames           Counter32,\n        frPVCEndptInExcessFrames       Counter32,\n        frPVCEndptOutExcessFrames      Counter32,\n        frPVCEndptInDiscards           Counter32,\n        frPVCEndptInOctets             Counter32,\n        frPVCEndptOutOctets            Counter32,\n        frPVCEndptInDiscardsDESet      Counter32,\n        frPVCEndptInFramesFECNSet      Counter32,\n        frPVCEndptOutFramesFECNSet     Counter32,\n        frPVCEndptInFramesBECNSet      Counter32,\n        frPVCEndptOutFramesBECNSet     Counter32,\n        frPVCEndptInCongDiscards       Counter32,\n        frPVCEndptInDECongDiscards     Counter32,\n        frPVCEndptOutCongDiscards      Counter32,\n        frPVCEndptOutDECongDiscards    Counter32,\n        frPVCEndptOutDEFrames          Counter32,\n        frPVCEndptAtmIwfConnIndex      Integer32",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "}",
      "zh-CHS": "}"
    },
    {
      "indent": 8,
      "text": "frPVCEndptDLCIIndex OBJECT-TYPE SYNTAX Integer32 (16..4194303) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The value of this object is equal to the DLCI value for this PVC end-point.",
      "zh-CHS": "frPVCEndptDLCIIndex对象类型语法整数32（16..4194303）MAX-ACCESS不可访问状态当前描述“此对象的值等于此PVC端点的DLCI值。"
    },
    {
      "indent": 12,
      "text": "        The values are restricted to the legal range for\n        the size of address field supported by the logical\n        port (frLportAddrDLCILen).\"\nREFERENCE   \"Q.922 [25]\"\n::= { frPVCEndptEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInMaxFrameSize OBJECT-TYPE\n    SYNTAX      Integer32 (1..4096)\n    UNITS       \"Octets\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is the size in octets of\n            the largest frame relay information field for this\n            PVC end-point in the ingress direction (into the\n            frame relay network).  The value of\n            frPVCEndptInMaxFrameSize must be less than or\n            equal to the corresponding ifMtu for this frame\n            relay UNI/NNI logical port.\"\n    REFERENCE   \"FRF.1 [31]\n                 Q.922 [25]\n                 Q.933 [22]\"\n    DEFVAL { 1600 }\n    ::= { frPVCEndptEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInBc OBJECT-TYPE SYNTAX Integer32 (1..2147483647) UNITS \"Bits\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is equal to the committed burst size (Bc) parameter (measured in bits) for this PVC end-point in the ingress direction (into the frame relay network).",
      "zh-CHS": "frPVCEndptInBc对象类型语法整数32（1..2147483647）单位“位”最大访问读取创建状态当前描述“此对象的值等于入口方向（进入帧中继网络）此PVC端点的提交突发大小（Bc）参数（以位计）。"
    },
    {
      "indent": 20,
      "text": "Note that the max value of this range is lower than the max value allowed by Q.933 (16383 * 10**6).",
      "zh-CHS": "请注意，该范围的最大值低于Q.933允许的最大值（16383*10**6）。"
    },
    {
      "indent": 12,
      "text": "        Note that the value is encoded in bits whilst the\n        Q.933 Link layer core parameters information\n        element encodes this information using octet\n        units.\"\nREFERENCE   \"Q.933 [22]\"\n::= { frPVCEndptEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInBe OBJECT-TYPE SYNTAX Integer32 (1..2147483647) UNITS \"Bits\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is equal to the excess burst size (Be) parameter (measured in bits) for this PVC end-point in the ingress direction (into the frame relay network).",
      "zh-CHS": "frPVCEndptInBe对象类型语法整数32（1..2147483647）单位“位”MAX-ACCESS read create STATUS current DESCRIPTION“此对象的值等于入口方向（进入帧中继网络）此PVC端点的过量突发大小（Be）参数（以位为单位）。"
    },
    {
      "indent": 20,
      "text": "Note that the max value of this range is lower than the max value allowed by Q.933 (16383 * 10**6).",
      "zh-CHS": "请注意，该范围的最大值低于Q.933允许的最大值（16383*10**6）。"
    },
    {
      "indent": 12,
      "text": "        Note that the value is encoded in bits whilst the\n        Q.933 Link layer core parameters information\n        element encodes this information using octet\n        units.\"\nREFERENCE   \"Q.933 [22]\"\n::= { frPVCEndptEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInCIR OBJECT-TYPE SYNTAX Integer32 (1..2147483647) UNITS \"Bits per Second\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is equal to the committed information rate (CIR) parameter (measured in bits per second) for this PVC end-point in the ingress direction (into the frame relay network).",
      "zh-CHS": "frPVCEndptInCIR对象类型语法整数32（1..2147483647）单位“每秒位”最大访问读取创建状态当前描述“此对象的值等于入口方向（进入帧中继网络）此PVC端点的提交信息速率（CIR）参数（以每秒位计）。"
    },
    {
      "indent": 12,
      "text": "        Note that the max value of this range is lower\n        than the max value allowed by Q.933 (2047 *\n        10**6).\"\nREFERENCE   \"Q.933 [22]\"\n::= { frPVCEndptEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutMaxFrameSize OBJECT-TYPE",
      "zh-CHS": "frPVCEndptOutMaxFrameSize对象类型"
    },
    {
      "indent": 12,
      "text": "SYNTAX      Integer32 (1..4096)\nUNITS       \"Octets\"\nMAX-ACCESS  read-create\nSTATUS      current\nDESCRIPTION\n        \"The value of this object is the size in octets of\n        the largest frame relay information field for this\n        PVC end-point in the egress direction (out of the\n        frame relay network).  The value of\n        frPVCEndptOutMaxFrameSize must be less than or\n        equal to the corresponding ifMtu for this frame\n        relay UNI/NNI logical port.\"\nREFERENCE   \"FRF.1 [31]\n             Q.922 [25]\n             Q.933 [22]\"\nDEFVAL { 1600 }\n::= { frPVCEndptEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutBc OBJECT-TYPE SYNTAX Integer32 (1..2147483647) UNITS \"Bits\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is equal to the committed burst size (Bc) parameter (measured in bits) for this PVC end-point in the egress direction (out of the frame relay network).",
      "zh-CHS": "frPVCEndptOutBc对象类型语法整数32（1..2147483647）单位“位”MAX-ACCESS read create STATUS current DESCRIPTION“此对象的值等于出口方向（帧中继网络外）此PVC端点的提交突发大小（Bc）参数（以位为单位）。"
    },
    {
      "indent": 20,
      "text": "Note that the max value of this range is lower than the max value allowed by Q.933 (16383 * 10**6).",
      "zh-CHS": "请注意，该范围的最大值低于Q.933允许的最大值（16383*10**6）。"
    },
    {
      "indent": 12,
      "text": "        Note that the value is encoded in bits whilst the\n        Q.933 Link layer core parameters information\n        element encodes this information using octet\n        units.\"\nREFERENCE   \"Q.933 [22]\"\n::= { frPVCEndptEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutBe OBJECT-TYPE SYNTAX Integer32 (1..2147483647) UNITS \"Bits\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is equal to the excess burst size (Be) parameter (measured in bits) for",
      "zh-CHS": "frPVCEndptOutBe对象类型语法整数32（1..2147483647）单位“位”最大访问读取创建状态当前描述“此对象的值等于"
    },
    {
      "indent": 20,
      "text": "this PVC end-point in the egress direction (out of the frame relay network).",
      "zh-CHS": "该PVC端点位于出口方向（帧外中继网络）。"
    },
    {
      "indent": 20,
      "text": "Note that the max value of this range is lower than the max value allowed by Q.933 (16383 * 10**6).",
      "zh-CHS": "请注意，该范围的最大值低于Q.933允许的最大值（16383*10**6）。"
    },
    {
      "indent": 12,
      "text": "        Note that the value is encoded in bits whilst the\n        Q.933 Link layer core parameters information\n        element encodes this information using octet\n        units.\"\nREFERENCE   \"Q.933 [22]\"\n::= { frPVCEndptEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutCIR OBJECT-TYPE SYNTAX Integer32 (1..2147483647) UNITS \"Bits per Second\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is equal to the committed information rate (CIR) parameter (measured in bits per second) for this PVC end-point in the egress direction (out of the frame relay network).",
      "zh-CHS": "frPVCEndptOutCIR对象类型语法整数32（1..2147483647）单位“每秒位”最大访问读取创建状态当前描述“此对象的值等于出口方向（帧中继网络外）此PVC端点的提交信息速率（CIR）参数（以每秒位计）。"
    },
    {
      "indent": 12,
      "text": "        Note that the max value of this range is lower\n        than the max value allowed by Q.933 (2047 *\n        10**6).\"\nREFERENCE   \"Q.933 [22]\"\n::= { frPVCEndptEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptConnectIdentifier OBJECT-TYPE SYNTAX Integer32 (0..2147483647) MAX-ACCESS read-only STATUS current DESCRIPTION \"This object is used to associate PVC end-points as being part of one PVC segment connection. This value of this object is equal to the value of frPVCConnectIndex, which is used as one of the indices into the frPVCConnectTable.",
      "zh-CHS": "frPVCEndptConnectIdentifier对象类型语法整数32（0..2147483647）MAX-ACCESS只读状态当前描述“此对象用于将PVC端点关联为一个PVC段连接的一部分。此对象的值等于frPVCConnectIndex的值，该值用作frPVCConnectTable的索引之一。"
    },
    {
      "indent": 20,
      "text": "A connection that has been cross-connected via the FR/ATM PVC Service IWF cross-connect table will return the value zero when this object is read. In case of these interworked connections, the frPVCEndptAtmIwfConnIndex object must be accessed",
      "zh-CHS": "当读取此对象时，通过FR/ATM PVC服务IWF交叉连接表交叉连接的连接将返回值零。对于这些互连连接，必须访问FRPVCENDPTATMIWFCONNDINDEX对象"
    },
    {
      "indent": 20,
      "text": "to select the entry in the FR/ATM PVC Service IWF cross-connect table.",
      "zh-CHS": "选择FR/ATM PVC服务IWF交叉连接表中的条目。"
    },
    {
      "indent": 12,
      "text": "        The value of this object is provided by the agent,\n        after the associated entries in the\n        frPVCConnectTable or frAtmIwfConnectionTable have\n        been created.\"\n::= { frPVCEndptEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptRowStatus OBJECT-TYPE\n    SYNTAX      RowStatus\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This object is used to create new rows in this\n            table, modify existing rows, and to delete\n            existing rows.  To create a new PVC, the entries\n            for the PVC segment end-points in the\n            frPVCEndptTable must first be created.  Next, the\n            frPVCConnectTable is used to associate the frame\n            relay PVC segment end-points.  In order for the\n            manager to have the necessary error diagnostics,\n            the frPVCEndptRowStatus object must initially be\n            set to `createAndWait(5)'.  While the\n            frPVCEndptRowStatus object is in the\n            `createAndWait(5)' state, the manager can set each\n            columnar object and get the necessary error\n            diagnostics.  The frPVCEndptRowStatus object may\n            not be set to `active(1)' unless the following\n            columnar objects exist in this row:\n            frPVCEndptInMaxFrameSize, frPVCEndptInBc,\n            frPVCEndptInBe, frPVCEndptInCIR,\n            frPVCEndptOutMaxFrameSize, frPVCEndptOutBc,\n            frPVCEndptOutBe, and frPVCEndptOutCIR.\"\n    ::= { frPVCEndptEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptRcvdSigStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                deleted(1),\n                active(2),\n                inactive(3),\n                none(4)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the PVC\n            status received via the local in-channel signaling",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "procedures for this PVC end-point. This object is only pertinent for interfaces that perform the bidirectional procedures.",
      "zh-CHS": "该PVC端点的程序。此对象仅与执行双向过程的接口相关。"
    },
    {
      "indent": 20,
      "text": "Each value has the following meaning: deleted(1): This PVC is not listed in the full status reports received from the user device. The object retains this value for as long as the PVC is not listed in the full status reports",
      "zh-CHS": "每个值具有以下含义：已删除（1）：从用户设备接收的完整状态报告中未列出此PVC。只要PVC未在完整状态报告中列出，对象就会保留此值"
    },
    {
      "indent": 20,
      "text": "active(2): This PVC is reported as active, or operational, by the user device.",
      "zh-CHS": "活动（2）：用户设备将此PVC报告为活动或可操作。"
    },
    {
      "indent": 22,
      "text": "inactive(3): This PVC is reported as inactive, or non-operational, by the user device.",
      "zh-CHS": "非活动（3）：用户设备将此PVC报告为非活动或不可操作。"
    },
    {
      "indent": 12,
      "text": "          none(4):     This interface is only using the\n                       network-side in-channel signaling\n                       procedures, so this object does\n                       not apply.\"\n::= { frPVCEndptEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInFrames OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames received by the network\n            (ingress) for this PVC end-point. This includes\n            any frames discarded by the network due to\n            submitting more than Bc + Be data or due to any\n            network congestion recovery procedures.\"\n    ::= { frPVCEndptEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutFrames OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames sent by the network (egress)\n            regardless of whether they are Bc or Be frames for\n            this PVC end-point.\"\n    ::= { frPVCEndptEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInDEFrames OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames received by the network\n            (ingress) with the DE bit set to (1) for this PVC\n            end-point.\"\n    ::= { frPVCEndptEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInExcessFrames OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames received by the network\n            (ingress) for this PVC end-point which were\n            treated as excess traffic.  Frames which are sent\n            to the network with DE set to zero are treated as\n            excess when more than Bc bits are submitted to the\n            network during the Committed Information Rate\n            Measurement Interval (Tc).  Excess traffic may or\n            may not be discarded at the ingress if more than\n            Bc + Be bits are submitted to the network during\n            Tc.  Traffic discarded at the ingress is not\n            recorded in frPVCEndptInExcessFrames.  Frames\n            which are sent to the network with DE set to one\n            are also treated as excess traffic.\"\n    ::= { frPVCEndptEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutExcessFrames OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames sent by the network (egress)\n            for this PVC end-point which were treated as\n            excess traffic.  (The DE bit may be set to one.)\"\n    ::= { frPVCEndptEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInDiscards OBJECT-TYPE SYNTAX Counter32 UNITS \"Frames\" MAX-ACCESS read-only STATUS current",
      "zh-CHS": "FRPVCENDPTIN丢弃对象类型语法计数器32个单元“帧”最大访问只读状态当前"
    },
    {
      "indent": 12,
      "text": "DESCRIPTION\n        \"The number of frames received by the network\n        (ingress) that were discarded due to traffic\n        enforcement for this PVC end-point.  Congestion\n        discards are not counted in this object.\"\n::= { frPVCEndptEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInOctets OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Octets\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of octets received by the network\n            (ingress) for this PVC end-point.  This counter\n            should only count octets from the beginning of the\n            frame relay header field to the end of user data.\n            If the network supporting frame relay can not\n            count octets, then this count should be an\n            approximation.\"\n    ::= { frPVCEndptEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutOctets OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Octets\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of octets sent by the network (egress)\n            for this PVC end-point.  This counter should only\n            count octets from the beginning of the frame relay\n            header field to the end of user data.  If the\n            network supporting frame relay can not count\n            octets, then this count should be an\n            approximation.\"\n    ::= { frPVCEndptEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInDiscardsDESet OBJECT-TYPE SYNTAX Counter32 UNITS \"Frames\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of frames received by the network (ingress) that were discarded with the DE bit set due to traffic enforcement for this PVC end-point. Congestion discards are not counted in this object.\"",
      "zh-CHS": "FRPVCENDPTINDISCARDESET对象类型语法计数器32个单位“帧”MAX-ACCESS只读状态当前描述“由于此PVC端点的流量强制，网络（入口）接收到的使用DE位集丢弃的帧数。此对象中不计算拥塞丢弃。”"
    },
    {
      "indent": 12,
      "text": "::= { frPVCEndptEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInFramesFECNSet OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames received by the network\n            (ingress) that have the FECN bit set for this PVC\n            end-point.\"\n    ::= { frPVCEndptEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutFramesFECNSet OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames sent by the network (egress)\n            that have the FECN bit set for this PVC end-\n            point.\"\n    ::= { frPVCEndptEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInFramesBECNSet OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames received by the network\n            (ingress) that have the BECN bit set for this PVC\n            end-point.\"\n    ::= { frPVCEndptEntry 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutFramesBECNSet OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames sent by the network (egress)\n            that have the BECN bit set for this PVC end-\n            point.\"\n    ::= { frPVCEndptEntry 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInCongDiscards OBJECT-TYPE SYNTAX Counter32",
      "zh-CHS": "FRPVCENDPTINCONG丢弃对象类型语法计数器32"
    },
    {
      "indent": 12,
      "text": "UNITS       \"Frames\"\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n        \"The number of frames received by the network\n        (ingress) that were discarded due to input buffer\n        congestion, rather than traffic enforcement, for\n        this PVC end-point.\"\n::= { frPVCEndptEntry 26 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptInDECongDiscards OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames counted by\n            frPVCEndptInCongDiscards with the DE bit set to\n            (1).\"\n    ::= { frPVCEndptEntry 27 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutCongDiscards OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames sent by the network (egress)\n            that were discarded due to output buffer\n            congestion for this PVC end-point.\"\n    ::= { frPVCEndptEntry 28 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutDECongDiscards OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Frames\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The number of frames counted by\n            frPVCEndptOutCongDiscards with the DE bit set to\n            (1).\"\n    ::= { frPVCEndptEntry 29 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptOutDEFrames OBJECT-TYPE SYNTAX Counter32 UNITS \"Frames\" MAX-ACCESS read-only STATUS current",
      "zh-CHS": "frPVCEndptOutDEFrames对象类型语法计数器32个单元“帧”最大访问只读状态当前"
    },
    {
      "indent": 12,
      "text": "DESCRIPTION\n        \"The number of frames sent by the network (egress)\n        with the DE bit set to (1) for this PVC end-\n        point.\"\n::= { frPVCEndptEntry 30 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCEndptAtmIwfConnIndex OBJECT-TYPE SYNTAX Integer32 (0..2147483647) MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains the index value of the FR/ATM cross-connect table entry used to link the frame relay PVC with an ATM PVC.",
      "zh-CHS": "FRPVCENDPTATMIWFCONNDINDEX对象类型语法整数32（0..2147483647）最大访问只读状态当前描述“此对象包含用于将帧中继PVC与ATM PVC链接的FR/ATM交叉连接表项的索引值。"
    },
    {
      "indent": 20,
      "text": "Each row of the frPVCEndptTable that is not cross-connected with an ATM PVC must return the value zero when this object is read.",
      "zh-CHS": "读取此对象时，未与ATM PVC交叉连接的frPVCEndptTable的每一行必须返回值零。"
    },
    {
      "indent": 20,
      "text": "The value of this object is initialized by the agent after the associated entries in the frAtmIwfConnectionTable have been created.",
      "zh-CHS": "此对象的值由代理在frAtmIwfConnectionTable中的关联项创建后初始化。"
    },
    {
      "indent": 12,
      "text": "        The value of this object is reset to zero\n        following destruction of the associated entry in\n        the frAtmIwfConnectionTable\"\n::= { frPVCEndptEntry 31 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- -- Frame Relay PVC Connections --",
      "zh-CHS": "----框架继电器PVC连接--"
    },
    {
      "indent": 8,
      "text": "frPVCConnectIndexValue OBJECT-TYPE SYNTAX INTEGER (0..2147483647) MAX-ACCESS read-only STATUS current DESCRIPTION \"This object returns a hint to be used for frPVCConnectIndex when creating entries in the frPVCConnectTable.",
      "zh-CHS": "frPVCConnectIndexValue对象类型语法整数（0..2147483647）MAX-ACCESS只读状态当前描述“此对象返回在frPVCConnectTable中创建项时用于frPVCConnectIndex的提示。"
    },
    {
      "indent": 20,
      "text": "The value 0 indicates that no unassigned entries are available.",
      "zh-CHS": "值0表示没有可用的未分配项。"
    },
    {
      "indent": 20,
      "text": "To obtain the frPVCConnectIndex value for a new entry, the manager issues a management protocol retrieval operation to obtain the current value of this object. After each retrieval, the agent must",
      "zh-CHS": "要获取新条目的frPVCConnectIndex值，管理器将发出管理协议检索操作以获取此对象的当前值。每次检索之后，代理必须"
    },
    {
      "indent": 20,
      "text": "modify the value to the next unassigned index to prevent assignment of the same value to multiple management systems.",
      "zh-CHS": "将该值修改为下一个未分配索引，以防止将同一值分配给多个管理系统。"
    },
    {
      "indent": 12,
      "text": "        A management system should repeat the read to\n        obtain a new value should an attempt to create the\n        new row using the previously returned hint fail.\"\n::= { frnetservObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectTable OBJECT-TYPE SYNTAX SEQUENCE OF FrPVCConnectEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The Frame Relay PVC Connect Table is used to model the bi-directional PVC segment flows including: point-to-point PVCs, point-to-multipoint PVCs, and multipoint-to-multipoint PVCs.",
      "zh-CHS": "frPVCConnectTable对象类型语法序列FrPVCConnectEntry MAX-ACCESS不可访问状态当前描述“帧中继PVC连接表用于对双向PVC段流进行建模，包括：点对点PVC、点对多点PVC和多点对多点PVC。"
    },
    {
      "indent": 20,
      "text": "This table has read-create access and is used to associate PVC end-points together as belonging to one connection. The frPVCConnectIndex is used to associate all the bi-directional flows. Not all implementations will support the capability of creating/modifying/deleting PVCs using SNMP as a feature of frame relay CNM service.",
      "zh-CHS": "此表具有读取-创建访问权限，用于将PVC端点关联在一起，作为属于一个连接。frPVCConnectIndex用于关联所有双向流。并非所有实现都支持使用SNMP作为帧中继CNM服务的一项功能来创建/修改/删除PVC。"
    },
    {
      "indent": 20,
      "text": "Once the entries in the frPVCEndptTable are created, the following step are used to associate the PVC end-points as belonging to one PVC connection:",
      "zh-CHS": "创建frPVCEndptTable中的条目后，使用以下步骤将PVC端点关联为属于一个PVC连接："
    },
    {
      "indent": 20,
      "text": "1) Obtain a unique frPVCConnectIndex using the frPVCConnectIndexValue object.",
      "zh-CHS": "1) 使用frPVCConnectIndexValue对象获取唯一的frPVCConnectIndex。"
    },
    {
      "indent": 20,
      "text": "2) Connect the PVC segment endpoints together with the applicable frPVCConnectIndex value obtained via frPVCConnectIndexValue. The entries in this table are created by using the frPVCConnectRowStatus object.",
      "zh-CHS": "2) 将PVC段端点与通过frPVCConnectIndexValue获得的适用frPVCConnectIndex值连接在一起。此表中的条目是使用frPVCConnectRowStatus对象创建的。"
    },
    {
      "indent": 20,
      "text": "3) The agent will provide the value of the corresponding instances of frPVCEndptConnectIdentifier with the frPVCConnectIndex value.",
      "zh-CHS": "3) 代理将使用frPVCConnectIndex值提供frPVCEndptConnectIdentifier的相应实例的值。"
    },
    {
      "indent": 20,
      "text": "4) Set frPVCConnectAdminStatus to `active(1)' in",
      "zh-CHS": "4) 在中将frPVCConnectAdminStatus设置为“活动（1）”"
    },
    {
      "indent": 24,
      "text": "all rows for this PVC segment to turn the PVC on.",
      "zh-CHS": "此PVC段的所有行都将打开PVC。"
    },
    {
      "indent": 20,
      "text": "For example, the Frame Relay PVC Connection Group models a bi-directional, point-to-point PVC segment as one entry in this table.",
      "zh-CHS": "例如，帧中继PVC连接组将双向点对点PVC段建模为该表中的一个条目。"
    },
    {
      "indent": 20,
      "text": "Frame Relay                           Frame Relay\n Network                                 Network\n Low Port                               High Port\n         __________________________________\n        |                                  |\n   _____| >> from low to high PVC flow  >> |_____\n        | << from high to low PVC flow  << |\n        |__________________________________|",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "The terms low and high are chosen to represent numerical ordering of a PVC segment's endpoints for representation in this table. That is, the endpoint with the lower value of ifIndex is termed 'low', while the opposite endpoint of the segment is termed 'high'. This terminology is to provide directional information; for example the frPVCConnectL2hOperStatus and frPVCConnectH2lOperStatus as illustrated above.",
      "zh-CHS": "选择术语“低”和“高”来表示PVC段端点的数字顺序，以便在本表中表示。也就是说，ifIndex值较低的端点称为“低”，而段的相反端点称为“高”。该术语用于提供方向信息；例如，如上所示的frPVCConnectL2hOperStatus和frPVCConnectH2lOperStatus。"
    },
    {
      "indent": 20,
      "text": "If the Frame Relay Connection table is used to model a unidirectional PVC, then one direction (either from low to high or from high to low) has its Operational Status equal to down.",
      "zh-CHS": "如果帧中继连接表用于模拟单向PVC，则一个方向（从低到高或从高到低）的运行状态等于向下。"
    },
    {
      "indent": 12,
      "text": "         A PVC segment is a portion of a PVC that traverses\n        one Frame Relay Network, and a PVC segment is\n        identified by its two end-points (UNI/NNI logical\n        port index value and DLCI index value) through one\n        Frame Relay Network.\"\n::= { frnetservObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectEntry OBJECT-TYPE SYNTAX FrPVCConnectEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An entry in the Frame Relay PVC Connect table. This entry is used to model a PVC segment in two directions.\" INDEX { frPVCConnectIndex, frPVCConnectLowIfIndex,",
      "zh-CHS": "frPVCConnectEntry对象类型语法frPVCConnectEntry MAX-ACCESS不可访问状态当前描述“帧中继PVC连接表中的一个条目。此条目用于在两个方向上对PVC段建模。”索引{frPVCConnectIndex，FRPVCConnectLowifiIndex，"
    },
    {
      "indent": 12,
      "text": "        frPVCConnectLowDLCIIndex,\n        frPVCConnectHighIfIndex,\n        frPVCConnectHighDLCIIndex }\n::= { frPVCConnectTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "FrPVCConnectEntry ::=\n    SEQUENCE {\n        frPVCConnectIndex            Integer32,\n        frPVCConnectLowIfIndex       InterfaceIndex,\n        frPVCConnectLowDLCIIndex     Integer32,\n        frPVCConnectHighIfIndex      InterfaceIndex,\n        frPVCConnectHighDLCIIndex    Integer32,\n        frPVCConnectAdminStatus      INTEGER,\n        frPVCConnectL2hOperStatus    INTEGER,\n        frPVCConnectH2lOperStatus    INTEGER,\n        frPVCConnectL2hLastChange    TimeStamp,\n        frPVCConnectH2lLastChange    TimeStamp,\n        frPVCConnectRowStatus        RowStatus,\n        frPVCConnectUserName         SnmpAdminString,\n        frPVCConnectProviderName     SnmpAdminString\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "frPVCConnectIndex OBJECT-TYPE\n    SYNTAX      Integer32 (0..2147483647)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the\n            frPVCConnectIndexValue obtained to uniquely\n            identify this PVC segment connection.\"\n    ::= { frPVCConnectEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectLowIfIndex OBJECT-TYPE SYNTAX InterfaceIndex MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The value of this object is equal to IF-MIB ifIndex value of the UNI/NNI logical port for this PVC segment. The term low implies that this PVC segment end-point has the numerically lower ifIndex value than the connected/associated PVC segment end-point.",
      "zh-CHS": "FRPVCConnectLowiIndex对象类型语法接口Index MAX-ACCESS不可访问状态当前描述“此对象的值等于此PVC段的UNI/NNI逻辑端口的IF-MIB ifIndex值。术语low表示该PVC段端点的ifIndex值在数值上低于连接/相关PVC段端点。"
    },
    {
      "indent": 20,
      "text": "RFC 1604 permitted a zero value for this object to identify termination at a non-frame relay interface. However, this cross-connect table is limited to frame relay connections. See the frame",
      "zh-CHS": "RFC 1604允许该对象的零值来标识非帧中继接口处的终端。但是，此交叉连接表仅限于帧中继连接。看到框架了吗"
    },
    {
      "indent": 12,
      "text": "        relay/ATM IWF MIB [28] for the cross-connect table\n        used for those types of connections.\"\n::= { frPVCConnectEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectLowDLCIIndex OBJECT-TYPE\n    SYNTAX      Integer32 (16..4194303)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the DLCI\n            value for this end-point of the PVC segment.\"\n    REFERENCE   \"Q.922 [25]\"\n    ::= { frPVCConnectEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectHighIfIndex OBJECT-TYPE\n    SYNTAX      InterfaceIndex\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to IF-MIB\n            ifIndex value for the UNI/NNI logical port for\n            this PVC segment.  The term high implies that this\n            PVC segment end-point has the numerically higher\n            ifIndex value than the connected/associated PVC\n            segment end-point.\"\n    ::= { frPVCConnectEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectHighDLCIIndex OBJECT-TYPE\n    SYNTAX      Integer32 (16..4194303)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the egress\n            DLCI value for this end-point of the PVC segment.\"\n    REFERENCE   \"Q.922 [25]\"\n    ::= { frPVCConnectEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectAdminStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                active(1),\n                inactive(2),\n                testing(3)\n                }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the desired\n            administrative status of this bi-directional PVC",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "        segment.  The active(1) state means the PVC\n        segment is currently operational; the inactive(2)\n        state means the PVC segment is currently not\n        operational; the testing(3) state means the PVC\n        segment is currently undergoing a test.  This\n        state is set by an administrative entity.  This\n        value affects the PVC status indicated across the\n        ingress NNI/UNI of both end-points of the bi-\n        directional PVC segment.  When a PVC segment\n        connection is created using this table, this\n        object is initially set to `inactive(2)'.  After\n        the frPVCConnectRowStatus object is set to\n        `active(1)' (and the corresponding/associated\n        entries in the frPVCEndptTable have their\n        frPVCEndptRowStatus object set to `active(1)'),\n        the frPVCConnectAdminStatus object may be set to\n        `active(1)' to turn on the PVC segment\n        connection.\"\n::= { frPVCConnectEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectL2hOperStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                active(1),\n                inactive(2),\n                testing(3),\n                unknown(4)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the current\n            operational status of the PVC segment connection\n            in one direction; (i.e., in the low to high\n            direction). This value affects the PVC status\n            indicated across the ingress NNI/UNI (low side) of\n            the PVC segment.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "The values mean:",
      "zh-CHS": "这些值意味着："
    },
    {
      "indent": 20,
      "text": "active(1) - PVC is currently operational",
      "zh-CHS": "活性（1）-PVC目前正在运行"
    },
    {
      "indent": 20,
      "text": "inactive(2) - PVC is currently not operational. This may be because of an underlying LMI or DS1 failure.",
      "zh-CHS": "非活性（2）-PVC目前不运行。这可能是因为潜在的LMI或DS1故障。"
    },
    {
      "indent": 20,
      "text": "testing(3) - PVC is currently undergoing a test. This may be because of an underlying frLport or DS1 undergoing a test.",
      "zh-CHS": "测试（3）-PVC目前正在进行测试。这可能是因为底层frLport或DS1正在进行测试。"
    },
    {
      "indent": 12,
      "text": "        unknown(4)  - the status of the PVC currently can\n                      not be determined.\"\n::= { frPVCConnectEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectH2lOperStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                active(1),\n                inactive(2),\n                testing(3),\n                unknown(4)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the current\n            operational status of the PVC segment connection\n            in one direction; (i.e., in the high to low\n            direction)..  This value affects the PVC status\n            indicated across the ingress NNI/UNI (high side)\n            of the PVC segment.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "The values mean:",
      "zh-CHS": "这些值意味着："
    },
    {
      "indent": 20,
      "text": "active(1) - PVC is currently operational",
      "zh-CHS": "活性（1）-PVC目前正在运行"
    },
    {
      "indent": 20,
      "text": "inactive(2) - PVC is currently not operational. This may be because of an underlying LMI or DS1 failure.",
      "zh-CHS": "非活性（2）-PVC目前不运行。这可能是因为潜在的LMI或DS1故障。"
    },
    {
      "indent": 20,
      "text": "testing(3) - PVC is currently undergoing a test. This may be because of an underlying frLport or DS1 undergoing a test.",
      "zh-CHS": "测试（3）-PVC目前正在进行测试。这可能是因为底层frLport或DS1正在进行测试。"
    },
    {
      "indent": 12,
      "text": "        unknown(4)  - the status of the PVC currently can\n                      not be determined.\"\n::= { frPVCConnectEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectL2hLastChange OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of the Interface MIB's sysUpTime object at the time this PVC segment entered its current operational state in the low to high direction. If the current state was entered prior to the last re-initialization of the FRS agent, then this object contains a zero value.\"",
      "zh-CHS": "frPVCConnectL2hLastChange对象类型语法时间戳MAX-ACCESS只读状态当前说明“当此PVC段以从低到高的方向进入其当前操作状态时，接口MIB的sysUpTime对象的值。如果当前状态是在上次重新初始化FRS代理之前输入的，则此对象包含零值。”"
    },
    {
      "indent": 12,
      "text": "::= { frPVCConnectEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectH2lLastChange OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of the Interface MIB's sysUpTime object\n            at the time this PVC segment entered its current\n            operational state in the high to low direction.\n            If the current state was entered prior to the last\n            re-initialization of the FRS agent, then this\n            object contains a zero value.\"\n    ::= { frPVCConnectEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectRowStatus OBJECT-TYPE\n    SYNTAX      RowStatus\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"The status of this entry in the\n            frPVCConnectTable.  This variable is used to\n            create new connections for the PVC end-points and\n            to change existing connections of the PVC end-\n            points.  This object must be initially set to\n            `createAndWait(5)'. In this state, the agent\n            checks the parameters in the associated entries in\n            the frPVCEndptTable to verify that the PVC end-\n            points can be connected (i.e., the In parameters\n            for one PVC end-point are equal to the Out\n            parameters for the other PVC end-point).  This\n            object can not be set to `active(1)' unless the\n            following columnar object exists in this row:\n            frPVCConnectAdminStatus.  The agent also supplies\n            the associated value of frPVCConnectIndex for the\n            frPVCEndptConnectIdentifier instances.  To turn on\n            a PVC segment connection, the\n            frPVCConnectAdminStatus is set to `active(1)'.\"\n    ::= { frPVCConnectEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectUserName OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This is a service user assigned textual\n            representation of a PVC.\"\n    ::= { frPVCConnectEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectProviderName OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This is a system supplied textual representation\n            of PVC.  It is assigned by the service provider.\"\n    ::= { frPVCConnectEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- -- The Frame Relay Accounting --",
      "zh-CHS": "----帧中继计费--"
    },
    {
      "indent": 8,
      "text": "frAccountPVCTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF FrAccountPVCEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The Frame Relay Accounting PVC table.  This table\n            is used to perform accounting on a PVC segment\n            end-point basis.\"\n    ::= { frnetservObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountPVCEntry OBJECT-TYPE\n    SYNTAX      FrAccountPVCEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"An entry in the Frame Relay Accounting PVC\n            table.\"\n    INDEX   {   ifIndex,\n                frAccountPVCDLCIIndex }\n    ::= { frAccountPVCTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "FrAccountPVCEntry ::=\n    SEQUENCE {\n        frAccountPVCDLCIIndex            Integer32,\n        frAccountPVCSegmentSize          Integer32,\n        frAccountPVCInSegments           Counter32,\n        frAccountPVCOutSegments          Counter32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountPVCDLCIIndex OBJECT-TYPE SYNTAX Integer32 (16..4194303) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The value of this object is equal to the DLCI",
      "zh-CHS": "FraccountPVCDLCINDEX对象类型语法整数32（16..4194303）MAX-ACCESS不可访问状态当前描述“此对象的值等于DLCI"
    },
    {
      "indent": 12,
      "text": "        value for this PVC segment end-point.\"\nREFERENCE   \"Q.922 [25]\"\n::= { frAccountPVCEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountPVCSegmentSize OBJECT-TYPE\n    SYNTAX      Integer32\n    UNITS       \"Octets\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the Segment\n            Size for this PVC segment end-point.\"\n    ::= { frAccountPVCEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountPVCInSegments OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Segments\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the number\n            of segments received by this PVC segment end-\n            point.\"\n    ::= { frAccountPVCEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountPVCOutSegments OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Segments\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the number\n            of segments sent by this PVC segment end-point.\"\n    ::= { frAccountPVCEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- -- Accounting on a Frame Relay Logical Port --",
      "zh-CHS": "----帧中继逻辑端口上的记帐--"
    },
    {
      "indent": 8,
      "text": "frAccountLportTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF FrAccountLportEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The Frame Relay Accounting Logical Port table.\n            This table is used to perform accounting on a\n            UNI/NNI Logical Port basis.\"\n    ::= { frnetservObjects 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountLportEntry OBJECT-TYPE\n    SYNTAX      FrAccountLportEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"An entry in the Frame Relay Accounting Logical\n            Port table.\"\n    INDEX   {   ifIndex }\n    ::= { frAccountLportTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "FrAccountLportEntry ::=\n    SEQUENCE {\n        frAccountLportSegmentSize\n            Integer32,\n        frAccountLportInSegments\n            Counter32,\n        frAccountLportOutSegments\n            Counter32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountLportSegmentSize OBJECT-TYPE\n    SYNTAX      Integer32\n    UNITS       \"Octets\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the Segment\n            Size for this UNI/NNI logical port.\"\n    ::= { frAccountLportEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountLportInSegments OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"Segments\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object is equal to the number\n            of segments received by this UNI/NNI logical\n            port.\"\n    ::= { frAccountLportEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frAccountLportOutSegments OBJECT-TYPE SYNTAX Counter32 UNITS \"Segments\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of this object is equal to the number",
      "zh-CHS": "frAccountLportOutSegments对象类型语法计数器32个单元“段”最大访问只读状态当前描述“此对象的值等于数字"
    },
    {
      "indent": 12,
      "text": "        of segments sent by this UNI/NNI logical port.\"\n::= { frAccountLportEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "-- -- Frame Relay Network Service Notifications --",
      "zh-CHS": "----帧中继网络服务通知--"
    },
    {
      "indent": 8,
      "text": "frPVCConnectStatusChange  NOTIFICATION-TYPE\n    OBJECTS { frPVCConnectIndex,\n              frPVCConnectLowIfIndex,\n              frPVCConnectLowDLCIIndex,\n              frPVCConnectHighIfIndex,\n              frPVCConnectHighDLCIIndex,\n              frPVCConnectL2hOperStatus,\n              frPVCConnectH2lOperStatus,\n              frPVCEndptRcvdSigStatus }\n    STATUS  deprecated\n    DESCRIPTION\n            \"Refer to the description of the\n            frPVCConnectStatusNotif notification that has\n            replaced this notification.  The notification is\n            deprecated due to the incorrect inclusion of index\n            values and to take advantage of the trap prefix\n            for automatic conversion from SMIv2 to SMIv1 by\n            making the one but last sub-ID a zero (i.e. the\n            so-called trap prefix).\"\n    ::= { frnetservTraps 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frPVCConnectStatusNotif NOTIFICATION-TYPE OBJECTS { frPVCConnectL2hOperStatus, frPVCConnectH2lOperStatus, frPVCEndptRcvdSigStatus } STATUS current DESCRIPTION \"This notification indicates that the indicated PVC has changed state.",
      "zh-CHS": "frPVCConnectStatusNotif通知类型对象{frPVCConnectL2hOperStatus，frPVCConnectH2lOperStatus，frPVCEndptRcvdSigStatus}状态当前描述“此通知表示指示的PVC已更改状态。"
    },
    {
      "indent": 12,
      "text": "        This notification is not sent if an FR-UNI changes\n        state; a linkDown or linkUp notification should be\n        sent instead.  The first instance of\n        frPVCEndptRcvdSigStatus is for the endpoint with\n        LowIfIndex, LowDLCIIndex.  The second instance of\n        frPVCEndptRcvdSigStatus is for the endpoint with\n        HighIfIndex, HighDLCIIndex\"\n::= { frnetservTrapsPrefix 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- Conformance Information",
      "zh-CHS": "--一致性信息"
    },
    {
      "indent": 8,
      "text": "frnetservConformance  OBJECT IDENTIFIER\n    ::= { frnetservMIB 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservGroups       OBJECT IDENTIFIER\n    ::= { frnetservConformance 1 }\nfrnetservCompliances  OBJECT IDENTIFIER\n    ::= { frnetservConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- -- Service (Read-only) Modules -- frnetservCompliance2 MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for SNMP entities which have Frame Relay Network Service Interfaces.",
      "zh-CHS": "----服务（只读）模块--FRNetServeCompliance2模块-符合性状态当前描述“具有帧中继网络服务接口的SNMP实体的符合性声明。"
    },
    {
      "indent": 12,
      "text": " The distinction between 'service' and 'switch' is that a 'switch' is configured via this MIB. Hence, the various read/write objects have write capability. A 'service' represents a passive monitor-only customer network management interface. The various read/write objects are restricted to read-only capability.\" MODULE -- this module MANDATORY-GROUPS { frnetservLportGroup2, frnetservMgtVCSigGroup, frnetservPVCEndptGroup, frnetservPVCEndptGroup2, frnetservPVCConnectGroup, frnetservPVCConnectNamesGroup, frnetservPVCNotifGroup2 }",
      "zh-CHS": "“服务”和“交换机”之间的区别在于“交换机”是通过此MIB配置的。因此，各种读/写对象具有写功能。“服务”表示被动的仅监控客户网络管理接口。各种读/写对象被限制为只读功能。“模块--此模块是必需的-组{frnetservLportGroup2，fRnetServMgtVCSiggGroup，frnetservPVCEndptGroup，frnetservPVCEndptGroup2，frnetservPVCConnectGroup，fRnetServPvCconnectNameGroup，fRnetServPvCntTifGroup2}”"
    },
    {
      "indent": 16,
      "text": "GROUP frnetservAccountPVCGroup DESCRIPTION \"This group is optional for frame relay interfaces. It is mandatory if and only if accounting is performed on a PVC basis this frame relay interface.\" GROUP frnetservAccountLportGroup DESCRIPTION \"This group is optional for frame relay interfaces. It is mandatory if and only if accounting is performed on a logical port basis this frame relay interface.\"",
      "zh-CHS": "组FRNetServeAccountPvcGroup DESCRIPTION“此组对于帧中继接口是可选的。当且仅当在该帧中继接口的PVC基础上执行记帐时，此组才是必需的。”组FRNetServeAccountLport组说明“此组对于帧中继接口是可选的。当且仅当在基于此帧中继接口的逻辑端口上执行记帐时，此项为必填项。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptInMaxFrameSize",
      "zh-CHS": "对象frPVCEndptInMaxFrameSize"
    },
    {
      "indent": 16,
      "text": "MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptInBc MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptInBc最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptInBe MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptInBe最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptInCIR MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptInCIR最小访问只读描述“不需要写入访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutMaxFrameSize MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptOutMaxFrameSize最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutBc MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptOutBc最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutBe MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptOutBe最小访问只读描述“不需要写入访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutCIR MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptOutCIR最小访问只读说明“不需要写入访问。”"
    },
    {
      "indent": 13,
      "text": " OBJECT frPVCEndptRowStatus -- subset of RowStatus SYNTAX INTEGER { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required, and only one of the six enumerated values for the RowStatus textual convention need be supported, specifically: active(1).\"",
      "zh-CHS": "对象frPVCEndptRowStatus—RowStatus语法整数{active（1）}MIN-ACCESS只读描述的子集“不需要写访问，只需要支持RowStatus文本约定的六个枚举值中的一个，具体来说是：active（1）。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCConnectAdminStatus MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCConnectAdminStatus最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 13,
      "text": " OBJECT frPVCConnectRowStatus -- subset of RowStatus SYNTAX INTEGER { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required, and only one of the six enumerated values for the RowStatus textual convention need be supported, specifically: active(1).\"",
      "zh-CHS": "对象frPVCConnectRowStatus--RowStatus语法整数{active（1）}MIN-ACCESS只读描述的子集“不需要写访问，并且只需要支持RowStatus文本约定的六个枚举值中的一个，具体来说是：active（1）。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frLportFragControl MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frLportFragControl MIN-ACCESS只读描述“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frLportFragSize MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frLportFragSize最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCConnectUserName MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCConnectUserName最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCConnectProviderName MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCConnectProviderName最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 14,
      "text": "::= { frnetservCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "-- -- Switch (Configuration) Compliance -- frnetSwitchCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for SNMP entities which have Frame Relay Network Switch objects.",
      "zh-CHS": "----交换机（配置）符合性--frnetSwitchCompliance MODULE-Compliance STATUS current DESCRIPTION“具有帧中继网络交换机对象的SNMP实体的符合性声明。"
    },
    {
      "indent": 20,
      "text": "The distinction between 'service' and 'switch' is that a 'switch' is configured via this MIB.",
      "zh-CHS": "“服务”和“交换机”之间的区别在于“交换机”是通过此MIB配置的。"
    },
    {
      "indent": 12,
      "text": " Hence, the various read/write objects have write capability. A 'service' represents a passive monitor-only customer network management interface. The various read/write objects are restricted to read-only capability.\" MODULE -- this module MANDATORY-GROUPS { frnetservLportGroup2, frnetservLportAdminGroup, frnetservMgtVCSigGroup, frnetservMgtVCSigAdminGroup, frnetservPVCEndptGroup, frnetservPVCEndptGroup2, frnetservPVCConnectGroup, frnetservPVCConnectNamesGroup, frnetservPVCNotifGroup2 }",
      "zh-CHS": "因此，各种读/写对象具有写功能。“服务”表示被动的仅监控客户网络管理接口。各种读/写对象仅限于只读功能。“模块--此模块必须包含以下组：{frnetservLportGroup2、frnetservLportAdminGroup、frnetservMgtVCSigGroup、fRNetServMgTvCsGadmingGroup、fRNetServPvCcendPtGroup、fRNetServPvCcConnectionNameGroup、fRNetServPvCncNotifGroup2}”"
    },
    {
      "indent": 16,
      "text": "GROUP frnetservAccountPVCGroup DESCRIPTION \"This group is optional for frame relay interfaces. It is mandatory if and only if accounting is performed on a PVC basis this frame relay interface.\" GROUP frnetservAccountLportGroup DESCRIPTION \"This group is optional for frame relay interfaces. It is mandatory if and only if accounting is performed on a logical port basis this frame relay interface.\"",
      "zh-CHS": "组FRNetServeAccountPvcGroup DESCRIPTION“此组对于帧中继接口是可选的。当且仅当在该帧中继接口的PVC基础上执行记帐时，此组才是必需的。”组FRNetServeAccountLport组说明“此组对于帧中继接口是可选的。当且仅当在基于此帧中继接口的逻辑端口上执行记帐时，此项为必填项。”"
    },
    {
      "indent": 14,
      "text": "::= { frnetservCompliances 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "-- -- Historical RFC 1604 Compliance Modules --",
      "zh-CHS": "----历史RFC 1604合规性模块--"
    },
    {
      "indent": 8,
      "text": "frnetservCompliance MODULE-COMPLIANCE STATUS deprecated DESCRIPTION \"The compliance statement for SNMP entities which have Frame Relay Network Service Interfaces.",
      "zh-CHS": "FRNetServeCompliance MODULE-COMPLIANCE STATUS已弃用描述“具有帧中继网络服务接口的SNMP实体的符合性声明。"
    },
    {
      "indent": 20,
      "text": "This compliance statement has been deprecated in favor of frnetservCompliance2. The new compliance module expands the mandatory groups to include notification and other new objects.\"",
      "zh-CHS": "此合规性声明已被弃用，取而代之的是FRNetServeCompliance 2。新的法规遵从性模块将强制组扩展为包括通知和其他新对象。”"
    },
    {
      "indent": 12,
      "text": "MODULE -- this module MANDATORY-GROUPS { frnetservLportGroup,",
      "zh-CHS": "MODULE--此模块为强制组{frnetservLportGroup，"
    },
    {
      "indent": 35,
      "text": "frnetservMgtVCSigGroup, frnetservPVCEndptGroup, frnetservPVCConnectGroup }",
      "zh-CHS": "frnetservMgtVCSigGroup，frnetservPVCEndptGroup，FRNetServPvcConnectionGroup}"
    },
    {
      "indent": 16,
      "text": "GROUP frnetservAccountPVCGroup DESCRIPTION \"This group is optional for Frame Relay interfaces. It is mandatory if and only if accounting is performed on a PVC basis this Frame Relay interface.\"",
      "zh-CHS": "GROUP FRNetServeAccountPvcGroup DESCRIPTION“此组对于帧中继接口是可选的。当且仅当基于此帧中继接口执行记帐时，此组才是必需的。”"
    },
    {
      "indent": 16,
      "text": "GROUP frnetservAccountLportGroup DESCRIPTION \"This group is optional for Frame Relay interfaces. It is mandatory if and only if accounting is performed on a logical port basis this Frame Relay interface.\"",
      "zh-CHS": "GROUP FRNetServeAccountLPortGroup DESCRIPTION“此组对于帧中继接口是可选的。当且仅当基于此帧中继接口的逻辑端口执行记帐时，此组才是必需的。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptInMaxFrameSize MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptInMaxFrameSize最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptInBc MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\" OBJECT frPVCEndptInBe MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptInBc最小访问只读说明“不需要写入访问权限”。对象frPVCEndptInBe最小访问只读说明“不需要写入访问权限。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptInCIR MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptInCIR最小访问只读描述“不需要写入访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutMaxFrameSize MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptOutMaxFrameSize最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutBc MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptOutBc最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutBe",
      "zh-CHS": "对象frPVCEndptOutBe"
    },
    {
      "indent": 16,
      "text": "MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCEndptOutCIR MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCEndptOutCIR最小访问只读说明“不需要写入访问。”"
    },
    {
      "indent": 13,
      "text": " OBJECT frPVCEndptRowStatus -- subset of RowStatus SYNTAX INTEGER { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required, and only one of the six enumerated values for the RowStatus textual convention need be supported, specifically: active(1).\"",
      "zh-CHS": "对象frPVCEndptRowStatus—RowStatus语法整数{active（1）}MIN-ACCESS只读描述的子集“不需要写访问，只需要支持RowStatus文本约定的六个枚举值中的一个，具体来说是：active（1）。”"
    },
    {
      "indent": 16,
      "text": "OBJECT frPVCConnectAdminStatus MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象frPVCConnectAdminStatus最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 12,
      "text": "    OBJECT      frPVCConnectRowStatus\n -- subset of RowStatus\n    SYNTAX      INTEGER { active(1) }\n    MIN-ACCESS  read-only\n    DESCRIPTION\n        \"Write access is not required, and only one of the\n        six enumerated values for the RowStatus textual\n        convention need be supported, specifically:\n        active(1).\"\n::= { frnetservCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "-- -- Frame Relay Service MIB Object Groups -- frnetservLportGroup OBJECT-GROUP OBJECTS { frLportNumPlan, frLportContact, frLportLocation, frLportType, frLportAddrDLCILen, frLportVCSigProtocol, frLportVCSigPointer } STATUS deprecated DESCRIPTION \"A collection of objects providing information applicable to a Frame Relay Logical Port. This group has been deprecated to eliminate reference",
      "zh-CHS": "----帧中继服务MIB对象组--frnetservLportGroup对象组对象{frLportNumPlan，frLportContact，frLportLocation，frLportType，frLportAddrDLCILen，frLportVCSigProtocol，frLportVCSigPointer}状态不推荐说明“提供适用于帧中继逻辑端口的信息的对象集合。已弃用此组以消除引用"
    },
    {
      "indent": 21,
      "text": "to the object frLportVCSigPointer.",
      "zh-CHS": "指向对象frLportVCSigPointer。"
    },
    {
      "indent": 13,
      "text": "        Use the new group frnetservLportGroup2 as a\n        replacement for this group.\"\n::= { frnetservGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservMgtVCSigGroup  OBJECT-GROUP\n    OBJECTS { frMgtVCSigProced,\n              frMgtVCSigUserN391,\n              frMgtVCSigUserN392,\n              frMgtVCSigUserN393,\n              frMgtVCSigUserT391,\n              frMgtVCSigNetN392,\n              frMgtVCSigNetN393,\n              frMgtVCSigNetT392,\n              frMgtVCSigNetnN4,\n              frMgtVCSigNetnT3,\n              frMgtVCSigUserLinkRelErrors,\n              frMgtVCSigUserProtErrors,\n              frMgtVCSigUserChanInactive,\n              frMgtVCSigNetLinkRelErrors,\n              frMgtVCSigNetProtErrors,\n              frMgtVCSigNetChanInactive }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of objects providing information\n            applicable to the Local In-Channel Signaling\n            Procedures used for a UNI/NNI logical port.\"\n    ::= { frnetservGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservPVCEndptGroup OBJECT-GROUP OBJECTS { frPVCConnectIndexValue, frPVCEndptInMaxFrameSize, frPVCEndptInBc, frPVCEndptInBe, frPVCEndptInCIR, frPVCEndptOutMaxFrameSize, frPVCEndptOutBc, frPVCEndptOutBe, frPVCEndptOutCIR, frPVCEndptConnectIdentifier, frPVCEndptRowStatus, frPVCEndptRcvdSigStatus, frPVCEndptInFrames, frPVCEndptOutFrames, frPVCEndptInDEFrames, frPVCEndptInExcessFrames, frPVCEndptOutExcessFrames,",
      "zh-CHS": "frnetservPVCEndptGroup对象组对象{frPVCConnectIndexValue、frPVCEndptInMaxFrameSize、frPVCEndptInBc、frPVCEndptInBe、frPVCEndptInCIR、FRPVCENDPTOTOMXFramesize、FRPVCENDPTOTBC、frPVCEndptInMaxFrameSize、frPVCEndptInBc、FRPVCENDPTRIGTSTATUS、FRPVCENDPTINFRPVCENDPTFRAMES、FRPVCENDPTONTFRAMES、FRPVCENDPTINEXCENTFRPVC框架EndptOutExcessFrames，"
    },
    {
      "indent": 12,
      "text": "          frPVCEndptInDiscards,\n          frPVCEndptInOctets,\n          frPVCEndptOutOctets }\nSTATUS  current\nDESCRIPTION\n        \"A collection of objects providing information\n        applicable to a Frame Relay PVC end-point.\"\n::= { frnetservGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservPVCConnectGroup  OBJECT-GROUP\n    OBJECTS { frPVCConnectAdminStatus,\n              frPVCConnectL2hOperStatus,\n              frPVCConnectH2lOperStatus,\n              frPVCConnectL2hLastChange,\n              frPVCConnectH2lLastChange,\n              frPVCConnectRowStatus }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of objects providing information\n            applicable to a Frame Relay PVC connection.\"\n    ::= { frnetservGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservAccountPVCGroup  OBJECT-GROUP\n    OBJECTS { frAccountPVCSegmentSize,\n              frAccountPVCInSegments,\n              frAccountPVCOutSegments }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of objects providing accounting\n            information application to a Frame Relay PVC end-\n            point.\"\n    ::= { frnetservGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservAccountLportGroup  OBJECT-GROUP\n    OBJECTS { frAccountLportSegmentSize,\n              frAccountLportInSegments,\n              frAccountLportOutSegments }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of objects providing accounting\n            information application to a Frame Relay logical\n            port.\"\n    ::= { frnetservGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservLportGroup2 OBJECT-GROUP OBJECTS { frLportNumPlan, frLportContact, frLportLocation,",
      "zh-CHS": "frnetservLportGroup2对象组对象{frLportNumPlan，frLportContact，frLportLocation，"
    },
    {
      "indent": 12,
      "text": " frLportType, frLportAddrDLCILen, frLportVCSigProtocol, frLportFragControl, frLportFragSize } STATUS current DESCRIPTION \"A collection of objects providing information applicable to a Frame Relay Logical Port.",
      "zh-CHS": "frLportType、frLportAddrDLCILen、frLportVCSigProtocol、frLportFragControl、frLportFragSize}状态当前描述“提供适用于帧中继逻辑端口的信息的对象集合。"
    },
    {
      "indent": 12,
      "text": "        This new version of the Logical Port Group\n        eliminates the frLportVCSigPointer and adds\n        support for fragmentation.\"\n::= { frnetservGroups 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservPVCEndptGroup2  OBJECT-GROUP\n      OBJECTS { frPVCEndptInDiscardsDESet,\n                frPVCEndptInFramesFECNSet,\n                frPVCEndptOutFramesFECNSet,\n                frPVCEndptInFramesBECNSet,\n                frPVCEndptOutFramesBECNSet,\n                frPVCEndptInCongDiscards,\n                frPVCEndptInDECongDiscards,\n                frPVCEndptOutCongDiscards,\n                frPVCEndptOutDECongDiscards,\n                frPVCEndptOutDEFrames,\n                frPVCEndptAtmIwfConnIndex }\n      STATUS  current\n      DESCRIPTION\n            \"Additions to the PVC end-point group.  These\n            additions provide new frame counters to track\n            frame loss.  In addition, the new FR/ATM IWF MIB\n            cross-connect index is included.\"\n      ::= { frnetservGroups 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservPVCConnectNamesGroup  OBJECT-GROUP\n      OBJECTS { frPVCConnectUserName,\n                frPVCConnectProviderName }\n      STATUS  current\n      DESCRIPTION\n            \"Additions to the PVC Connect Group.\"\n      ::= { frnetservGroups 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservLportAdminGroup OBJECT-GROUP OBJECTS { frLportDLCIIndexValue, frLportTypeAdmin, frLportVCSigProtocolAdmin } STATUS current",
      "zh-CHS": "frnetservLportAdminGroup对象组对象{frLportDLCIIndexValue，frLportTypeAdmin，frLportVCSigProtocolAdmin}状态当前"
    },
    {
      "indent": 14,
      "text": "DESCRIPTION\n      \"Administrative (R/W) objects for creating a\n      switch logical port.\"\n::= { frnetservGroups 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservMgtVCSigAdminGroup OBJECT-GROUP OBJECTS { frMgtVCSigProcedAdmin, frMgtVCSigUserN391Admin, frMgtVCSigUserN392Admin, frMgtVCSigUserN393Admin, frMgtVCSigUserT391Admin, frMgtVCSigNetN392Admin, frMgtVCSigNetN393Admin, frMgtVCSigNetT392Admin, frMgtVCSigNetnT3Admin } STATUS current DESCRIPTION",
      "zh-CHS": "FRNetServMgTvCsiGadmingGroup对象组对象{frMgtVCSigProcedAdmin，frMgtVCSigUserN391Admin，frMgtVCSigUserN392Admin，frMgtVCSigUserN393Admin，frMgtVCSigUserN391Admin，FRMgTvCsignet393Admin，FRMgTvCsignet392Admin，FRMgTvCsignet3Admin}状态当前说明"
    },
    {
      "indent": 14,
      "text": "      \"A collection of objects providing information\n      applicable to the Local In-Channel Signaling\n      Procedures used for a UNI/NNI logical port.\"\n::= { frnetservGroups 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservPVCNotifGroup NOTIFICATION-GROUP\n      NOTIFICATIONS { frPVCConnectStatusChange }\n      STATUS    deprecated\n      DESCRIPTION\n            \"Deprecated notification group.  The\n            frPVCConnectStatusChange notification was flawed\n            because it included redundant indexes and was not\n            properly encoded for SMIv1 conversion.\"\n    ::= { frnetservGroups 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "frnetservPVCNotifGroup2 NOTIFICATION-GROUP\n      NOTIFICATIONS { frPVCConnectStatusNotif }\n      STATUS    current\n      DESCRIPTION\n            \"A collection of notifications that apply to frame\n            relay PVC Connections \"\n    ::= { frnetservGroups 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgments",
      "section_title": true,
      "zh-CHS": "4. 致谢"
    },
    {
      "indent": 3,
      "text": "This document was produced by the Frame Relay Service MIB Working Group.",
      "zh-CHS": "本文件由帧中继服务MIB工作组编制。"
    },
    {
      "indent": 3,
      "text": "The working group thanks Bert Wijnen, David Perkins, and Bob Stewart for their assistance in reviewing the MIB.",
      "zh-CHS": "工作组感谢Bert Wijnen、David Perkins和Bob Stewart协助审查MIB。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Harrington, D., Presuhn, R. and B. Wijnen, \"An Architecture for Describing SNMP Management Frameworks\", RFC 2571, April 1999.",
      "zh-CHS": "[1] Harrington，D.，Presohn，R.和B.Wijnen，“描述SNMP管理框架的体系结构”，RFC 2571，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[2] Rose, M. and K. McCloghrie, \"Structure and Identification of Management Information for TCP/IP-based Internets\", STD 16, RFC 1155, May 1990.",
      "zh-CHS": "[2] Rose，M.和K.McCloghrie，“基于TCP/IP的互联网管理信息的结构和识别”，STD 16，RFC 1155，1990年5月。"
    },
    {
      "indent": 3,
      "text": "[3] Rose, M. and K. McCloghrie, \"Concise MIB Definitions\", STD 16, RFC 1212, March 1991.",
      "zh-CHS": "[3] Rose，M.和K.McCloghrie，“简明MIB定义”，STD 16，RFC 1212，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Rose, M., \"A Convention for Defining Traps for use with the SNMP\", RFC 1215, March 1991.",
      "zh-CHS": "[4] Rose，M.“定义用于SNMP的陷阱的约定”，RFC1215，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[5] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[5] McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[6] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[6] McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[7] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[7] McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 3,
      "text": "[8] Case, J., Fedor, M., Schoffstall, M. and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "zh-CHS": "[8] Case，J.，Fedor，M.，Schoffstall，M.和J.Davin，“简单网络管理协议”，STD 15，RFC 1157，1990年5月。"
    },
    {
      "indent": 3,
      "text": "[9] Case, J., McCloghrie, K., Rose M., and S. Waldbusser, \"Introduction to Community-based SNMPv2\", RFC 1901, January 1996.",
      "zh-CHS": "[9] Case，J.，McCloghrie，K.，Rose M.，和S.Waldbusser，“基于社区的SNMPv2简介”，RFC 19011996年1月。"
    },
    {
      "indent": 3,
      "text": "[10] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Transport Mappings for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1906, January 1996.",
      "zh-CHS": "[10] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的传输映射”，RFC 1906，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[11] Case, J., Harrington D., Presuhn R. and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2572, April 1999.",
      "zh-CHS": "[11] Case，J.，Harrington D.，Presohn R.和B.Wijnen，“简单网络管理协议（SNMP）的消息处理和调度”，RFC 2572，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[12] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2574, April 1999.",
      "zh-CHS": "[12] Blumenthal，U.和B.Wijnen，“简单网络管理协议（SNMPv3）第3版的基于用户的安全模型（USM）”，RFC 2574，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[13] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Protocol Operations for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1905, January 1996.",
      "zh-CHS": "[13] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的协议操作”，RFC 1905，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[14] Levi, D., Meyer, P. and B. Stewart, \"SNMPv3 Applications\", RFC 2573, April 1999.",
      "zh-CHS": "[14] Levi，D.，Meyer，P.和B.Stewart，“SNMPv3应用”，RFC2573，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[15] Wijnen, B., Presuhn, R. and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", RFC 2575, April 1999.",
      "zh-CHS": "[15] Wijnen，B.，Presuhn，R.和K.McCloghrie，“用于简单网络管理协议（SNMP）的基于视图的访问控制模型（VACM）”，RFC2575，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[16] Case, J., Mundy, R., Partain, D. and B. Stewart, \"Introduction to Version 3 of the Internet-standard Network Management Framework\", RFC 2570, April 1999.",
      "zh-CHS": "[16] Case，J.，Mundy，R.，Partain，D.和B.Stewart，“互联网标准网络管理框架第3版简介”，RFC 25701999年4月。"
    },
    {
      "indent": 3,
      "text": "[17] ANSI T1.617-1991, American National Standard for Telecommunications - Integrated Services Digital Network (ISDN) - Digital Subscriber Signaling System No. 1 (DSS1) - Signaling Specification for Frame Relay Bearer Service.",
      "zh-CHS": "[17] ANSI T1.617-1991，美国国家电信标准-综合业务数字网（ISDN）-第1号数字用户信令系统（DSS1）-帧中继承载业务信令规范。"
    },
    {
      "indent": 3,
      "text": "[18] Brown, C. and F. Baker, \"Management Information Base for Frame Relay DTEs\", RFC 2115, September 1997.",
      "zh-CHS": "[18] Brown，C.和F.Baker，“帧中继DTE的管理信息库”，RFC 2115，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[19] Brown, C. and A. Malis, \"Multi-Protocol Interconnect over Frame Relay\", STD 55, RFC 2427, September 1998.",
      "zh-CHS": "[19] Brown，C.和A.Malis，“帧中继上的多协议互连”，STD 55，RFC 2427，1998年9月。"
    },
    {
      "indent": 3,
      "text": "[20] Fowler, D, \"Definitions of Managed Objects for the DS0 and DS0 Bundle Interface Types\", RFC 2494, January 1999.",
      "zh-CHS": "[20] Fowler，D，“DS0和DS0捆绑包接口类型的托管对象定义”，RFC 2494，1999年1月。"
    },
    {
      "indent": 3,
      "text": "[21] Frame Relay Forum, \"Frame Relay Fragmentation Implementation Agreement\", FRF.12, December 1997.",
      "zh-CHS": "[21] 帧中继论坛，“帧中继分段实施协议”，FRF.12，1997年12月。"
    },
    {
      "indent": 3,
      "text": "[22] ITU-T Recommendation Q.933,Integrated Services Digital Network (ISDN) Digital Subscriber Signalling System No. 1 (DSS 1) - Signalling Specifications for Frame Mode Switched and Permanent Virtual Connection Control and Status Monitoring, December 1995",
      "zh-CHS": "[22] ITU-T建议Q.933，综合业务数字网（ISDN）数字用户信号发送系统第1号（DSS 1）——帧模式交换和永久虚拟连接控制和状态监测的信号发送规范，1995年12月"
    },
    {
      "indent": 3,
      "text": "[23] ITU-T Recommendation X.36, Interface Between Data Terminal Equipment (DTE) and Data Circuit-Terminating Equipment (DCE) For Public Data Networks Providing Frame Relay Data Transmission Service By Dedicated Circuit, April 1995",
      "zh-CHS": "[23] ITU-T建议X.36，通过专用电路提供帧中继数据传输服务的公共数据网络的数据终端设备（DTE）和数据电路终端设备（DCE）之间的接口，1995年4月"
    },
    {
      "indent": 3,
      "text": "[24] Digital Equipment Corporation, et. al., \"Frame Relay Specification with Extensions Based on Proposed T1S1 Standards\", Revision 1.0, September 18, 1990",
      "zh-CHS": "[24] 数字设备公司，等，“基于拟议T1S1标准扩展的帧中继规范”，第1.0版，1990年9月18日"
    },
    {
      "indent": 3,
      "text": "[25] ITU-T Recommendation Q.922, Integrated Services Digital Network (ISDN) Data Link Layer Specification For Frame Mode Bearer Services, February 1992",
      "zh-CHS": "[25] ITU-T建议Q.922，《综合业务数字网（ISDN）帧模式承载业务数据链路层规范》，1992年2月"
    },
    {
      "indent": 3,
      "text": "[26] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "zh-CHS": "[26] McCloghrie，K.和F.Kastenholz，“接口组MIB”，RFC 28632000年6月。"
    },
    {
      "indent": 3,
      "text": "[27] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Management Information Base for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1907, January 1996.",
      "zh-CHS": "[27] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的管理信息库”，RFC 1907，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[28] Rehbehn, K., Nicklass, O. and G. Mouradian, \"Definitions of Managed Objects for Monitoring and Controlling the Frame Relay/ATM PVC Service Interworking Function\", RFC 2955, October 2000.",
      "zh-CHS": "[28] Rehbehn，K.，Nicklass，O.和G.Mouradian，“监控帧中继/ATM PVC服务互通功能的管理对象定义”，RFC 2955，2000年10月。"
    },
    {
      "indent": 3,
      "text": "[29] ITU-T Recommendation E.164/I.331, The International Public Telecommunication Numbering Plan, May 1997",
      "zh-CHS": "[29] ITU-T建议E.164/I.331，《国际公共电信编号计划》，1997年5月"
    },
    {
      "indent": 3,
      "text": "[30] ITU-T Recommendation X.121, International Numbering Plan For Public Data Networks, October 1996",
      "zh-CHS": "[30] ITU-T建议X.121，《公共数据网络国际编号计划》，1996年10月"
    },
    {
      "indent": 3,
      "text": "[31] Frame Relay Forum, \"The Frame Relay Forum User-to-Network Implementation Agreement (UNI)\", FRF 1.2, July 2000.",
      "zh-CHS": "[31] 帧中继论坛，“帧中继论坛用户到网络实施协议（UNI）”，FRF 1.22000年7月。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB that have a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "zh-CHS": "此MIB中定义了许多管理对象，它们的MAX-ACCESS子句为read-write和/或read-create。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作可能会对网络操作产生负面影响。"
    },
    {
      "indent": 3,
      "text": "No managed objects in this MIB contain sensitive information.",
      "zh-CHS": "此MIB中没有包含敏感信息的托管对象。"
    },
    {
      "indent": 3,
      "text": "SNMPv1 by itself is not a secure environment. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB.",
      "zh-CHS": "SNMPv1本身不是一个安全的环境。即使网络本身是安全的（例如通过使用IPSec），即使如此，也无法控制安全网络上的谁可以访问和获取/设置（读取/更改/创建/删除）此MIB中的对象。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the implementers consider the security features as provided by the SNMPv3 framework. Specifically, the use of the User-based Security Model RFC 2574 [12] and the View-based Access Control Model RFC 2575 [15] is recommended.",
      "zh-CHS": "建议实施者考虑SNMPv3框架提供的安全特性。具体而言，建议使用基于用户的安全模型RFC 2574[12]和基于视图的访问控制模型RFC 2575[15]。"
    },
    {
      "indent": 3,
      "text": "It is then a customer/user responsibility to ensure that the SNMP entity giving access to an instance of this MIB, is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "然后，客户/用户有责任确保授予对此MIB实例访问权限的SNMP实体被正确配置为仅授予那些拥有确实获取或设置（更改/创建/删除）对象的合法权限的主体（用户）对对象的访问权限。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "7. 作者地址"
    },
    {
      "indent": 3,
      "text": "Kenneth Rehbehn Megisto Systems, Inc. 20251 Century Boulevard Germantown, MD, USA 20874",
      "zh-CHS": "Kenneth Rehbehn Megisto Systems，Inc.美国马里兰州日尔曼镇世纪大道20251号，邮编：20874"
    },
    {
      "indent": 3,
      "text": "Phone: (301) 515-3672 EMail: krehbehn@megisto.com",
      "zh-CHS": "电话：（301）515-3672电子邮件：krehbehn@megisto.com"
    },
    {
      "indent": 3,
      "text": "David Fowler Syndesis Limited 28 Fulton Way Richmond Hill, Ontario, Canada L4B 1J5",
      "zh-CHS": "David Fowler Syndesis Limited加拿大安大略省里士满山富尔顿路28号L4B 1J5"
    },
    {
      "indent": 3,
      "text": "Phone: (905) 886-7818 EMail: fowler@syndesis.com",
      "zh-CHS": "电话：（905）886-7818电子邮件：fowler@syndesis.com"
    },
    {
      "indent": 0,
      "text": "APPENDIX A Update Information",
      "zh-CHS": "附录A更新信息"
    },
    {
      "indent": 3,
      "text": "The changes from RFC 1604 are the following:",
      "zh-CHS": "RFC 1604的变化如下："
    },
    {
      "indent": 3,
      "text": "(1) Added the object frLportDLCIIndexValue to automatically generate index values for new DLC rows.",
      "zh-CHS": "(1) 添加对象frLportDLCIIndexValue以自动为新的DLC行生成索引值。"
    },
    {
      "indent": 3,
      "text": "(2) Add the following objects to support manager writing to objects:",
      "zh-CHS": "(2) 添加以下对象以支持manager写入对象："
    },
    {
      "indent": 8,
      "text": "Logical Port Objects frLportTypeAdmin frLportVCSigProtocolAdmin",
      "zh-CHS": "逻辑端口对象frLportTypeAdmin frLportVCSigProtocolAdmin"
    },
    {
      "indent": 8,
      "text": "VC Objects frMgtVCSigProcedAdmin frMgtVCSigUserN391Admin frMgtVCSigUserN392Admin frMgtVCSigUserN393Admin frMgtVCSigUserT391Admin frMgtVCSigNetN392Admin frMgtVCSigNetN393Admin frMgtVCSigNetT392Admin frMgtVCSigNetnT3Admin",
      "zh-CHS": "VC对象frMgtVCSigProcedAdmin FRMGTVCSIGUSERN391管理FRMGTVCSIGUSERN392管理FRMGTVCSIGUSERN393管理FRMGTVCSIGUSERT391管理FRMGTVCSIGNETN392管理FRMGTVCSIGNETN393管理FRMGTVCSIGNETN392管理"
    },
    {
      "indent": 3,
      "text": "(3) Add objects to control fragmentation:",
      "zh-CHS": "(3) 添加对象以控制碎片："
    },
    {
      "indent": 8,
      "text": "frLportFragControl frLportFragSize",
      "zh-CHS": "frLportFragControl frLportFragSize"
    },
    {
      "indent": 3,
      "text": "(4) Added objects to track frames offered to network (in) and delivered (out) for increased visibility into policing-driven discards, congestion-driven discards, DE-bit setting, and congestion bit setting:",
      "zh-CHS": "(4) 为跟踪提供给网络（in）和交付（out）的帧添加了对象，以提高对监控驱动丢弃、拥塞驱动丢弃、取消比特设置和拥塞比特设置的可见性："
    },
    {
      "indent": 8,
      "text": "frPVCEndptInDiscardsDESet frPVCEndptInFramesFECNSet frPVCEndptOutFramesFECNSet frPVCEndptInFramesBECNSet frPVCEndptOutFramesBECNSet frPVCEndptInCongDiscards frPVCEndptInDECongDiscards frPVCEndptOutCongDiscards frPVCEndptOutDECongDiscards frPVCEndptOutDEFrames",
      "zh-CHS": "FRPVCENDPTINDiscards设置FRPVCENDPTINFrames设置FRPVCENDPTONFrames设置FRPVCENDPTINFrames设置FRPVCENDPTINFrames设置FRPVCENDPTINFrames设置FRPVCENDPTINFrames设置FRPVCENDPTONFrames设置FRPVCENDPTONFrames设置FRPVCENDPTONFrames设置FRPVCENDPTINFrames设置FRPVCENDPTINFrames设置FRPVCENDPTINDPONFrames设置FRPVCENDPTINDiscards FRPVCENDPTON"
    },
    {
      "indent": 3,
      "text": "(5) Added the PVC object frPVCEndptAtmIwfConnIndex to identify the type of connection, frame relay or ATM IWF; and to identify the cross-connect row of the FR/ATM IWF MIB.",
      "zh-CHS": "(5) 添加PVC对象FRPVCENDPTATMIWFCONNDINDEX以标识连接类型、帧中继或ATM IWF；以及识别FR/ATM IWF MIB的交叉连接行。"
    },
    {
      "indent": 3,
      "text": "(6) Added objects to provide printable names of the connection user and service provider:",
      "zh-CHS": "(6) 添加了用于提供连接用户和服务提供商的可打印名称的对象："
    },
    {
      "indent": 8,
      "text": "frPVCConnectUserName frPVCConnectProviderName",
      "zh-CHS": "frPVCConnectUserName frPVCConnectProviderName"
    },
    {
      "indent": 3,
      "text": "(7) Added a new notification to correct flaws in the RFC1604 trap. The flaws include improper OID suffix (SMIv1 compatibility issue) and the inclusion of redundant index fields",
      "zh-CHS": "(7) 添加了一个新的通知以更正RFC1604陷阱中的缺陷。这些缺陷包括不正确的OID后缀（SMIv1兼容性问题）和包含冗余索引字段"
    },
    {
      "indent": 3,
      "text": "(8) Updated compliance modules and object groups to reflect the new objects and notification:",
      "zh-CHS": "(8) 更新了法规遵从性模块和对象组，以反映新对象和通知："
    },
    {
      "indent": 8,
      "text": "frnetservCompliance2 - New service-centric (read-only) compliance module",
      "zh-CHS": "FRNetServeCompliance2-新的以服务为中心（只读）的法规遵从性模块"
    },
    {
      "indent": 8,
      "text": "frnetSwitchCompliance - New switch-centric (read-write) compliance module",
      "zh-CHS": "frnetSwitchCompliance—新的以交换机为中心的（读写）合规模块"
    },
    {
      "indent": 8,
      "text": "frnetservCompliance - Original RFC 1604 Module, now deprecated",
      "zh-CHS": "FRNetServeCompliance-原始RFC1604模块，现已弃用"
    },
    {
      "indent": 8,
      "text": "frnetservLportGroup - Original RFC 1604 logical port group, now deprecated",
      "zh-CHS": "frnetservLportGroup-原始RFC 1604逻辑端口组，现已弃用"
    },
    {
      "indent": 8,
      "text": "frnetservLportGroup2 - Replacement logical port group",
      "zh-CHS": "frnetservLportGroup2-替换逻辑端口组"
    },
    {
      "indent": 8,
      "text": "frnetservPVCEndptGroup2 - Extension objects with this revision of the MIB",
      "zh-CHS": "frnetservPVCEndptGroup2-具有此MIB版本的扩展对象"
    },
    {
      "indent": 8,
      "text": "frnetservPVCConnectNamesGroup - New group w/ display names for connections",
      "zh-CHS": "FRNetServPvcConnectionNamesGroup-新组，带有连接的显示名称"
    },
    {
      "indent": 8,
      "text": "frnetservLportAdminGroup - New group w/ read-write objects for the logical port",
      "zh-CHS": "frnetservLportAdminGroup-逻辑端口具有读写对象的新组"
    },
    {
      "indent": 8,
      "text": "frnetservMgtVCSigAdminGroup - New group w/ read-write objects for the signaling protocol",
      "zh-CHS": "FRNetServMgtVcsiGadmingGroup-新组，带有信令协议的读写对象"
    },
    {
      "indent": 8,
      "text": "frnetservPVCNotifGroup - Group deprecated to eliminate obsolete frPVCConnectStatusChange notification",
      "zh-CHS": "FRNetServePvCnotifGroup-已弃用组以消除过时的frPVCConnectStatusChange通知"
    },
    {
      "indent": 8,
      "text": "frnetservPVCNotifGroup2 - New group added with w/ frPVCConnectStatusNotif",
      "zh-CHS": "frnetservPVCNotifGroup2-添加了w/frPVCConnectStatusNotif的新组"
    },
    {
      "indent": 3,
      "text": "(9) Added UNITS and REFERENCE clauses for objects that needed the clarification.",
      "zh-CHS": "(9) 为需要澄清的对象添加了单位和参考条款。"
    },
    {
      "indent": 3,
      "text": "(10) Changed references to \"proxy-agent\" to \"FRS agent\" to avoid confusion with other proxy-agent terminology.",
      "zh-CHS": "（10） 将“代理”改为“FRS代理”，以避免与其他代理术语混淆。"
    },
    {
      "indent": 3,
      "text": "(11) Changed objects using the DisplayString TC to use the SnmpAdminString TC.",
      "zh-CHS": "（11） 将使用DisplayString TC的对象更改为使用SnmpAdminString TC。"
    },
    {
      "indent": 3,
      "text": "(12) frMgtVCSigProced - Expanded to include the u2nuser(3) enumeration for the UNI protocol operation where the logical port operates in the user role.",
      "zh-CHS": "（12） frMgtVCSigProced-扩展为包含逻辑端口在用户角色中操作的UNI协议操作的U2User（3）枚举。"
    },
    {
      "indent": 3,
      "text": "(13) DESCRIPTION text added to specify agent response when object is not instantiated for the following objects:",
      "zh-CHS": "（13） 添加的说明文本用于指定未为以下对象实例化对象时的代理响应："
    },
    {
      "indent": 8,
      "text": "frMgtVCSigUserN391 frMgtVCSigUserN393 frMgtVCSigUserT391 frMgtVCSigUserN392 frMgtVCSigNetN391 frMgtVCSigNetN393 frMgtVCSigNetT391 frMgtVCSigNetN392 frMgtVCSigNetnN4 frMgtVCSigNetnT3 frMgtVCSigUserLinkRelErrors frMgtVCSigUserProtErrors frMgtVCSigUserChanInactive",
      "zh-CHS": "frMgtVCSigUserN391 frMgtVCSigUserN393 frMgtVCSigUserT391 frMgtVCSigUserN391 FRMGTVCSIGNET391 FRMGTVCSIGNET392 FRMGTVCSIGNETN4 FRMGTVCSIGNET3 FRMGTVCSIGUSERLINKRERRORS FRMGTVCSIGUSERROPER FRMGTVCSIGUSERCHAN非活动"
    },
    {
      "indent": 3,
      "text": "(14) DESCRIPTION text addressing case of logical port not performing network-side procedures was removed from following objects:",
      "zh-CHS": "（14） 说明从以下对象中删除了未执行网络端过程的逻辑端口的文本寻址情况："
    },
    {
      "indent": 8,
      "text": "frMgtVCSigNetLinkRelErrors frMgtVCSigNetChanInactive frMgtVCSigNetProtErrors",
      "zh-CHS": "frMgtVCSigNetLinkRelErrors frMgtVCSigNetChanInactive FRMGTVCSIgnetPropertErrors"
    },
    {
      "indent": 3,
      "text": "(15) frPVCEndptConnectIdentifier - Operation described for the case of FR/ATM IWF cross-connect operation.",
      "zh-CHS": "（15） frPVCEndptConnectIdentifier-针对FR/ATM IWF交叉连接操作描述的操作。"
    },
    {
      "indent": 3,
      "text": "(16) frPVCEndptRcvdSigStatus - Added description of enumerated values.",
      "zh-CHS": "（16） frPVCEndptRcvdSigStatus-添加了枚举值的说明。"
    },
    {
      "indent": 3,
      "text": "(17) frPVCEndptInDiscards - Clarified DESCRIPTION to state that congestion discards are not counted by object.",
      "zh-CHS": "（17） frPVCEndptInDiscards-阐明说明拥塞丢弃不按对象计数。"
    },
    {
      "indent": 3,
      "text": "(18) frPVCConnect{Low|High}IfIndex - Changed to use InterfaceIndex TC and changed reference to MIB-II to the new IF-MIB. Removed statement asserting that a zero value means the port is not a FR logical port.",
      "zh-CHS": "（18） frPVCConnect{Low | High}iIndex-更改为使用InterfaceIndex TC，并将对MIB-II的引用更改为新的IF-MIB。Removed语句，断言零值表示端口不是FR逻辑端口。"
    },
    {
      "indent": 3,
      "text": "(19) frPVCConnectIndex - Added a range to the SYNTAX clause",
      "zh-CHS": "（19） frPVCConnectIndex-在语法子句中添加了一个范围"
    },
    {
      "indent": 3,
      "text": "(20) frPVCConnect{L2h|H2l}OperStatus - Added DESCRIPTION text for each enumerated value.",
      "zh-CHS": "（20） frPVCConnect{L2h | H2l}操作状态-为每个枚举值添加描述文本。"
    },
    {
      "indent": 3,
      "text": "(21) frAccountPVCDLCIIndex - Added a range to the SYNTAX clause",
      "zh-CHS": "（21）FraccountPVCDLCINDEX-在语法子句中添加了一个范围"
    },
    {
      "indent": 3,
      "text": "(22) frPVCCOnnectStatusChange Notification - STATUS change to deprecated. Obsoleted to eliminate inappropriate inclusion of index objects",
      "zh-CHS": "（22）frPVCCOnnectStatusChange通知-状态更改为已弃用。淘汰，以消除索引对象的不适当包含"
    },
    {
      "indent": 3,
      "text": "(23) frPVCConnectStatusNotif Notification - Replaces frPVCConnectStatusChange. In addition, the notification now requires 2 instances of the frPVCEndptRcvdSigStatus object, one for each endpoint of the connection.",
      "zh-CHS": "（23）frPVCConnectStatusNotif通知-替换frPVCConnectStatusChange。此外，通知现在需要两个frPVCEndptRcvdSigStatus对象实例，每个连接端点一个。"
    },
    {
      "indent": 3,
      "text": "(24) Guidance added to recommend ifLinkUpDownTrapEnable be set on.",
      "zh-CHS": "（24）添加到建议iFlinkUpDownTrable可设置的指南。"
    },
    {
      "indent": 3,
      "text": "(25) Behavior of the PVC status and endpoint signaling status is clarified for the case of underlying layer failure.",
      "zh-CHS": "（25）对于底层失效的情况，阐明了PVC状态和端点信号状态的行为。"
    },
    {
      "indent": 3,
      "text": "(26) Overview text re-written for clarity.",
      "zh-CHS": "（26）为清晰起见，重新编写概述文本。"
    },
    {
      "indent": 3,
      "text": "(27) Clarified role of system group.",
      "zh-CHS": "（27）明确了系统组的作用。"
    },
    {
      "indent": 3,
      "text": "(28) Established maximum frame size of 4096 and default value of 1600.",
      "zh-CHS": "（28）确定的最大帧大小为4096，默认值为1600。"
    },
    {
      "indent": 3,
      "text": "(29) Clarified that DLC index range is restricted to valid range for the specific length of address field used on the logical port.",
      "zh-CHS": "（29）澄清了DLC索引范围仅限于逻辑端口上使用的特定地址字段长度的有效范围。"
    },
    {
      "indent": 3,
      "text": "(30) Figure 1 and accompanying text was removed to eliminate a confusing \"MIB stack\" concept. See the section titled \"Relation to Other MIBs\" for replacement text.",
      "zh-CHS": "（30）删除图1和附带的文本，以消除令人困惑的“MIB堆栈”概念。有关替换文本，请参阅标题为“与其他MIB的关系”的部分。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property Rights",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF Secretariat.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何努力来确定任何此类权利。有关IETF在标准跟踪和标准相关文件中权利的程序信息，请参见BCP-11。可从IETF秘书处获得可供发布的权利声明副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涉及实施本标准所需技术的专有权利。请将信息发送给IETF执行董事。"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}