{
  "title": {
    "text": "RFC 2399:  Request for Comments Summary ",
    "zh-CHS": "RFC 2399"
  },
  "number": 2399,
  "created_at": "2021-10-23 01:15:04.162233+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           A. Ramos\nRequest for Comments: 2399                                           ISI\nCategory: Informational                                     January 1999",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "Request for Comments Summary",
      "zh-CHS": "征求意见摘要"
    },
    {
      "indent": 25,
      "text": "RFC Numbers 2300-2399",
      "zh-CHS": "RFC编号2300-2399"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This RFC is a slightly annotated list of the 100 RFCs from RFC 2300 through RFCs 2399. This is a status report on these RFCs. This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "此RFC是RFC2300到RFC2399之间的100个RFC的略带注释的列表。这是这些RFC的状态报告。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Note",
      "zh-CHS": "笔记"
    },
    {
      "indent": 3,
      "text": "Many RFCs, but not all, are Proposed Standards, Draft Standards, or Standards. Since the status of these RFCs may change during the standards processing, we note here only that they are on the standards track. Please see the latest edition of \"Internet Official Protocol Standards\" for the current state and status of these RFCs. In the following, RFCs on the standards track are marked [STANDARDS-TRACK].",
      "zh-CHS": "许多RFC（但不是所有RFC）是提议的标准、标准草案或标准。由于这些RFC的状态在标准处理过程中可能会发生变化，因此我们在此只注意到它们处于标准轨道上。请参阅最新版本的“互联网官方协议标准”，了解这些RFC的当前状态和状态。在下文中，标准轨道上的RFC标记为[standards-track]。"
    },
    {
      "indent": 0,
      "text": "RFC     Author          Date            Title\n---     ------          ----            -----",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2399 Ramos Jan 1999 Request for Comments Summary",
      "zh-CHS": "2399拉莫斯1999年1月征求意见摘要"
    },
    {
      "indent": 0,
      "text": "This memo.",
      "zh-CHS": "这份备忘录。"
    },
    {
      "indent": 0,
      "text": "2398 Parker Aug 1998 Some Testing Tools for TCP Implementors",
      "zh-CHS": "2398 Parker 1998年8月TCP实现者的一些测试工具"
    },
    {
      "indent": 0,
      "text": "This document lists only tools which can evaluate one or more TCP implementations, or which can privde some specific results which describe or evaluate the TCP being tested. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档仅列出可评估一个或多个TCP实现的工具，或可提供描述或评估正在测试的TCP的某些特定结果的工具。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2397 Masinter Aug 1998 The \"data\" URL scheme",
      "zh-CHS": "2397 Masinter 1998年8月“数据”URL方案"
    },
    {
      "indent": 0,
      "text": "A new URL scheme, \"data\", is defined. It allows inclusion of small data items as \"immediate\" data, as if it had been included externally. [STANDARDS-TRACK]",
      "zh-CHS": "定义了一个新的URL方案“数据”。它允许将小数据项作为“即时”数据包含，就好像它是外部包含的一样。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2396 Berners-Lee Aug 1998 Uniform Resource Identifiers (URI): Generic Syntax",
      "zh-CHS": "2396 Berners Lee 1998年8月统一资源标识符（URI）：通用语法"
    },
    {
      "indent": 0,
      "text": "This document defines a grammar that is a superset of all valid URI, such that an implementation can parse the common components of a URI reference without knowing the scheme-specific requirements of every possible identifier type. [STANDARDS-TRACK]",
      "zh-CHS": "本文档定义了一个语法，它是所有有效URI的超集，因此实现可以解析URI引用的公共组件，而不需要知道每个可能标识符类型的特定于方案的要求。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2395 Friend Dec 1998 IP Payload Compression Using LZS",
      "zh-CHS": "2395 Friend Dec 1998使用LZS的IP有效负载压缩"
    },
    {
      "indent": 0,
      "text": "This document describes a compression method based on the LZS compression algorithm. This document defines the application of the LZS algorithm to the IP Payload Compression Protocol. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文描述了一种基于LZS压缩算法的压缩方法。本文档定义了LZS算法在IP有效负载压缩协议中的应用。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2394 Pereira Dec 1998 IP Payload Compression Using DEFLATE",
      "zh-CHS": "2394 Pereira 1998年12月IP有效载荷压缩使用DEFLATE"
    },
    {
      "indent": 0,
      "text": "This document describes a compression method based on the DEFLATE compression algorithm. This document defines the application of the DEFLATE algorithm to the IP Payload Compression Protocol. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文描述了一种基于DEFLATE压缩算法的压缩方法。本文档定义了DEFLATE算法在IP有效负载压缩协议中的应用。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2393 Shacham Dec 1998 IP Payload Compression Protocol (IPComp)",
      "zh-CHS": "2393 Shacham Dec 1998 IP有效负载压缩协议（IPComp）"
    },
    {
      "indent": 0,
      "text": "This document describes a protocol intended to provide lossless compression for Internet Protocol datagrams in an Internet environment. [STANDARDS-TRACK]",
      "zh-CHS": "本文档描述了一种协议，旨在为Internet环境中的Internet协议数据报提供无损压缩。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2392 Levinson Aug 1998 Content-ID and Message-ID Uniform Resource Locators",
      "zh-CHS": "2392 Levinson 1998年8月内容ID和消息ID统一资源定位器"
    },
    {
      "indent": 0,
      "text": "The Uniform Resource Locator (URL) schemes, \"cid:\" and \"mid:\" allow references to messages and the body parts of messages. For example, within a single multipart message, one HTML body part might include embedded references to other parts of the same message. [STANDARDS-TRACK]",
      "zh-CHS": "统一资源定位器（URL）方案“cid:”和“mid:”允许引用消息和消息的正文部分。例如，在单个多部分消息中，一个HTML正文部分可能包含对同一消息其他部分的嵌入引用。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2391 Srisuresh Aug 1998 Load Sharing using IP Network Address Translation (LSNAT)",
      "zh-CHS": "2391 Srisuresh 1998年8月使用IP网络地址转换（LSNAT）的负载共享"
    },
    {
      "indent": 0,
      "text": "In this document, we extend the use of NATs to offer Load share feature, where session load can be distributed across a pool of servers, instead of directing to a single server. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "在本文中，我们扩展了NAT的使用，以提供负载共享功能，其中会话负载可以分布在服务器池中，而不是定向到单个服务器。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2390 Bradley Sep 1998 Inverse Address Resolution Protocol",
      "zh-CHS": "2390布拉德利1998年9月反向地址解析协议"
    },
    {
      "indent": 0,
      "text": "This memo describes additions to ARP that will allow a station to request a protocol address corresponding to a given hardware address. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录描述了ARP的新增功能，允许站点请求与给定硬件地址对应的协议地址。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2389 Hethmon Aug 1998 Feature negotiation mechanism for the File Transfer Protocol",
      "zh-CHS": "2389 Hethmon 1998年8月特性文件传输协议协商机制"
    },
    {
      "indent": 0,
      "text": "This document provides a mechanism by which clients of the FTP protocol can discover which new features are supported by a particular FTP server. [STANDARDS-TRACK]",
      "zh-CHS": "本文档提供了一种机制，通过该机制，FTP协议的客户端可以发现特定FTP服务器支持哪些新功能。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2388 Masinter Aug 1998 Returning Values from Forms: multipart/form-data",
      "zh-CHS": "2388 Masinter 1998年8月从表单返回值：多部分/表单数据"
    },
    {
      "indent": 0,
      "text": "This specification defines an Internet Media Type, multipart/form-data, which can be used by a wide variety of applications and transported by a wide variety of protocols as a way of returning a set of values as the result of a user filling out a form. [STANDARDS-TRACK]",
      "zh-CHS": "本规范定义了一种互联网媒体类型，即多部分/表单数据，可由多种应用程序使用，并可通过多种协议传输，作为用户填写表单时返回一组值的方式。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2387 Levinson Aug 1998 The MIME Multipart/Related Content-type",
      "zh-CHS": "2387 Levinson 1998年8月MIME多部分/相关内容类型"
    },
    {
      "indent": 0,
      "text": "This document defines the Multipart/Related content-type and provides examples of its use. [STANDARDS-TRACK]",
      "zh-CHS": "本文档定义了多部分/相关内容类型，并提供了其使用示例。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2386 Crawley Aug 1998 A Framework for QoS-based Routing in the Internet",
      "zh-CHS": "2386 Crawley 1998年8月Internet中基于QoS的路由框架"
    },
    {
      "indent": 0,
      "text": "This document describes some of the QoS-based routing issues and requirements, and proposes a framework for QoS-based routing in the Internet. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了一些基于QoS的路由问题和需求，并提出了Internet中基于QoS的路由框架。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2385 Heffernan Aug 1998 Protection of BGP Sessions via the TCP MD5 Signature Option",
      "zh-CHS": "2385 Heffernan 1998年8月通过TCP MD5签名选项保护BGP会话"
    },
    {
      "indent": 0,
      "text": "This memo describes a TCP extension to enhance security for BGP. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录描述了一个TCP扩展，以增强BGP的安全性。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2384 Gellens Aug 1998 POP URL Scheme",
      "zh-CHS": "2384 Gellens 1998年8月POP URL方案"
    },
    {
      "indent": 0,
      "text": "This memo defines a URL scheme for referencing a POP mailbox. [STANDARDS-TRACK]",
      "zh-CHS": "此备忘录定义了用于引用POP邮箱的URL方案。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2383 Suzuki Aug 1998 ST2+ over ATM Protocol Specification - UNI 3.1 Version",
      "zh-CHS": "2383铃木1998年8月ST2+over ATM协议规范-UNI 3.1版本"
    },
    {
      "indent": 0,
      "text": "This document specifies an ATM-based protocol for communication between ST2+ agents. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文件规定了ST2+代理之间基于ATM的通信协议。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2382 Crawley Aug 1998 A Framework for Integrated Services and RSVP over ATM",
      "zh-CHS": "2382 Crawley 1998年8月ATM上的综合业务和RSVP框架"
    },
    {
      "indent": 0,
      "text": "This document outlines the issues and framework related to providing IP Integrated Services with RSVP over ATM. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文件概述了通过ATM向RSVP提供IP综合服务的相关问题和框架。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2381 Garrett Aug 1998 Interoperation of Controlled-Load Service and Guaranteed Service with ATM",
      "zh-CHS": "2381 Garrett 1998年8月受控负载服务和保证服务与ATM的互操作"
    },
    {
      "indent": 0,
      "text": "This document provides guidelines for mapping service classes, and traffic management features and parameters between Internet and ATM technologies. [STANDARDS-TRACK]",
      "zh-CHS": "本文档提供了在Internet和ATM技术之间映射服务类别、流量管理功能和参数的指南。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2380 Berger Aug 1998 RSVP over ATM Implementation Requirements",
      "zh-CHS": "2380 Berger 1998年8月关于ATM实施要求的RSVP"
    },
    {
      "indent": 0,
      "text": "This memo presents specific implementation requirements for running RSVP over ATM switched virtual circuits (SVCs). It presents requirements that ensure interoperability between multiple implementations and conformance to the RSVP and Integrated Services specifications. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录介绍了在ATM交换虚拟电路（SVC）上运行RSVP的具体实施要求。它提出了确保多个实现之间的互操作性以及符合RSVP和集成服务规范的要求。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2379 Berger Aug 1998 RSVP over ATM Implementation Guidelines",
      "zh-CHS": "2379 Berger 1998年8月关于ATM实施指南的RSVP"
    },
    {
      "indent": 0,
      "text": "This memo presents specific implementation guidelines for running RSVP over ATM switched virtual circuits (SVCs). This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "zh-CHS": "本备忘录提供了在ATM交换虚拟电路（SVC）上运行RSVP的具体实施指南。本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2378 Hedberg Sep 1998 The CCSO Nameserver (Ph) Architecture",
      "zh-CHS": "2378 Hedberg 1998年9月CCSO名称服务器（Ph）体系结构"
    },
    {
      "indent": 0,
      "text": "The Ph Nameserver from the Computing and Communications Services Office (CCSO), University of Illinois at Urbana-Champaign has for some time now been used by several organizations as their choice of publicly available database for information about people as well as other things. This document provides a formal definition of the client-server protocol. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "来自伊利诺伊大学和通信服务办公室（CCSO）的Pr.NeSeServer，在Unrina ChanaPiangle的伊利诺伊大学已经有一段时间被一些组织用来作为公开选择的数据库来获取关于人以及其他事物的信息。本文档提供了客户机-服务器协议的正式定义。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2377 Grimstad Sep 1998 Naming Plan for Internet Directory-Enabled Applications",
      "zh-CHS": "2377 Grimstad 1998年9月启用Internet目录的应用程序命名计划"
    },
    {
      "indent": 0,
      "text": "Application of the conventional X.500 approach to naming has heretofore, in the experience of the authors, proven to be an obstacle to the wide deployment of directory-enabled applications on the Internet. We propose a new directory naming plan that leverages the strengths of the most popular and successful Internet naming schemes for naming objects",
      "zh-CHS": "根据作者的经验，到目前为止，传统的X.500命名方法的应用已被证明是在Internet上广泛部署支持目录的应用程序的一个障碍。我们提出了一个新的目录命名计划，它利用了最流行和最成功的Internet命名方案的优点来命名对象"
    },
    {
      "indent": 0,
      "text": "in a hierarchical directory. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "在分层目录中。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2376 Whitehead Jul 1998 XML Media Types",
      "zh-CHS": "2376 Whitehead 1998年7月XML媒体类型"
    },
    {
      "indent": 0,
      "text": "This document proposes two new media subtypes, text/xml and application/xml, for use in exchanging network entities which are conforming Extensible Markup Language (XML). This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档提出了两种新的媒体子类型，text/xml和application/xml，用于交换符合可扩展标记语言（xml）的网络实体。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2375 Hinden Jul 1998 IPv6 Multicast Address Assignments",
      "zh-CHS": "2375 Hinden 1998年7月IPv6多播地址分配"
    },
    {
      "indent": 0,
      "text": "This document defines the initial assignment of IPv6 multicast addresses. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档定义了IPv6多播地址的初始分配。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2374 Hinden Jul 1998 An IPv6 Aggregatable Global Unicast Address Format",
      "zh-CHS": "2374 Hinden 1998年7月IPv6可聚合全局单播地址格式"
    },
    {
      "indent": 0,
      "text": "This document defines an IPv6 aggregatable global unicast address format for use in the Internet. [STANDARDS-TRACK]",
      "zh-CHS": "本文档定义了用于Internet的IPv6可聚合全局单播地址格式。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2373 Hinden Jul 1998 IP Version 6 Addressing Architecture",
      "zh-CHS": "2373 Hinden 1998年7月IP版本6寻址体系结构"
    },
    {
      "indent": 0,
      "text": "This specification defines the addressing architecture of the IP Version 6 protocol [IPV6]. [STANDARDS-TRACK]",
      "zh-CHS": "本规范定义了IP版本6协议[IPV6]的寻址体系结构。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2372 Evans Jul 1998 Transaction Internet Protocol - Requirements and Supplemental Information",
      "zh-CHS": "2372埃文斯1998年7月交易互联网协议-要求和补充信息"
    },
    {
      "indent": 0,
      "text": "This document describes the purpose (usage scenarios), and requirements for the Transaction Internet Protocol. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了事务Internet协议的用途（使用场景）和要求。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2371 Lyon Jul 1998 Transaction Internet Protocol Version 3.0",
      "zh-CHS": "2371里昂1998年7月交易互联网协议版本3.0"
    },
    {
      "indent": 0,
      "text": "In many applications where different nodes cooperate on some work, there is a need to guarantee that the work happens atomically. That is, each node must reach the same conclusion as to whether the work is to be completed, even in the face of failures. This document proposes a simple, easily-implemented protocol for achieving this end. [STANDARDS-TRACK]",
      "zh-CHS": "在许多应用程序中，不同的节点在某些工作上进行协作，因此需要保证工作以原子方式进行。也就是说，每个节点必须就是否要完成工作得出相同的结论，即使在面临失败的情况下也是如此。本文件提出了一个简单、易于实现的协议，以实现这一目标。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2370 Coltun Jul 1998 The OSPF Opaque LSA Option",
      "zh-CHS": "2370科尔顿1998年7月OSPF不透明LSA选项"
    },
    {
      "indent": 0,
      "text": "This memo defines enhancements to the OSPF protocol to support a new class of link-state advertisements (LSA) called Opaque LSAs. [STANDARDS-TRACK]",
      "zh-CHS": "此备忘录定义了OSPF协议的增强功能，以支持一种称为不透明LSA的新型链路状态播发（LSA）。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2369 Neufeld Jul 1998 The Use of URLs as Meta-Syntax for Core Mail List Commands and their Transport through Message Header Fields",
      "zh-CHS": "2369 Neufeld 1998年7月使用URL作为核心邮件列表命令的元语法及其通过消息头字段的传输"
    },
    {
      "indent": 0,
      "text": "The mailing list command specification header fields are a set of structured fields to be added to email messages sent by email distribution lists.",
      "zh-CHS": "邮件列表命令规范标题字段是一组结构化字段，要添加到由电子邮件通讯组列表发送的电子邮件中。"
    },
    {
      "indent": 0,
      "text": "By including these header fields, list servers can make it possible for mail clients to provide automated tools for users to perform list functions. This could take the form of a menu item, push button, or other user interface element. The intent is to simplify the user experience, providing a common interface to the often cryptic and varied mailing list manager commands. [STANDARDS-TRACK]",
      "zh-CHS": "通过包含这些标题字段，列表服务器可以让邮件客户端为用户提供执行列表功能的自动化工具。这可以采取菜单项、按钮或其他用户界面元素的形式。其目的是简化用户体验，为经常晦涩多变的邮件列表管理器命令提供公共界面。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2368 Hoffman Jul 1998 The mailto URL scheme",
      "zh-CHS": "2368 Hoffman 1998年7月mailto URL方案"
    },
    {
      "indent": 0,
      "text": "This document defines the format of Uniform Resource Locators (URL) for designating electronic mail addresses. [STANDARDS-TRACK]",
      "zh-CHS": "本文档定义了用于指定电子邮件地址的统一资源定位器（URL）的格式。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2367 McDonald Jul 1998 PF_KEY Key Management API, Version 2",
      "zh-CHS": "2367 McDonald 1998年7月PF_密钥管理API，第2版"
    },
    {
      "indent": 0,
      "text": "A generic key management API that can be used not only for IP Security but also for other network security services is presented in this document. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文介绍了一种通用密钥管理API，该API不仅可用于IP安全，还可用于其他网络安全服务。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2366 Chung Jul 1998 Definitions of Managed Objects for Multicast over UNI 3.0/3.1 based ATM Networks",
      "zh-CHS": "2366 Chung Jul 1998基于UNI 3.0/3.1的ATM网络上多播托管对象的定义"
    },
    {
      "indent": 0,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects for IP hosts and routers that use a Multicast Address Resolution Server (MARS) to support IP multicast over ATM, as described in 'Support for Multicast over UNI 3.0/3.1 based ATM Networks'. [STANDARDS-TRACK]",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别是，它描述了使用多播地址解析服务器（MARS）支持ATM上的IP多播的IP主机和路由器的托管对象，如“支持基于UNI 3.0/3.1的ATM网络上的多播”中所述。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2365 Meyer Jul 1998 Administratively Scoped IP Multicast",
      "zh-CHS": "2365 Meyer 1998年7月管理范围的IP多播"
    },
    {
      "indent": 0,
      "text": "This document defines the \"administratively scoped IPv4 multicast space\" to be the range 239.0.0.0 to 239.255.255.255. In addition, it describes a simple set of semantics for the implementation of Administratively Scoped IP Multicast. Finally, it provides a mapping between the IPv6 multicast address classes [RFC1884] and IPv4 multicast address classes. This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "zh-CHS": "本文档将“管理范围的IPv4多播空间”定义为范围239.0.0.0至239.255.255.255。此外，它还描述了一组用于实现管理范围的IP多播的简单语义。最后，它提供了IPv6多播地址类[RFC1884]和IPv4多播地址类之间的映射。本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2364 Gross Jul 1998 PPP Over AAL5",
      "zh-CHS": "2364 1998年7月总购买力平价超过AAL5"
    },
    {
      "indent": 0,
      "text": "This document describes the use of ATM Adaptation Layer 5 (AAL5) for framing PPP encapsulated packets. [STANDARDS-TRACK]",
      "zh-CHS": "本文档描述了ATM适配层5（AAL5）用于帧PPP封装数据包的使用。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2363 Gross Jul 1998 PPP Over FUNI",
      "zh-CHS": "2363 1998年7月富尼购买力平价总额"
    },
    {
      "indent": 0,
      "text": "This document describes the use of ATM Frame User Network Interface (FUNI) for framing PPP encapsulated packets. [STANDARDS-TRACK]",
      "zh-CHS": "本文档描述了ATM帧用户网络接口（FUNI）用于帧PPP封装数据包的使用。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2362 Estrin Jun 1998 Protocol Independent Multicast-Sparse Mode (PIM-SM): Protocol Specification",
      "zh-CHS": "2362 Estrin 1998年6月协议独立多播稀疏模式（PIM-SM）：协议规范"
    },
    {
      "indent": 0,
      "text": "This document describes a protocol for efficiently routing to multicast groups that may span wide-area (and inter-domain) internets. This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested.",
      "zh-CHS": "本文档描述了一种有效路由到可能跨越广域（和域间）互联网的多播组的协议。这份备忘录为互联网社区定义了一个实验性协议。它没有规定任何类型的互联网标准。要求进行讨论并提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2361 Fleischman Jun 1998 WAVE and AVI Codec Registries",
      "zh-CHS": "2361 Fleischman Jun 1998 WAVE和AVI编解码器注册"
    },
    {
      "indent": 0,
      "text": "The purpose of this paper is to establish a mechanism by which codecs registered within Microsoft's WAVE and AVI Registries may be referenced within the IANA Namespace by Internet applications. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文的目的是建立一种机制，通过该机制，互联网应用程序可以在IANA名称空间中引用在Microsoft WAVE和AVI注册中心注册的编解码器。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2360 Scott Jun 1998 Guide for Internet Standards Writers",
      "zh-CHS": "2360 Scott Jun 1998互联网标准编写者指南"
    },
    {
      "indent": 0,
      "text": "This document is a guide for Internet standard writers. It defines those characteristics that make standards coherent, unambiguous, and easy to interpret. This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "zh-CHS": "本文件为互联网标准编写者指南。它定义了使标准连贯、明确且易于解释的特征。本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2359 Myers Jun 1998 IMAP4 UIDPLUS extension",
      "zh-CHS": "2359迈尔斯1998年6月IMAP4 UIDPLUS扩展"
    },
    {
      "indent": 0,
      "text": "The UIDPLUS extension of the Internet Message Access Protocol [IMAP4] provides a set of features intended to reduce the amount of time and resources used by some client operations. [STANDARDS-TRACK]",
      "zh-CHS": "Internet消息访问协议[IMAP4]的UIDPLUS扩展提供了一组功能，旨在减少某些客户端操作使用的时间和资源量。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2358 Flick Jun 1998 Definitions of Managed Objects for the Ethernet-like Interface Types",
      "zh-CHS": "2358 Flick Jun 1998以太网类接口类型的托管对象定义"
    },
    {
      "indent": 0,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. This memo obsoletes RFC 1650 \"Definitions of Managed Objects for the Ethernet-like Interface Types using SMIv2\". This memo extends that specification by including management information useful for the management of 100 Mb/s Ethernet interfaces. [STANDARDS-TRACK]",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。本备忘录废除了RFC 1650“使用SMIv2的类以太网接口类型的托管对象定义”。本备忘录扩展了该规范，包括了对管理100 Mb/s以太网接口有用的管理信息。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2357 Mankin Jun 1998 IETF Criteria for Evaluating Reliable Multicast Transport and Application Protocols",
      "zh-CHS": "2357 Mankin Jun 1998 IETF评估可靠多播传输和应用协议的标准"
    },
    {
      "indent": 0,
      "text": "This memo describes the procedures and criteria for reviewing reliable multicast protocols within the Transport Area (TSV) of the IETF. Within today's Internet, important applications exist for a reliable multicast service. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本备忘录描述了审查IETF传输区（TSV）内可靠多播协议的程序和标准。在当今的互联网中，可靠的多播服务有着重要的应用。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2356 Montenegro Jun 1998 Sun's SKIP Firewall Traversal for Mobile IP",
      "zh-CHS": "2356黑山1998年6月Sun为移动IP跳过防火墙"
    },
    {
      "indent": 0,
      "text": "The Mobile IP specification establishes the mechanisms that enable a mobile host to maintain and use the same IP address as it changes its point of attachment to the network. The mechanisms described in this document allow a mobile node out on a public sector of the internet to negotiate access past a SKIP firewall, and construct a secure channel into its home network. This memo provides information for the Internet community. This memo does not specify an Internet standard of any kind.",
      "zh-CHS": "移动IP规范建立了使移动主机能够在更改其网络连接点时维护和使用相同IP地址的机制。本文档中描述的机制允许互联网公共部门的移动节点协商通过跳过防火墙的访问，并构建进入其家庭网络的安全通道。本备忘录为互联网社区提供信息。本备忘录未规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2355 Kelly Jun 1998 TN3270 Enhancements",
      "zh-CHS": "2355凯利1998年6月TN3270增强"
    },
    {
      "indent": 0,
      "text": "This document describes a protocol that more fully supports 3270 devices than do traditional tn3270 practices. [STANDARDS-TRACK]",
      "zh-CHS": "本文档描述的协议比传统tn3270实践更全面地支持3270设备。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2354 Perkins Jun 1998 Options for Repair of Streaming Media",
      "zh-CHS": "2354 Perkins 1998年6月用于修复流媒体的选项"
    },
    {
      "indent": 0,
      "text": "This document summarizes a range of possible techniques for the repair of continuous media streams subject to packet loss. This memo provides information for the Internet community. This memo does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档总结了一系列可能的技术，用于修复受到分组丢失影响的连续媒体流。本备忘录为互联网社区提供信息。本备忘录未规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2353 Dudley May 1998 APPN/HPR in IP Networks APPN Implementers' Workshop Closed Pages Document",
      "zh-CHS": "2353 Dudley 1998年5月IP网络中的APPN/HPR APPN实施者研讨会闭页文档"
    },
    {
      "indent": 0,
      "text": "This memo defines a method with which HPR nodes can use IP networks for communication, and the enhancements to APPN required by this method. This memo also describes an option set that allows the use of the APPN connection network model to allow HPR nodes to use IP",
      "zh-CHS": "此备忘录定义了HPR节点可以使用IP网络进行通信的方法，以及此方法所需的APPN增强功能。本备忘录还描述了一个选项集，该选项集允许使用APPN连接网络模型来允许HPR节点使用IP"
    },
    {
      "indent": 0,
      "text": "networks for communication without having to predefine link connections. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "无需预定义链路连接的通信网络。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2352 Vaughan May 1998 A Convention For Using Legal Names as Domain Names",
      "zh-CHS": "2352沃恩于1998年5月签署了将法定名称用作域名的公约"
    },
    {
      "indent": 0,
      "text": "The purpose of this memo is to focus discussion on the particular problems with the exhaustion of the top level domain space in the Internet and the possible conflicts that can occur when multiple organisations are vying for the same name. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本备忘录旨在集中讨论互联网顶级域名空间耗尽的特殊问题，以及多个组织争夺同一名称时可能发生的冲突。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2351 Robert May 1998 Mapping of Airline Reservation, Ticketing, and Messaging Traffic over IP",
      "zh-CHS": "2351 Robert 1998年5月通过IP映射航空公司预订、票务和消息传递流量"
    },
    {
      "indent": 0,
      "text": "This memo specifies a protocol for the encapsulation of the airline specific protocol over IP. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本备忘录规定了通过IP封装航空公司特定协议的协议。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2250 Brownlee Jun 1998 Expectations for Computer Security Incident Response",
      "zh-CHS": "2250 Brownlee 1998年6月计算机安全事件响应期望"
    },
    {
      "indent": 0,
      "text": "The purpose of this document is to express the general Internet community's expectations of Computer Security Incident Response Teams (CSIRTs). It is not possible to define a set of requirements that would be appropriate for all teams, but it is possible and helpful to list and describe the general set of topics and issues which are of concern and interest to constituent communities. This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "zh-CHS": "本文档旨在表达一般互联网社区对计算机安全事件响应团队（CSIRT）的期望。不可能定义一套适用于所有团队的要求，但列出和描述组成社区关注和感兴趣的主题和问题是可能的，也是有帮助的。本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2349 Malkin May 1998 TFTP Timeout Interval and Transfer Size Options",
      "zh-CHS": "2349 Malkin 1998年5月TFTP超时间隔和传输大小选项"
    },
    {
      "indent": 0,
      "text": "The Trivial File Transfer Protocol is a simple, lock-step, file transfer protocol which allows a client to get or put a file onto a remote host. This document describes two TFTP options. [STANDARDS-TRACK]",
      "zh-CHS": "琐碎文件传输协议是一个简单的、锁定步骤的文件传输协议，它允许客户端获取文件或将文件放到远程主机上。本文档描述了两个TFTP选项。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2348 Malkin May 1998 TFTP Blocksize Option",
      "zh-CHS": "2348 Malkin 1998年5月TFTP块大小选项"
    },
    {
      "indent": 0,
      "text": "The Trivial File Transfer Protocol is a simple, lock-step, file transfer protocol which allows a client to get or put a file onto a remote host. This document describes a TFTP option which allows the client and server to negotiate a blocksize more applicable to the network medium. [STANDARDS-TRACK]",
      "zh-CHS": "琐碎文件传输协议是一个简单的、锁定步骤的文件传输协议，它允许客户端获取文件或将文件放到远程主机上。本文档描述了TFTP选项，该选项允许客户端和服务器协商更适用于网络介质的块大小。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2347 Malkin May 1998 TFTP Option Extension",
      "zh-CHS": "2347马尔金1998年5月TFTP期权延期"
    },
    {
      "indent": 0,
      "text": "The Trivial File Transfer Protocol is a simple, lock-step, file transfer protocol which allows a client to get or put a file onto a remote host. This document describes a simple extension to TFTP to allow option negotiation prior to the file transfer. [STANDARDS-TRACK]",
      "zh-CHS": "琐碎文件传输协议是一个简单的、锁定步骤的文件传输协议，它允许客户端获取文件或将文件放到远程主机上。本文档描述了TFTP的一个简单扩展，以允许在文件传输之前进行选项协商。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2346 Palme May 1998 Making Postscript and PDF International",
      "zh-CHS": "2346 Palme 1998年5月制作Postscript和PDF国际版"
    },
    {
      "indent": 0,
      "text": "Certain text formats, for example Postscript (MIME-Type: application/postscript; file extension .ps) and Portable Document Format (MIME-Type: application/pdf; file extension .pdf) specify exactly the page layout of the printed document. The commonly used paper format is different in North America and the rest of the world. North America uses the 'Letter' format, while the rest of the world mostly uses the ISO-standard 'A4' format. This means that documents formatted on one continent may not be easily printable on another continent. This memo gives advice on how to produce documents which are equally well printable with the Letter and the A4 formats. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "某些文本格式，例如Postscript（MIME类型：application/Postscript；文件扩展名.ps）和Portable Document Format（MIME类型：application/pdf；文件扩展名.pdf）精确指定打印文档的页面布局。北美和世界其他地区常用的纸张格式不同。北美使用“字母”格式，而世界其他地区大多使用ISO标准的“A4”格式。这意味着在一个大陆上格式化的文档可能不容易在另一个大陆上打印。本备忘录就如何制作与信函和A4格式同样可打印的文件提供了建议。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2345 Klensin May 1998 Domain Names and Company Name Retrieval",
      "zh-CHS": "2345 Klensin 1998年5月域名和公司名称检索"
    },
    {
      "indent": 0,
      "text": "This document proposes a company name to URL mapping service based on the oldest and least complex of Internet directory protocols, whois, in order to explore whether an extremely simple and widely-deployed protocol can succeed where more complex and powerful options have failed or been excessively delayed. This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested.",
      "zh-CHS": "本文档提出了一种基于最古老和最不复杂的互联网目录协议whois的公司名称到URL映射服务，以探索在更复杂和强大的选项失败或被过度延迟的情况下，一个极其简单和广泛部署的协议是否能够成功。这份备忘录为互联网社区定义了一个实验性协议。它没有规定任何类型的互联网标准。要求进行讨论并提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2344 Montenegro May 1998 Reverse Tunneling for Mobile IP",
      "zh-CHS": "2344黑山1998年5月移动IP反向隧道"
    },
    {
      "indent": 0,
      "text": "This document proposes backwards-compatible extensions to Mobile IP in order to support topologically correct reverse tunnels. [STANDARDS-TRACK]",
      "zh-CHS": "本文档建议向后兼容移动IP扩展，以支持拓扑正确的反向隧道。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2343 Civanlar May 1998 RTP Payload Format for Bundled MPEG",
      "zh-CHS": "2343 Civanlar 1998年5月捆绑MPEG的RTP有效载荷格式"
    },
    {
      "indent": 0,
      "text": "This document describes a payload type for bundled, MPEG-2 encoded video and audio data that may be used with RTP, version 2. This memo defines an Experimental Protocol for the Internet community. This memo does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested.",
      "zh-CHS": "本文档描述了捆绑的MPEG-2编码视频和音频数据的有效负载类型，该数据可与RTP版本2一起使用。这份备忘录为互联网社区定义了一个实验性协议。本备忘录未规定任何类型的互联网标准。要求进行讨论并提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2342 Gahrns May 1998 IMAP4 Namespace",
      "zh-CHS": "2342 Gahrns 1998年5月IMAP4命名空间"
    },
    {
      "indent": 0,
      "text": "This document defines a NAMESPACE command that allows a client to discover the prefixes of namespaces used by a server for personal mailboxes, other users' mailboxes, and shared mailboxes. [STANDARDS-TRACK]",
      "zh-CHS": "本文档定义了一个NAMESPACE命令，该命令允许客户端发现服务器用于个人邮箱、其他用户邮箱和共享邮箱的命名空间前缀。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2341 Valencia May 1998 Cisco Layer Two Forwarding (Protocol) \"L2F\"",
      "zh-CHS": "2341瓦伦西亚1998年5月Cisco第二层转发（协议）“L2F”"
    },
    {
      "indent": 0,
      "text": "This document describes the Layer Two Forwarding protocol (L2F) which permits the tunneling of the link layer (i.e., HDLC, async HDLC, or SLIP frames) of higher level protocols. This memo describes a historic protocol for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了第二层转发协议（L2F），该协议允许对更高级别协议的链路层（即HDLC、异步HDLC或滑动帧）进行隧道传输。本备忘录描述了互联网社区的历史协议。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2340 Jamoussi May 1998 Nortel's Virtual Network Switching (VNS) Overview",
      "zh-CHS": "2340 Jamoussi 1998年5月北电虚拟网络交换（VNS）概述"
    },
    {
      "indent": 0,
      "text": "This document provides an overview of Virtual Network Switching (VNS). This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档概述了虚拟网络交换（VNS）。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2339 ISOC May 1998 An Agreement Between the Internet Society, the IETF, and Sun Microsystems, Inc. in the matter of NFS V.4 Protocols",
      "zh-CHS": "2339 ISOC 1998年5月，互联网协会、IETF和Sun Microsystems，Inc.就NFS V.4协议达成协议"
    },
    {
      "indent": 0,
      "text": "This Request for Comments records an agreement between Sun Microsystems, Inc. and the Internet Society to permit the flow of Sun's Network File System specifications into the Internet Standards process conducted by the Internet Engineering Task Force. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本征求意见书记录了Sun Microsystems，Inc.与互联网协会之间的一项协议，该协议允许Sun的网络文件系统规范流入互联网工程任务组执行的互联网标准流程。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2338 Knight Apr 1998 Virtual Router Redundancy Protocol",
      "zh-CHS": "2338 Knight Apr 1998虚拟路由器冗余协议"
    },
    {
      "indent": 0,
      "text": "This memo defines the Virtual Router Redundancy Protocol (VRRP). VRRP specifies an election protocol that dynamically assigns responsibility for a virtual router to one of the VRRP routers on a LAN. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录定义了虚拟路由器冗余协议（VRRP）。VRRP指定一个选择协议，该协议动态地将虚拟路由器的责任分配给LAN上的一个VRRP路由器。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2337 Farinacci Apr 1998 Intra-LIS IP multicast among routers over ATM using Sparse Mode PIM",
      "zh-CHS": "2337 Farinaci Apr 1998 ATM路由器间采用稀疏模式PIM的LIS内IP多播"
    },
    {
      "indent": 0,
      "text": "This document describes how intra-LIS IP multicast can be efficiently supported among routers over ATM without using the Multicast Address Resolution Server (MARS). This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested.",
      "zh-CHS": "本文档描述了如何在不使用多播地址解析服务器（MARS）的情况下，通过ATM在路由器之间有效地支持LIS内部IP多播。这份备忘录为互联网社区定义了一个实验性协议。它没有规定任何类型的互联网标准。要求进行讨论并提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2336 Luciani Jul 1998 Classical IP and ARP over ATM to NHRP Transition",
      "zh-CHS": "2336 Luciani Jul 1998 ATM上的经典IP和ARP到NHRP转换"
    },
    {
      "indent": 0,
      "text": "This document describes methods and procedures for the graceful transition from an ATMARP LIS to an NHRP LIS network model over ATM. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文件描述了在ATM上从ATMARP LIS到NHRP LIS网络模型的优雅过渡的方法和过程。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2335 Luciani Apr 1998 A Distributed NHRP Service Using SCSP",
      "zh-CHS": "2335 Luciani 1998年4月使用SCSP的分布式NHRP服务"
    },
    {
      "indent": 0,
      "text": "This document describes a method for distributing an NHRP service within a LIS. [STANDARDS-TRACK]",
      "zh-CHS": "本文档描述了在LIS中分发NHRP服务的方法。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2334 Luciani Apr 1998 Server Cache Synchronization Protocol (SCSP)",
      "zh-CHS": "2334 Luciani Apr 1998服务器缓存同步协议（SCSP）"
    },
    {
      "indent": 0,
      "text": "This document describes the Server Cache Synchronization Protocol (SCSP) and is written in terms of SCSP's use within Non Broadcast Multiple Access (NBMA) networks; although, a somewhat straight forward usage is applicable to BMA networks. [STANDARDS-TRACK]",
      "zh-CHS": "本文档描述了服务器缓存同步协议（SCSP），并根据SCSP在非广播多址（NBMA）网络中的使用编写；尽管如此，有点直截了当的用法适用于BMA网络。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2333 Cansever Apr 1998 NHRP Protocol Applicability Statement",
      "zh-CHS": "2333 Cansever 1998年4月NHRP协议适用性声明"
    },
    {
      "indent": 0,
      "text": "As required by the Routing Protocol Criteria [RFC 1264], this memo discusses the applicability of the Next Hop Resolution Protocol (NHRP) in routing of IP datagrams over Non-Broadcast Multiple Access (NBMA) networks, such as ATM, SMDS and X.25. [STANDARDS-TRACK]",
      "zh-CHS": "根据路由协议标准[RFC 1264]的要求，本备忘录讨论了下一跳解析协议（NHRP）在非广播多址（NBMA）网络（如ATM、SMDS和X.25）上路由IP数据报时的适用性。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2332 Luciani Apr 1998 NBMA Next Hop Resolution Protocol (NHRP)",
      "zh-CHS": "2332 Luciani 1998年4月NBMA下一跳解析协议（NHRP）"
    },
    {
      "indent": 0,
      "text": "This document describes the NBMA Next Hop Resolution Protocol (NHRP). NHRP can be used by a source station (host or router) connected to a Non-Broadcast, Multi-Access (NBMA) subnetwork to determine the internetworking layer address and NBMA subnetwork addresses of the \"NBMA next hop\" towards a destination station. [STANDARDS-TRACK]",
      "zh-CHS": "本文件描述了NBMA下一跳解析协议（NHRP）。NHRP可由连接到非广播多址（NBMA）子网的源站（主机或路由器）使用，以确定朝向目的站的“NBMA下一跳”的网际层地址和NBMA子网地址。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2331 Maher Apr 1998 ATM Signalling Support for IP over ATM - UNI Signalling 4.0 Update",
      "zh-CHS": "2331 Maher 1998年4月ATM信令支持IP over ATM-UNI信令4.0更新"
    },
    {
      "indent": 0,
      "text": "This memo describes how to efficiently use the ATM call control signalling procedures defined in UNI Signalling 4.0 to support IP over ATM environments as described in RFC 2225 and in RFC 2332. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录描述了如何有效地使用UNI信令4.0中定义的ATM呼叫控制信令程序，以支持RFC 2225和RFC 2332中所述的IP over ATM环境。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2330 Paxson May 1998 Framework for IP Performance Metrics",
      "zh-CHS": "2330 Paxson 1998年5月IP性能度量框架"
    },
    {
      "indent": 0,
      "text": "The purpose of this memo is to define a general framework for particular metrics to be developed by the IETF's IP Performance Metrics effort. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本备忘录的目的是为IETF的IP性能度量工作制定的特定度量定义一个通用框架。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2329 Moy Apr 1998 OSPF Standardization Report",
      "zh-CHS": "2329 Moy 1998年4月OSPF标准化报告"
    },
    {
      "indent": 0,
      "text": "This memo documents how the requirements for advancing a routing protocol to Full Standard have been met for OSPFv2. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本备忘录记录了OSPFv2如何满足将路由协议提升至完全标准的要求。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2328 Moy Apr 1998 OSPF Version 2",
      "zh-CHS": "2328 Moy 1998年4月OSPF版本2"
    },
    {
      "indent": 0,
      "text": "This memo documents version 2 of the OSPF protocol. OSPF is a link-state routing protocol. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录记录了OSPF协议的第2版。OSPF是一种链路状态路由协议。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2327 Handley Apr 1998 SDP: Session Description Protocol",
      "zh-CHS": "2327 Handley Apr 1998 SDP：会话描述协议"
    },
    {
      "indent": 0,
      "text": "This document defines the Session Description Protocol, SDP. SDP is intended for describing multimedia sessions for the purposes of session announcement, session invitation, and other forms of multimedia session initiation. [STANDARDS-TRACK]",
      "zh-CHS": "本文档定义了会话描述协议SDP。SDP用于描述多媒体会话，用于会话公告、会话邀请和其他形式的多媒体会话启动。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2326 Schulzrinne Apr 1998 Real Time Streaming Protocol (RTSP)",
      "zh-CHS": "2326 Schulzrinne 1998年4月实时流协议（RTSP）"
    },
    {
      "indent": 0,
      "text": "The Real Time Streaming Protocol, or RTSP, is an application-level protocol for control over the delivery of data with real-time properties. RTSP provides an extensible framework to enable controlled, on-demand delivery of real-time data, such as audio and video. [STANDARDS-TRACK]",
      "zh-CHS": "实时流协议（RTSP）是一种应用程序级协议，用于控制具有实时属性的数据传输。RTSP提供了一个可扩展的框架，以支持实时数据（如音频和视频）的受控按需交付。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2325 Slavitch 1 Apr 1998 Definitions of Managed Objects for Drip-Type Heated Beverage Hardware Devices using SMIv2",
      "zh-CHS": "2325 Slavitch 1 1998年4月1日使用SMIv2的滴水式加热饮料硬件设备的管理对象定义"
    },
    {
      "indent": 0,
      "text": "This memo defines an extension to the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it defines objects for the management of coffee-brewing and maintenance devices. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的扩展，用于Internet社区中的网络管理协议。特别是，它定义了咖啡酿造和维护设备的管理对象。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2324 Masinter 1 Apr 1998 Hyper Text Coffee Pot Control Protocol (HTCPCP/1.0)",
      "zh-CHS": "2324 Masinter 1998年4月1日超文本咖啡壶控制协议（HTCPCP/1.0）"
    },
    {
      "indent": 0,
      "text": "This document describes HTCPCP, a protocol for controlling, monitoring, and diagnosing coffee pots. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了HTCPCP，一种用于控制、监控和诊断咖啡壶的协议。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2323 Ramos 1 Apr 1998 IETF Identification and Security Guidelines",
      "zh-CHS": "2323 Ramos 1998年4月1日IETF识别和安全指南"
    },
    {
      "indent": 0,
      "text": "This RFC is meant to represent a guideline by which the IETF conferences may run more effeciently with regards to identification and security protocols, with specific attention paid to a particular sub-group within the IETF: \"facial hairius extremis\". This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本RFC旨在代表IETF会议在识别和安全协议方面更有效运行的指南，特别关注IETF中的特定子组：“面部毛发极值”。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2322 van den Hout 1 Apr 1998 Management of IP numbers by peg-dhcp",
      "zh-CHS": "2322 van den Hout 1998年4月1日通过dhcp管理IP号码"
    },
    {
      "indent": 0,
      "text": "This RFC describes a protocol to dynamically hand out ip-numbers on field networks and small events that don't necessarily have a clear organisational body. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本RFC描述了一种协议，用于在现场网络和不一定有明确组织机构的小型活动上动态分发ip号码。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2321 Bressen 1 Apr 1998 RITA -- The Reliable Internetwork Troubleshooting Agent",
      "zh-CHS": "2321 Bressen 1998年4月1日RITA——可靠的网络故障排除代理"
    },
    {
      "indent": 0,
      "text": "A Description of the usage of Nondeterministic Troubleshooting and Diagnostic Methodologies as applied to today's complex nondeterministic networks and environments. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "描述应用于当今复杂的非确定性网络和环境的非确定性故障排除和诊断方法的使用。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2320 Greene Apr 1998 Definitions of Managed Objects for Classical IP and ARP Over ATM Using SMIv2",
      "zh-CHS": "2320 Greene 1998年4月使用SMIv2为ATM上的传统IP和ARP定义托管对象"
    },
    {
      "indent": 0,
      "text": "The purpose of this memo is to define the Management Information Base (MIB) for supporting Classical IP and ARP over ATM as specified in Classical IP and ARP over ATM. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录旨在定义管理信息库（MIB），以支持经典IP和ARP over ATM中规定的经典IP和ARP over ATM。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2319 KOI8-U WG Apr 1998 Ukrainian Character Set KOI8-U",
      "zh-CHS": "2319 KOI8-U WG 1998年4月乌克兰字符集KOI8-U"
    },
    {
      "indent": 0,
      "text": "This document provides information about character encoding KOI8-U (KOI8 Ukrainian) wich is a de-facto standard in Ukrainian Internet community. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档提供了有关字符编码KOI8-U（KOI8乌克兰语）的信息，KOI8-U是乌克兰互联网社区事实上的标准。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2318 Lie Mar 1998 The text/css Media Type",
      "zh-CHS": "2318 Lie 1998年3月文本/css媒体类型"
    },
    {
      "indent": 0,
      "text": "This memo provides information about the text/css Media Type. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "此备忘录提供有关文本/css媒体类型的信息。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2317 Eidnes Mar 1998 Classless IN-ADDR.ARPA delegation",
      "zh-CHS": "2317 Eidnes 1998年3月无类别地址ARPA代表团"
    },
    {
      "indent": 0,
      "text": "This document describes a way to do IN-ADDR.ARPA delegation on non-octet boundaries for address spaces covering fewer than 256 addresses. This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "zh-CHS": "本文档描述了一种在非八位字节边界上对覆盖少于256个地址的地址空间执行IN-ADDR.ARPA委托的方法。本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2316 Bellovin Apr 1998 Report of the IAB Security Architecture Workshop",
      "zh-CHS": "2316 Bellovin 1998年4月IAB安全架构研讨会报告"
    },
    {
      "indent": 0,
      "text": "On 3-5 March 1997, the IAB held a security architecture workshop at Bell Labs in Murray Hill, NJ. We identified the core security components of the architecture, and specified several documents that need to be written. Most importantly, we agreed that security was not optional, and that it needed to be designed in from the beginning. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "1997年3月3日至5日，IAB在新泽西州默里山的贝尔实验室举办了一次安全架构研讨会。我们确定了体系结构的核心安全组件，并指定了几个需要编写的文档。最重要的是，我们同意安全性不是可选的，它需要从一开始就设计好。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2315 Kaliski Mar 1998 PKCS #7: Cryptographic Message Syntax Version 1.5",
      "zh-CHS": "2315 Kaliski 1998年3月PKCS#7：加密消息语法版本1.5"
    },
    {
      "indent": 0,
      "text": "This document describes a general syntax for data that may have cryptography applied to it, such as digital signatures and digital envelopes. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了可能应用了加密技术的数据的通用语法，如数字签名和数字信封。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2314 Kaliski Mar 1998 PKCS #10: Certification Request Syntax Version 1.5",
      "zh-CHS": "2314 Kaliski 1998年3月PKCS#10：认证请求语法版本1.5"
    },
    {
      "indent": 0,
      "text": "This document describes a syntax for certification requests. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了认证请求的语法。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2313 Kaliski Mar 1998 PKCS #1: RSA Encryption Version 1.5",
      "zh-CHS": "2313 Kaliski 1998年3月PKCS#1:RSA加密版本1.5"
    },
    {
      "indent": 0,
      "text": "This document describes a method for encrypting data using the RSA public-key cryptosystem. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了使用RSA公钥密码系统加密数据的方法。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2312 Dusse Mar 1998 S/MIME Version 2 Certificate Handling",
      "zh-CHS": "2312 Dusse 1998年3月S/MIME版本2证书处理"
    },
    {
      "indent": 0,
      "text": "This memo describes the mechanisms S/MIME uses to create and validate keys using certificates. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本备忘录描述了S/MIME使用证书创建和验证密钥的机制。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2311 Dusse Mar 1998 S/MIME Version 2 Message Specification",
      "zh-CHS": "2311 Dusse 1998年3月S/MIME版本2消息规范"
    },
    {
      "indent": 0,
      "text": "This document describes a protocol for adding cryptographic signature and encryption services to MIME data. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档描述了向MIME数据添加加密签名和加密服务的协议。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2310 Holtman Apr 1998 The Safe Response Header Field",
      "zh-CHS": "2310 Holtman 1998年4月安全响应标题字段"
    },
    {
      "indent": 0,
      "text": "This document defines a HTTP response header field called Safe, which can be used to indicate that repeating a HTTP request is safe. This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested.",
      "zh-CHS": "本文档定义了一个名为Safe的HTTP响应头字段，可用于指示重复HTTP请求是安全的。这份备忘录为互联网社区定义了一个实验性协议。它没有规定任何类型的互联网标准。要求进行讨论并提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2309 Braden Apr 1998 Recommendations on Queue Management and Congestion Avoidance in the Internet",
      "zh-CHS": "2309 Braden 1998年4月关于互联网队列管理和拥塞避免的建议"
    },
    {
      "indent": 0,
      "text": "This memo presents two recommendations to the Internet community concerning measures to improve and preserve Internet performance. It presents a strong recommendation for testing, standardization, and widespread deployment of active queue management in routers, to improve the performance of today's Internet. It also urges a concerted effort of research, measurement, and ultimate deployment of router mechanisms to protect the Internet from flows that are not sufficiently responsive to congestion notification. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本备忘录向互联网社区提出了两项建议，涉及改善和保持互联网性能的措施。它强烈建议在路由器中测试、标准化和广泛部署主动队列管理，以提高当今互联网的性能。它还敦促各方共同努力，研究、测量和最终部署路由器机制，以保护互联网免受对拥塞通知响应不足的流量的影响。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2308 Andrews Mar 1998 Negative Caching of DNS Queries (DNS NCACHE)",
      "zh-CHS": "2308 Andrews 1998年3月DNS查询的反向缓存（DNS NCACHE）"
    },
    {
      "indent": 0,
      "text": "RFC1034 provided a description of how to cache negative responses. It however had a fundamental flaw in that it did not allow a name server to hand out those cached responses to other resolvers, thereby greatly reducing the effect of the caching. This document addresses issues raise in the light of experience and replaces RFC1034 Section 4.3.4. [STANDARDS-TRACK]",
      "zh-CHS": "RFC1034提供了如何缓存否定响应的说明。但是，它有一个基本缺陷，即它不允许名称服务器将那些缓存的响应分发给其他解析程序，从而大大降低了缓存的效果。本文件解决了根据经验提出的问题，并取代RFC1034第4.3.4节。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2307 Howard Mar 1998 An Approach for Using LDAP as a Network Information Service",
      "zh-CHS": "2307 Howard Mar 1998将LDAP用作网络信息服务的方法"
    },
    {
      "indent": 0,
      "text": "This document describes an experimental mechanism for mapping entities related to TCP/IP and the UNIX system into X.500 entries so that they may be resolved with the Lightweight Directory Access Protocol [RFC2251]. This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested.",
      "zh-CHS": "本文档描述了一种实验性机制，用于将与TCP/IP和UNIX系统相关的实体映射到X.500条目中，以便使用轻量级目录访问协议[RFC2251]对其进行解析。这份备忘录为互联网社区定义了一个实验性协议。它没有规定任何类型的互联网标准。要求进行讨论并提出改进建议。"
    },
    {
      "indent": 0,
      "text": "2306 Parsons Mar 1998 Tag Image File Format (TIFF) - F Profile for Facsimile",
      "zh-CHS": "2306帕森斯1998年3月标签图像文件格式（TIFF）-F传真配置文件"
    },
    {
      "indent": 0,
      "text": "This document describes in detail the definition of TIFF-F that is used to store facsimile images. This memo provides information for the Internet community. It does not specify an Internet standard of any kind.",
      "zh-CHS": "本文档详细描述了用于存储传真图像的TIFF-F的定义。本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。"
    },
    {
      "indent": 0,
      "text": "2305 Toyoda Mar 1998 A Simple Mode of Facsimile Using Internet Mail",
      "zh-CHS": "2305丰田章男1998年3月使用互联网邮件的简单传真模式"
    },
    {
      "indent": 0,
      "text": "This specification provides for \"simple mode\" carriage of facsimile data over the Internet. [STANDARDS-TRACK]",
      "zh-CHS": "本规范规定了互联网上传真数据的“简单模式”传输。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2304 Allocchio Mar 1998 Minimal FAX address format in Internet Mail",
      "zh-CHS": "2304 Allocchio 1998年3月Internet邮件中的最小传真地址格式"
    },
    {
      "indent": 0,
      "text": "This memo describes the MINIMAL addressing method and standard extensions to encode FAX addresses in e-mail addresses. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录描述了在电子邮件地址中对传真地址进行编码的最小寻址方法和标准扩展。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2303 Allocchio Mar 1998 Minimal PSTN address format in Internet Mail",
      "zh-CHS": "2303 Allocchio 1998年3月Internet邮件中的最小PSTN地址格式"
    },
    {
      "indent": 0,
      "text": "This memo describes the MINIMAL addressing method to encode PSTN addresses into e-mail addresses and the standard extension mechanism to allow definition of further standard elements. [STANDARDS-TRACK]",
      "zh-CHS": "本备忘录描述了将PSTN地址编码为电子邮件地址的最小寻址方法，以及允许定义更多标准元素的标准扩展机制。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2302 Parsons Mar 1998 Tag Image File Format (TIFF) - image/tiff MIME Sub-type Registration",
      "zh-CHS": "2302 Parsons 1998年3月标签图像文件格式（TIFF）-图像/TIFF MIME子类型注册"
    },
    {
      "indent": 0,
      "text": "This document describes the registration of the MIME sub-type image/tiff. [STANDARDS-TRACK]",
      "zh-CHS": "本文档介绍MIME子类型image/tiff的注册。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2301 McIntyre Mar 1998 File Format for Internet Fax",
      "zh-CHS": "2301麦金太尔1998年3月互联网传真文件格式"
    },
    {
      "indent": 0,
      "text": "This document describes the TIFF (Tag Image File Format) representation of image data specified by the ITU-T Recommendations for black-and-white and color facsimile. [STANDARDS-TRACK]",
      "zh-CHS": "本文件描述了ITU-T黑白和彩色传真建议规定的图像数据TIFF（标签图像文件格式）表示。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "2300 IAB May 1998 INTERNET OFFICIAL PROTOCOL STANDARDS",
      "zh-CHS": "2300 IAB 1998年5月互联网官方协议标准"
    },
    {
      "indent": 0,
      "text": "A discussion of the standardization process and the RFC document series is presented first, followed by an explanation of the terms. Sections 6.2 - 6.10 contain the lists of protocols in each stage of standardization. Finally are pointers to references and contacts for further information. [STANDARDS-TRACK]",
      "zh-CHS": "首先对标准化过程和RFC文档系列进行讨论，然后对术语进行解释。第6.2-6.10节包含标准化每个阶段的协议列表。最后是指向参考资料和联系人的指针，以获取更多信息。[标准-轨道]"
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "zh-CHS": "安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no security issues in this Informational RFC.",
      "zh-CHS": "此信息RFC中没有安全问题。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Alegre Ramos University of Southern California Information Sciences Institute 4676 Admiralty Way Marina del Rey, CA 90292",
      "zh-CHS": "阿莱格雷莫斯南加州大学信息科学研究所4676海军路玛丽娜德雷，CA 90292"
    },
    {
      "indent": 3,
      "text": "Phone: (310) 822-1511 EMail: ramos@isi.edu",
      "zh-CHS": "电话：（310）822-1511电子邮件：ramos@isi.edu"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    }
  ]
}