{
  "title": {
    "text": "RFC 2610:  DHCP Options for Service Location Protocol ",
    "zh-CHS": "RFC 2610"
  },
  "number": 2610,
  "created_at": "2021-10-23 20:57:24.525935+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         C. Perkins\nRequest for Comments: 2610                                    E. Guttman\nCategory: Standards Track                               Sun Microsystems\n                                                               June 1999",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "DHCP Options for Service Location Protocol",
      "zh-CHS": "服务位置协议的DHCP选项"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Dynamic Host Configuration Protocol provides a framework for passing configuration information to hosts on a TCP/IP network. Entities using the Service Location Protocol need to find out the address of Directory Agents in order to transact messages. Another option provides an assignment of scope for configuration of SLP User and Service Agents.",
      "zh-CHS": "动态主机配置协议提供了一个框架，用于将配置信息传递给TCP/IP网络上的主机。使用服务位置协议的实体需要找出目录代理的地址，以便处理消息。另一个选项提供了配置SLP用户和服务代理的范围分配。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The Dynamic Host Configuration Protocol [2] provides a framework for passing configuration information to hosts on a TCP/IP network. Entities using the Service Location Protocol, Version 2 [3] and Service Location Protocol, Version 1 [4] need to obtain the address of Directory Agents and Scope configuration. The Service Location Protocol (SLP) provides a default configuration for Scopes and Directory Agents may be discovered using multicast or broadcast. It is useful in a larger deployment to be able to configure SLP Agents using DHCP, so as to centralize the administration and to deploy SLP in networks where multicast routing is not available.",
      "zh-CHS": "动态主机配置协议[2]提供了一个框架，用于将配置信息传递给TCP/IP网络上的主机。使用服务位置协议版本2[3]和服务位置协议版本1[4]的实体需要获取目录代理的地址和范围配置。服务位置协议（SLP）为作用域提供了默认配置，可以使用多播或广播查找目录代理。在更大的部署中，能够使用DHCP配置SLP代理非常有用，以便集中管理并在无法使用多播路由的网络中部署SLP。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [1].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[1]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "zh-CHS": "2. 介绍"
    },
    {
      "indent": 3,
      "text": "The DHCP options described below are used to configure Agents using the Service Location Protocol, Version 2 [3] and Version 1 [4].",
      "zh-CHS": "下面描述的DHCP选项用于使用服务位置协议（版本2[3]和版本1[4]）配置代理。"
    },
    {
      "indent": 3,
      "text": "The SLP Directory Agent option is used to configure User Agents and Service Agents with the location of Directory Agents in the network.",
      "zh-CHS": "SLP目录代理选项用于根据目录代理在网络中的位置配置用户代理和服务代理。"
    },
    {
      "indent": 3,
      "text": "The SLP Scope Option takes precedence over both default and static scope configuration of SLP agents.",
      "zh-CHS": "SLP作用域选项优先于SLP代理的默认和静态作用域配置。"
    },
    {
      "indent": 0,
      "text": "3. SLP Directory Agent Option",
      "section_title": true,
      "zh-CHS": "3. SLP目录代理选项"
    },
    {
      "indent": 3,
      "text": "This option specifies the location of one or more SLP Directory Agents.",
      "zh-CHS": "此选项指定一个或多个SLP目录代理的位置。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Code = 78   |    Length     |   Mandatory   |      a1       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      a2       |       a3      |       a4      |      ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The SLP Directory Agent Option specifies a list of IP addresses for Directory Agents. Directory Agents MUST be listed in order of preference, if there is an order of preference.",
      "zh-CHS": "SLP目录代理选项指定目录代理的IP地址列表。如果有优先顺序，目录代理必须按优先顺序列出。"
    },
    {
      "indent": 3,
      "text": "The Length value must include one for the 'Mandatory' byte and include four for each Directory Agent address which follows. Thus, the Length minus one of the option MUST always be divisible by 4 and has a minimum value of 5.",
      "zh-CHS": "长度值必须包括一个用于“必填”字节的值，以及四个用于后面的每个目录代理地址的值。因此，选项的长度减1必须始终可被4整除，且最小值为5。"
    },
    {
      "indent": 3,
      "text": "The address of the Directory Agent is given in network byte order.",
      "zh-CHS": "目录代理的地址以网络字节顺序给出。"
    },
    {
      "indent": 3,
      "text": "The 'Mandatory' byte in the Directory Agent option may be set to either 0 or 1. If it is set to 1, the SLP User Agent or Service Agent so configured MUST NOT employ either active or passive multicast discovery of Directory Agents.",
      "zh-CHS": "目录代理选项中的“必需”字节可以设置为0或1。如果设置为1，则如此配置的SLP用户代理或服务代理不得采用目录代理的主动或被动多播发现。"
    },
    {
      "indent": 3,
      "text": "Note that for backward compatibility with some deployed software the Mandatory byte MUST NOT be set to any byte value for which the high order bit (0x80) is set.",
      "zh-CHS": "请注意，为了与某些已部署软件向后兼容，不得将强制字节设置为设置了高位（0x80）的任何字节值。"
    },
    {
      "indent": 3,
      "text": "The Directory Agents listed in this option MUST be configured with the a non-empty subset of the scope list that the Agent receiving the Directory Agent Option is configured with. See the notes below.",
      "zh-CHS": "此选项中列出的目录代理必须配置为接收目录代理选项的代理配置的作用域列表的非空子集。请参见下面的注释。"
    },
    {
      "indent": 3,
      "text": "The SLPv2 specification [3] defines how to use this option.",
      "zh-CHS": "SLPv2规范[3]定义了如何使用此选项。"
    },
    {
      "indent": 0,
      "text": "4. SLP Service Scope Option",
      "section_title": true,
      "zh-CHS": "4. SLP服务范围选项"
    },
    {
      "indent": 3,
      "text": "The scope list is a comma delimited list which indicates the scopes that a SLP Agent is configured to use.",
      "zh-CHS": "作用域列表是一个逗号分隔的列表，指示SLP代理配置为使用的作用域。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Code = 79   |     Length    |   Mandatory   | <Scope List>...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The Length indicates the number of bytes which follow. Since the Scope-List String is encoded using UTF-8 [5] characters, it may be the cast that the Length is not the same as the number of characters in the Scope-List String. The Length value must include one for the 'Mandatory' byte.",
      "zh-CHS": "长度表示后面的字节数。由于作用域列表字符串是使用UTF-8[5]字符编码的，因此可能是转换长度与作用域列表字符串中的字符数不同。长度值必须包含一个“必填”字节。"
    },
    {
      "indent": 3,
      "text": "The 'Mandatory' byte determines whether SLP Agents override their static configuration for scopes with the <Scope List> string provided by the option. This allows DHCP administrators to implement a policy of assigning a set of scopes to Agents for service provision. If the Mandatory byte is 0, static configuration takes precedence over the DHCP provided scope list. If the Mandatory byte is 1, the <Scope List> provided in this option MUST be used by the SLP Agent.",
      "zh-CHS": "“必填”字节确定SLP代理是否使用选项提供的<Scope List>字符串覆盖其作用域的静态配置。这允许DHCP管理员实现一种策略，将一组作用域分配给代理以提供服务。如果强制字节为0，则静态配置优先于DHCP提供的作用域列表。如果强制字节为1，则SLP代理必须使用此选项中提供的<Scope List>。"
    },
    {
      "indent": 3,
      "text": "The Scope List String syntax and usage are defined in the SLPv2 specification [3].",
      "zh-CHS": "范围列表字符串语法和用法在SLPv2规范[3]中定义。"
    },
    {
      "indent": 0,
      "text": "4.1. Zero Length Scope-List String Configuration",
      "section_title": true,
      "zh-CHS": "4.1. 零长度作用域列表字符串配置"
    },
    {
      "indent": 3,
      "text": "A SLP Service Scope Option which indicates a Length of 1 (in other words, omitting the <Scope List> string entirely) validly configures the SLP User Agent to use \"User Selectable Scopes.\"",
      "zh-CHS": "指示长度为1的SLP服务范围选项（换句话说，完全省略<Scope List>字符串）有效地将SLP用户代理配置为使用“用户可选择范围”"
    },
    {
      "indent": 3,
      "text": "The SLP Agent will use the aggregated list of scopes of all known DAs. If no DAs are known, the UA will use SA discovery to determine the list of scopes on the network, as defined in [3].",
      "zh-CHS": "SLP代理将使用所有已知DAs作用域的聚合列表。如果不知道DAs，UA将使用SA发现来确定网络上的作用域列表，如[3]中所定义。"
    },
    {
      "indent": 3,
      "text": "Note that this configuration is tantamount to removing all centralized control of the scope configuration of hosts on the network. This makes it possible for every User Agent to see every service. This may not be desirable as users may not be able to or desire to decide which services are appropriate for them.",
      "zh-CHS": "请注意，此配置相当于删除对网络上主机的作用域配置的所有集中控制。这使得每个用户代理都可以看到每个服务。这可能是不可取的，因为用户可能无法或不希望决定哪些服务适合他们。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "If a malicious host is able to insert fraudulent information in DHCPOFFER packets sent to a prospective SLP Agent then the SLP Agent will be unable to obtain service, or may unwittingly be directed to use the incorrect services.",
      "zh-CHS": "如果恶意主机能够在发送给潜在SLP代理的DHCPOFFER数据包中插入欺诈信息，则SLP代理将无法获得服务，或者可能无意中被指示使用不正确的服务。"
    },
    {
      "indent": 3,
      "text": "Many opportunities for denial of service exist. A service agent could find that it might rely on fraudulent or otherwise malicious directory agents to advertise its services. DHCPOFFERs could prevent the regular SLP framework from functioning by directing clients to not use multicast, to use nonexistent directory agents and so on.",
      "zh-CHS": "存在许多拒绝服务的机会。服务代理可能会发现它可能依赖欺诈或恶意的目录代理来宣传其服务。DHCPOFFERs可以通过指示客户端不使用多播、使用不存在的目录代理等方式阻止常规SLP框架的运行。"
    },
    {
      "indent": 3,
      "text": "These difficulties are inherited from the much larger and more serious problem, viz. securing or authenticating any information whatsoever from a DHCP server (or client!) is not possible in common DHCP deployments.",
      "zh-CHS": "这些困难是从更大、更严重的问题继承而来的，即：。在普通DHCP部署中，不可能从DHCP服务器（或客户端！）保护或验证任何信息。"
    },
    {
      "indent": 0,
      "text": "References",
      "zh-CHS": "工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, March 1997.",
      "zh-CHS": "[2] Droms，R.，“动态主机配置协议”，RFC 2131，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[3] E. Guttman, C. Perkins, J. Veizades, and M. Day, \"Service Location Protocol version 2\", Work in Progress.",
      "zh-CHS": "[3] E.Guttman、C.Perkins、J.Veizades和M.Day，“服务位置协议版本2”，正在进行中。"
    },
    {
      "indent": 3,
      "text": "[4] Veizades, J., Guttman, E., Perkins, C. and S. Kaplan, \"Service Location Protocol\", RFC 2165, July 1997.",
      "zh-CHS": "[4] Veizades，J.，Guttman，E.，Perkins，C.和S.Kaplan，“服务位置协议”，RFC 21651997年7月。"
    },
    {
      "indent": 3,
      "text": "[5] Yergeau, F., \"UTF-8, a transformation format of unicode and ISO 10646\", RFC 2279, October 1998.",
      "zh-CHS": "[5] “UTF-8，unicode和ISO10646的转换格式”，RFC2279，1998年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Charles E. Perkins Technology Development Group Mail Stop MPK15-214 Sun Microsystems, Inc. 15 Network Circle Menlo Park, CA 94025",
      "zh-CHS": "Charles E.Perkins技术开发集团邮件站MPK15-214 Sun Microsystems，Inc.加利福尼亚州门罗公园网络圈15号，邮编94025"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650-786-6464\nFax:   +1 650-786-6445\nEMail: Charles.Perkins@Sun.Com\nWeb: http://www.svrloc.org/~charliep",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Erik Guttman Technology Development Group Mail Stop UFRA02 Sun Microsystems, Inc. Bahnstr. 2 74915 Waibstadt, Germany",
      "zh-CHS": "Erik Guttman技术开发组邮件站UFRA02 Sun Microsystems，Inc.Bahnstr。274915德国威伯斯塔特"
    },
    {
      "indent": 3,
      "text": "Phone: +49 7263 911 701\n  or:  +1 650 786 5992\nEMail: Erik.Guttman@Sun.Com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}