{
  "title": {
    "text": "RFC 2561:  Base Definitions of Managed Objects for TN3270E Using SMIv2 ",
    "zh-CHS": "RFC 2561"
  },
  "number": 2561,
  "created_at": "2021-10-23 16:29:54.634183+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           K. White\nRequest for Comments: 2561                                     IBM Corp.\nCategory: Standards Track                                       R. Moore\n                                                               IBM Corp.\n                                                              April 1999",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Base Definitions of Managed Objects for TN3270E Using SMIv2",
      "zh-CHS": "使用SMIv2的TN3270E托管对象的基本定义"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a Management Information Base (MIB) for configuring and managing TN3270E servers. TN3270E, defined by RFC 2355 [19], refers to the enhancements made to the Telnet 3270 (TN3270) terminal emulation practices. Refer to RFC 1041 [18], STD 8, RFC 854 [16], and STD 31, RFC 860 [17] for a sample of what is meant by TN3270 practices.",
      "zh-CHS": "本备忘录定义了用于配置和管理TN3270E服务器的管理信息库（MIB）。RFC 2355[19]定义的TN3270E是指对Telnet 3270（TN3270）终端仿真实践的增强。参考RFC 1041[18]、STD 8、RFC 854[16]和STD 31、RFC 860[17]了解TN3270实践的示例。"
    },
    {
      "indent": 3,
      "text": "The MIB defined by this memo provides generic support for both host and gateway TN3270E server implementations. A TN3270E server connects a Telnet client performing 3270 emulation to a target SNA host over both a client-side network (client to TN3270E server) and an SNA Network (TN3270E server to target SNA host). The client-side network is typically TCP/IP, but it need not be.",
      "zh-CHS": "此备忘录定义的MIB为主机和网关TN3270E服务器实现提供通用支持。TN3270E服务器通过客户端网络（客户端到TN3270E服务器）和SNA网络（TN3270E服务器到目标SNA主机），将执行3270仿真的Telnet客户端连接到目标SNA主机。客户端网络通常是TCP/IP，但不需要。"
    },
    {
      "indent": 3,
      "text": "A host TN3270E server refers to an implementation where the TN3270E server is collocated with the Systems Network Architecture (SNA) System Services Control Point (SSCP) for the dependent Secondary Logical Units (SLUs) that the server makes available to its clients for connecting into a SNA network. A gateway TN3270E server resides on an SNA node other than an SSCP, either an SNA type 2.0 node, a boundary-function-attached type 2.1 node, or an APPN node acting in the role of a Dependent LU Requester (DLUR). Host and gateway TN3270E server implementations typically differ greatly as to their internal implementation and system definition (SYSDEF) methods.",
      "zh-CHS": "主机TN3270E服务器指的是一种实现，其中TN3270E服务器与系统网络体系结构（SNA）系统服务控制点（SSCP）并置，用于服务器向其客户端提供用于连接到SNA网络的从属辅助逻辑单元（SLU）。网关TN3270E服务器位于除SSCP以外的SNA节点上，SNA类型2.0节点、边界功能附加类型2.1节点或充当从属LU请求者（DLUR）角色的APPN节点。主机和网关TN3270E服务器实现通常在其内部实现和系统定义（SYSDEF）方法上有很大差异。"
    },
    {
      "indent": 3,
      "text": "It is the intent that the MIB defined herein be extended by subsequent memos. For example, one such extension enables collection of TN3270E response time data.",
      "zh-CHS": "其目的是通过后续备忘录扩展本文定义的MIB。例如，一个这样的扩展支持收集TN3270E响应时间数据。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.0  Introduction  . . . . . . . . . . . . . . . . . . . . . . .   2\n2.0  The SNMP Network Management Framework   . . . . . . . . . .   3\n3.0  Structure of the MIB  . . . . . . . . . . . . . . . . . . .   4\n3.1  TN3270E Server Control  . . . . . . . . . . . . . . . . . .   5\n  3.1.1  tn3270eSrvrConfTable  . . . . . . . . . . . . . . . . .   5\n  3.1.2  tn3270eSrvrPortTable  . . . . . . . . . . . . . . . . .   6\n  3.1.3  tn3270eSrvrStatsTable   . . . . . . . . . . . . . . . .   7\n3.2  TN3270E Server Resource Configuration   . . . . . . . . . .   7\n3.3  Resource Name / Client Address Mappings   . . . . . . . . .   8\n  3.3.1  tn3270eSnaMapTable  . . . . . . . . . . . . . . . . . .   8\n  3.3.2  tn3270eResMapTable  . . . . . . . . . . . . . . . . . .   9\n  3.3.3  tn3270eTcpConnTable   . . . . . . . . . . . . . . . . .   9\n3.4  Advisory Spin Lock Usage  . . . . . . . . . . . . . . . . .   9\n3.5  Row Persistence   . . . . . . . . . . . . . . . . . . . . .  10\n3.6  IANA Considerations   . . . . . . . . . . . . . . . . . . .  10\n4.0  Definitions   . . . . . . . . . . . . . . . . . . . . . . .  11\n5.0  Security Considerations   . . . . . . . . . . . . . . . . .  51\n6.0  Intellectual Property   . . . . . . . . . . . . . . . . . .  52\n7.0  Acknowledgments   . . . . . . . . . . . . . . . . . . . . .  53\n8.0  References  . . . . . . . . . . . . . . . . . . . . . . . .  53\n9.0  Authors' Addresses  . . . . . . . . . . . . . . . . . . . .  55\nFull Copyright Statement   . . . . . . . . . . . . . . . . . . .  56",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1.0 Introduction",
      "section_title": true,
      "zh-CHS": "1.0 介绍"
    },
    {
      "indent": 3,
      "text": "This document is a product of the TN3270E Working Group. Its purpose is to define a MIB module for support by a TCP/IP implementation for configuration and management of TN3270E servers.",
      "zh-CHS": "本文件是TN3270E工作组的产品。其目的是定义一个MIB模块，以便TCP/IP实现支持TN3270E服务器的配置和管理。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119, reference [22].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不得”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119，参考文献[22]中的描述进行解释。"
    },
    {
      "indent": 0,
      "text": "2.0 The SNMP Network Management Framework",
      "section_title": true,
      "zh-CHS": "2.0 SNMP网络管理框架"
    },
    {
      "indent": 3,
      "text": "The SNMP Management Framework presently consists of five major components:",
      "zh-CHS": "SNMP管理框架目前由五个主要组件组成："
    },
    {
      "indent": 3,
      "text": "o An overall architecture, described in RFC 2271 [1].",
      "zh-CHS": "o RFC 2271[1]中描述的总体架构。"
    },
    {
      "indent": 3,
      "text": "o Mechanisms for describing and naming objects and events for the purpose of management. The first version of this Structure of Management Information (SMI) is called SMIv1 and described in STD 16, RFC 1155 [2], STD 16, RFC 1212 [3] and RFC 1215 [4]. The second version, called SMIv2, is described in RFC 1902 [5], RFC 1903 [6] and RFC 1904 [7].",
      "zh-CHS": "o 为管理目的描述和命名对象和事件的机制。这种管理信息结构（SMI）的第一个版本称为SMIv1，并在STD 16、RFC 1155[2]、STD 16、RFC 1212[3]和RFC 1215[4]中进行了描述。第二个版本称为SMIv2，在RFC 1902[5]、RFC 1903[6]和RFC 1904[7]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Message protocols for transferring management information. The first version of the SNMP message protocol is called SNMPv1 and described in STD 15, RFC 1157 [8]. A second version of the SNMP message protocol, which is not an Internet standards track protocol, is called SNMPv2c and described in RFC 1901 [9] and RFC 1906 [10]. The third version of the message protocol is called SNMPv3 and described in RFC 1906 [10], RFC 2272 [11] and RFC 2274 [12].",
      "zh-CHS": "o 用于传输管理信息的消息协议。SNMP消息协议的第一个版本称为SNMPv1，在STD 15、RFC 1157[8]中进行了描述。SNMP消息协议的第二个版本不是互联网标准跟踪协议，称为SNMPv2c，在RFC 1901[9]和RFC 1906[10]中进行了描述。消息协议的第三个版本称为SNMPv3，在RFC 1906[10]、RFC 2272[11]和RFC 2274[12]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "o Protocol operations for accessing management information. The first set of protocol operations and associated PDU formats is described in STD 15, RFC 1157 [8]. A second set of protocol operations and associated PDU formats is described in RFC 1905 [13].",
      "zh-CHS": "o 访问管理信息的协议操作。STD 15、RFC 1157[8]中描述了第一组协议操作和相关PDU格式。RFC 1905[13]中描述了第二组协议操作和相关PDU格式。"
    },
    {
      "indent": 3,
      "text": "o A set of fundamental applications described in RFC 2273 [14] and the view-based access control mechanism described in RFC 2275 [15].",
      "zh-CHS": "o RFC 2273[14]中描述的一组基本应用程序和RFC 2275[15]中描述的基于视图的访问控制机制。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. Objects in the MIB are defined using the mechanisms defined in the SMI.",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB中的对象是使用SMI中定义的机制定义的。"
    },
    {
      "indent": 3,
      "text": "This memo specifies a MIB module that is compliant to the SMIv2. A MIB conforming to the SMIv1 can be produced through the appropriate translations. The resulting translated MIB must be semantically equivalent, except where objects or events are omitted because no translation is possible (use of Counter64). Some machine readable information in SMIv2 will be converted into textual descriptions in SMIv1 during the translation process. However, this loss of machine readable information is not considered to change the semantics of the MIB.",
      "zh-CHS": "此备忘录指定了符合SMIv2的MIB模块。通过适当的翻译，可以生成符合SMIv1的MIB。生成的已翻译MIB必须在语义上等效，除非由于无法翻译而省略了对象或事件（使用计数器64）。在翻译过程中，SMIv2中的一些机器可读信息将转换为SMIv1中的文本描述。但是，这种机器可读信息的丢失不被认为会改变MIB的语义。"
    },
    {
      "indent": 0,
      "text": "3.0 Structure of the MIB",
      "section_title": true,
      "zh-CHS": "3.0 MIB的结构"
    },
    {
      "indent": 3,
      "text": "The TN3270E-MIB is split into the following components:",
      "zh-CHS": "TN3270E-MIB分为以下组件："
    },
    {
      "indent": 3,
      "text": "o TN3270E Server Control o TN3270E Server Resource Configuration o Resource/Client Address Mappings",
      "zh-CHS": "o TN3270E服务器控制o TN3270E服务器资源配置o资源/客户端地址映射"
    },
    {
      "indent": 3,
      "text": "There are three additional sections to address:",
      "zh-CHS": "有三个附加部分需要解决："
    },
    {
      "indent": 3,
      "text": "o Advisory Spin Lock Usage o Row Persistence o IANA Considerations",
      "zh-CHS": "o 建议自旋锁使用o行持久性o IANA注意事项"
    },
    {
      "indent": 3,
      "text": "The TN3270E-MIB is defined primarily for TN3270E servers. This memo does not explicitly address use of the MIB by TN3270 servers that do not support the TN3270E protocol. Even though a significant number of the objects in the MIB do apply in the TN3270-only case, the case was not addressed, since it is unlikely that a TN3270-only server would implement this MIB.",
      "zh-CHS": "TN3270E-MIB主要为TN3270E服务器定义。本备忘录未明确说明不支持TN3270E协议的TN3270服务器对MIB的使用。尽管MIB中的大量对象确实适用于仅TN3270的情况，但该情况并未得到解决，因为仅TN3270的服务器不太可能实现此MIB。"
    },
    {
      "indent": 3,
      "text": "The SYSAPPL-MIB, reference [24], contains the Utf8String textual convention (TC) that the TN3270E-MIB imports. This TC, which is used for some MIB objects containing textual information, enables internationalization of text strings, whereas the DisplayString TC does not. The SNMP-FRAMEWORK-MIB, reference [1], contains the SnmpAdminString TC that the TN3270E-MIB also imports. Like the Utf8String TC, this TC also enables internationalization of text strings; in addition, it provides some guidelines on the length and content of the strings.",
      "zh-CHS": "SYSAPPL-MIB（参考文献[24]）包含TN3270E-MIB导入的Utf8String文本约定（TC）。此TC用于包含文本信息的某些MIB对象，支持文本字符串的国际化，而DisplayString TC则不支持。SNMP-FRAMEWORK-MIB（参考文献[1]）包含TN3270E-MIB也导入的SNMPAdministring TC。与Utf8String TC一样，该TC还支持文本字符串的国际化；此外，它还提供了有关字符串长度和内容的一些指导原则。"
    },
    {
      "indent": 3,
      "text": "It is important to note that implementation of the SYSAPPL-MIB is not actually a prerequisite for implementing the TN3270E-MIB. On the other hand, implementation of the TN3270E-MIB does not preclude implementing the SYSAPPL-MIB as well. When both MIBs are implemented, the primary index into most of the TN3270E-MIB tables, tn3270eSrvrConfIndex, SHOULD equal one of the SYSAPPL-MIB's sysApplElmtRunIndex values. In this case the entry in the sysApplElmtRunTable provides additional information on a TN3270E server.",
      "zh-CHS": "需要注意的是，SYSAPPL-MIB的实现实际上并不是实现TN3270E-MIB的先决条件。另一方面，TN3270E-MIB的实现也不排除SYSAPPL-MIB的实现。当两个MIB都实现时，大多数TN3270E-MIB表的主索引TN3270ESRVRECONDEX应等于SYSAPPL-MIB的sysApplElmtRunIndex值之一。在这种情况下，sysapplelmtrantable中的条目提供了关于TN3270E服务器的附加信息。"
    },
    {
      "indent": 3,
      "text": "The MIB defined by this memo supports use of both IPv4 and IPv6 addressing. Two textual conventions, IANATn3270eAddrType and Tn3270eAddress, are defined for this purpose. IANATn3270eAddress is essentially equivalent to the TAddress TC, defined by RFC 1903. The difference between the two is that IANATn3270eAddress allows a zero-length octet string, while TAddress doesn't. It is important that IANATn3270eAddress allow for the absence of an address, because some",
      "zh-CHS": "此备忘录定义的MIB支持使用IPv4和IPv6寻址。为此，定义了两种文本约定：IANATn3270eAddrType和TN3270EADDRENT。IANATN3270EADRESS本质上等同于RFC1903定义的TADRESS TC。两者之间的区别在于IANATn3270eAddress允许长度为零的八位字节字符串，而TAddress不允许。IANATn3270eAddress允许没有地址，这一点很重要，因为"
    },
    {
      "indent": 3,
      "text": "objects with this syntax are used as table indexes, and have special meanings when they contain zero-length strings.",
      "zh-CHS": "具有此语法的对象用作表索引，当它们包含长度为零的字符串时具有特殊含义。"
    },
    {
      "indent": 3,
      "text": "The IANATn3270eAddrType textual convention is used rather than the TDomain TC (defined by RFC 1903) for identifying the contents of a tn3270eTAddress object. TDomain uses an OID to characterize the contents of an associated TAddress object. IANATn3270eAddrType was chosen over TDomain because, with a SYNTAX of Unsigned32 (enumeration type), it is much simpler to use as a component in an instance identifier. It was placed in the IANA-administered module to allow for the addition of values to cover cases (such as proxy servers) not covered by the TN3270E-MIB itself.",
      "zh-CHS": "使用IANATn3270eAddrType文本约定而不是TDomain TC（由RFC 1903定义）来标识tn3270eTAddress对象的内容。TDomain使用OID来描述关联TadAddress对象的内容。之所以选择IANATn3270eAddrType而不是TDomain，是因为它的语法为Unsigned32（枚举类型），因此在实例标识符中用作组件要简单得多。它被放置在IANA管理模块中，以允许添加值以涵盖TN3270E-MIB本身未涵盖的情况（如代理服务器）。"
    },
    {
      "indent": 0,
      "text": "3.1 TN3270E Server Control",
      "section_title": true,
      "zh-CHS": "3.1 TN3270E服务器控制"
    },
    {
      "indent": 3,
      "text": "This group of objects provides for TN3270E server configuration and control. It consists of three tables:",
      "zh-CHS": "这组对象提供TN3270E服务器配置和控制。它由三个表组成："
    },
    {
      "indent": 3,
      "text": "o tn3270eSrvrConfTable o tn3270eSrvrPortTable o tn3270eSrvrStatsTable",
      "zh-CHS": "o TN3270ESRVR表格o TN3270ESRVR表格o TN3270ESRVR表格"
    },
    {
      "indent": 3,
      "text": "The tn3270eSrvrConfTable is the primary table within the entire TN3270E-MIB. As section 3.1.1 indicates, each TN3270E server is represented by an entry in this table, indexed by tn3270eSrvrConfIndex. Most of the other tables defined by the TN3270E-MIB have tn3270eSrvrConfIndex as their primary index. Entries in these tables MUST NOT exist for a TN3270E server when it does not have a tn3270eSrvrConfigEntry.",
      "zh-CHS": "tn3270eSrvrConfTable是整个TN3270E-MIB中的主表。如第3.1.1节所述，每个TN3270E服务器由该表中的一个条目表示，该条目由TN3270ESRVRECONDEX索引。TN3270E-MIB定义的大多数其他表都将TN3270ESRVRConIndex作为其主要索引。如果TN3270E服务器没有tn3270eSrvrConfigEntry，则这些表中的条目不得存在。"
    },
    {
      "indent": 0,
      "text": "3.1.1 tn3270eSrvrConfTable",
      "section_title": true,
      "zh-CHS": "3.1.1 TN3270ESRVRCONTABLE"
    },
    {
      "indent": 3,
      "text": "The tn3270eSrvrConfTable contains a set of objects primarily used for configuring and managing TN3270E servers. As with most of the other tables in the TN3270E-MIB, this table is indexed by an unsigned integer, tn3270eSrvrConfIndex. This primary index element enables support of multiple TN3270E servers by a single SNMP agent. Within the set of MIB objects returned by one SNMP agent, tn3270eSrvrConfIndex values MUST be unique, and need not be contiguous.",
      "zh-CHS": "tn3270eSrvrConfTable包含一组主要用于配置和管理TN3270E服务器的对象。与TN3270E-MIB中的大多数其他表一样，此表由无符号整数TN3270ESRVRCONDEX索引。此主索引元素允许单个SNMP代理支持多个TN3270E服务器。在一个SNMP代理返回的MIB对象集中，tn3270eSrvrConfIndex值必须是唯一的，并且不必是连续的。"
    },
    {
      "indent": 3,
      "text": "The tn3270eSrvrConfInactivityTimer object defines the inactivity period for user traffic on TN3270 and TN3270E sessions.",
      "zh-CHS": "tn3270esrvrconfictivitymer对象定义了TN3270和TN3270E会话上用户流量的非活动期。"
    },
    {
      "indent": 3,
      "text": "The four objects:",
      "zh-CHS": "这四个对象："
    },
    {
      "indent": 3,
      "text": "o tn3270eSrvrConfConnectivityChk o tn3270eSrvrConfTmNopInterval o tn3270eSrvrConfTmNopInactTime o tn3270eSrvrConfTmTimeout",
      "zh-CHS": "o TN3270ESRVReconfitConnectivityCHK o TN3270ESRVReconfitMNOPInterval o TN3270ESRVReconfitMNOPintime o TN3270ESRVReconfitTMTimeout"
    },
    {
      "indent": 3,
      "text": "define the parameters for performing the \"Telnet Timing Mark Option\" as defined by RFC 860 [17]. The object tn3270eSrvrConfConnectivityChk allows a Management Station to select either a NOP command or a TIMING-MARK command. Sending a NOP command results in less overhead then a TIMING-MARK command, since a client doesn't send a reply.",
      "zh-CHS": "定义用于执行RFC 860[17]定义的“Telnet定时标记选项”的参数。对象TN3270ESRVRConnectivitychk允许管理站选择NOP命令或定时标记命令。由于客户端不发送回复，因此发送NOP命令比发送TIMING-MARK命令的开销更小。"
    },
    {
      "indent": 3,
      "text": "The objects tn3270eSrvrConfAdminStatus and tn3270eSrvrConfOperStatus enable remote starting and stopping of a TN3270E server, and report the current state of the server. The object tn3270eSrvrConfFunctionsSupported indicates which of the TN3270 and TN3270E options a server supports. The object tn3270eSrvrConfSessionTermState defines as a TN3270E server-wide option what SHOULD occur when the SNA portion of a TN3270 or TN3270E session terminates with respect to the associated TCP connection. The object tn3270eSrvrConfSrvrType indicates whether the TN3270E server represented by a tn3270eSrvrConfEntry is a host or a gateway server. The object tn3270eSrvrConfContact provides a scratch pad area for a TN3270E server administrator to store information for later retrieval. The object tn3270eSrvrConfLastActTime reports the DateAndTime when the server was most recently activated. The special value of all '00'Hs indicates that the server has never been active.",
      "zh-CHS": "对象TN3270ESRVConfAdminStatus和TN3270ESRVConfOperstatus可远程启动和停止TN3270E服务器，并报告服务器的当前状态。对象tn3270esrvconffunctionssupport表示服务器支持的TN3270和TN3270E选项。对象tn3270eSrvrConfSessionTermState将当TN3270或TN3270E会话的SNA部分相对于关联的TCP连接终止时应发生的情况定义为TN3270E服务器范围的选项。对象tn3270eSrvrConfSrvrType指示由tn3270esrvrconentry表示的TN3270E服务器是主机还是网关服务器。对象TN3270ESRVReconfContact为TN3270E服务器管理员提供了一个便笺簿区域，用于存储信息以供以后检索。对象tn3270esrvrcollastacttime报告服务器最近激活的日期和时间。所有“00”的特殊值表示服务器从未处于活动状态。"
    },
    {
      "indent": 3,
      "text": "The object tn3270eSrvrConfRowStatus provides the capability to perform row creation and deletion operations on this table.",
      "zh-CHS": "对象TN3270ESRVRConRowstatus提供了在此表上执行行创建和删除操作的功能。"
    },
    {
      "indent": 0,
      "text": "3.1.2 tn3270eSrvrPortTable",
      "section_title": true,
      "zh-CHS": "3.1.2 tn3270eSrvrPortTable"
    },
    {
      "indent": 3,
      "text": "The tn3270eSrvrPortTable represents the local TCP ports associated with a TN3270E server. This information is important because some TN3270E server implementations support usage of multiple local ports. A tn3270eSrvrPortEntry is indexed by:",
      "zh-CHS": "tn3270eSrvrPortTable表示与TN3270E服务器关联的本地TCP端口。此信息非常重要，因为某些TN3270E服务器实现支持使用多个本地端口。TN3270ESRPortentry的索引为："
    },
    {
      "indent": 3,
      "text": "o tn3270eSrvrConfIndex o tn3270eSrvrConfPort o tn3270eSrvrConfPortAddrType o tn3270eSrvrConfPortAddress",
      "zh-CHS": "o TN3270ESRVReconIndex o TN3270ESRVReconPort o TN3270ESRVReconPortAddress类型o TN3270ESRVReconPortAddress"
    },
    {
      "indent": 3,
      "text": "Certain TN3270E server implementations restrict a local TCP port to a particular local IP address, instead of allowing connections for any local IP address to occur via the port. tn3270eSrvrConfPortAddrType",
      "zh-CHS": "某些TN3270E服务器实现将本地TCP端口限制为特定的本地IP地址，而不允许通过端口连接任何本地IP地址。TN3270ESRvrConfPortAddressType"
    },
    {
      "indent": 3,
      "text": "and tn3270eSrvrConfPortAddress allow this restriction to be represented in the MIB. A TN3270E server that doesn't restrict connections over a port to a local IP Address SHALL use the value unknown(0) for tn3270eSrvrConfPortAddrType, and a zero-length octet string for tn3270eSrvrConfPortAddress.",
      "zh-CHS": "和tn3270eSrvrConfPortAddress允许在MIB中表示此限制。不限制通过端口连接到本地IP地址的TN3270E服务器应使用TN3270ESRVRConfPortAddressType的值unknown（0），以及tn3270eSrvrConfPortAddress的长度为零的八位字节字符串。"
    },
    {
      "indent": 0,
      "text": "3.1.3 tn3270eSrvrStatsTable",
      "section_title": true,
      "zh-CHS": "3.1.3 tn3270eSrvrStatsTable"
    },
    {
      "indent": 3,
      "text": "The tn3270eSrvrStatsTable defines a series of objects that provide general usage statistics for a TN3270E server. An entry can represent the total activity for a server, or it can represent the activity occurring at the server on either a port or a port-and-local-address basis.",
      "zh-CHS": "tn3270eSrvrStatsTable定义了一系列对象，这些对象为TN3270E服务器提供一般使用统计信息。条目可以表示服务器的总活动，也可以表示服务器上发生的基于端口或端口和本地地址的活动。"
    },
    {
      "indent": 3,
      "text": "An implementation of this table MUST use only one of the three levels of refinement that the indexing of this table supports for the entries associated with a single TN3270E server.",
      "zh-CHS": "此表的实现必须仅使用此表的索引为与单个TN3270E服务器关联的条目支持的三个细化级别中的一个。"
    },
    {
      "indent": 3,
      "text": "The objects in this table reporting maximum, in-use, and spare LUs for terminals and printers presuppose an implementation where terminal resources and printer resources come from disjoint, dedicated pools. An implementation where resources for the two types of LUs come from a single shared pool should return the following values:",
      "zh-CHS": "此表中的对象报告终端和打印机的最大LU、正在使用LU和备用LU，前提是实现终端资源和打印机资源来自不相交的专用池。两种类型LU的资源来自单个共享池的实现应返回以下值："
    },
    {
      "indent": 3,
      "text": "o maximum: maximum size of the shared pool o in-use: number currently in use as this type of LU o spare: maximum - (terminal in-use + printer in-use)",
      "zh-CHS": "o 最大：正在使用的共享池的最大大小o：当前用作此类型LU的数量o备用：最大-（正在使用的终端+正在使用的打印机）"
    },
    {
      "indent": 0,
      "text": "3.2 TN3270E Server Resource Configuration",
      "section_title": true,
      "zh-CHS": "3.2 TN3270E服务器资源配置"
    },
    {
      "indent": 3,
      "text": "The following three tables provide for configuration of resources at a TN3270E server:",
      "zh-CHS": "以下三个表提供了TN3270E服务器上的资源配置："
    },
    {
      "indent": 3,
      "text": "o tn3270eClientGroupTable o tn3270eResPoolTable o tn3270eClientResMapTable",
      "zh-CHS": "o tn3270eClientGroupTable o TN3270eSpoolTable o tn3270eClientResMapTable"
    },
    {
      "indent": 3,
      "text": "tn3270eClientGroupTable and tn3270eResPoolTable enable implementations to define groupings of both client addresses and resource pools for mapping client addresses to resources. The tn3270eClientResMapTable provides a mapping from a client group to a resource pool.",
      "zh-CHS": "tn3270eClientGroupTable和TN3270eSpooltable使实现能够定义客户端地址和资源池的分组，以便将客户端地址映射到资源。tn3270eClientResMapTable提供从客户端组到资源池的映射。"
    },
    {
      "indent": 0,
      "text": "3.3 Resource Name / Client Address Mappings",
      "section_title": true,
      "zh-CHS": "3.3 资源名称/客户端地址映射"
    },
    {
      "indent": 3,
      "text": "The TN3270E-MIB contains three tables for mapping resource names to client addresses, and client addresses to resource names:",
      "zh-CHS": "TN3270E-MIB包含三个表，用于将资源名称映射到客户端地址，并将客户端地址映射到资源名称："
    },
    {
      "indent": 3,
      "text": "o tn3270eSnaMapTable o tn3270eResMapTable o tn3270eTcpConnTable",
      "zh-CHS": "o tn3270eSnaMapTable o tn3270eResMapTable o TN3270ETCPCONTABLE"
    },
    {
      "indent": 0,
      "text": "3.3.1 tn3270eSnaMapTable",
      "section_title": true,
      "zh-CHS": "3.3.1 tn3270eSnaMapTable"
    },
    {
      "indent": 3,
      "text": "The tn3270eSnaMapTable is a read-only table that maps a secondary LU's SNA network name to the name by which it is known locally at the TN3270E server. For correlation with data from the SNA network, the name of the associated primary LU also appears in a tn3270eSnaMapEntry. An entry in this table is created when the Activate LU (ACTLU) request carrying the SNA network name of the SLU is received from the SSCP. The entry is deleted when the SLU is deactivated.",
      "zh-CHS": "tn3270eSnaMapTable是一个只读表，它将辅助LU的SNA网络名称映射到TN3270E服务器上本地已知的名称。为了与来自SNA网络的数据进行关联，相关主LU的名称也会出现在tn3270eSnaMapEntry中。当从SSCP接收到带有SLU SNA网络名称的激活LU（ACTLU）请求时，将创建此表中的条目。当SLU停用时，该条目将被删除。"
    },
    {
      "indent": 3,
      "text": "A TN3270E server provides a client with access to an SNA application by associating a TCP connection from the client with an SNA secondary LU (SLU) at the server. This SLU in turn has an SNA session with a primary LU (PLU) running on an SNA host. This PLU represents the application with which the client is communicating. The TN3270E-MIB includes two tables for mapping back and forth among the SNA name identifying the PLU, the SNA name identifying the SLU, and the TCP connection with the client.",
      "zh-CHS": "TN3270E服务器通过将来自客户端的TCP连接与服务器上的SNA辅助LU（SLU）相关联，为客户端提供对SNA应用程序的访问。这个SLU又有一个SNA会话，主LU（PLU）在SNA主机上运行。此PLU表示客户端与之通信的应用程序。TN3270E-MIB包括两个表，用于在标识PLU的SNA名称、标识SLU的SNA名称以及与客户端的TCP连接之间来回映射。"
    },
    {
      "indent": 3,
      "text": "In order to understand how these name mappings work, it is necessary to understand a subtlety involving the names of the SLUs at the TN3270E server: these names are often different from the names by which the SLUs are known in the rest of the SNA network. In the TN3270E-MIB, these two types of SLU names are termed \"local names\" and \"SSCP-supplied names\"; the latter term indicates that the name by which the SLU is known in the SNA network comes to the TN3270E server from the SNA System Services Control Point.",
      "zh-CHS": "为了理解这些名称映射是如何工作的，有必要了解涉及TN3270E服务器上的SLU名称的一个微妙之处：这些名称通常不同于SNA网络其余部分中已知的SLU名称。在TN3270E-MIB中，这两种类型的SLU名称被称为“本地名称”和“SSCP提供的名称”；后一术语表示SNA网络中已知SLU的名称从SNA系统服务控制点到达TN3270E服务器。"
    },
    {
      "indent": 3,
      "text": "SSCPs don't always send SLU names down to secondary LUs; in some cases this capability must be turned on. In the case of SLUs served by a Dependent LU Requester (DLUR), an SSCP always sends SLU names to the DLUR. It is necessary, however, to enable the DLUR's PU/LU Network Name Forwarding function, so that it forwards the SLU names it receives from the SSCP down to the PUs that it serves.",
      "zh-CHS": "SSCP并不总是将SLU名称发送到次要LU；在某些情况下，必须启用此功能。对于由从属LU请求者（DLUR）提供服务的SLU，SSCP始终向DLUR发送SLU名称。但是，有必要启用DLUR的PU/LU网络名称转发功能，以便它将从SSCP接收到的SLU名称转发到其服务的PU。"
    },
    {
      "indent": 3,
      "text": "For SLUs associated with an SNA type 2.0 node (or with a boundary-function-attached type 2.1 node) not served by a DLUR, inclusion of SLU names on ACTLU must be enabled explicitly at the SSCP via local configuration.",
      "zh-CHS": "对于与未由DLUR服务的SNA类型2.0节点（或与边界功能连接的类型2.1节点）相关的SLU，必须通过本地配置在SSCP上明确启用ACTLU上的SLU名称。"
    },
    {
      "indent": 0,
      "text": "3.3.2 tn3270eResMapTable",
      "section_title": true,
      "zh-CHS": "3.3.2 TN3270可接受"
    },
    {
      "indent": 3,
      "text": "The tn3270eResMapTable is a read-only table that maps a resource name to a client's address. An entry in this table is created when a TCP connection is received by a TN3270E server and mapped to a resource. The entry is deleted when the resource-to-address association is no longer valid.",
      "zh-CHS": "tn3270eResMapTable是一个只读表，它将资源名称映射到客户端地址。当TN3270E服务器接收到TCP连接并映射到资源时，将创建此表中的条目。当资源与地址的关联不再有效时，该条目将被删除。"
    },
    {
      "indent": 0,
      "text": "3.3.3 tn3270eTcpConnTable",
      "section_title": true,
      "zh-CHS": "3.3.3 tn3270eTcpConnTable"
    },
    {
      "indent": 3,
      "text": "The TCP Connection Table is currently defined by RFC 2012 (Refer to reference [20], TCP-MIB Definitions). It contains the following objects:",
      "zh-CHS": "TCP连接表目前由RFC 2012定义（请参阅参考文献[20]，TCP-MIB定义）。它包含以下对象："
    },
    {
      "indent": 3,
      "text": "o tcpConnState (INTEGER) o tcpConnLocalAddress (IpAddress) o tcpConnLocalPort (INTEGER) o tcpConnRemAddress (IpAddress) o tcpConnRemPort (INTEGER)",
      "zh-CHS": "o tcpConnState（整数）o tcpConnLocalAddress（IpAddress）o tcpConnLocalPort（整数）o tcpConnRemAddress（IpAddress）o tcpConnRemPort（整数）"
    },
    {
      "indent": 3,
      "text": "It is indexed by: tcpConnLocalAddress, tcpConnLocalPort, tcpConnRemAddress, and tcpConnRemPort.",
      "zh-CHS": "它的索引是：tcpConnLocalAddress、tcpConnLocalPort、tcpConnRemAddress和tcpConnRemPort。"
    },
    {
      "indent": 3,
      "text": "The tn3270eTcpConnTable contains objects for keeping a list of the current set of TN3270 and TN3270E sessions at a TN3270E server. The relationship between the tcpConnTable and the Tn3270eTcpConnTable is not one-to-one, since the tn3270eTcpConnTable contains information pertaining only to TN3270(E) sessions.",
      "zh-CHS": "tn3270eTcpConnTable包含用于在TN3270E服务器上保留当前TN3270和TN3270E会话集列表的对象。TCPConTable和TN3270ETCPConTable之间的关系不是一对一的，因为TN3270ETCPConTable只包含与TN3270（E）会话有关的信息。"
    },
    {
      "indent": 3,
      "text": "The tn3270eTcpConnTable has a different indexing structure from that of the tcpConnTable. Instead of using IpAddress objects, Tn3270eAddress and IANATn3270eAddrType object pairs are used to specify client addresses (both local and remote). This enables support of IPv6 addresses. In addition, the remote address pair precedes the local address pair in the index clause, in order to enable a GET-NEXT operation using only the remote address pair.",
      "zh-CHS": "tn3270eTcpConnTable的索引结构与tcpConnTable的索引结构不同。Tn3270eAddress和IANATn3270eAddrType对象对用于指定客户端地址（本地和远程），而不是使用IpAddress对象。这支持IPv6地址。此外，在index子句中，远程地址对位于本地地址对之前，以便仅使用远程地址对启用GET-NEXT操作。"
    },
    {
      "indent": 0,
      "text": "3.4 Advisory Spin Lock Usage",
      "section_title": true,
      "zh-CHS": "3.4 建议自旋锁使用"
    },
    {
      "indent": 3,
      "text": "Within the TN3270E-MIB, tn3270eConfSpinLock is defined as an advisory lock that allows cooperating TN3270E-MIB applications to coordinate their use of the tn3270eSrvrConfTable, the tn3270eSrvrPortTable, the tn3270eClientGroupTable, the tn3270eResPoolTable, and the",
      "zh-CHS": "在TN3270E-MIB中，tn3270eConfSpinLock被定义为一个咨询锁，允许协作的TN3270E-MIB应用程序协调它们对TN3270ESRVReconTable、TN3270ESRVReportTable、tn3270eClientGroupTable、tn3270eResPoolTable和"
    },
    {
      "indent": 3,
      "text": "tn3270eClientResMapTable. When creating a new entry or altering an existing entry in any of these tables, an application SHOULD make use of tn3270eConfSpinLock to serialize application changes or additions. Since this is an advisory lock, its use by management applications SHALL NOT be enforced by agents. Agents MUST, however, implement the tn3270eConfSpinLock object.",
      "zh-CHS": "tn3270eClientResMapTable。在这些表中创建新条目或更改现有条目时，应用程序应使用tn3270eConfSpinLock序列化应用程序更改或添加。由于这是一个咨询锁，代理不应强制管理应用程序使用它。但是，代理必须实现tn3270eConfSpinLock对象。"
    },
    {
      "indent": 0,
      "text": "3.5 Row Persistence",
      "section_title": true,
      "zh-CHS": "3.5 行持久性"
    },
    {
      "indent": 3,
      "text": "The following tables enable remote creation of their entries by including RowStatus objects:",
      "zh-CHS": "下表通过包含RowStatus对象，支持远程创建其条目："
    },
    {
      "indent": 3,
      "text": "o tn3270eSrvrConfTable o tn3270eSrvrPortTable o tn3270eClientGroupTable o tn3270eResPoolTable o tn3270eClientResMapTable",
      "zh-CHS": "o TN3270ESRVReconTable o TN3270ESRVReportTable o tn3270eClientGroupTable o TN3270eSpoolTable o tn3270eClientResMapTable"
    },
    {
      "indent": 3,
      "text": "An implementation SHOULD NOT retain SNMP-created entries in these tables across reIPLs (Initial Program Loads) of the corresponding TN3270E server, since management applications need to see consistent behavior with respect to the persistence of the table entries that they create.",
      "zh-CHS": "实现不应在这些表中跨相应TN3270E服务器的REIPL（初始程序加载）保留SNMP创建的条目，因为管理应用程序需要看到它们创建的表条目的持久性的一致行为。"
    },
    {
      "indent": 3,
      "text": "It is expected that local, implementation-dependent configuration information will be used to define the initial and persistent configurations for TN3270E server usage. Thus it is not necessary to enable persistence of table entries by adding StorageType (refer to RFC 1903 [6]) objects to these tables.",
      "zh-CHS": "预计本地、依赖于实现的配置信息将用于定义TN3270E服务器使用的初始和持久配置。因此，无需通过向这些表中添加StorageType（请参阅RFC1903[6]）对象来启用表项的持久性。"
    },
    {
      "indent": 0,
      "text": "3.6 IANA Considerations",
      "section_title": true,
      "zh-CHS": "3.6 IANA考虑"
    },
    {
      "indent": 3,
      "text": "The tn3270eSrvrFunctionsSupported, tn3270eTcpConnFunctions, tn3270eTcpConnClientIdFormat, and tn3270eTcpConnLogInfo objects, as well as a number of objects identifying various address types, resource types, and device types, use textual conventions imported from the IANATn3270eTC-MIB. The purpose of defining these textual conventions in a separate MIB module is to allow additional values to be defined without having to issue a new version of this document. The Internet Assigned Numbers Authority (IANA) is responsible for the assignment of all Internet numbers, including various SNMP-related numbers; it will administer the values associated with these textual conventions.",
      "zh-CHS": "支持的TN3270ESRVFunctions、tn3270eTcpConnFunctions、TN3270ETCPConnClientFormat和tn3270eTcpConnLogInfo对象，以及许多标识各种地址类型、资源类型和设备类型的对象，使用从IANATn3270eTC MIB导入的文本约定。在单独的MIB模块中定义这些文本约定的目的是允许定义附加值，而无需发布本文档的新版本。互联网分配号码管理局（IANA）负责分配所有互联网号码，包括各种SNMP相关号码；它将管理与这些文本约定关联的值。"
    },
    {
      "indent": 3,
      "text": "The rules for additions or changes to the IANATn3270eTC-MIB are outlined in the DESCRIPTION clause associated with its MODULE-IDENTITY statement.",
      "zh-CHS": "IANATn3270eTC MIB的添加或更改规则在与其MODULE-IDENTITY语句关联的DESCRIPTION子句中概述。"
    },
    {
      "indent": 3,
      "text": "The current version of the IANATn3270eTC-MIB can be accessed from the IANA home page at: \"http://www.iana.org/\".",
      "zh-CHS": "IANATn3270eTC MIB的当前版本可从IANA主页访问，网址为：http://www.iana.org/\"."
    },
    {
      "indent": 0,
      "text": "4.0 Definitions",
      "section_title": true,
      "zh-CHS": "4.0 定义"
    },
    {
      "indent": 2,
      "text": "TN3270E-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Unsigned32, TimeTicks, IpAddress, Counter32, Gauge32, Counter64 FROM SNMPv2-SMI TEXTUAL-CONVENTION, RowStatus, TestAndIncr, DateAndTime, TimeStamp FROM SNMPv2-TC MODULE-COMPLIANCE, OBJECT-GROUP FROM SNMPv2-CONF snanauMIB FROM SNA-NAU-MIB Utf8String FROM SYSAPPL-MIB SnmpAdminString FROM SNMP-FRAMEWORK-MIB IANATn3270eAddrType, IANATn3270eAddress, IANATn3270eClientType, IANATn3270Functions, IANATn3270ResourceType, IANATn3270DeviceType, IANATn3270eLogData FROM IANATn3270eTC-MIB;",
      "zh-CHS": "从SNMPv2 SMI文本约定导入模块标识、对象类型、无符号32、时间刻度、IpAddress、计数器32、仪表32、计数器64、行状态、测试和NCR、日期和时间、SNMPv2 TC模块符合性的时间戳，SNMPv2 CONF snanauMIB FROM SNA-NAU-MIB Utf8String FROM SYSAPPL-MIB snmpadmin FROM SNMP-FRAMEWORK-MIB IANATn3270eAddrType、ianatn3270eaddrAddress、IANATn3270eClientType、IANATn3270Functions、IANATn3270ResourceType、IANATn3270DeviceType、IANATn3270eLogData FROM IANATn3270eTC MIB的对象组；"
    },
    {
      "indent": 4,
      "text": "tn3270eMIB MODULE-IDENTITY LAST-UPDATED \"9807270000Z\" -- July 27, 1998 ORGANIZATION \"TN3270E Working Group\" CONTACT-INFO \"Kenneth White (kennethw@vnet.ibm.com) IBM Corp. - Dept. BRQA/Bldg. 501/G114 P.O. Box 12195 3039 Cornwallis RTP, NC 27709-2195 USA",
      "zh-CHS": "tn3270eMIB模块标识最后更新“980727000MZ”-1998年7月27日组织“TN3270E工作组”联系方式“Kenneth White”(kennethw@vnet.ibm.com)IBM公司-美国北卡罗来纳州康沃利斯RTP市12195 3039号邮政信箱501/G114号楼BRQA部，邮编27709-2195"
    },
    {
      "indent": 8,
      "text": " Robert Moore (remoore@us.ibm.com) IBM Corp. - Dept. BRQA/Bldg. 501/G114 P.O. Box 12195 3039 Cornwallis RTP, NC 27709-2195 USA +1-919-254-4436\" DESCRIPTION \"This module defines a portion of the management",
      "zh-CHS": "罗伯特·摩尔(remoore@us.ibm.com)IBM公司-美国NC 27709-2195 Cornwallis RTP公司BRQA/Bldg.501/G114邮政信箱12195 3039号部门+1-919-254-4436“说明”此模块定义了管理的一部分"
    },
    {
      "indent": 8,
      "text": "    information base (MIB) for managing TN3270E servers.\"\nREVISION  \"9807270000Z\" -- July 27, 1998\nDESCRIPTION\n    \"RFC nnnn (Proposed Standard)\" -- RFC Editor to fill in\n::= { snanauMIB 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "-- Textual Conventions",
      "zh-CHS": "--文本约定"
    },
    {
      "indent": 2,
      "text": "SnaResourceName ::= TEXTUAL-CONVENTION\n    STATUS      current\n    DESCRIPTION\n        \"The textual convention for defining an SNA resource\n         name. A fully qualified SNA resource name, consisting\n         of a 1 to 8 character network identifier (NetId), a\n         period ('.'), and a 1 to 8 character resource name\n         (ResName).",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "The NetId and ResName are constructed from the uppercase letters 'A' - 'Z' and the numerics '0' - '9', all encoded in ASCII, with the restriction that the first character of each must be a letter. Blanks are not allowed.",
      "zh-CHS": "NetId和ResName由大写字母“A”-“Z”和数字“0”-“9”构成，均以ASCII编码，但每个字符的第一个字符必须是字母。不允许空白。"
    },
    {
      "indent": 11,
      "text": "Earlier versions of SNA permitted three additional characters in NetIds and ResNames: '#', '@', and '$'. While this use of these characters has been retired, a Management Station should still accept them for backward compatibility.",
      "zh-CHS": "早期版本的SNA允许在NetID和域名中添加三个字符：“#”、“@”和“$”。虽然这些字符的这种使用已经失效，但管理站仍应接受它们以实现向后兼容性。"
    },
    {
      "indent": 6,
      "text": " Note: This Textual Convention is not subject to internationalization, and does not use the character encodings used by the Utf8String Textual Convention.\" SYNTAX OCTET STRING (SIZE(0..17))",
      "zh-CHS": "注意：此文本约定不受国际化约束，并且不使用Utf8String文本约定使用的字符编码"
    },
    {
      "indent": 2,
      "text": "Tn3270eTraceData ::= TEXTUAL-CONVENTION\n    STATUS      current\n    DESCRIPTION\n        \"An octet string representing trace data from the\n        Telnet half of a TN3270E session, from the SNA half,\n        or from both.  The octet string contains a sequence\n        of trace elements, with the trace elements in the\n        string ordered from earliest to latest.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Each trace element has the following form:",
      "zh-CHS": "每个微量元素具有以下形式："
    },
    {
      "indent": 18,
      "text": "+---+---+----+----------------------+\n!length !type!data                  !\n+---+---+----+----------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "where:",
      "zh-CHS": "哪里："
    },
    {
      "indent": 12,
      "text": "length = two-octet length of the data portion of the trace element, not including the length and type octets",
      "zh-CHS": "长度=微量元素数据部分的两个八位字节长度，不包括长度和类型八位字节"
    },
    {
      "indent": 12,
      "text": "type = one-octet code point characterizing the data; defined values are:",
      "zh-CHS": "类型=表征数据的一个八位字节码点；定义值为："
    },
    {
      "indent": 21,
      "text": "X'01' telnet PDU from the server to the client X'02' telnet PDU from the client to the server X'03' SNA data from the server to the SNA host X'04' SNA data from the SNA host to the server",
      "zh-CHS": "X'01'telnet PDU从服务器到客户端X'02'telnet PDU从客户端到服务器X'03'SNA数据从服务器到SNA主机X'04'SNA数据从SNA主机到服务器"
    },
    {
      "indent": 12,
      "text": "data = initial part of a PDU.",
      "zh-CHS": "数据=PDU的初始部分。"
    },
    {
      "indent": 10,
      "text": "It is implementation-dependent where the 'initial part of a PDU' starts. For SNA data, however, the starting point SHOULD be the first byte of the TH. For IP data the starting point SHOULD be the first byte of the IP header.",
      "zh-CHS": "它取决于“PDU的初始部分”的起始位置。但是，对于SNA数据，起始点应为TH的第一个字节。对于IP数据，起始点应为IP头的第一个字节。"
    },
    {
      "indent": 10,
      "text": "It is left to implementations to determine how much of each PDU to return in a trace element.",
      "zh-CHS": "由实现来决定在跟踪元素中返回多少PDU。"
    },
    {
      "indent": 6,
      "text": " The zero-length string indicates that no trace data is available.\" SYNTAX OCTET STRING (SIZE (0 | 3..4096))",
      "zh-CHS": "长度为零的字符串表示没有可用的跟踪数据。“语法八位字节字符串（大小（0 | 3..4096））"
    },
    {
      "indent": 2,
      "text": "-- Top-level structure of the MIB",
      "zh-CHS": "--MIB的顶层结构"
    },
    {
      "indent": 2,
      "text": "tn3270eNotifications  OBJECT IDENTIFIER ::= { tn3270eMIB 0 }\ntn3270eObjects        OBJECT IDENTIFIER ::= { tn3270eMIB 1 }\ntn3270eConformance    OBJECT IDENTIFIER ::= { tn3270eMIB 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "-- MIB Objects",
      "zh-CHS": "--MIB对象"
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eSrvrConfEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table defines the configuration elements for TN3270E servers. The number of entries in this table is expected to vary depending on the location of the table. A particular TN3270E server is expected to have a single entry. Modeling of the configuration elements as a table allows multiple TN3270E servers to be serviced by the same SNMP agent.",
      "zh-CHS": "TN3270ESRVRCONTRY MAX-ACCESS的TN3270ESRVRCONTABLE对象类型语法序列不可访问状态当前描述“此表定义了TN3270E服务器的配置元素。此表中的条目数预计会因表的位置而异。一个特定的TN3270E服务器应该有一个条目。将配置元素建模为表允许同一SNMP代理为多个TN3270E服务器提供服务。"
    },
    {
      "indent": 10,
      "text": "An implementation SHOULD NOT retain an SNMP-created entry in this table across re-IPLs (Initial Program Loads) of the corresponding TN3270E server.\"",
      "zh-CHS": "实现不应在对应TN3270E服务器的re IPL（初始程序加载）中保留此表中的SNMP创建项。”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfEntry OBJECT-TYPE\n    SYNTAX      Tn3270eSrvrConfEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Definition of the configuration elements for a single\n        TN3270E server.\"\n    INDEX       { tn3270eSrvrConfIndex }\n    ::= { tn3270eSrvrConfTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eSrvrConfEntry ::= SEQUENCE {\n    tn3270eSrvrConfIndex             Unsigned32,\n    tn3270eSrvrConfInactivityTimeout Unsigned32,\n    tn3270eSrvrConfConnectivityChk   INTEGER,\n    tn3270eSrvrConfTmNopInactTime    Unsigned32,\n    tn3270eSrvrConfTmNopInterval     Unsigned32,\n    tn3270eSrvrFunctionsSupported    IANATn3270Functions,\n    tn3270eSrvrConfAdminStatus       INTEGER,\n    tn3270eSrvrConfOperStatus        INTEGER,\n    tn3270eSrvrConfSessionTermState  INTEGER,\n    tn3270eSrvrConfSrvrType          INTEGER,\n    tn3270eSrvrConfContact           SnmpAdminString,\n    tn3270eSrvrConfRowStatus         RowStatus,\n    tn3270eSrvrConfLastActTime       DateAndTime,\n    tn3270eSrvrConfTmTimeout         Unsigned32\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfIndex OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Identifier for a single TN3270E server.",
      "zh-CHS": "TN3270ESRVRConIndex对象类型语法Unsigned32（1..4294967295）MAX-ACCESS不可访问状态当前描述“单个TN3270E服务器的标识符。"
    },
    {
      "indent": 6,
      "text": "   tn3270eSrvrConfIndex values need not be\n   contiguous.\"\n::= { tn3270eSrvrConfEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfInactivityTimeout OBJECT-TYPE SYNTAX Unsigned32 (0..99999999) UNITS \"seconds\" MAX-ACCESS read-create",
      "zh-CHS": "TN3270ESRVReconfictivityTimeout对象类型语法无符号32（0..9999999）单位“秒”最大访问读取创建"
    },
    {
      "indent": 6,
      "text": "STATUS current DESCRIPTION \"The inactivity time-out specified in seconds. When a connection has been inactive for the number of seconds specified by this object it is closed. Only user traffic is considered when determining whether there has been activity on a connection.",
      "zh-CHS": "STATUS current DESCRIPTION“以秒为单位指定的非活动超时。当连接在该对象指定的秒数内处于非活动状态时，它将关闭。在确定连接上是否存在活动时，仅考虑用户流量。"
    },
    {
      "indent": 6,
      "text": "    The default value 0 means that no inactivity time-out is\n    in effect.\"\nDEFVAL { 0 }\n::= { tn3270eSrvrConfEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfConnectivityChk OBJECT-TYPE\n    SYNTAX      INTEGER {\n                          timingMark(1),\n                          nop(2),\n                          noCheck(3)\n                        }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n       \"This object enables TIMING-MARK processing, NOP\n        processing, or neither for a TN3270E server.\"\n    DEFVAL { noCheck }\n    ::= { tn3270eSrvrConfEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfTmNopInactTime OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..86400) -- 1 second to 24 hours\n    UNITS \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n       \"The amount of time a connection must have had no\n       traffic on it in order for a TIMING-MARK or NOP request\n       to be sent on the connection.  This value applies only\n       when connections are being examined for recent activity\n       on a scan interval controlled by the value of the\n       tn3270eSrvrConfTmNopInterval object.\"\n    DEFVAL { 600 }   -- 10 minutes\n    ::= { tn3270eSrvrConfEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfTmNopInterval OBJECT-TYPE SYNTAX Unsigned32 (1..86400) -- 1 second to 24 hours UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION",
      "zh-CHS": "TN3270ESRVRecfTMNopInterval对象类型语法Unsigned32（1..86400）--1秒到24小时单位“秒”最大读取创建状态当前描述"
    },
    {
      "indent": 6,
      "text": "   \"The scan interval to be used by a TN3270E server when\n   it examines its Telnet connections for recent activity.\n   The server scans its Telnet connections on the interval\n   provided by this object, looking for ones that have been\n   idle for more than the value provided by the\n   tn3270eSrvrConfTmNopInactTime object.  A TIMING-MARK or\n   NOP request is sent for each connection that has\n   exhibited no activity for this period of time.\"\nDEFVAL { 120 }   -- 2 minutes\n::= { tn3270eSrvrConfEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrFunctionsSupported OBJECT-TYPE\n    SYNTAX    IANATn3270Functions\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object indicates the functions supported by a\n        TN3270E server.\"\n    DEFVAL { { scsCtlCodes, dataStreamCtl,\n               responses, bindImage, sysreq } }\n    ::= { tn3270eSrvrConfEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfAdminStatus OBJECT-TYPE\n    SYNTAX  INTEGER {\n                      up(1),\n                      down(2),\n                      stopImmediate(3)\n                    }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The desired state of the TN3270E server represented\n         by this entry in the table:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "up(1) - Activate this TN3270E server. down(2) - Informs the associated TN3270E server to gracefully terminate its processing. stopImmediate(3) - Informs the associated TN3270E server to terminate itself immediately.",
      "zh-CHS": "up（1）-激活此TN3270E服务器。停机（2）-通知关联的TN3270E服务器正常终止其处理。stopImmediate（3）-通知关联的TN3270E服务器立即终止自身。"
    },
    {
      "indent": 11,
      "text": "When a managed system creates an entry in this table, tn3270eSrvrConfAdminStatus and tn3270eSrvrConfOperStatus are initialized as up(1) by default.",
      "zh-CHS": "当受管系统在此表中创建条目时，默认情况下，TN3270ESRVReconAdminStatus和TN3270ESRVReconFoperStatus初始化为up（1）。"
    },
    {
      "indent": 11,
      "text": "The exact behavior of a server in response to a down(2) or stopImmediate(3) command is left implementation-",
      "zh-CHS": "服务器响应down（2）或stopImmediate（3）命令的确切行为由实现决定-"
    },
    {
      "indent": 11,
      "text": "dependent. A TN3270E server that is capable of it SHOULD close all of its TN3270 and TN3270E sessions during a graceful termination.",
      "zh-CHS": "依靠的能够正常终止的TN3270E服务器应在正常终止期间关闭其所有TN3270和TN3270E会话。"
    },
    {
      "indent": 11,
      "text": "Often the function enabled via stopImmediate(3) is used as a last resort by a system administrator, to attempt to either bring down a hung TN3270E server or free up its resources immediately to aid in general system availability, or to shut down a TN3270E server that is not recognizing a down(2) request.",
      "zh-CHS": "通常，通过stopImmediate（3）启用的功能被系统管理员用作最后手段，以尝试关闭挂起的TN3270E服务器或立即释放其资源以帮助实现一般系统可用性，或关闭未识别关闭（2）请求的TN3270E服务器。"
    },
    {
      "indent": 6,
      "text": "     A TN3270E server that does not distinguish between\n     down(2) or stopImmediate(3) transitions should not\n     support stopImmediate(3).\"\nDEFVAL { up }\n::= { tn3270eSrvrConfEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfOperStatus OBJECT-TYPE\n    SYNTAX  INTEGER {\n                     up(1),\n                     down(2),\n                     busy(3),\n                     shuttingDown(4)\n                    }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The current operational state of a TN3270E server.\n       The following values are defined:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "    up(1)            - the server is active and accepting\n                       new client connections\n    down(2)          - the server is not active\n    busy(3)          - the server is active, but is not\n                       accepting new client connections\n                       because it lacks the resources to\n                       do so\n    shuttingDown(4)  - the server is active, but is not\n                       accepting new client connections\n                       because it is in the process of\n                       performing a graceful shutdown.\"\nDEFVAL { up }\n::= { tn3270eSrvrConfEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfSessionTermState OBJECT-TYPE SYNTAX INTEGER { terminate(1), luSessionPend(2),",
      "zh-CHS": "TN3270ESRVReconSessionTermstate对象类型语法整数{terminate（1），luSessionPend（2），"
    },
    {
      "indent": 6,
      "text": "                  queueSession(3)\n                }\nMAX-ACCESS  read-create\nSTATUS      current\nDESCRIPTION\n   \"This object determines what a TN3270E server\n    should do when a TN3270 Session terminates:\n   terminate(1)     => Terminate the TCP connection.\n   luSessionPend(2) => Do not drop the TCP connection\n                       associated with a client when its\n                       TN3270 session ends.  Processing\n                       should redrive session initialization\n                       as if the client were first connecting.\n   queueSession(3)  => This value relates to the Close\n                       Destination PASS (CLSDST PASS) operation\n                       in VTAM.  An example provides the\n                       easiest explanation.  Suppose a TN3270E\n                       client is in session with APPL1, and\n                       APPL1 does a CLSDST PASS of the client's\n                       session to APPL2.  queueSession(3)\n                       specifies that the TN3270E server must\n                       keep the TCP connection with the client\n                       active after it receives the UNBIND from\n                       APPL1, waiting for the BIND from APPL2.\"\nDEFVAL { terminate }\n::= { tn3270eSrvrConfEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfSrvrType OBJECT-TYPE\n    SYNTAX      INTEGER {\n                          host(1),\n                          gateway(2)\n                        }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"This object indicates the type of TN3270E server.\n        The existence of MIB tables and objects that will be\n        defined by follow-on MIBs may be predicated on whether\n        the TN3270E server can be local to the same host as a\n        target application (host(1)) or will always be remote\n        (gateway(2)).",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "A host TN3270E server refers to an implementation where the TN3270E server is collocated with the Systems Network Architecture (SNA) System Services Control Point (SSCP) for the dependent Secondary Logical Units (SLUs) that the server makes available to its clients for connecting into an SNA network.",
      "zh-CHS": "主机TN3270E服务器指的是一种实现，其中TN3270E服务器与系统网络体系结构（SNA）系统服务控制点（SSCP）并置，用于服务器向其客户端提供用于连接到SNA网络的从属辅助逻辑单元（SLU）。"
    },
    {
      "indent": 10,
      "text": "A gateway TN3270E server resides on an SNA node other than an SSCP, either an SNA type 2.0 node or an APPN node acting in the role of a Dependent LU Requester (DLUR).",
      "zh-CHS": "网关TN3270E服务器驻留在除SSCP以外的SNA节点上，SNA 2.0型节点或充当从属LU请求者（DLUR）角色的APPN节点。"
    },
    {
      "indent": 6,
      "text": "    Host and gateway TN3270E server implementations typically\n    differ greatly as to their internal implementation and\n    system definition (SYSDEF) requirements.\"\n::= { tn3270eSrvrConfEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfContact OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object provides a scratch pad for a TN3270E\n        server administrator for storing information for\n        later retrieval.\"\n    DEFVAL { ''H }   -- the empty string\n    ::= { tn3270eSrvrConfEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted in the tn3270eSrvrConfTable. Entries may also be created and deleted as a result of implementation-dependent operations.",
      "zh-CHS": "TN3270ESRVRCROWSTATUS对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此对象允许在TN3270ESRVRCONTABLE中创建和删除条目。依赖于实现的操作也可以创建和删除条目。"
    },
    {
      "indent": 10,
      "text": "With the exception of tn3270eSrvrConfSrvrType, which an implementation can easily fill in for itself, all the columnar objects in this table have DEFVALs associated with them. Consequently, a Management Station can create a conceptual row via a SET operation that specifies a value only for this object.",
      "zh-CHS": "除了tn3270eSrvrConfSrvrType之外，该表中的所有列对象都有与之相关联的定义，而tn3270eSrvrConfSrvrType是实现可以轻松填充的。因此，管理工作站可以通过仅为此对象指定值的集合操作创建概念行。"
    },
    {
      "indent": 10,
      "text": "When a tn3270eSrvrConfEntry is deleted (by setting this object to destroy(6)), this has the side-effect of removing all the associated entries (i.e., those having the same tn3270eSrvrConfIndex) from the tn3270eSrvrPortTable, the tn3270eSrvrStatsTable, the tn3270eClientGroupTable, the tn3270eResPoolTable, the tn3270eSnaMapTable, the tn3270eClientResMapTable, and the tn3270eResMapTable. All entries in the tn3270eTcpConnTable that belong to a TN3270E server that has been deleted MUST also be removed.",
      "zh-CHS": "删除TN3270ESRVRConEntry时（通过将此对象设置为销毁（6）），会产生副作用，即从TN3270ESRVReportTable、TN3270ESRVStatTable、tn3270eClientGroupTable、TN3270ERSpoolTable、tn3270eSnaMapTable中删除所有关联条目（即具有相同TN3270ESRVConfindex的条目），tn3270eClientResMapTable和tn3270eResMapTable。tn3270eTcpConnTable中属于已删除的TN3270E服务器的所有条目也必须删除。"
    },
    {
      "indent": 6,
      "text": "    In other words, a tn3270eSrvrConfEntry must exist for\n    a TN3270E server in order for it to have entries in\n    any of the other tables defined by this MIB.\"\nREFERENCE\n    \"RFC 1903, 'Textual Conventions for version 2 of the\n    Simple Network Management Protocol (SNMPv2).'\"\n::= { tn3270eSrvrConfEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfLastActTime OBJECT-TYPE SYNTAX DateAndTime MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reports the DateAndTime when a TN3270E server was most recently activated.",
      "zh-CHS": "TN3270ESRVConflastactTime对象类型语法DateAndTime MAX-ACCESS只读状态当前描述“此对象报告最近激活TN3270E服务器的日期和时间。"
    },
    {
      "indent": 6,
      "text": "    The special value of all '00'Hs indicates that the\n    server has never been active, i.e., that the value of\n    tn3270eSrvrOperStatus has never been anything other\n    than down(2).\"\nDEFVAL { '0000000000000000'H }\n::= { tn3270eSrvrConfEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrConfTmTimeout OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..600) -- 1 second to 10 minutes\n    UNITS \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n       \"The TIMING-MARK time-out, specified in seconds.\"\n    DEFVAL { 5 }   -- 5 seconds\n    ::= { tn3270eSrvrConfEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrPortTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eSrvrPortEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table defines the TCP ports associated with TN3270E servers. No entry in this table shall exist without a corresponding (same tn3270eSrvrConfIndex) entry in the tn3270eSrvrConfTable existing.",
      "zh-CHS": "tn3270eSrvrPortTable Tn3270eSrvrPortEntry MAX-ACCESS的对象类型语法序列不可访问状态当前描述“此表定义与TN3270E服务器关联的TCP端口。如果TN3270ESRVRConfixtable中没有相应的（相同的TN3270ESRVRConindex）条目，则此表中的任何条目都不存在。"
    },
    {
      "indent": 6,
      "text": "    An implementation SHOULD NOT retain SNMP-created\n    entries in this table across re-IPLs (Initial Program\n    Loads) of the corresponding TN3270E server.\"\n::= { tn3270eObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrPortEntry OBJECT-TYPE SYNTAX Tn3270eSrvrPortEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Definition of a single TCP port assignment to a TN3270E server. Assignment of a port on a local address basis is enabled though use of tn3270eSrvrPortAddrType and tn3270eSrvrPortAddress.",
      "zh-CHS": "tn3270eSrvrPortEntry对象类型语法tn3270eSrvrPortEntry MAX-ACCESS不可访问状态当前描述“为TN3270E服务器分配单个TCP端口的定义。通过使用TN3270ESRVRPortAddressType和TN3270ESRVortAddress，可启用基于本地地址分配端口。"
    },
    {
      "indent": 6,
      "text": "     A TCP port assignment that is not restricted to\n     a local address SHALL specify a tn3270eSrvrPortAddrType\n     of unknown(0), and SHALL use a zero-length octet string\n     for the tn3270eSrvrPortAddress.\"\nINDEX       {\n              tn3270eSrvrConfIndex,\n              tn3270eSrvrPort,\n              tn3270eSrvrPortAddrType,\n              tn3270eSrvrPortAddress\n            }\n::= { tn3270eSrvrPortTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eSrvrPortEntry ::= SEQUENCE {\n    tn3270eSrvrPort                 Unsigned32,\n    tn3270eSrvrPortAddrType         IANATn3270eAddrType,\n    tn3270eSrvrPortAddress          IANATn3270eAddress,\n    tn3270eSrvrPortRowStatus        RowStatus\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrPort OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..65535)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"Indicates a port assigned to a server.\"\n    ::= { tn3270eSrvrPortEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrPortAddrType OBJECT-TYPE\n    SYNTAX      IANATn3270eAddrType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Indicates the type of an address local to the host on\n        which the TN3270E server resides that is represented\n        in tn3270eSrvrPortAddress.  A value of unknown(0)\n        SHALL be used for this object when the port is not\n        to be restricted to a local address.\"\n    ::= { tn3270eSrvrPortEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrPortAddress OBJECT-TYPE SYNTAX IANATn3270eAddress MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A local address on the host that a TN3270E server resides on that is associated with a TCP port that is to be used or is in use by a TN3270E server. tn3270eClientGroupAddrType indicates the address type (IPv4 or IPv6, for example).",
      "zh-CHS": "TN3270ESRVPortAddress对象类型语法IANATN3270EADRESS MAX-ACCESS不可访问状态当前描述“TN3270E服务器所在主机上的本地地址，该地址与TN3270E服务器将要使用或正在使用的TCP端口相关联。tn3270eClientGroupAddrType指示地址类型（例如IPv4或IPv6）。"
    },
    {
      "indent": 6,
      "text": "     A zero-length octet string SHALL be used as the\n     value of this object when a local address isn't\n     being specified.\"\n::= { tn3270eSrvrPortEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrPortRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted in the tn3270eSrvrPortTable. Entries may also be created and deleted as a result of implementation-dependent operations.",
      "zh-CHS": "tn3270eSrvrPortRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此对象允许在tn3270eSrvrPortTable中创建和删除条目。依赖于实现的操作也可以创建和删除条目。"
    },
    {
      "indent": 10,
      "text": "Since this is the only accessible object in this table, a Management Station can create a conceptual row via a SET operation that specifies a value only for this object.",
      "zh-CHS": "由于这是此表中唯一可访问的对象，因此管理站可以通过仅为此对象指定值的集合操作创建概念行。"
    },
    {
      "indent": 6,
      "text": "    An entry in this table is deleted by setting this object\n    to destroy(6).  Deletion of a tn3270eSrvrPortEntry has\n    no effect on any other table entry defined by this MIB.\"\nREFERENCE\n    \"RFC 1903, 'Textual Conventions for version 2 of the\n    Simple Network Management Protocol (SNMPv2).'\"\n::= { tn3270eSrvrPortEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eSrvrStatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table defines a set of statistics concerning TN3270E server performance.",
      "zh-CHS": "tn3270eSrvrStatsTable Tn3270eSrvrStatsEntry MAX-ACCESS的对象类型语法序列不可访问状态当前描述“此表定义了一组有关TN3270E服务器性能的统计信息。"
    },
    {
      "indent": 10,
      "text": "No entry in this table shall exist without a corresponding (same tn3270eSrvrConfIndex) entry in",
      "zh-CHS": "如果表中没有相应的（相同的TN3270ESRVRECONDEX）条目，则本表中的任何条目均不存在"
    },
    {
      "indent": 6,
      "text": "    the tn3270eSrvrConfTable existing.\"\n::= { tn3270eObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsEntry OBJECT-TYPE SYNTAX Tn3270eSrvrStatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A collection of statistical and maximum usage objects for a single TN3270 server. An entry can represent the total activity of the server, or it can represent the activity occurring at the server on either a port or a port-and-local-address basis.",
      "zh-CHS": "tn3270eSrvrStatsEntry对象类型语法tn3270eSrvrStatsEntry MAX-ACCESS不可访问状态当前说明“单个TN3270服务器的统计和最大使用率对象的集合。条目可以表示服务器的总活动，也可以表示服务器上发生的基于端口或端口和本地地址的活动。"
    },
    {
      "indent": 10,
      "text": "Collection of the statistics represented by the objects in this table is not mandatory. An implementation of this table MUST use only one of the three levels of refinement that this table supports for the entries associated with each TN3270E server.",
      "zh-CHS": "此表中对象表示的统计信息的收集不是强制性的。此表的实现必须仅使用此表支持的与每个TN3270E服务器关联的条目的三个细化级别中的一个。"
    },
    {
      "indent": 10,
      "text": "The indexing for a row that represents total server statistics is as follows:",
      "zh-CHS": "表示总服务器统计信息的行的索引如下所示："
    },
    {
      "indent": 15,
      "text": "tn3270eSrvrConfIndex value identifying the server tn3270eSrvrPort 0 tn3270eSrvrPortAddrType unknown(0) tn3270eSrvrPortAddress zero-length octet string.",
      "zh-CHS": "TN3270ESRVRConIndex值，标识服务器tn3270eSrvrPort 0 TN3270ESRVROTADDRTYPE未知（0）TN3270ESRVROTADDress零长度八位字节字符串。"
    },
    {
      "indent": 10,
      "text": "On a port basis:",
      "zh-CHS": "以港口为基础："
    },
    {
      "indent": 15,
      "text": "tn3270eSrvrConfIndex value identifying the server tn3270eSrvrPort > 0 tn3270eSrvrPortAddrType unknown(0) tn3270eSrvrPortAddress zero-length octet string.",
      "zh-CHS": "TN3270ESRVRConIndex值标识服务器tn3270eSrvrPort>0 TN3270ESRVROTADDRTYPE未知（0）TN3270ESRVROTADDress零长度八位字节字符串。"
    },
    {
      "indent": 10,
      "text": "On a port-and-local-address basis:",
      "zh-CHS": "根据港口和本地地址："
    },
    {
      "indent": 15,
      "text": "tn3270eSrvrConfIndex value identifying the server tn3270eSrvrPort > 0 tn3270eSrvrPortAddrType valid value other than unknown(0) tn3270eSrvrPortAddress non-zero-length octet string.",
      "zh-CHS": "TN3270ESRVRConIndex值标识服务器tn3270eSrvrPort>0 TN3270ESRVRPortAddressType有效值，未知（0）tn3270eSrvrPortAddress非零长度八位字节字符串除外。"
    },
    {
      "indent": 6,
      "text": " \" INDEX { tn3270eSrvrConfIndex, tn3270eSrvrPort, tn3270eSrvrPortAddrType, tn3270eSrvrPortAddress",
      "zh-CHS": "“索引{tn3270esrvrconindex，tn3270eSrvrPort，tn3270esrvrportaddtype，tn3270eSrvrPortAddress"
    },
    {
      "indent": 6,
      "text": "            }\n::= { tn3270eSrvrStatsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eSrvrStatsEntry ::= SEQUENCE {\n    tn3270eSrvrStatsUpTime          TimeStamp,\n    tn3270eSrvrStatsMaxTerms        Unsigned32,\n    tn3270eSrvrStatsInUseTerms      Gauge32,\n    tn3270eSrvrStatsSpareTerms      Gauge32,\n    tn3270eSrvrStatsMaxPtrs         Unsigned32,\n    tn3270eSrvrStatsInUsePtrs       Gauge32,\n    tn3270eSrvrStatsSparePtrs       Gauge32,\n    tn3270eSrvrStatsInConnects      Counter32,\n    tn3270eSrvrStatsConnResrceRejs  Counter32,\n    tn3270eSrvrStatsDisconnects     Counter32,\n    tn3270eSrvrStatsHCInOctets      Counter64,\n    tn3270eSrvrStatsInOctets        Counter32,\n    tn3270eSrvrStatsHCOutOctets     Counter64,\n    tn3270eSrvrStatsOutOctets       Counter32,\n    tn3270eSrvrStatsConnErrorRejs   Counter32\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsUpTime OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of the sysUpTime object the last time the TN3270E server was re-initialized.",
      "zh-CHS": "TN3270ESRVRSTATSOptime对象类型语法时间戳MAX-ACCESS只读状态当前描述“上次重新初始化TN3270E服务器时sysUpTime对象的值。"
    },
    {
      "indent": 6,
      "text": "    Server re-initialization is the only discontinuity\n    event for the counters in this table.  Even if table\n    entries are on a port or port-and-local-address\n    basis, port deactivation and reactivation do not\n    result in counter discontinuities.\"\n::= { tn3270eSrvrStatsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsMaxTerms OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"LUs\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"Indicates the maximum number of terminal LUs available\n       for use at a TN3270E server for the granularity of this\n       conceptual row (server-wide, port, or\n       port-and-local-address).\"\n    ::= { tn3270eSrvrStatsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsInUseTerms OBJECT-TYPE\n    SYNTAX      Gauge32\n    UNITS       \"LUs\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"Indicates the number of terminal LUs currently in\n       use at a TN3270E server for the granularity of this\n       conceptual row (server-wide, port, or\n       port-and-local-address).\"\n    ::= { tn3270eSrvrStatsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsSpareTerms OBJECT-TYPE SYNTAX Gauge32 UNITS \"LUs\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the number of free terminal LUs at a TN3270E server for the granularity of this conceptual row (server-wide, port, or port-and-local-address).",
      "zh-CHS": "tn3270eSrvrStatsSpareTerms对象类型语法量表32单元“LU”MAX-ACCESS只读状态当前描述“表示TN3270E服务器上此概念行粒度（服务器范围、端口或端口和本地地址）的空闲终端LU数。"
    },
    {
      "indent": 9,
      "text": "It is possible that the difference between tn3270eSrvrStatsMaxTerms and tn3270eSrvrStatsInUseTerms in a conceptual row does not equal the value of tn3270eSrvrStatsSpareTerms in that row: an LU may exist but not be usable by a client connection.",
      "zh-CHS": "概念行中tn3270eSrvrStatsMaxTerms和TN3270ESRVRStatsUseTerms之间的差异可能不等于该行中tn3270eSrvrStatsSpareTerms的值：LU可能存在，但客户端连接无法使用。"
    },
    {
      "indent": 9,
      "text": "Alternatively, the administrative ceiling represented by tn3270eSrvrStatsMaxTerms may have been lowered to a point where it is less than the current value of tn3270eSrvrStatsInUseTerms. In this case tn3270eSrvrStatsSpareTerms returns the value 0.\"",
      "zh-CHS": "或者，tn3270eSrvrStatsMaxTerms表示的管理上限可能已降低到低于tn3270eSrvrStatsMaxTerms当前值的程度。在这种情况下，TN3270ESRVRSTATSPARETERMS返回值0。”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eSrvrStatsEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsMaxPtrs OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"Printer Resources\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"Indicates the maximum number of printer resources\n       available for use by a TN3270E server for the\n       granularity of this conceptual row (server-wide,\n       port, or port-and-local-address).\"\n    ::= { tn3270eSrvrStatsEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsInUsePtrs OBJECT-TYPE\n    SYNTAX      Gauge32\n    UNITS       \"Printer Resources\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"Indicates the number of printer resources\n       currently in use by a TN3270E server for the\n       granularity of this conceptual row (server-wide,\n       port, or port-and-local-address).\"\n    ::= { tn3270eSrvrStatsEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsSparePtrs OBJECT-TYPE SYNTAX Gauge32 UNITS \"Spare Printer Resources\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the number of free printer resources at a TN3270E server for the granularity of this conceptual row (server-wide, port, or port-and-local-address).",
      "zh-CHS": "tn3270eSrvrStatsSparePtrs对象类型语法量表32单元“备用打印机资源”MAX-ACCESS只读状态当前描述“表示TN3270E服务器上此概念行粒度（服务器范围、端口或端口和本地地址）的可用打印机资源数。"
    },
    {
      "indent": 9,
      "text": "It is possible that the difference between tn3270eSrvrStatsMaxPtrs and tn3270eSrvrStatsInUsePtrs in a conceptual row does not equal the value of tn3270eSrvrStatsSparePtrs in that row: a printer resource may exist but not be usable by a client connection.",
      "zh-CHS": "概念行中TN3270ESRVRSTATSMAXPTR和TN3270ESRVRSTATSINUSEPTR之间的差异可能不等于该行中tn3270eSrvrStatsSparePtrs的值：打印机资源可能存在，但客户端连接无法使用。"
    },
    {
      "indent": 6,
      "text": "   Alternatively, the administrative ceiling represented\n   by tn3270eSrvrStatsMaxPtrs may have been lowered to\n   a point where it is less than the current value of\n   tn3270eSrvrStatsInUsePtrs.  In this case\n   tn3270eSrvrStatsSparePtrs returns the value 0.\"\n::= { tn3270eSrvrStatsEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsInConnects OBJECT-TYPE SYNTAX Counter32 UNITS \"connections\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the number of client (TCP) connections that succeeded at a TN3270E server for the granularity of this conceptual row (server-wide, port, or port-and-local-address).",
      "zh-CHS": "tn3270eSrvrStatsInConnects对象类型语法计数器32单元“连接”MAX-ACCESS只读状态当前描述“表示在TN3270E服务器上成功的客户端（TCP）连接数，该连接符合此概念行的粒度（服务器范围、端口或端口和本地地址）。"
    },
    {
      "indent": 9,
      "text": "The tn3270eSrvrStatsConnResrceRejs and",
      "zh-CHS": "TN3270ESRVRSTATSCONNRCEREJS和"
    },
    {
      "indent": 9,
      "text": "tn3270eSrvrStatsConnErrorRejs objects provide a count of failed connection attempts.",
      "zh-CHS": "TN3270ESRVRSTATSCONNERRERREJS对象提供失败连接尝试的计数。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsConnResrceRejs OBJECT-TYPE SYNTAX Counter32 UNITS \"connection attempts\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the number of (TCP) connections rejected during connection setup at a TN3270E server for the granularity of this conceptual row (server-wide, port, or port-and-local-address) due to a lack of resources at the server. An example of when this counter would be incremented is when no terminal or printer resource is available to associate with a client's TCP connection.",
      "zh-CHS": "TN3270ESRVRSTATSCONNRERCEREJS对象类型语法计数器32单元“连接尝试”MAX-ACCESS只读状态当前描述表示在TN3270E服务器上进行连接设置期间，针对此概念行的粒度（服务器范围、端口或端口和本地地址）拒绝的（TCP）连接数由于服务器上缺少资源。例如，当没有终端或打印机资源可用于与客户端的TCP连接关联时，此计数器将增加。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsDisconnects OBJECT-TYPE SYNTAX Counter32 UNITS \"disconnections\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the number of (TCP) connections that were disconnected at a TN3270E server for the granularity of this conceptual row (server-wide, port, or port-and-local-address).",
      "zh-CHS": "tn3270eSrvrStatsDisconnects对象类型语法计数器32单元“disconnections”MAX-ACCESS只读状态当前描述“表示在TN3270E服务器上为此概念行的粒度（服务器范围、端口或端口和本地地址）断开的（TCP）连接数。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsHCInOctets OBJECT-TYPE SYNTAX Counter64 UNITS \"octets\" MAX-ACCESS read-only",
      "zh-CHS": "TN3270ESRVRSTATSHCINOTETS对象类型语法计数器64个单位“八位字节”最大访问只读"
    },
    {
      "indent": 6,
      "text": "STATUS current DESCRIPTION \"Indicates the number of octets received from TN3270 and TN3270E clients for the granularity of this conceptual row (server-wide, port, or port-and-local-address).",
      "zh-CHS": "STATUS current DESCRIPTION“表示从TN3270和TN3270E客户端接收的八位字节数，用于此概念行的粒度（服务器范围、端口或端口和本地地址）。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsInOctets OBJECT-TYPE SYNTAX Counter32 UNITS \"octets\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Low-order 32 bits of tn3270eSrvrStatsHCInOctets for this conceptual row.",
      "zh-CHS": "TN3270ESRVRSTATSIOCTETS对象类型语法计数器32个单位“八位字节”最大访问只读状态当前描述“此概念行的tn3270eSrvrStatsHCInOctets的低32位。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsHCOutOctets OBJECT-TYPE SYNTAX Counter64 UNITS \"octets\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the number of octets sent to TN3270 and TN3270E clients for the granularity of this conceptual row (server-wide, port, or port-and-local-address).",
      "zh-CHS": "TN3270ESRVRSTATSHCOUTCETS对象类型语法计数器64个单位“八位字节”MAX-ACCESS只读状态当前描述“表示发送给TN3270和TN3270E客户机的八位字节数，用于此概念行的粒度（服务器范围、端口或端口和本地地址）。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsOutOctets OBJECT-TYPE SYNTAX Counter32 UNITS \"octets\" MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "tn3270eSrvrStatsOutOctets对象类型语法计数器32个单位“八位字节”最大访问只读状态当前说明"
    },
    {
      "indent": 9,
      "text": "\"Low-order 32 bits of tn3270eSrvrStatsHCOutOctets for this conceptual row.",
      "zh-CHS": "“此概念行的TN3270ESRVRSTATSHCOUTPETS低位32位。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSrvrStatsConnErrorRejs OBJECT-TYPE SYNTAX Counter32 UNITS \"connection attempts\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the number of (TCP) connections rejected during connection setup at a TN3270E server for the granularity of this conceptual row (server-wide, port, or port-and-local-address) due to an error of some type. An example of when this counter would be incremented is when the client and the server cannot agree on a common set of TN3270E functions for the connection.",
      "zh-CHS": "TN3270ESRVRSTATSCONNERRERREJS对象类型语法计数器32单元“连接尝试”MAX-ACCESS只读状态当前描述表示在TN3270E服务器上进行连接设置期间，针对此概念行的粒度（服务器范围、端口或端口和本地地址）拒绝的（TCP）连接数由于某种类型的错误。当客户端和服务器无法就连接的一组通用TN3270E函数达成一致时，此计数器将增加。"
    },
    {
      "indent": 6,
      "text": "   A Management Station can detect discontinuities in\n   this counter by monitoring the tn3270eSrvrStatsUpTime\n   object.\"\n::= { tn3270eSrvrStatsEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eClientGroupEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table defines client address groupings for use by a TN3270E server.",
      "zh-CHS": "tn3270eClientGroupTable对象类型语法序列Tn3270eClientGroupEntry MAX-ACCESS不可访问状态当前描述“此表定义供TN3270E服务器使用的客户端地址分组。"
    },
    {
      "indent": 10,
      "text": "No entry in this table shall exist without a corresponding (same tn3270eSrvrConfIndex) entry in the tn3270eSrvrConfTable existing.",
      "zh-CHS": "如果TN3270ESRVConfTable中没有相应的（相同的TN3270ESRVConfIndex）条目，则本表中的任何条目均不存在。"
    },
    {
      "indent": 6,
      "text": "    An implementation SHOULD NOT retain SNMP-created\n    entries in this table across re-IPLs (Initial Program\n    Loads) of the corresponding TN3270E server.\"\n::= { tn3270eObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupEntry OBJECT-TYPE SYNTAX Tn3270eClientGroupEntry MAX-ACCESS not-accessible",
      "zh-CHS": "tn3270eClientGroupEntry对象类型语法tn3270eClientGroupEntry最大访问权限不可访问"
    },
    {
      "indent": 6,
      "text": "STATUS      current\nDESCRIPTION\n    \"Definition of a single client address entry.  All\n    entries with the same first two indexes,\n    tn3270eSrvrConfIndex and tn3270eClientGroupName, are\n    considered to be in the same client group.\"\nINDEX       { tn3270eSrvrConfIndex,\n              tn3270eClientGroupName,\n              tn3270eClientGroupAddrType,\n              tn3270eClientGroupAddress }\n::= { tn3270eClientGroupTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eClientGroupEntry ::= SEQUENCE {\n    tn3270eClientGroupName           Utf8String,\n    tn3270eClientGroupAddrType       IANATn3270eAddrType,\n    tn3270eClientGroupAddress        IANATn3270eAddress,\n    tn3270eClientGroupSubnetMask     IpAddress,\n    tn3270eClientGroupPfxLength      Unsigned32,\n    tn3270eClientGroupRowStatus      RowStatus\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupName OBJECT-TYPE\n    SYNTAX      Utf8String (SIZE(1..24))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The name of a client group.  Note: client group\n        names are required to be unique only with respect\n        to a single TN3270E server.\"\n    ::= { tn3270eClientGroupEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupAddrType OBJECT-TYPE\n    SYNTAX      IANATn3270eAddrType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Indicates the type of the address represented in\n         tn3270eClientGroupAddress.\"\n    ::= { tn3270eClientGroupEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupAddress OBJECT-TYPE SYNTAX IANATn3270eAddress MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The client address of a member of a client group. The value of tn3270eClientGroupAddrType indicates the address type (IPv4 or IPv6, for example).\"",
      "zh-CHS": "tn3270eClientGroupAddress对象类型语法IANATn3270eAddress MAX-ACCESS不可访问状态当前描述“客户端组成员的客户端地址。tn3270eClientGroupAddrType的值表示地址类型（例如IPv4或IPv6）。”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eClientGroupEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupSubnetMask OBJECT-TYPE SYNTAX IpAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"The corresponding subnet mask associated with tn3270eClientGroupAddress. A single IP address is represented by having this object contain the value of 255.255.255.255.",
      "zh-CHS": "tn3270eClientGroupSubnetMask对象类型语法IpAddress MAX-ACCESS read create STATUS current DESCRIPTION“与tn3270eClientGroupAddress关联的相应子网掩码。单个IP地址表示为该对象包含255.255.255.255的值。"
    },
    {
      "indent": 6,
      "text": "     This object's value is meaningful only if\n     tn3270eClientGroupAddrType has a value of ipv4(1).\"\nDEFVAL { 'FFFFFFFF'H }\n::= { tn3270eClientGroupEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupPfxLength OBJECT-TYPE SYNTAX Unsigned32 (0..128) UNITS \"bits\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The corresponding IPv6 network prefix length.",
      "zh-CHS": "tn3270eClientGroupPfxLength对象类型语法Unsigned32（0..128）单位“bits”MAX-ACCESS read create STATUS current DESCRIPTION“相应的IPv6网络前缀长度。"
    },
    {
      "indent": 6,
      "text": "    This object's value is meaningful only if\n    tn3270eClientGroupAddrType  has a value of ipv6(2).\"\nDEFVAL { 0 }\n::= { tn3270eClientGroupEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientGroupRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted in the tn3270eClientGroupTable. Entries may also be created and deleted as a result of implementation-dependent operations.",
      "zh-CHS": "tn3270eClientGroupRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此对象允许在tn3270eClientGroupTable中创建和删除条目。依赖于实现的操作也可以创建和删除条目。"
    },
    {
      "indent": 6,
      "text": " An entry in this table is deleted by setting this object to destroy(6). When the number of entries in this table for a given client group becomes 0, this has the side-effect of removing any entries for the group in the tn3270eClientResMapTable.\" REFERENCE \"RFC 1903, 'Textual Conventions for version 2 of the Simple Network Management Protocol (SNMPv2).'\"",
      "zh-CHS": "通过将此对象设置为destroy（6），可以删除此表中的条目。当给定客户端组的此表中的条目数变为0时，会产生副作用，即删除tn3270eClientResMapTable中该组的任何条目数。“参考“RFC 1903，简单网络管理协议（SNMPv2）版本2的文本约定。”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eClientGroupEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResPoolTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eResPoolEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table defines resource groupings; the term 'pool' is used as it is defined by RFC 2355.",
      "zh-CHS": "TN3270EREPoolTable对象类型语法序列TN3270EREPoolEntry MAX-ACCESS不可访问状态当前描述“此表定义资源分组；术语“池”按RFC 2355的定义使用。"
    },
    {
      "indent": 10,
      "text": "No entry in this table shall exist without a corresponding (same tn3270eSrvrConfIndex) entry in the tn3270eSrvrConfTable existing.",
      "zh-CHS": "如果TN3270ESRVConfTable中没有相应的（相同的TN3270ESRVConfIndex）条目，则本表中的任何条目均不存在。"
    },
    {
      "indent": 6,
      "text": "    An implementation SHOULD NOT retain SNMP-created\n    entries in this table across re-IPLs (Initial Program\n    Loads) of the corresponding TN3270E server.\"\n::= { tn3270eObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResPoolEntry OBJECT-TYPE\n    SYNTAX      Tn3270eResPoolEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Definition of a single resource pool member.  All entries\n        with the same first two indexes, tn3270eSrvrConfIndex and\n        tn3270eResPoolName, are considered to be in the same pool.\"\n    INDEX  { tn3270eSrvrConfIndex,\n             tn3270eResPoolName,\n             tn3270eResPoolElementName }\n    ::= { tn3270eResPoolTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eResPoolEntry ::= SEQUENCE {\n    tn3270eResPoolName           Utf8String,\n    tn3270eResPoolElementName    SnaResourceName,\n    tn3270eResPoolElementType    IANATn3270ResourceType,\n    tn3270eResPoolRowStatus      RowStatus\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResPoolName OBJECT-TYPE\n    SYNTAX      Utf8String (SIZE(1..24))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The name of a resource pool.\"\n    ::= { tn3270eResPoolEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResPoolElementName OBJECT-TYPE",
      "zh-CHS": "TN3270EREPoolElementName对象类型"
    },
    {
      "indent": 6,
      "text": "SYNTAX      SnaResourceName\nMAX-ACCESS  not-accessible\nSTATUS      current\nDESCRIPTION\n    \"The name of a member of a resource pool.\"\n::= { tn3270eResPoolEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResPoolElementType OBJECT-TYPE\n    SYNTAX      IANATn3270ResourceType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The type of the entity in a resource pool.\"\n    ::= { tn3270eResPoolEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResPoolRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted in the tn3270eResPoolTable. Entries may also be created and deleted as a result of implementation-dependent operations.",
      "zh-CHS": "TN3270EREPoolRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此对象允许在TN3270EREPoolTable中创建和删除条目。依赖于实现的操作也可以创建和删除条目。"
    },
    {
      "indent": 6,
      "text": "    An entry in this table is deleted by setting this object\n    to destroy(6).  When all entries in this table associated\n    with the same tn3270eResPoolElementName have been removed,\n    then any associated (tn3270eResPoolElementName matching\n    tn3270eClientResMapPoolName with same tn3270eSrvrConfIndex\n    values) entries in the tn3270eClientResMapTable SHALL\n    also be removed.\"\nREFERENCE\n    \"RFC 1903, 'Textual Conventions for version 2 of the\n    Simple Network Management Protocol (SNMPv2).'\"\n::= { tn3270eResPoolEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSnaMapTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eSnaMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table provide a mapping from the name by which a secondary LU is known in the SNA network to the name by which it is known locally at the TN3270e server. This latter name serves as an index into the tn3270eResPoolTable and the tn3270eResMapTable.",
      "zh-CHS": "Tn3270eSnaMapEntry MAX-ACCESS的tn3270eSnaMapTable对象类型语法序列不可访问状态当前描述“此表提供了从SNA网络中已知辅助LU的名称到TN3270e服务器上已知辅助LU的本地名称的映射。后一个名称用作TN3270eSpoolTable和TN3270eResMasptable的索引。"
    },
    {
      "indent": 6,
      "text": "    No entry in this table shall exist without\n    a corresponding (same tn3270eSrvrConfIndex) entry in\n    the tn3270eSrvrConfTable existing.\"\n::= { tn3270eObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSnaMapEntry OBJECT-TYPE SYNTAX Tn3270eSnaMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Definition of a single mapping from an SSCP-supplied SLU name to a local SLU name.",
      "zh-CHS": "tn3270eSnaMapEntry对象类型语法tn3270eSnaMapEntry MAX-ACCESS不可访问状态当前描述“从SSCP提供的SLU名称到本地SLU名称的单个映射的定义”。"
    },
    {
      "indent": 6,
      "text": "    Note:  In certain pathological cases, it is possible\n    that an SSCP will send on an ACTLU for a local LU an\n    SLU name currently represented by an entry in this\n    table that associates it with a different local LU.\n    In these cases the association from the newer ACTLU\n    SHOULD be the one represented in this table.\"\nINDEX  { tn3270eSrvrConfIndex,\n         tn3270eSnaMapSscpSuppliedName }\n::= { tn3270eSnaMapTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eSnaMapEntry ::= SEQUENCE {\n    tn3270eSnaMapSscpSuppliedName     SnaResourceName,\n    tn3270eSnaMapLocalName            SnaResourceName,\n    tn3270eSnaMapPrimaryLuName        SnaResourceName\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSnaMapSscpSuppliedName OBJECT-TYPE\n    SYNTAX      SnaResourceName\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The name of the secondary LU (SLU) as it is known in\n         the SNA network.  This name is sent by the SSCP on\n         the Activate Logical Unit (ACTLU) request.\"\n    ::= { tn3270eSnaMapEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSnaMapLocalName OBJECT-TYPE\n    SYNTAX      SnaResourceName\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The local name of the secondary LU (SLU).\"\n    ::= { tn3270eSnaMapEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSnaMapPrimaryLuName OBJECT-TYPE",
      "zh-CHS": "tn3270eSnaMapPrimaryLuName对象类型"
    },
    {
      "indent": 6,
      "text": "SYNTAX   SnaResourceName\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n    \"When there is a currently active LU-LU session for\n    this connection, this object returns the primary LU\n    (PLU) name from the BIND.  When there is no active\n    LU-LU session, or when the PLU name is unavailable\n    for some other reason, this object returns a\n    zero-length octet string.\"\n::= { tn3270eSnaMapEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientResMapTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eClientResMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table defines resource-pool to client-group mappings. Since both the resource pool name and client group name are included in the index clause of this table, multiple resource pools can be assigned to the same client group. This enables use of multiple resource pools for use in client to resource mapping. Assigning multiple client groups to the same resource pool is also allowed, but is not the primary purpose for how the indexing is structured.",
      "zh-CHS": "tn3270eClientResMapTable对象类型语法序列Tn3270eClientResMapEntry MAX-ACCESS不可访问状态当前说明“此表定义了资源池到客户端组的映射。由于资源池名称和客户机组名称都包含在此表的index子句中，因此可以将多个资源池分配给同一客户机组。这允许在客户端到资源映射中使用多个资源池。还允许将多个客户端组分配给同一资源池，但这不是索引结构的主要目的。"
    },
    {
      "indent": 10,
      "text": "Assignment of a resource pool to client group can be restricted based on TCP port. An index value of 0 for tn3270eClientResMapClientPort disables restriction of resource assignment based on client target port selection.",
      "zh-CHS": "可以根据TCP端口限制将资源池分配给客户端组。tn3270eClientResMapClientPort的索引值为0将禁用基于客户端目标端口选择的资源分配限制。"
    },
    {
      "indent": 10,
      "text": "No entry in this table shall exist without a corresponding (same tn3270eSrvrConfIndex) entry in the tn3270eSrvrConfTable existing.",
      "zh-CHS": "如果TN3270ESRVConfTable中没有相应的（相同的TN3270ESRVConfIndex）条目，则本表中的任何条目均不存在。"
    },
    {
      "indent": 6,
      "text": "    An implementation SHOULD NOT retain SNMP-created\n    entries in this table across re-IPLs (Initial Program\n    Loads) of the corresponding TN3270E server.\"\n::= { tn3270eObjects 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientResMapEntry OBJECT-TYPE SYNTAX Tn3270eClientResMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Definition of a single resource pool to client group",
      "zh-CHS": "tn3270eClientResMapEntry对象类型语法tn3270eClientResMapEntry MAX-ACCESS不可访问状态当前描述“客户端组的单个资源池的定义”"
    },
    {
      "indent": 6,
      "text": "    mapping.\"\nINDEX  { tn3270eSrvrConfIndex,\n         tn3270eClientResMapPoolName,\n         tn3270eClientResMapClientGroupName,\n         tn3270eClientResMapClientPort }\n::= { tn3270eClientResMapTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eClientResMapEntry ::= SEQUENCE {\n    tn3270eClientResMapPoolName           Utf8String,\n    tn3270eClientResMapClientGroupName    Utf8String,\n    tn3270eClientResMapClientPort         Unsigned32,\n    tn3270eClientResMapRowStatus          RowStatus\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientResMapPoolName OBJECT-TYPE\n    SYNTAX      Utf8String (SIZE(1..24))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The name of a resource pool.\"\n    ::= { tn3270eClientResMapEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientResMapClientGroupName OBJECT-TYPE\n    SYNTAX      Utf8String (SIZE(1..24))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The name of the client group that is mapped to a\n         resource pool.\"\n    ::= { tn3270eClientResMapEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientResMapClientPort OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..65535)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"A port number restricting the scope of a mapping\n        from a resource pool to a client group.  The\n        value 0 for this object indicates that the scope\n        of the mapping is not restricted.\"\n    ::= { tn3270eClientResMapEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eClientResMapRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted",
      "zh-CHS": "tn3270eClientResMapRowStatus对象类型语法RowStatus MAX-ACCESS读取创建状态当前描述“此对象允许创建和删除条目"
    },
    {
      "indent": 10,
      "text": "in the tn3270eClientResMapTable. Entries may also be created and deleted as a result of implementation-dependent operations.",
      "zh-CHS": "在tn3270eClientResMapTable中。由于依赖于实现的操作，也可能创建和删除条目。"
    },
    {
      "indent": 6,
      "text": "    An entry in this table is deleted by setting this object\n    to destroy(6).  Removing an entry from this table doesn't\n    affect any other table entry defined in this MIB.\"\nREFERENCE\n    \"RFC 1903, 'Textual Conventions for version 2 of the\n    Simple Network Management Protocol (SNMPv2).'\"\n::= { tn3270eClientResMapEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eResMapEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table defines the actual mapping of a resource to a client address.",
      "zh-CHS": "Tn3270eResMapEntry MAX-ACCESS的Tn3270eResMapEntry可接受对象类型语法序列不可访问状态当前描述“此表定义了资源到客户端地址的实际映射。"
    },
    {
      "indent": 6,
      "text": "    No entry in this table shall exist without\n    a corresponding (same tn3270eSrvrConfIndex) entry in\n    the tn3270eSrvrConfTable existing.\"\n::= { tn3270eObjects 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapEntry OBJECT-TYPE\n    SYNTAX      Tn3270eResMapEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Definition of the mapping of a Resource Element to\n         a client address.\"\n    INDEX  { tn3270eSrvrConfIndex,\n             tn3270eResMapElementName }\n    ::= { tn3270eResMapTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eResMapEntry ::= SEQUENCE {\n    tn3270eResMapElementName       SnaResourceName,\n    tn3270eResMapAddrType          IANATn3270eAddrType,\n    tn3270eResMapAddress           IANATn3270eAddress,\n    tn3270eResMapPort              Unsigned32,\n    tn3270eResMapElementType       IANATn3270ResourceType,\n    tn3270eResMapSscpSuppliedName  SnaResourceName\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapElementName OBJECT-TYPE SYNTAX SnaResourceName MAX-ACCESS not-accessible",
      "zh-CHS": "tn3270eResMapElementName对象类型语法SnaResourceName MAX-ACCESS不可访问"
    },
    {
      "indent": 6,
      "text": "STATUS      current\nDESCRIPTION\n    \"The name of a resource element.  This is the name by\n    which the server implementing this table knows the\n    resource.  It may be different from the name by which\n    the resource is known in the SNA network.  This latter\n    name is returned in the tn3270eResMapSscpSuppliedName\n    object.\"\n::= { tn3270eResMapEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapAddrType OBJECT-TYPE\n    SYNTAX      IANATn3270eAddrType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"Indicates the type of the client address represented\n        in tn3270eResMapAddress.\"\n    ::= { tn3270eResMapEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapAddress OBJECT-TYPE\n    SYNTAX      IANATn3270eAddress\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"A client address.\"\n    ::= { tn3270eResMapEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapPort OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..65535)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"A client port.\"\n    ::= { tn3270eResMapEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapElementType OBJECT-TYPE\n    SYNTAX      IANATn3270ResourceType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The type of the associated resource element.\"\n    ::= { tn3270eResMapEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapSscpSuppliedName OBJECT-TYPE SYNTAX SnaResourceName MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "TN3270ERESMAPSSCSuppliedName对象类型语法SnaResourceName MAX-ACCESS只读状态当前说明"
    },
    {
      "indent": 6,
      "text": "    \"The name of the secondary LU (SLU) as it is known\n    in a SNA network.  This name is sent by the SSCP on\n    the Activate Logical Unit (ACTLU) request.  If this\n    name is not known, this object returns a zero-length\n    octet string.\"\n::= { tn3270eResMapEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "-- Define the set of objects to supplement the TCP Connection Table",
      "zh-CHS": "--定义对象集以补充TCP连接表"
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnTable OBJECT-TYPE SYNTAX SEQUENCE OF Tn3270eTcpConnEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table has an entry for each TN3270(E) client connection that is currently active at a TN3270E server. An implementation MAY retain entries for connections that have been terminated, but which entries are retained, how many entries are retained, and how long they are retained is entirely implementation-dependent.",
      "zh-CHS": "TN3270ETCPCONNTRABLE TN3270ETCPCONNTRABLE对象类型语法TN3270ETCPCONNTRY MAX-ACCESS not ACCESS not ACCESS STATUS current DESCRIPTION“此表中每个TN3270（E）都有一个条目当前在TN3270E服务器上处于活动状态的客户端连接。实现可能会保留已终止连接的条目，但保留哪些条目、保留多少条目以及保留多长时间完全取决于实现。"
    },
    {
      "indent": 6,
      "text": "     The indexing for this table is designed to support the\n     use of an SNMP GET-NEXT operation using only the remote\n     address type, remote address, and remote port, as a way\n     for a Management Station to retrieve the table entries\n     related to a particular TN3270(E) client.\"\n::= { tn3270eObjects 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnEntry OBJECT-TYPE SYNTAX Tn3270eTcpConnEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Provides information about a single TN3270/TN3270E session. Note: a tn3270eSrvrConfIndex is not needed in this table, since the combination of remote and local addresses and ports is sufficient to guarantee uniqueness across the TN3270E servers serviced by an SNMP agent. Because of this indexing structure, however, this table does not support view-based access control policies that provide access to table rows on a per-server basis.\" INDEX { tn3270eTcpConnRemAddrType, tn3270eTcpConnRemAddress, tn3270eTcpConnRemPort, tn3270eTcpConnLocalAddrType, tn3270eTcpConnLocalAddress, tn3270eTcpConnLocalPort",
      "zh-CHS": "TN3270ETCPCONNTRY对象类型语法TN3270ETCPCONNTRY MAX-ACCESS不可访问状态当前说明“提供有关单个TN3270/TN3270E会话的信息。注意：此表中不需要TN3270ESRVRECONDEX，因为远程和本地地址及端口的组合足以保证SNMP代理服务的TN3270E服务器的唯一性。但是，由于这种索引结构，此表不支持基于视图的访问控制策略，这些策略在每台服务器的基础上提供对表行的访问。“索引{TN3270ETCPCONNRAMDRETYPE，TN3270ETCPCONNRAMDRESS，tn3270eTcpConnRemPort，tn3270eTcpConnLocalAddrType，tn3270eTcpConnLocalAddress，tn3270eTcpConnLocalPort"
    },
    {
      "indent": 6,
      "text": "      }\n::= { tn3270eTcpConnTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Tn3270eTcpConnEntry ::=\n    SEQUENCE\n    {\n    tn3270eTcpConnRemAddrType          IANATn3270eAddrType,\n    tn3270eTcpConnRemAddress           IANATn3270eAddress,\n    tn3270eTcpConnRemPort              Unsigned32,\n    tn3270eTcpConnLocalAddrType        IANATn3270eAddrType,\n    tn3270eTcpConnLocalAddress         IANATn3270eAddress,\n    tn3270eTcpConnLocalPort            Unsigned32,\n    tn3270eTcpConnLastActivity         TimeTicks,\n    tn3270eTcpConnBytesIn              Counter32,\n    tn3270eTcpConnBytesOut             Counter32,\n    tn3270eTcpConnResourceElement      SnaResourceName,\n    tn3270eTcpConnResourceType         IANATn3270ResourceType,\n    tn3270eTcpConnDeviceType           IANATn3270DeviceType,\n    tn3270eTcpConnFunctions            IANATn3270Functions,\n    tn3270eTcpConnId                   Unsigned32,\n    tn3270eTcpConnClientIdFormat       IANATn3270eClientType,\n    tn3270eTcpConnClientId             OCTET STRING,\n    tn3270eTcpConnTraceData            Tn3270eTraceData,\n    tn3270eTcpConnLogInfo              IANATn3270eLogData,\n    tn3270eTcpConnLuLuBindImage        OCTET STRING,\n    tn3270eTcpConnSnaState             INTEGER,\n    tn3270eTcpConnStateLastDiscReason  INTEGER,\n    tn3270eTcpConnSrvrConfIndex        Unsigned32,\n    tn3270eTcpConnActivationTime       TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnRemAddrType OBJECT-TYPE\n    SYNTAX   IANATn3270eAddrType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Indicates the type of the value of the\n        tn3270eTcpConnRemAddress object.  For example,\n        ipv4(1) or ipv6(2).\"\n    ::= { tn3270eTcpConnEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnRemAddress OBJECT-TYPE SYNTAX IANATn3270eAddress MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The remote address associated with a TN3270E client. tn3270eTcpConnRemAddrType indicates the address type",
      "zh-CHS": "tn3270eTcpConnRemAddress对象类型语法IANATN3270EADRESS MAX-ACCESS不可访问状态当前描述“与TN3270E客户端关联的远程地址。TN3270ETCPConnRemAddressType指示地址类型"
    },
    {
      "indent": 11,
      "text": "(IPv4 or IPv6, for example).",
      "zh-CHS": "（例如，IPv4或IPv6）。"
    },
    {
      "indent": 6,
      "text": "     If a TN3270(E) client is connected to its\n     server via a proxy client the address represented by\n     the value of this object shall be the remote client's\n     address, not the proxy client's address.\"\n::= { tn3270eTcpConnEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnRemPort OBJECT-TYPE SYNTAX Unsigned32 (0..65535) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The remote port associated with a TN3270E client. The value 0 is used if the tn3270eTcpConnRemAddrType identifies an address type that does not support ports.",
      "zh-CHS": "tn3270eTcpConnRemPort对象类型语法Unsigned32（0..65535）MAX-ACCESS不可访问状态当前描述“与TN3270E客户端关联的远程端口。如果TN3270ETCPConnRemAddressType标识不支持端口的地址类型，则使用值0。"
    },
    {
      "indent": 6,
      "text": "    If a TN3270(E) client is connected to its server via a proxy\n    client, the port represented by the value of this object shall\n    be the remote client's port, not the proxy client's port.\"\n::= { tn3270eTcpConnEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnLocalAddrType OBJECT-TYPE\n    SYNTAX   IANATn3270eAddrType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Indicates the type of the value of the\n        tn3270eTcpConnLocalAddress object.  For example,\n        ipv4(1) or ipv6(2).\"\n    ::= { tn3270eTcpConnEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnLocalAddress OBJECT-TYPE\n    SYNTAX      IANATn3270eAddress\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The local address associated with a TN3270E client.\n         tn3270eTcpConnRemAddrType indicates the address type\n         (IPv4 or IPv6, for example).\"\n    ::= { tn3270eTcpConnEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnLocalPort OBJECT-TYPE SYNTAX Unsigned32 (1..65535) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The remote port associated with a TN3270E client.\"",
      "zh-CHS": "tn3270eTcpConnLocalPort对象类型语法Unsigned32（1..65535）MAX-ACCESS不可访问状态当前描述“与TN3270E客户端关联的远程端口”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eTcpConnEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnLastActivity OBJECT-TYPE\n    SYNTAX   TimeTicks\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of 100ths of seconds since any data was\n         transferred for the associated TCP Connection.\"\n    DEFVAL  { 0 }\n    ::= { tn3270eTcpConnEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnBytesIn OBJECT-TYPE SYNTAX Counter32 UNITS \"octets\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of bytes received by the server from TCP for this connection.",
      "zh-CHS": "tn3270eTcpConnBytesIn对象类型语法计数器32个单位“八位字节”MAX-ACCESS只读状态当前描述“服务器为此连接从TCP接收的字节数。"
    },
    {
      "indent": 6,
      "text": "    A Management Station can detect discontinuities in\n    this counter by monitoring the\n    tn3270eTcpConnActivationTime object.\"\n::= { tn3270eTcpConnEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnBytesOut OBJECT-TYPE SYNTAX Counter32 UNITS \"octets\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of bytes sent to TCP for this connection.",
      "zh-CHS": "tn3270eTcpConnBytesOut对象类型语法计数器32个单位“八位字节”MAX-ACCESS只读状态当前描述“为此连接发送到TCP的字节数”。"
    },
    {
      "indent": 6,
      "text": "    A Management Station can detect discontinuities in\n    this counter by monitoring the\n    tn3270eTcpConnActivationTime object.\"\n::= { tn3270eTcpConnEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnResourceElement OBJECT-TYPE\n    SYNTAX   SnaResourceName\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"LU/Print secondary name for connecting an client\n         into an SNA network.\"\n    ::= { tn3270eTcpConnEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnResourceType OBJECT-TYPE\n    SYNTAX   IANATn3270ResourceType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"Indicates the type of resource identified by\n         tn3270eTcpConnResourceElement.\"\n    ::= { tn3270eTcpConnEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnDeviceType OBJECT-TYPE\n    SYNTAX   IANATn3270DeviceType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"Indicates the device type if negotiated with the\n        client.  A value of unknown(100) should be used as\n        the value of this object when a device type is not\n        negotiated.  Refer to RFC 2355 for how device types\n        can be negotiated.\"\n    ::= { tn3270eTcpConnEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnFunctions OBJECT-TYPE SYNTAX IANATn3270Functions MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates which of the TN3270 and TN3270E functions were negotiated by the server and the client for this TCP connection.",
      "zh-CHS": "tn3270eTcpConnFunctions对象类型语法IANATn3270Functions MAX-ACCESS只读状态当前描述“此对象表示服务器和客户端为此TCP连接协商了TN3270和TN3270E函数中的哪些。"
    },
    {
      "indent": 6,
      "text": "    Refer to tn3270eSrvrFunctionsSupported for the list of\n    these functions supported by the server.\"\n::= { tn3270eTcpConnEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnId OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The connection identifier associated with a TN3270 or a TN3270E session's TCP connection. TCP implementations often assign a unique (with respect to itself) unsigned integer as an identifier for a TCP connection.",
      "zh-CHS": "tn3270eTcpConnId对象类型语法Unsigned32 MAX-ACCESS只读状态当前描述“与TN3270或TN3270E会话的TCP连接关联的连接标识符。TCP实现通常将唯一（相对于自身）无符号整数指定为TCP连接的标识符。"
    },
    {
      "indent": 6,
      "text": "     The value 0 indicates that a connection does not have\n     a valid connection identifier.\"\n::= { tn3270eTcpConnEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnClientIdFormat OBJECT-TYPE\n    SYNTAX      IANATn3270eClientType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The format of a corresponding tn3270eTcpConnClientId\n        object as defined by the IANSTn3270eClientType textual\n        convention imported from the IANATn3270eTC-MIB.\"\n    ::= { tn3270eTcpConnEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnClientId OBJECT-TYPE SYNTAX OCTET STRING (SIZE (0..512)) MAX-ACCESS read-only STATUS current DESCRIPTION \"Additional client identification information. The type of this information is indicated by the value of the corresponding tn3270eTcpConnClientIdFormat object. All values are returned in network-byte order.",
      "zh-CHS": "TN3270ETCPCONNCCLIENTID对象类型语法八位字节字符串（大小（0..512））MAX-ACCESS只读状态当前描述“其他客户端标识信息。此信息的类型由相应TN3270ETCPCONNCCLIENTDFORMAT对象的值指示。所有值均以网络字节顺序返回。"
    },
    {
      "indent": 6,
      "text": "    The purpose of this object is to provide an alternate\n    means of identifying a client, other than though the\n    remote address returned in tn3270eTcpConnRemAddress.\"\n::= { tn3270eTcpConnEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnTraceData OBJECT-TYPE\n    SYNTAX   Tn3270eTraceData\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"Trace data for this session.\"\n    ::= { tn3270eTcpConnEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnLogInfo OBJECT-TYPE\n    SYNTAX      IANATn3270eLogData\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"Log information, encoded as specified in the\n        IANATn3270eLogData textual convention from the\n        IANAtn3270eTC-MIB.\"\n    ::= { tn3270eTcpConnEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnLuLuBindImage OBJECT-TYPE SYNTAX OCTET STRING (SIZE (0..256)) MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "tn3270eTcpConnLuLuBindImage对象类型语法八位字节字符串（大小（0..256））最大访问只读状态当前说明"
    },
    {
      "indent": 6,
      "text": "    \"When there is a currently active LU-LU session for\n    this connection, this object returns the BIND Image\n    (defined to be bytes 1-p of the complete BIND Request\n    Unit -- see 'SNA Formats' for more information)\n    that was received from the PLU during session\n    activation.  When there is no active LU-LU session,\n    or when a BIND image is unavailable for some other\n    reason, this object returns a zero-length octet\n    string.\"\nREFERENCE\n    \"'Systems Network Architecture Formats', IBM\n    Publication GA27-3136.\"\n::= { tn3270eTcpConnEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnSnaState  OBJECT-TYPE\n    SYNTAX   INTEGER {\n                   unknown(1),\n                   noSluSession(2),\n                   sscpLuSession(3),  -- but no LU-LU session\n                   luLuSession(4),    -- but no SSCP-LU session\n                   sscpLuSessionAndLuLuSession(5)\n                      }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The current state of the SNA side of the end-to-end\n        TN3270 connection.  The following states are defined:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "unknown(1) - The true state is not known. noSluSession(2) - The SLU has neither an SSCP-LU nor an LU-LU session active. sscpLuSession(3) - The SSCP-LU session for the SLU is active, but the SLU is not currently in session with a PLU. luLuSession(4) - The SLU is currently in session with a PLU, but the SSCP-LU session for the LU is not active. sscpLuSessionAndLuLuSession(5) - The SLU currently has an active session with a PLU, and the SSCP-LU session for the SLU is active.\"",
      "zh-CHS": "未知（1）-真实状态未知。无中断（2）-SLU既没有SSCP-LU也没有LU-LU会话处于活动状态。SSCP-LU会话（3）-SLU的SSCP-LU会话处于活动状态，但SLU当前未与PLU进行会话。luLuSession（4）-SLU当前正在与PLU进行会话，但该LU的SSCP-LU会话未激活。sscpLuSessionAndLuLuSession（5）-SLU当前有一个与PLU的活动会话，并且SLU的SSCP-LU会话处于活动状态。”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eTcpConnEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnStateLastDiscReason OBJECT-TYPE SYNTAX INTEGER { unknown(1), hostSendsUnbind(2),",
      "zh-CHS": "tn3270eTcpConnStateLastDiscReason对象类型语法整数{未知（1），hostSendsUnbind（2），"
    },
    {
      "indent": 6,
      "text": "              hostDontAcceptConnection(3),\n              outOfResource(4),\n              clientProtocolError(5),\n              invalidDeviceName(6),\n              deviceInUse(7),\n              inactivityTimeout(8),\n              hostNotResponding(9),\n              clientNotResponding(10),\n              serverClose(11),\n              sysreqLogoff(12),\n              serverSpecificHexCode(13)\n                 }\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n    \"The last disconnect reason.  A session that has not\n    experienced a disconnect shall use the value unknown(1)\n    for this object.  Depending on when an implementation\n    removes entries from this table, certain states may\n    never be returned.\"\n::= { tn3270eTcpConnEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnSrvrConfIndex OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"tn3270eSrvrConfIndex of the tn3270eSrvrConfEntry\n        belonging to the TN3270E server to which this entry\n        belongs.\"\n    ::= { tn3270eTcpConnEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eTcpConnActivationTime OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of the sysUpTime object the last time\n        this TCP connection became active.\"\n    ::= { tn3270eTcpConnEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eConfSpinLock OBJECT-TYPE SYNTAX TestAndIncr MAX-ACCESS read-write STATUS current DESCRIPTION \"An advisory lock used to allow cooperating TN3270E-MIB applications to coordinate their use",
      "zh-CHS": "tn3270eConfSpinLock对象类型语法TestAndIncr MAX-ACCESS读写状态当前描述“用于允许协作的TN3270E-MIB应用程序协调其使用的建议锁"
    },
    {
      "indent": 8,
      "text": "of the tn3270eSrvrConfTable, the tn3270eSrvrPortTable, the tn3270eClientGroupTable, the tn3270eResPoolTable, and the tn3270eClientResMapTable.",
      "zh-CHS": "TN3270ESRVRCONTable、tn3270eSrvrPortTable、tn3270eClientGroupTable、TN3270eSpoolTable和tn3270eClientResMapTable。"
    },
    {
      "indent": 8,
      "text": "When creating a new entry or altering an existing entry in the any of the tables mentioned above, an application should make use of tn3270eRtSpinLock to serialize application changes or additions.",
      "zh-CHS": "在上述任何表中创建新条目或更改现有条目时，应用程序应使用tn3270eRtSpinLock序列化应用程序更改或添加。"
    },
    {
      "indent": 6,
      "text": "  Since this is an advisory lock, the use of this lock is\n  not enforced.\"\n::= { tn3270eObjects 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "-- Conformance Definitions",
      "zh-CHS": "--一致性定义"
    },
    {
      "indent": 2,
      "text": "tn3270eGroups      OBJECT IDENTIFIER ::= { tn3270eConformance 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eCompliances OBJECT IDENTIFIER ::= { tn3270eConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "-- compliance statements",
      "zh-CHS": "--合规声明"
    },
    {
      "indent": 2,
      "text": "tn3270eCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for agents that support the TN3270E-MIB.\" MODULE -- this module MANDATORY-GROUPS { tn3270eBasicGroup, tn3270eSessionGroup } GROUP tn3270eResMapGroup DESCRIPTION \"This group is optional and provides a method of performing tn3270eClientGroup to tn3270eResPool mapping.\"",
      "zh-CHS": "tn3270eCompliance MODULE-COMPLIANCE STATUS当前描述“支持TN3270E-MIB的代理的符合性声明”。模块--此模块强制-GROUPS{tn3270eBasicGroup，tn3270eSessionGroup}组tn3270eResMapGroup描述“此组是可选的，提供了执行tn3270eClientGroup到TN3270eSpool映射的方法。”"
    },
    {
      "indent": 10,
      "text": "GROUP tn3270eHiCapacityGroup DESCRIPTION \"This group is optional and provides for support of high capacity counters.\"",
      "zh-CHS": "组tn3270eHiCapacityGroup DESCRIPTION“此组是可选的，用于支持高容量计数器。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eSrvrConfConnectivityChk MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support a set to this object if the associated TN3270E server doesn't support either TIMING-MARK or NOP processing. In this case an agent should return noCheck on",
      "zh-CHS": "对象TN3270ESRVRConnectionvitychk MIN-ACCESS只读说明“如果关联的TN3270E服务器不支持计时标记或NOP处理，则代理不需要支持此对象的集合。在这种情况下，代理应返回noCheck on"
    },
    {
      "indent": 17,
      "text": "retrieval.\"",
      "zh-CHS": "检索。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eSrvrConfTmNopInactTime MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support a set to this object if the functions enabled by tn3270eSrvrConfConnectivityChk are not supported. An agent in this case should return a value of 0.\"",
      "zh-CHS": "对象TN3270ESRVReconfTMNoPincTTIME MIN-ACCESS只读说明“如果不支持TN3270ESRVReconfConnectivityHK启用的函数，则代理不需要支持此对象的集合。在这种情况下，代理应返回值0。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eSrvrConfTmNopInterval MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support a set to this object if the functions enabled by tn3270eSrvrConfConnectivityChk are not supported. An agent in this case should return a value of 0.\"",
      "zh-CHS": "对象TN3270ESRVReconfTMNopInterval MIN-ACCESS只读说明“如果不支持TN3270ESRVReconfConnectionyChk启用的函数，则代理不需要支持此对象的集合。在这种情况下，代理应返回值0。”"
    },
    {
      "indent": 9,
      "text": "OBJECT tn3270eSrvrConfAdminStatus DESCRIPTION \"A TN3270E server is not required to support a stopImmediate state transition.\"",
      "zh-CHS": "对象TN3270ESRVReconAdminStatus描述“不需要TN3270E服务器来支持stopImmediate状态转换。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eSrvrConfRowStatus MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象TN3270ESRVReconRowStatus最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eSrvrConfTmTimeout MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support a set to this object if the functions enabled by tn3270eSrvrConfConnectivityChk are not supported. An agent in this case should return a value of 0.\"",
      "zh-CHS": "对象TN3270ESRVReconfTMTimeout MIN-ACCESS只读说明“如果不支持TN3270ESRVReconfConnectionyChk启用的功能，则代理不需要支持对此对象的设置。在这种情况下，代理应返回值0。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eSrvrPortRowStatus MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象tn3270eSrvrPortRowStatus MIN-ACCESS只读描述“不需要写访问。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eClientGroupRowStatus MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象tn3270eClientGroupRowStatus最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eResPoolRowStatus MIN-ACCESS read-only",
      "zh-CHS": "对象TN3270EREBoolRowStatus最小访问只读"
    },
    {
      "indent": 13,
      "text": "DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "说明“不需要写访问权限。”"
    },
    {
      "indent": 10,
      "text": "OBJECT tn3270eClientResMapRowStatus MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象tn3270eClientResMapRowStatus最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "-- units of conformance",
      "zh-CHS": "--一致性单位"
    },
    {
      "indent": 2,
      "text": "tn3270eBasicGroup OBJECT-GROUP\n    OBJECTS {\n        tn3270eSrvrConfInactivityTimeout,\n        tn3270eSrvrConfConnectivityChk,\n        tn3270eSrvrConfTmNopInactTime,\n        tn3270eSrvrConfTmNopInterval,\n        tn3270eSrvrFunctionsSupported,\n        tn3270eSrvrConfAdminStatus,\n        tn3270eSrvrConfOperStatus,\n        tn3270eSrvrConfSessionTermState,\n        tn3270eSrvrConfSrvrType,\n        tn3270eSrvrConfContact,\n        tn3270eSrvrConfRowStatus,\n        tn3270eSrvrConfLastActTime,\n        tn3270eSrvrConfTmTimeout,\n        tn3270eSrvrPortRowStatus,\n        tn3270eSrvrStatsUpTime,\n        tn3270eSrvrStatsMaxTerms,\n        tn3270eSrvrStatsInUseTerms,\n        tn3270eSrvrStatsSpareTerms,\n        tn3270eSrvrStatsMaxPtrs,\n        tn3270eSrvrStatsInUsePtrs,\n        tn3270eSrvrStatsSparePtrs,\n        tn3270eSrvrStatsInConnects,\n        tn3270eSrvrStatsConnResrceRejs,\n        tn3270eSrvrStatsDisconnects,\n        tn3270eSrvrStatsInOctets,\n        tn3270eSrvrStatsOutOctets,\n        tn3270eSrvrStatsConnErrorRejs,\n        tn3270eClientGroupSubnetMask,\n        tn3270eClientGroupPfxLength,\n        tn3270eClientGroupRowStatus,\n        tn3270eSnaMapLocalName,\n        tn3270eSnaMapPrimaryLuName,\n        tn3270eConfSpinLock\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "STATUS  current\nDESCRIPTION\n    \"This group is mandatory for all hosts supporting the\n     TN3270E-MIB.\"\n::= { tn3270eGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eSessionGroup OBJECT-GROUP\n    OBJECTS {\n        tn3270eResMapAddrType,\n        tn3270eResMapAddress,\n        tn3270eResMapPort,\n        tn3270eResMapElementType,\n        tn3270eResMapSscpSuppliedName,\n        tn3270eTcpConnLastActivity,\n        tn3270eTcpConnBytesIn,\n        tn3270eTcpConnBytesOut,\n        tn3270eTcpConnResourceElement,\n        tn3270eTcpConnResourceType,\n        tn3270eTcpConnDeviceType,\n        tn3270eTcpConnFunctions,\n        tn3270eTcpConnSrvrConfIndex,\n        tn3270eTcpConnActivationTime\n      }\n    STATUS  current\n    DESCRIPTION\n        \"This group is mandatory for all hosts supporting the\n         TN3270E-MIB.\"\n    ::= { tn3270eGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eResMapGroup OBJECT-GROUP\n    OBJECTS {\n        tn3270eResPoolElementType,\n        tn3270eResPoolRowStatus,\n        tn3270eClientResMapRowStatus,\n        tn3270eTcpConnId,\n        tn3270eTcpConnClientIdFormat,\n        tn3270eTcpConnClientId,\n        tn3270eTcpConnTraceData,\n        tn3270eTcpConnLogInfo,\n        tn3270eTcpConnLuLuBindImage,\n        tn3270eTcpConnSnaState,\n        tn3270eTcpConnStateLastDiscReason\n      }\n    STATUS  current\n    DESCRIPTION\n        \"This group is optional for all hosts supporting the\n         TN3270E-MIB.\"\n    ::= { tn3270eGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "tn3270eHiCapacityGroup OBJECT-GROUP\n    OBJECTS {\n        tn3270eSrvrStatsHCInOctets,\n        tn3270eSrvrStatsHCOutOctets\n      }\n    STATUS  current\n    DESCRIPTION\n         \"Support of these objects is REQUIRED when the\n         Counter32 versions can potentially wrap too\n         frequently.  This group is optional for all other\n         hosts supporting the TN3270E-MIB.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "The IF-MIB (RFC 2233) requires that the 64-bit versions of its counters be implemented when an interface can support rates of around 20 million bits per second or greater. This implies a minimum wrap rate of just over 28 minutes. It is recommended that this same guideline be used for determining whether an implementation implements these objects.",
      "zh-CHS": "IF-MIB（RFC 2233）要求在接口支持每秒约2000万位或更高的速率时实现64位版本的计数器。这意味着最低包裹率略高于28分钟。建议使用相同的准则来确定实现是否实现这些对象。"
    },
    {
      "indent": 11,
      "text": "This group contains two objects with the syntax Counter64. An implementation that doesn't support these objects should return noSuchObject, since returning a zero is misleading.\"",
      "zh-CHS": "此组包含两个语法为Counter64的对象。不支持这些对象的实现应返回noSuchObject，因为返回零会产生误导。”"
    },
    {
      "indent": 6,
      "text": "::= { tn3270eGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "5.0 Security Considerations",
      "section_title": true,
      "zh-CHS": "5.0 安全考虑"
    },
    {
      "indent": 3,
      "text": "Certain management information defined in this MIB may be considered sensitive in some network environments. Therefore, authentication of received SNMP requests and controlled access to management information SHOULD be employed in such environments. An authentication protocol is defined in [12]. A protocol for access control is defined in [15].",
      "zh-CHS": "在某些网络环境中，此MIB中定义的某些管理信息可能被视为敏感信息。因此，在这样的环境中，应该对接收到的SNMP请求进行身份验证，并控制对管理信息的访问。[12]中定义了认证协议。[15]中定义了访问控制协议。"
    },
    {
      "indent": 3,
      "text": "Several objects in this MIB allow write access or provide for row creation. Allowing this support in a non-secure environment can have a negative effect on network operations. It is RECOMMENDED that implementers seriously consider whether set operations or row creation should be allowed without providing, at a minimum, authentication of request origin. It is RECOMMENDED that without such support, the following objects be implemented as read-only:",
      "zh-CHS": "此MIB中的多个对象允许写访问或提供行创建。在不安全的环境中允许这种支持可能会对网络操作产生负面影响。建议实施者认真考虑是否应该允许设置操作或行创建，而不至少提供请求源的身份验证。建议在没有此类支持的情况下，将以下对象实现为只读："
    },
    {
      "indent": 3,
      "text": "o tn3270eSrvrConfInactivityTimout o tn3270eSrvrConfConnectivityChk o tn3270eSrvrConfActivityTimeout o tn3270eSrvrConfActivityInterval o tn3270eSrvrConfAdminStatus o tn3270eSrvrConfSessionTermState o tn3270eSrvrConfContact o tn3270eClientGroupSubnetMask o tn3270eResPoolElementType o tn3270eSrvrConfRowStatus o tn3270eSrvrPortRowStatus o tn3270eClientGroupRowStatus o tn3270eResPoolRowStatus o tn3270eResMapRowStatus",
      "zh-CHS": "o TN3270ESRVReconfictivityMout o TN3270ESRVReconfictivityCHK o TN3270ESRVReconfictivity超时o TN3270ESRVReconfictivity间隔o TN3270ESRVReconfictivity管理状态o TN3270ESRVReconficationTermState o TN3270ESRVReconfiction联系人o tn3270eClientGroupSubnetMask o TN3270E后台元素类型o TN3270ESRVReconfictivityStatus o TN3270ESRVorRowStatus o TN3270ESRPortRowStatus otn3270eClientGroupRowStatus o TN3270EREPoolRowStatus o tn3270eResMapRowStatus"
    },
    {
      "indent": 3,
      "text": "For all tables in the MIB except the tn3270eTcpConnTable, the first index identifies an individual TN3270E server. This makes it easy to implement an access control policy under which different principals have access to objects related to different servers. Implementation of such a policy is not possible for the entries in the tn3270eTcpConTable.",
      "zh-CHS": "对于MIB中除tn3270eTcpConnTable之外的所有表，第一个索引标识单个TN3270E服务器。这使得实现访问控制策略变得很容易，在该策略下，不同的主体可以访问与不同服务器相关的对象。对于tn3270eTcpConTable中的条目，无法执行此类策略。"
    },
    {
      "indent": 0,
      "text": "6.0 Intellectual Property",
      "section_title": true,
      "zh-CHS": "6.0 知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF Secretariat.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何努力来确定任何此类权利。有关IETF在标准跟踪和标准相关文件中权利的程序信息，请参见BCP-11。可从IETF秘书处获得可供发布的权利声明副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涉及实施本标准所需技术的专有权利。请将信息发送给IETF执行董事。"
    },
    {
      "indent": 0,
      "text": "7.0 Acknowledgments",
      "section_title": true,
      "zh-CHS": "7.0 致谢"
    },
    {
      "indent": 3,
      "text": "This document is a product of the TN3270E Working Group. Thanks to Randy Presuhn of BMC Software for his valuable review comments on several versions of the document.",
      "zh-CHS": "本文件是TN3270E工作组的产品。感谢BMC软件公司的Randy Presohn对多个版本的文档发表了宝贵的评论。"
    },
    {
      "indent": 0,
      "text": "8.0 References",
      "section_title": true,
      "zh-CHS": "8.0 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Harrington D., Presuhn, R. and B. Wijnen, \"An Architecture for Describing SNMP Management Frameworks\", RFC 2271, January 1998.",
      "zh-CHS": "[1] Harrington D.，Presohn，R.和B.Wijnen，“描述SNMP管理框架的体系结构”，RFC 2271，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[2] Rose, M. and K. McCloghrie, \"Structure and Identification of Management Information for TCP/IP-based Internets\", STD 16, RFC 1155, May 1990",
      "zh-CHS": "[2] Rose，M.和K.McCloghrie，“基于TCP/IP的互联网管理信息的结构和识别”，STD 16，RFC 1155，1990年5月"
    },
    {
      "indent": 3,
      "text": "[3] Rose, M. and K. McCloghrie, \"Concise MIB Definitions\", STD 16, RFC 1212, March 1991.",
      "zh-CHS": "[3] Rose，M.和K.McCloghrie，“简明MIB定义”，STD 16，RFC 1212，1991年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Rose, M., \"A Convention for Defining Traps for use with the SNMP\", RFC 1215, Performance Systems International, March 1991",
      "zh-CHS": "[4] Rose，M.“定义用于SNMP的陷阱的约定”，RFC 1215，性能系统国际，1991年3月"
    },
    {
      "indent": 3,
      "text": "[5] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Structure of Management Information for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1902, January 1996.",
      "zh-CHS": "[5] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的管理信息结构”，RFC 1902，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Textual Conventions for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1903, January 1996.",
      "zh-CHS": "[6] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的文本约定”，RFC 1903，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[7] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Conformance Statements for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1904, January 1996.",
      "zh-CHS": "[7] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的一致性声明”，RFC 1904，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[8] Case, J., Fedor, M., Schoffstall, M. and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "zh-CHS": "[8] Case，J.，Fedor，M.，Schoffstall，M.和J.Davin，“简单网络管理协议”，STD 15，RFC 1157，1990年5月。"
    },
    {
      "indent": 3,
      "text": "[9] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Introduction to Community-based SNMPv2\", RFC 1901, January 1996.",
      "zh-CHS": "[9] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“基于社区的SNMPv2简介”，RFC 19011996年1月。"
    },
    {
      "indent": 3,
      "text": "[10] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Transport Mappings for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1906, January 1996.",
      "zh-CHS": "[10] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的传输映射”，RFC 1906，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[11] Case, J., Harrington D., Presuhn R. and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2272, January 1998.",
      "zh-CHS": "[11] Case，J.，Harrington D.，Presuhn R.和B.Wijnen，“简单网络管理协议（SNMP）的消息处理和调度”，RFC 22721998年1月。"
    },
    {
      "indent": 3,
      "text": "[12] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2274, January 1998.",
      "zh-CHS": "[12] Blumenthal，U.和B.Wijnen，“简单网络管理协议（SNMPv3）第3版的基于用户的安全模型（USM）”，RFC 22741998年1月。"
    },
    {
      "indent": 3,
      "text": "[13] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Protocol Operations for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1905, January 1996.",
      "zh-CHS": "[13] Case，J.，McCloghrie，K.，Rose，M.和S.Waldbusser，“简单网络管理协议（SNMPv2）版本2的协议操作”，RFC 1905，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[14] Levi, D., Meyer, P. and B. Stewart, \"SNMPv3 Applications\", RFC 2273, January 1998.",
      "zh-CHS": "[14] Levi，D.，Meyer，P.和B.Stewart，“SNMPv3应用”，RFC 22731998年1月。"
    },
    {
      "indent": 3,
      "text": "[15] Wijnen, B., Presuhn, R. and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", RFC 2275, January 1998.",
      "zh-CHS": "[15] Wijnen，B.，Presuhn，R.和K.McCloghrie，“用于简单网络管理协议（SNMP）的基于视图的访问控制模型（VACM）”，RFC 22751998年1月。"
    },
    {
      "indent": 3,
      "text": "[16] Postel, J. and J. Reynolds, \"Telnet Protocol Specification\", STD 8, RFC 854, May 1983.",
      "zh-CHS": "[16] Postel，J.和J.Reynolds，“Telnet协议规范”，STD 8，RFC 854，1983年5月。"
    },
    {
      "indent": 3,
      "text": "[17] Postel, J. and J. Reynolds, \"Telnet Timing Mark Option\", STD 31, RFC 860, May 1983.",
      "zh-CHS": "[17] Postel，J.和J.Reynolds，“Telnet定时标记选项”，STD 31，RFC 860，1983年5月。"
    },
    {
      "indent": 3,
      "text": "[18] Rekhter, J., \"Telnet 3270 Regime Option\", RFC 1041, January 1988.",
      "zh-CHS": "[18] Rekhter，J.，“Telnet 3270体制选择”，RFC 10411988年1月。"
    },
    {
      "indent": 3,
      "text": "[19] Kelly, B., \"TN3270 Enhancements\", RFC 2355, June 1998.",
      "zh-CHS": "[19] Kelly，B.，“TN3270增强”，RFC 23551998年6月。"
    },
    {
      "indent": 8,
      "text": "[20] McCloghrie, K., \"TCP-MIB Definitions\", RFC 2012, November 1996.",
      "zh-CHS": "[20] McCloghrie，K.，“TCP-MIB定义”，RFC 2012，1996年11月。"
    },
    {
      "indent": 3,
      "text": "[21] Hovey, R. and S. Bradner, \"The Organizations Involved in the IETF Standards Process\", BCP 11, RFC 2028, October 1996.",
      "zh-CHS": "[21] Hovey，R.和S.Bradner，“参与IETF标准过程的组织”，BCP 11，RFC 2028，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[22] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[22] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[23] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "zh-CHS": "[23] Hinden，R.和S.Deering，“IP版本6寻址体系结构”，RFC 23731998年7月。"
    },
    {
      "indent": 3,
      "text": "[24] Krupczak, C. and J. Saperia, \"Definitions of System-Level Managed Objects for Applications\", RFC 2287, February 1998.",
      "zh-CHS": "[24] Krupczak，C.和J.Saperia，“应用程序系统级托管对象的定义”，RFC 2287，1998年2月。"
    },
    {
      "indent": 0,
      "text": "9.0 Authors' Addresses",
      "section_title": true,
      "zh-CHS": "9.0 作者地址"
    },
    {
      "indent": 3,
      "text": "Kenneth D. White Dept. BRQA/Bldg. 501/G114 IBM Corporation P.O.Box 12195 3039 Cornwallis Research Triangle Park, NC 27709, USA",
      "zh-CHS": "Kenneth D.White部门BRQA/Bldg.501/G114 IBM公司邮箱12195 3039美国北卡罗来纳州康沃利斯三角研究园，邮编27709"
    },
    {
      "indent": 3,
      "text": "EMail: kennethw@vnet.ibm.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Robert Moore Dept. BRQA/Bldg. 501/G114 IBM Corporation P.O.Box 12195 3039 Cornwallis Research Triangle Park, NC 27709, USA",
      "zh-CHS": "美国北卡罗来纳州康沃利斯研究三角公园12195 3039号IBM公司信箱501/G114号楼BRQA/BRQA部门"
    },
    {
      "indent": 3,
      "text": "Phone: +1-919-254-4436\nEMail: remoore@us.ibm.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（1999年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    }
  ]
}