{
  "title": {
    "text": "RFC 3192:  Minimal FAX address format in Internet Mail ",
    "zh-CHS": "RFC 3192"
  },
  "number": 3192,
  "created_at": "2021-10-26 05:40:52.263588+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       C. Allocchio\nRequest for Comments: 3192                                    GARR-Italy\nObsoletes: 2304                                             October 2001\nUpdates: 2846\nCategory: Standards Track",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Minimal FAX address format in Internet Mail",
      "zh-CHS": "Internet邮件中的最小传真地址格式"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo describes a simple method of encoding Global Switched Telephone Network (GSTN) addresses of facsimile devices in the local-part of Internet email addresses.",
      "zh-CHS": "本备忘录描述了在互联网电子邮件地址的本地部分对传真设备的全球交换电话网络（GSTN）地址进行编码的简单方法。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As with all Internet mail addresses, the left-hand-side (local-part) of an address generated according to this specification, is not to be interpreted except by the MTA that is named on the right-hand-side (domain).",
      "zh-CHS": "与所有Internet邮件地址一样，根据本规范生成的地址的左侧（本地部分）不可解释，除非由右侧（域）命名的MTA解释。"
    },
    {
      "indent": 3,
      "text": "Since the very first e-mail to fax gateway objects appeared, a number of different methods to specify a fax address as an e-mail address have been used by implementors. Several objectives for this methods have been identified, like to enable an e-mail user to send and receive faxes from his/her e-mail interface, to allow some kind of \"fax over e-mail service\" transport (possibly reducing the costs of GSTN long distance transmissions) while using the existing e-mail infrastructure.",
      "zh-CHS": "自从第一个电子邮件到传真网关对象出现以来，实现者使用了许多不同的方法来指定传真地址作为电子邮件地址。已经确定了这种方法的几个目标，如使电子邮件用户能够从其电子邮件接口发送和接收传真，允许某种“电子邮件传真服务”传输（可能降低GSTN远程传输的成本），同时使用现有的电子邮件基础设施。"
    },
    {
      "indent": 3,
      "text": "This memo describes the MINIMAL addressing method and standard extensions to encode FAX addresses into e-mail addresses, as required in reference [13]. The opposite problem, i.e., to allow a traditional numeric-only fax device user to access the e-mail transport service, is not discussed here.",
      "zh-CHS": "本备忘录描述了参考文献[13]中要求的将传真地址编码为电子邮件地址的最小寻址方法和标准扩展。此处不讨论相反的问题，即允许传统的仅数字传真设备用户访问电子邮件传输服务。"
    },
    {
      "indent": 3,
      "text": "These IANA forms used to register the standard elements defined here are given in the \"IANA Considerations\" chapter (section 7 of this document).",
      "zh-CHS": "“IANA注意事项”一章（本文件第7节）中给出了用于注册此处定义的标准元素的IANA表格。"
    },
    {
      "indent": 3,
      "text": "All implementations supporting FAX over e-mail address format MUST support this minimal specification.",
      "zh-CHS": "所有支持传真电子邮件地址格式的实现都必须支持此最低规范。"
    },
    {
      "indent": 0,
      "text": "1.1 Terminology and Syntax conventions",
      "section_title": true,
      "zh-CHS": "1.1 术语和语法约定"
    },
    {
      "indent": 3,
      "text": "In this document the formal definitions are described using ABNF syntax, as defined into [7]. We will also use some of the \"CORE DEFINITIONS\" defined in \"APPENDIX A - CORE\" of that document. The exact meaning of the capitalized words",
      "zh-CHS": "在本文档中，使用[7]中定义的ABNF语法描述正式定义。我们还将使用该文件“附录A-核心”中定义的一些“核心定义”。大写单词的确切含义"
    },
    {
      "indent": 6,
      "text": "\"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", \"OPTIONAL\"",
      "zh-CHS": "“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“推荐”、“可”、“可选”"
    },
    {
      "indent": 3,
      "text": "is defined in reference [6].",
      "zh-CHS": "定义见参考文献[6]。"
    },
    {
      "indent": 3,
      "text": "In this document the following new terms are also defined:",
      "zh-CHS": "本文件还定义了以下新术语："
    },
    {
      "indent": 6,
      "text": "I-fax device: an I-pstn device type [13] which is able to communicate either directly or indirectly with the traditional FAX over GSTN service;",
      "zh-CHS": "I-fax设备：I-pstn设备类型[13]，能够通过GSTN服务直接或间接与传统传真通信；"
    },
    {
      "indent": 6,
      "text": "mta-I-fax: the Internet domain name which identifies uniquely an I-fax device over the Internet (see also mta-I-pstn in [13]);",
      "zh-CHS": "mta-I-fax：唯一标识Internet上I-fax设备的Internet域名（另请参见[13]中的mta-I-pstn）；"
    },
    {
      "indent": 6,
      "text": "fax-email: the complete Internet e-mail address structure which is used to transport a FAX address over the Internet e-mail service (see also pstn-email in [13]).",
      "zh-CHS": "传真电子邮件：完整的Internet电子邮件地址结构，用于通过Internet电子邮件服务传输传真地址（另见[13]中的pstn电子邮件）。"
    },
    {
      "indent": 0,
      "text": "2. Minimal Fax address",
      "section_title": true,
      "zh-CHS": "2. 最小传真地址"
    },
    {
      "indent": 3,
      "text": "The minimal fax address within e-mail has been defined for consistency with reference [13] and it contains two elements: the fax-mbox and an optional qualif-type1 element.",
      "zh-CHS": "电子邮件中的最小传真地址已定义为与参考文献[13]一致，它包含两个元素：传真mbox和可选的qualif-type1元素。"
    },
    {
      "indent": 3,
      "text": "More precisely the GSTN minimal address specification requires the use of a unique service-selector for each specific application (section 2 in [13]).",
      "zh-CHS": "更准确地说，GSTN最小地址规范要求为每个特定应用使用唯一的服务选择器（见[13]第2节）。"
    },
    {
      "indent": 3,
      "text": "The \"service-selector\" defined for the fax service is as follows:",
      "zh-CHS": "为传真服务定义的“服务选择器”如下所示："
    },
    {
      "indent": 6,
      "text": "service-selector = \"FAX\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "In the syntax for the fax address a qualif-type1 element has been defined for support of T.30/T.33 subaddresses (see section 2 of [13]). The use of this element is OPTIONAL, but compliant implementations MUST be able to support and correctly interpret it when present. Its definition is as follows:",
      "zh-CHS": "在传真地址的语法中，定义了一个qualif-type1元素以支持T.30/T.33子地址（见[13]第2节）。此元素的使用是可选的，但是兼容的实现必须能够支持并正确解释它。其定义如下："
    },
    {
      "indent": 6,
      "text": "qualif-type1 = \"/\" t33-sep \"=\" sub-addr",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where",
      "zh-CHS": "哪里"
    },
    {
      "indent": 6,
      "text": "t33-sep = \"T33S\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "sub-addr = 1*( DIGIT )",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Thus, the minimal specification of a fax in e-mail address is:",
      "zh-CHS": "因此，传真电子邮件地址的最低规格为："
    },
    {
      "indent": 6,
      "text": "fax-address = fax-mbox [ \"/T33S=\" sub-addr ]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "fax-mbox = \"FAX=\" global-phone",
      "zh-CHS": "传真mbox=“传真=“全球电话"
    },
    {
      "indent": 3,
      "text": "Notes:",
      "zh-CHS": "笔记："
    },
    {
      "indent": 6,
      "text": "For the case of a single subaddress, only numbers are allowed in <sub-addr> which is consistent with T.30, T.33, and this document. While T.30 and T.33 use SPACE to pad its field, padding isn't necessary in the <sub-addr> field defined by this document.",
      "zh-CHS": "对于单个子地址的情况，<sub addr>中只允许数字，这与T.30、T.33和本文档一致。虽然T.30和T.33使用空格填充其字段，但在本文档定义的<sub addr>字段中不需要填充。"
    },
    {
      "indent": 6,
      "text": "For the case of multiple subaddresses, T.33 specifies the \"#\" character be used to specify multiple subaddreses. However, only digits are permitted in the <sub-addr> field defined by this document. Refer to section 4.1 in case multiple <sub-addr> per per <fax-mbox> need to be specified.",
      "zh-CHS": "对于多个子地址的情况，T.33指定用于指定多个子地址的“#”字符。但是，本文档定义的<sub addr>字段中只允许使用数字。如果需要指定多个<sub addr>每个<fax mbox>，请参阅第4.1节。"
    },
    {
      "indent": 3,
      "text": "The Minimal supported syntax for global-phone (as described in section 2.1 of reference [13]) is:",
      "zh-CHS": "全球电话支持的最低语法（如参考文献[13]第2.1节所述）为："
    },
    {
      "indent": 3,
      "text": "global-phone = \"+\" 1*( DIGIT / written-sep )",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "written-sep = ( \"-\" / \".\" )",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Refer to section 2.1 in [13] for other important considerations about the global-phone element.",
      "zh-CHS": "有关全局电话元素的其他重要注意事项，请参阅[13]中的第2.1节。"
    },
    {
      "indent": 0,
      "text": "2.2 Some examples of a minimal \"fax-address\"",
      "section_title": true,
      "zh-CHS": "2.2 最小“传真地址”的一些示例"
    },
    {
      "indent": 3,
      "text": "Some examples of minimal fax-address follows:",
      "zh-CHS": "以下是最小传真地址的一些示例："
    },
    {
      "indent": 6,
      "text": "FAX=+3940226338",
      "zh-CHS": "传真：+3940226338"
    },
    {
      "indent": 6,
      "text": "FAX=+12027653000/T33S=1387",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "FAX=+33-1-88335215",
      "zh-CHS": "传真=+33-1-88335215"
    },
    {
      "indent": 3,
      "text": "Note:",
      "zh-CHS": "注:"
    },
    {
      "indent": 6,
      "text": "the examples shown are just for illustration purposes.",
      "zh-CHS": "所示示例仅用于说明目的。"
    },
    {
      "indent": 0,
      "text": "3. The e-mail address of the I-fax device: mta-I-fax",
      "section_title": true,
      "zh-CHS": "3. I-fax设备的电子邮件地址：mta-I-fax"
    },
    {
      "indent": 3,
      "text": "An \"I-fax device\" has, among its characteristics, a unique Internet domain name which identifies it on the Internet. Within Internet mail, this is the Right Hand Side (RHS) part of the address, i.e., the part on the right of the \"@\" sign. For purposes of this document we will call this \"mta-I-fax\"",
      "zh-CHS": "“I-fax设备”的特点之一是具有唯一的互联网域名，可在互联网上识别该设备。在Internet mail中，这是地址的右侧（RHS）部分，即“@”符号右侧的部分。在本文件中，我们称之为“mta-I-fax”"
    },
    {
      "indent": 6,
      "text": "mta-I-fax = domain",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For \"domain\" strings used in SMTP transmissions, the string MUST conform to the requirements of that standards <domain> specifications [1], [3]. For \"domain\" strings used in message content headers, the string MUST conform to the requirements of the relevant standards [2], [3].",
      "zh-CHS": "对于SMTP传输中使用的“域”字符串，该字符串必须符合该标准<domain>规范[1]、[3]的要求。对于消息内容头中使用的“域”字符串，该字符串必须符合相关标准[2]、[3]的要求。"
    },
    {
      "indent": 3,
      "text": "Note:",
      "zh-CHS": "注:"
    },
    {
      "indent": 6,
      "text": "the use of \"domain names\" or \"domain literals\" is permitted in addresses in both the SMTP envelope and message header fields.",
      "zh-CHS": "SMTP信封和邮件头字段中的地址都允许使用“域名”或“域文字”。"
    },
    {
      "indent": 0,
      "text": "4. The fax-email",
      "section_title": true,
      "zh-CHS": "4. 传真电子邮件"
    },
    {
      "indent": 3,
      "text": "The complete structure used to transfer a minimal FAX address over the Internet e-mail transport system is called \"fax-email\". This object is a an e-mail address which conforms to [2] and [3] \"addr-spec\" syntax, with structure refinements which allows the FAX number to be identified.",
      "zh-CHS": "用于通过Internet电子邮件传输系统传输最小传真地址的完整结构称为“传真电子邮件”。此对象是一个符合[2]和[3]“addr spec”语法的电子邮件地址，具有允许识别传真号码的结构改进。"
    },
    {
      "indent": 3,
      "text": "fax-email = [\"\"\"] [\"/\"] fax-address [\"/\"] [\"\"\"] \"@\" mta-I-fax",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Implementors' note:",
      "zh-CHS": "实施者注意："
    },
    {
      "indent": 6,
      "text": "The optional \"/\" characters can result from translations from other transport gateways (such as some X.400 gateways) which have included the \"/\" as an optional element. Implementations MUST accept the optional slashes but SHOULD NOT generate them. Gateways are allowed to strip them off when converting to Internet",
      "zh-CHS": "可选“/”字符可能来自其他传输网关（例如一些X.400网关）的翻译，这些网关将“/”作为可选元素。实现必须接受可选的斜杠，但不应生成它们。在转换到Internet时，允许网关将其剥离"
    },
    {
      "indent": 6,
      "text": "mail addressing. The relevant standard [2], [3] define exactly when the optional \"quotes\" characters surrounding the entire local part (i.e., the part on the left of the \"@\" character into the fax-email) MUST be added.",
      "zh-CHS": "邮件地址。相关标准[2]、[3]明确规定了何时必须添加围绕整个本地部分的可选“引号”字符（即传真电子邮件中“@”字符左侧的部分）。"
    },
    {
      "indent": 0,
      "text": "4.1 Multiple subaddresses",
      "section_title": true,
      "zh-CHS": "4.1 多个子地址"
    },
    {
      "indent": 3,
      "text": "There are some instances in GSTN applications where multiple subaddresses are used: T.33 subaddresses in fax service are one of these cases. In e-mail practice a separate and unique e-mail address is always used for each recipient; as such, if multiple T.33 subaddresses are present, the use of multiple \"fax-email\" elements is REQUIRED.",
      "zh-CHS": "GSTN应用程序中有一些使用多个子地址的实例：传真服务中的T.33子地址就是其中之一。在电子邮件实践中，每个收件人始终使用一个单独且唯一的电子邮件地址；因此，如果存在多个T.33子地址，则需要使用多个“传真电子邮件”元素。"
    },
    {
      "indent": 3,
      "text": "Implementors' note:",
      "zh-CHS": "实施者注意："
    },
    {
      "indent": 6,
      "text": "The UA MAY accept multiple subaddress elements for the same global-phone, but it MUST generate multiple \"fax-mbox\" elements when submitting the message to the MTA.",
      "zh-CHS": "UA可以为同一个全局电话接受多个子地址元素，但在向MTA提交邮件时必须生成多个“传真mbox”元素。"
    },
    {
      "indent": 0,
      "text": "4.2 Some examples of minimal \"fax-email\"",
      "section_title": true,
      "zh-CHS": "4.2 最小“传真电子邮件”的一些示例"
    },
    {
      "indent": 6,
      "text": "Some examples of minimal fax-email addresses follows:",
      "zh-CHS": "以下是一些最小传真电子邮件地址的示例："
    },
    {
      "indent": 6,
      "text": "FAX=+3940226338@faxworld.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "FAX=+12027653000/T33S=1387@faxworld.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "/FAX=+33-1-88335215/@faxworld.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note:",
      "zh-CHS": "注:"
    },
    {
      "indent": 6,
      "text": "the examples shown are just for illustration purposes.",
      "zh-CHS": "所示示例仅用于说明目的。"
    },
    {
      "indent": 0,
      "text": "5. Conclusion",
      "section_title": true,
      "zh-CHS": "5. 结论"
    },
    {
      "indent": 3,
      "text": "This proposal creates a minimal standard encoding for FAX addresses within the global e-mail transport system. The proposal is consistent with existing e-mail standards.",
      "zh-CHS": "该提案为全球电子邮件传输系统内的传真地址创建了最低标准编码。该提案符合现有的电子邮件标准。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document specifies a means by which FAX addresses can be encoded into e-mail addresses. Since e-mail routing is determined by Domain Name System (DNS) data, a successful attack to DNS could disseminate tampered information, which causes e-mail messages to be diverted via some MTA or Gateway where the security of the software has been compromised.",
      "zh-CHS": "本文件规定了将传真地址编码为电子邮件地址的方法。由于电子邮件路由由域名系统（DNS）数据决定，对DNS的成功攻击可能会传播被篡改的信息，从而导致电子邮件通过某些MTA或网关转移，而这些MTA或网关的软件安全性已受到损害。"
    },
    {
      "indent": 3,
      "text": "There are several means by which an attacker might be able to deliver incorrect mail routing information to a client. These include: (a) compromise of a DNS server, (b) generating a counterfeit response to a client's DNS query, (c) returning incorrect \"additional information\" in response to an unrelated query. Clients SHOULD ensure that mail routing is based only on authoritative answers. Once DNS Security mechanisms [5] become more widely deployed, clients SHOULD employ those mechanisms to verify the authenticity and integrity of mail routing records.",
      "zh-CHS": "攻击者可以通过多种方式向客户端发送错误的邮件路由信息。这些措施包括：（a）DNS服务器受损，（b）对客户端DNS查询生成伪造响应，（c）对不相关查询返回不正确的“附加信息”。客户端应确保邮件路由仅基于权威答案。一旦DNS安全机制[5]得到更广泛的部署，客户端应该使用这些机制来验证邮件路由记录的真实性和完整性。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA registration forms for \"FAX\" service-selector and \"T33S\" qualif-type1 elements are defined here. These forms update the previous registration forms defined in [15].",
      "zh-CHS": "此处定义了“传真”服务选择器和“T33S”qualif-type1要素的IANA登记表。这些表格更新了[15]中定义的以前的登记表格。"
    },
    {
      "indent": 0,
      "text": "7.1 IANA Registration form for updated value of GSTN address service-selector \"FAX\"",
      "zh-CHS": "7.1 GSTN地址服务选择器“传真”更新值的IANA登记表"
    },
    {
      "indent": 3,
      "text": "To: IANA@iana.org Subject: Registration of updated values for the GSTN address service-selector specifier \"FAX\"",
      "zh-CHS": "致：IANA@iana.org主题：注册GSTN地址服务选择器说明符“传真”的更新值"
    },
    {
      "indent": 3,
      "text": "service-selector name:",
      "zh-CHS": "服务选择器名称："
    },
    {
      "indent": 6,
      "text": "FAX",
      "zh-CHS": "传真"
    },
    {
      "indent": 3,
      "text": "Description of Use:",
      "zh-CHS": "使用说明："
    },
    {
      "indent": 6,
      "text": "FAX - specify that the GSTN address refers either to an Internet Fax device, or an onramp/offramp Fax gateway.",
      "zh-CHS": "传真-指定GSTN地址指的是Internet传真设备或入口/出口传真网关。"
    },
    {
      "indent": 6,
      "text": "For a complete description refer to RFC 3192 and RFC 3191.",
      "zh-CHS": "有关完整说明，请参阅RFC 3192和RFC 3191。"
    },
    {
      "indent": 3,
      "text": "Security Considerations:",
      "zh-CHS": "安全考虑："
    },
    {
      "indent": 6,
      "text": "See the Security Consideration section of RFC 3192.",
      "zh-CHS": "参见RFC 3192的安全考虑部分。"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "zh-CHS": "联系人和电子邮件地址，以获取更多信息："
    },
    {
      "indent": 3,
      "text": "Claudio Allocchio INFN-GARR c/o Sincrotrone Trieste SS 14 Km 163.5 Basovizza I 34012 Trieste Italy",
      "zh-CHS": "Claudio Allocchio INFN-GARR c/o Sincrotrone Trieste SS 14 Km意大利的里雅斯特Basovizza I 34012"
    },
    {
      "indent": 3,
      "text": "RFC2822: Claudio.Allocchio@garr.it\nX.400:   C=it;A=garr;P=garr;S=Allocchio;G=Claudio;\nPhone:   +39 040 3758523\nFax:     +39 040 3758565",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7.2 IANA Registration form for updated value of GSTN address qualit-type1 keyword \"T33S\" and value",
      "zh-CHS": "7.2 GSTN地址qualit-type1关键字“T33S”和值更新值IANA登记表"
    },
    {
      "indent": 3,
      "text": "To: IANA@iana.org Subject: Registration of updated values for the GSTN address qualif-type1 element \"T33S\"",
      "zh-CHS": "致：IANA@iana.org主题：注册GSTN地址qualif-type1元素“T33S”的更新值"
    },
    {
      "indent": 3,
      "text": "qualif-type1 \"keyword\" name:",
      "zh-CHS": "qualif-type1“关键字”名称："
    },
    {
      "indent": 6,
      "text": "T33S",
      "zh-CHS": "T33S"
    },
    {
      "indent": 3,
      "text": "qualif-type1 \"value\" ABNF definition:",
      "zh-CHS": "qualif-type1“值”ABNF定义："
    },
    {
      "indent": 6,
      "text": "sub-addr = 1*( DIGIT )",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Description of Use:",
      "zh-CHS": "使用说明："
    },
    {
      "indent": 6,
      "text": "T33S is used to specify the numeric only optional fax sub-address element described in \"ITU T.33 - Facsimile routing utilizing the subaddress; recommendation T.33 (July, 1996)\". Further detailed description is available in RFC 3192.",
      "zh-CHS": "T33S用于指定“ITU T.33-使用子地址的传真路由；建议T.33（1996年7月）”中描述的仅数字可选传真子地址元素。RFC 3192中提供了进一步的详细说明。"
    },
    {
      "indent": 3,
      "text": "Use Restriction:",
      "zh-CHS": "使用限制："
    },
    {
      "indent": 6,
      "text": "The use of \"T33S\" is restricted to \"FAX\" service-selector, is it has no meaning outside the fax service.",
      "zh-CHS": "“T33S”的使用仅限于“传真”服务选择器，因为它在传真服务之外没有任何意义。"
    },
    {
      "indent": 3,
      "text": "Security Considerations:",
      "zh-CHS": "安全考虑："
    },
    {
      "indent": 6,
      "text": "See the Security Consideration section of RFC 3192.",
      "zh-CHS": "参见RFC 3192的安全考虑部分。"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "zh-CHS": "联系人和电子邮件地址，以获取更多信息："
    },
    {
      "indent": 6,
      "text": "Claudio Allocchio INFN-GARR c/o Sincrotrone Trieste SS 14 Km 163.5 Basovizza I 34012 Trieste Italy",
      "zh-CHS": "Claudio Allocchio INFN-GARR c/o Sincrotrone Trieste SS 14 Km意大利的里雅斯特Basovizza I 34012"
    },
    {
      "indent": 6,
      "text": "RFC2822: Claudio.Allocchio@garr.it\nX.400:   C=it;A=garr;P=garr;S=Allocchio;G=Claudio;\nPhone:   +39 040 3758523\nFax:     +39 040 3758565",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. Changes since RFC 2304 specification",
      "section_title": true,
      "zh-CHS": "8. 自RFC 2304规范以来的变化"
    },
    {
      "indent": 3,
      "text": "Although there are no major or technical changes from RFC 2304 specification, this section briefly describes where updates and clarifications were introduced:",
      "zh-CHS": "尽管RFC 2304规范没有重大或技术变更，但本节简要介绍了更新和澄清的内容："
    },
    {
      "indent": 3,
      "text": "- considering the case that telephony systems do not conform any more to the \"single/few\" Public Operator paradigm, the old definition \"PSTN - Public Switched Telephone Network\" was changed into the more adequate \"GSTN - Global Switched Telephone Network\" one. However, in order to remain consistent with the previous specification, the ABNF variables names were not changed.",
      "zh-CHS": "- 考虑到电话系统不再符合“单一/少数”公共运营商模式的情况，旧的“PSTN-公共交换电话网络”定义被更改为更合适的“GSTN-全球交换电话网络”定义。但是，为了与先前的规范保持一致，ABNF变量名称没有更改。"
    },
    {
      "indent": 3,
      "text": "- section 7 \"IANA Considerations\" and the IANA registration forms for the \"FAX\" \"service-selector\" and for the \"T33S\" \"qualif-type1\" elements were added;",
      "zh-CHS": "- 增加了第7节“IANA注意事项”以及“传真”“服务选择器”和“T33S”“qualif-type1”要素的IANA登记表；"
    },
    {
      "indent": 3,
      "text": "- an explicit list of \"new terms\" with explanations was added to section 1.1;",
      "zh-CHS": "- 在第1.1节中增加了一份带有解释的“新术语”的明确清单；"
    },
    {
      "indent": 3,
      "text": "- the case when multiple T.33 subaddresses are present was described more explicitly in order to clarify how to handle them (section 4.1);",
      "zh-CHS": "- 更明确地描述了存在多个T.33子地址的情况，以阐明如何处理它们（第4.1节）；"
    },
    {
      "indent": 3,
      "text": "- in section 3 the language describing \"mta-I-fax\" was updated to better describe its relationship with an Internet Mail address;",
      "zh-CHS": "- 第3节更新了描述“mta-I-fax”的语言，以更好地描述其与互联网邮件地址的关系；"
    },
    {
      "indent": 3,
      "text": "- in section 4., the quoting rules of the \"fax-address\" and their practical use was made explicit both in the definition of \"fax-email\" and in the Implementors' note;",
      "zh-CHS": "- 在第4节中，“传真地址”的引用规则及其实际用途在“传真电子邮件”的定义和实施者说明中都有明确规定；"
    },
    {
      "indent": 3,
      "text": "- the Author's Address was updated;",
      "zh-CHS": "- 更新了作者的地址；"
    },
    {
      "indent": 3,
      "text": "- the References list was updates to substitute ITU E.164 (1991) with ITU E.164 (1997).",
      "zh-CHS": "- 参考文献清单已更新，以ITU E.164（1997）代替ITU E.164（1991）。"
    },
    {
      "indent": 0,
      "text": "9. Author's Address",
      "section_title": true,
      "zh-CHS": "9. 作者地址"
    },
    {
      "indent": 3,
      "text": "Claudio Allocchio INFN-GARR c/o Sincrotrone Trieste SS 14 Km 163.5 Basovizza I 34012 Trieste Italy",
      "zh-CHS": "Claudio Allocchio INFN-GARR c/o Sincrotrone Trieste SS 14 Km意大利的里雅斯特Basovizza I 34012"
    },
    {
      "indent": 3,
      "text": "RFC2822: Claudio.Allocchio@garr.it\nX.400:   C=it;A=garr;P=garr;S=Allocchio;G=Claudio;\nPhone:   +39 040 3758523\nFax:     +39 040 3758565",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Postel, J., \"Simple Mail Transfer Protocol\", STD 10, RFC 821, August 1982.",
      "zh-CHS": "[1] Postel，J.，“简单邮件传输协议”，STD 10，RFC 821，1982年8月。"
    },
    {
      "indent": 3,
      "text": "[2] Crocker, D., \"Standard for the Format of ARPA Internet Text Messages\", STD 11, RFC 822, August 1982.",
      "zh-CHS": "[2] Crocker，D.，“ARPA互联网文本信息格式标准”，STD 11，RFC 822，1982年8月。"
    },
    {
      "indent": 3,
      "text": "[3] Braden, R., \"Requirements for Internet hosts - application and support\", STD 3, RFC 1123, October 1989.",
      "zh-CHS": "[3] Braden，R.，“互联网主机的要求-应用和支持”，STD 3，RFC 1123，1989年10月。"
    },
    {
      "indent": 3,
      "text": "[4] Malamud, C. and M. Rose, \"Principles of Operation for the TPC.INT Subdomain: Remote Printing -- Technical Procedures\", RFC 1528, October 1993.",
      "zh-CHS": "[4] Malamud，C.和M.Rose，“TPC.INT子域的操作原则：远程打印——技术程序”，RFC 15281993年10月。"
    },
    {
      "indent": 3,
      "text": "[5] Eastlake, D. and C. Kaufman, \"Domain Name System Security Extensions\", RFC 2065, January 1997.",
      "zh-CHS": "[5] Eastlake，D.和C.Kaufman，“域名系统安全扩展”，RFC 20651997年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[6] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[7] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications\", RFC 2234, November 1997.",
      "zh-CHS": "[7] Crocker，D.和P.Overell，“语法规范的扩充BNF”，RFC 2234，1997年11月。"
    },
    {
      "indent": 3,
      "text": "[8] ITU F.401 - Message Handling Services: Naming and Addressing for Public Message Handling Service; recommendation F.401 (August 1992).",
      "zh-CHS": "[8] ITU F.401-信息处理服务：公共信息处理服务的命名和寻址；建议F.401（1992年8月）。"
    },
    {
      "indent": 3,
      "text": "[9] ITU F.423 - Message Handling Services: Intercommunication Between the Interpersonal Messaging Service and the Telefax Service; recommendation F.423 (August 1992).",
      "zh-CHS": "[9] ITU F.423-信息处理服务：人际信息服务和传真服务之间的相互通信；建议F.423（1992年8月）。"
    },
    {
      "indent": 3,
      "text": "[10] ITU E.164 - The International Public Telecommunication Numbering Plan E.164/I.331 (May 1997).",
      "zh-CHS": "[10] ITU E.164——国际公共电信编号计划E.164/I.331（1997年5月）。"
    },
    {
      "indent": 3,
      "text": "[11] ITU T.33 - Facsimile routing utilizing the subaddress; recommendation T.33 (July 1996).",
      "zh-CHS": "[11] ITU T.33-使用子地址的传真路由；建议T.33（1996年7月）。"
    },
    {
      "indent": 3,
      "text": "[12] ETSI I-ETS 300,380 - Universal Personal Telecommunication (UPT): Access Devices Dual Tone Multi Frequency (DTMF) sender for acoustical coupling to the microphone of a handset telephone (March 1995).",
      "zh-CHS": "[12] ETSI I-ETS 300380-通用个人电信（UPT）：接入设备，用于与手持电话麦克风进行声学耦合的双音多频（DTMF）发送器（1995年3月）。"
    },
    {
      "indent": 3,
      "text": "[13] Allocchio, C., \"Minimal GSTN address format in Internet Mail\", RFC 3191, October 2001.",
      "zh-CHS": "[13] Allocchio，C.，“互联网邮件中的最小GSTN地址格式”，RFC3191，2001年10月。"
    },
    {
      "indent": 3,
      "text": "[14] Kille, S., \"MIXER (Mime Internet X.400 Enhanced Relay): Mapping between X.400 and RFC 822/MIME\", RFC 2156, January 1998.",
      "zh-CHS": "[14] Kille，S.，“混音器（Mime互联网X.400增强中继）：X.400和RFC 822/Mime之间的映射”，RFC 2156，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[15] Allocchio, C., \"GSTN address element extensions in e-mail services\", RFC 2846, June 2000.",
      "zh-CHS": "[15] Allocchio，C.，“电子邮件服务中的GSTN地址元素扩展”，RFC 28462000年6月。"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}