{
  "title": {
    "text": "RFC 3705:  High Capacity Textual Conventions for MIB Modules Using Performance History Based on 15 Minute Intervals ",
    "zh-CHS": "RFC 3705"
  },
  "number": 3705,
  "created_at": "2021-11-17 17:54:29.999357+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                             B. Ray\nRequest for Comments: 3705                        PESA Switching Systems\nCategory: Standards Track                                        R. Abbi\n                                                                 Alcatel\n                                                           February 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "High Capacity Textual Conventions for MIB Modules Using Performance History Based on 15 Minute Intervals",
      "zh-CHS": "使用基于15分钟间隔的性能历史记录的MIB模块的高容量文本约定"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document presents a set of High Capacity Textual Conventions for use in MIB modules which require performance history based upon 15 minute intervals. The Textual Conventions defined in this document extend the conventions presented in RFC 3593 to 64 bit resolution using the conventions presented in RFC 2856.",
      "zh-CHS": "本文档介绍了一组用于MIB模块的高容量文本约定，这些模块需要基于15分钟间隔的性能历史记录。本文中定义的文本约定使用RFC 2856中的约定将RFC 3593中的约定扩展到64位分辨率。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  The Internet-Standard Management Framework . . . . . . . . . .  2\n2.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  2\n3.  Definitions. . . . . . . . . . . . . . . . . . . . . . . . . .  3\n4.  Intellectual Property Statement. . . . . . . . . . . . . . . .  8\n5.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  8\n    5.1.  Normative References . . . . . . . . . . . . . . . . . .  8\n    5.2.  Informative References . . . . . . . . . . . . . . . . .  9\n6.  Security Considerations. . . . . . . . . . . . . . . . . . . . 10\n7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 10\n8.  Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 10\n9.  Full Copyright Statement . . . . . . . . . . . . . . . . . . . 11",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "1. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了符合SMIv2的MIB模块，如STD 58、RFC 2578[RFC2578]、STD 58、RFC 2579[RFC2579]和STD 58、RFC 2580[RFC2580]所述。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Overview",
      "section_title": true,
      "zh-CHS": "2. 概述"
    },
    {
      "indent": 3,
      "text": "In cases where a manager must obtain performance history data about the behavior of equipment it manages, several strategies can be followed in the design of a MIB module that represents the managed equipment, including:",
      "zh-CHS": "如果管理者必须获取有关其管理的设备行为的性能历史数据，则在设计代表被管理设备的MIB模块时，可以遵循以下几种策略："
    },
    {
      "indent": 3,
      "text": "- The agent counts events on a continuous basis and, whenever desired, the manager obtains the value of the event counter and adjusts its understanding of the history of events at the agent.",
      "zh-CHS": "- 代理连续统计事件，并且，只要需要，管理器就会获得事件计数器的值，并调整其对代理处事件历史的理解。"
    },
    {
      "indent": 3,
      "text": "- The agent allocates events to 'buckets' where each bucket represents an interval of time.",
      "zh-CHS": "- 代理将事件分配给“bucket”，其中每个bucket表示一个时间间隔。"
    },
    {
      "indent": 3,
      "text": "Telecommunications equipment often makes use of the latter strategy. For such equipment the standard practice is that history data is maintained by the agent in terms of 15-minute intervals [T1.231].",
      "zh-CHS": "电信设备通常采用后一种策略。对于此类设备，标准做法是代理按15分钟的间隔维护历史数据[T1.231]。"
    },
    {
      "indent": 3,
      "text": "MIB modules for collecting performance history based on 15-minute intervals have been defined for the DS1/E1 [RFC2495], DS3/E3 [RFC2496], SONET/SDH [RFC3592], ADSL [RFC2662], HDLS2 and SHDSL [RFC3276] interface types. These MIB modules use a common set of textual conventions defined in [RFC3593].",
      "zh-CHS": "已为DS1/E1[RFC2495]、DS3/E3[RFC2496]、SONET/SDH[RFC3592]、ADSL[RFC2662]、HDLS2和SHDSL[RFC3276]接口类型定义了基于15分钟间隔收集性能历史的MIB模块。这些MIB模块使用[RFC3593]中定义的一组通用文本约定。"
    },
    {
      "indent": 3,
      "text": "A need has arisen to define 64-bit versions of the textual conventions in [RFC3593]. Ideally, these high-capacity textual conventions would be based on a Gauge64 or Unsigned64 data type, but unfortunately no such types exist in SMIv2. The next best choice would be to base them on the CounterBasedGauge64 textual convention",
      "zh-CHS": "需要在[RFC3593]中定义64位版本的文本约定。理想情况下，这些高容量文本约定将基于Gauge64或Unsigned64数据类型，但不幸的是，SMIv2中不存在此类类型。下一个最佳选择是将它们建立在反基础的Gauge64文本约定的基础上"
    },
    {
      "indent": 3,
      "text": "presented in [RFC2856], but that is not possible either since SMIv2 allows only base types to be used in defining textual conventions. Therefore, the textual conventions presented in this memo are based directly on the Counter64 type, like those in [RFC2856]. They are subject to the following limitations:",
      "zh-CHS": "在[RFC2856]中介绍，但这也不可能，因为SMIv2只允许在定义文本约定时使用基类型。因此，本备忘录中的文本约定直接基于Counter64类型，如[RFC2856]中的文本约定。它们受到以下限制："
    },
    {
      "indent": 3,
      "text": "- The MAX-ACCESS of objects defined using these textual conventions must be read-only, because the MAX-ACCESS of the underlying Counter64 type is read-only.",
      "zh-CHS": "- 使用这些文本约定定义的对象的MAX-ACCESS必须是只读的，因为底层Counter64类型的MAX-ACCESS是只读的。"
    },
    {
      "indent": 3,
      "text": "- No sub-range can be specified in object definitions using these textual conventions, because sub-ranges are not allowed on Counter64 objects.",
      "zh-CHS": "- 使用这些文本约定，无法在对象定义中指定子范围，因为Counter64对象上不允许使用子范围。"
    },
    {
      "indent": 3,
      "text": "- No DEFVAL clause can be specified in object definitions using these textual conventions, because DEFVALs are not allowed on Counter64 objects.",
      "zh-CHS": "- 不能使用这些文本约定在对象定义中指定DEFVAL子句，因为Counter64对象上不允许使用DEFVAL。"
    },
    {
      "indent": 3,
      "text": "- Objects defined using these textual conventions cannot be used in an INDEX clause, because there is no INDEX clause mapping defined for objects of type Counter64.",
      "zh-CHS": "- 使用这些文本约定定义的对象不能在索引子句中使用，因为没有为Counter64类型的对象定义索引子句映射。"
    },
    {
      "indent": 3,
      "text": "Use of the textual conventions presented in this memo assumes the following:",
      "zh-CHS": "使用本备忘录中提出的文本约定时，假设："
    },
    {
      "indent": 3,
      "text": "- The agent supports 15 minute based history counters.",
      "zh-CHS": "- 代理支持基于15分钟的历史计数器。"
    },
    {
      "indent": 3,
      "text": "- The agent is capable of keeping a history of 96 intervals of 15 minute performance data.",
      "zh-CHS": "- 代理能够保存96次15分钟性能数据间隔的历史记录。"
    },
    {
      "indent": 3,
      "text": "- The agent may optionally support performance data aggregating the history intervals.",
      "zh-CHS": "- 代理可以选择性地支持聚合历史间隔的性能数据。"
    },
    {
      "indent": 3,
      "text": "- The agent will keep separate tables for the current interval, the history intervals, and the total aggregates.",
      "zh-CHS": "- 代理将为当前间隔、历史间隔和总聚合保留单独的表。"
    },
    {
      "indent": 0,
      "text": "3. Definitions",
      "section_title": true,
      "zh-CHS": "3. 定义"
    },
    {
      "indent": 3,
      "text": "HC-PerfHist-TC-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, Counter64, Unsigned32, Integer32, mib-2 FROM SNMPv2-SMI TEXTUAL-CONVENTION FROM SNMPv2-TC;",
      "zh-CHS": "从SNMPv2 TC导入SNMPv2 SMI文本约定中的MODULE-IDENTITY、Counter64、Unsigned32、Integer32、mib-2；"
    },
    {
      "indent": 3,
      "text": "hcPerfHistTCMIB MODULE-IDENTITY\n   LAST-UPDATED \"200402030000Z\" -- February 3, 2004\n   ORGANIZATION \"ADSLMIB Working Group\"\n   CONTACT-INFO \"WG-email:  adslmib@ietf.org\n        Info:      https://www1.ietf.org/mailman/listinfo/adslmib",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Chair: Mike Sneed Sand Channel Systems Postal: P.O. Box 37324 Raleigh NC 27627-7324 USA Email: sneedmike@hotmail.com Phone: +1 206 600 7022",
      "zh-CHS": "主席：Mike Sneed Sand Channel Systems邮政信箱：美国北卡罗来纳州罗利市37324号信箱27627-7324电子邮件：sneedmike@hotmail.com电话：+1206600722"
    },
    {
      "indent": 11,
      "text": "Co-editor: Bob Ray PESA Switching Systems, Inc. Postal: 330-A Wynn Drive Huntsville, AL 35805 USA Email: rray@pesa.com Phone: +1 256 726 9200 ext. 142",
      "zh-CHS": "合编：Bob Ray PESA Switching Systems，Inc.邮政编码：330-A美国阿拉巴马州亨茨维尔永利大道A号邮编：35805电子邮件：rray@pesa.com电话：+12567269200分机142"
    },
    {
      "indent": 7,
      "text": " Co-editor: Rajesh Abbi Alcatel USA Postal: 2301 Sugar Bush Road Raleigh, NC 27612-3339 USA Email: Rajesh.Abbi@alcatel.com Phone: +1 919 850 6194 \" DESCRIPTION \"This MIB Module provides Textual Conventions to be used by systems supporting 15 minute based performance history counts that require high-capacity counts.",
      "zh-CHS": "合编：Rajesh Abbi Alcatel美国邮政：美国北卡罗来纳州罗利糖布什路2301号，邮编：27612-3339电子邮件：Rajesh。Abbi@alcatel.com电话：+1 919 850 6194“说明”此MIB模块提供文本约定，供支持需要高容量计数的15分钟性能历史记录计数的系统使用。"
    },
    {
      "indent": 12,
      "text": "Copyright (C) The Internet Society (2004). This version of this MIB module is part of RFC 3705: see the RFC itself for full legal notices.\"",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。此MIB模块的此版本是RFC 3705的一部分：有关完整的法律通知，请参阅RFC本身。”"
    },
    {
      "indent": 11,
      "text": "REVISION \"200402030000Z\" -- February 3, 2004 DESCRIPTION \"Initial version, published as RFC 3705.\"",
      "zh-CHS": "修订版“200402030000Z”-2004年2月3日描述“初始版本，作为RFC 3705出版。”"
    },
    {
      "indent": 11,
      "text": "::= { mib-2 107 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "HCPerfValidIntervals ::= TEXTUAL-CONVENTION\n    STATUS  current\n    DESCRIPTION\n       \"The number of near end intervals for which data was",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": " collected. The value of an object with an HCPerfValidIntervals syntax will be 96 unless the measurement was (re-)started within the last 1440 minutes, in which case the value will be the number of complete 15 minute intervals for which the agent has at least some data. In certain cases (e.g., in the case where the agent is a proxy) it is possible that some intervals are unavailable. In this case, this interval is the maximum interval number for which data is available.\" SYNTAX Integer32 (0..96)",
      "zh-CHS": "收集。具有HCPerfValidIntervals语法的对象的值将为96，除非在过去1440分钟内（重新）开始测量，在这种情况下，该值将是代理至少有一些数据的完整15分钟间隔数。在某些情况下（例如，在代理是代理的情况下），某些时间间隔可能不可用。在本例中，此间隔是数据可用的最大间隔数。“语法整数32（0..96）"
    },
    {
      "indent": 3,
      "text": "HCPerfInvalidIntervals ::= TEXTUAL-CONVENTION\n    STATUS  current\n    DESCRIPTION\n       \"The number of near end intervals for which no data is\n       available.  The value of an object with an\n       HCPerfInvalidIntervals syntax will typically be zero except\n       in cases where the data for some intervals are not available\n       (e.g., in proxy situations).\"\n    SYNTAX   Integer32 (0..96)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "HCPerfTimeElapsed ::= TEXTUAL-CONVENTION\n    STATUS  current\n    DESCRIPTION\n       \"The number of seconds that have elapsed since the beginning\n       of the current measurement period.  If, for some reason,\n       such as an adjustment in the system's time-of-day clock or\n       the addition of a leap second, the duration of the current\n       interval exceeds the maximum value, the agent will return\n       the maximum value.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": " For 15 minute intervals, the range is limited to (0..899). For 24 hour intervals, the range is limited to (0..86399).\" SYNTAX Integer32 (0..86399)",
      "zh-CHS": "对于15分钟的间隔，范围限制为（0..899）。对于24小时间隔，范围限制为（0..86399）。“语法整数32（0..86399）"
    },
    {
      "indent": 3,
      "text": "HCPerfIntervalThreshold ::= TEXTUAL-CONVENTION\n    STATUS   current\n    DESCRIPTION\n        \"This convention defines a range of values that may be set\n        in a fault threshold alarm control.  As the number of\n        seconds in a 15-minute interval numbers at most 900,\n        objects of this type may have a range of 0...900, where the\n        value of 0 disables the alarm.\"\n    SYNTAX   Unsigned32 (0..900)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "HCPerfCurrentCount ::= TEXTUAL-CONVENTION\n    STATUS  current\n    DESCRIPTION",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "\"A gauge associated with a performance measurement in a current 15 minute measurement interval. The value of an object with an HCPerfCurrentCount syntax starts from zero and is increased when associated events occur, until the end of the 15 minute interval. At that time the value of the gauge is stored in the first 15 minute history interval, and the gauge is restarted at zero. In the case where the agent has no valid data available for the current interval, the corresponding object instance is not available and upon a retrieval request a corresponding error message shall be returned to indicate that this instance does not exist.",
      "zh-CHS": "与当前15分钟测量间隔内的性能测量相关联的仪表。具有HCPerfCurrentCount语法的对象的值从零开始，并在相关事件发生时增加，直到15分钟间隔结束。此时仪表的值存储在前15分钟历史间隔内，并且仪表在零位重新启动。如果代理在当前间隔内没有可用的有效数据，则相应的对象实例不可用，并且在检索请求时，应返回相应的错误消息以指示此实例不存在。"
    },
    {
      "indent": 12,
      "text": "This count represents a non-negative integer, which may increase or decrease, but shall never exceed 2^64-1 (18446744073709551615 decimal), nor fall below 0. The value of an object with HCPerfCurrentCount syntax assumes its maximum value whenever the underlying count exceeds 2^64-1. If the underlying count subsequently decreases below 2^64-1 (due, e.g., to a retroactive adjustment as a result of entering or exiting unavailable time), then the object's value also decreases.",
      "zh-CHS": "此计数表示一个非负整数，可以增加或减少，但不得超过2^64-1（18446744073709551615十进制），也不得低于0。具有HCPerfCurrentCount语法的对象的值在基础计数超过2^64-1时采用其最大值。如果基础计数随后降低到2^64-1以下（例如，由于进入或退出不可用时间而进行追溯调整），则对象的值也会降低。"
    },
    {
      "indent": 12,
      "text": "Note that this TC is not strictly supported in SMIv2, because the 'always increasing' and 'counter wrap' semantics associated with the Counter64 base type are not preserved. It is possible that management applications which rely solely upon the (Counter64) ASN.1 tag to determine object semantics will mistakenly operate upon objects of this type as they would for Counter64 objects.",
      "zh-CHS": "请注意，SMIv2中不严格支持此TC，因为与Counter64基类型关联的“始终递增”和“计数器换行”语义没有保留。完全依赖（Counter64）ASN.1标记来确定对象语义的管理应用程序可能会像对Counter64对象那样错误地对这种类型的对象进行操作。"
    },
    {
      "indent": 7,
      "text": " This textual convention represents a limited and short-term solution, and may be deprecated as a long term solution is defined and deployed to replace it.\" SYNTAX Counter64",
      "zh-CHS": "此文本约定表示有限的短期解决方案，可能会被弃用，因为定义并部署了长期解决方案来替代它。”语法计数器64"
    },
    {
      "indent": 3,
      "text": "HCPerfIntervalCount ::= TEXTUAL-CONVENTION\n    STATUS  current\n    DESCRIPTION\n        \"A gauge associated with a performance measurement in\n         a previous 15 minute measurement interval.  In the case\n         where the agent has no valid data available for a\n         particular interval, the corresponding object instance is\n         not available and upon a retrieval request a corresponding\n         error message shall be returned to indicate that this\n         instance does not exist.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Let X be an object with HCPerfIntervalCount syntax.",
      "zh-CHS": "设X为具有HCPerfIntervalCount语法的对象。"
    },
    {
      "indent": 12,
      "text": "Let Y be an object with HCPerfCurrentCount syntax. Let Z be an object with HCPerfTotalCount syntax. Then, in a system supporting a history of n intervals with X(1) and X(n) the most and least recent intervals respectively, the following applies at the end of a 15 minute interval:",
      "zh-CHS": "设Y为具有HCPerfCurrentCount语法的对象。设Z为具有HCPerfTotalCount语法的对象。然后，在支持n个间隔历史的系统中，X（1）和X（n）分别是最新和最短的间隔，在15分钟间隔结束时，以下内容适用："
    },
    {
      "indent": 15,
      "text": "- discard the value of X(n) - the value of X(i) becomes that of X(i-1) for n >= i > 1 - the value of X(1) becomes that of Y. - the value of Z, if supported, is adjusted.",
      "zh-CHS": "- 丢弃X（n）的值-对于n>=i>1，X（i）的值变为X（i-1）的值-X（1）的值变为Y的值-调整Z的值（如果支持）。"
    },
    {
      "indent": 12,
      "text": "This count represents a non-negative integer, which may increase or decrease, but shall never exceed 2^64-1 (18446744073709551615 decimal), nor fall below 0. The value of an object with HCPerfIntervalCount syntax assumes its maximum value whenever the underlying count exceeds 2^64-1. If the underlying count subsequently decreases below 2^64-1 (due, e.g., to a retroactive adjustment as a result of entering or exiting unavailable time), then the value of the object also decreases.",
      "zh-CHS": "此计数表示一个非负整数，可以增加或减少，但不得超过2^64-1（18446744073709551615十进制），也不得低于0。具有HCPerfIntervalCount语法的对象的值在基础计数超过2^64-1时采用其最大值。如果基础计数随后降低到2^64-1以下（例如，由于进入或退出不可用时间而进行追溯调整），则对象的值也会降低。"
    },
    {
      "indent": 12,
      "text": "Note that this TC is not strictly supported in SMIv2, because the 'always increasing' and 'counter wrap' semantics associated with the Counter64 base type are not preserved. It is possible that management applications which rely solely upon the (Counter64) ASN.1 tag to determine object semantics will mistakenly operate upon objects of this type as they would for Counter64 objects.",
      "zh-CHS": "请注意，SMIv2中不严格支持此TC，因为与Counter64基类型关联的“始终递增”和“计数器换行”语义没有保留。完全依赖（Counter64）ASN.1标记来确定对象语义的管理应用程序可能会像对Counter64对象那样错误地对这种类型的对象进行操作。"
    },
    {
      "indent": 7,
      "text": " This textual convention represents a limited and short-term solution, and may be deprecated as a long term solution is defined and deployed to replace it.\" SYNTAX Counter64",
      "zh-CHS": "此文本约定表示有限的短期解决方案，可能会被弃用，因为定义并部署了长期解决方案来替代它。”语法计数器64"
    },
    {
      "indent": 3,
      "text": "HCPerfTotalCount ::= TEXTUAL-CONVENTION\n    STATUS  current\n    DESCRIPTION\n        \"A gauge representing the aggregate of previous valid 15\n         minute measurement intervals.  Intervals for which no\n         valid data was available are not counted.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "This count represents a non-negative integer, which may increase or decrease, but shall never exceed 2^64-1 (18446744073709551615 decimal), nor fall below 0. The value of an object with HCPerfTotalCount syntax assumes its maximum value whenever the underlying count",
      "zh-CHS": "此计数表示一个非负整数，可以增加或减少，但不得超过2^64-1（18446744073709551615十进制），也不得低于0。具有HCPerfTotalCount语法的对象的值在基础计数"
    },
    {
      "indent": 12,
      "text": "exceeds 2^64-1. If the underlying count subsequently decreases below 2^64-1 (due, e.g., to a retroactive adjustment as a result of entering or exiting unavailable time), then the object's value also decreases.",
      "zh-CHS": "超过2^64-1。如果基础计数随后降低到2^64-1以下（例如，由于进入或退出不可用时间而进行追溯调整），则对象的值也会降低。"
    },
    {
      "indent": 12,
      "text": "Note that this TC is not strictly supported in SMIv2, because the 'always increasing' and 'counter wrap' semantics associated with the Counter64 base type are not preserved. It is possible that management applications which rely solely upon the (Counter64) ASN.1 tag to determine object semantics will mistakenly operate upon objects of this type as they would for Counter64 objects.",
      "zh-CHS": "请注意，SMIv2中不严格支持此TC，因为与Counter64基类型关联的“始终递增”和“计数器换行”语义没有保留。完全依赖（Counter64）ASN.1标记来确定对象语义的管理应用程序可能会像对Counter64对象那样错误地对这种类型的对象进行操作。"
    },
    {
      "indent": 3,
      "text": " This textual convention represents a limited and short-term solution, and may be deprecated as a long term solution is defined and deployed to replace it.\" SYNTAX Counter64 END",
      "zh-CHS": "此文本约定代表一个有限的短期解决方案，可能会被弃用，因为定义并部署了一个长期解决方案来替代它。”语法计数器64结束"
    },
    {
      "indent": 0,
      "text": "4. Intellectual Property Statement",
      "section_title": true,
      "zh-CHS": "4. 知识产权声明"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何努力来确定任何此类权利。有关IETF在标准跟踪和标准相关文件中权利的程序信息，请参见BCP-11。可从IETF秘书处获得可供发布的权利声明副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涉及实施本标准所需技术的专有权利。请将信息发送给IETF执行董事。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "zh-CHS": "5.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.和S.Waldbusser，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "zh-CHS": "5.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D. and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 34102002年12月。"
    },
    {
      "indent": 3,
      "text": "[T1.231] American National Standard for Telecommunications - Digital Hierarchy - Layer 1 In-Service Digital Transmission Performance Monitoring, ANSI T1.231-1997, September 1997.",
      "zh-CHS": "[T1.231]美国国家电信标准-数字体系-第1层在用数字传输性能监测，ANSI T1.231-1997，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2495] Fowler, D., \"Definitions of Managed Objects for the DS1, E1, DS2 and E2 Interface Types\", RFC 2495, January 1999.",
      "zh-CHS": "[RFC2495]Fowler，D.“DS1、E1、DS2和E2接口类型的托管对象定义”，RFC 2495，1999年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2496] Fowler, D., \"Definitions of Managed Objects for the DS3/E3 Interface Type\", RFC 2496, January 1999.",
      "zh-CHS": "[RFC2496]Fowler，D.，“DS3/E3接口类型的托管对象定义”，RFC2496，1999年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3592] Tesink, K., \"Definitions of Managed Objects for the Synchronous Optical Network/Synchronous Digital Hierarchy (SONET/SDH) Interface Type\", RFC 3592, November 2003.",
      "zh-CHS": "[RFC3592]Tesink，K.“同步光网络/同步数字体系（SONET/SDH）接口类型的受管对象定义”，RFC 3592，2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2662] Bathrick, G. and F. Ly, \"Definitions of Managed Objects for the ADSL Lines\", RFC 2662, August 1999.",
      "zh-CHS": "[RFC2662]Bathrick，G.和F.Ly，“ADSL线路管理对象的定义”，RFC 2662，1999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2856] Bierman, A., McCloghrie, K. and R. Presuhn, \"Textual Conventions for Additional High Capacity Data Types\", RFC 2856, June 2000.",
      "zh-CHS": "[RFC2856]Bierman，A.，McCloghrie，K.和R.Presohn，“附加高容量数据类型的文本约定”，RFC 28562000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3276] Ray, B. and R. Abbi, \"Definitions of Managed Objects for High Bit-rate DSL - 2nd Generation (HDSL2) and Single-Pair High-Speed Digital Subscriber Line (SHDSL) Lines\", RFC 3276, May 2002.",
      "zh-CHS": "[RFC3276]Ray，B.和R.Abbi，“第二代（HDSL2）高速数字用户线和单对高速数字用户线（SHDSL）线的受管对象定义”，RFC 3276，2002年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3593] Tesink, K., \"Textual Conventions for MIB Modules Using Performance History Based on 15 Minute Intervals\", RFC 3593, November 2003.",
      "zh-CHS": "[RFC3593]Tesink，K.“使用基于15分钟间隔的性能历史记录的MIB模块的文本约定”，RFC 3593，2003年11月。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This module does not define any management objects. Instead, it defines a set of textual conventions which may be used by other MIB modules to define management objects.",
      "zh-CHS": "此模块不定义任何管理对象。相反，它定义了一组文本约定，其他MIB模块可以使用这些文本约定来定义管理对象。"
    },
    {
      "indent": 3,
      "text": "Meaningful security considerations can only be written in the MIB modules that define management objects. This document has therefore no impact on the security of the Internet.",
      "zh-CHS": "有意义的安全注意事项只能写入定义管理对象的MIB模块中。因此，本文件对互联网的安全没有影响。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "This document borrows tremendously from [RFC3593] and [RFC2856]. As such, any credit for the text found within should be fully attributed to the authors of those documents.",
      "zh-CHS": "本文件大量借鉴了[RFC3593]和[RFC2856]。因此，本文件中的任何文字都应完全归功于这些文件的作者。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "8. 作者地址"
    },
    {
      "indent": 3,
      "text": "Bob Ray PESA Switching Systems, Inc. 330-A Wynn Drive Huntsville, AL 35805 USA",
      "zh-CHS": "Bob Ray PESA Switching Systems，Inc.美国阿拉巴马州亨茨维尔永利大道330-A号，邮编35805"
    },
    {
      "indent": 3,
      "text": "Phone: +1 256 726 9200 ext. 142\nFax:   +1 256 726 9271\nEMail: rray@pesa.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Rajesh Abbi Alcatel USA 2301 Sugar Bush Road Raleigh, NC 27612-3339 USA",
      "zh-CHS": "Rajesh Abbi Alcatel USA美国北卡罗来纳州罗利糖布什路2301号，邮编：27612-3339"
    },
    {
      "indent": 3,
      "text": "Phone: +1 919 850 6194\nEMail: Rajesh.Abbi@alcatel.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "9. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}