{
  "title": {
    "text": "RFC 3827:  Additional Snoop Datalink Types ",
    "zh-CHS": "RFC 3827"
  },
  "number": 3827,
  "created_at": "2021-11-18 05:22:29.900586+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          K. Sarcar\nRequest for Comments: 3827                        Sun Microsystems, Inc.\nCategory: Informational                                        June 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Additional Snoop Datalink Types",
      "zh-CHS": "其他Snoop数据链路类型"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The snoop file format provides a way to store and exchange datalink layer packet traces. This document describes extensions to this file format to support new media.",
      "zh-CHS": "snoop文件格式提供了一种存储和交换数据链路层数据包跟踪的方法。本文档介绍此文件格式的扩展名，以支持新媒体。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "[RFC1761] defines the snoop file format used to store captured network packets for tools that capture, display, and interpret network traffic. The file format specifies a header containing the Datalink Type field that identifies the network's datalink type. This document defines new values for this field, as well as an IANA registry for future datalink types.",
      "zh-CHS": "[RFC1761]定义用于为捕获、显示和解释网络流量的工具存储捕获的网络数据包的snoop文件格式。文件格式指定包含数据链接类型字段的标头，该字段标识网络的数据链接类型。本文档定义了此字段的新值，以及用于未来数据链路类型的IANA注册表。"
    },
    {
      "indent": 0,
      "text": "2. New Datalink Types",
      "section_title": true,
      "zh-CHS": "2. 新的数据链路类型"
    },
    {
      "indent": 3,
      "text": "In addition to the Datalink Type codes listed in [RFC1761], this document defines the following type codes for the corresponding media:",
      "zh-CHS": "除了[RFC1761]中列出的数据链路类型代码外，本文件还定义了相应介质的以下类型代码："
    },
    {
      "indent": 13,
      "text": "Datalink Type           Code\n-------------           ----",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Fibre Channel 16 ATM 17 ATM Classical IP 18 IP over Infiniband 26",
      "zh-CHS": "Infiniband 26上的光纤通道16 ATM 17 ATM经典IP 18 IP"
    },
    {
      "indent": 3,
      "text": "The IP over Infiniband packet format is described in [IPoIB].",
      "zh-CHS": "[IPoIB]中描述了Infiniband上的IP数据包格式。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document created a new IANA registry named \"Snoop Datalink Types\" to hold the various possible 32-bit (4 octet) snoop datalink types. This new registry holds the values previously defined in [RFC1761] and tabulated below:",
      "zh-CHS": "本文档创建了一个名为“Snoop数据链类型”的新IANA注册表，以保存各种可能的32位（4个八位组）Snoop数据链类型。此新注册表保存[RFC1761]中先前定义的值，如下表所示："
    },
    {
      "indent": 13,
      "text": "Datalink Type           Code\n-------------           ----",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "IEEE 802.3 0 IEEE 802.4 Token Bus 1 IEEE 802.5 Token Ring 2 IEEE 802.6 Metro Net 3 Ethernet 4 HDLC 5 Character Synchronous 6 IBM Channel-to-Channel 7 FDDI 8 Other 9",
      "zh-CHS": "IEEE 802.3 0 IEEE 802.4令牌总线1 IEEE 802.5令牌环2 IEEE 802.6城域网3以太网4 HDLC 5字符同步6 IBM通道至通道7 FDDI 8其他9"
    },
    {
      "indent": 3,
      "text": "Additionally, the new registry also holds the values defined above in section 2 of this document.",
      "zh-CHS": "此外，新注册表还保存本文件第2节中定义的值。"
    },
    {
      "indent": 3,
      "text": "All new allocations and assignments to this registry starting from code 27 will follow the First Come First Served policy outlined in [BCP0026]. Type codes up to 26 not defined by this section of the document (10-15 and 19-25) are considered reserved.",
      "zh-CHS": "从代码27开始，此注册表的所有新分配和分配将遵循[BCP0026]中概述的先到先得政策。本节文件（10-15和19-25）未定义的最多26个类型代码视为保留。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The addition of new datalink type codes to the existing file format poses no known security risks.",
      "zh-CHS": "在现有文件格式中添加新的数据链类型代码不会带来已知的安全风险。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "The author would like to thank Jim Carlson, Brent Callaghan, and Bill Strahm for meticulously reviewing this document.",
      "zh-CHS": "作者要感谢Jim Carlson、Brent Callaghan和Bill Strahm对本文件的仔细审阅。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC1761] Callaghan, B. and R. Gilligan, \"Snoop Version 2 Packet Capture File Format\", RFC 1761, February 1995.",
      "zh-CHS": "[RFC1761]Callaghan，B.和R.Gilligan，“Snoop版本2数据包捕获文件格式”，RFC17611995年2月。"
    },
    {
      "indent": 3,
      "text": "[BCP0026] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "zh-CHS": "[BCP0026]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 2434，1998年10月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[IPoIB] Kashyap, V. and H.K. Chu, \"IP encapsulation and address resolution over InfiniBand networks\", Work in Progress, April 2003.",
      "zh-CHS": "[IPoIB]Kashyap，V.和H.K.Chu，“InfiniBand网络上的IP封装和地址解析”，正在进行的工作，2003年4月。"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "zh-CHS": "7. 作者地址"
    },
    {
      "indent": 3,
      "text": "Kanoj Sarcar Sun Microsystems, Inc. 14 Network Circle Bldg 14, MPK14-333 Menlo Park, CA 94025",
      "zh-CHS": "加利福尼亚州门罗公园MPK14-333号14号网络圈大厦14号Kanoj Sarcar Sun Microsystems，Inc.94025"
    },
    {
      "indent": 3,
      "text": "Phone: 1-650-786-4785 EMail: kanoj.sarcar@sun.com",
      "zh-CHS": "电话：1-650-786-4785电子邮件：kanoj。sarcar@sun.com"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "8. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}