{
  "title": {
    "text": "RFC 3860:  Common Profile for Instant Messaging (CPIM) ",
    "zh-CHS": "RFC 3860"
  },
  "number": 3860,
  "created_at": "2021-11-18 07:22:39.145356+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        J. Peterson\nRequest for Comments: 3860                                       NeuStar\nCategory: Standards Track                                    August 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Common Profile for Instant Messaging (CPIM)",
      "zh-CHS": "即时消息（CPIM）的通用配置文件"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "At the time this document was written, numerous instant messaging protocols were in use, and little interoperability between services based on these protocols has been achieved. This specification defines common semantics and data formats for instant messaging to facilitate the creation of gateways between instant messaging services.",
      "zh-CHS": "在编写本文档时，许多即时消息协议正在使用，基于这些协议的服务之间的互操作性很少。本规范定义了即时消息的通用语义和数据格式，以便于在即时消息服务之间创建网关。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n3.  Abstract Instant Messaging Service . . . . . . . . . . . . . .  4\n    3.1.  Overview of Instant Messaging Service  . . . . . . . . .  4\n    3.2.  Identification of INSTANT INBOXes  . . . . . . . . . . .  5\n          3.2.1.  Address Resolution . . . . . . . . . . . . . . .  5\n    3.3.  Format of Instant Messages . . . . . . . . . . . . . . .  5\n    3.4.  The Messaging Service  . . . . . . . . . . . . . . . . .  5\n          3.4.1.  The Message Operation  . . . . . . . . . . . . .  5\n          3.4.2.  Looping  . . . . . . . . . . . . . . . . . . . .  6\n4.  Security Considerations  . . . . . . . . . . . . . . . . . . .  7\n5.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  8\n    5.1.  The IM URI Scheme. . . . . . . . . . . . . . . . . . . .  8\n6.  Contributors . . . . . . . . . . . . . . . . . . . . . . . . .  8\n7.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n    7.1.  Normative References . . . . . . . . . . . . . . . . . .  9\n    7.2.  Informative References . . . . . . . . . . . . . . . . .  9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A.  IM URI IANA Registration Template  . . . . . . . . . . . . . . 10\n    A.1.  URI Scheme Name  . . . . . . . . . . . . . . . . . . . . 10\n    A.2.  URI Scheme Syntax  . . . . . . . . . . . . . . . . . . . 10\n    A.3.  Character Encoding Considerations  . . . . . . . . . . . 10\n    A.4.  Intended Usage . . . . . . . . . . . . . . . . . . . . . 10\n    A.5.  Applications and/or Protocols which use this URI Scheme\n          Name . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n    A.6.  Security Considerations  . . . . . . . . . . . . . . . . 10\n    A.7.  Relevant Publications  . . . . . . . . . . . . . . . . . 11\n    A.8.  Person & Email Address to Contact for Further\n          Information. . . . . . . . . . . . . . . . . . . . . . . 11\n    A.9.  Author/Change Controller . . . . . . . . . . . . . . . . 11\n    A.10. Applications and/or Protocols which use this URI Scheme\n          Name . . . . . . . . . . . . . . . . . . . . . . . . . . 11\nB.  Issues of Interest . . . . . . . . . . . . . . . . . . . . . . 11\n    B.1.  Address Mapping  . . . . . . . . . . . . . . . . . . . . 11\n    B.2.  Source-Route Mapping . . . . . . . . . . . . . . . . . . 11\nC.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 12\nAuthor's Address . . . . . . . . . . . . . . . . . . . . . . . . . 12\nFull Copyright Statement . . . . . . . . . . . . . . . . . . . . . 13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Instant messaging is defined in RFC2778 [5]. At the time this document was written, numerous instant messaging protocols are in use, and little interoperability between services based on these protocols has been achieved. This specification defines semantics and data formats for common services of instant messaging to facilitate the creation of gateways between instant messaging services: a common profile for instant messaging (CPIM).",
      "zh-CHS": "即时消息在RFC2778[5]中定义。在编写本文档时，许多即时消息协议正在使用，基于这些协议的服务之间的互操作性很少。本规范定义了即时消息公共服务的语义和数据格式，以便于在即时消息服务之间创建网关：即时消息公共配置文件（CPIM）。"
    },
    {
      "indent": 3,
      "text": "Service behavior is described abstractly in terms of operations invoked between the consumer and provider of a service. Accordingly, each IM service must specify how this behavior is mapped onto its own protocol interactions. The choice of strategy is a local matter, providing that there is a clear relation between the abstract behaviors of the service (as specified in this memo) and how it is faithfully realized by a particular instant messaging service. For example, one strategy might transmit an instant message as textual key/value pairs, another might use a compact binary representation, and a third might use nested containers.",
      "zh-CHS": "服务行为是根据服务的使用者和提供者之间调用的操作抽象描述的。因此，每个IM服务必须指定如何将此行为映射到其自己的协议交互。策略的选择是一个局部问题，前提是服务的抽象行为（如本备忘录所述）与特定即时消息服务如何忠实地实现之间存在明确的关系。例如，一种策略可能以文本键/值对的形式传输即时消息，另一种策略可能使用紧凑的二进制表示，第三种策略可能使用嵌套容器。"
    },
    {
      "indent": 3,
      "text": "The attributes for each operation are defined using an abstract syntax. Although the syntax specifies the range of possible data values, each IM service must specify how well-formed instances of the abstract representation are encoded as a concrete series of bits.",
      "zh-CHS": "每个操作的属性都是使用抽象语法定义的。尽管语法指定了可能数据值的范围，但每个IM服务必须指定抽象表示的格式良好的实例如何编码为具体的位序列。"
    },
    {
      "indent": 3,
      "text": "In order to provide a means for the preservation of end-to-end features (especially security) to pass through instant messaging interoperability gateways, this specification also provides recommendations for instant messaging document formats that could be employed by instant messaging protocols.",
      "zh-CHS": "为了提供一种保存端到端功能（特别是安全性）以通过即时消息互操作性网关的方法，本规范还为即时消息协议可能采用的即时消息文档格式提供了建议。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in RFC 2119 [1] and indicate requirement levels for compliant implementations.",
      "zh-CHS": "在本文件中，关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”应按照RFC 2119[1]中所述进行解释，并指出合规实施的要求级别。"
    },
    {
      "indent": 3,
      "text": "This memos makes use of the vocabulary defined in RFC 2778 [5]. Terms such as CLOSED, INSTANT INBOX, INSTANT MESSAGE, and OPEN are used in the same meaning as defined therein.",
      "zh-CHS": "本备忘录使用了RFC 2778[5]中定义的词汇表。诸如“关闭”、“即时收件箱”、“即时消息”和“打开”等术语的含义与其中的定义相同。"
    },
    {
      "indent": 3,
      "text": "The term 'gateway' used in this document denotes a network element responsible for interworking between diverse instant messaging protocols. Although the instant messaging protocols themselves are diverse, under the model used in this document these protocols can carry a common payload that is relayed by the gateway. Whether these interworking intermediaries should be called 'gateways' or 'relays' is therefore somewhat debatable; for the purposes of this document, they are called 'CPIM gateways'.",
      "zh-CHS": "本文档中使用的术语“网关”表示负责不同即时消息协议之间互通的网络元件。尽管即时消息传递协议本身是多种多样的，但根据本文中使用的模型，这些协议可以承载由网关中继的公共有效负载。因此，这些互通中介体应该被称为“网关”还是“中继”，有些争议；在本文件中，它们被称为“CPIM网关”。"
    },
    {
      "indent": 3,
      "text": "The term 'instant messaging service' also derives from RFC 2778, but its meaning changes slightly due to the existence of gateways in the CPIM model. When a client sends an operation to an instant messaging service, that service might either be an endpoint or an intermediary such as a CPIM gateway - in fact, the client should not have to be aware which it is addressing, as responses from either will appear the same.",
      "zh-CHS": "术语“即时消息服务”也源自RFC 2778，但由于CPIM模型中存在网关，其含义略有变化。当客户端向即时消息服务发送操作时，该服务可能是端点或中介（如CPIM网关）——事实上，客户端不必知道它正在寻址哪个，因为来自这两个服务的响应都是相同的。"
    },
    {
      "indent": 3,
      "text": "This document defines operations and attributes of an abstract instant messaging protocol. In order for a compliant protocol to interface with an instant messaging gateway, it must support all of the operations described in this document (i.e., the instant messaging protocol must have some message or capability that provides the function described by each of the given operations). Similarly, the attributes defined for these operations must correspond to information available in the instant messaging protocol in order for the protocol to interface with gateways defined by this specification. Note that these attributes provide only the minimum possible information that needs to be specified for interoperability",
      "zh-CHS": "本文档定义了抽象即时消息协议的操作和属性。为了使兼容协议与即时消息网关接口，它必须支持本文档中描述的所有操作（即，即时消息协议必须具有某些消息或功能，以提供每个给定操作所描述的功能）。类似地，为这些操作定义的属性必须对应于即时消息协议中可用的信息，以便该协议与本规范定义的网关接口。请注意，这些属性仅提供互操作性所需指定的最小可能信息"
    },
    {
      "indent": 3,
      "text": "- the functions in an instant messaging protocol that correspond to the operations described in this document can contain additional information that will not be mapped by CPIM.",
      "zh-CHS": "- 与本文档中描述的操作相对应的即时消息协议中的功能可能包含CPIM不会映射的其他信息。"
    },
    {
      "indent": 0,
      "text": "3. Abstract Instant Messaging Service",
      "section_title": true,
      "zh-CHS": "3. 抽象即时消息服务"
    },
    {
      "indent": 0,
      "text": "3.1. Overview of Instant Messaging Service",
      "section_title": true,
      "zh-CHS": "3.1. 即时通讯服务概述"
    },
    {
      "indent": 3,
      "text": "When an application wants to send a message to an INSTANT INBOX, it invokes the message operation, e.g.,",
      "zh-CHS": "当应用程序希望向即时收件箱发送消息时，它会调用消息操作，例如。，"
    },
    {
      "indent": 3,
      "text": "+-------+                    +-------+\n|       |                    |       |\n| appl. | -- message ------> |  IM   |\n|       |                    | svc.  |\n+-------+                    +-------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The message operation has the following attributes: source, destination, MaxForwards and TransID. 'source' and 'destination' identify the originator and recipient of an instant message, respectively, and consist of an INSTANT INBOX identifier (as described in Section 3.2). The MaxForwards is a hop counter to avoid loops through gateways, with usage detailed defined in Section 3.4.2; its initial value is set by the originator. The TransID is a unique identifier used to correlate message operations to response operations; gateways should be capable of handling TransIDs up to 40 bytes in length.",
      "zh-CHS": "消息操作具有以下属性：源、目标、MaxForwards和TransID“源”和“目的地”分别标识即时消息的发起者和接收者，并由即时收件箱标识符组成（如第3.2节所述）。MaxForwards是一个跃点计数器，用于避免通过网关的循环，其用法在第3.4.2节中有详细定义；其初始值由发起人设定。TransID是用于将消息操作与响应操作关联起来的唯一标识符；网关应能够处理长度不超过40字节的传输。"
    },
    {
      "indent": 3,
      "text": "The message operation also has some content, the instant message itself, which may be textual, or which may consist of other data. Content details are specified in Section 3.3.",
      "zh-CHS": "消息操作还有一些内容，即时消息本身，可能是文本，也可能包含其他数据。内容详情见第3.3节。"
    },
    {
      "indent": 3,
      "text": "Note that this specification assumes that instant messaging protocols provide reliable message delivery; there are no application-layer message delivery assurance provisions in this specification.",
      "zh-CHS": "注意，本规范假设即时消息协议提供可靠的消息传递；本规范中没有应用层消息传递保证条款。"
    },
    {
      "indent": 3,
      "text": "Upon receiving a message operation, the service immediately responds by invoking the response operation containing the same transaction-identifier, e.g.,",
      "zh-CHS": "收到消息操作后，服务立即通过调用包含相同事务标识符的响应操作进行响应，例如。，"
    },
    {
      "indent": 3,
      "text": "+-------+                    +-------+\n|       |                    |       |\n| appl. | <----- response -- |  IM   |\n|       |                    |  svc. |\n+-------+                    +-------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The response operation contains the following attributes: TransID and status. The TransID is used to correlate the response to a particular instant message. Status indicates whether the delivery of the message succeeded or failed. Valid status values are described in Section 3.4.1.",
      "zh-CHS": "响应操作包含以下属性：TransID和status。TransID用于将响应与特定即时消息关联起来。状态指示邮件传递是成功还是失败。第3.4.1节描述了有效状态值。"
    },
    {
      "indent": 0,
      "text": "3.2. Identification of INSTANT INBOXes",
      "section_title": true,
      "zh-CHS": "3.2. 即时收件箱的识别"
    },
    {
      "indent": 3,
      "text": "An INSTANT INBOX is specified using an instant messaging URI with the 'im:' URI scheme. The full syntax of the IM URI scheme is given in Appendix A. An example would be: \"im:fred@example.com\"",
      "zh-CHS": "即时收件箱是使用带有“im:”URI方案的即时消息URI指定的。IM URI方案的完整语法见附录A。示例为：“IM:fred@example.com\""
    },
    {
      "indent": 0,
      "text": "3.2.1. Address Resolution",
      "section_title": true,
      "zh-CHS": "3.2.1. 地址解析"
    },
    {
      "indent": 3,
      "text": "An IM service client determines the next hop to forward the IM to by resolving the domain name portion of the service destination. Compliant implementations SHOULD follow the guidelines for dereferencing URIs given in [2].",
      "zh-CHS": "IM服务客户端通过解析服务目标的域名部分来确定转发IM的下一个跃点。兼容的实现应遵循[2]中给出的取消引用URI的指导原则。"
    },
    {
      "indent": 0,
      "text": "3.3. Format of Instant Messages",
      "section_title": true,
      "zh-CHS": "3.3. 即时消息格式"
    },
    {
      "indent": 3,
      "text": "This specification defines an abstract interoperability mechanism for instant messaging protocols; the message content definition given here pertains to semantics rather than syntax. However, some important properties for interoperability can only be provided if a common end-to-end format for instant messaging is employed by the interoperating instant messaging protocols, especially with respect to security. In order to maintain end-to-end security properties, applications that send message operations to a CPIM gateway MUST implement the format defined in MSGFMT [4]. Applications MAY support other content formats.",
      "zh-CHS": "本规范定义了即时消息协议的抽象互操作性机制；这里给出的消息内容定义属于语义而不是语法。然而，只有当互操作即时消息协议采用通用的端到端即时消息格式时，才能提供互操作性的一些重要属性，特别是在安全方面。为了维护端到端安全属性，向CPIM网关发送消息操作的应用程序必须实现MSGFMT[4]中定义的格式。应用程序可能支持其他内容格式。"
    },
    {
      "indent": 3,
      "text": "CPIM gateways MUST be capable of relaying the content of a message operation between supported instant messaging protocols without needing to modify or inspect the content.",
      "zh-CHS": "CPIM网关必须能够在支持的即时消息协议之间中继消息操作的内容，而无需修改或检查内容。"
    },
    {
      "indent": 0,
      "text": "3.4. The Messaging Service",
      "section_title": true,
      "zh-CHS": "3.4. 消息服务"
    },
    {
      "indent": 0,
      "text": "3.4.1. The Message Operation",
      "section_title": true,
      "zh-CHS": "3.4.1. 消息操作"
    },
    {
      "indent": 3,
      "text": "When an application wants to send an INSTANT MESSAGE, it invokes the message operation.",
      "zh-CHS": "当应用程序想要发送即时消息时，它会调用消息操作。"
    },
    {
      "indent": 3,
      "text": "When an instant messaging service receives the message operation, it performs the following preliminary checks:",
      "zh-CHS": "即时消息服务接收到消息操作时，将执行以下初步检查："
    },
    {
      "indent": 3,
      "text": "1. If the source or destination does not refer to a syntactically valid INSTANT INBOX, a response operation having status \"failure\" is invoked.",
      "zh-CHS": "1. 如果源或目标未引用语法有效的即时收件箱，则调用状态为“failure”的响应操作。"
    },
    {
      "indent": 3,
      "text": "2. If the destination of the operation cannot be resolved by the recipient, and the recipient is not the final recipient, a response operation with the status \"failure\" is invoked.",
      "zh-CHS": "2. 如果收件人无法解析操作的目标，并且收件人不是最终收件人，则会调用状态为“failure”的响应操作。"
    },
    {
      "indent": 3,
      "text": "3. If access control does not permit the application to request this operation, a response operation having status \"failure\" is invoked.",
      "zh-CHS": "3. 如果访问控制不允许应用程序请求此操作，将调用状态为“failure”的响应操作。"
    },
    {
      "indent": 3,
      "text": "4. Provided these checks are successful:",
      "zh-CHS": "4. 如果这些检查成功："
    },
    {
      "indent": 10,
      "text": "If the instant messaging service is able to successfully deliver the message, a response operation having status \"success\" is invoked.",
      "zh-CHS": "如果即时消息服务能够成功传递消息，则调用状态为“success”的响应操作。"
    },
    {
      "indent": 10,
      "text": "If the service is unable to successfully deliver the message, a response operation having status \"failure\" is invoked.",
      "zh-CHS": "如果服务无法成功传递消息，将调用状态为“failure”的响应操作。"
    },
    {
      "indent": 10,
      "text": "If the service must delegate responsibility for delivery (i.e., if it is acting as a gateway or proxying the operation), and if the delegation will not result in a future authoritative indication to the service, a response operation having status \"indeterminant\" is invoked.",
      "zh-CHS": "如果服务必须委派交付责任（即，如果它充当网关或代理操作），并且如果委派不会导致将来对服务的权威指示，则调用状态为“不确定”的响应操作。"
    },
    {
      "indent": 10,
      "text": "If the service must delegate responsibility for delivery, and if the delegation will result in a future authoritative indication to the service, then a response operation is invoked immediately after the indication is received.",
      "zh-CHS": "如果服务必须委托交付责任，并且如果委托将导致将来对服务的权威指示，则在收到指示后立即调用响应操作。"
    },
    {
      "indent": 3,
      "text": "When the service invokes the response operation, the transID parameter is identical to the value found in the message operation invoked by the application.",
      "zh-CHS": "当服务调用响应操作时，transID参数与应用程序调用的消息操作中的值相同。"
    },
    {
      "indent": 0,
      "text": "3.4.2. Looping",
      "section_title": true,
      "zh-CHS": "3.4.2. 循环"
    },
    {
      "indent": 3,
      "text": "The dynamic routing of instant messages can result in looping of a message through a relay. Detection of loops is not always obvious, since aliasing and group list expansions can legitimately cause a message to pass through a relay more than one time.",
      "zh-CHS": "即时消息的动态路由可能导致消息通过中继循环。循环的检测并不总是显而易见的，因为别名和组列表扩展可以合法地导致消息多次通过中继。"
    },
    {
      "indent": 3,
      "text": "This document assumes that instant messaging protocols that can be gatewayed by CPIM support some semantic equivalent to an integer value that indicates the maximum number of hops through which a message can pass. When that number of hops has been reached, the message is assumed to have looped.",
      "zh-CHS": "本文档假设可由CPIM网关化的即时消息传递协议支持某种语义等价物，该语义等价于指示消息可通过的最大跃点数的整数值。当达到该跳数时，假定消息已循环。"
    },
    {
      "indent": 3,
      "text": "When a CPIM gateway relays an instant message, it decrements the value of the MaxForwards attribute. This document does not mandate any particular initial setting for the MaxForwards element in instant messaging protocols, but it is recommended that the value be reasonably large (over one hundred).",
      "zh-CHS": "当CPIM网关中继即时消息时，它将递减MaxForwards属性的值。本文档不要求在即时消息协议中对MaxForwards元素进行任何特定的初始设置，但建议该值应相当大（超过100）。"
    },
    {
      "indent": 3,
      "text": "If a CPIM gateway receives an instant message operation that has a MaxForwards attribute of 0, it discards the message and invokes a failure operation.",
      "zh-CHS": "如果CPIM网关接收到MaxForwards属性为0的即时消息操作，它将丢弃该消息并调用失败操作。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Detailed security considerations for instant messaging protocols are given in RFC 2779 [6] (in particular, requirements are given in section 5.4 and some motivating discussion with 8.1).",
      "zh-CHS": "RFC 2779[6]中给出了即时消息协议的详细安全注意事项（特别是第5.4节给出了要求，并与第8.1节进行了一些激励性讨论）。"
    },
    {
      "indent": 3,
      "text": "CPIM defines an interoperability function that is employed by gateways between instant messaging protocols. CPIM gateways MUST be compliant with the minimum security requirements of the instant messaging protocols with which they interface.",
      "zh-CHS": "CPIM定义了即时消息协议之间的网关所使用的互操作性功能。CPIM网关必须符合其接口的即时消息协议的最低安全要求。"
    },
    {
      "indent": 3,
      "text": "The introduction of gateways to the security model of instant messaging in RFC 2779 also introduces some new risks. End-to-end security properties (especially confidentiality and integrity) between instant messaging user agents that interface through a CPIM gateway can only be provided if a common instant message format (such as the format described in MSGFMT [4]) is supported by the protocols interfacing with the CPIM gateway.",
      "zh-CHS": "RFC 2779中即时消息安全模型中引入网关也带来了一些新的风险。只有当与CPIM网关接口的协议支持通用即时消息格式（如MSGFMT[4]中描述的格式）时，才能提供通过CPIM网关接口的即时消息用户代理之间的端到端安全属性（尤其是机密性和完整性）。"
    },
    {
      "indent": 3,
      "text": "When end-to-end security is required, the message operation MUST use MSGFMT, and MUST secure the MSGFMT MIME body with S/MIME [8], with encryption (CMS EnvelopeData) and/or S/MIME signatures (CMS SignedData).",
      "zh-CHS": "当需要端到端安全性时，消息操作必须使用MSGFMT，并且必须使用S/MIME[8]，使用加密（CMS EnvelopeData）和/或S/MIME签名（CMS SignedData）保护MSGFMT MIME正文。"
    },
    {
      "indent": 3,
      "text": "The S/MIME algorithms are set by CMS [9]. The AES [11] algorithm should be preferred, as it is expected that AES best suits the capabilities of many platforms. Implementations MAY use AES as an encryption algorithm, but are REQUIRED to support only the baseline algorithms mandated by S/MIME and CMS.",
      "zh-CHS": "S/MIME算法由CMS设置[9]。AES[11]算法应该是首选，因为预计AES最适合许多平台的功能。实现可以使用AES作为加密算法，但只需要支持S/MIME和CMS强制要求的基线算法。"
    },
    {
      "indent": 3,
      "text": "When IM URIs are placed in instant messaging protocols, they convey the identity of the sender and/or the recipient. Certificates that are used for S/MIME IM operations SHOULD, for the purposes of reference integrity, contain a subjectAltName field containing the IM URI of their subject. Note that such certificates may also contain other identifiers, including those specific to particular instant messaging protocols. In order to further facilitate interoperability of secure messaging through CPIM gateways, users and service providers are encouraged to employ trust anchors for certificates that are widely accepted rather than trust anchors specific to any particular instant messaging service or provider.",
      "zh-CHS": "在即时消息协议中放置IM URI时，它们传递发送者和/或接收者的身份。出于引用完整性的目的，用于S/MIME IM操作的证书应包含一个subjectAltName字段，其中包含其主题的IM URI。注意，此类证书还可以包含其他标识符，包括特定于特定即时消息传递协议的标识符。为了进一步促进通过CPIM网关的安全消息传递的互操作性，鼓励用户和服务提供商对广泛接受的证书使用信任锚，而不是特定于任何特定即时消息传递服务或提供商的信任锚。"
    },
    {
      "indent": 3,
      "text": "In some cases, anonymous messaging may be desired. Such a capability is beyond the scope of this specification.",
      "zh-CHS": "在某些情况下，可能需要匿名消息传递。这种能力超出了本规范的范围。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA has assigned the \"im\" scheme.",
      "zh-CHS": "IANA已分配“im”方案。"
    },
    {
      "indent": 0,
      "text": "5.1. The IM URI Scheme",
      "section_title": true,
      "zh-CHS": "5.1. imuri方案"
    },
    {
      "indent": 3,
      "text": "The Instant Messaging (IM) URI scheme designates an Internet resource, namely an INSTANT INBOX.",
      "zh-CHS": "即时消息（IM）URI方案指定一个Internet资源，即即时收件箱。"
    },
    {
      "indent": 3,
      "text": "The syntax of an IM URI is given in Appendix A.",
      "zh-CHS": "IM URI的语法在附录A中给出。"
    },
    {
      "indent": 0,
      "text": "6. Contributors",
      "section_title": true,
      "zh-CHS": "6. 贡献者"
    },
    {
      "indent": 3,
      "text": "Dave Crocker edited earlier versions of this document.",
      "zh-CHS": "Dave Crocker编辑了此文档的早期版本。"
    },
    {
      "indent": 3,
      "text": "The following individuals made substantial textual contributions to this document:",
      "zh-CHS": "以下个人对本文件做出了实质性的文字贡献："
    },
    {
      "indent": 6,
      "text": "Athanassios Diacakis (thanos.diacakis@openwave.com)",
      "zh-CHS": "塔诺斯（塔诺斯）。diacakis@openwave.com)"
    },
    {
      "indent": 6,
      "text": "Florencio Mazzoldi (flo@networkprojects.com)",
      "zh-CHS": "弗洛伦西奥·马佐尔迪(flo@networkprojects.com)"
    },
    {
      "indent": 6,
      "text": "Christian Huitema (huitema@microsoft.com)",
      "zh-CHS": "克里斯蒂安·惠特马(huitema@microsoft.com)"
    },
    {
      "indent": 6,
      "text": "Graham Klyne (gk@ninebynine.org)",
      "zh-CHS": "格雷厄姆·克莱恩(gk@ninebynine.org)"
    },
    {
      "indent": 6,
      "text": "Jonathan Rosenberg (jdrosen@dynamicsoft.com)",
      "zh-CHS": "乔纳森·罗森伯格(jdrosen@dynamicsoft.com)"
    },
    {
      "indent": 6,
      "text": "Robert Sparks (rsparks@dynamicsoft.com)",
      "zh-CHS": "罗伯特·斯帕克斯(rsparks@dynamicsoft.com)"
    },
    {
      "indent": 6,
      "text": "Hiroyasu Sugano (suga@flab.fujitsu.co.jp)",
      "zh-CHS": "杉野裕康(suga@flab.fujitsu.co.jp)"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to indicate requirement levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Peterson, J., \"Address Resolution for Instant Messaging and Presence\", RFC 3861, August 2004.",
      "zh-CHS": "[2] Peterson，J.，“即时消息和状态的地址解析”，RFC 38612004年8月。"
    },
    {
      "indent": 3,
      "text": "[3] Resnick, P., \"Internet Message Format\", STD 11, RFC 2822, April 2001.",
      "zh-CHS": "[3] Resnick，P.，“互联网信息格式”，STD 11，RFC 2822，2001年4月。"
    },
    {
      "indent": 3,
      "text": "[4] Atkins, D. and G. Klyne, \"Common Presence and Instant Messaging: Message Format\", RFC 3862, August 2004.",
      "zh-CHS": "[4] Atkins，D.和G.Klyne，“常见状态和即时消息：消息格式”，RFC 3862，2004年8月。"
    },
    {
      "indent": 3,
      "text": "[5] Day, M., Rosenberg, J., and H. Sugano, \"A Model for Presence and Instant Messaging\", RFC 2778, February 2000.",
      "zh-CHS": "[5] Day，M.，Rosenberg，J.，和H.Sugano，“状态和即时信息模型”，RFC 27782000年2月。"
    },
    {
      "indent": 3,
      "text": "[6] Day, M., Aggarwal, S., and J. Vincent, \"Instant Messaging / Presence Protocol Requirements\", RFC 2779, February 2000.",
      "zh-CHS": "[6] Day，M.，Aggarwal，S.，和J.Vincent，“即时消息传递/存在协议要求”，RFC 27792000年2月。"
    },
    {
      "indent": 3,
      "text": "[7] Allocchio, C., \"GSTN Address Element Extensions in Email Services\", RFC 2846, June 2000.",
      "zh-CHS": "[7] Allocchio，C.，“电子邮件服务中的GSTN地址元素扩展”，RFC 28462000年6月。"
    },
    {
      "indent": 3,
      "text": "[8] Ramsdell, B., \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Message Specification\", RFC 3851, July 2004.",
      "zh-CHS": "[8] Ramsdell，B.，“安全/多用途Internet邮件扩展（S/MIME）版本3.1消息规范”，RFC 3851，2004年7月。"
    },
    {
      "indent": 3,
      "text": "[9] Housley, R., \"Cryptographic Message Syntax (CMS)\", RFC 3852, July 2004.",
      "zh-CHS": "[9] Housley，R.，“加密消息语法（CMS）”，RFC3852，2004年7月。"
    },
    {
      "indent": 3,
      "text": "[10] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifiers (URI): Generic Syntax\", RFC 2396, August 1998.",
      "zh-CHS": "[10] Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，RFC 2396，1998年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[11] Schaad, J., \"Use of the Advanced Encryption Standard (AES) Encryption Algorithm and in Cryptographic Message Syntax (CMS)\", RFC 3565, August 2003.",
      "zh-CHS": "[11] Schaad，J.，“高级加密标准（AES）加密算法和加密消息语法（CMS）的使用”，RFC 3565，2003年8月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. IM URI IANA Registration Template",
      "section_title": true,
      "zh-CHS": "附录A.IM URI IANA注册模板"
    },
    {
      "indent": 3,
      "text": "This section provides the information to register the im: instant messaging URI.",
      "zh-CHS": "本节提供注册im:instant messaging URI的信息。"
    },
    {
      "indent": 0,
      "text": "A.1. URI Scheme Name",
      "section_title": true,
      "zh-CHS": "A.1. URI方案名称"
    },
    {
      "indent": 3,
      "text": "im",
      "zh-CHS": "感应电动机"
    },
    {
      "indent": 0,
      "text": "A.2. URI Scheme Syntax",
      "section_title": true,
      "zh-CHS": "A.2. URI方案语法"
    },
    {
      "indent": 3,
      "text": "The syntax follows the existing mailto: URI syntax specified in RFC 2368. The ABNF is:",
      "zh-CHS": "该语法遵循RFC 2368中指定的现有mailto:URI语法。ABNF是："
    },
    {
      "indent": 3,
      "text": "IM-URI         = \"im:\" [ to ] [ headers ]\nto             =  mailbox\nheaders        =  \"?\" header *( \"&\" header )\nheader         =  hname \"=\" hvalue\nhname          =  *uric\nhvalue         =  *uric",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Here the symbol \"mailbox\" represents an encoded mailbox name as defined in RFC 2822 [3], and the symbol \"uric\" denotes any character that is valid in a URL (defined in RFC 2396 [10]).",
      "zh-CHS": "此处，符号“邮箱”表示RFC 2822[3]中定义的编码邮箱名称，符号“URIA”表示URL中有效的任何字符（在RFC 2396[10]中定义）。"
    },
    {
      "indent": 0,
      "text": "A.3. Character Encoding Considerations",
      "section_title": true,
      "zh-CHS": "A.3. 字符编码注意事项"
    },
    {
      "indent": 3,
      "text": "Representation of non-ASCII character sets in local-part strings is limited to the standard methods provided as extensions to RFC 2822 [3].",
      "zh-CHS": "本地部分字符串中非ASCII字符集的表示仅限于作为RFC 2822[3]扩展提供的标准方法。"
    },
    {
      "indent": 0,
      "text": "A.4. Intended Usage",
      "section_title": true,
      "zh-CHS": "A.4. 预期用途"
    },
    {
      "indent": 3,
      "text": "Use of the im: URI follows closely usage of the mailto: URI. That is, invocation of an IM URI will cause the user's instant messaging application to start, with destination address and message headers fill-in according to the information supplied in the URI.",
      "zh-CHS": "im:URI的使用和mailto:URI的使用密切相关。也就是说，调用imuri将导致用户的即时消息应用程序启动，并根据URI中提供的信息填充目标地址和消息头。"
    },
    {
      "indent": 0,
      "text": "A.5. Applications and/or Protocols which use this URI Scheme Name",
      "section_title": true,
      "zh-CHS": "A.5. 使用此URI方案名称的应用程序和/或协议"
    },
    {
      "indent": 3,
      "text": "It is anticipated that protocols compliant with RFC 2779, and meeting the interoperability requirements specified here, will make use of this URI scheme name.",
      "zh-CHS": "预计符合RFC 2779并满足此处规定的互操作性要求的协议将使用此URI方案名称。"
    },
    {
      "indent": 0,
      "text": "A.6. Security Considerations",
      "section_title": true,
      "zh-CHS": "A.6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "See Section 4.",
      "zh-CHS": "见第4节。"
    },
    {
      "indent": 0,
      "text": "A.7. Relevant Publications",
      "section_title": true,
      "zh-CHS": "A.7. 相关出版物"
    },
    {
      "indent": 3,
      "text": "RFC 2779, RFC 2778",
      "zh-CHS": "RFC 2779，RFC 2778"
    },
    {
      "indent": 0,
      "text": "A.8. Person & Email Address to Contact for Further Information",
      "section_title": true,
      "zh-CHS": "A.8. 联系人和电子邮件地址，以获取更多信息"
    },
    {
      "indent": 3,
      "text": "Jon Peterson [mailto:jon.peterson@neustar.biz]",
      "zh-CHS": "乔恩·彼得森[邮件收件人：乔恩。peterson@neustar.biz]"
    },
    {
      "indent": 0,
      "text": "A.9. Author/Change Controller",
      "section_title": true,
      "zh-CHS": "A.9. 作者/变更控制员"
    },
    {
      "indent": 3,
      "text": "This scheme is registered under the IETF tree. As such, IETF maintains change control.",
      "zh-CHS": "该方案在IETF树下注册。因此，IETF维护变更控制。"
    },
    {
      "indent": 0,
      "text": "A.10. Applications and/or Protocols which use this URI Scheme Name",
      "section_title": true,
      "zh-CHS": "A.10. 使用此URI方案名称的应用程序和/或协议"
    },
    {
      "indent": 3,
      "text": "Instant messaging service",
      "zh-CHS": "即时通讯服务"
    },
    {
      "indent": 0,
      "text": "Appendix B. Issues of Interest",
      "section_title": true,
      "zh-CHS": "附录B.感兴趣的问题"
    },
    {
      "indent": 3,
      "text": "This appendix briefly discusses issues that may be of interest when designing an interoperation gateway.",
      "zh-CHS": "本附录简要讨论了设计互操作网关时可能感兴趣的问题。"
    },
    {
      "indent": 0,
      "text": "B.1. Address Mapping",
      "section_title": true,
      "zh-CHS": "B.1. 地址映射"
    },
    {
      "indent": 3,
      "text": "When mapping the service described in this memo, mappings that place special information into the im: address local-part MUST use the meta-syntax defined in RFC 2846 [7].",
      "zh-CHS": "映射本备忘录中描述的服务时，将特殊信息放入im:address本地部分的映射必须使用RFC 2846[7]中定义的元语法。"
    },
    {
      "indent": 0,
      "text": "B.2. Source-Route Mapping",
      "section_title": true,
      "zh-CHS": "B.2. 源路由映射"
    },
    {
      "indent": 3,
      "text": "The easiest mapping technique is a form of source-routing and usually is the least friendly to humans having to type the string. Source-routing also has a history of operational problems.",
      "zh-CHS": "最简单的映射技术是源路由的一种形式，通常对必须键入字符串的人最不友好。源路由也有运行问题的历史记录。"
    },
    {
      "indent": 3,
      "text": "Use of source-routing for exchanges between different services is by a transformation that places the entire, original address string into the im: address local part and names the gateway in the domain part.",
      "zh-CHS": "使用源路由在不同服务之间进行交换是通过一种转换，将整个原始地址字符串放入im:address本地部分，并在域部分中命名网关。"
    },
    {
      "indent": 3,
      "text": "For example, if the destination INSTANT INBOX is \"pepp://example.com/ fred\", then, after performing the necessary character conversions, the resulting mapping is:",
      "zh-CHS": "例如，如果目标即时收件箱为“pepp://example.com/ fred”，然后，在执行必要的字符转换后，生成的映射为："
    },
    {
      "indent": 13,
      "text": "im:pepp=example.com/fred@relay-domain",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where \"relay-domain\" is derived from local configuration information.",
      "zh-CHS": "其中“中继域”来自本地配置信息。"
    },
    {
      "indent": 3,
      "text": "Experience shows that it is vastly preferable to hide this mapping from end-users - if possible, the underlying software should perform the mapping automatically.",
      "zh-CHS": "经验表明，最好对最终用户隐藏此映射—如果可能，底层软件应自动执行映射。"
    },
    {
      "indent": 0,
      "text": "Appendix C. Acknowledgments",
      "section_title": true,
      "zh-CHS": "附录C.确认书"
    },
    {
      "indent": 3,
      "text": "The author would like to acknowledge John Ramsdell for his comments, suggestions and enthusiasm. Thanks to Derek Atkins for editorial fixes.",
      "zh-CHS": "作者要感谢约翰·拉姆斯代尔的评论、建议和热情。感谢德里克·阿特金斯的编辑修正。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Jon Peterson NeuStar, Inc. 1800 Sutter St Suite 570 Concord, CA 94520 US",
      "zh-CHS": "美国加利福尼亚州康科德市萨特街1800号570室Jon Peterson NeuStar，Inc.94520"
    },
    {
      "indent": 3,
      "text": "Phone: +1 925/363-8720\nEMail: jon.peterson@neustar.biz",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}