{
  "title": {
    "text": "RFC 3335:  MIME-based Secure Peer-to-Peer Business Data Interchange over the Internet ",
    "zh-CHS": "RFC 3335"
  },
  "number": 3335,
  "created_at": "2021-10-26 19:21:15.979951+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         T. Harding\nRequest for Comments: 3335                              Cyclone Commerce\nCategory: Standards Track                                    R. Drummond\n                                                          Drummond Group\n                                                                 C. Shih\n                                                           Gartner Group\n                                                          September 2002",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": " MIME-based Secure Peer-to-Peer Business Data Interchange over the Internet",
      "zh-CHS": "Internet上基于MIME的安全对等业务数据交换"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes how to exchange structured business data securely using SMTP transport for Electronic Data Interchange, (EDI - either the American Standards Committee X12 or UN/EDIFACT, Electronic Data Interchange for Administration, Commerce and Transport), XML or other data used for business to business data interchange. The data is packaged using standard MIME content-types. Authentication and privacy are obtained by using Cryptographic Message Syntax (S/MIME) or OpenPGP security body parts. Authenticated acknowledgements make use of multipart/signed replies to the original SMTP message.",
      "zh-CHS": "本文档描述了如何使用SMTP传输安全地交换结构化业务数据，以实现电子数据交换（EDI-美国标准委员会X12或UN/EDIFACT，行政、商业和运输电子数据交换）、XML或用于企业对企业数据交换的其他数据。数据使用标准MIME内容类型进行打包。身份验证和隐私是通过使用加密消息语法（S/MIME）或OpenPGP安全主体部分获得的。通过身份验证的确认使用对原始SMTP邮件的多部分/签名回复。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.0   Introduction .................................................3\n2.0   Overview .....................................................4\n2.1   Purpose of a Security Guideline for MIME EDI .................4\n2.2   Definitions ..................................................4\n2.2.1 Terms ........................................................4\n2.2.2 The Secure Transmission Loop .................................5\n2.2.3 Definition of Receipts .......................................5\n2.3   Assumptions ..................................................6\n2.3.1 EDI Process Assumptions ......................................6\n2.3.2 Flexibility Assumptions ......................................7\n3.0   Referenced RFCs and Their Contribution .......................8\n3.1   RFC 821 SMTP [7] .............................................8\n3.2   RFC 822 Text Message Format [3] ..............................8\n3.3   RFC 1847 MIME Security Multiparts [6] ........................8\n3.4   RFC 1892 Multipart/Report [9] ................................8\n3.5   RFC 1767 EDI Content [2] .....................................9\n3.6   RFC 2015, 3156, 2440 PGP/MIME [4] ............................9\n3.7   RFC 2045, 2046, and 2049 MIME [1] ............................9\n3.8   RFC 2298 Message Disposition Notification [5] ................9\n3.9   RFC 2633 and 2630 S/MIME Version 3 Message Specifications [8] 9\n4.0   Structure of an EDI MIME Message - Applicability .............9\n4.1   Introduction .................................................9\n4.2   Structure of an EDI MIME Message - PGP/MIME .................10\n4.2.1 No Encryption, No Signature .................................10\n4.2.2 No Encryption, Signature ....................................10\n4.2.3 Encryption, No Signature ....................................10\n4.2.4 Encryption, Signature .......................................10\n4.3   Structure of an EDI MIME Message - S/MIME ...................10\n4.3.1 No encryption, No Signature..................................10\n4.3.2 No encryption, Signature ....................................10\n4.3.3 Encryption, No Signature ....................................11\n4.3.4 Encryption, Signature .......................................11\n5.0   Receipts ....................................................11\n5.1   Introduction ................................................11\n5.2   Requesting a Signed Receipt .................................13\n5.2.1 Additional Signed Receipt Considerations ....................16\n5.3   Message Disposition Notification Format .....................17\n5.3.1 Message Disposition Notification Extensions .................18\n5.3.2 Disposition Mode, Type, and Modifier Use ....................19\n5.4   Message Disposition Notification Processing .................21\n5.4.1 Large File Processing .......................................21\n5.4.2 Example .....................................................22\n6.0   Public Key Certificate Handling .............................24\n6.1   Near Term Approach ..........................................24\n6.2   Long Term Approach ..........................................24\n7.0   Security Considerations .....................................25",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "8.0   Acknowledgments .............................................26\n9.0   References ..................................................26\nAppendix IANA Registration Form ...................................28\nAuthors' Addresses ................................................28\nFull Copyright Statement ..........................................29",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1.0 Introduction",
      "section_title": true,
      "zh-CHS": "1.0 介绍"
    },
    {
      "indent": 3,
      "text": "Previous work on Internet EDI focused on specifying MIME content types for EDI data ([2] RFC 1767). This document expands on RFC 1767 to specify use of a comprehensive set of data security features, specifically data privacy, data integrity/authenticity, non-repudiation of origin and non-repudiation of receipt. This document also recognizes contemporary RFCs and is attempting to \"re-invent\" as little as possible. While this document focuses specifically on EDI data, any other data type is also supported.",
      "zh-CHS": "以前关于Internet EDI的工作重点是为EDI数据指定MIME内容类型（[2]RFC 1767）。本文件对RFC 1767进行了扩展，规定了一整套数据安全功能的使用，特别是数据隐私、数据完整性/真实性、原产地不可否认性和收据不可否认性。本文件也承认当代RFC，并试图尽可能少地“重新发明”。虽然本文档特别关注EDI数据，但也支持任何其他数据类型。"
    },
    {
      "indent": 3,
      "text": "With an enhancement in the area of \"receipts\", as described below (5.2), secure Internet MIME based EDI can be accomplished by using and complying with the following RFCs:",
      "zh-CHS": "如下文（5.2）所述，通过“收据”方面的增强，可以通过使用并遵守以下RFC来实现安全的基于Internet MIME的EDI："
    },
    {
      "indent": 6,
      "text": "-RFC 821 SMTP -RFC 822 Text Message Formats -RFC 1767 EDI Content Type -RFC 1847 Security Multiparts for MIME -RFC 1892 Multipart/Report -RFC 2015, 3156, 2440 MIME/PGP",
      "zh-CHS": "-RFC 821 SMTP-RFC 822文本消息格式-RFC 1767 EDI内容类型-RFC 1847 MIME安全多部分-RFC 1892多部分/报告-RFC 2015、3156、2440 MIME/PGP"
    },
    {
      "indent": 6,
      "text": "-RFC 2045 to 2049 MIME RFCs -RFC 2298 Message Disposition Notification -RFC 2630, 2633 S/MIME v3 Specification",
      "zh-CHS": "-RFC 2045至2049 MIME RFCs-RFC 2298消息处置通知-RFC 2630、2633 S/MIME v3规范"
    },
    {
      "indent": 3,
      "text": "Our intent here is to define clearly and precisely how these are used together, and what is required by user agents to be compliant with this document.",
      "zh-CHS": "我们在这里的目的是明确和准确地定义如何将这些功能结合使用，以及用户代理需要什么才能符合本文档的要求。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不得”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "2.0 Overview",
      "section_title": true,
      "zh-CHS": "2.0 概述"
    },
    {
      "indent": 0,
      "text": "2.1 Purpose of a Security Guideline for MIME EDI",
      "section_title": true,
      "zh-CHS": "2.1 MIME EDI安全指南的目的"
    },
    {
      "indent": 3,
      "text": "The purpose of these specifications is to ensure interoperability between EDI user agents, invoking some or all of the commonly expected security features. This document is also NOT limited to strict EDI use, but applies to any electronic commerce application where business data needs to be exchanged over the Internet in a secure manner.",
      "zh-CHS": "这些规范的目的是确保EDI用户代理之间的互操作性，调用一些或所有常见的预期安全功能。本文件也不限于严格的EDI使用，但适用于任何需要在互联网上以安全方式交换业务数据的电子商务应用程序。"
    },
    {
      "indent": 0,
      "text": "2.2 Definitions",
      "section_title": true,
      "zh-CHS": "2.2 定义"
    },
    {
      "indent": 0,
      "text": "2.2.1 Terms",
      "section_title": true,
      "zh-CHS": "2.2.1 条款"
    },
    {
      "indent": 3,
      "text": "EDI Electronic Data Interchange",
      "zh-CHS": "电子数据交换"
    },
    {
      "indent": 3,
      "text": "EC Electronic Commerce",
      "zh-CHS": "电子商务"
    },
    {
      "indent": 3,
      "text": "Receipt The functional message that is sent from a receiver to a sender to acknowledge receipt of an EDI/EC interchange.",
      "zh-CHS": "接收从接收方发送给发送方的功能报文，以确认收到EDI/EC交换。"
    },
    {
      "indent": 3,
      "text": "Signed Receipt Same as above, but with a digital signature.",
      "zh-CHS": "签名收据同上，但带有数字签名。"
    },
    {
      "indent": 3,
      "text": "Message Disposition The Internet messaging format used to Notification convey a receipt. This term is used interchangeably with receipt. A signed MDN is a signed receipt.",
      "zh-CHS": "Message Disposition用于传递通知和回执的Internet消息格式。该术语可与收据互换使用。已签名的MDN是已签名的收据。"
    },
    {
      "indent": 3,
      "text": "Non-repudiation of NRR is a \"legal event\" that occurs when Receipt (NRR) the original sender of an EDI/EC interchange has verified the signed receipt coming back from the receiver. NRR IS NOT a functional or a technical message.",
      "zh-CHS": "NRR的不可抵赖性是一种“法律事件”，当EDI/EC交换的原始发送方收到（NRR）已验证从接收方返回的签名收据时发生。NRR不是功能信息或技术信息。"
    },
    {
      "indent": 3,
      "text": "PGP/MIME Digital envelope security based on the Pretty Good Privacy (PGP) standard (Zimmerman), integrated with MIME Security Multiparts [6].",
      "zh-CHS": "PGP/MIME数字信封安全基于相当好的隐私（PGP）标准（Zimmerman），与MIME安全多部分集成[6]。"
    },
    {
      "indent": 3,
      "text": "S/MIME A format and protocol for adding Cryptographic signature and/or encryption services to Internet MIME messages.",
      "zh-CHS": "S/MIME向Internet MIME消息添加加密签名和/或加密服务的格式和协议。"
    },
    {
      "indent": 0,
      "text": "2.2.2 The secure transmission loop",
      "section_title": true,
      "zh-CHS": "2.2.2 安全传输环路"
    },
    {
      "indent": 3,
      "text": "This document's focus is on the formats and protocols for exchanging EDI content that has had security applied to it using the Internet's messaging environment.",
      "zh-CHS": "本文档的重点是交换EDI内容的格式和协议，这些内容使用Internet的消息传递环境应用了安全性。"
    },
    {
      "indent": 3,
      "text": "The \"secure transmission loop\" for EDI involves one organization sending a signed and encrypted EDI interchange to another organization, requesting a signed receipt, followed later by the receiving organization sending this signed receipt back to the sending organization. In other words, the following transpires:",
      "zh-CHS": "EDI的“安全传输循环”涉及一个组织向另一个组织发送签名和加密的EDI交换，请求签名收据，然后接收组织将签名收据发送回发送组织。换言之，发生了以下情况："
    },
    {
      "indent": 5,
      "text": "-The organization sending EDI/EC data signs and encrypts the data using either PGP/MIME or S/MIME. In addition, the message will request a signed receipt to be returned to the sender of the message.",
      "zh-CHS": "-发送EDI/EC数据的组织使用PGP/MIME或S/MIME对数据进行签名和加密。此外，该邮件将请求将已签名的回执返回给该邮件的发件人。"
    },
    {
      "indent": 5,
      "text": "-The receiving organization decrypts the message and verifies the signature, resulting in verified integrity of the data and authenticity of the sender.",
      "zh-CHS": "-接收组织解密消息并验证签名，从而验证数据的完整性和发送方的真实性。"
    },
    {
      "indent": 5,
      "text": "-The receiving organization then returns a signed receipt to the sending organization in the form of a message disposition notification message. This signed receipt will contain the hash of the signature from the received message, indicating to the sender that the received message was verified and/or decrypted properly.",
      "zh-CHS": "-然后，接收组织以消息处置通知消息的形式将签名收据返回给发送组织。此签名回执将包含来自接收到的消息的签名散列，向发送方表明已正确验证和/或解密接收到的消息。"
    },
    {
      "indent": 3,
      "text": "The above describes functionality which, if implemented, would satisfy all security requirements. This specification, however, leaves full flexibility for users to decide the degree to which they want to deploy those security features with their trading partners.",
      "zh-CHS": "上述描述的功能如果实现，将满足所有安全要求。然而，该规范为用户提供了充分的灵活性，以决定他们希望与贸易伙伴一起部署这些安全功能的程度。"
    },
    {
      "indent": 0,
      "text": "2.2.3 Definition of receipts",
      "section_title": true,
      "zh-CHS": "2.2.3 收据的定义"
    },
    {
      "indent": 3,
      "text": "The term used for both the functional activity and message for acknowledging receipt of an EDI/EC interchange is receipt, or signed receipt. The first term is used if the acknowledgment is for an interchange resulting in a receipt which is NOT signed. The second term is used if the acknowledgment is for an interchange resulting in a receipt which IS signed. The method used to request a receipt or a signed receipt is defined in RFC 2298, \"An Extensible Message Format for Message Disposition Notifications\".",
      "zh-CHS": "用于确认收到EDI/EC交换的功能活动和消息的术语为收据或签名收据。如果确认用于交换，导致未签名的收据，则使用第一个术语。如果确认用于交换，则使用第二个术语，交换结果为已签名的收据。RFC 2298“用于消息处置通知的可扩展消息格式”中定义了用于请求收据或签名收据的方法。"
    },
    {
      "indent": 3,
      "text": "The \"rule\" is:",
      "zh-CHS": "“规则”是："
    },
    {
      "indent": 5,
      "text": "- If a receipt is requested, explicitly specifying that the receipt be signed, then the receipt MUST be returned with a signature.",
      "zh-CHS": "- 如果请求收据，明确指定要签署收据，则必须返回带有签名的收据。"
    },
    {
      "indent": 5,
      "text": "- If a receipt is requested, explicitly specifying that the receipt be signed, but the recipient cannot support the requested protocol format or requested MIC algorithms, then a receipt, either signed or unsigned SHOULD be returned.",
      "zh-CHS": "- 如果请求了收据，明确指定要对收据进行签名，但收件人无法支持请求的协议格式或请求的MIC算法，则应返回已签名或未签名的收据。"
    },
    {
      "indent": 5,
      "text": "- If a signature is not explicitly requested, or if the signed receipt request parameter is not recognized by the UA, a receipt may or may not be returned. This behavior is consistent with the MDN RFC 2298.",
      "zh-CHS": "- 如果未明确请求签名，或者UA无法识别已签名的收据请求参数，则可以返回收据，也可以不返回收据。此行为与MDN RFC 2298一致。"
    },
    {
      "indent": 3,
      "text": "A term often used in combination with receipts is \"Non-Repudiation of Receipt (NRR). NRR refers to a legal event which occurs only when the original sender of an interchange has verified the signed receipt coming back from recipient of the message. Note that NRR is not possible without signatures.",
      "zh-CHS": "经常与收据结合使用的术语是“收据的不可否认性（NRR）”。NRR指的是仅当交换的原始发送方已验证从消息接收方返回的签名收据时才发生的法律事件。请注意，没有签名，NRR是不可能的。"
    },
    {
      "indent": 0,
      "text": "2.3 Assumptions",
      "section_title": true,
      "zh-CHS": "2.3 假设"
    },
    {
      "indent": 0,
      "text": "2.3.1 EDI Process Assumptions",
      "section_title": true,
      "zh-CHS": "2.3.1 EDI过程假设"
    },
    {
      "indent": 3,
      "text": "-Encrypted object is an EDI Interchange This specification assumes that a typical EDI interchange is the lowest level object that will be subject to security services.",
      "zh-CHS": "-加密对象是EDI交换。本规范假设典型的EDI交换是受安全服务约束的最低级别对象。"
    },
    {
      "indent": 4,
      "text": "In ANSI X12, this means anything between, and including segments ISA and IEA. In EDIFACT, this means anything between, and including, segments UNA/UNB and UNZ. In other words, the EDI interchanges including envelope segments remain intact and unreadable during secure transport.",
      "zh-CHS": "在ANSI X12中，这表示ISA段和IEA段之间的任何内容，包括ISA段和IEA段。实际上，这意味着UNA/UNB段和UNZ段之间的任何内容，包括UNA/UNB段和UNZ段。换言之，包括信封段在内的EDI交换在安全运输过程中保持完整且不可读。"
    },
    {
      "indent": 3,
      "text": "-EDI envelope headers are encrypted Congruent with the above statement, EDI envelope headers are NOT visible in the MIME package. In order to optimize routing from existing commercial EDI networks (called Value Added Networks or VANs) to the Internet, work may need to be done in the future to define ways to pull out some of the envelope information to make them visible; however, this specification does not go into any detail on this.",
      "zh-CHS": "-EDI信封头是加密的，与上述语句一致，EDI信封头在MIME包中不可见。为了优化从现有商业EDI网络（称为增值网络或VAN）到互联网的路由，未来可能需要确定提取一些信封信息以使其可见的方法；然而，本规范并未对此进行详细说明。"
    },
    {
      "indent": 3,
      "text": "-X12.58 and UN/EDIFACT security considerations The most common EDI standards bodies, ANSI X12 and EDIFACT, have defined internal provisions for security. X12.58 is the security mechanism for ANSI X12 and AUTACK provides security for EDIFACT. This specification DOES NOT dictate use or non-use of these security standards. They are both fully compatible, though possibly redundant, with this specification.",
      "zh-CHS": "-X12.58和UN/EDIFACT安全注意事项最常见的EDI标准机构ANSI X12和EDIFACT定义了内部安全规定。X12.58是ANSI X12的安全机制，AUTACK为EDIFACT提供安全性。本规范不规定使用或不使用这些安全标准。它们都与本规范完全兼容，尽管可能是冗余的。"
    },
    {
      "indent": 0,
      "text": "2.3.2 Flexibility Assumptions",
      "section_title": true,
      "zh-CHS": "2.3.2 灵活性假设"
    },
    {
      "indent": 3,
      "text": "-Encrypted or unencrypted data",
      "zh-CHS": "-加密或未加密数据"
    },
    {
      "indent": 4,
      "text": "This specification allows for EDI message exchange where the EDI data can either be un-protected or protected by means of encryption.",
      "zh-CHS": "本规范允许EDI消息交换，其中EDI数据可以不受保护，也可以通过加密方式进行保护。"
    },
    {
      "indent": 3,
      "text": "-Signed or unsigned data",
      "zh-CHS": "-有符号或无符号数据"
    },
    {
      "indent": 4,
      "text": "This specification allows for EDI message exchange with or without digital signature of the original EDI transmission.",
      "zh-CHS": "本规范允许使用或不使用原始EDI传输的数字签名进行EDI消息交换。"
    },
    {
      "indent": 3,
      "text": "-Use of receipt or not",
      "zh-CHS": "-收据的使用与否"
    },
    {
      "indent": 4,
      "text": "This specification allows for EDI message transmission with or without a request for receipt notification. If a signed receipt notification is requested however, a mic value is REQUIRED as part of the returned receipt, unless an error condition occurs in which a mic value cannot be returned. In error cases, an un-signed receipt or MDN SHOULD be returned with the correct \"disposition modifier\" error value.",
      "zh-CHS": "本规范允许EDI消息传输，无论是否请求接收通知。但是，如果请求签名收据通知，则需要mic值作为返回收据的一部分，除非出现无法返回mic值的错误情况。在错误情况下，未签名的收据或MDN应返回正确的“处置修饰符”错误值。"
    },
    {
      "indent": 3,
      "text": "-Formatting choices",
      "zh-CHS": "-格式选择"
    },
    {
      "indent": 4,
      "text": "This specification defines the use of two methods for formatting EDI contents that have security applied to it:",
      "zh-CHS": "本规范定义了使用两种方法格式化应用了安全性的EDI内容："
    },
    {
      "indent": 4,
      "text": "-PGP/MIME -S/MIME",
      "zh-CHS": "-PGP/MIME-S/MIME"
    },
    {
      "indent": 4,
      "text": "This specification relies on the guidelines set forth in RFC 2015/3156/2440, as reflected in [4] \"MIME Security with Pretty Good Privacy\" (PGP); OpenPGP Message Format, and RFC 2633/2630 [8] \"S/MIME Version 3 Message Specification; Cryptographic Message Syntax\". PGP/MIME or S/MIME as defined in this Applicability statement.",
      "zh-CHS": "本规范依赖于RFC 2015/3156/2440中规定的指南，如[4]“具有良好隐私的MIME安全”（PGP）中所述；OpenPGP消息格式和RFC 2633/2630[8]“S/MIME版本3消息规范；加密消息语法”。本适用性声明中定义的PGP/MIME或S/MIME。"
    },
    {
      "indent": 3,
      "text": "-Hash function, message digest choices",
      "zh-CHS": "-哈希函数，消息摘要选项"
    },
    {
      "indent": 4,
      "text": "When a signature is used, it is RECOMMENDED that the SHA1 hash algorithm be used for all outgoing messages, and that both MD5 and SHA1 be supported for incoming messages.",
      "zh-CHS": "使用签名时，建议所有传出消息都使用SHA1哈希算法，传入消息同时支持MD5和SHA1。"
    },
    {
      "indent": 4,
      "text": "In summary, the following eight permutations are possible in any given trading relationship:",
      "zh-CHS": "总之，在任何给定的交易关系中，以下八种排列是可能的："
    },
    {
      "indent": 4,
      "text": "(1) Sender sends unencrypted data, does NOT request a receipt.",
      "zh-CHS": "(1) 发件人发送未加密的数据，不请求收据。"
    },
    {
      "indent": 4,
      "text": "(2) Sender sends unencrypted data, requests a signed or unsigned receipt. The receiver sends back the signed or unsigned receipt.",
      "zh-CHS": "(2) 发送方发送未加密的数据，请求签署或未签署的收据。接收方发回已签名或未签名的收据。"
    },
    {
      "indent": 4,
      "text": "(3) Sender sends encrypted data, does NOT request a receipt.",
      "zh-CHS": "(3) 发送方发送加密数据，不请求收据。"
    },
    {
      "indent": 4,
      "text": "(4) Sender sends encrypted data, requests a signed or unsigned receipt. The receiver sends back the signed or unsigned receipt.",
      "zh-CHS": "(4) 发送方发送加密数据，请求签署或未签署的收据。接收方发回已签名或未签名的收据。"
    },
    {
      "indent": 4,
      "text": "(5) Sender sends signed data, does NOT request a signed or unsigned receipt.",
      "zh-CHS": "(5) 发送方发送签名数据，不请求签名或未签名的收据。"
    },
    {
      "indent": 4,
      "text": "(6) Sender sends signed data, requests a signed or unsigned receipt. Receiver sends back the signed or unsigned receipt.",
      "zh-CHS": "(6) 发送方发送签名数据，请求签名或未签名的收据。接收方发回已签名或未签名的收据。"
    },
    {
      "indent": 4,
      "text": "(7) Sender sends encrypted and signed data, does NOT request a signed or unsigned receipt.",
      "zh-CHS": "(7) 发送方发送加密和签名的数据，不请求签名或未签名的收据。"
    },
    {
      "indent": 4,
      "text": "(8) Sender sends encrypted and signed data, requests a signed or unsigned receipt. Receiver sends back the signed or unsigned receipt.",
      "zh-CHS": "(8) 发送方发送加密和签名的数据，请求签名或未签名的收据。接收方发回已签名或未签名的收据。"
    },
    {
      "indent": 3,
      "text": "NOTE: Users can choose any of the eight possibilities, but only example (8), when a signed receipt is requested, offers the whole suite of security features described in the \"Secure transmission loop\" above.",
      "zh-CHS": "注意：用户可以选择八种可能性中的任何一种，但只有示例（8）在请求签名收据时提供了上述“安全传输循环”中所述的整套安全功能。"
    },
    {
      "indent": 0,
      "text": "3.0 Referenced RFCs and Their Contribution",
      "section_title": true,
      "zh-CHS": "3.0 参考RFC及其贡献"
    },
    {
      "indent": 0,
      "text": "3.1 RFC 821 SMTP [7]",
      "section_title": true,
      "zh-CHS": "3.1 RFC 821 SMTP[7]"
    },
    {
      "indent": 3,
      "text": "This is the core mail transfer standard that all MTAs need to adhere to.",
      "zh-CHS": "这是所有MTA都需要遵守的核心邮件传输标准。"
    },
    {
      "indent": 0,
      "text": "3.2 RFC 822 Text Message Format [3]",
      "section_title": true,
      "zh-CHS": "3.2 RFC 822文本消息格式[3]"
    },
    {
      "indent": 3,
      "text": "Defines message header fields and the parts making up a message.",
      "zh-CHS": "定义消息头字段和组成消息的部分。"
    },
    {
      "indent": 0,
      "text": "3.3 RFC 1847 MIME Security Multiparts [6]",
      "section_title": true,
      "zh-CHS": "3.3 RFC 1847 MIME安全多部分[6]"
    },
    {
      "indent": 3,
      "text": "This document defines security multiparts for MIME: multipart/encrypted and multipart/signed.",
      "zh-CHS": "本文档定义了MIME的安全多部分：多部分/加密和多部分/签名。"
    },
    {
      "indent": 0,
      "text": "3.4 RFC 1892 Multipart/report [9]",
      "section_title": true,
      "zh-CHS": "3.4 RFC 1892多部分/报告[9]"
    },
    {
      "indent": 3,
      "text": "This RFC defines the use of the multipart/report content type, something that the MDN RFC 2298 builds upon.",
      "zh-CHS": "此RFC定义了多部分/报表内容类型的使用，MDN RFC 2298是基于此类型构建的。"
    },
    {
      "indent": 0,
      "text": "3.5 RFC 1767 EDI Content [2]",
      "section_title": true,
      "zh-CHS": "3.5 RFC1767电子数据交换内容[2]"
    },
    {
      "indent": 3,
      "text": "This RFC defines the use of content type \"application\" for ANSI X12 (application/EDI-X12), EDIFACT (application/EDIFACT) and mutually defined EDI (application/EDI-Consent).",
      "zh-CHS": "本RFC定义了ANSI X12（应用程序/EDI-X12）、EDIFACT（应用程序/EDIFACT）和相互定义的EDI（应用程序/EDI同意）的内容类型“应用程序”的使用。"
    },
    {
      "indent": 0,
      "text": "3.6 RFC 2015, 3156, 2440 PGP/MIME [4]",
      "section_title": true,
      "zh-CHS": "3.6 RFC 2015，31562440 PGP/MIME[4]"
    },
    {
      "indent": 3,
      "text": "These RFCs define the use of content types \"multipart/encrypted\", \"multipart/signed\", \"application/pgp encrypted\" and \"application/pgp-signature\" for defining MIME PGP content.",
      "zh-CHS": "这些RFC定义了使用内容类型“多部分/加密”、“多部分/签名”、“应用程序/pgp加密”和“应用程序/pgp签名”来定义MIME pgp内容。"
    },
    {
      "indent": 0,
      "text": "3.7 RFC 2045, 2046, and 2049 MIME [1]",
      "section_title": true,
      "zh-CHS": "3.7 RFC 2045、2046和2049 MIME[1]"
    },
    {
      "indent": 3,
      "text": "These are the basic MIME standards, upon which all MIME related RFCs build, including this one. Key contributions include definition of \"content type\", \"sub-type\" and \"multipart\", as well as encoding guidelines, which establishes 7-bit US-ASCII as the canonical character set to be used in Internet messaging.",
      "zh-CHS": "这些是基本的MIME标准，所有与MIME相关的RFC都是基于这些标准构建的，包括这个标准。主要贡献包括“内容类型”、“子类型”和“多部分”的定义，以及编码准则，其中确立了7位US-ASCII作为Internet消息传递中使用的规范字符集。"
    },
    {
      "indent": 0,
      "text": "3.8 RFC 2298 Message Disposition Notification [5]",
      "section_title": true,
      "zh-CHS": "3.8 RFC 2298消息处置通知[5]"
    },
    {
      "indent": 3,
      "text": "This Internet RFC defines how a message disposition notification (MDN) is requested, and the format and syntax of the MDN. The MDN is the basis upon which receipts and signed receipts are defined in this specification.",
      "zh-CHS": "此Internet RFC定义了如何请求消息处置通知（MDN），以及MDN的格式和语法。MDN是本规范中定义收据和签名收据的基础。"
    },
    {
      "indent": 0,
      "text": "3.9 RFC 2633 and 2630 S/MIME Version 3 Message Specifications [8]",
      "section_title": true,
      "zh-CHS": "3.9 RFC 2633和2630 S/MIME版本3消息规范[8]"
    },
    {
      "indent": 3,
      "text": "This specification describes how MIME shall carry CMS Objects.",
      "zh-CHS": "本规范描述MIME如何携带CMS对象。"
    },
    {
      "indent": 0,
      "text": "4.0 Structure of an EDI MIME Message - Applicability",
      "section_title": true,
      "zh-CHS": "4.0 EDI MIME消息的结构-适用性"
    },
    {
      "indent": 0,
      "text": "4.1 Introduction",
      "section_title": true,
      "zh-CHS": "4.1 介绍"
    },
    {
      "indent": 3,
      "text": "The structures below are described hierarchically in terms of which RFC's are applied to form the specific structure. For details of how to code in compliance with all RFC's involved, turn directly to the RFC's referenced.",
      "zh-CHS": "下面的结构按照应用RFC以形成特定结构的方式进行分层描述。有关如何按照所有涉及的RFC编码的详细信息，请直接参考RFC的参考。"
    },
    {
      "indent": 3,
      "text": "Also, these structures describe the initial transmission only. Receipts, and requests for receipts are handled in section 5.",
      "zh-CHS": "此外，这些结构仅描述初始传输。收据和收据请求在第5节中处理。"
    },
    {
      "indent": 0,
      "text": "4.2 Structure of an EDI MIME Message - PGP/MIME",
      "section_title": true,
      "zh-CHS": "4.2 EDI MIME消息的结构-PGP/MIME"
    },
    {
      "indent": 0,
      "text": "4.2.1 No Encryption, No Signature",
      "section_title": true,
      "zh-CHS": "4.2.1 没有加密，没有签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1767 (application/EDIxxxx or /xml)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.2.2 No Encryption, Signature",
      "section_title": true,
      "zh-CHS": "4.2.2 没有加密，没有签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/signed)\n    -RFC1767 (application/EDIxxxx or /xml)\n    -RFC2015/2440/3156 (application/pgp-signature)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.2.3 Encryption, No Signature",
      "section_title": true,
      "zh-CHS": "4.2.3 加密，无签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/encrypted)\n    -RFC2015/2440/3156 (application/pgp-encrypted)\n      -\"Version: 1\"\n    -RFC2015/2440/3156 (application/octet-stream)\n      -RFC1767 (application/EDIxxxx or /xml) (encrypted)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.2.4 Encryption, Signature",
      "section_title": true,
      "zh-CHS": "4.2.4 加密、签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/encrypted)\n    -RFC2015/2440/3156 (application/pgp-encrypted)\n      -\"Version: 1\"\n    -RFC2015/2440/3156 (application/octet-stream)\n      -RFC1847 (multipart/signed)(encrypted)\n        -RFC1767 (application/EDIxxxx or /xml)(encrypted)\n        -RFC2015/2440/3156 (application/pgp-signature)(encrypted)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.3 Structure of an EDI MIME Message - S/MIME",
      "section_title": true,
      "zh-CHS": "4.3 EDI MIME消息的结构-S/MIME"
    },
    {
      "indent": 0,
      "text": "4.3.1 No Encryption, No Signature",
      "section_title": true,
      "zh-CHS": "4.3.1 没有加密，没有签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1767 (application/EDIxxxx or /xml)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.3.2 No Encryption, Signature",
      "section_title": true,
      "zh-CHS": "4.3.2 没有加密，没有签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/signed)\n    -RFC1767 (application/EDIxxxx or /xml)\n    -RFC2633 (application/pkcs7-signature)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.3.3 Encryption, No Signature",
      "section_title": true,
      "zh-CHS": "4.3.3 加密，无签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC2633 (application/pkcs7-mime)\n    -RFC1767 (application/EDIxxxx or /xml) (encrypted)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.3.4 Encryption, Signature",
      "section_title": true,
      "zh-CHS": "4.3.4 加密、签名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC2633 (application/pkcs7-mime)\n    -RFC1847 (multipart/signed) (encrypted)\n      -RFC1767 (application/EDIxxxx or /xml) (encrypted)\n      -RFC2633 (application/pkcs7-signature) (encrypted)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5.0 Receipts",
      "section_title": true,
      "zh-CHS": "5.0 收据"
    },
    {
      "indent": 0,
      "text": "5.1 Introduction",
      "section_title": true,
      "zh-CHS": "5.1 介绍"
    },
    {
      "indent": 3,
      "text": "In order to support non-repudiation of receipt (NRR), a signed receipt, based on digitally signing a message disposition notification, is to be implemented by a receiving trading partner's UA (User Agent). The message disposition notification, specified by RFC 2298 is digitally signed by a receiving trading partner as part of a multipart/signed MIME message.",
      "zh-CHS": "为了支持收据的不可否认性（NRR），基于对消息处置通知进行数字签名的签名收据将由接收交易伙伴的UA（用户代理）实现。RFC 2298指定的消息处置通知由接收交易伙伴作为多部分/签名MIME消息的一部分进行数字签名。"
    },
    {
      "indent": 3,
      "text": "The following support for signed receipts is REQUIRED:",
      "zh-CHS": "需要对签名收据提供以下支持："
    },
    {
      "indent": 3,
      "text": "1) The ability to create a multipart/report; where the report-type = disposition-notification.",
      "zh-CHS": "1) 创建多部分/报告的能力；其中，报告类型=处置通知。"
    },
    {
      "indent": 3,
      "text": "2) The ability to calculate a message integrity check (MIC) on the received message. The calculated MIC value will be returned to the sender of the message inside the signed receipt.",
      "zh-CHS": "2) 对接收到的消息计算消息完整性检查（MIC）的能力。计算出的MIC值将返回给已签名回执内的邮件发件人。"
    },
    {
      "indent": 3,
      "text": "4) The ability to create a multipart/signed content with the message disposition notification as the first body part, and the signature as the second body part.",
      "zh-CHS": "4) 创建多部分/签名内容的能力，其中消息处置通知作为第一个正文部分，签名作为第二个正文部分。"
    },
    {
      "indent": 3,
      "text": "5) The ability to return the signed receipt to the sending trading partner.",
      "zh-CHS": "5) 能够将签署的收据返回给发送交易伙伴。"
    },
    {
      "indent": 3,
      "text": "The signed receipt is used to notify a sending trading partner that requested the signed receipt that:",
      "zh-CHS": "签字收据用于通知请求签字收据的发送交易伙伴："
    },
    {
      "indent": 3,
      "text": "1) The receiving trading partner acknowledges receipt of the sent EDI Interchange.",
      "zh-CHS": "1) 接收交易伙伴确认收到发送的EDI交换。"
    },
    {
      "indent": 3,
      "text": "2) If the sent message was signed, then the receiving trading partner has authenticated the sender of the EDI Interchange.",
      "zh-CHS": "2) 如果发送的信息已签名，则接收交易伙伴已验证EDI交换的发送方。"
    },
    {
      "indent": 3,
      "text": "3) If the sent message was signed, then the receiving trading partner has verified the integrity of the sent EDI Interchange.",
      "zh-CHS": "3) 如果发送的报文已签名，则接收交易伙伴已验证发送的EDI交换的完整性。"
    },
    {
      "indent": 3,
      "text": "Regardless of whether the EDI Interchange was sent in S/MIME or PGP/MIME format, the receiving trading partner's UA MUST provide the following basic processing:",
      "zh-CHS": "无论EDI交换是以S/MIME还是PGP/MIME格式发送，接收交易伙伴的UA必须提供以下基本处理："
    },
    {
      "indent": 3,
      "text": "1) If the sent EDI Interchange is encrypted, then the encrypted symmetric key and initialization vector (if applicable) is decrypted using the receiver's private key.",
      "zh-CHS": "1) 如果发送的EDI交换是加密的，则使用接收方的私钥对加密的对称密钥和初始化向量（如果适用）进行解密。"
    },
    {
      "indent": 3,
      "text": "2) The decrypted symmetric encryption key is then used to decrypt the EDI Interchange.",
      "zh-CHS": "2) 然后使用解密的对称加密密钥对EDI交换进行解密。"
    },
    {
      "indent": 3,
      "text": "3) The receiving trading partner authenticates signatures in a message using the sender's public key. The authentication algorithm performs the following:",
      "zh-CHS": "3) 接收交易伙伴使用发送方的公钥对消息中的签名进行身份验证。身份验证算法执行以下操作："
    },
    {
      "indent": 6,
      "text": "a) The message integrity check (MIC or Message Digest), is decrypted using the sender's public key.",
      "zh-CHS": "a) 消息完整性检查（MIC或消息摘要）使用发送方的公钥解密。"
    },
    {
      "indent": 6,
      "text": "b) A MIC on the signed contents (the MIME header and encoded EDI object, as per RFC 1767) in the message received is calculated using the same one-way hash function that the sending trading partner used.",
      "zh-CHS": "b) 使用发送交易伙伴使用的同一单向散列函数计算接收到的消息中签名内容（MIME头和编码EDI对象，根据RFC 1767）上的MIC。"
    },
    {
      "indent": 6,
      "text": "c) The MIC extracted from the message that was sent, and the MIC calculated using the same one-way hash function that the sending trading partner used is compared for equality.",
      "zh-CHS": "c) 从发送的消息中提取的MIC，以及使用发送交易伙伴使用的相同单向散列函数计算的MIC，将进行相等性比较。"
    },
    {
      "indent": 3,
      "text": "4) The receiving trading partner formats the MDN and sets the calculated MIC into the \"Received-content-MIC\" extension field.",
      "zh-CHS": "4) 接收交易伙伴格式化MDN，并将计算的MIC设置为“接收内容MIC”扩展字段。"
    },
    {
      "indent": 3,
      "text": "5) The receiving trading partner creates a multipart/signed MIME message according to RFC 1847.",
      "zh-CHS": "5) 接收交易伙伴根据RFC 1847创建多部分/签名MIME消息。"
    },
    {
      "indent": 3,
      "text": "6) The MDN is the first part of the multipart/signed message, and the digital signature is created over this MDN, including its MIME headers.",
      "zh-CHS": "6) MDN是多部分/签名消息的第一部分，数字签名是在此MDN上创建的，包括其MIME头。"
    },
    {
      "indent": 3,
      "text": "7) The second part of the multipart/signed message contains the digital signature. The \"protocol\" option specified in the second part of the multipart/signed is as follows:",
      "zh-CHS": "7) 多部分/签名消息的第二部分包含数字签名。multipart/signed协议第二部分中指定的“协议”选项如下："
    },
    {
      "indent": 6,
      "text": "S/MIME: protocol = \"application/pkcs-7-signature\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "PGP/MIME: protocol = \"application/pgp-signature\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "8) The signature information is formatted according to S/MIME or PGP/MIME specifications.",
      "zh-CHS": "8) 签名信息根据S/MIME或PGP/MIME规范格式化。"
    },
    {
      "indent": 3,
      "text": "The EDI Interchange and the RFC 1767 MIME EDI content header, can actually be part of a multi-part MIME content-type. When the EDI Interchange is part of a multi-part MIME content-type, the MIC MUST be calculated across the entire multi-part content, including the MIME headers.",
      "zh-CHS": "EDI交换和RFC1767 MIME EDI内容头实际上可以是多部分MIME内容类型的一部分。当EDI交换是多部分MIME内容类型的一部分时，必须跨整个多部分内容（包括MIME头）计算MIC。"
    },
    {
      "indent": 3,
      "text": "The signed MDN, when received by the sender of the EDI Interchange can be used by the sender:",
      "zh-CHS": "当EDI交换的发送方收到签名的MDN时，发送方可以使用："
    },
    {
      "indent": 3,
      "text": "1) As an acknowledgment that the EDI Interchange sent, was delivered and acknowledged by the receiving trading partner. The receiver does this by returning the original message id of the sent message in the MDN portion of the signed receipt.",
      "zh-CHS": "1) 作为EDI交换发送、交付并由接收交易伙伴确认的确认。接收方通过在签名收据的MDN部分中返回已发送消息的原始消息id来完成此操作。"
    },
    {
      "indent": 3,
      "text": "2) As an acknowledgment that the integrity of the EDI Interchange was verified by the receiving trading partner. The receiver does this by returning the calculated MIC of the received EDI Interchange (and 1767 MIME headers) in the \"Received-content-MIC\" field of the signed MDN.",
      "zh-CHS": "2) 作为对EDI交换完整性已由接收贸易伙伴验证的确认。接收方通过在签名MDN的“received content MIC”字段中返回已接收EDI交换（和1767 MIME头）的计算MIC来实现这一点。"
    },
    {
      "indent": 3,
      "text": "3) As an acknowledgment that the receiving trading partner has authenticated the sender of the EDI Interchange.",
      "zh-CHS": "3) 作为接收交易伙伴已认证EDI交换发送方的确认。"
    },
    {
      "indent": 3,
      "text": "4) As a non-repudiation of receipt when the signed MDN is successfully verified by the sender with the receiving trading partner's public key and the returned mic value inside the MDN is the same as the digest of the original message.",
      "zh-CHS": "4) 当发送方使用接收交易伙伴的公钥成功验证已签名的MDN，并且MDN内返回的mic值与原始消息摘要相同时，作为不可否认的接收。"
    },
    {
      "indent": 0,
      "text": "5.2 Requesting a Signed Receipt",
      "section_title": true,
      "zh-CHS": "5.2 要求签署收据"
    },
    {
      "indent": 3,
      "text": "Message Disposition Notifications are requested as per RFC 2298,",
      "zh-CHS": "根据RFC 2298请求消息处置通知，"
    },
    {
      "indent": 3,
      "text": "\"An Extensible Message Format for Message Disposition Notification\". A request that the receiving user agent issue a message disposition notification is made by placing the following header into the message to be sent:",
      "zh-CHS": "“用于消息处置通知的可扩展消息格式”。通过将以下标头放入要发送的消息中，请求接收用户代理发出消息处置通知："
    },
    {
      "indent": 3,
      "text": "MDN-request-header = \"Disposition-notification-to\" \":\" mail-address",
      "zh-CHS": "MDN request header=“处置通知到”“：”邮件地址"
    },
    {
      "indent": 3,
      "text": "The mail-address field is specified as an RFC 822 user@domain address, and is the return address for the message disposition notification.",
      "zh-CHS": "邮件地址字段指定为RFC 822user@domain地址，是消息处置通知的返回地址。"
    },
    {
      "indent": 3,
      "text": "In addition to requesting a message disposition notification, a message disposition notification that is digitally signed, or what has been referred to as a signed receipt, can be requested by placing the following in the message header following the \"Disposition-Notification-To\" line.",
      "zh-CHS": "除了请求消息处置通知外，还可以通过在“处置通知收件人”行后面的消息头中放置以下内容来请求数字签名的消息处置通知或被称为签名回执的消息处置通知。"
    },
    {
      "indent": 3,
      "text": "Disposition-notification-options = \"Disposition-Notification-Options\" \":\" disposition-notification-parameters",
      "zh-CHS": "处置通知选项=“处置通知选项”：“处置通知参数”"
    },
    {
      "indent": 3,
      "text": "where",
      "zh-CHS": "哪里"
    },
    {
      "indent": 5,
      "text": "disposition-notification-parameters = parameter *(\";\" parameter)",
      "zh-CHS": "处置通知参数=参数*（“；”参数）"
    },
    {
      "indent": 3,
      "text": "where",
      "zh-CHS": "哪里"
    },
    {
      "indent": 5,
      "text": "parameter = attribute \"=\" importance \", \" 1#value\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where",
      "zh-CHS": "哪里"
    },
    {
      "indent": 5,
      "text": "importance = \"required\" | \"optional\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "So the Disposition-notification-options string could be:",
      "zh-CHS": "因此，处置通知选项字符串可以是："
    },
    {
      "indent": 5,
      "text": "signed-receipt-protocol=optional, <protocol symbol>;\nsigned-receipt-micalg=optional, <micalg1>, <micalg2>,...;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The currently supported values for <protocol symbol> are \"pkcs7-signature\", for the S/MIME detached signature format, or \"pgp-signature\", for the pgp signature format.",
      "zh-CHS": "<protocol symbol>当前支持的值是S/MIME分离签名格式的“pkcs7签名”，或pgp签名格式的“pgp签名”。"
    },
    {
      "indent": 3,
      "text": "The currently supported values for MIC algorithm values are:",
      "zh-CHS": "MIC算法值当前支持的值为："
    },
    {
      "indent": 3,
      "text": "Algorithm Value used",
      "zh-CHS": "使用的算法值"
    },
    {
      "indent": 3,
      "text": "MD5 md5 SHA-1 sha1",
      "zh-CHS": "MD5 MD5 SHA-1 sha1"
    },
    {
      "indent": 3,
      "text": "(Historical Note: Some early implementations of EDIINT emitted and expected \"rsa-md5\" and \"rsa-sha1\" for the micalg parameter.) Receiving agents SHOULD be able to recover gracefully from a micalg parameter value that they do not recognize.",
      "zh-CHS": "（历史记录：EDIINT的一些早期实现发出并期望micalg参数为“rsa-md5”和“rsa-sha1”）。接收代理应该能够从它们无法识别的micalg参数值中正常恢复。"
    },
    {
      "indent": 3,
      "text": "An example of a formatted options line would be as follows:",
      "zh-CHS": "格式化选项行的示例如下所示："
    },
    {
      "indent": 3,
      "text": "Disposition-notification-options: signed-receipt-protocol=optional, pkcs7-signature; signed-receipt-micalg=optional, sha1, md5",
      "zh-CHS": "处置通知选项：签名接收协议=可选，pkcs7签名；签名收据micalg=可选，sha1，md5"
    },
    {
      "indent": 3,
      "text": "The semantics of the \"signed-receipt-protocol\" parameter is as follows:",
      "zh-CHS": "“签名接收协议”参数的语义如下："
    },
    {
      "indent": 3,
      "text": "1) The \"signed-receipt-protocol\" parameter is used to request a signed receipt from the recipient trading partner. The \"signed-receipt-protocol\" parameter also specifies the format in which the signed receipt should be returned to the requester.",
      "zh-CHS": "1) “签名收据协议”参数用于向接收方交易伙伴请求签名收据。“签名收据协议”参数还指定签名收据应返回给请求者的格式。"
    },
    {
      "indent": 6,
      "text": "The \"signed-receipt-micalg\" parameter is a list of MIC algorithms preferred by the requester for use in signing the returned receipt. The list of MIC algorithms should be honored by the recipient from left to right.",
      "zh-CHS": "“signed receipt micalg”参数是请求者在签署返回的收据时首选的MIC算法列表。MIC算法列表应由接收者从左到右执行。"
    },
    {
      "indent": 6,
      "text": "Both the \"signed-receipt-protocol\" and the \"signed-receipt-micalg\" option parameters are REQUIRED when requesting a signed receipt.",
      "zh-CHS": "请求签名收据时，需要“签名收据协议”和“签名收据micalg”选项参数。"
    },
    {
      "indent": 3,
      "text": "2) The \"importance\" attribute of \"Optional\" is defined in the MDN RFC 2298 and has the following meaning:",
      "zh-CHS": "2) MDN RFC 2298中定义了“可选”的“重要性”属性，其含义如下："
    },
    {
      "indent": 6,
      "text": "Parameters with an importance of \"Optional\" permit a UA that does not understand the particular options parameter to still generate a MDN in response to a request for a MDN. A UA that does not understand the \"signed-receipt-protocol\" parameter, or the \"signed-receipt-micalg\" will obviously not return a signed receipt.",
      "zh-CHS": "重要性为“可选”的参数允许不了解特定选项参数的UA仍然生成MDN以响应MDN请求。不理解“签名收据协议”参数或“签名收据micalg”的UA显然不会返回签名收据。"
    },
    {
      "indent": 6,
      "text": "The importance of \"Optional\" is used for the signed receipt parameters because it is RECOMMENDED that an MDN be returned to the requesting trading partner even if the recipient could not sign it.",
      "zh-CHS": "“可选”的重要性用于签名收据参数，因为建议将MDN返回给请求交易伙伴，即使收件人无法签名。"
    },
    {
      "indent": 6,
      "text": "The returned MDN will contain information on the disposition of the message as well as why the MDN could not be signed. See the Disposition field in section 5.3 for more information.",
      "zh-CHS": "返回的MDN将包含有关消息处置的信息以及无法对MDN进行签名的原因。有关更多信息，请参见第5.3节中的处置字段。"
    },
    {
      "indent": 6,
      "text": "Within an EDI trading relationship, if a signed receipt is expected and is not returned, then the validity of the transaction is up to the trading partners to resolve. In general, if a signed receipt is required in the trading relationship and is not received, the transaction will likely not be considered valid.",
      "zh-CHS": "在EDI交易关系中，如果预期会有一份已签署的收据，但没有返回，则交易的有效性取决于贸易伙伴来解决。一般而言，如果交易关系中要求签署收据，但未收到，则交易可能被视为无效。"
    },
    {
      "indent": 0,
      "text": "5.2.1 Additional Signed Receipt Considerations",
      "section_title": true,
      "zh-CHS": "5.2.1 附加签字收据注意事项"
    },
    {
      "indent": 3,
      "text": "The \"rules\" stated in Section 2.2.3 for signed receipts are as follows:",
      "zh-CHS": "第2.2.3节中规定的签字收据“规则”如下："
    },
    {
      "indent": 3,
      "text": "1) When a receipt is requested, explicitly specifying that the receipt be signed, then the receipt MUST be returned with a signature.",
      "zh-CHS": "1) 当请求收据时，明确指定要签署收据，则必须返回带有签名的收据。"
    },
    {
      "indent": 3,
      "text": "2) When a receipt is requested, explicitly specifying that the receipt be signed, but the recipient cannot support either the requested protocol format, or requested MIC algorithms, then either a signed or unsigned receipt SHOULD be returned.",
      "zh-CHS": "2) 当请求收据时，明确指定要对收据进行签名，但收件人无法支持请求的协议格式或请求的MIC算法，则应返回已签名或未签名的收据。"
    },
    {
      "indent": 3,
      "text": "3) When a signature is not explicitly requested, or if the signed receipt request parameter is not recognized by the UA, then no receipt, an unsigned receipt, or a signed receipt MAY be returned by the recipient.",
      "zh-CHS": "3) 如果未明确请求签名，或者UA无法识别签名收据请求参数，则收件人可能不会返回收据、未签名收据或签名收据。"
    },
    {
      "indent": 3,
      "text": "NOTE: For Internet EDI, it is RECOMMENDED that when a signature is not explicitly requested, or if parameters are not recognized, that the UA send back at a minimum, an unsigned receipt. If a signed receipt however was always returned as a policy, whether requested or not, then any false unsigned receipts can be repudiated.",
      "zh-CHS": "注：对于Internet EDI，建议UA在未明确请求签名或未识别参数时，至少发送未签名回执。但是，如果签名收据始终作为策略返回（无论是否请求），则任何虚假的未签名收据都可以被拒绝。"
    },
    {
      "indent": 3,
      "text": "When a request for a signed receipt is made, but there is an error in processing the contents of the message, a signed receipt MUST still be returned. The request for a signed receipt SHALL still be honored, though the transaction itself may not be valid. The reason for why the contents could not be processed MUST be set in the \"disposition-field\".",
      "zh-CHS": "当发出签名回执请求，但在处理邮件内容时出错时，仍必须返回签名回执。尽管交易本身可能无效，但签署收据的请求仍应得到满足。无法处理内容的原因必须在“处置字段”中设置。"
    },
    {
      "indent": 3,
      "text": "When a request for a signed receipt is made, the \"Received-content-MIC\" MUST always be returned to the requester. The\"Received-content-MIC\" MUST be calculated as follows:",
      "zh-CHS": "当发出签名收据的请求时，必须始终将“已接收内容MIC”返回给请求者。“接收内容MIC”必须按以下方式计算："
    },
    {
      "indent": 3,
      "text": "- For any signed messages, the MIC to be returned is calculated on the RFC1767 MIME header and content. Canonicalization as specified in RFC 1848 MUST be performed before the MIC is calculated, since the sender requesting the signed receipt was also REQUIRED to canonicalize.",
      "zh-CHS": "- 对于任何已签名的消息，将根据RFC1767 MIME头和内容计算要返回的MIC。RFC 1848中规定的规范化必须在计算MIC之前执行，因为请求签名收据的发送方也需要规范化。"
    },
    {
      "indent": 3,
      "text": "- For encrypted, unsigned messages, the MIC to be returned is calculated on the decrypted RFC 1767 MIME header and content. The content after decryption MUST be canonicalized before the MIC is calculated.",
      "zh-CHS": "- 对于加密的、未签名的消息，将根据解密的RFC1767 MIME头和内容计算要返回的MIC。解密后的内容必须在计算MIC之前规范化。"
    },
    {
      "indent": 3,
      "text": "- For unsigned, unencrypted messages, the MIC MUST be calculated over the message contents prior to Content-Transfer-Encoding and without the MIME or any other RFC 822 headers, since these are sometimes altered or reordered by MTAs.",
      "zh-CHS": "- 对于未签名、未加密的邮件，在内容传输编码之前，必须计算邮件内容的MIC，并且不使用MIME或任何其他RFC 822头，因为MTA有时会更改或重新排序这些头。"
    },
    {
      "indent": 0,
      "text": "5.3 Message Disposition Notification Format",
      "section_title": true,
      "zh-CHS": "5.3 消息处置通知格式"
    },
    {
      "indent": 3,
      "text": "The format of a message disposition notification is specified in RFC 2298. For use in Internet EDI, the following format will be used:",
      "zh-CHS": "RFC 2298中指定了消息处置通知的格式。在Internet EDI中使用时，将使用以下格式："
    },
    {
      "indent": 3,
      "text": "- content-type - per RFC 1892 and the RFC 2298 specification",
      "zh-CHS": "- 内容类型-根据RFC 1892和RFC 2298规范"
    },
    {
      "indent": 3,
      "text": "- reporting-ua-field - per RFC 2298 specification",
      "zh-CHS": "- 报告ua字段-根据RFC 2298规范"
    },
    {
      "indent": 3,
      "text": "- MDN-gateway-field - per RFC 2298 specification",
      "zh-CHS": "- MDN网关字段-根据RFC 2298规范"
    },
    {
      "indent": 3,
      "text": "- original-recipient-field - per RFC 2298 specification",
      "zh-CHS": "- 原始收件人字段-根据RFC 2298规范"
    },
    {
      "indent": 3,
      "text": "- final-recipient-field - per RFC 2298 specification",
      "zh-CHS": "- 最终收件人字段-根据RFC 2298规范"
    },
    {
      "indent": 3,
      "text": "- original-message-id-field - per RFC 2298 specification",
      "zh-CHS": "- 原始消息id字段-根据RFC 2298规范"
    },
    {
      "indent": 3,
      "text": "- disposition-field - the following \"disposition-mode\" values SHOULD be used for Internet EDI:",
      "zh-CHS": "- 处置字段-互联网EDI应使用以下“处置模式”值："
    },
    {
      "indent": 5,
      "text": "\"automatic-action\" - The disposition described by the disposition type was a result of an automatic action, rather than an explicit instruction by the user for this message.",
      "zh-CHS": "“自动操作”-处置类型描述的处置是自动操作的结果，而不是用户对此消息的明确指示。"
    },
    {
      "indent": 5,
      "text": "\"manual-action\" - The disposition described by the disposition type was a result of an explicit instruction by the user rather than some sort of automatically performed action.",
      "zh-CHS": "“手动操作”-处置类型描述的处置是用户明确指示的结果，而不是某种自动执行的操作。"
    },
    {
      "indent": 5,
      "text": "\"MDN-sent-automatically\" - The MDN was sent because the UA had previously been configured to do so.",
      "zh-CHS": "“自动发送MDN”-发送MDN是因为UA之前已配置为这样做。"
    },
    {
      "indent": 5,
      "text": "\"MDN-sent-manually\" - The user explicitly gave permission for this particular MDN to be sent. \"MDN-sent-manually\" is meaningful with \"manual-action\", but not with \"automatic-action\".",
      "zh-CHS": "“手动发送MDN”-用户明确授予发送此特定MDN的权限。“手动发送的MDN”对“手动操作”有意义，但对“自动操作”没有意义。"
    },
    {
      "indent": 3,
      "text": "- disposition-field - the following \"disposition-type\" values SHOULD be used for Internet EDI:",
      "zh-CHS": "- 处置字段-互联网EDI应使用以下“处置类型”值："
    },
    {
      "indent": 5,
      "text": "\"processed\" - The message has been processed in some manner (e.g., printed, faxed, forwarded, gatewayed) without being displayed to the user. The user may or may not see the message later.",
      "zh-CHS": "“已处理”-消息已以某种方式处理（例如，打印、传真、转发、网关），但未显示给用户。用户稍后可能会看到该消息，也可能不会看到。"
    },
    {
      "indent": 5,
      "text": "\"failed\" - A failure occurred that prevented the proper generation of an MDN. More information about the cause of the failure may be contained in a Failure field. The \"failed\" disposition type is not to be used for the situation in which there is some problem in processing the message other than interpreting the request for an MDN. The \"processed\" or other disposition type with appropriate disposition modifiers is to be used in such situations.",
      "zh-CHS": "“失败”-发生了阻止正确生成MDN的故障。故障字段中可能包含有关故障原因的更多信息。“失败”处置类型不用于处理消息时出现问题的情况，而不是解释MDN请求。在这种情况下，应使用带有适当处置修饰符的“已处理”或其他处置类型。"
    },
    {
      "indent": 3,
      "text": "- disposition-field - the following \"disposition-modifier\" values SHOULD be used for Internet EDI:",
      "zh-CHS": "- 处置字段-互联网EDI应使用以下“处置修饰符”值："
    },
    {
      "indent": 5,
      "text": "\"error\" - An error of some sort occurred that prevented successful processing of the message. Further information is contained in an Error field.",
      "zh-CHS": "“错误”-发生了某种类型的错误，阻止了消息的成功处理。更多信息包含在错误字段中。"
    },
    {
      "indent": 5,
      "text": "\"warning\" - The message was successfully processed but some sort of exceptional condition occurred. Further Information is contained in a Warning field.",
      "zh-CHS": "“警告”-消息已成功处理，但出现某种异常情况。更多信息包含在警告字段中。"
    },
    {
      "indent": 0,
      "text": "5.3.1 Message Disposition Notification Extensions",
      "section_title": true,
      "zh-CHS": "5.3.1 消息处置通知扩展"
    },
    {
      "indent": 3,
      "text": "The following \"extension field\" will be added in order to support signed receipts for RFC 1767 MIME content type and multipart MIME content types that include the RFC 1767 MIME content type. The extension field\" defined below follows the \"disposition-field\" in the MDN.",
      "zh-CHS": "将添加以下“扩展字段”，以支持RFC 1767 MIME内容类型和包括RFC 1767 MIME内容类型的多部分MIME内容类型的签名收据。下面定义的“扩展字段”位于MDN中的“处置字段”之后。"
    },
    {
      "indent": 3,
      "text": "The \"Received-content-MIC\" extension field is set when the integrity of the received message is verified. The MIC is the base64 encoded quantity computed over the received message with a hash function. For details of \"what\" the \"Received-content-MIC\" should be calculated over, see Section 5.2.1. The algorithm used to calculate the \"Received-content-MIC\" value MUST be the same as the \"micalg\" value used by the sender in the multipart/signed message. When no signature is received, or the mic-alg parameter is not supported then it is RECOMMENDED that the SHA1 algorithm be used to calculate the MIC on the received message or message contents.",
      "zh-CHS": "验证接收到的消息的完整性时，将设置“接收到的内容麦克风”扩展字段。MIC是使用哈希函数对接收到的消息计算的base64编码量。有关“接收内容MIC”应计算的“内容”的详细信息，请参见第5.2.1节。用于计算“接收内容MIC”值的算法必须与发送方在多部分/签名消息中使用的“micalg”值相同。如果未收到签名，或不支持mic alg参数，则建议使用SHA1算法计算接收到的消息或消息内容的mic。"
    },
    {
      "indent": 3,
      "text": "This field is set only when the contents of the message are processed successfully. This field is used in conjunction with the recipient's signature on the MDN in order for the sender to verify \"non-repudiation of receipt\".",
      "zh-CHS": "此字段仅在成功处理消息内容时设置。此字段与收件人在MDN上的签名一起使用，以便发件人验证“收据的不可否认性”。"
    },
    {
      "indent": 3,
      "text": "- extension field = \"Received-content-MIC\" \":\" MIC",
      "zh-CHS": "- 扩展字段=“接收到的内容麦克风”“：”麦克风"
    },
    {
      "indent": 5,
      "text": "where:",
      "zh-CHS": "哪里："
    },
    {
      "indent": 5,
      "text": "<MIC> = <base64MicValue> \",\" <micalg>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<base64MicValue> = the result of one way hash function, base64 encoded.",
      "zh-CHS": "<base64MicValue>=单向哈希函数的结果，base64编码。"
    },
    {
      "indent": 5,
      "text": "< micalg> = the micalg value defined in RFC1847, an IANA registered MIC algorithm ID token.",
      "zh-CHS": "<micalg>=RFC1847（IANA注册的MIC算法ID令牌）中定义的micalg值。"
    },
    {
      "indent": 0,
      "text": "5.3.2 Disposition Mode, Type, and Modifier Use",
      "section_title": true,
      "zh-CHS": "5.3.2 配置模式、类型和修改器使用"
    },
    {
      "indent": 3,
      "text": "Guidelines for use of the \"disposition-mode\", \"disposition-type\", and \"disposition-modifier\" fields within Internet EDI are discussed in this section. The \"disposition-mode\", \"disposition-type', and \"disposition-modifier' fields are described in detail in RFC 2298. The \"disposition-mode', \"disposition-type\" and \"disposition-modifier\" values SHOULD be used as follows:",
      "zh-CHS": "本节讨论了Internet EDI中“处置模式”、“处置类型”和“处置修改器”字段的使用指南。RFC 2298中详细描述了“处置模式”、“处置类型”和“处置修改器”字段。“处置模式”、“处置类型”和“处置修改器”值应按如下方式使用："
    },
    {
      "indent": 0,
      "text": "5.3.2.1 Successful Processing",
      "section_title": true,
      "zh-CHS": "5.3.2.1 成功处理"
    },
    {
      "indent": 3,
      "text": "When the request for a receipt or signed receipt, and the received message contents are successfully processed by the receiving EDI UA, a receipt or MDN SHOULD be returned with the \"disposition-type\" set to there is no explicit way for a user to control the sending of the MDN, then the first part of the \"disposition-mode\" should be set to \"automatic-action\". When the MDN is being sent under user configurable control, then the first part of the \"disposition-mode\" should be set to \"manual-action\". Since a request for a signed receipt should always be honored, the user MUST not be allowed to configure the UA to not send a signed receipt when the sender requests one.",
      "zh-CHS": "当接收EDI UA成功处理收据或签名收据的请求以及接收到的消息内容时，应返回收据或MDN，并将“处置类型”设置为“用户无法明确控制MDN的发送”，然后将“处置模式”的第一部分设置为“自动操作”。当MDN在用户可配置的控制下发送时，“处置模式”的第一部分应设置为“手动操作”。由于应始终遵守签名收据的请求，因此不允许用户将UA配置为在发送方请求签名收据时不发送签名收据。"
    },
    {
      "indent": 3,
      "text": "The second part of the \"disposition-mode\" is set to \"MDN-sent-manually\" if the user gave explicit permission for the MDN to be sent. Again, the user MUST not be allowed to explicitly refuse to send a signed receipt when the sender requests one. The second part of the \"disposition-mode\" is set to \"MDN-sent-automatically\" whenever the EDI UA sends the MDN automatically, regardless of whether the sending was under a user's, administrator's, or under software control.",
      "zh-CHS": "如果用户明确授予发送MDN的权限，“处置模式”的第二部分设置为“手动发送MDN”。同样，当发送者请求发送签名收据时，不得允许用户明确拒绝发送签名收据。每当EDI UA自动发送MDN时，“处置模式”的第二部分设置为“自动发送MDN”，无论发送是在用户、管理员还是软件控制下。"
    },
    {
      "indent": 3,
      "text": "Since EDI content is generally handled automatically by the EDI UA, a request for a receipt or signed receipt will generally return the following in the \"disposition-field\":",
      "zh-CHS": "由于EDI内容通常由EDI UA自动处理，因此收据或签名收据的请求通常会在“处置字段”中返回以下内容："
    },
    {
      "indent": 5,
      "text": "Disposition: automatic-action/MDN-sent-automatically; processed",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note this specification does not restrict the use of the \"disposition-mode\" to just automatic actions. Manual actions are valid as long as it is kept in mind that a request for a signed receipt MUST be honored.",
      "zh-CHS": "注：本规范不限制“处置模式”仅用于自动操作。只要记住必须遵守签署收据的请求，手动操作就是有效的。"
    },
    {
      "indent": 0,
      "text": "5.3.2.2 Unprocessed Content",
      "section_title": true,
      "zh-CHS": "5.3.2.2 未处理内容"
    },
    {
      "indent": 3,
      "text": "The request for a signed receipt requires the use of two \"disposition-notification-options\", which specify the protocol format of the returned signed receipt, and the MIC algorithm used to calculate the mic over the message contents. The \"disposition-field\" values that should be used in the case where the message content is being rejected or ignored, for instance if the EDI UA determines that a signed receipt cannot be returned because it does not support the requested protocol format, so the EDI UA chooses not to process the message contents itself, should be specified in the MDN \"disposition-field\" as follows:",
      "zh-CHS": "签名回执请求需要使用两个“处置通知选项”，指定返回的签名回执的协议格式，以及用于计算消息内容上的MIC的MIC算法。在拒绝或忽略消息内容的情况下应使用的“处置字段”值，例如，如果EDI UA确定签名回执无法返回，因为它不支持请求的协议格式，因此EDI UA选择不处理消息内容本身，应在MDN“处置字段”中指定，如下所示："
    },
    {
      "indent": 3,
      "text": "Disposition: \"disposition-mode\";\n  failed/Failure: unsupported format",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The syntax of the \"failed\" \"disposition-type\" is general, allowing the sending of any textual information along with the \"failed\" \"disposition-type\". For use in Internet EDI, the following \"failed\" values are defined:",
      "zh-CHS": "“失败的”处置类型“的语法是通用的，允许随“失败的”处置类型一起发送任何文本信息。为了在Internet EDI中使用，定义了以下“失败”值："
    },
    {
      "indent": 3,
      "text": "\"Failure: unsupported format\" \"Failure: unsupported MIC-algorithms\"",
      "zh-CHS": "失败：不支持的格式“”失败：不支持的MIC算法"
    },
    {
      "indent": 0,
      "text": "5.3.2.3 Content Processing Errors",
      "section_title": true,
      "zh-CHS": "5.3.2.3 内容处理错误"
    },
    {
      "indent": 3,
      "text": "When errors occur processing the received message content, the \"disposition-field\" should be set to the \"processed\" \"disposition-type\" value and the \"error\" \"disposition-modifier\" value. For use in Internet EDI, the following \"error\" \"disposition-modifier\" values are defined:",
      "zh-CHS": "处理收到的邮件内容时出现错误，“处置字段”应设置为“已处理”“处置类型”值和“错误”“处置修饰符”值。为了在Internet EDI中使用，定义了以下“错误”“处置修饰符”值："
    },
    {
      "indent": 3,
      "text": "\"Error: decryption-failed\" - the receiver could not decrypt the message contents.",
      "zh-CHS": "“错误：解密失败”-接收方无法解密消息内容。"
    },
    {
      "indent": 3,
      "text": "\"Error: authentication-failed\" - the receiver could not authenticate the sender.",
      "zh-CHS": "“错误：身份验证失败”-接收方无法对发送方进行身份验证。"
    },
    {
      "indent": 3,
      "text": "\"Error: integrity-check-failed\" - the receiver could not verify content integrity.",
      "zh-CHS": "“错误：完整性检查失败”-接收器无法验证内容完整性。"
    },
    {
      "indent": 3,
      "text": "\"Error: unexpected-processing-error\" - a catch-all for any additional processing errors.",
      "zh-CHS": "“错误：意外处理错误”-任何其他处理错误的总括。"
    },
    {
      "indent": 3,
      "text": "An example of how the \"disposition-field\" would look when content processing errors are detected is as follows:",
      "zh-CHS": "检测到内容处理错误时，“处置字段”的外观示例如下："
    },
    {
      "indent": 3,
      "text": "Disposition: \"disposition-mode\";\n  processed/Error: decryption-failed",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5.3.2.4 Content Processing Warnings",
      "section_title": true,
      "zh-CHS": "5.3.2.4 内容处理警告"
    },
    {
      "indent": 3,
      "text": "Situations arise in EDI where even if a trading partner cannot be authenticated correctly, the trading partners still agree to continue processing the EDI transactions. Transaction reconciliation is done between the trading partners at a later time. In the content processing warning situations as described above, the \"disposition-field\" SHOULD be set to the \"processed\" \"disposition-type\" value, and the \"warning\" \"disposition-modifier\" value. For use in Internet EDI, the following \"warning\" \"disposition-modifier\" values are defined:",
      "zh-CHS": "在电子数据交换中出现的情况是，即使贸易伙伴无法正确认证，贸易伙伴仍然同意继续处理电子数据交换交易。交易对账在交易伙伴之间稍后进行。在如上所述的内容处理警告情况下，“处置字段”应设置为“已处理”“处置类型”值和“警告”“处置修饰符”值。为了在Internet EDI中使用，定义了以下“警告”“处置修饰符”值："
    },
    {
      "indent": 3,
      "text": "\"Warning: authentication-failed, processing continued\"",
      "zh-CHS": "警告：身份验证失败，处理继续"
    },
    {
      "indent": 3,
      "text": "An example of how the \"disposition-field\" would look when content processing warnings are detected is as follows:",
      "zh-CHS": "检测到内容处理警告时，“处置字段”的外观示例如下："
    },
    {
      "indent": 3,
      "text": "Disposition: \"disposition-mode\"; processed/Warning:\n              authentication-failed, processing continued",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5.4 Message Disposition Notification Processing",
      "section_title": true,
      "zh-CHS": "5.4 消息处置通知处理"
    },
    {
      "indent": 0,
      "text": "5.4.1 Large File Processing",
      "section_title": true,
      "zh-CHS": "5.4.1 大文件处理"
    },
    {
      "indent": 3,
      "text": "Large EDI Interchanges sent via SMTP can be automatically fragmented by some message transfer agents. A subtype of message/partial, is defined in RFC 2045 [1] to allow large objects to be delivered as separate pieces of mail and to be automatically reassembled by the receiving user agent. Using message/partial, can help alleviate fragmentation of large messages by different message transfer agents, but does not completely eliminate the problem. It is still possible that a piece of a partial message, upon re-assembly, may prove to contain a partial message as well. This is allowed by the Internet standards, and it is the responsibility of the user agent to reassemble the fragmented pieces.",
      "zh-CHS": "通过SMTP发送的大型EDI交换可以由某些邮件传输代理自动分段。RFC 2045[1]中定义了message/partial的子类型，以允许将大型对象作为单独的邮件发送，并由接收用户代理自动重新组装。使用message/partial有助于减轻不同消息传输代理对大型消息的分段，但不能完全消除该问题。在重新组装时，部分消息的一部分也可能包含部分消息。互联网标准允许这样做，用户代理负责重新组装碎片。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that the size of the EDI Interchange sent via SMTP be configurable so that if fragmentation is needed, then message/partial can be used to send the large EDI Interchange in smaller pieces. RFC 2045 [1] defines the use of Content-Type: message/partial.",
      "zh-CHS": "建议可配置通过SMTP发送的EDI交换的大小，以便在需要分段时，可以使用message/partial以较小的片段发送大型EDI交换。RFC 2045[1]定义了内容类型的使用：message/partial。"
    },
    {
      "indent": 3,
      "text": "Note: Support of the message/partial content type for use in Internet EDI is OPTIONAL and in the absence of knowledge that the recipient supports partial it SHOULD NOT be used.",
      "zh-CHS": "注：支持在Internet EDI中使用的邮件/部分内容类型是可选的，如果不知道收件人支持部分内容类型，则不应使用。"
    },
    {
      "indent": 3,
      "text": "The receiving UA is required to re-assemble the original message before sending the message disposition notification to the original sender of the message. A message disposition notification is used to specify the disposition of the entire message that was sent, and should not be returned by a processing UA until the entire message is received, even if the received message requires re-assembling.",
      "zh-CHS": "在向消息的原始发送方发送消息处置通知之前，接收UA需要重新组装原始消息。消息处置通知用于指定已发送的整个消息的处置，在接收到整个消息之前，处理UA不应返回该通知，即使接收到的消息需要重新组装。"
    },
    {
      "indent": 0,
      "text": "5.4.2 Example",
      "section_title": true,
      "zh-CHS": "5.4.2 实例"
    },
    {
      "indent": 3,
      "text": "The following is an example of a signed receipt returned by a UA after successfully processing a MIME EDI content type. The sending trading partner has requested a return signed receipt.",
      "zh-CHS": "以下是UA在成功处理MIME EDI内容类型后返回的签名收据的示例。发送交易伙伴已请求返回签名收据。"
    },
    {
      "indent": 3,
      "text": "This example follows the S/MIME application/pkcs-7-signature format.",
      "zh-CHS": "此示例遵循S/MIME应用程序/pkcs-7签名格式。"
    },
    {
      "indent": 3,
      "text": "NOTE: This example is provided as an illustration only, and is not considered part of the protocol specification. If an example conflicts with the protocol definitions specified above or in the other referenced RFCs, the example is wrong.",
      "zh-CHS": "注：本示例仅作为说明提供，不被视为协议规范的一部分。如果示例与上述或其他参考RFC中指定的协议定义冲突，则示例是错误的。"
    },
    {
      "indent": 8,
      "text": "To: <recipient email>\nSubject:\nFrom: <sender email>\nDate: <date>\nMime-Version: 1.0\nContent-Type: multipart/signed; boundary=\"separator\";\n  micalg=sha1; protocol=\"application/pkcs7-signature\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "  --separator\n& Content-Type:  multipart/report; report-type=disposition\n&   notification;  boundary=\"xxxxx\"\n&\n& --xxxxx\n& Content-Type: text/plain\n&\n& The message sent to Recipient <Recipient@cyclonesoftware.com>\n& has been received, the EDI Interchange was successfully\n& decrypted and its integrity was verified.  In addition, the",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "& sender of the message, Sender <Edi_Sender@cyclonesoftware.com>\n& was authenticated as the originator of the message.  There is\n& no guarantee however that the EDI Interchange was\n& syntactically correct, or was received by the EDI\n& application.\n&\n& --xxxxx\n& Content-Type:  message/disposition-notification\n&\n& Reporting-UA: Interchange.cyclonesoftware.com (CI 2.2)\n& Original-Recipient: rfc822; Edi_Recipient@cyclonesoftware.com\n& Final-Recipient: rfc822;  Edi_Recipient@cyclonesoftware.com\n& Original-Message-ID: <17759920005.12345@cyclonesoftware.com >\n& Disposition: automatic-action/MDN-sent-automatically; processed\n& Received-content-MIC: Q2hlY2sgSW50XwdyaXRIQ, sha1\n&\n& --xxxxx\n& Content-Type: message/rfc822\n&\n& To: <recipient email>\n& Subject:\n&\n&  [additional header fields go here]\n&\n& --xxxxx--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "--separator\nContent-Type: application/pkcs7-signature; name=smime.p7s;\nContent-Transfer-Encoding: base64\nContent-Disposition: attachment; filename=smime.p7s",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "MIIHygYJKoZIhvcNAQcDoIIHuzCCB7cCAQAxgfIwge8CAQAwg ZgwgYMxFjAUBgNVBAMTDVRlcnJ5IEhhcmRpbmcxEDAOBgNVBA oTB0NZQ0xPTkUxDDAKBgNVBAsTA04vQTEQMA4GA1UEBxMHU=",
      "zh-CHS": "MIIHygYJKoZIhvcNAQcDoIIHuzCCB7cCAQAxgfIwge8CAQAwg zgwgymxfjaubgaunvbamtdvrlcnj5iehhcmrpbmcxcedaobgnvba otb0nzq0xptkuxddakbgnvbbasta04vqteqma4ga1uebxmhu="
    },
    {
      "indent": 6,
      "text": "--separator--",
      "zh-CHS": "--分离器--"
    },
    {
      "indent": 3,
      "text": "Notes:",
      "zh-CHS": "笔记："
    },
    {
      "indent": 3,
      "text": "-The lines preceded with \"&\" is what the signature is calculated over.",
      "zh-CHS": "-前面带“&”的行是签名的计算范围。"
    },
    {
      "indent": 4,
      "text": "(For details on how to prepare the multipart/signed with protocol = \"application/pkcs7-signature\" see the \"S/MIME Message Specification, PKCS Security Services for MIME\".)",
      "zh-CHS": "（有关如何准备multipart/signed with protocol=“application/pkcs7 signature”的详细信息，请参阅“S/MIME消息规范，PKCS Security Services For MIME”。）"
    },
    {
      "indent": 3,
      "text": "Note: As specified by RFC 1892 [9], returning the original or portions of the original message in the third body part of the multipart/report is not required. This is an optional body part. It is RECOMMENDED that the received headers from the original message be placed in the third body part, as they can be helpful in tracking problems.",
      "zh-CHS": "注：根据RFC 1892[9]的规定，不需要在多部分/报告的第三个正文部分中返回原始消息的原件或部分内容。这是可选的身体部位。建议将从原始邮件接收到的头放在第三个正文部分，因为它们有助于跟踪问题。"
    },
    {
      "indent": 3,
      "text": "Also note that the textual first body part of the multipart/report can be used to include a more detailed explanation of the error conditions reported by the disposition headers. The first body part of the multipart/report when used in this way, allows a person to better diagnose a problem in detail.",
      "zh-CHS": "还请注意，multipart/report的正文第一部分可用于包含由disposition标头报告的错误条件的更详细解释。以这种方式使用多部分/报告的第一个正文部分，可以让用户更好地详细诊断问题。"
    },
    {
      "indent": 0,
      "text": "6.0 Public Key Certificate Handling",
      "section_title": true,
      "zh-CHS": "6.0 公钥证书处理"
    },
    {
      "indent": 0,
      "text": "6.1 Near Term Approach",
      "section_title": true,
      "zh-CHS": "6.1 近期方法"
    },
    {
      "indent": 3,
      "text": "In the near term, the exchange of public keys and certification of these keys must be handled as part of the process of establishing a trading partnership. The UA and/or EDI application interface must maintain a database of public keys used for encryption or signatures, in addition to the mapping between EDI trading partner ID and RFC 822 [3] email address. The procedures for establishing a trading partnership and configuring the secure EDI messaging system might vary among trading partners and software packages.",
      "zh-CHS": "在短期内，公钥的交换和这些密钥的认证必须作为建立贸易伙伴关系过程的一部分来处理。UA和/或EDI应用程序接口必须维护用于加密或签名的公钥数据库，以及EDI贸易伙伴ID和RFC 822[3]电子邮件地址之间的映射。建立贸易伙伴关系和配置安全EDI消息传递系统的程序可能因贸易伙伴和软件包而异。"
    },
    {
      "indent": 3,
      "text": "For systems which make use of X.509 certificates, it is RECOMMENDED that trading partners self-certify each other if an agreed upon certification authority is not used. It is highly RECOMMENDED that when trading partners are using S/MIME, that they also exchange public key certificates using the recommendations specified in the S/MIME Version 3 Message Specification. The message formats and S/MIME conformance requirements for certificate exchange are specified in this document.",
      "zh-CHS": "对于使用X.509证书的系统，如果未使用约定的证书颁发机构，建议贸易伙伴相互自我认证。强烈建议贸易伙伴在使用S/MIME时，也使用S/MIME版本3消息规范中指定的建议交换公钥证书。本文档规定了证书交换的消息格式和S/MIME一致性要求。"
    },
    {
      "indent": 3,
      "text": "This applicability statement does NOT require the use of a certification authority. The use of a certification authority is therefore OPTIONAL.",
      "zh-CHS": "本适用性声明不要求使用认证机构。因此，证书颁发机构的使用是可选的。"
    },
    {
      "indent": 0,
      "text": "6.2 Long Term Approach",
      "section_title": true,
      "zh-CHS": "6.2 长期办法"
    },
    {
      "indent": 3,
      "text": "In the long term, additional Internet-EDI standards may be developed to simplify the process of establishing a trading partnership, including the third party authentication of trading partners, as well as attributes of the trading relationship.",
      "zh-CHS": "从长远来看，可能会制定额外的互联网EDI标准，以简化建立贸易伙伴关系的过程，包括贸易伙伴的第三方认证以及贸易关系的属性。"
    },
    {
      "indent": 0,
      "text": "7.0 Security Considerations",
      "section_title": true,
      "zh-CHS": "7.0 安全考虑"
    },
    {
      "indent": 3,
      "text": "This entire document is concerned with secure transport of business to business data, and considers both privacy and authentication issues.",
      "zh-CHS": "整个文档涉及企业间数据的安全传输，并考虑了隐私和身份验证问题。"
    },
    {
      "indent": 3,
      "text": "Extracted from S/MIME Version 2 Message Specification:",
      "zh-CHS": "从S/MIME版本2消息规范中提取："
    },
    {
      "indent": 3,
      "text": "40-bit encryption is considered weak by most cryptographers. Using weak cryptography offers little actual security over sending plain text. However, other features of S/MIME, such as the specification of tripleDES or AES and the ability to announce stronger cryptographic capabilities to parties with whom you communicate, allow senders to create messages that use strong encryption. Using weak cryptography is never recommended unless the only alternative is no cryptography. When feasible, sending and receiving agents should inform senders and recipients the relative cryptographic strength of messages.",
      "zh-CHS": "大多数密码学家认为40位加密很弱。使用弱加密比发送纯文本提供的实际安全性小。但是，S/MIME的其他功能，如tripleDES或AES的规范以及向与您通信的各方宣布更强加密功能的能力，允许发件人创建使用强加密的消息。除非唯一的选择是不加密，否则永远不建议使用弱加密。在可行的情况下，发送和接收代理应通知发送方和接收方消息的相对加密强度。"
    },
    {
      "indent": 3,
      "text": "Extracted from S/MIME Version 2 Certificate Handling:",
      "zh-CHS": "从S/MIME版本2证书处理中提取："
    },
    {
      "indent": 3,
      "text": "When processing certificates, there are many situations where the processing might fail. Because the processing may be done by a user agent, a security gateway, or other program, there is no single way to handle such failures. Just because the methods to handle the failures has not been listed, however, the reader should not assume that they are not important. The opposite is true: if a certificate is not provably valid and associated with the message, the processing software should take immediate and noticeable steps to inform the end user about it.",
      "zh-CHS": "在处理证书时，有许多情况下处理可能会失败。由于处理可能由用户代理、安全网关或其他程序完成，因此没有单一的方法来处理此类故障。然而，仅仅因为没有列出处理故障的方法，读者就不应该认为它们不重要。反之亦然：如果证书不可证明有效且与消息关联，则处理软件应立即采取明显的步骤通知最终用户。"
    },
    {
      "indent": 3,
      "text": "Some of the many places where signature and certificate checking might fail include:",
      "zh-CHS": "签名和证书检查可能失败的许多地方包括："
    },
    {
      "indent": 3,
      "text": "- no certificate chain leads to a trusted CA - no ability to check the CRL for a certificate - an invalid CRL was received - the CRL being checked is expired - the certificate is expired - the certificate has been revoked",
      "zh-CHS": "- 没有证书链导致受信任的CA-无法检查CRL中的证书-收到无效的CRL-正在检查的CRL已过期-证书已过期-证书已吊销"
    },
    {
      "indent": 3,
      "text": "There are certainly other instances where a certificate may be invalid, and it is the responsibility of the processing software to check them all thoroughly, and to decide what to do if the check fails.",
      "zh-CHS": "当然，在其他情况下，证书可能是无效的，处理软件有责任彻底检查所有证书，并决定如果检查失败怎么办。"
    },
    {
      "indent": 0,
      "text": "8.0 Acknowledgments",
      "section_title": true,
      "zh-CHS": "8.0 致谢"
    },
    {
      "indent": 3,
      "text": "Many thanks go out to the previous authors of the MIME-based Secure EDI IETF Draft: Mats Jansson.",
      "zh-CHS": "非常感谢基于MIME的安全EDI IETF草案的前几位作者：Mats Jansson。"
    },
    {
      "indent": 3,
      "text": "The authors would like to extend special thanks to Carl Hage, Jun Ding, Dale Moberg, and Karen Rosenthal for providing the team with valuable, and very thorough feedback. Without participants like those cited above, these efforts become hard to complete in a way useful to the users and implementers of the technology.",
      "zh-CHS": "作者要特别感谢Carl Hage、Jun Ding、Dale Moberg和Karen Rosenthal为团队提供了宝贵且非常全面的反馈。如果没有上面提到的参与者，这些工作将很难以对技术的用户和实现者有用的方式完成。"
    },
    {
      "indent": 3,
      "text": "In addition, the authors would like to thank Harald Alvestrand, Jim Galvin, and Roger Fajman for their guidance and input.",
      "zh-CHS": "此外，作者还要感谢Harald Alvestrand、Jim Galvin和Roger Fajman的指导和投入。"
    },
    {
      "indent": 0,
      "text": "9.0 References",
      "section_title": true,
      "zh-CHS": "9.0 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Borenstein, N. and N. Freed, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "zh-CHS": "[1] Borenstein，N.和N.Freed，“多用途互联网邮件扩展（MIME）第一部分：互联网邮件正文格式”，RFC 20451996年11月。"
    },
    {
      "indent": 8,
      "text": "Borenstein, N. and N. Freed, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types\", RFC 2046, November 1996.",
      "zh-CHS": "Borenstein，N.和N.Freed，“多用途互联网邮件扩展（MIME）第二部分：媒体类型”，RFC 20461996年11月。"
    },
    {
      "indent": 8,
      "text": "Borenstein, N. and N. Freed, \"Multipurpose Internet Mail Extensions (MIME) Part Five: Conformance Criteria and Examples\", RFC 2049, November 1996.",
      "zh-CHS": "Borenstein，N.和N.Freed，“多用途互联网邮件扩展（MIME）第五部分：一致性标准和示例”，RFC 2049，1996年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Crocker, D., \"MIME Encapsulation of EDI Objects\", RFC 1767, March 1995.",
      "zh-CHS": "[2] Crocker，D.，“EDI对象的MIME封装”，RFC17671995年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Resnick, P., \"Internet Message Format\", RFC 2822, April 2001.",
      "zh-CHS": "[3] Resnick，P.，“互联网信息格式”，RFC 2822，2001年4月。"
    },
    {
      "indent": 3,
      "text": "[4] Elkins, M., \"MIME Security With Pretty Good Privacy (PGP)\", RFC 2015, October 1996.",
      "zh-CHS": "[4] Elkins，M.，“具有良好隐私的MIME安全性（PGP）”，RFC 2015，1996年10月。"
    },
    {
      "indent": 8,
      "text": "Callas, J., Donnerhacke, L., Finney, H. and R.Thayer \"OpenPGP Message Format\", RFC 2440, November 1998.",
      "zh-CHS": "Callas，J.，Donnerhacke，L.，Finney，H.和R.Thayer“OpenPGP消息格式”，RFC2440，1998年11月。"
    },
    {
      "indent": 8,
      "text": "Elkins, M., Del Torto, D., Levien, R. and T. Roessler \"MIME Security with OpenPGP\", RFC 3156, August 2001.",
      "zh-CHS": "Elkins，M.，Del Torto，D.，Levien，R.和T.Roessler“OpenPGP的MIME安全”，RFC 3156，2001年8月。"
    },
    {
      "indent": 3,
      "text": "[5] Fajman, R., \"An Extensible Message Format for Message Disposition Notifications\", RFC 2298, March 1998.",
      "zh-CHS": "[5] Fajman，R.，“用于消息处置通知的可扩展消息格式”，RFC 2298，1998年3月。"
    },
    {
      "indent": 3,
      "text": "[6] Galvin, J., Murphy, S., Crocker, S. and N. Freed, \"Security Multiparts for MIME: Multipart/Signed and Multipart/Encrypted\", RFC 1847, October 1995.",
      "zh-CHS": "[6] Galvin，J.，Murphy，S.，Crocker，S.和N.Freed，“MIME的安全多部分：多部分/签名和多部分/加密”，RFC 1847，1995年10月。"
    },
    {
      "indent": 3,
      "text": "[7] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 2821, April 1982.",
      "zh-CHS": "[7] 《简单邮件传输协议》，RFC 28211982年4月。"
    },
    {
      "indent": 3,
      "text": "[8] Ramsdell, B., \"S/MIME Version 3 Message Specification; Cryptographic Message Syntax\", RFC 2633, June 1999.",
      "zh-CHS": "[8] Ramsdell，B.，“S/MIME版本3消息规范；加密消息语法”，RFC 2633，1999年6月。"
    },
    {
      "indent": 8,
      "text": "Housley, R., \"Cryptographic Message Syntax\", RFC 2630, June 1999.",
      "zh-CHS": "Housley，R.，“加密消息语法”，RFC 2630，1999年6月。"
    },
    {
      "indent": 3,
      "text": "[9] Vaudreuil, G., \"The Multipart/Report Content Type for the Reporting of Mail System Administrative Messages\", RFC 1892, January 1996.",
      "zh-CHS": "[9] Vaudreuil，G.“邮件系统管理消息报告的多部分/报告内容类型”，RFC 1892，1996年1月。"
    },
    {
      "indent": 0,
      "text": "Appendix IANA Registration Form",
      "zh-CHS": "附录A注册表格"
    },
    {
      "indent": 0,
      "text": "A.1 IANA registration of the signed-receipt-protocol content disposition parameter",
      "zh-CHS": "A.1签名接收协议内容处置参数的IANA注册"
    },
    {
      "indent": 6,
      "text": "Parameter-name: signed-receipt-protocol Syntax: See section 5.2 of this document Specification: See section 5.2 of this document",
      "zh-CHS": "参数名称：签名接收协议语法：见本文件第5.2节规范：见本文件第5.2节"
    },
    {
      "indent": 0,
      "text": "A.2 IANA registration of the signed-receipt-micalg content disposition parameter",
      "zh-CHS": "A.2 IANA已签名收据micalg内容处置参数的注册"
    },
    {
      "indent": 6,
      "text": "Parameter-name: signed-receipt-micalg Syntax: See section 5.2 of this document Specification: See section 5.2 of this document",
      "zh-CHS": "参数名称：签名收据micalg语法：见本文件第5.2节规范：见本文件第5.2节"
    },
    {
      "indent": 0,
      "text": "A.3 IANA registration of the Received-content-MIC MDN extension field name",
      "zh-CHS": "A.3接收内容MIC MDN扩展字段名称的IANA注册"
    },
    {
      "indent": 6,
      "text": "Extension field name: Received-content-MIC Syntax: See section 5.3.1 of this document Specification: See section 5.3.1 of this document",
      "zh-CHS": "扩展字段名称：接收内容麦克风语法：见本文件第5.3.1节规范：见本文件第5.3.1节"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Terry Harding Cyclone Commerce 8388 E. Hartford Drive Scottsdale, Arizona 85255, USA",
      "zh-CHS": "美国亚利桑那州斯科茨代尔哈特福德大道东8388号，邮编85255"
    },
    {
      "indent": 3,
      "text": "EMail: tharding@cyclonecommerce.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Chuck Shih Gartner Group 251 River Oaks Parkway San Jose, CA 95134-1913 USA",
      "zh-CHS": "Chuck Shih Gartner Group 251美国加利福尼亚州圣何塞河橡树公园路95134-1913"
    },
    {
      "indent": 3,
      "text": "EMail: chuck.shih@gartner.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Rik Drummond Drummond Group P.O. Box 101567 Ft. Worth, TX 76105 USA",
      "zh-CHS": "美国德克萨斯州沃思堡101567 Ft.Rik Drummond Drummond Group邮政信箱，邮编：76105"
    },
    {
      "indent": 3,
      "text": "EMail: rik@drummondgroup.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns. v This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。v本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}