{
  "title": {
    "text": "RFC 3463:  Enhanced Mail System Status Codes ",
    "zh-CHS": "RFC 3463"
  },
  "number": 3463,
  "created_at": "2021-10-27 05:36:05.901770+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       G. Vaudreuil\nRequest for Comments: 3463                           Lucent Technologies\nObsoletes: 1893                                             January 2003\nCategory: Standards Track",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Enhanced Mail System Status Codes",
      "zh-CHS": "增强的邮件系统状态代码"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a set of extended status codes for use within the mail system for delivery status reports, tracking, and improved diagnostics. In combination with other information provided in the Delivery Status Notification (DSN) delivery report, these codes facilitate media and language independent rendering of message delivery status.",
      "zh-CHS": "本文档定义了一组扩展状态代码，用于邮件系统中的传递状态报告、跟踪和改进的诊断。结合交付状态通知（DSN）交付报告中提供的其他信息，这些代码有助于独立于媒体和语言呈现邮件交付状态。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.   Overview ......................................................2\n2.   Status Code Structure .........................................3\n3.   Enumerated Status Codes .......................................5\n  3.1  Other or Undefined Status ...................................6\n  3.2  Address Status ..............................................6\n  3.3  Mailbox Status ..............................................7\n  3.4  Mail system status ..........................................8\n  3.5  Network and Routing Status ..................................9\n  3.6  Mail Delivery Protocol Status ..............................10\n  3.7  Message Content or Message Media Status ....................11\n  3.8  Security or Policy Status ..................................12\n4.   References ...................................................13\n5.   Security Considerations ......................................13\n     Appendix A - Collected Status Codes ..........................14\n     Appendix B - Changes from RFC1893 ............................15\n     Author's Address .............................................15\n     Full Copyright Statement .....................................16",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "zh-CHS": "1. 概述"
    },
    {
      "indent": 3,
      "text": "There is a need for a standard mechanism for the reporting of mail system errors richer than the limited set offered by SMTP and the system specific text descriptions sent in mail messages. There is a pressing need for a rich machine-readable, human language independent status code for use in delivery status notifications [DSN]. This document proposes a new set of status codes for this purpose.",
      "zh-CHS": "需要一种标准机制来报告邮件系统错误，该机制比SMTP和邮件消息中发送的系统特定文本描述提供的有限集更丰富。迫切需要一种丰富的机器可读的、独立于人类语言的状态代码，用于传递状态通知[DSN]。本文件为此目的提出了一套新的状态代码。"
    },
    {
      "indent": 3,
      "text": "SMTP [SMTP] error codes have historically been used for reporting mail system errors. Because of limitations in the SMTP code design, these are not suitable for use in delivery status notifications. SMTP provides about 12 useful codes for delivery reports. The majority of the codes are protocol specific response codes such as the 354 response to the SMTP data command. Each of the 12 useful codes are overloaded to indicate several error conditions. SMTP suffers some scars from history, most notably the unfortunate damage to the reply code extension mechanism by uncontrolled use. This proposal facilitates future extensibility by requiring the client to interpret unknown error codes according to the theory of codes while requiring servers to register new response codes.",
      "zh-CHS": "SMTP[SMTP]错误代码历来用于报告邮件系统错误。由于SMTP代码设计中的限制，这些代码不适合用于传递状态通知。SMTP为传递报告提供了大约12个有用的代码。大多数代码是特定于协议的响应代码，例如对SMTP数据命令的354响应。12个有用代码中的每一个都被重载以指示多个错误条件。SMTP在历史上留下了一些伤痕，最明显的是由于不受控制的使用而对回复代码扩展机制造成了不幸的破坏。该方案要求客户端根据代码理论解释未知错误代码，同时要求服务器注册新的响应代码，从而促进了未来的可扩展性。"
    },
    {
      "indent": 3,
      "text": "The SMTP theory of reply codes are partitioned in the number space in such a manner that the remaining available codes will not provide the space needed. The most critical example is the existence of only 5 remaining codes for mail system errors. The mail system classification includes both host and mailbox error conditions. The remaining third digit space would be completely consumed as needed to indicate MIME and media conversion errors and security system errors.",
      "zh-CHS": "回复码的SMTP理论在数字空间中进行分区，这样剩余的可用码就不会提供所需的空间。最关键的例子是，邮件系统错误只剩下5个代码。邮件系统分类包括主机和邮箱错误情况。剩余的第三位数空间将根据需要完全消耗，以指示MIME和媒体转换错误以及安全系统错误。"
    },
    {
      "indent": 3,
      "text": "A revision to the SMTP theory of reply codes to better distribute the error conditions in the number space will necessarily be incompatible with SMTP. Further, consumption of the remaining reply-code number space for delivery notification reporting will reduce the available codes for new ESMTP extensions.",
      "zh-CHS": "对回复码SMTP理论的修订，以更好地分配数字空间中的错误条件，必然与SMTP不兼容。此外，用于传递通知报告的剩余回复代码编号空间的消耗将减少新ESMTP扩展的可用代码。"
    },
    {
      "indent": 3,
      "text": "The following status code set is based on the SMTP theory of reply codes. It adopts the success, permanent error, and transient error semantics of the first value, with a further description and classification in the second. This proposal re-distributes the classifications to better distribute the error conditions, such as separating mailbox from host errors.",
      "zh-CHS": "以下状态代码集基于SMTP回复代码理论。它采用了第一个值的成功、永久错误和暂时错误语义，第二个值进一步描述和分类。此建议重新分发分类以更好地分发错误条件，例如将邮箱与主机错误分离。"
    },
    {
      "indent": 3,
      "text": "Document Conventions",
      "zh-CHS": "文件惯例"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照BCP 14[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Status Code Structure",
      "section_title": true,
      "zh-CHS": "2. 状态代码结构"
    },
    {
      "indent": 3,
      "text": "This document defines a new set of status codes to report mail system conditions. These status codes are used for media and language independent status reporting. They are not intended for system specific diagnostics.",
      "zh-CHS": "本文档定义了一组新的状态代码，用于报告邮件系统状况。这些状态代码用于媒体和语言独立的状态报告。它们不用于系统特定的诊断。"
    },
    {
      "indent": 3,
      "text": "The syntax of the new status codes is defined as:",
      "zh-CHS": "新状态代码的语法定义如下："
    },
    {
      "indent": 6,
      "text": "status-code = class \".\" subject \".\" detail",
      "zh-CHS": "状态代码=类别“主题”详细信息"
    },
    {
      "indent": 6,
      "text": "class = \"2\"/\"4\"/\"5\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "subject = 1*3digit",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "detail = 1*3digit",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "White-space characters and comments are NOT allowed within a status-code. Each numeric sub-code within the status-code MUST be expressed without leading zero digits.",
      "zh-CHS": "状态代码中不允许使用空格字符和注释。状态代码中的每个数字子代码必须表示为无前导零位。"
    },
    {
      "indent": 3,
      "text": "Status codes consist of three numerical fields separated by \".\". The first sub-code indicates whether the delivery attempt was successful. The second sub-code indicates the probable source of any delivery anomalies, and the third sub-code indicates a precise error condition.",
      "zh-CHS": "状态代码由三个以“.”分隔的数字字段组成。第一个子代码指示传递尝试是否成功。第二个子代码表示任何交付异常的可能来源，第三个子代码表示精确的错误情况。"
    },
    {
      "indent": 3,
      "text": "Example: 2.1.23",
      "zh-CHS": "示例：2.1.23"
    },
    {
      "indent": 3,
      "text": "The code space defined is intended to be extensible only by standards track documents. Mail system specific status codes should be mapped as close as possible to the standard status codes. Servers should send only defined, registered status codes. System specific errors and diagnostics should be carried by means other than status codes.",
      "zh-CHS": "定义的代码空间旨在仅由标准跟踪文档扩展。邮件系统特定的状态代码应尽可能接近标准状态代码。服务器应仅发送已定义、已注册的状态代码。系统特定错误和诊断应通过状态代码以外的方式进行。"
    },
    {
      "indent": 3,
      "text": "New subject and detail codes will be added over time. Because the number space is large, it is not intended that published status codes will ever be redefined or eliminated. Clients should preserve the extensibility of the code space by reporting the general error described in the subject sub-code when the specific detail is unrecognized.",
      "zh-CHS": "随着时间的推移，将添加新的主题和详细代码。由于数字空间很大，因此不会重新定义或消除已发布的状态代码。当无法识别特定细节时，客户端应通过报告主题子代码中描述的一般错误来保持代码空间的可扩展性。"
    },
    {
      "indent": 3,
      "text": "The class sub-code provides a broad classification of the status. The enumerated values for each class are defined as:",
      "zh-CHS": "类子代码提供了状态的广泛分类。每个类的枚举值定义为："
    },
    {
      "indent": 6,
      "text": "2.XXX.XXX Success",
      "zh-CHS": "2.XXX.XXX成功"
    },
    {
      "indent": 9,
      "text": "Success specifies that the DSN is reporting a positive delivery action. Detail sub-codes may provide notification of transformations required for delivery.",
      "zh-CHS": "成功指定DSN正在报告积极的传递操作。详细子代码可提供交付所需转换的通知。"
    },
    {
      "indent": 6,
      "text": "4.XXX.XXX Persistent Transient Failure",
      "zh-CHS": "4.XXX.XXX持续瞬态故障"
    },
    {
      "indent": 9,
      "text": "A persistent transient failure is one in which the message as sent is valid, but persistence of some temporary condition has caused abandonment or delay of attempts to send the message. If this code accompanies a delivery failure report, sending in the future may be successful.",
      "zh-CHS": "持久性瞬态故障是指发送的消息有效，但某些临时条件的持久性导致发送消息的尝试被放弃或延迟。如果此代码伴随交付失败报告，则将来发送可能会成功。"
    },
    {
      "indent": 6,
      "text": "5.XXX.XXX Permanent Failure",
      "zh-CHS": "5.XXX.XXX永久性故障"
    },
    {
      "indent": 9,
      "text": "A permanent failure is one which is not likely to be resolved by resending the message in the current form. Some change to the message or the destination must be made for successful delivery.",
      "zh-CHS": "永久性故障是不可能通过以当前形式重新发送消息来解决的故障。要成功传递，必须对邮件或目的地进行一些更改。"
    },
    {
      "indent": 3,
      "text": "A client must recognize and report class sub-code even where subsequent subject sub-codes are unrecognized.",
      "zh-CHS": "客户必须识别并报告类别子代码，即使后续主题子代码无法识别。"
    },
    {
      "indent": 3,
      "text": "The subject sub-code classifies the status. This value applies to each of the three classifications. The subject sub-code, if recognized, must be reported even if the additional detail provided by the detail sub-code is not recognized. The enumerated values for the subject sub-code are:",
      "zh-CHS": "主题子代码对状态进行分类。此值适用于三个分类中的每一个。即使无法识别明细子代码提供的附加明细，也必须报告主题子代码（如果已识别）。主题子代码的枚举值为："
    },
    {
      "indent": 6,
      "text": "X.0.XXX Other or Undefined Status",
      "zh-CHS": "X.0.XXX其他或未定义状态"
    },
    {
      "indent": 9,
      "text": "There is no additional subject information available.",
      "zh-CHS": "没有其他可用的主题信息。"
    },
    {
      "indent": 6,
      "text": "X.1.XXX Addressing Status",
      "zh-CHS": "X.1.XXX寻址状态"
    },
    {
      "indent": 9,
      "text": "The address status reports on the originator or destination address. It may include address syntax or validity. These errors can generally be corrected by the sender and retried.",
      "zh-CHS": "地址状态报告发起者或目标地址。它可能包括地址语法或有效性。这些错误通常可以由发送方更正并重试。"
    },
    {
      "indent": 6,
      "text": "X.2.XXX Mailbox Status",
      "zh-CHS": "X.2.XXX邮箱状态"
    },
    {
      "indent": 9,
      "text": "Mailbox status indicates that something having to do with the mailbox has caused this DSN. Mailbox issues are assumed to be under the general control of the recipient.",
      "zh-CHS": "邮箱状态表示与邮箱有关的某种原因导致了此DSN。邮箱问题假定由收件人进行一般控制。"
    },
    {
      "indent": 6,
      "text": "X.3.XXX Mail System Status",
      "zh-CHS": "X.3.XXX邮件系统状态"
    },
    {
      "indent": 9,
      "text": "Mail system status indicates that something having to do with the destination system has caused this DSN. System issues are assumed to be under the general control of the destination system administrator.",
      "zh-CHS": "邮件系统状态表示与目标系统有关的原因导致了此DSN。系统问题假定在目标系统管理员的一般控制下。"
    },
    {
      "indent": 6,
      "text": "X.4.XXX Network and Routing Status",
      "zh-CHS": "X.4.XXX网络和路由状态"
    },
    {
      "indent": 9,
      "text": "The networking or routing codes report status about the delivery system itself. These system components include any necessary infrastructure such as directory and routing services. Network issues are assumed to be under the control of the destination or intermediate system administrator.",
      "zh-CHS": "网络或路由代码报告传送系统本身的状态。这些系统组件包括任何必要的基础设施，如目录和路由服务。网络问题假定由目标或中间系统管理员控制。"
    },
    {
      "indent": 6,
      "text": "X.5.XXX Mail Delivery Protocol Status",
      "zh-CHS": "X.5.XXX邮件传递协议状态"
    },
    {
      "indent": 9,
      "text": "The mail delivery protocol status codes report failures involving the message delivery protocol. These failures include the full range of problems resulting from implementation errors or an unreliable connection.",
      "zh-CHS": "邮件传递协议状态代码报告涉及邮件传递协议的故障。这些故障包括由实现错误或不可靠连接导致的所有问题。"
    },
    {
      "indent": 6,
      "text": "X.6.XXX Message Content or Media Status",
      "zh-CHS": "X.6.XXX消息内容或媒体状态"
    },
    {
      "indent": 9,
      "text": "The message content or media status codes report failures involving the content of the message. These codes report failures due to translation, transcoding, or otherwise unsupported message media. Message content or media issues are under the control of both the sender and the receiver, both of which must support a common set of supported content-types.",
      "zh-CHS": "消息内容或媒体状态代码报告涉及消息内容的故障。这些代码报告由于翻译、转码或其他不受支持的消息媒体而导致的故障。消息内容或媒体问题由发送方和接收方共同控制，两者都必须支持一组通用的受支持内容类型。"
    },
    {
      "indent": 6,
      "text": "X.7.XXX Security or Policy Status",
      "zh-CHS": "X.7.XXX安全或策略状态"
    },
    {
      "indent": 9,
      "text": "The security or policy status codes report failures involving policies such as per-recipient or per-host filtering and cryptographic operations. Security and policy status issues are assumed to be under the control of either or both the sender and recipient. Both the sender and recipient must permit the exchange of messages and arrange the exchange of necessary keys and certificates for cryptographic operations.",
      "zh-CHS": "安全或策略状态代码报告涉及策略的故障，例如每个收件人或每个主机筛选和加密操作。安全和策略状态问题假定由发送方和接收方中的一方或双方控制。发送方和接收方都必须允许交换消息，并安排交换加密操作所需的密钥和证书。"
    },
    {
      "indent": 0,
      "text": "3. Enumerated Status Codes",
      "section_title": true,
      "zh-CHS": "3. 枚举状态代码"
    },
    {
      "indent": 3,
      "text": "The following section defines and describes the detail sub-code. The detail value provides more information about the status and is defined relative to the subject of the status.",
      "zh-CHS": "下一节定义并描述了详细的子代码。详细信息值提供有关状态的更多信息，并相对于状态的主题进行定义。"
    },
    {
      "indent": 0,
      "text": "3.1 Other or Undefined Status",
      "section_title": true,
      "zh-CHS": "3.1 其他或未定义的状态"
    },
    {
      "indent": 6,
      "text": "X.0.0 Other undefined Status",
      "zh-CHS": "X.0.0 其他未定义状态"
    },
    {
      "indent": 9,
      "text": "Other undefined status is the only undefined error code. It should be used for all errors for which only the class of the error is known.",
      "zh-CHS": "其他未定义状态是唯一未定义的错误代码。它应该用于所有只知道错误类别的错误。"
    },
    {
      "indent": 0,
      "text": "3.2 Address Status",
      "section_title": true,
      "zh-CHS": "3.2 地址状态"
    },
    {
      "indent": 6,
      "text": "X.1.0 Other address status",
      "zh-CHS": "X.1.0 其他地址状态"
    },
    {
      "indent": 9,
      "text": "Something about the address specified in the message caused this DSN.",
      "zh-CHS": "此DSN是由消息中指定的地址引起的。"
    },
    {
      "indent": 6,
      "text": "X.1.1 Bad destination mailbox address",
      "zh-CHS": "X.1.1 错误的目标邮箱地址"
    },
    {
      "indent": 9,
      "text": "The mailbox specified in the address does not exist. For Internet mail names, this means the address portion to the left of the \"@\" sign is invalid. This code is only useful for permanent failures.",
      "zh-CHS": "地址中指定的邮箱不存在。对于Internet邮件名称，这意味着“@”符号左侧的地址部分无效。此代码仅对永久性故障有用。"
    },
    {
      "indent": 6,
      "text": "X.1.2 Bad destination system address",
      "zh-CHS": "X.1.2 目标系统地址错误"
    },
    {
      "indent": 9,
      "text": "The destination system specified in the address does not exist or is incapable of accepting mail. For Internet mail names, this means the address portion to the right of the \"@\" is invalid for mail. This code is only useful for permanent failures.",
      "zh-CHS": "地址中指定的目标系统不存在或无法接受邮件。对于Internet邮件名称，这意味着“@”右侧的地址部分对邮件无效。此代码仅对永久性故障有用。"
    },
    {
      "indent": 6,
      "text": "X.1.3 Bad destination mailbox address syntax",
      "zh-CHS": "X.1.3 错误的目标邮箱地址语法"
    },
    {
      "indent": 9,
      "text": "The destination address was syntactically invalid. This can apply to any field in the address. This code is only useful for permanent failures.",
      "zh-CHS": "目标地址在语法上无效。这可以应用于地址中的任何字段。此代码仅对永久性故障有用。"
    },
    {
      "indent": 6,
      "text": "X.1.4 Destination mailbox address ambiguous",
      "zh-CHS": "X.1.4 目标邮箱地址不明确"
    },
    {
      "indent": 9,
      "text": "The mailbox address as specified matches one or more recipients on the destination system. This may result if a heuristic address mapping algorithm is used to map the specified address to a local mailbox name.",
      "zh-CHS": "指定的邮箱地址与目标系统上的一个或多个收件人匹配。如果使用启发式地址映射算法将指定地址映射到本地邮箱名称，则可能会出现这种情况。"
    },
    {
      "indent": 6,
      "text": "X.1.5 Destination address valid",
      "zh-CHS": "X.1.5 目的地址有效"
    },
    {
      "indent": 9,
      "text": "This mailbox address as specified was valid. This status code should be used for positive delivery reports.",
      "zh-CHS": "指定的邮箱地址有效。此状态代码应用于正向交付报告。"
    },
    {
      "indent": 6,
      "text": "X.1.6 Destination mailbox has moved, No forwarding address",
      "zh-CHS": "X.1.6 目标邮箱已移动，没有转发地址"
    },
    {
      "indent": 9,
      "text": "The mailbox address provided was at one time valid, but mail is no longer being accepted for that address. This code is only useful for permanent failures.",
      "zh-CHS": "提供的邮箱地址一度有效，但该地址不再接受邮件。此代码仅对永久性故障有用。"
    },
    {
      "indent": 6,
      "text": "X.1.7 Bad sender's mailbox address syntax",
      "zh-CHS": "X.1.7 发件人的邮箱地址语法错误"
    },
    {
      "indent": 9,
      "text": "The sender's address was syntactically invalid. This can apply to any field in the address.",
      "zh-CHS": "发件人的地址在语法上无效。这可以应用于地址中的任何字段。"
    },
    {
      "indent": 6,
      "text": "X.1.8 Bad sender's system address",
      "zh-CHS": "X.1.8 发件人的系统地址不正确"
    },
    {
      "indent": 9,
      "text": "The sender's system specified in the address does not exist or is incapable of accepting return mail. For domain names, this means the address portion to the right of the \"@\" is invalid for mail.",
      "zh-CHS": "地址中指定的发件人系统不存在或无法接受回信。对于域名，这意味着“@”右侧的地址部分对邮件无效。"
    },
    {
      "indent": 0,
      "text": "3.3 Mailbox Status",
      "section_title": true,
      "zh-CHS": "3.3 邮箱状态"
    },
    {
      "indent": 6,
      "text": "X.2.0 Other or undefined mailbox status",
      "zh-CHS": "X.2.0 其他或未定义的邮箱状态"
    },
    {
      "indent": 9,
      "text": "The mailbox exists, but something about the destination mailbox has caused the sending of this DSN.",
      "zh-CHS": "邮箱存在，但目标邮箱的某些信息导致发送此DSN。"
    },
    {
      "indent": 6,
      "text": "X.2.1 Mailbox disabled, not accepting messages",
      "zh-CHS": "X.2.1 邮箱已禁用，不接受邮件"
    },
    {
      "indent": 9,
      "text": "The mailbox exists, but is not accepting messages. This may be a permanent error if the mailbox will never be re-enabled or a transient error if the mailbox is only temporarily disabled.",
      "zh-CHS": "邮箱存在，但不接受邮件。如果邮箱永远不会重新启用，则这可能是一个永久性错误；如果邮箱只是暂时禁用，则这可能是一个暂时性错误。"
    },
    {
      "indent": 6,
      "text": "X.2.2 Mailbox full",
      "zh-CHS": "X.2.2 邮箱已满"
    },
    {
      "indent": 9,
      "text": "The mailbox is full because the user has exceeded a per-mailbox administrative quota or physical capacity. The general semantics implies that the recipient can delete messages to make more space available. This code should be used as a persistent transient failure.",
      "zh-CHS": "邮箱已满，因为用户已超过每个邮箱的管理配额或物理容量。一般语义意味着收件人可以删除消息以提供更多可用空间。此代码应作为持续瞬态故障使用。"
    },
    {
      "indent": 6,
      "text": "X.2.3 Message length exceeds administrative limit",
      "zh-CHS": "X.2.3 消息长度超过管理限制"
    },
    {
      "indent": 9,
      "text": "A per-mailbox administrative message length limit has been exceeded. This status code should be used when the per-mailbox message length limit is less than the general system limit. This code should be used as a permanent failure.",
      "zh-CHS": "已超过每个邮箱的管理邮件长度限制。当每邮箱邮件长度限制小于一般系统限制时，应使用此状态代码。此代码应作为永久故障使用。"
    },
    {
      "indent": 6,
      "text": "X.2.4 Mailing list expansion problem",
      "zh-CHS": "X.2.4 邮件列表扩展问题"
    },
    {
      "indent": 9,
      "text": "The mailbox is a mailing list address and the mailing list was unable to be expanded. This code may represent a permanent failure or a persistent transient failure.",
      "zh-CHS": "邮箱是邮件列表地址，无法扩展邮件列表。此代码可能表示永久性故障或持续瞬态故障。"
    },
    {
      "indent": 0,
      "text": "3.4 Mail system status",
      "section_title": true,
      "zh-CHS": "3.4 邮件系统状态"
    },
    {
      "indent": 6,
      "text": "X.3.0 Other or undefined mail system status",
      "zh-CHS": "X.3.0 其他或未定义的邮件系统状态"
    },
    {
      "indent": 9,
      "text": "The destination system exists and normally accepts mail, but something about the system has caused the generation of this DSN.",
      "zh-CHS": "目标系统存在并且通常接受邮件，但是系统的某些方面导致了此DSN的生成。"
    },
    {
      "indent": 6,
      "text": "X.3.1 Mail system full",
      "zh-CHS": "X.3.1 邮件系统已满"
    },
    {
      "indent": 9,
      "text": "Mail system storage has been exceeded. The general semantics imply that the individual recipient may not be able to delete material to make room for additional messages. This is useful only as a persistent transient error.",
      "zh-CHS": "已超出邮件系统存储空间。一般语义意味着单个接收者可能无法删除材料来为其他消息腾出空间。这仅在持续性瞬态错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.3.2 System not accepting network messages",
      "zh-CHS": "X.3.2 系统不接受网络消息"
    },
    {
      "indent": 9,
      "text": "The host on which the mailbox is resident is not accepting messages. Examples of such conditions include an immanent shutdown, excessive load, or system maintenance. This is useful for both permanent and persistent transient errors.",
      "zh-CHS": "邮箱所在的主机不接受邮件。此类情况的示例包括内部停机、过载或系统维护。这对于永久性和持久性瞬态错误都很有用。"
    },
    {
      "indent": 6,
      "text": "X.3.3 System not capable of selected features",
      "zh-CHS": "X.3.3 系统不支持所选功能"
    },
    {
      "indent": 9,
      "text": "Selected features specified for the message are not supported by the destination system. This can occur in gateways when features from one domain cannot be mapped onto the supported feature in another.",
      "zh-CHS": "目标系统不支持为邮件指定的选定功能。当一个域中的功能无法映射到另一个域中受支持的功能时，网关中可能会出现这种情况。"
    },
    {
      "indent": 6,
      "text": "X.3.4 Message too big for system",
      "zh-CHS": "X.3.4 消息对系统来说太大"
    },
    {
      "indent": 9,
      "text": "The message is larger than per-message size limit. This limit may either be for physical or administrative reasons. This is useful only as a permanent error.",
      "zh-CHS": "该消息大于每消息大小限制。此限制可能是由于物理或管理原因。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.3.5 System incorrectly configured",
      "zh-CHS": "X.3.5 系统配置不正确"
    },
    {
      "indent": 9,
      "text": "The system is not configured in a manner that will permit it to accept this message.",
      "zh-CHS": "系统的配置方式不允许其接受此消息。"
    },
    {
      "indent": 0,
      "text": "3.5 Network and Routing Status",
      "section_title": true,
      "zh-CHS": "3.5 网络和路由状态"
    },
    {
      "indent": 6,
      "text": "X.4.0 Other or undefined network or routing status",
      "zh-CHS": "X.4.0 其他或未定义的网络或路由状态"
    },
    {
      "indent": 9,
      "text": "Something went wrong with the networking, but it is not clear what the problem is, or the problem cannot be well expressed with any of the other provided detail codes.",
      "zh-CHS": "网络出现了一些问题，但不清楚问题是什么，或者问题无法用提供的任何其他详细代码很好地表达出来。"
    },
    {
      "indent": 6,
      "text": "X.4.1 No answer from host",
      "zh-CHS": "X.4.1 主持人没有回答"
    },
    {
      "indent": 9,
      "text": "The outbound connection attempt was not answered, because either the remote system was busy, or was unable to take a call. This is useful only as a persistent transient error.",
      "zh-CHS": "出站连接尝试未被应答，因为远程系统正忙或无法接听电话。这仅在持续性瞬态错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.4.2 Bad connection",
      "zh-CHS": "X.4.2 坏连接"
    },
    {
      "indent": 9,
      "text": "The outbound connection was established, but was unable to complete the message transaction, either because of time-out, or inadequate connection quality. This is useful only as a persistent transient error.",
      "zh-CHS": "已建立出站连接，但由于超时或连接质量不足，无法完成消息事务。这仅在持续性瞬态错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.4.3 Directory server failure",
      "zh-CHS": "X.4.3 目录服务器故障"
    },
    {
      "indent": 9,
      "text": "The network system was unable to forward the message, because a directory server was unavailable. This is useful only as a persistent transient error.",
      "zh-CHS": "由于目录服务器不可用，网络系统无法转发邮件。这仅在持续性瞬态错误时有用。"
    },
    {
      "indent": 9,
      "text": "The inability to connect to an Internet DNS server is one example of the directory server failure error.",
      "zh-CHS": "无法连接到Internet DNS服务器是目录服务器故障错误的一个示例。"
    },
    {
      "indent": 6,
      "text": "X.4.4 Unable to route",
      "zh-CHS": "X.4.4 无法路由"
    },
    {
      "indent": 9,
      "text": "The mail system was unable to determine the next hop for the message because the necessary routing information was unavailable from the directory server. This is useful for both permanent and persistent transient errors.",
      "zh-CHS": "邮件系统无法确定邮件的下一个跃点，因为目录服务器无法提供必要的路由信息。这对于永久性和持久性瞬态错误都很有用。"
    },
    {
      "indent": 9,
      "text": "A DNS lookup returning only an SOA (Start of Administration) record for a domain name is one example of the unable to route error.",
      "zh-CHS": "DNS查找仅返回域名的SOA（管理开始）记录是无法路由错误的一个示例。"
    },
    {
      "indent": 6,
      "text": "X.4.5 Mail system congestion",
      "zh-CHS": "X.4.5 邮件系统拥塞"
    },
    {
      "indent": 9,
      "text": "The mail system was unable to deliver the message because the mail system was congested. This is useful only as a persistent transient error.",
      "zh-CHS": "由于邮件系统拥挤，邮件系统无法传递邮件。这仅在持续性瞬态错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.4.6 Routing loop detected",
      "zh-CHS": "X.4.6 检测到路由循环"
    },
    {
      "indent": 9,
      "text": "A routing loop caused the message to be forwarded too many times, either because of incorrect routing tables or a user-forwarding loop. This is useful only as a persistent transient error.",
      "zh-CHS": "路由循环导致邮件转发次数过多，原因可能是路由表不正确或用户转发循环。这仅在持续性瞬态错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.4.7 Delivery time expired",
      "zh-CHS": "X.4.7 交货期到期"
    },
    {
      "indent": 9,
      "text": "The message was considered too old by the rejecting system, either because it remained on that host too long or because the time-to-live value specified by the sender of the message was exceeded. If possible, the code for the actual problem found when delivery was attempted should be returned rather than this code.",
      "zh-CHS": "拒绝系统认为该消息太旧，原因可能是该消息在该主机上停留的时间太长，或者超出了消息发件人指定的生存时间值。如果可能，应返回尝试交付时发现的实际问题的代码，而不是此代码。"
    },
    {
      "indent": 0,
      "text": "3.6 Mail Delivery Protocol Status",
      "section_title": true,
      "zh-CHS": "3.6 邮件传递协议状态"
    },
    {
      "indent": 6,
      "text": "X.5.0 Other or undefined protocol status",
      "zh-CHS": "X.5.0 其他或未定义的协议状态"
    },
    {
      "indent": 9,
      "text": "Something was wrong with the protocol necessary to deliver the message to the next hop and the problem cannot be well expressed with any of the other provided detail codes.",
      "zh-CHS": "将消息传递到下一个跃点所需的协议有问题，并且无法使用提供的任何其他详细代码很好地表达该问题。"
    },
    {
      "indent": 6,
      "text": "X.5.1 Invalid command",
      "zh-CHS": "X.5.1 无效命令"
    },
    {
      "indent": 9,
      "text": "A mail transaction protocol command was issued which was either out of sequence or unsupported. This is useful only as a permanent error.",
      "zh-CHS": "发出的邮件事务协议命令顺序错误或不受支持。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.5.2 Syntax error",
      "zh-CHS": "X.5.2 语法错误"
    },
    {
      "indent": 9,
      "text": "A mail transaction protocol command was issued which could not be interpreted, either because the syntax was wrong or the command is unrecognized. This is useful only as a permanent error.",
      "zh-CHS": "发出了无法解释的邮件事务协议命令，原因可能是语法错误或该命令无法识别。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.5.3 Too many recipients",
      "zh-CHS": "X.5.3 收件人太多"
    },
    {
      "indent": 9,
      "text": "More recipients were specified for the message than could have been delivered by the protocol. This error should normally result in the segmentation of the message into two, the remainder of the recipients to be delivered on a subsequent delivery attempt. It is included in this list in the event that such segmentation is not possible.",
      "zh-CHS": "为邮件指定的收件人数超过了协议可能传递的收件人数。此错误通常会导致邮件分成两部分，其余收件人将在后续传递尝试中传递。如果无法进行此类分段，则应将其包括在本列表中。"
    },
    {
      "indent": 6,
      "text": "X.5.4 Invalid command arguments",
      "zh-CHS": "X.5.4 无效的命令参数"
    },
    {
      "indent": 9,
      "text": "A valid mail transaction protocol command was issued with invalid arguments, either because the arguments were out of range or represented unrecognized features. This is useful only as a permanent error.",
      "zh-CHS": "发出的有效邮件事务协议命令带有无效参数，原因可能是参数超出范围或表示无法识别的功能。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.5.5 Wrong protocol version",
      "zh-CHS": "X.5.5 错误的协议版本"
    },
    {
      "indent": 9,
      "text": "A protocol version mis-match existed which could not be automatically resolved by the communicating parties.",
      "zh-CHS": "存在无法由通信方自动解决的协议版本不匹配。"
    },
    {
      "indent": 0,
      "text": "3.7 Message Content or Message Media Status",
      "section_title": true,
      "zh-CHS": "3.7 消息内容或消息媒体状态"
    },
    {
      "indent": 6,
      "text": "X.6.0 Other or undefined media error",
      "zh-CHS": "X.6.0 其他或未定义的媒体错误"
    },
    {
      "indent": 9,
      "text": "Something about the content of a message caused it to be considered undeliverable and the problem cannot be well expressed with any of the other provided detail codes.",
      "zh-CHS": "消息内容的某些方面导致消息被视为无法传递，并且无法使用提供的任何其他详细代码很好地表达该问题。"
    },
    {
      "indent": 6,
      "text": "X.6.1 Media not supported",
      "zh-CHS": "X.6.1 不支持媒体"
    },
    {
      "indent": 9,
      "text": "The media of the message is not supported by either the delivery protocol or the next system in the forwarding path. This is useful only as a permanent error.",
      "zh-CHS": "传递协议或转发路径中的下一个系统均不支持邮件的媒体。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.6.2 Conversion required and prohibited",
      "zh-CHS": "X.6.2 需要和禁止转换"
    },
    {
      "indent": 9,
      "text": "The content of the message must be converted before it can be delivered and such conversion is not permitted. Such prohibitions may be the expression of the sender in the message itself or the policy of the sending host.",
      "zh-CHS": "必须先转换邮件内容，然后才能传递邮件，不允许进行此类转换。此类禁止可能是发送方在消息本身中的表达，也可能是发送主机的策略。"
    },
    {
      "indent": 6,
      "text": "X.6.3 Conversion required but not supported",
      "zh-CHS": "X.6.3 需要转换，但不支持"
    },
    {
      "indent": 9,
      "text": "The message content must be converted in order to be forwarded but such conversion is not possible or is not practical by a host in the forwarding path. This condition may result when an ESMTP gateway supports 8bit transport but is not able to downgrade the message to 7 bit as required for the next hop.",
      "zh-CHS": "必须转换消息内容才能转发，但转发路径中的主机不可能或不可行进行此类转换。当ESMTP网关支持8位传输，但无法按照下一跳的要求将消息降级到7位时，可能会出现这种情况。"
    },
    {
      "indent": 6,
      "text": "X.6.4 Conversion with loss performed",
      "zh-CHS": "X.6.4 进行有损转换"
    },
    {
      "indent": 9,
      "text": "This is a warning sent to the sender when message delivery was successfully but when the delivery required a conversion in which some data was lost. This may also be a permanent error if the sender has indicated that conversion with loss is prohibited for the message.",
      "zh-CHS": "这是在邮件传递成功但传递需要转换（其中某些数据丢失）时发送给发件人的警告。如果发件人已指示禁止对邮件进行带丢失的转换，则这也可能是一个永久性错误。"
    },
    {
      "indent": 6,
      "text": "X.6.5 Conversion Failed",
      "zh-CHS": "X.6.5 转换失败"
    },
    {
      "indent": 9,
      "text": "A conversion was required but was unsuccessful. This may be useful as a permanent or persistent temporary notification.",
      "zh-CHS": "需要进行转换，但未成功。作为永久或持久的临时通知，这可能很有用。"
    },
    {
      "indent": 0,
      "text": "3.8 Security or Policy Status",
      "section_title": true,
      "zh-CHS": "3.8 安全或策略状态"
    },
    {
      "indent": 6,
      "text": "X.7.0 Other or undefined security status",
      "zh-CHS": "X.7.0 其他或未定义的安全状态"
    },
    {
      "indent": 9,
      "text": "Something related to security caused the message to be returned, and the problem cannot be well expressed with any of the other provided detail codes. This status code may also be used when the condition cannot be further described because of security policies in force.",
      "zh-CHS": "与安全性相关的内容导致返回消息，并且无法使用提供的任何其他详细代码很好地表达该问题。当由于有效的安全策略而无法进一步描述情况时，也可以使用此状态代码。"
    },
    {
      "indent": 6,
      "text": "X.7.1 Delivery not authorized, message refused",
      "zh-CHS": "X.7.1 未授权传递，邮件被拒绝"
    },
    {
      "indent": 9,
      "text": "The sender is not authorized to send to the destination. This can be the result of per-host or per-recipient filtering. This memo does not discuss the merits of any such filtering, but provides a mechanism to report such. This is useful only as a permanent error.",
      "zh-CHS": "发件人无权发送到目标。这可能是每个主机或每个收件人筛选的结果。本备忘录未讨论任何此类过滤的优点，但提供了报告此类过滤的机制。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.7.2 Mailing list expansion prohibited",
      "zh-CHS": "X.7.2 禁止扩展邮件列表"
    },
    {
      "indent": 9,
      "text": "The sender is not authorized to send a message to the intended mailing list. This is useful only as a permanent error.",
      "zh-CHS": "发件人无权向指定的邮件列表发送邮件。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.7.3 Security conversion required but not possible",
      "zh-CHS": "X.7.3 需要安全转换，但不可能"
    },
    {
      "indent": 9,
      "text": "A conversion from one secure messaging protocol to another was required for delivery and such conversion was not possible. This is useful only as a permanent error.",
      "zh-CHS": "交付时需要从一个安全消息传递协议转换到另一个安全消息传递协议，而这种转换是不可能的。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.7.4 Security features not supported",
      "zh-CHS": "X.7.4 不支持安全功能"
    },
    {
      "indent": 9,
      "text": "A message contained security features such as secure authentication that could not be supported on the delivery protocol. This is useful only as a permanent error.",
      "zh-CHS": "邮件包含安全功能，例如传递协议不支持的安全身份验证。这仅在永久性错误时有用。"
    },
    {
      "indent": 6,
      "text": "X.7.5 Cryptographic failure",
      "zh-CHS": "X.7.5 加密失败"
    },
    {
      "indent": 9,
      "text": "A transport system otherwise authorized to validate or decrypt a message in transport was unable to do so because necessary information such as key was not available or such information was invalid.",
      "zh-CHS": "由于密钥等必要信息不可用或此类信息无效，否则被授权验证或解密传输中消息的传输系统无法执行此操作。"
    },
    {
      "indent": 6,
      "text": "X.7.6 Cryptographic algorithm not supported",
      "zh-CHS": "X.7.6 不支持加密算法"
    },
    {
      "indent": 9,
      "text": "A transport system otherwise authorized to validate or decrypt a message was unable to do so because the necessary algorithm was not supported.",
      "zh-CHS": "由于不支持必要的算法，否则被授权验证或解密消息的传输系统无法验证或解密消息。"
    },
    {
      "indent": 6,
      "text": "X.7.7 Message integrity failure",
      "zh-CHS": "X.7.7 消息完整性故障"
    },
    {
      "indent": 9,
      "text": "A transport system otherwise authorized to validate a message was unable to do so because the message was corrupted or altered. This may be useful as a permanent, transient persistent, or successful delivery code.",
      "zh-CHS": "由于消息已损坏或更改，否则被授权验证消息的传输系统无法执行此操作。这对于永久性、暂时性、持久性或成功交付代码可能很有用。"
    },
    {
      "indent": 0,
      "text": "4. Normative References",
      "section_title": true,
      "zh-CHS": "4. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[SMTP] Postel, J., \"Simple Mail Transfer Protocol\", STD 10, RFC 821, August 1982.",
      "zh-CHS": "[SMTP]Postel，J.，“简单邮件传输协议”，STD 10，RFC 8211982年8月。"
    },
    {
      "indent": 3,
      "text": "[DSN] Moore, K. and G. Vaudreuil, \"An Extensible Message Format for Delivery Status Notifications\", RFC 3464, January 2003.",
      "zh-CHS": "[DSN]Moore，K.和G.Vaudreuil，“交付状态通知的可扩展消息格式”，RFC 3464，2003年1月。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document describes a status code system with increased precision. Use of these status codes may disclose additional information about how an internal mail system is implemented beyond that currently available.",
      "zh-CHS": "本文档描述了一种精度更高的状态代码系统。使用这些状态代码可能会披露关于如何实现内部邮件系统的附加信息，而不是当前可用的信息。"
    },
    {
      "indent": 0,
      "text": "Appendix A - Collected Status Codes",
      "zh-CHS": "附录A-收集的状态代码"
    },
    {
      "indent": 9,
      "text": "X.1.0 Other address status X.1.1 Bad destination mailbox address X.1.2 Bad destination system address X.1.3 Bad destination mailbox address syntax X.1.4 Destination mailbox address ambiguous X.1.5 Destination mailbox address valid X.1.6 Mailbox has moved X.1.7 Bad sender's mailbox address syntax X.1.8 Bad sender's system address",
      "zh-CHS": "X.1.0 其他地址状态X.1.1错误目标邮箱地址X.1.2错误目标系统地址X.1.3错误目标邮箱地址语法X.1.4目标邮箱地址不明确X.1.5目标邮箱地址有效X.1.6邮箱已移动X.1.7错误发件人邮箱地址语法X.1.8错误发件人系统地址"
    },
    {
      "indent": 9,
      "text": "X.2.0 Other or undefined mailbox status X.2.1 Mailbox disabled, not accepting messages X.2.2 Mailbox full X.2.3 Message length exceeds administrative limit. X.2.4 Mailing list expansion problem",
      "zh-CHS": "X.2.0 其他或未定义的邮箱状态X.2.1邮箱已禁用，不接受邮件X.2.2邮箱已满X.2.3邮件长度超过管理限制。X.2.4邮件列表扩展问题"
    },
    {
      "indent": 9,
      "text": "X.3.0 Other or undefined mail system status X.3.1 Mail system full X.3.2 System not accepting network messages X.3.3 System not capable of selected features X.3.4 Message too big for system",
      "zh-CHS": "X.3.0 其他或未定义的邮件系统状态X.3.1邮件系统已满X.3.2系统不接受网络邮件X.3.3系统无法选择功能X.3.4邮件对系统来说太大"
    },
    {
      "indent": 9,
      "text": "X.4.0 Other or undefined network or routing status X.4.1 No answer from host X.4.2 Bad connection X.4.3 Routing server failure X.4.4 Unable to route X.4.5 Network congestion X.4.6 Routing loop detected X.4.7 Delivery time expired",
      "zh-CHS": "X.4.0 其他或未定义的网络或路由状态X.4.1主机无应答X.4.2连接错误X.4.3路由服务器故障X.4.4无法路由X.4.5网络拥塞X.4.6检测到路由环路X.4.7传递时间已过期"
    },
    {
      "indent": 9,
      "text": "X.5.0 Other or undefined protocol status X.5.1 Invalid command X.5.2 Syntax error X.5.3 Too many recipients X.5.4 Invalid command arguments X.5.5 Wrong protocol version",
      "zh-CHS": "X.5.0 其他或未定义的协议状态X.5.1命令无效X.5.2语法错误X.5.3收件人太多X.5.4命令参数无效X.5.5协议版本错误"
    },
    {
      "indent": 9,
      "text": "X.6.0 Other or undefined media error X.6.1 Media not supported X.6.2 Conversion required and prohibited X.6.3 Conversion required but not supported X.6.4 Conversion with loss performed X.6.5 Conversion failed",
      "zh-CHS": "X.6.0 其他或未定义的介质错误X.6.1介质不支持X.6.2需要转换和禁止X.6.3需要转换但不支持X.6.4转换，丢失执行X.6.5转换失败"
    },
    {
      "indent": 9,
      "text": "X.7.0 Other or undefined security status X.7.1 Delivery not authorized, message refused X.7.2 Mailing list expansion prohibited X.7.3 Security conversion required but not possible X.7.4 Security features not supported X.7.5 Cryptographic failure X.7.6 Cryptographic algorithm not supported X.7.7 Message integrity failure",
      "zh-CHS": "X.7.0 其他或未定义的安全状态X.7.1传递未授权，邮件被拒绝X.7.2邮件列表扩展禁止X.7.3需要但不可能进行安全转换X.7.4安全功能不受支持X.7.5加密失败X.7.6加密算法不受支持X.7.7邮件完整性失败"
    },
    {
      "indent": 0,
      "text": "Appendix B - Changes from RFC1893",
      "zh-CHS": "附录B-对RFC1893的变更"
    },
    {
      "indent": 3,
      "text": "Changed Authors contact information.",
      "zh-CHS": "更改了作者的联系信息。"
    },
    {
      "indent": 3,
      "text": "Updated required standards boilerplate.",
      "zh-CHS": "更新所需标准样板。"
    },
    {
      "indent": 3,
      "text": "Edited the text to make it spell-checker and grammar checker compliant.",
      "zh-CHS": "编辑文本以使其符合拼写检查器和语法检查器。"
    },
    {
      "indent": 3,
      "text": "Modified the text describing the persistent transient failure to more closely reflect current practice and understanding.",
      "zh-CHS": "修改了描述持续瞬态故障的文本，以更紧密地反映当前的实践和理解。"
    },
    {
      "indent": 3,
      "text": "Eliminated the restriction on the X.4.7 codes limiting them to persistent transient errors.",
      "zh-CHS": "消除了对X.4.7代码的限制，将其限制为持续的瞬态错误。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Gregory M. Vaudreuil Lucent Technologies 7291 Williamson Rd Dallas, Tx. 75214",
      "zh-CHS": "Gregory M.Vaudreuil-Lucent Technologies德克萨斯州达拉斯威廉森路7291号，邮编75214"
    },
    {
      "indent": 3,
      "text": "Phone: +1 214 823 9325\nEMail: GregV@ieee.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}