{
  "title": {
    "text": "RFC 3774:  IETF Problem Statement ",
    "zh-CHS": "RFC 3774"
  },
  "number": 3774,
  "created_at": "2021-11-17 23:53:15.134331+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     E. Davies, Ed.\nRequest for Comments: 3774                               Nortel Networks\nCategory: Informational                                         May 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "IETF Problem Statement",
      "zh-CHS": "IETF问题陈述"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo summarizes perceived problems in the structure, function, and processes of the Internet Engineering Task Force (IETF). We are attempting to identify these problems, so that they can be addressed and corrected by the IETF community.",
      "zh-CHS": "本备忘录总结了互联网工程任务组（IETF）的结构、功能和流程中的感知问题。我们正试图识别这些问题，以便IETF社区能够解决和纠正这些问题。"
    },
    {
      "indent": 3,
      "text": "The problems have been digested and categorized from an extensive discussion which took place on the 'problem-statement' mailing list from November 2002 to September 2003. The problem list has been further analyzed in an attempt to determine the root causes at the heart of the perceived problems: The result will be used to guide the next stage of the process in the Problem Statement working group which is to recommend the structures and processes that will carry out the corrections.",
      "zh-CHS": "从2002年11月至2003年9月在“问题声明”邮件列表上进行的广泛讨论中，对这些问题进行了消化和分类。对问题清单进行了进一步分析，试图确定感知问题的根本原因：结果将用于指导问题陈述工作组下一阶段的流程，该工作组将建议将执行纠正的结构和流程。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction: Issues/Problems in the IETF Process  . . . . . .  2\n    1.1.  Consequences of Past Growth  . . . . . . . . . . . . . .  3\n    1.2.  The Aim is Improvement, not Finger-pointing  . . . . . .  4\n    1.3.  Perceived Problems - Consensus on Solutions  . . . . . .  4\n2.  Root Cause Problems  . . . . . . . . . . . . . . . . . . . . .  5\n    2.1.  Participants in the IETF do not have a Common\n          Understanding of its Mission . . . . . . . . . . . . . .  5\n    2.2.  The IETF does not Consistently use Effective\n          Engineering Practices  . . . . . . . . . . . . . . . . .  7\n    2.3.  The IETF has Difficulty Handling Large and/or Complex\n          Problems . . . . . . . . . . . . . . . . . . . . . . . .  9\n    2.4.  Three Stage Standards Hierarchy not properly Utilized  . 11\n    2.5.  The IETF's Workload Exceeds the Number of Fully\n          Engaged Participants . . . . . . . . . . . . . . . . . . 12\n          2.5.1.  Lack of Formal Recognition . . . . . . . . . . . 13\n    2.6.  The IETF Management Structure is not Matched to the\n          Current Size and Complexity of the IETF  . . . . . . . . 13\n          2.6.1.  Span of Authority  . . . . . . . . . . . . . . . 13\n          2.6.2.  Workload of the IESG . . . . . . . . . . . . . . 13\n          2.6.3.  Procedural Blockages . . . . . . . . . . . . . . 15\n          2.6.4.  Consequences of Low Throughput in IESG . . . . . 15\n          2.6.5.  Avoidance of Procedural Ossification . . . . . . 15\n          2.6.6.  Concentration of Influence in Too Few Hands  . . 16\n          2.6.7.  Excessive Reliance on Personal Relationships . . 17\n          2.6.8.  Difficulty making Technical and Process Appeals. 18\n    2.7.  Working Group Dynamics can make Issue Closure Difficult. 18\n    2.8.  IETF Participants and Leaders are Inadequately Prepared\n          for their Roles  . . . . . . . . . . . . . . . . . . . . 19\n3.  Security Considerations  . . . . . . . . . . . . . . . . . . . 20\n4.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 20\n5.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n    5.1.  Normative References . . . . . . . . . . . . . . . . . . 21\n    5.2.  Informative References . . . . . . . . . . . . . . . . . 21\n6.  Editor's Address . . . . . . . . . . . . . . . . . . . . . . . 21\n7.  Full Copyright Statement . . . . . . . . . . . . . . . . . . . 22",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction: Issues/Problems in the IETF Process",
      "section_title": true,
      "zh-CHS": "1. 导言：IETF过程中的问题"
    },
    {
      "indent": 3,
      "text": "Discussion started in the second half of 2002 has shown that a significant number of problems are believed to exist in the way the Internet Engineering Taskforce (IETF) operates. Before attempting to change the IETF procedures and rules to deal with these problems, the IETF should have a clear, agreed-upon description of what problems we are trying to solve.",
      "zh-CHS": "2002年下半年开始的讨论表明，据信互联网工程任务组（IETF）的运作方式存在大量问题。在试图改变IETF程序和规则来处理这些问题之前，IETF应该对我们试图解决的问题有一个清晰的、一致的描述。"
    },
    {
      "indent": 3,
      "text": "The Problem Statement working group was chartered to create this document, which contains a description of the problems, and to use this analysis to suggest processes to address the identified problems.",
      "zh-CHS": "问题陈述工作组受权创建本文件，其中包含对问题的描述，并使用此分析建议解决已识别问题的流程。"
    },
    {
      "indent": 3,
      "text": "Taken in isolation, this document may appear to be exceedingly negative. The IETF needs to refresh its management and processes to address today's challenges, but it should not be forgotten that the IETF has produced a large body of high quality work which has lead to an extremely successful and pervasive network infrastructure. Against this background, we should see the current document as a necessary piece of self-criticism leading to renewal and continued success. The discussion of the positive aspects has been deliberately confined to the IETF Problem Resolution Processes document [5] which considers the core values that the IETF needs to maintain whilst correcting the problems that participants perceive as affecting the IETF at present.",
      "zh-CHS": "孤立地看，这份文件可能显得极其消极。IETF需要更新其管理和流程，以应对当今的挑战，但不应忘记，IETF已经完成了大量高质量的工作，这导致了极其成功和普及的网络基础设施。在这一背景下，我们应该将目前的文件视为一项必要的自我批评，从而导致更新和持续成功。积极方面的讨论被故意限制在IETF问题解决过程文件[5]中，该文件考虑了IETF需要保持的核心价值观，同时纠正参与者认为目前影响IETF的问题。"
    },
    {
      "indent": 3,
      "text": "The raw material for this document was derived by summarizing the extensive discussions which initially took place on the 'wgchairs' mailing list and subsequently on the 'problem-statement' mailing list from November 2002 through to September 2003, incorporating additional input from relevant drafts published during this period (see [2], [3] and [4]), and the minutes of recent plenary discussions. This produced a list of perceived problems which were classified into a number of related groups using a classification suggested by the processes which go on in the IETF.",
      "zh-CHS": "本文件的原材料是通过总结2002年11月至2003年9月在“wgchairs”邮件列表上以及随后在“问题陈述”邮件列表上进行的广泛讨论得出的，包括在此期间发布的相关草案的额外投入（见[2]、[3]和[3]）[4] ）和最近全体会议讨论的记录。这产生了一个感知问题列表，使用IETF中进行的过程所建议的分类将这些问题分为若干相关组。"
    },
    {
      "indent": 3,
      "text": "This document has digested these perceived problems into a small set of root cause issues, and a short list of subsidiary issues which appear to be the most pressing items engendered by the root cause. This list is set out in Section 2.",
      "zh-CHS": "本文件已将这些感知到的问题分解为一小部分根本原因问题，以及一小部分次要问题，这些问题似乎是根本原因造成的最紧迫问题。该清单载于第2节。"
    },
    {
      "indent": 3,
      "text": "Section 1.1 gives a short explanation of the thinking that has taken place in coming to the current view of the root causes.",
      "zh-CHS": "第1.1节简要解释了在得出当前根本原因观点时产生的想法。"
    },
    {
      "indent": 3,
      "text": "The original summary of perceived problems has been posted to the Problem Statement Working Group mailing list so that it can be referred to in future. Note that it remains classified according the original scheme so that the raw data is available if alternative root cause analysis is needed.",
      "zh-CHS": "感知问题的原始摘要已发布到问题声明工作组邮件列表中，以便将来参考。请注意，它仍然按照原始方案进行分类，以便在需要替代根本原因分析时，原始数据可用。"
    },
    {
      "indent": 0,
      "text": "1.1. Consequences of Past Growth",
      "section_title": true,
      "zh-CHS": "1.1. 过去增长的后果"
    },
    {
      "indent": 3,
      "text": "As the problems of the IETF were examined, it became clear that they are neither new nor are they symptoms of a problem which is novel in the science of organizations.",
      "zh-CHS": "随着IETF问题的研究，很明显，这些问题既不是新问题，也不是组织科学中新问题的症状。"
    },
    {
      "indent": 3,
      "text": "The IETF started off as a small, focused organization with a clearly defined mission and participants who had been working in this area for a significant period of time. Over the period 1989-1999, the IETF grew by a factor of ten or more in terms of number of participants, and volume of work in progress. The effects of this growth have been compounded by the extension of the scope of the IETF which makes the work much more varied. Also during this period, the Internet has become more complex and the requirements placed on it by a far larger user community have changed as the network has come to have a pivotal role in many areas of life.",
      "zh-CHS": "IETF一开始是一个小型的、重点突出的组织，具有明确定义的任务和在该领域工作了很长一段时间的参与者。在1989-1999年期间，IETF在参与者数量和正在进行的工作量方面增加了10倍或更多。IETF范围的扩大使工作更加多样化，这使得这种增长的影响更加复杂。同样在这一时期，互联网变得更加复杂，随着网络在生活的许多领域发挥着关键作用，更大的用户群体对互联网的要求也发生了变化。"
    },
    {
      "indent": 3,
      "text": "Many of the problems and symptoms appear to be fundamentally caused by the organization failing to fully adapt its management structure and processes to its new larger size and the increased complexity of the work. The IETF has also failed to clearly define its future mission now that the initial mission has been completed or outgrown.",
      "zh-CHS": "许多问题和症状似乎从根本上是由于本组织未能充分调整其管理结构和流程，使其适应新的更大规模和工作的复杂性增加。IETF也未能明确定义其未来的任务，因为最初的任务已经完成或已经不复存在。"
    },
    {
      "indent": 3,
      "text": "These failures are just those that afflict many small organizations trying to make the transition from a small organization, which can be run informally and where essentially all participants fully share the aims, values, and motivations of the leadership, to a medium sized organization, where there are too many participants for informal leadership and later arrivals either do not fully understand or have a different perception of the ethos of the organization.",
      "zh-CHS": "这些失败正是困扰许多小组织的原因，这些小组织试图从一个小型组织过渡到一个中型组织，而小型组织可以非正式运作，所有参与者基本上都完全认同领导层的目标、价值观和动机，非正式领导的参与者太多，后来的参与者要么不完全理解组织的精神，要么对组织的精神有不同的看法。"
    },
    {
      "indent": 3,
      "text": "Some IETF participants have been aware of these issues for a long time. Records dating back to at least 1992 drew similar conclusions.",
      "zh-CHS": "一些IETF参与者已经意识到这些问题很长时间了。至少可以追溯到1992年的记录得出了类似的结论。"
    },
    {
      "indent": 0,
      "text": "1.2. The Aim is Improvement, not Finger-pointing",
      "section_title": true,
      "zh-CHS": "1.2. 目标是改进，而不是指责"
    },
    {
      "indent": 3,
      "text": "Many of the problems identified in this memo have been remarkably persistent over a 15-year period, surviving a number of changes in personnel. We see them as structural problems, not personnel problems. Blame for any of the perceived problems should not be directed to any individual. The sole aim of this review process is to identify how the IETF can improve itself so that it knows what it is about and becomes fit for that purpose in the shortest possible time frame.",
      "zh-CHS": "这份备忘录中确定的许多问题在15年的时间里一直持续存在，经历了多次人事变动。我们认为这是结构性问题，而不是人员问题。任何感知到的问题都不应归咎于任何个人。该评审过程的唯一目的是确定IETF如何改进自身，从而了解其内容，并在尽可能短的时间内达到该目的。"
    },
    {
      "indent": 0,
      "text": "1.3. Perceived Problems - Consensus on Solutions",
      "section_title": true,
      "zh-CHS": "1.3. 感知问题-解决方案共识"
    },
    {
      "indent": 3,
      "text": "The working group participants emphasize that both the long list of problems and the root cause issues that were derived from them are problems that are believed to exist by a significant constituency, either on the mailing list and/or in private discussions. We also note that many of these problems appear to be of long standing, as a",
      "zh-CHS": "工作组与会者强调，长长的问题清单和由此产生的根本原因问题都是被认为存在于重要选民中的问题，无论是在邮寄名单上还是在私下讨论中。我们还注意到，作为一个整体，其中许多问题似乎是长期存在的"
    },
    {
      "indent": 3,
      "text": "very similar list has survived from the discussions in the first POISED working group that took place prior to the IETF organizational changes approved in 1992.",
      "zh-CHS": "在1992年批准的IETF组织变革之前，第一个稳定的工作组讨论了类似的清单。"
    },
    {
      "indent": 3,
      "text": "We, in line with many contributors to the mailing list, believe that it is important to try and identify what appear to be the root causes of the perceived problems, but trying to prioritize or assign a relative importance to the problems would not be useful: rough consensus on an unordered list of real and important root causes will be sufficient. The root causes identified will provide a guide in setting up the processes needed to resolve the problems: the perceived problems can be viewed as multiple symptoms of the root causes which should provide input to those trying to resolve the problems in achieving consensus on solutions.",
      "zh-CHS": "与邮件列表的许多投稿人一样，我们认为，重要的是尝试并确定所感知问题的根本原因，但试图对这些问题进行优先排序或赋予其相对重要性是没有用的：就真正和重要的根本原因的无序列表达成粗略的共识就足够了。确定的根本原因将为建立解决问题所需的流程提供指导：所感知的问题可被视为根本原因的多个症状，这些症状应为试图解决问题的人提供投入，以达成解决方案的共识。"
    },
    {
      "indent": 0,
      "text": "2. Root Cause Problems",
      "section_title": true,
      "zh-CHS": "2. 根本原因问题"
    },
    {
      "indent": 3,
      "text": "This section forms the heart of this analysis, and lists the issues which we believe lie at the core of the problems. Apart from the first issue which is fundamental, the problems are not necessarily in priority order, but they will be seen to be interlinked in various ways.",
      "zh-CHS": "本节构成了本分析的核心，并列出了我们认为是问题核心的问题。除了第一个基本问题外，这些问题不一定按优先顺序排列，但它们将以各种方式相互关联。"
    },
    {
      "indent": 0,
      "text": "2.1. Participants in the IETF do not have a Common Understanding of its Mission",
      "zh-CHS": "2.1. IETF的参与者对其任务没有共同的理解"
    },
    {
      "indent": 3,
      "text": "The IETF lacks a clearly defined and commonly understood Mission: as a result, the goals and priorities for the IETF as a whole and any Working Groups (WGs) that are chartered are also unclear.",
      "zh-CHS": "IETF缺乏一个明确定义和普遍理解的任务：因此，IETF作为一个整体和任何特许工作组（WG）的目标和优先事项也不清楚。"
    },
    {
      "indent": 3,
      "text": "The IETF needs to understand its mission in the context of the greatly increased scope and complexity of the Internet, and the changing requirements of the much larger user community that the success of its previous work has engendered.",
      "zh-CHS": "IETF需要在互联网范围和复杂性大大增加的背景下理解其使命，以及其先前工作的成功所带来的更大用户群体不断变化的需求。"
    },
    {
      "indent": 3,
      "text": "The lack of a common mission has many consequences, of which the principal ones appear to be:",
      "zh-CHS": "缺乏共同使命会产生许多后果，其中主要后果似乎是："
    },
    {
      "indent": 3,
      "text": "o The IETF is unsure what it is trying to achieve and hence cannot know what its optimum internal organization should be to achieve its aims.",
      "zh-CHS": "o IETF不确定其试图实现的目标，因此无法知道其最佳内部组织应该是什么来实现其目标。"
    },
    {
      "indent": 3,
      "text": "o The IETF cannot determine what its 'scope' should be, and hence cannot decide whether a piece of proposed work is either in-scope or out-of-scope.",
      "zh-CHS": "o IETF无法确定其“范围”应该是什么，因此无法决定一项拟议工作是在范围内还是在范围外。"
    },
    {
      "indent": 3,
      "text": "o The IETF is unsure who its stakeholders are. Consequently, certain groups of stakeholder, who could otherwise provide",
      "zh-CHS": "o IETF不确定其利益相关者是谁。因此，某些利益相关者群体可能会提供"
    },
    {
      "indent": 6,
      "text": "important input to the process, have been more or less sidelined because it has seemed to these stakeholders that the organization does not give due weight to their input.",
      "zh-CHS": "对过程的重要投入或多或少被搁置一旁，因为在这些利益相关者看来，组织没有给予他们的投入应有的重视。"
    },
    {
      "indent": 3,
      "text": "o Working Groups can potentially be hijacked by sectional interests to the detriment of the IETF's mission.",
      "zh-CHS": "o 工作组可能会被部门利益劫持，从而损害IETF的使命。"
    },
    {
      "indent": 3,
      "text": "o The misty vision has inhibited the development of roadmaps that would inform the IETF's stakeholders of our longer term intentions, as well as restricting the associated architectural views to an outline top level view which does not fully reflect the developing nature of the Internet. It would be desirable to have roadmaps and architectural views for portions of work which extend beyond a single working group: it may also be the case that it is no longer possible to fit the whole Internet within a single architecture.",
      "zh-CHS": "o 模糊的愿景阻碍了向IETF的利益相关者告知我们的长期意图的路线图的开发，并将相关的架构视图限制在一个不能完全反映互联网发展本质的概要顶层视图中。对于超出单个工作组的部分工作，最好有路线图和体系结构视图：也可能不再可能在单个体系结构中容纳整个互联网。"
    },
    {
      "indent": 3,
      "text": "o The IETF is unable to determine explicitly what effect it desires to have in the marketplace, and is therefore unable to determine what requirements of timeliness are appropriate when planning work and setting expectations for stakeholders which will further the IETF's mission.",
      "zh-CHS": "o IETF无法明确确定其希望在市场上产生什么样的影响，因此无法确定在规划工作和为利益相关者设定期望（这将推进IETF的使命）时，什么样的及时性要求是合适的。"
    },
    {
      "indent": 3,
      "text": "o The lack of precision regarding our goals leads to WG charters and requirements that are poorly thought out and/or not aligned with the overall architecture. The resulting poorly defined charters are a major factor in poor quality and/or late deliveries from some WGs and the total failure of other WGs.",
      "zh-CHS": "o 我们的目标缺乏精确性，导致工作组章程和需求没有得到充分考虑和/或与总体架构不一致。由此产生的不明确的租船合同是导致某些工作组交付质量差和/或延迟以及其他工作组完全失败的一个主要因素。"
    },
    {
      "indent": 3,
      "text": "o The IETF needs to avoid focusing on a too-narrow scope of technology because this would be likely to blinker the IETF's view of 'the good of the Internet', and will harm the long-term goal of making the Internet useful to the greatest number stakeholders; this argues for allowing a relatively wide range of topics to be worked on in the IETF - cross-fertilization has always been one of the IETF's strengths.",
      "zh-CHS": "o IETF需要避免将重点放在过于狭窄的技术范围上，因为这可能会使IETF对“互联网的好处”的看法模糊不清，并且会损害使互联网对最大数量的利益相关者有用的长期目标；这表明允许在IETF中研究相对广泛的主题——交叉施肥一直是IETF的优势之一。"
    },
    {
      "indent": 3,
      "text": "An additional barrier to achieving a common understanding is that the IETF does not have a recognized forum in which all stakeholders participate and in which organization wide consensus might be reached. Plenary meetings during regular IETF meetings allow a large cross-section of the community to offer views, but there is not generally sufficient time to achieve consensus and there is no single mailing list which all stakeholders can be guaranteed to monitor.",
      "zh-CHS": "达成共识的另一个障碍是IETF没有一个所有利益相关者都参与的公认论坛，也没有一个组织范围内达成共识的论坛。IETF定期会议期间的全体会议允许社区的大部分人提供意见，但通常没有足够的时间达成共识，也没有一个单一的邮件列表可以保证所有利益相关者都能监控。"
    },
    {
      "indent": 3,
      "text": "The IETF creates standards and is therefore necessarily a Standards Development Organization (SDO), but many participants would like to differentiate the IETF and its way of working from the 'conventional'",
      "zh-CHS": "IETF创建标准，因此必然是一个标准开发组织（SDO），但许多参与者希望将IETF及其工作方式与“传统”区分开来"
    },
    {
      "indent": 3,
      "text": "SDOs which emphasize corporate involvement and mandated delegates. Externally, the IETF is often classified with these conventional SDOs, especially by detractors, because the differentiation in the IETF's mission and processes and the rationale for those differences are not clear. This can lead to the IETF being misunderstood by other SDOs which can make communications between SDOs less effective, harming the IETF's ability to achieve its mission.",
      "zh-CHS": "SDO强调公司参与和授权代表。从外部看，IETF通常与这些传统SDO一起分类，尤其是被批评者分类，因为IETF的任务和过程的差异以及这些差异的原因尚不清楚。这可能导致IETF被其他SDO误解，从而降低SDO之间的通信效率，损害IETF完成任务的能力。"
    },
    {
      "indent": 0,
      "text": "2.2. The IETF does not Consistently use Effective Engineering Practices",
      "section_title": true,
      "zh-CHS": "2.2. IETF没有始终如一地使用有效的工程实践"
    },
    {
      "indent": 3,
      "text": "For an organization with 'engineering' in its title and participants who are likely to trot out the statement \"Trust me, I'm an engineer!\" when confronted with the need to find a solution to a particularly knotty problem, the IETF has, at least in some cases, extremely ineffective engineering practices. Effective engineering practices, as used here, covers both the techniques used to derive and verify the technical solutions needed, and the management and organizational strategies that are commonly accepted to help with the engineering process.",
      "zh-CHS": "对于一个标题为“工程”的组织和参与者来说，当面对一个特别棘手的问题需要找到解决方案时，他们可能会大声说出“相信我，我是工程师！”这句话，IETF至少在某些情况下具有极低的工程实践效率。此处使用的有效工程实践包括用于推导和验证所需技术解决方案的技术，以及普遍接受的用于帮助工程过程的管理和组织策略。"
    },
    {
      "indent": 3,
      "text": "A major symptom of this lack is that WGs do not consistently produce timely, high-quality, and predictable output. As discussed in Section 2.1, this problem is exacerbated because the IETF currently finds it difficult to determine what is timely, and hence what are appropriate deadlines for the delivery of WG output. Some of the contributing problems which interfere with effective engineering in WGs include:",
      "zh-CHS": "这种缺乏的一个主要症状是，工作组没有始终如一地产生及时、高质量和可预测的产出。如第2.1节所述，由于IETF目前发现很难确定什么是及时的，因此很难确定交付工作组输出的适当截止日期，因此这个问题更加严重。影响WGs有效工程的一些促成问题包括："
    },
    {
      "indent": 3,
      "text": "o Failure to ensure that there is a uniform view in the WG of the scope of the WG activity, especially the intended purpose of the solution.",
      "zh-CHS": "o 未能确保工作组对工作组活动的范围，特别是解决方案的预期目的有统一的看法。"
    },
    {
      "indent": 3,
      "text": "o Failure to identify the issues that need to be resolved at an early stage (before the design is frozen), and/or then to ensure that there is a uniform view in the WG of the issues that need to be resolved to bring the work to a satisfactory conclusion.",
      "zh-CHS": "o 未能在早期阶段（冻结设计之前）确定需要解决的问题，和/或随后未能确保工作组对需要解决的问题有一致的看法，从而使工作圆满结束。"
    },
    {
      "indent": 3,
      "text": "o Failure to identify and articulate engineering trade-offs that may be needed to meet the deadlines that the WG has set without inappropriately reducing the 'fitness for purpose' for the intended customers.",
      "zh-CHS": "o 未能确定和阐明可能需要的工程权衡，以满足工作组设定的最后期限，而不会不适当地降低预期客户的“适用性”。"
    },
    {
      "indent": 3,
      "text": "o Continued refinement of the solution beyond the point at which it is adequate to meet the requirements placed on it by the intended purpose.",
      "zh-CHS": "o 持续改进解决方案，使其超出足以满足预期目的对其提出的要求的程度。"
    },
    {
      "indent": 3,
      "text": "The IETF standards engineering process is not set up to deliver iterative process improvement. Particular areas that need improvement include:",
      "zh-CHS": "IETF标准工程过程不是为了交付迭代过程改进而建立的。需要改进的具体领域包括："
    },
    {
      "indent": 3,
      "text": "o The charter may not be sufficiently detailed to document the process and timeline to be followed by the WG. Additional documents may be needed, such as a roadmap or detailed plans.",
      "zh-CHS": "o 章程可能不够详细，无法记录工作组应遵循的流程和时间表。可能需要其他文件，如路线图或详细计划。"
    },
    {
      "indent": 3,
      "text": "o Poorly defined success criteria for WGs and individual documents.",
      "zh-CHS": "o 工作组和个别文件的成功标准定义不清。"
    },
    {
      "indent": 3,
      "text": "o Lack of written guidelines or templates for the content of documents (as opposed to the overall layout) and matching lists of review criteria designed to achieve appropriate quality in output.",
      "zh-CHS": "o 缺乏文件内容（与总体布局相反）的书面指南或模板，以及旨在实现适当输出质量的审查标准匹配列表。"
    },
    {
      "indent": 3,
      "text": "o Lack of auditing against explicit criteria throughout the standards development process.",
      "zh-CHS": "o 在整个标准开发过程中缺乏针对明确标准的审计。"
    },
    {
      "indent": 3,
      "text": "o Lack of review, especially early review, by reviewers who are not directly interested members of the WG, and by subject matter experts for topics related to, but not necessarily the immediate focus of the document.",
      "zh-CHS": "o 非工作组直接相关成员的审查员以及主题专家对与文件相关但不一定是直接关注的主题缺乏审查，尤其是早期审查。"
    },
    {
      "indent": 3,
      "text": "o Lack of documentation about likely problem areas that might arise due to interactions with other popular IETF protocols.",
      "zh-CHS": "o 缺乏关于与其他流行IETF协议交互可能产生的问题区域的文档。"
    },
    {
      "indent": 3,
      "text": "o Lack of metrics to measure the achievement of the desired quality and the performance of both WGs and the whole IETF.",
      "zh-CHS": "o 缺乏衡量WGs和整个IETF达到预期质量和绩效的指标。"
    },
    {
      "indent": 3,
      "text": "o Lack of metrics and 'post mortem' procedures to drive the improvement of the standards development and other IETF processes.",
      "zh-CHS": "o 缺乏度量和“事后”程序来推动标准开发和其他IETF过程的改进。"
    },
    {
      "indent": 3,
      "text": "o Lack of criteria for determining when a piece of work is overrunning and/or is unlikely to be concluded successfully, either at all or within an acceptable time frame. Lack of process for extending the time frame, adjusting the scope, or terminating the work item or the whole Working Group.",
      "zh-CHS": "o 缺乏确定某项工作何时超限和/或不可能成功完成的标准，无论是在任何情况下还是在可接受的时间范围内。缺乏延长时限、调整范围或终止工作项目或整个工作组的程序。"
    },
    {
      "indent": 3,
      "text": "o Automated tools to support the engineering process are minimal.",
      "zh-CHS": "o 支持工程过程的自动化工具很少。"
    },
    {
      "indent": 3,
      "text": "o Despite its commitment to 'running code', the IETF is not proactive in providing ways for developers to verify their implementations of IETF standards.",
      "zh-CHS": "o 尽管IETF致力于“运行代码”，但在为开发人员提供验证IETF标准实现的方法方面，IETF并不积极主动。"
    },
    {
      "indent": 3,
      "text": "In addition, IETF processes, and Working Group processes in particular, suffer because commonly accepted Project Management techniques are not regularly applied to the progress of work in the organization.",
      "zh-CHS": "此外，IETF过程，特别是工作组过程，受到影响，因为普遍接受的项目管理技术没有定期应用于组织内的工作进度。"
    },
    {
      "indent": 3,
      "text": "o Project entry, goal setting, dependency identification, coordination, and tracking processes are all either missing or implemented less effectively than the norm for commercial organizations in related activities. Dependencies and coordination should cover both other WGs within the IETF and any outside SDO with which the IETF is collaborating.",
      "zh-CHS": "o 项目进入、目标设定、依赖关系识别、协调和跟踪过程都缺失，或者执行效率低于商业组织在相关活动中的标准。依赖关系和协调应涵盖IETF内的其他工作组和IETF与之合作的任何外部SDO。"
    },
    {
      "indent": 3,
      "text": "o Charters regularly fail to set enough milestones with sufficiently small granularity at which progress of WGs, individuals, and documents can be evaluated. Also, WGs often do not make more detailed work plans to refine the charter plans.",
      "zh-CHS": "o 章程经常未能以足够小的粒度设置足够多的里程碑，以评估工作组、个人和文档的进度。此外，工作组通常不会制定更详细的工作计划来完善章程计划。"
    },
    {
      "indent": 3,
      "text": "o The acceptable deadlines for finishing a piece of work, and the criteria used to determine them, are rarely, if ever, documented. Also, the estimated time required to complete the work often differs widely from the time actually taken. The combination of these factors makes determining the feasibility of delivering within the required time frame, and then adjusting the scope of the work to fit the time frame requirements, extremely difficult.",
      "zh-CHS": "o 完成一项工作的可接受的最后期限，以及用于确定这些期限的标准，很少（如果有的话）被记录在案。此外，完成工作所需的估计时间通常与实际花费的时间相差很大。这些因素的结合使得确定在要求的时间范围内交付的可行性，然后调整工作范围以满足时间范围要求变得极其困难。"
    },
    {
      "indent": 3,
      "text": "One problem which the IETF does not appear to suffer from is excessive bureaucracy, in the sense that transfer of information is generally kept to the minimum necessary to accomplish the task. It is important that any changes introduced do not significantly increase the bureaucratic load whilst still recording sufficient information to allow process improvement.",
      "zh-CHS": "IETF似乎没有遇到的一个问题是过度的官僚作风，即信息传输通常保持在完成任务所需的最低限度。重要的是，引入的任何变更不会显著增加官僚负担，同时仍需记录足够的信息以允许流程改进。"
    },
    {
      "indent": 3,
      "text": "Finally, even where the IETF does have Engineering Practices defined, there are frequently cases where they are ignored or distorted. One area of particular concern is the tendency for protocols to be assessed and issues resolved primarily through static analysis of the written specification rather than by practical experiment with 'running code'.",
      "zh-CHS": "最后，即使IETF确实定义了工程实践，也经常存在忽略或扭曲的情况。一个特别值得关注的领域是，协议评估和问题解决的趋势主要是通过对书面规范的静态分析，而不是通过“运行代码”的实际实验。"
    },
    {
      "indent": 0,
      "text": "2.3. The IETF has Difficulty Handling Large and/or Complex Problems",
      "section_title": true,
      "zh-CHS": "2.3. IETF难以处理大型和/或复杂问题"
    },
    {
      "indent": 3,
      "text": "The IETF has historically been most successful when dealing with tightly focused problems that have few interactions with other parts of the total problem solution. Given that the Internet has become more complex, such tightly focused problems are becoming the exception. The IETF does not always seem to be aware of the interactions between protocols that are bound to be thrown up by deployment in more complex situations and so fails to minimize the chances of unwelcome consequences arising unforeseen when a new protocol is deployed. This may be exacerbated by inadequate review from outside the WG as suggested in Section 2.2.",
      "zh-CHS": "IETF在处理与整个问题解决方案的其他部分很少交互的紧密关注的问题时，历来是最成功的。考虑到互联网已经变得越来越复杂，这种紧密关注的问题正在成为例外。IETF似乎并不总是意识到在更复杂的情况下部署必然会引发的协议之间的交互，因此未能将部署新协议时产生不受欢迎后果的可能性降至最低。如第2.2节所述，工作组外部的审查不充分可能会加剧这种情况。"
    },
    {
      "indent": 3,
      "text": "IETF standardization procedures are optimized for tightly constrained working groups and are generally less effective if 'engineering in the large' is needed to reach a satisfactory solution. Engineering in the large can encompass many aspects of system design including:",
      "zh-CHS": "IETF标准化程序针对受严格约束的工作组进行了优化，如果需要“大规模工程”来达成满意的解决方案，则通常效率较低。工程设计可以涵盖系统设计的许多方面，包括："
    },
    {
      "indent": 6,
      "text": "Architecture Frameworks Security Internationalization",
      "zh-CHS": "架构框架安全国际化"
    },
    {
      "indent": 3,
      "text": "The IETF has historically standardized protocol components rather than complete systems, but as we have learned more about the ways in which systems on the Internet interact, design of components needs to take into account more and more external constraints, and the understanding of these constraints tends to require more engineering in the large.",
      "zh-CHS": "IETF在历史上是标准化协议组件，而不是完整的系统，但随着我们对互联网上系统交互方式的了解越来越多，组件的设计需要考虑越来越多的外部约束，对这些约束的理解往往需要更多的工程设计。"
    },
    {
      "indent": 3,
      "text": "Part of the cause of this difficulty may be that the formal reporting structure of the IETF emphasizes communication between the Internet Engineering Steering Group (IESG) through the ADs and the WGs, and does not place much reliance on inter-WG communications:",
      "zh-CHS": "造成这一困难的部分原因可能是IETF的正式报告结构强调互联网工程指导小组（IESG）通过ADs和工作组之间的沟通，而不太依赖工作组之间的沟通："
    },
    {
      "indent": 3,
      "text": "o The IETF is not consistently effective at resolving issues that cross WG or area boundaries.",
      "zh-CHS": "o IETF在解决跨工作组或区域边界的问题时并不始终有效。"
    },
    {
      "indent": 3,
      "text": "o The IETF does not possess effective formal mechanisms for inter-WG cooperation, coordination, or communication, including the handling of dependencies between deliverables and processes specified in WG charters.",
      "zh-CHS": "o IETF不具备工作组间合作、协调或沟通的有效正式机制，包括处理工作组章程中规定的交付物和过程之间的依赖关系。"
    },
    {
      "indent": 3,
      "text": "o The IETF does not have an effective means for defining architectures and frameworks that will shape the work of multiple WGs.",
      "zh-CHS": "o IETF没有一种有效的方法来定义将影响多个工作组工作的架构和框架。"
    },
    {
      "indent": 3,
      "text": "The IETF also has to work with other SDOs, and the liaison mechanisms for coordination and cooperation do not always work efficiently. This needs to be remedied because some of the interactions which IETF work has to take into account will involve protocols and systems standardized by these other SDOs.",
      "zh-CHS": "IETF还必须与其他SDO合作，协调与合作的联络机制并不总是有效。这需要纠正，因为IETF工作必须考虑的一些交互将涉及这些其他SDO标准化的协议和系统。"
    },
    {
      "indent": 3,
      "text": "A possible consequence of the need for more engineering in the large is that protocol specifications have become larger: as a result they now take longer to develop. Some people perceive that this is because the IESG has tended to require protocol specifications to specify an entire system, instead of simple component protocols, leading to feature bloat and applicability only to a narrow range of applications (see also Section 2.4). On the other hand, others believe that the IESG has approved simple component protocols without",
      "zh-CHS": "需要更多工程的一个可能结果是协议规范变得更大：因此，它们现在需要更长的时间来开发。一些人认为这是因为IESG倾向于要求协议规范来指定整个系统，而不是简单的组件协议，从而导致功能膨胀，并且只适用于狭窄的应用范围（另见第2.4节）。另一方面，其他人认为IESG批准了简单组件协议，而没有"
    },
    {
      "indent": 3,
      "text": "an adequate understanding of the systems and contexts in which the protocols might be used. These problems appear to be two additional aspects of the general problem that the IETF has with handling large and/or complex systems.",
      "zh-CHS": "充分了解可能使用协议的系统和环境。这些问题似乎是IETF处理大型和/或复杂系统的一般问题的另外两个方面。"
    },
    {
      "indent": 0,
      "text": "2.4. Three Stage Standards Hierarchy not properly Utilized",
      "section_title": true,
      "zh-CHS": "2.4. 未正确使用三阶段标准层次结构"
    },
    {
      "indent": 3,
      "text": "The current hierarchy of Proposed, Draft, and Full Standard maturity levels for specifications is no longer being used in the way that was envisioned when the stratification was originally proposed. In practice, the IETF currently has a one-step standards process that subverts the IETF's preference for demonstrating effectiveness through running code in multiple interoperable implementations. This compresses the process that previously allowed specifications to mature as experience was gained with actual implementations:",
      "zh-CHS": "规范的拟议、草案和完整标准成熟度级别的当前层次结构不再以最初提出分层时设想的方式使用。实际上，IETF目前有一个一步标准流程，它颠覆了IETF通过在多个可互操作实现中运行代码来证明有效性的偏好。这压缩了先前允许规范随着实际实现经验的积累而成熟的过程："
    },
    {
      "indent": 3,
      "text": "o Relatively few specifications are now progressed beyond Proposed Standard (PS) to Draft Standard (DS) level, and even fewer to Full Standard (FS).",
      "zh-CHS": "o 相对较少的规范现在已经发展到提议的标准（PS）到起草标准（DS）级别，甚至更少到完全标准（FS）。"
    },
    {
      "indent": 3,
      "text": "o It is widely perceived that the IESG has 'raised the (quality) bar' that standards have to pass to be accorded a PS status. Protocol developers may be required to specify a complete system rather than an interface in order for their specification to be approved as a PS (see also Section 2.3).",
      "zh-CHS": "o 人们普遍认为，IESG“提高了（质量）标准的门槛”，这些标准必须通过才能被授予PS地位。协议开发人员可能需要指定一个完整的系统，而不是接口，以便将其规范批准为PS（另见第2.3节）。"
    },
    {
      "indent": 3,
      "text": "o In spite of the apparently higher quality hurdle, implementation or deployment experience is still not required, so the IETF's guiding principle of 'rough consensus and running code' has less of a chance to be effective.",
      "zh-CHS": "o 尽管存在明显更高的质量障碍，但仍然不需要实施或部署经验，因此IETF的指导原则“大致共识和运行代码”不太可能有效。"
    },
    {
      "indent": 3,
      "text": "o There appears to be a vicious circle in operation where vendors tend to deploy protocols that have reached PS as if they were ready for full production, rather than accepting that standards at the PS level are still under development and could be expected to be altered after feature, performance, and interoperability tests in limited pilot installations, as was originally intended. The enthusiasm of vendors to achieve a rapid time to market seems to have encouraged the IETF in general and the IESG in particular to attempt to ensure that specifications at PS are ready for prime time, and that subsequent modifications will be minimal as it progresses to DS and FS, assuming effort can be found to create the necessary applicability and interoperability reports that are needed.",
      "zh-CHS": "o 在运行中似乎存在一个恶性循环，供应商倾向于部署已达到PS的协议，就好像他们已经准备好进行全面生产一样，而不是接受PS级别的标准仍在开发中，并且可能在特性、性能、，以及在有限的试点安装中进行互操作性测试，这与最初的计划是一致的。供应商实现快速上市的热情似乎鼓励了IETF，特别是IESG，努力确保PS的规范在黄金时段准备就绪，并且随着其发展到DS和FS，后续修改将最小化，假设可以努力创建所需的必要适用性和互操作性报告。"
    },
    {
      "indent": 3,
      "text": "o The three stage hierarchy is, accordingly, seen to be excessive.",
      "zh-CHS": "o 因此，三阶段的等级制度被认为是过度的。"
    },
    {
      "indent": 3,
      "text": "o There is no formal bug reporting or tracking system in place for IETF specifications.",
      "zh-CHS": "o IETF规范没有正式的缺陷报告或跟踪系统。"
    },
    {
      "indent": 3,
      "text": "o The periodic review of protocols at PS and DS levels specified in [1] are not being carried out, allowing protocols to persist in these lower maturity levels for extended periods of time, whereas the process would normally expect them to progress or be relegated to Historic status.",
      "zh-CHS": "o 未在[1]中规定的PS和DS级别上对协议进行定期审查，允许协议在这些较低的成熟度级别上持续较长时间，而该过程通常预期协议会进展或降级到历史状态。"
    },
    {
      "indent": 3,
      "text": "o No individual or body is given the task of 'maintaining' a specification after the original WG has closed down. Specifications are generally only updated when a need for a new version is perceived. No attempt is normally made to correct bugs in the specification (whether they affect operation or not) and the specification is not updated to reflect parts of the specification that have fallen into disuse or were, in fact, never implemented. This is, in part, because the current procedures would require a standard to revert to the PS maturity level, even when specification maintenance is carried out. This occurs even if the changes can be demonstrated to have no or minimal effect on an existing protocol at the DS or FS level.",
      "zh-CHS": "o 在原工作组关闭后，没有任何个人或机构被赋予“维护”规范的任务。通常，只有在意识到需要新版本时，才会更新规范。通常不会试图纠正规范中的错误（无论它们是否影响操作），规范也不会更新以反映规范中已废弃或实际上从未实现的部分。这在一定程度上是因为当前程序将要求标准恢复到PS成熟度水平，即使在进行规范维护时也是如此。即使可以证明这些更改对DS或FS级别的现有协议没有影响或影响很小，也会发生这种情况。"
    },
    {
      "indent": 0,
      "text": "2.5. The IETF's Workload Exceeds the Number of Fully Engaged Participants",
      "zh-CHS": "2.5. IETF的工作量超过了完全参与的参与者数量"
    },
    {
      "indent": 3,
      "text": "There are a number of respects in which IETF participants and contributors appear to have become less fully engaged with the IETF processes, for example:",
      "zh-CHS": "IETF参与者和贡献者在许多方面似乎没有充分参与IETF过程，例如："
    },
    {
      "indent": 3,
      "text": "o Although there may be large attendance at many WG meetings, in many cases, 5% or less of the participants have read the drafts under discussion or that have a bearing on the decisions to be made.",
      "zh-CHS": "o 尽管许多工作组会议的出席人数可能很多，但在许多情况下，5%或更少的与会者阅读了正在讨论的草案或与将要作出的决定有关的草案。"
    },
    {
      "indent": 3,
      "text": "o Commitments to write, edit, or review a document are not carried out in a timely fashion.",
      "zh-CHS": "o 未及时履行编写、编辑或审查文件的承诺。"
    },
    {
      "indent": 3,
      "text": "o Little or no response is seen when a request for 'last-call' review is issued, either at WG or IETF level.",
      "zh-CHS": "o 当在工作组或IETF级别发出“最后一次呼叫”审查请求时，很少或根本看不到响应。"
    },
    {
      "indent": 3,
      "text": "This might be because contributors have less time available in their work schedule during the downturn of the Internet business climate between 2001 and 2003. Yet, this is not the whole story, as there were signs of this effect back at the height of the Internet's boom in 2000.",
      "zh-CHS": "这可能是因为在2001年至2003年互联网商业环境低迷期间，贡献者的工作日程安排时间较少。然而，这并不是全部，因为早在2000年互联网繁荣的鼎盛时期就有这种影响的迹象。"
    },
    {
      "indent": 3,
      "text": "This problem exacerbates the problems the IETF has had with timely delivery and may weaken the authority of IETF specifications if decisions are seen to be taken by badly informed participants and without widespread review.",
      "zh-CHS": "这个问题加剧了IETF在及时交付方面的问题，如果认为决策是由信息不灵通的参与者做出的，并且没有进行广泛审查，则可能削弱IETF规范的权威性。"
    },
    {
      "indent": 0,
      "text": "2.5.1. Lack of Formal Recognition",
      "section_title": true,
      "zh-CHS": "2.5.1. 缺乏正式承认"
    },
    {
      "indent": 3,
      "text": "Beyond RFC Authorship, WG Chair positions, Directorate positions, or IESG and Internet Architecture Board (IAB) membership, the IETF does not offer formal recognition of contributions to the IETF. This potentially acts as a disincentive to continued engagement and can lead to useful and effective participants leaving because they cannot obtain any recognition (the only currency the IETF has to pay participants), which they use to fuel their own enthusiasm and help justify their continued attendance at IETF meetings to cost constrained employers. Note: Using Leadership positions as rewards for good work would probably be damaging to the IETF. This paragraph is meant to indicate the need for other types of rewards.",
      "zh-CHS": "除了RFC作者、工作组主席职位、董事会职位或IESG和互联网架构委员会（IAB）成员之外，IETF不提供对IETF贡献的正式认可。这可能会抑制持续参与，并可能导致有用且有效的参与者离开，因为他们无法获得任何认可（IETF必须向参与者支付的唯一货币），他们用它来激发自己的热情，帮助那些成本有限的雇主证明他们继续参加IETF会议是合理的。注：使用领导职位作为良好工作的奖励可能会损害IETF。本段旨在说明需要其他类型的奖励。"
    },
    {
      "indent": 0,
      "text": "2.6. The IETF Management Structure is not Matched to the Current Size and Complexity of the IETF",
      "zh-CHS": "2.6. IETF管理结构与IETF的当前规模和复杂性不匹配"
    },
    {
      "indent": 3,
      "text": "The management and technical review processes currently in place were adequate for the older, smaller IETF, but are apparently not scalable to the current size of the organization. The form of the organization has not been significantly modified since 1992, since when the organization has undergone considerable further growth. The scope of IETF activities has also been extended as the Internet has become more complex.",
      "zh-CHS": "目前实施的管理和技术审查流程对于较旧、较小的IETF来说是足够的，但显然不能扩展到组织的当前规模。自1992年以来，本组织的形式没有重大改变，自那时以来，本组织经历了相当大的进一步发展。随着互联网变得越来越复杂，IETF活动的范围也在扩大。"
    },
    {
      "indent": 0,
      "text": "2.6.1. Span of Authority",
      "section_title": true,
      "zh-CHS": "2.6.1. 权限"
    },
    {
      "indent": 3,
      "text": "Overt authority in the IETF is concentrated in the small number of people sitting on the IESG at that time. Existing IETF processes work to funnel tasks on to this small number of people (primarily the Area Directors (ADs) in the IESG). This concentration slows process and puts a very large load of responsibility on the shoulders of these people who are required to act as the senior management for Working Group (WG) chairs, as well as acting as quality backstops for the large number of documents issued by the IETF. The situation has not been helped by the widening of the scope of the IETF, which has resulted in somewhat more WGs and a need for a very broad spectrum of knowledge within the set of ADs.",
      "zh-CHS": "IETF中的公开权威集中在当时坐在IESG上的少数人身上。现有的IETF流程将任务转移到这一小部分人身上（主要是IESG中的区域主管（ADs））。这种集中减缓了过程，并使这些人承担了很大的责任，他们被要求担任工作组（WG）主席的高级管理人员，并为IETF发布的大量文件提供质量保障。IETF范围的扩大并没有改善这种情况，这导致了更多的工作组，并且需要在ADs集合中获得非常广泛的知识。"
    },
    {
      "indent": 0,
      "text": "2.6.2. Workload of the IESG",
      "section_title": true,
      "zh-CHS": "2.6.2. IESG的工作量"
    },
    {
      "indent": 3,
      "text": "With the current structure of the IETF and IESG, the workload imposed on each of the ADs is almost certainly well beyond the capabilities of a single person.",
      "zh-CHS": "根据IETF和IESG的当前结构，施加在每个ADs上的工作量几乎肯定远远超过一个人的能力。"
    },
    {
      "indent": 3,
      "text": "The current job description for an AD encompasses at least the following tasks:",
      "zh-CHS": "广告的当前职务说明至少包括以下任务："
    },
    {
      "indent": 3,
      "text": "o Interacting with WGs",
      "zh-CHS": "o 与WGs交互"
    },
    {
      "indent": 3,
      "text": "o Understanding network and computer technology in general, and their own area in detail",
      "zh-CHS": "o 了解网络和计算机技术的一般情况，并详细了解自己的领域"
    },
    {
      "indent": 3,
      "text": "o Cross-pollinating between groups",
      "zh-CHS": "o 群间异花授粉"
    },
    {
      "indent": 3,
      "text": "o Coordinating with other areas",
      "zh-CHS": "o 与其他领域协调"
    },
    {
      "indent": 3,
      "text": "o Potentially, managing their Area Directorate team",
      "zh-CHS": "o 潜在地，管理他们的区域董事团队"
    },
    {
      "indent": 3,
      "text": "o Effectively providing technical management, people-management, and project supervision for their WGs",
      "zh-CHS": "o 有效地为其工作组提供技术管理、人员管理和项目监督"
    },
    {
      "indent": 3,
      "text": "o Reading (or at least skimming) every formal document which the IETF produces, and having an opinion on all of them, as well as all the Internet Drafts produced by the WGs in the area, and understanding the interactions between all these specifications.",
      "zh-CHS": "o 阅读（或至少略读）IETF编制的每一份正式文件，并对所有文件以及该地区工作组编制的所有互联网草案发表意见，了解所有这些规范之间的相互作用。"
    },
    {
      "indent": 3,
      "text": "Given the number of WGs which are now active, the increasing complexity of both the work being undertaken and the technology in general, together with the volume of documents being produced, makes it clear that only superhumans can be expected to do this job well. To make matters worse, these tasks are, in theory, a 'part time' occupation. ADs will normally have a conventional job, with the IETF activities as just one part of their job specification. This view has been reinforced by recent resignations from the IESG, citing the size of the workload as a primary factor. The IETF also has no mechanisms to nominate a temporary replacement or an assistant should an AD be incapacitated wholly or partially for a period.",
      "zh-CHS": "考虑到目前活跃的工作组的数量，正在进行的工作和总体技术的日益复杂，加上正在制作的文件数量，清楚地表明，只有超人才能做好这项工作。更糟糕的是，从理论上讲，这些任务是一种“兼职”职业。ADs通常有一个常规的工作，IETF活动只是其工作规范的一部分。IESG最近的辞职强化了这一观点，称工作量的大小是一个主要因素。如果AD在一段时间内完全或部分丧失行为能力，IETF也没有任命临时替代者或助理的机制。"
    },
    {
      "indent": 3,
      "text": "The malign effects of this overload include:",
      "zh-CHS": "这种过载的有害影响包括："
    },
    {
      "indent": 3,
      "text": "o Wear on the IESG: The IESG members are overworked which is bad for their health, humor, and home life, and may also result in conflicts with their employers if the IETF work impacts the IESG member's performance of their 'day job'.",
      "zh-CHS": "o 穿在IESG上：IESG成员工作过度，这不利于他们的健康、幽默和家庭生活，如果IETF工作影响IESG成员的“日常工作”，也可能导致与雇主发生冲突。"
    },
    {
      "indent": 3,
      "text": "o Unhappiness in the IETF: IETF stakeholders perceive that IESG members are responding slowly, are not fully up-to-date with their technology, fail to pro-actively manage problems in their WGs, and are unable to keep communication channels with other groups open.",
      "zh-CHS": "o IETF中的不愉快：IETF利益相关者认为IESG成员反应缓慢，没有完全跟上他们的技术，未能主动管理工作组中的问题，并且无法保持与其他组的沟通渠道畅通。"
    },
    {
      "indent": 3,
      "text": "o Recruiting shrinkage: The number of people who can imagine taking on an IESG post is steadily decreasing. It is largely limited to people who work for large companies who can afford to send IESG members to the IETF for the duration of their appointments. In the current business climate, fewer companies are able to justify the preemption of an important engineering and business resource for a significant period of time, and are more likely to put forward 'standards professionals' than their best engineers.",
      "zh-CHS": "o 招聘减少：可以想象担任IESG职位的人数正在稳步减少。它主要局限于在大公司工作的人，他们有能力在任命期间派遣IESG成员到IETF。在当前的商业环境中，很少有公司能够证明在相当长的一段时间内抢占重要的工程和业务资源是合理的，并且比他们最好的工程师更有可能提出“标准专业人士”。"
    },
    {
      "indent": 0,
      "text": "2.6.3. Procedural Blockages",
      "section_title": true,
      "zh-CHS": "2.6.3. 程序性障碍"
    },
    {
      "indent": 3,
      "text": "The current procedural rules combined with the management and quality roles of the ADs can lead to situations where WGs or document authors believe that one or two ADs are deliberately blocking the progress of a WG document without good reason or public justification. Appeal processes in these circumstances are limited and the only sanction that could be applied to the relevant ADs is recall, which has almost always been seen to be out of scale with the apparent offense and hence almost never invoked. This perception of invulnerability has led to a view that the IESG in general and the ADs in particular are insufficiently accountable for their actions to their WGs and the IETF at large, although the recent introduction of the Internet Draft Tracker tool makes it easier to determine if and how a document has become blocked, and hence to take appropriate steps to release it.",
      "zh-CHS": "当前的程序规则与ADs的管理和质量角色相结合，可能导致工作组或文件作者认为一个或两个ADs在没有充分理由或公开理由的情况下故意阻止工作组文件的进度。在这些情况下，上诉程序是有限的，对相关广告的唯一制裁是召回，这几乎总是被视为与明显的违法行为不相称，因此几乎从未被援引。这种对无懈可击的看法导致了这样一种观点，即IESG，尤其是ADs，对其工作组和IETF的行为没有足够的责任，尽管最近推出的互联网草稿跟踪工具更容易确定文档是否以及如何被阻止，并因此采取适当的措施来释放它。"
    },
    {
      "indent": 0,
      "text": "2.6.4. Consequences of Low Throughput in IESG",
      "section_title": true,
      "zh-CHS": "2.6.4. IESG低吞吐量的后果"
    },
    {
      "indent": 3,
      "text": "If documents are inappropriately (or even accidentally) delayed or blocked as a result of IESG (in)action, this can cause much frustration inside the organization, a perception of disunity seen from outside the organization, and delay of standards, possibly to the point where they are too late to match market requirements: work which has been properly authorized as being within the scope of the IETF and properly quality checked during development, should almost never come up against such a blockage.",
      "zh-CHS": "如果文件因IESG（运行中）而被不适当地（甚至意外地）延迟或阻止，这可能会在组织内部造成很大的挫败感，从组织外部看到不团结的感觉，以及标准的延迟，可能到了无法满足市场要求的地步：已被适当授权为在IETF范围内并在开发过程中进行了适当质量检查的工作几乎永远不会遇到这种阻碍。"
    },
    {
      "indent": 3,
      "text": "Delay in authorizing a BOF or chartering a new WG can delay the start of the process with similar effects.",
      "zh-CHS": "延迟授权BOF或租用新工作组可能会延迟流程的启动，并产生类似的影响。"
    },
    {
      "indent": 3,
      "text": "It also appears that IESG delays are sometimes used to excuse what is actually slow work in WGs.",
      "zh-CHS": "此外，IESG延迟似乎有时被用来解释WGs中实际缓慢的工作。"
    },
    {
      "indent": 0,
      "text": "2.6.5. Avoidance of Procedural Ossification",
      "section_title": true,
      "zh-CHS": "2.6.5. 避免程序性骨化"
    },
    {
      "indent": 3,
      "text": "The systems and processes used by the IETF are generally designed around having firm general principles and considerable IESG discretion within those principles. It appears that the IETF is showing a disturbing tendency to turn IESG 'rules of convenience' into rigid strictures that cannot be violated or deviated from.",
      "zh-CHS": "IETF使用的系统和过程通常是围绕着有明确的一般原则和IESG在这些原则范围内的相当大的自由裁量权而设计的。IETF似乎表现出一种令人不安的趋势，即将IESG的“便利规则”变成不能违反或偏离的严格限制。"
    },
    {
      "indent": 3,
      "text": "Up to now, IETF discussions of procedures have been driven by a model in which the procedural BCPs construct a framework for doing work, but the details of the framework are left for the IESG to fill in. When issues or crises have arisen, the IETF has generally avoided making specific procedural changes to compensate, instead realizing that we could not anticipate all cases and that 'fighting the last war' is not a good way to proceed.",
      "zh-CHS": "到目前为止，IETF对程序的讨论是由一个模型驱动的，在该模型中，程序BCP构建了一个工作框架，但该框架的细节留待IESG填写。当出现问题或危机时，IETF通常避免做出具体的程序变更以进行补偿，相反，IETF意识到我们无法预测所有案例，“打最后一场战争”并不是一个好办法。"
    },
    {
      "indent": 3,
      "text": "This can only continue to work if the participants continue to trust the IESG to act fairly in filling in the details and making appropriate exceptions, without a great deal of debate, when it is clearly desirable. At present, the IETF appears to have lost sight of this flexibility, and is entangling itself in procedures that evolve from organizational conveniences into encumbrances.",
      "zh-CHS": "只有当参与者继续相信IESG在填写细节和做出适当的例外情况时能够公平行事，而不需要进行大量的辩论，这一点才能继续发挥作用。目前，IETF似乎已经忽视了这种灵活性，并将自己纠缠在从组织便利性演变为产权负担的程序中。"
    },
    {
      "indent": 0,
      "text": "2.6.6. Concentration of Influence in Too Few Hands",
      "section_title": true,
      "zh-CHS": "2.6.6. 影响力集中在少数人手中"
    },
    {
      "indent": 3,
      "text": "Until the last couple of years, successive IETF Nominating Committees have chosen to give heavy weighting to continuity of IESG and IAB membership. Thus, the IETF appeared to have created an affinity group system which tended to re-select the same leaders from a limited pool of people who had proved competent and committed in the past.",
      "zh-CHS": "直到最近几年，连续几届IETF提名委员会都选择对IESG和IAB成员资格的连续性给予很大的重视。因此，IETF似乎创建了一个亲和力小组系统，该系统倾向于从有限的人才库中重新选择同样的领导人，这些人在过去被证明是有能力和有献身精神的。"
    },
    {
      "indent": 3,
      "text": "Members of this affinity group tend to talk more freely to each other and former members of the affinity group - this may be because the affinity group has also come to share a cultural outlook which matches the dominant cultural ethos of the IETF (North American, English speaking). Newcomers to the organization and others outside the affinity group are reluctant to challenge the apparent authority of the extended affinity group during debates and consequently influence remains concentrated in a relatively small group of people.",
      "zh-CHS": "该亲和力小组的成员之间以及亲和力小组的前成员之间的交流更为自由——这可能是因为该亲和力小组也开始分享一种与IETF（北美，说英语）的主流文化精神相匹配的文化观。新加入组织的人和亲和力小组之外的其他人不愿意在辩论中挑战扩展亲和力小组的表面权威，因此影响力仍然集中在相对较小的群体中。"
    },
    {
      "indent": 3,
      "text": "This reluctance may also be exacerbated if participants come from a different cultural background than the dominant one. Such participants also tend to find it more difficult to follow the rapid and colloquial speaking style of native English speakers, and may consequently be effectively excluded from the discussion, even if maximum assistance is available by such means as real time Jabber logs and extensive text on presentation slides. Even on mailing",
      "zh-CHS": "如果参与者的文化背景与主流文化背景不同，这种不情愿也可能加剧。这些参与者还发现更难跟上以英语为母语的人的快速口语风格，因此可能会被有效地排除在讨论之外，即使可以通过实时聊天日志和演示幻灯片上的大量文本等方式获得最大程度的帮助。即使是邮寄"
    },
    {
      "indent": 3,
      "text": "lists, people from other cultures may be reluctant to be as forthright as is often the case in discussions between North Americans; also, a person whose first language is not English may be daunted by the volume of mail that can occur on some mailing lists and the use of colloquialisms or euphemisms may cause misunderstandings if correspondents are not aware of the problem.",
      "zh-CHS": "在清单中，来自其他文化背景的人可能不愿意像在北美之间的讨论中那样直言不讳；此外，母语不是英语的人可能会被一些邮件列表上可能出现的邮件量吓倒，如果通讯员没有意识到这个问题，使用口语或委婉语可能会造成误解。"
    },
    {
      "indent": 3,
      "text": "A further instance of the problems of concentration of influence potentially occurs when, from time to time, ADs have acted as WG chairs: conflict of interest might well arise in discussions between the IESG and any WG with an AD as its chair. Whilst care is usually taken to have a newly selected AD vacate any WG chair positions which might be held in his or her own area, the conflict can arise on the occasions when an AD has been used as the chair of a WG because it is clearly the right (or only possible) solution for the WG from an engineering and know-how position. Furthermore, given the known problem of workload for IESG members, there must be doubts as to whether an AD can or ought to be taking on this extra load.",
      "zh-CHS": "当ADs不时担任工作组主席时，可能会出现影响集中问题的另一个例子：IESG和任何由AD担任主席的工作组之间的讨论可能会产生利益冲突。虽然通常会注意让新选择的广告腾出其所在区域内可能担任的任何工作组主席职位，但在广告被用作工作组主席的情况下，可能会发生冲突，因为这显然是工作组从工程和专有技术职位获得的正确（或唯一可能）解决方案。此外，鉴于IESG成员工作量的已知问题，必须怀疑广告是否能够或应该承担这一额外的工作量。"
    },
    {
      "indent": 0,
      "text": "2.6.7. Excessive Reliance on Personal Relationships",
      "section_title": true,
      "zh-CHS": "2.6.7. 过度依赖人际关系"
    },
    {
      "indent": 3,
      "text": "The IETF is an intensely personal and individualistic organization. Its fundamental structure is based on individuals as actors, rather than countries, organizations, or companies as in most other SDOs.",
      "zh-CHS": "IETF是一个高度个人化和个人主义的组织。它的基本结构是基于作为参与者的个人，而不是像大多数其他SDO那样的国家、组织或公司。"
    },
    {
      "indent": 3,
      "text": "This is also reflected in how the IETF gets its work done: the NOMCOM process, the WG Chair selection processes, and the activities of WGs are all reliant on personal knowledge of the capabilities of other individuals and an understanding built on experience of what they can be expected to deliver, given that there are almost no sanctions that can be applied beyond not asking them to do a similar task again. The relationship works best when it is two way - the person being asked to perform a task needs to be able to rely on the behavior of the person doing the asking.",
      "zh-CHS": "这也反映在IETF完成工作的方式上：NOMCOM过程、工作组主席选择过程和工作组的活动都依赖于个人对其他个人能力的了解，以及基于经验的对他们可以提供什么的理解，鉴于除了不要求他们再次执行类似任务外，几乎没有其他制裁措施可以实施。当这种关系是双向的时，这种关系最为有效——被要求执行任务的人需要能够依赖于执行任务的人的行为。"
    },
    {
      "indent": 3,
      "text": "In essence, the IETF is built on a particular kind of one-to-one personal trust relationship. This is a very powerful model but it does not scale well because this trust is not transitive. Just because you trust one person, it does not mean that you trust (i.e., know the capabilities of and can rely on) all the people that person trusts in turn.",
      "zh-CHS": "本质上，IETF建立在一种特殊的一对一的个人信任关系之上。这是一个非常强大的模型，但它不能很好地扩展，因为这种信任是不可传递的。仅仅因为你信任一个人，并不意味着你依次信任（即，知道该人信任的所有人的能力和可以依赖的人）。"
    },
    {
      "indent": 3,
      "text": "The disruption caused when one set of relationships has to be replaced by another is clearest when an AD is replaced. The IETF does not keep personnel records or written plans, and formal process documentation is very sparse, so that incoming ADs have little information on which to base new relationships with WG chairs or Directorate members not already known to them.",
      "zh-CHS": "当一组关系被另一组关系替换时，所造成的中断在一个广告被替换时最为明显。IETF没有保存人事记录或书面计划，正式的过程文档非常稀少，因此，新的ADs几乎没有任何信息可以作为与工作组主席或董事会成员建立新关系的基础，而这些成员还不知道。"
    },
    {
      "indent": 3,
      "text": "A new AD has to build or bring along his or her set of trusted individuals. The AD will tend to prefer individuals from this set as WG chairs, unless there is a suitable outsider who was part of the team that brought the WG idea to the IETF. This tends to limit the AD's field of choice, particularly when asking for a 'stabilizing', 'advising', or 'process' chair to work with an enthusiastic newcomer in a difficult area. A breakdown of an established relationship (such as between an AD and a WG chair) can be very damaging to the work of the IETF, and it may not be immediately obvious to outsiders.",
      "zh-CHS": "一个新的广告必须建立或带来他或她信任的人。广告将倾向于选择这组人担任工作组主席，除非有合适的局外人是将工作组想法带到IETF的团队的一部分。这往往会限制广告的选择范围，特别是在要求“稳定”、“建议”或“流程”主席在困难领域与热情的新来者合作时。已经建立的关系的破裂（如广告和工作组主席之间的关系）可能会对IETF的工作造成极大的损害，并且对外部人员来说可能不会立即显现出来。"
    },
    {
      "indent": 3,
      "text": "Another consequence of the reliance on personal relationships is that the IETF has very little institutional 'memory' outside the memories of the people in the process at a given time. This makes it more likely that failures will be repeated and makes process improvement more difficult (see Section 2.2).",
      "zh-CHS": "依赖人际关系的另一个后果是，IETF在给定时间内，除了参与过程的人的记忆之外，几乎没有什么机构“记忆”。这使得故障更可能重复发生，并使过程改进更加困难（见第2.2节）。"
    },
    {
      "indent": 0,
      "text": "2.6.8. Difficulty making Technical and Process Appeals",
      "section_title": true,
      "zh-CHS": "2.6.8. 技术和程序上诉的困难"
    },
    {
      "indent": 3,
      "text": "When an individual thinks that the process has produced a result that is harmful to the Internet or thinks that IETF processes have not been adhered to, there is no mechanism to aid that individual in seeking to change that result.",
      "zh-CHS": "当个人认为该过程产生了对互联网有害的结果，或认为IETF过程没有得到遵守时，没有任何机制来帮助该个人寻求改变该结果。"
    },
    {
      "indent": 0,
      "text": "2.7. Working Group Dynamics can make Issue Closure Difficult",
      "section_title": true,
      "zh-CHS": "2.7. 工作组的动态会使问题难以解决"
    },
    {
      "indent": 3,
      "text": "The IETF appears to be poor at making timely and reasonable decisions that can be guaranteed to be adhered to during the remainder of a process or until shown to be incorrect.",
      "zh-CHS": "IETF在及时做出合理决策方面表现不佳，这些决策可以保证在流程的剩余部分或在被证明不正确之前得到遵守。"
    },
    {
      "indent": 3,
      "text": "The problems documented in this section are probably consequences of the non-hierarchical organization of the IETF and the volunteer status of most participants. The enforcement measures available in a more conventional hierarchical corporate environment are mostly not available here, and it is unlikely that application of some well-known procedure or practice will fix these problems.",
      "zh-CHS": "本节中记录的问题可能是IETF的非等级组织和大多数参与者的志愿者状态的后果。在更为传统的层级式公司环境中，现有的执法措施大多不适用于此，应用一些众所周知的程序或实践不太可能解决这些问题。"
    },
    {
      "indent": 3,
      "text": "Participants are frequently allowed to re-open previously closed issues just to replay parts of the previous discussion without introducing new material. This may be either because the decision has not been clearly documented, or it may be a maneuver to try to get a decision changed because the participant did not concur with the consensus originally. In either case, revisiting decisions stops the process from moving forward, and in the worst cases, can completely derail a working group. On the other hand, the decision making process must allow discussions to be re-opened if significant new information comes to light or additional experience is gained which appears to justify alternative conclusions for a closed issue.",
      "zh-CHS": "参与者经常被允许重新打开以前已关闭的问题，只是为了重播以前讨论的部分内容，而不引入新材料。这可能是因为决策没有明确记录，也可能是因为参与者最初不同意共识而试图改变决策的一种策略。在任何一种情况下，重新考虑决定都会阻止这一进程向前发展，在最坏的情况下，可能会使工作组完全脱轨。另一方面，如果发现重要的新信息或获得了额外的经验，而这些经验似乎证明有理由对一个已解决的问题得出其他结论，则决策过程必须允许重新展开讨论。"
    },
    {
      "indent": 3,
      "text": "One cause that can lead to legitimate attempts to re-open an apparently closed issue is the occurrence of 'consensus by exhaustion'. The consensus process can be subverted by off-topic or overly dogmatic mail storms which can lead to the exclusion of knowledgeable participants who are unable to devote the time needed to counter the mail storm. The consequence may be an unrepresentative and unsatisfactory consensus which will tend to be re-opened, often leading to repeat discussions. Mailing lists, which are at the heart of the IETF WG process, are becoming increasingly ineffective at resolving issues and achieving consensus because of this phenomenon.",
      "zh-CHS": "一个可能导致合法尝试重新打开一个显然已关闭的问题的原因是“通过用尽达成共识”。协商一致的过程可能被偏离主题或过于教条的邮件风暴所颠覆，这可能导致知识渊博的参与者被排除在外，他们无法投入时间应对邮件风暴。其结果可能是一种不具代表性和令人不满意的共识，这种共识往往会重新开放，常常导致重复讨论。邮件列表是IETF工作组流程的核心，由于这种现象，邮件列表在解决问题和达成共识方面变得越来越无效。"
    },
    {
      "indent": 3,
      "text": "A single vocal individual or small group can be a particular challenge to WG progress and the authority of the chair. The IETF does not have a strategy for dealing effectively with an individual who is inhibiting progress, whilst ensuring that an individual who has a genuine reason for revisiting a decision is allowed to get his or her point across.",
      "zh-CHS": "一个单独的个人或小组可能对工作组的进展和主席的权威构成特别的挑战。IETF没有有效处理阻碍进展的个人的策略，同时确保有真实理由重新考虑决策的个人能够表达其观点。"
    },
    {
      "indent": 0,
      "text": "2.8. IETF Participants and Leaders are Inadequately Prepared for their Roles",
      "zh-CHS": "2.8. IETF参与者和领导者对自己的角色准备不足"
    },
    {
      "indent": 3,
      "text": "Participants and leaders at all levels in the IETF need to be taught the principles of the organization (Mission and Architecture(s)) and trained in carrying out the processes, which they have to use in developing specifications, etc.",
      "zh-CHS": "IETF中所有级别的参与者和领导者都需要学习组织原则（任务和架构），并在执行过程中接受培训，这些过程必须用于制定规范等。"
    },
    {
      "indent": 3,
      "text": "Part of the reason for the lack of training in the principles of the organization is that there is not currently an explicit formulation of these principles that is generally agreed upon by all stakeholders. Section 2.1 identifies that this shortage is a major problem.",
      "zh-CHS": "缺乏本组织原则方面的培训的部分原因是，目前没有明确制定所有利益攸关方普遍同意的这些原则。第2.1节指出，这种短缺是一个主要问题。"
    },
    {
      "indent": 3,
      "text": "The IETF currently has voluntary and inconsistent processes for educating its participants, which may be why significant numbers of participants seem to fail to conform to the proper principles when working in the IETF context.",
      "zh-CHS": "IETF目前有自愿且不一致的参与者教育流程，这可能就是为什么大量参与者在IETF环境下工作时似乎不符合适当原则的原因。"
    },
    {
      "indent": 3,
      "text": "The people in authority have generally been steeped in the principles of the IETF (as they see them) and first-time non-compliance by newer participants is sometimes treated as an opportunity for abuse rather than recognition of a training failure.",
      "zh-CHS": "权威人士通常都沉浸在IETF的原则中（正如他们所看到的），新参与者的首次不遵守有时被视为滥用的机会，而不是承认培训失败。"
    },
    {
      "indent": 3,
      "text": "The IETF culture of openness also tends to tolerate participants who, whilst understanding the principles of the IETF, disagree with them and actively ignore them. This can be confusing for newer participants, but they need to be made aware that the IETF does not exclude such people. The IETF does not currently have a strategy for",
      "zh-CHS": "IETF的开放文化也倾向于容忍那些在理解IETF原则的同时，不同意IETF原则并积极忽略这些原则的参与者。这可能会让新参与者感到困惑，但他们需要意识到IETF并不排除这些人。IETF目前没有针对以下方面的战略："
    },
    {
      "indent": 3,
      "text": "dealing with the conflicts that can result from participants who disagree with the principles of the organization.",
      "zh-CHS": "处理因参与者不同意组织原则而产生的冲突。"
    },
    {
      "indent": 3,
      "text": "Lack of training, compounded with the perceived concentration of influence in the affinity group documented in Section 2.6.6, can lead to newcomers being ignored during discussions, consequently being ineffective, either in their own eyes or their employers. This may result in their departure from the IETF.",
      "zh-CHS": "缺乏培训，再加上第2.6.6节中记录的亲和力群体中的影响力集中，可能会导致新员工在讨论中被忽视，从而在他们自己或他们的雇主看来都是无效的。这可能导致他们偏离IETF。"
    },
    {
      "indent": 3,
      "text": "In addition, some participants are not aware of the problems that participants, who do not have English as their first language, may have with rapid speaking and the use of colloquialisms in both spoken and written communication. They are also not always aware of the possible cultural nuances that may make full participation more difficult for those who do not share the same outlook.",
      "zh-CHS": "此外，一些参与者没有意识到不以英语为第一语言的参与者在口语和书面交流中的快速口语和口语使用方面可能存在的问题。他们也不总是意识到可能存在的文化差异，这可能使那些观点不同的人更难充分参与。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not, of itself, have security implications, but it may have identified problems which raise security considerations for other work. Any such implications should be considered in the companion document which will be produced setting out how the IETF should set about solving the identified problems.",
      "zh-CHS": "本文件本身并不涉及安全问题，但它可能已经确定了引起其他工作安全考虑的问题。任何此类影响都应在配套文件中予以考虑，该文件将规定IETF应如何着手解决已识别的问题。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "zh-CHS": "4. 致谢"
    },
    {
      "indent": 3,
      "text": "Apart from the contributions of all those who provided input on the problem statement mailing list, the final reduction of the problems was especially assisted by the following people:",
      "zh-CHS": "除了所有在问题陈述邮寄清单上提供意见的人的贡献外，以下人员特别帮助最终减少了问题："
    },
    {
      "indent": 6,
      "text": "Rob Austein <sra@hactrn.net>\nMarc Blanchet <Marc.Blanchet@hexago.com>\nDave Crocker <dcrocker@brandenburg.com>\nSpencer Dawkins <spencer@mcsr-labs.org>\nAvri Doria <avri@psg.com> (WG co-chair)\nJeanette Hoffmann <jeanette@wz-berlin.de>\nMelinda Shore <mshore@cisco.com> (WG co-chair)\nMargaret Wasserman <margaret@thingmagic.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Special thanks are due to Margaret Wasserman for extensive reviewing of and contributions to the wording of Section 2.",
      "zh-CHS": "特别感谢Margaret Wasserman对第2节的措辞进行了广泛的审查并做出了贡献。"
    },
    {
      "indent": 3,
      "text": "The early part of the reduction of the problem statement mailing list input was done by Harald Alvestrand and the latter part by Elwyn Davies and the team acknowledged above. In total, there were approximately 750 extensive and thoughtful contributions (some making",
      "zh-CHS": "减少问题陈述邮件列表输入的早期部分由Harald Alvestrand完成，后期部分由Elwyn Davies和上述团队完成。总的来说，大约有750项广泛而有思想的贡献（有些贡献是"
    },
    {
      "indent": 3,
      "text": "several points). The thread was started by a call for volunteers in helping draft a problem statement, but quickly turned into a discussion of what the problems were.",
      "zh-CHS": "几点）。这条线索最初是呼吁志愿者帮助起草一份问题陈述，但很快就变成了对问题所在的讨论。"
    },
    {
      "indent": 3,
      "text": "In addition to the editorial team, the following people have provided additional input and useful feedback on earlier versions of this document: Harald Alvestrand, Randy Bush, Brian Carpenter, James Kempf, John Klensin, John Loughney, Keith Moore.",
      "zh-CHS": "除编辑团队外，以下人员还就本文件的早期版本提供了额外的投入和有用的反馈：Harald Alvestrand、Randy Bush、Brian Carpenter、James Kempf、John Klesins、John Loughney、Keith Moore。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "zh-CHS": "5.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[1] Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "zh-CHS": "5.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[2] Huston, G. and M. Rose, \"A Proposal to Improve IETF Productivity\", Work in Progress.",
      "zh-CHS": "[2] Huston，G.和M.Rose，“提高IETF生产率的建议”，正在进行中。"
    },
    {
      "indent": 3,
      "text": "[3] Blanchet, M., \"Suggestions to Streamline the IETF Process\", Work in Progress.",
      "zh-CHS": "[3] Blanchet，M.，“精简IETF流程的建议”，正在进行的工作。"
    },
    {
      "indent": 3,
      "text": "[4] Hardie, T., \"Working Groups and their Stuckees\", Work in Progress.",
      "zh-CHS": "[4] Hardie，T.，“工作组及其障碍”，进展中的工作。"
    },
    {
      "indent": 3,
      "text": "[5] Davies, E. and J. Hofmann, Eds., \"IETF Problem Resolution Processes\", Work in Progress.",
      "zh-CHS": "[5] Davies，E.和J.Hofmann编辑，“IETF问题解决过程”，正在进行中。"
    },
    {
      "indent": 0,
      "text": "6. Editor's Address",
      "section_title": true,
      "zh-CHS": "6. 编辑地址"
    },
    {
      "indent": 3,
      "text": "Elwyn B. Davies Nortel Networks Harlow Laboratories London Road Harlow, Essex CM17 9NA UK",
      "zh-CHS": "Elwyn B.Davies Nortel Networks哈洛实验室伦敦路哈洛，英国埃塞克斯CM17 9NA"
    },
    {
      "indent": 3,
      "text": "Phone: +44 1279 405 498\nEMail: elwynd@nortelnetworks.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "7. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}