{
  "title": {
    "text": "RFC 3786:  Extending the Number of Intermediate System to Intermediate System (IS-IS) Link State PDU (LSP) Fragments Beyond the 256 Limit ",
    "zh-CHS": "RFC 3786"
  },
  "number": 3786,
  "created_at": "2021-11-18 01:33:16.948349+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        A. Hermelin\nRequest for Comments: 3786                                 Montilio Inc.\nCategory: Informational                                       S. Previdi\n                                                                M. Shand\n                                                           Cisco Systems\n                                                                May 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": " Extending the Number of Intermediate System to Intermediate System (IS-IS) Link State PDU (LSP) Fragments Beyond the 256 Limit",
      "zh-CHS": "将中间系统到中间系统（IS-IS）链路状态PDU（LSP）片段的数量扩展到256个限制之外"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a mechanism that allows a system to originate more than 256 Link State PDU (LSP) fragments, a limit set by the original Intermediate System to Intermediate System (IS-IS) Routing protocol, as described in ISO/IEC 10589. This mechanism can be used in IP-only, OSI-only, and dual routers.",
      "zh-CHS": "本文档描述了一种机制，该机制允许系统生成256个以上的链路状态PDU（LSP）片段，这是由原始中间系统到中间系统（IS-IS）路由协议设置的限制，如ISO/IEC 10589所述。此机制可用于仅IP、仅OSI和双路由器。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction .................................................  2\n    1.1.  Keywords ...............................................  2\n    1.2.  Definitions of Commonly Used Terms .....................  2\n    1.3.  Operation Modes ........................................  3\n    1.4.  Overview ...............................................  4\n2.  IS Alias ID TLV (IS-A) .......................................  5\n3.  Generating LSPs ..............................................  6\n    3.1.  Both Operation Modes ...................................  6\n    3.2.  Operation Mode 1 Additives .............................  8\n4.  Purging Extended LSP Fragments ............................... 10\n5.  Modifications to LSP handling in SPF ......................... 10\n6.  Forming Adjacencies .......................................... 11\n7.  Interoperating between extension-capable and non-capable ISs . 11\n8.  Security Considerations ...................................... 12\n9.  Acknowledgements ............................................. 12",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "10. References ................................................... 12\n11. Authors' Addresses ........................................... 13\n12. Full Copyright Statement ..................................... 14",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "In the Intermediate System to Intermediate System (IS-IS) protocol, a system floods its link-state information in Link State PDU (LSP) Data Units, or LSPs for short. These logical LSPs can become quite large, therefore the protocol specifies a means of fragmenting this information into multiple LSP fragments. The number of fragments a system can generate is limited by ISO/IEC 10589 [ISIS-ISO] to 256 fragments, where each fragment's size is also limited. Hence, there is a limit on the amount of link-state information a system can generate.",
      "zh-CHS": "在中间系统到中间系统（IS-IS）协议中，系统在链路状态PDU（LSP）数据单元（简称LSP）中泛滥其链路状态信息。这些逻辑LSP可能变得相当大，因此协议指定了一种将这些信息分割成多个LSP片段的方法。系统可以生成的碎片数量受ISO/IEC 10589[ISIS-ISO]限制为256个碎片，其中每个碎片的大小也受到限制。因此，系统可以生成的链路状态信息量是有限制的。"
    },
    {
      "indent": 3,
      "text": "A number of factors can contribute to exceeding this limit:",
      "zh-CHS": "有许多因素可能导致超过此限值："
    },
    {
      "indent": 3,
      "text": "- Introduction of new TLVs and sub-TLVs to be included in LSPs. - The use of LSPs to propagate various types of information (such as traffic-engineering information). - The increasing number of destinations and AS topologies. - Finer granularity routing, and the ability to inject external routes into areas [DOMAIN-WIDE]. - Other emerging technologies, such as optical, IPv6, etc.",
      "zh-CHS": "- 引入新的TLV和子TLV，包括在LSP中。-使用LSP传播各种类型的信息（如交通工程信息）。-越来越多的目的地和AS拓扑更精细的粒度路由，以及将外部路由注入[域范围]区域的能力其他新兴技术，如光纤、IPv6等。"
    },
    {
      "indent": 3,
      "text": "This document describes mechanisms to relax the limit on the number of LSP fragments.",
      "zh-CHS": "本文档描述了放宽LSP片段数量限制的机制。"
    },
    {
      "indent": 0,
      "text": "1.1. Keywords",
      "section_title": true,
      "zh-CHS": "1.1. 关键词"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [BCP14].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照BCP 14、RFC 2119[BCP14]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "1.2. Definitions of Commonly Used Terms",
      "section_title": true,
      "zh-CHS": "1.2. 常用术语的定义"
    },
    {
      "indent": 3,
      "text": "This section provides definitions for terms that are used throughout the text.",
      "zh-CHS": "本节提供全文中使用的术语的定义。"
    },
    {
      "indent": 6,
      "text": "Originating System A router physically running the IS-IS protocol. As this document describes methods allowing a single IS-IS process to advertise its LSPs as multiple \"virtual\" routers, the Originating System represents the single \"physical\" IS-IS process.",
      "zh-CHS": "发起系统物理上运行IS-IS协议的路由器。由于本文档描述了允许单个IS-IS进程将其LSP作为多个“虚拟”路由器发布的方法，发起系统表示单个“物理”IS-IS进程。"
    },
    {
      "indent": 6,
      "text": "Normal system-id The system-id of an Originating System.",
      "zh-CHS": "正常系统id原始系统的系统id。"
    },
    {
      "indent": 6,
      "text": "Additional system-id An Additional system-id that is assigned by the network administrator. Each Additional system-id allows generation of 256 additional, or extended, LSP fragments. The Additional system-id, like the Normal system-id, must be unique throughout the routing domain.",
      "zh-CHS": "附加系统id由网络管理员分配的附加系统id。每个额外的系统id允许生成256个额外的或扩展的LSP片段。额外的系统id，如正常的系统id，在整个路由域中必须是唯一的。"
    },
    {
      "indent": 6,
      "text": "Virtual System The system, identified by an Additional system-id, advertised as originating the extended LSP fragments. These fragments specify the Additional system-id in their LSP IDs.",
      "zh-CHS": "虚拟系统通过附加系统id标识的系统，作为扩展LSP片段的始发者进行广告。这些片段在其LSP id中指定附加的系统id。"
    },
    {
      "indent": 6,
      "text": "Original LSP An LSP using the Normal system-id in its LSP ID.",
      "zh-CHS": "原始LSP在其LSP id中使用正常系统id的LSP。"
    },
    {
      "indent": 6,
      "text": "Extended LSP An LSP using an Additional system-id in its LSP ID.",
      "zh-CHS": "扩展LSP在其LSP id中使用附加系统id的LSP。"
    },
    {
      "indent": 6,
      "text": "LSP set Logical LSP. This term is used only to resolve the ambiguity between a logical LSP and an LSP fragment, both of which are sometimes termed \"LSP\".",
      "zh-CHS": "LSP设置逻辑LSP。该术语仅用于解决逻辑LSP和LSP片段之间的歧义，两者有时被称为“LSP”。"
    },
    {
      "indent": 6,
      "text": "Extended LSP set A group of LSP fragments using an Additional system-id, and originated by the Originating System.",
      "zh-CHS": "扩展LSP使用附加系统id设置一组LSP片段，并由发起系统发起。"
    },
    {
      "indent": 6,
      "text": "Extension-capable IS An IS implementing the mechanisms described in this document.",
      "zh-CHS": "扩展功能是一种正在实现本文档中描述的机制的工具。"
    },
    {
      "indent": 0,
      "text": "1.3. Operation Modes",
      "section_title": true,
      "zh-CHS": "1.3. 运行模式"
    },
    {
      "indent": 3,
      "text": "Two administrative operation modes are provided:",
      "zh-CHS": "提供两种管理操作模式："
    },
    {
      "indent": 3,
      "text": "- Operation Mode 1 provides behavior that allows implementations that don't support this extension, to correctly process the extended fragment information, without any modifications. This mode has some restrictions on what may be advertised in the extended LSP fragments. Namely, only leaf information may be advertised in the extended LSPs.",
      "zh-CHS": "- 操作模式1提供的行为允许不支持此扩展的实现在不进行任何修改的情况下正确处理扩展的片段信息。此模式对扩展LSP片段中可能播发的内容有一些限制。即，在扩展lsp中只能通告叶信息。"
    },
    {
      "indent": 3,
      "text": "- Operation Mode 2 extends the previous mode and relaxes its advertisement restrictions. Any link-state information may be advertised in the extended LSPs. However, it mandates a change to the way LSPs are considered during the SPF algorithm, in a way that is not compatible with previous implementations.",
      "zh-CHS": "- 操作模式2扩展了先前的模式，并放宽了其广告限制。任何链路状态信息都可以在扩展lsp中通告。但是，它要求改变在SPF算法期间考虑LSP的方式，这种方式与以前的实现不兼容。"
    },
    {
      "indent": 3,
      "text": "These modes are configured on a per-level and area basis. That is, all LSPs considered in the same SPF instance MUST use the same Mode. There is no restriction that an L1/L2 IS operates in the same mode, for both its L1 and L2 instances. It can use Mode 1 for its L1 LSPs, and Mode 2 for its L2 LSPs, or vice versa.",
      "zh-CHS": "这些模式按级别和区域进行配置。也就是说，在同一SPF实例中考虑的所有LSP必须使用相同的模式。对于L1和L2实例，L1/L2在相同模式下运行没有限制。它可以对其L1 LSP使用模式1，对其L2 LSP使用模式2，反之亦然。"
    },
    {
      "indent": 3,
      "text": "Mode 1 has the only advantage of being backwards compatible with older implementations. It does have restrictions which are considered drawbacks. Therefore, routers should operate in Mode 1 only if backwards compatibility is desired. Otherwise, it is recommended to run in Mode 2.",
      "zh-CHS": "模式1的唯一优点是向后兼容较旧的实现。它确实有一些被认为是缺点的限制。因此，只有在需要向后兼容性的情况下，路由器才应在模式1下运行。否则，建议在模式2下运行。"
    },
    {
      "indent": 3,
      "text": "Routers MAY implement Operational Mode 2 without supporting running in Operational Mode 1. They will still interoperate correctly with routers that support both modes.",
      "zh-CHS": "路由器可以实现操作模式2，而不支持在操作模式1下运行。它们仍然可以与支持这两种模式的路由器进行正确的互操作。"
    },
    {
      "indent": 0,
      "text": "1.4. Overview",
      "section_title": true,
      "zh-CHS": "1.4. 概述"
    },
    {
      "indent": 3,
      "text": "Using Additional system-ids assigned by the administrator, the Originating System can advertise the excess link-state information in extended LSPs under these Additional system-ids. It would do so as if other routers, or \"Virtual Systems\", were advertising this information. These extended LSPs will also have the specified limit on their LSP fragments; however, the Originating System may generate extended LSPs under numerous Virtual Systems.",
      "zh-CHS": "使用管理员分配的附加系统ID，发起系统可以在这些附加系统ID下的扩展LSP中公布多余链路状态信息。这样做就好像其他路由器或“虚拟系统”在宣传这些信息一样。这些扩展LSP也将对其LSP片段具有指定的限制；然而，发起系统可以在许多虚拟系统下生成扩展lsp。"
    },
    {
      "indent": 3,
      "text": "For Operation Mode 1, 0-cost adjacencies are advertised from the Originating System to its Virtual System(s). No adjacencies (other than back to the Originating System) are advertised in the extended LSPs. As a consequence, the Virtual Systems are 'stub', meaning they can only be reached through their Originating System. Therefore, older implementations do not need modifications in order to correctly process these extended LSPs.",
      "zh-CHS": "对于操作模式1，从原始系统向其虚拟系统播发0成本邻接。在扩展LSP中不公布任何邻接（除了回发端系统之外）。因此，虚拟系统是“存根”，这意味着只能通过其原始系统访问它们。因此，为了正确处理这些扩展的LSP，旧的实现不需要修改。"
    },
    {
      "indent": 3,
      "text": "For both modes, each LSP (set) created by a node will contain in its fragment-0 a new TLV (IS Alias ID TLV) that contains the Normal system-id and PN Number of the Original LSP created by the router. Extension-capable ISs can then use this information and store the original and extended LSPs as one logical LSP.",
      "zh-CHS": "对于这两种模式，节点创建的每个LSP（集合）将在其片段-0中包含一个新的TLV（别名ID TLV），该TLV包含路由器创建的原始LSP的正常系统ID和PN号。支持扩展的ISs随后可以使用此信息并将原始LSP和扩展LSP存储为一个逻辑LSP。"
    },
    {
      "indent": 3,
      "text": "The only sections that deal only with Mode 1 additions are 3.2, 3.2.1, and 3.2.2. All other sections relate to both modes.",
      "zh-CHS": "仅涉及模式1添加的章节有3.2、3.2.1和3.2.2。所有其他部分均与这两种模式相关。"
    },
    {
      "indent": 0,
      "text": "2. IS Alias ID TLV (IS-A)",
      "section_title": true,
      "zh-CHS": "2. IS别名ID TLV（IS-A）"
    },
    {
      "indent": 3,
      "text": "The proposed IS-A TLV allows extension-capable ISs to recognize all LSPs of an Originating System, and combine the original and extended LSPs for the purpose of SPF computation. It identifies the Normal system-id of the Originating System.",
      "zh-CHS": "建议的IS-A TLV允许具有扩展能力的ISs识别始发系统的所有LSP，并结合原始LSP和扩展LSP进行SPF计算。它标识发起系统的正常系统id。"
    },
    {
      "indent": 3,
      "text": "The proposed IS Alias ID TLV is type 24, and its format is as follows:",
      "zh-CHS": "建议的IS别名ID TLV类型为24，其格式如下："
    },
    {
      "indent": 3,
      "text": "x CODE - 24.",
      "zh-CHS": "x代码-24。"
    },
    {
      "indent": 3,
      "text": "x LENGTH - total length of the value field.",
      "zh-CHS": "x长度-值字段的总长度。"
    },
    {
      "indent": 3,
      "text": "x VALUE -",
      "zh-CHS": "x值-"
    },
    {
      "indent": 6,
      "text": "                      No. of Octets\n+-------------------+\n| Normal system-id  |      6\n+-------------------+\n| Pseudonode number |      1\n+-------------------+\n| Sub-TLVs length   |      1\n+-------------------+\n|                   |     0-247\n: Sub-TLVs          :\n:                   :\n|                   |\n+-------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Normal system-id The Normal system-id of the LSP set, as described in section 1.2 of this document.",
      "zh-CHS": "正常系统id——LSP组的正常系统id，如本文件第1.2节所述。"
    },
    {
      "indent": 3,
      "text": "Pseudonode number The Pseudonode number of the LSP set. LSPs with the same Normal system-id and Pseudonode number are considered in SPF as one logical LSP, as described in section 5 of this document.",
      "zh-CHS": "伪节点号LSP集的伪节点号。具有相同正常系统id和伪节点号的LSP在SPF中被视为一个逻辑LSP，如本文档第5节所述。"
    },
    {
      "indent": 3,
      "text": "Sub-TLVs length Total length of all sub-TLVs.",
      "zh-CHS": "子TLV长度所有子TLV的总长度。"
    },
    {
      "indent": 3,
      "text": "Sub-TLVs A series of tuples with the following format:",
      "zh-CHS": "子TLV一系列元组，格式如下："
    },
    {
      "indent": 3,
      "text": "                      No. of Octets\n+-------------------+\n| Sub-type          |      1\n+-------------------+\n| Length            |      1\n+-------------------+\n|                   |     0-245\n: Value             :\n:                   :\n|                   |\n+-------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Sub-type Type of the sub-TLV",
      "zh-CHS": "子TLV的子类型"
    },
    {
      "indent": 3,
      "text": "Length Total length of the value field",
      "zh-CHS": "长度值字段的总长度"
    },
    {
      "indent": 3,
      "text": "Value Type-specific TLV payload.",
      "zh-CHS": "值类型特定的TLV有效载荷。"
    },
    {
      "indent": 3,
      "text": "For an explanation on sub-TLV handling, see [ISIS-TE].",
      "zh-CHS": "有关子TLV处理的说明，请参阅[ISIS-TE]。"
    },
    {
      "indent": 3,
      "text": "Without sub-TLVs, this structure consumes 8 octets per LSP set. This TLV MUST be included in fragment 0 of every LSP set belonging to an Originating System running in either Mode 1 or Mode 2. Currently, there are no sub-TLVs defined.",
      "zh-CHS": "如果没有子TLV，此结构每个LSP集消耗8个八位字节。该TLV必须包含在属于以模式1或模式2运行的原始系统的每个LSP集的片段0中。目前，没有定义子TLV。"
    },
    {
      "indent": 3,
      "text": "For a complete list of used IS-IS TLV numbers, see [ISIS-CODES].",
      "zh-CHS": "有关所用IS-IS TLV编号的完整列表，请参阅[ISIS-CODES]。"
    },
    {
      "indent": 0,
      "text": "3. Generating LSPs",
      "section_title": true,
      "zh-CHS": "3. 生成LSP"
    },
    {
      "indent": 0,
      "text": "3.1. Both Operation Modes",
      "section_title": true,
      "zh-CHS": "3.1. 两种操作模式"
    },
    {
      "indent": 3,
      "text": "Under both modes, the Originating System MUST include information binding the Original LSP and the Extended ones. It can do this since it is trivially an extension-capable IS. This is to ensure other extension-capable routers correctly process the extra information in their SPF calculation. This binding is advertised via a new IS Alias ID TLV, which is advertised in all fragment 0 of Original and Extended LSPs.",
      "zh-CHS": "在这两种模式下，始发系统必须包含绑定原始LSP和扩展LSP的信息。它可以做到这一点，因为它是一个微不足道的扩展功能。这是为了确保其他具有扩展能力的路由器正确处理其SPF计算中的额外信息。此绑定通过新的is别名ID TLV播发，该ID在原始LSP和扩展LSP的所有片段0中播发。"
    },
    {
      "indent": 3,
      "text": "+---------------------------------------------+\n|  Originating System                         |\n|  system-id   = S                            |\n|  is-alias-id = S                            |\n+---------------------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "+-------------------+     +-------------------+\n|  Virtual System   |     |  Virtual System   |\n|  system-id   = S' |     |  system-id   = S''|\n|  is-alias-id = S  |     |  is-alias-id = S  |\n+-------------------+     +-------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Figure 1. Advertising binding between all of a system's LSPs (both modes). S' and S'' are configured as Additional system-ids.",
      "zh-CHS": "图1。系统所有LSP之间的广告绑定（两种模式）。S'和S''配置为附加系统ID。"
    },
    {
      "indent": 3,
      "text": "When new extended LSP fragments are generated, these fragments should be generated as specified in ISO/IEC 10589 [ISIS-ISO]. Furthermore, a system SHOULD treat its extended LSPs the same as it treats its original LSPs, with the exceptions noted in the following sections. Specifically, creating, flooding, renewing, purging and all other operations are similar for both Original and Extended LSPs, unless stated otherwise. The Extended LSPs will use one of the Additional system-ids configured for the router, in their LSP ID.",
      "zh-CHS": "生成新的扩展LSP片段时，应按照ISO/IEC 10589[ISIS-ISO]的规定生成这些片段。此外，系统应将其扩展LSP视为与原始LSP相同的处理方式，但以下各节中指出的例外情况除外。特别是，原始LSP和扩展LSP的创建、泛洪、更新、清除和所有其他操作都类似，除非另有说明。扩展LSP将在其LSP ID中使用为路由器配置的附加系统ID之一。"
    },
    {
      "indent": 3,
      "text": "Extended LSPs fragment zero should be regarded in the same special manner as specified in ISO/IEC 10589 for LSPs with number zero, and should include the same type of extra information as specified in ISO/IEC 10589 and RFC 1195 [ISIS-IP]. So, for example, when a system reissues its LSP fragment zero due to an area address change, it should reissue all extended LSPs fragment zero as well.",
      "zh-CHS": "扩展LSP片段零应以ISO/IEC 10589中规定的与数字为零的LSP相同的特殊方式看待，并应包括ISO/IEC 10589和RFC 1195[ISIS-IP]中规定的相同类型的额外信息。因此，例如，当系统由于区域地址更改而重新发出其LSP片段零时，它也应该重新发出所有扩展LSP片段零。"
    },
    {
      "indent": 3,
      "text": "An extended LSP fragment zero MUST be generated for every extended LSP set, to allow a router's SPF calculation to consider those fragments in that set. See section 5 for details.",
      "zh-CHS": "必须为每个扩展LSP集生成扩展LSP片段零，以允许路由器的SPF计算考虑该集合中的那些片段。详见第5节。"
    },
    {
      "indent": 0,
      "text": "3.1.1. The Attached Bits",
      "section_title": true,
      "zh-CHS": "3.1.1. 附加位"
    },
    {
      "indent": 3,
      "text": "The Attached (ATT) bits SHOULD be set to zero for all four metric types, on all Extended LSPs. This is due to the following: if a Virtual System is reachable, so is its Originating System. It is preferable, then, that an L1 IS chooses the Originating System and not the Virtual System as its nearest L2 exit point, as connectivity to the Virtual System has a higher probability of being lost (as a result of the extended LSP no longer being advertised). This could cause unnecessary computations on some implementations.",
      "zh-CHS": "在所有扩展LSP上，所有四种度量类型的附加（ATT）位都应设置为零。这是由于以下原因造成的：如果虚拟系统是可访问的，那么其原始系统也是可访问的。因此，优选的是，L1选择发起系统而不是虚拟系统作为其最近的L2出口点，因为到虚拟系统的连接具有更高的丢失概率（由于扩展LSP不再被广告）。这可能会导致在某些实现上进行不必要的计算。"
    },
    {
      "indent": 0,
      "text": "3.1.2. The Partition Repair Bit",
      "section_title": true,
      "zh-CHS": "3.1.2. 分区修复位"
    },
    {
      "indent": 3,
      "text": "The Partition Repair (P) bit SHOULD be set to zero on all extended LSPs. This is for the same reasons as for the Attached bits.",
      "zh-CHS": "所有扩展LSP上的分区修复（P）位应设置为零。这与附加位的原因相同。"
    },
    {
      "indent": 0,
      "text": "3.1.3. ES Neighbors TLV",
      "section_title": true,
      "zh-CHS": "3.1.3. ES邻接TLV"
    },
    {
      "indent": 3,
      "text": "ISO/IEC 10589 [ISIS-ISO] section 7.3.7 specifies inserting an ES Neighbor TLV in L1 LSPs, with the system ID of the router. RFC 1195 [ISIS-IP] relieves IP-only routers of this requirement. However, for routers that do insert this ESN TLV in L1 LSPs (whether IP-only or OSI-capable), then in an extended LSP, the ESN TLV should include the relevant Additional system-id. Furthermore, OSI-capable routers should accept packets destined for this Additional system-id.",
      "zh-CHS": "ISO/IEC 10589[ISIS-ISO]第7.3.7节规定在L1 LSP中插入ES邻居TLV，并带有路由器的系统ID。RFC1195[ISIS-IP]免除了仅限IP的路由器的这一要求。但是，对于在L1 LSP中插入此ESN TLV的路由器（无论是仅IP还是支持OSI），则在扩展LSP中，ESN TLV应包括相关的附加系统id。此外，支持OSI的路由器应接受发送到此附加系统id的数据包。"
    },
    {
      "indent": 0,
      "text": "3.1.4. Overload Bit",
      "section_title": true,
      "zh-CHS": "3.1.4. 过载位"
    },
    {
      "indent": 3,
      "text": "The overload bit should be set consistently across all LSPs, original and extended, belonging to an Originating System, and should reflect the Originating System's overload state.",
      "zh-CHS": "过载位应在所有LSP（原始LSP和扩展LSP，属于始发系统）上一致设置，并应反映始发系统的过载状态。"
    },
    {
      "indent": 0,
      "text": "3.1.5. Other Fields and TLVs",
      "section_title": true,
      "zh-CHS": "3.1.5. 其他领域和TLV"
    },
    {
      "indent": 3,
      "text": "Other fields and TLVs not mentioned above remain the same, both for original and extended LSPs.",
      "zh-CHS": "对于原始LSP和扩展LSP，上述未提及的其他字段和TLV保持不变。"
    },
    {
      "indent": 0,
      "text": "3.2. Operation Mode 1 Additions",
      "section_title": true,
      "zh-CHS": "3.2. 操作模式1添加"
    },
    {
      "indent": 3,
      "text": "The following additions apply only to routers generating LSPs in Mode 1. Routers, which are configured to operate in Operation Mode 2, SHOULD NOT apply these additions to their advertisements.",
      "zh-CHS": "以下添加仅适用于在模式1下生成LSP的路由器。配置为在操作模式2下运行的路由器不应将这些添加应用于其播发。"
    },
    {
      "indent": 3,
      "text": "Under Operation Mode 1, adjacencies from the Originating System to its Virtual Systems are advertised using the standard neighbor TLVs. The metric for these connections MUST be zero, since the cost of reaching a Virtual System is the same as the cost of reaching its Originating System.",
      "zh-CHS": "在操作模式1下，使用标准邻居TLV公布从发起系统到其虚拟系统的邻接。这些连接的度量必须为零，因为到达虚拟系统的成本与到达其原始系统的成本相同。"
    },
    {
      "indent": 3,
      "text": "To older implementations, Virtual Systems would appear reachable only through their Originating System, hence loss of connectivity to the Originating System means loss of connectivity to all of its information, including that advertised in its extended LSPs. Furthermore, the cost of reaching information advertised in non-extended LSPs is the same as the cost of reaching information advertised in the new extended LSPs, with an additional hop.",
      "zh-CHS": "对于较旧的实现，虚拟系统似乎只能通过其原始系统访问，因此与原始系统的连接丢失意味着其所有信息的连接丢失，包括其扩展LSP中公布的信息。此外，到达在非扩展lsp中广告的信息的成本与到达在新的扩展lsp中广告的信息的成本相同，具有额外的跳数。"
    },
    {
      "indent": 3,
      "text": "+---------------------------------------------+\n|         Originating System                  |\n|         system-id = S                       |\n|         is-alias-id = S                     |\n+---------------------------------------------+\n       |    /\\                    |    /\\\ncost=0 |    |cost=max-1    cost=0 |    |cost=max-1\n       |    |                     |    |\n       \\/   |                     \\/   |\n+-------------------+     +-------------------+\n|  Virtual System   |     |  Virtual System   |\n|  system-id   = S' |     |  system-id   = S''|\n|  is-alias-id = S  |     |  is-alias-id = S  |\n+-------------------+     +-------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Figure 2. Advertising connections to Virtual Systems under Operation Mode 1. S' and S'' are configured as Additional system-ids.",
      "zh-CHS": "图2。在操作模式1下公布到虚拟系统的连接。S'和S''配置为附加系统ID。"
    },
    {
      "indent": 3,
      "text": "Under Operation Mode 1, only \"leaf\" information, i.e., information that serves only as leaves in a shortest path tree, can be advertised in extended LSPs.",
      "zh-CHS": "在操作模式1下，只有“叶”信息，即仅作为最短路径树中的叶的信息，可以在扩展LSP中通告。"
    },
    {
      "indent": 3,
      "text": "When an Extended LSP belonging to Additional system-id S' is first created, the Original LSP MUST specify S' as a neighbor, with metric set to zero. This is in order to consider the cost of reaching the Virtual System S' the same as the cost of reaching its Originating System. Furthermore, the Extended LSP MUST specify the Normal system-id as a neighbor. The metric SHOULD be set to MaxLinkMetric - 1 (this is only for uniformity purpose, any metric greater than zero is acceptable). This in order to satisfy the two-way connectivity check on other routers. Where relevant, this adjacency SHOULD be considered as point-to-point.",
      "zh-CHS": "当第一次创建属于附加系统id S'的扩展LSP时，原始LSP必须将S'指定为邻居，并将度量设置为零。这是为了考虑到达虚拟系统S的成本与到达其始发系统的成本相同。此外，扩展LSP必须将正常系统id指定为邻居。度量值应设置为MaxLinkMetric-1（这仅用于一致性目的，任何大于零的度量值都是可以接受的）。这是为了满足其他路由器上的双向连接检查。在相关情况下，应将此邻接视为点对点。"
    },
    {
      "indent": 3,
      "text": "Note, that the restriction specified in ISO/IEC 10589 section 7.2.5 holds: if an LSP Number zero of the Originating System is not present, none of that system's neighbor entries would be processed during SPF, hence none of its extended LSPs would be processed as well.",
      "zh-CHS": "注意，ISO/IEC 10589第7.2.5节中规定的限制适用于：如果原始系统的LSP编号为零，则在SPF期间不会处理该系统的任何相邻条目，因此也不会处理其扩展LSP。"
    },
    {
      "indent": 0,
      "text": "3.2.1. IS Neighbors TLV (Mode 1 Only)",
      "section_title": true,
      "zh-CHS": "3.2.1. IS TLV（仅限模式1）"
    },
    {
      "indent": 3,
      "text": "An Extended LSP must specify only the Originating System as a neighbor, with the metric set to (MaxLinkMetric - 1). Where relevant, this adjacency should be considered as point-to-point. Other neighbors MUST NOT be specified in an Extended LSP, because",
      "zh-CHS": "扩展LSP必须仅将发起系统指定为邻居，并将度量设置为（MaxLinkMetric-1）。在相关情况下，应将此邻接视为点对点。不能在扩展LSP中指定其他邻居，因为"
    },
    {
      "indent": 3,
      "text": "those other neighbors would only specify the Originating System and not the Virtual System, and hence would not satisfy the bi-directionality check in the SPF computation.",
      "zh-CHS": "这些其他邻居将只指定原始系统而不是虚拟系统，因此不会满足SPF计算中的双向性检查。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Originating System in the Overload State in (Mode 1 Only)",
      "section_title": true,
      "zh-CHS": "3.2.2. 处于过载状态的始发系统（仅模式1）"
    },
    {
      "indent": 3,
      "text": "If the Originating System is in the overload state, information in the extended LSPs will not be processed by other routers in their SPF computation. This is because in Mode 1, extended LSPs are reachable only through adjacencies from the Original LSP. If this LSP has set its OL bit, adjacencies will not be processed in the SPF computation.",
      "zh-CHS": "如果始发系统处于过载状态，则扩展LSP中的信息将不会由其他路由器在其SPF计算中处理。这是因为在模式1中，扩展LSP只能通过原始LSP的邻接来访问。如果此LSP已设置其OL位，则在SPF计算中不会处理邻接。"
    },
    {
      "indent": 3,
      "text": "This side effect should be taken into consideration when operating in Mode 1.",
      "zh-CHS": "在模式1下运行时，应考虑此副作用。"
    },
    {
      "indent": 0,
      "text": "4. Purging Extended LSP Fragments",
      "section_title": true,
      "zh-CHS": "4. 清除扩展LSP片段"
    },
    {
      "indent": 3,
      "text": "ISO/IEC 10589 [ISIS-ISO] section 7.3.4.4 note 25 suggests that an implementation keeps the number of LSP fragments within a certain limit based on the optimal (minimal) number of fragments needed. Section 7.3.4.6 also recommends that an IS purge its empty LSPs to conserve resources. These recommendations hold for the extended LSP fragments as well. However, an extended LSP fragment zero should not be purged until all of the fragments in its set (i.e., belonging to a particular Additional system-id), are empty as well. This is to ensure implementations consider the fragments in their SPF computations, as specified in section 7.2.5.",
      "zh-CHS": "ISO/IEC 10589[ISIS-ISO]第7.3.4.4节注25建议，实施方案根据所需的最佳（最小）碎片数量，将LSP碎片数量保持在一定的限制范围内。第7.3.4.6节还建议IS清除其空LSP以节省资源。这些建议也适用于扩展LSP片段。但是，在扩展LSP片段零集中的所有片段（即，属于特定的附加系统id）也为空之前，不应清除扩展LSP片段零。这是为了确保实现考虑SPF计算中的片段，如7.7.5节中所指定的。"
    },
    {
      "indent": 3,
      "text": "In Operational Mode 1, when all the extended LSP fragments of a particular Additional system-id S' have been purged, the Originating System SHOULD remove the neighbor information to S' from its original LSPs.",
      "zh-CHS": "在操作模式1中，当清除了特定附加系统id S'的所有扩展LSP片段后，发起系统应从其原始LSP中删除到S'的邻居信息。"
    },
    {
      "indent": 0,
      "text": "5. Modifications to LSP handling in SPF",
      "section_title": true,
      "zh-CHS": "5. SPF中LSP处理的修改"
    },
    {
      "indent": 3,
      "text": "This section describes modifications to the way extension-capable ISs handle LSPs for the SPF computation.",
      "zh-CHS": "本节描述了对支持扩展的ISs处理用于SPF计算的LSP的方式的修改。"
    },
    {
      "indent": 3,
      "text": "When considering LSPs of an extension-capable IS (identified by the inclusion of the IS Alias ID TLV), the original and extended LSPs are combined to form one large logical LSP. If the LSP belongs to an IS running Operational Mode 1, there might be adjacencies between the original and extended LSPs. These are trivially ignored (since when processing them the large logical LSP is already on PATHS), and does not complicate the SPF. Furthermore, this check should already be implemented (this scenario could occur on error, without this extension).",
      "zh-CHS": "当考虑具有扩展能力的IS的LSP（通过包含IS别名ID TLV来标识）时，原始LSP和扩展LSP组合起来形成一个大型逻辑LSP。如果LSP属于正在运行的操作模式1，则原始LSP和扩展LSP之间可能存在邻接。这些都被忽略了（因为在处理它们时，大型逻辑LSP已经在路径上），并且不会使SPF复杂化。此外，应该已经实现了此检查（如果没有此扩展，此场景可能会出现错误）。"
    },
    {
      "indent": 3,
      "text": "If LSP fragment 0 of the Original LSP set is missing or its RemainingLifetime is zero, all of the LSPs generated by that Originating System (Extended as well) MUST NOT be considered in the SPF. That is, the large logical LSP is not considered in the SPF. The original LSP fragments are identified when the is-alias-id value is the same as the system-id of those LSPs. If an LSP fragment 0 of an extended LSP set is missing or its RemainingLifetime is zero, only that LSP set MUST NOT be considered in the SPF. These rules are present to ensure consistent SPF results on Mode 1 and Mode 2 LSPs.",
      "zh-CHS": "如果原始LSP集的LSP片段0缺失或其剩余寿命为零，则SPF中不得考虑由该原始系统生成的所有LSP（也可扩展）。也就是说，SPF中不考虑大型逻辑LSP。当is别名id值与这些LSP的系统id相同时，将标识原始LSP片段。如果扩展LSP集的LSP片段0缺失或其剩余生存期为零，则SPF中只能考虑该LSP集。这些规则用于确保模式1和模式2 LSP上的SPF结果一致。"
    },
    {
      "indent": 3,
      "text": "Note, that the above behavior is consistent with how previous implementations will interpret Mode 1 LSPs.",
      "zh-CHS": "注意，上述行为与以前的实现如何解释模式1 LSP是一致的。"
    },
    {
      "indent": 0,
      "text": "6. Forming Adjacencies",
      "section_title": true,
      "zh-CHS": "6. 形成邻接"
    },
    {
      "indent": 3,
      "text": "It should be noted, that an IS MUST use the system-id of the LSP that will include a neighbor, when forming an adjacency with that neighbor. That is, if a neighbor is to be included in extended LSP S', then S' should be used as the system-id in IS Hellos [3] and IS-IS Hellos when forming an adjacency with that neighbor. This is regardless of the Operational Mode. Of course, in Mode 1 this means that only the Normal system-id will be used when sending hellos.",
      "zh-CHS": "应当注意，当与邻居形成邻接时，IS必须使用将包括邻居的LSP的系统id。也就是说，如果要在扩展LSP S'中包括一个邻居，则在与该邻居形成邻接关系时，应将S'用作is Hellos[3]和is-is Hellos中的系统id。这与操作模式无关。当然，在模式1中，这意味着发送Hello时只使用正常的系统id。"
    },
    {
      "indent": 0,
      "text": "7. Interoperating between extension-capable and non-extension-capable ISs.",
      "zh-CHS": "7. 支持扩展和不支持扩展的ISs之间的互操作。"
    },
    {
      "indent": 3,
      "text": "In order to correctly advertise link-state information under Operation Mode 2, all ISs in an area must be extension-capable. However, it is possible to not upgrade every router in the network, if the extended information is not routing information, but rather data that is of use to only a subset of routers (e.g., optical switches using IS-IS could carry optical-specific information in extended LSPs)",
      "zh-CHS": "为了在操作模式2下正确公布链路状态信息，一个区域内的所有ISs必须能够扩展。然而，如果扩展信息不是路由信息，而是仅用于路由器子集的数据（例如，使用is-is的光交换机可以在扩展LSP中携带光学特定信息），则可以不升级网络中的每个路由器"
    },
    {
      "indent": 3,
      "text": "If a live network contains routers exceeding the 256 fragment limit, and for some reason the upgrade has to be done incrementally, it is possible to transition the network, using the following steps:",
      "zh-CHS": "如果实时网络包含超过256个碎片限制的路由器，并且出于某种原因必须以增量方式进行升级，则可以使用以下步骤转换网络："
    },
    {
      "indent": 3,
      "text": "- Upgrade the routers, one-by-one, to run this extension in Operation Mode 1. The other non-extension-capable routers will interoperate correctly.",
      "zh-CHS": "- 逐个升级路由器，以在操作模式1下运行此扩展。其他不支持扩展的路由器将正确互操作。"
    },
    {
      "indent": 3,
      "text": "- When all routers are extension-capable, configure them one-by-one to run in Operation Mode 2. All extension-capable routers interoperate correctly, regardless of what mode they are run in.",
      "zh-CHS": "- 当所有路由器都支持扩展时，逐个配置它们以运行模式2运行。所有支持扩展的路由器都能正确地进行互操作，无论它们运行在何种模式下。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD support a configuration parameter controlling the LSP origination behavior. The default value of this parameter SHOULD correspond to the behavior described in [ISIS-ISO], i.e., neither of the two modes described in this document should be enabled without explicit configuration when the router software is upgraded with this extension.",
      "zh-CHS": "实现应支持控制LSP发起行为的配置参数。此参数的默认值应与[ISIS-ISO]中描述的行为相对应，即，当路由器软件使用此扩展升级时，如果没有明确的配置，则不应启用本文档中描述的两种模式。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document raises no new security issues for IS-IS.",
      "zh-CHS": "本文档没有为IS-IS提出新的安全问题。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "zh-CHS": "9. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Tony Li and Radia Perlman for helpful comments and suggestions on the subject.",
      "zh-CHS": "作者要感谢Tony Li和Radia Perlman对该主题的有益评论和建议。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISIS-ISO] \"Intermediate System to Intermediate System Intra-Domain Routeing Exchange Protocol for use in Conjunction with the Protocol for Providing the Connectionless-mode Network Service (ISO 8473)\", ISO/IEC 10589:2002, Second Edition.",
      "zh-CHS": "[ISIS-ISO]“与提供无连接模式网络服务的协议一起使用的中间系统到中间系统域内路由交换协议（ISO 8473）”，ISO/IEC 10589:2002，第二版。"
    },
    {
      "indent": 3,
      "text": "[ISIS-IP] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990.",
      "zh-CHS": "[ISIS-IP]Callon，R.，“OSI IS-IS在TCP/IP和双环境中的路由使用”，RFC 1195，1990年12月。"
    },
    {
      "indent": 3,
      "text": "[ISIS-TE] Smit, H. and T. Li, \"Intermediate System to Intermediate System (IS-IS) Extensions for Traffic Engineering (TE)\", RFC 3784, May 2004.",
      "zh-CHS": "[ISIS-TE]Smit，H.和T.Li，“交通工程（TE）的中间系统到中间系统（IS-IS）扩展”，RFC 3784，2004年5月。"
    },
    {
      "indent": 3,
      "text": "[BCP14] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[BCP14]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[DOMAIN-WIDE] Li, T., Przygienda, T. and H. Smit, \"Domain-wide Prefix Distribution with Two-Level IS-IS\", RFC 2966, October 2000.",
      "zh-CHS": "[DOMAIN-WIDE]Li，T.，Przygienda，T.和H.Smit，“具有两级IS-IS的域范围前缀分布”，RFC 2966，2000年10月。"
    },
    {
      "indent": 3,
      "text": "[ISIS-CODES] Przygienda, T., \"Reserved Type, Length and Value (TLV) Codepoints in Intermediate System to Intermediate System\", RFC 3359, August 2002.",
      "zh-CHS": "[ISIS-CODES]Przygienda，T，“中间系统到中间系统中的保留类型、长度和值（TLV）码点”，RFC 3359，2002年8月。"
    },
    {
      "indent": 0,
      "text": "11. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "11. 作者地址"
    },
    {
      "indent": 3,
      "text": "Amir Hermelin Montilio Inc. 1 Maskit St. POB 12253 Herzelia, 46733 ISRAEL",
      "zh-CHS": "Amir Hermelin Montilio Inc.1 Maskit St.POB 12253 Herzelia，以色列46733"
    },
    {
      "indent": 3,
      "text": "Phone: +972 9 9511944\nFax: +972 9 9542430\nEMail: amir@montilio.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems, Inc. Via Del Serafico 200 00142 Roma Italy",
      "zh-CHS": "Stefano Previdi Cisco Systems，Inc.通过意大利罗马赛拉菲科200 00142"
    },
    {
      "indent": 3,
      "text": "Phone: +39 06 5164 4491\nEMail: sprevidi@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mike Shand Cisco Systems 250, Longwater Avenue, Green Park, Reading, RG2 6GB, UK",
      "zh-CHS": "Mike Shand Cisco Systems 250，英国雷丁市格林公园朗沃特大道，RG2 6GB"
    },
    {
      "indent": 3,
      "text": "Phone: +44 20 8824 8690\nEMail: mshand@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "12. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "12. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}