{
  "title": {
    "text": "RFC 3934:  Updates to RFC 2418 Regarding the Management of IETF Mailing Lists ",
    "zh-CHS": "RFC 3934"
  },
  "number": 3934,
  "created_at": "2021-11-18 13:41:05.328021+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       M. Wasserman\nRequest for Comments: 3934                                    ThingMagic\nUpdates: 2418                                               October 2004\nBCP: 94\nCategory: Best Current Practice",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Updates to RFC 2418 Regarding the Management of IETF Mailing Lists",
      "zh-CHS": "关于IETF邮件列表管理的RFC 2418更新"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document is an update to RFC 2418 that gives WG chairs explicit responsibility for managing WG mailing lists. In particular, it gives WG chairs the authority to temporarily suspend the mailing list posting privileges of disruptive individuals.",
      "zh-CHS": "本文件是对RFC 2418的更新，赋予工作组主席管理工作组邮件列表的明确责任。特别是，工作组主席有权暂时暂停破坏性个人的邮件列表发布特权。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Specific Changes to RFC 2418 . . . . . . . . . . . . . . . . .  2\n3.  Security Considerations  . . . . . . . . . . . . . . . . . . .  3\n4.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  3\n5.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  3\n    5.1.  Normative References . . . . . . . . . . . . . . . . . .  3\n    5.2.  Informative References . . . . . . . . . . . . . . . . .  3\n6.  Author's Address . . . . . . . . . . . . . . . . . . . . . . .  4\n7.  Full Copyright Statement . . . . . . . . . . . . . . . . . . .  5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As written, RFC 2418 [RFC2418] gives WG chairs more authority to manage face-to-face discussions than to manage mailing list discussions. In face-to-face meetings, the WG chair has the authority \"to refuse to grant the floor to any individual who is unprepared or otherwise covering inappropriate material, or who, in the opinion of the Chair, is disrupting the WG process.\" However, RFC 2418 does not give the WG Chair the authority to suspend the mailing list posting privileges of an individual who is similarly disrupting WG mailing list discussions. RFC 2418 explicitly requires full IESG approval for this action.",
      "zh-CHS": "如前所述，RFC 2418[RFC2418]赋予工作组主席管理面对面的讨论比管理邮件列表讨论更大的权限。在面对面会议中，工作组主席有权“拒绝向任何未做好准备或以其他方式涵盖不适当材料，或主席认为正在干扰工作组进程的个人发言。”，RFC 2418并未授权工作组主席暂停类似干扰工作组邮件列表讨论的个人的邮件列表发布特权。RFC 2418明确要求IESG完全批准该行动。"
    },
    {
      "indent": 3,
      "text": "This document is an update to RFC 2418, section 3.2. It gives WG chairs the authority to temporarily suspend the posting privileges of disruptive individuals without IESG approval.",
      "zh-CHS": "本文件是对RFC 2418第3.2节的更新。它授权工作组主席在未经IESG批准的情况下，暂停破坏性个人的发布特权。"
    },
    {
      "indent": 0,
      "text": "2. Specific Changes to RFC 2418",
      "section_title": true,
      "zh-CHS": "2. RFC 2418的具体变更"
    },
    {
      "indent": 3,
      "text": "The following paragraphs supersede the last paragraph of RFC 2418, section 3.2:",
      "zh-CHS": "以下段落取代RFC 2418第3.2节的最后一段："
    },
    {
      "indent": 3,
      "text": "As in face-to-face sessions, occasionally one or more individuals may engage in behavior on a mailing list that, in the opinion of the WG chair, is disruptive to the WG process. Unless the disruptive behavior is severe enough that it must be stopped immediately, the WG chair should attempt to discourage the disruptive behavior by communicating directly with the offending individual. If the behavior persists, the WG chair should send at least one public warning on the WG mailing list. As a last resort and typically after one or more explicit warnings and consultation with the responsible Area Director, the WG chair may suspend the mailing list posting privileges of the disruptive individual for a period of not more than 30 days. Even while posting privileges are suspended, the individual must not be prevented from receiving messages posted to the list. Like all other WG chair decisions, any suspension of posting privileges is subject to appeal, as described in RFC 2026 [RFC2026].",
      "zh-CHS": "与面对面会议一样，有时一个或多个个人可能会参与工作组主席认为会破坏工作组流程的邮件列表行为。除非破坏性行为严重到必须立即停止，否则工作组主席应通过直接与冒犯者沟通来阻止破坏性行为。如果该行为持续存在，工作组主席应在工作组邮件列表上至少发送一条公开警告。作为最后手段，通常在一次或多次明确警告并与负责区域总监协商后，工作组主席可暂停破坏性个人的邮件列表张贴特权，为期不超过30天。即使在暂停发布权限的情况下，也不得阻止个人接收发布到列表中的消息。如RFC 2026[RFC2026]所述，与工作组主席的所有其他决定一样，任何暂停发布特权的行为都可能受到上诉。"
    },
    {
      "indent": 3,
      "text": "This mechanism is intended to permit a WG chair to suspend posting privileges of a disruptive individual for a short period of time. This mechanism does not permit WG chairs to suspend an individual's posting privileges for a period longer than 30 days regardless of the type or severity of the disruptive incident. However, further disruptive behavior by the same individual will be considered separately and may result in further warnings or suspensions. Other methods of mailing list control, including longer suspensions, must",
      "zh-CHS": "该机制旨在允许工作组主席在短时间内暂停破坏性个人的张贴特权。该机制不允许工作组主席暂停个人的张贴特权超过30天，无论破坏性事件的类型或严重程度如何。但是，同一个人的进一步破坏行为将被单独考虑，并可能导致进一步的警告或停职。必须使用其他邮件列表控制方法，包括更长的暂停时间"
    },
    {
      "indent": 3,
      "text": "be carried out in accordance with other IETF-approved procedures. See BCP 83 [RFC3683] for one set of procedures already defined and accepted by the community.",
      "zh-CHS": "应按照IETF批准的其他程序进行。参见BCP 83[RFC3683]，了解社区已经定义和接受的一套程序。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document describes a modification to the IETF process for managing mailing list discussions. It has no security considerations.",
      "zh-CHS": "本文档描述了IETF过程的修改，用于管理邮件列表讨论。它没有安全考虑。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "zh-CHS": "4. 致谢"
    },
    {
      "indent": 3,
      "text": "This document reflects a discussion that was held on the MPOWR mailing list in December 2003 and January 2004. In particular, the following people contributed ideas that influenced this document: Harald Alvestrand, Dave Crocker, James Kempf, and John Klensin.",
      "zh-CHS": "本文件反映了2003年12月和2004年1月在MPOWR邮件列表上进行的讨论。特别是，以下人士提出了影响本文件的想法：哈拉尔·阿尔韦斯特朗（Harald Alvestrand）、戴夫·克罗克（Dave Crocker）、詹姆斯·肯普夫（James Kempf）和约翰·克莱辛（John Klesins）。"
    },
    {
      "indent": 3,
      "text": "This document was written with the xml2rfc tool described in RFC 2629 [RFC2629].",
      "zh-CHS": "本文档使用RFC 2629[RFC2629]中描述的xml2rfc工具编写。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "zh-CHS": "5.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2418] Bradner, S., \"IETF Working Group Guidelines and Procedures\", BCP 25, RFC 2418, September 1998.",
      "zh-CHS": "[RFC2418]Bradner，S.，“IETF工作组指南和程序”，BCP 25，RFC 2418，1998年9月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "zh-CHS": "5.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2629] Rose, M., \"Writing I-Ds and RFCs using XML\", RFC 2629, June 1999.",
      "zh-CHS": "[RFC2629]Rose，M.，“使用XML编写I-D和RFC”，RFC 26292999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3683] Rose, M., \"A Practice for Revoking Posting Rights to IETF Mailing Lists\", BCP 83, RFC 3683, March 2004.",
      "zh-CHS": "[RFC3683]Rose，M.，“撤销IETF邮件列表发布权的实践”，BCP 83，RFC 3683，2004年3月。"
    },
    {
      "indent": 0,
      "text": "6. Author's Address",
      "section_title": true,
      "zh-CHS": "6. 作者地址"
    },
    {
      "indent": 3,
      "text": "Margaret Wasserman ThingMagic One Broadway, 14th Floor Cambridge, MA 02142 USA",
      "zh-CHS": "Margaret Wasserman ThingMagic One百老汇，美国马萨诸塞州剑桥市14楼，邮编：02142"
    },
    {
      "indent": 3,
      "text": "Phone: +1 617 758 4177\nEMail: margaret@thingmagic.com\nURI:   http://www.thingmagic.com/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "7. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and at www.rfc-editor.org, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78和www.rfc-editor.org中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the ISOC's procedures with respect to rights in ISOC Documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关ISOC文件中权利的ISOC程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}