{
  "title": {
    "text": "RFC 3227:  Guidelines for Evidence Collection and Archiving ",
    "zh-CHS": "RFC 3227"
  },
  "number": 3227,
  "created_at": "2021-10-26 08:42:05.936104+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       D. Brezinski\nRequest for Comments: 3227                                      In-Q-Tel\nBCP: 55                                                      T. Killalea\nCategory: Best Current Practice                                neart.org\n                                                           February 2002",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Guidelines for Evidence Collection and Archiving",
      "zh-CHS": "证据收集和归档指南"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "A \"security incident\" as defined in the \"Internet Security Glossary\", RFC 2828, is a security-relevant system event in which the system's security policy is disobeyed or otherwise breached. The purpose of this document is to provide System Administrators with guidelines on the collection and archiving of evidence relevant to such a security incident.",
      "zh-CHS": "“互联网安全术语表”RFC 2828中定义的“安全事件”是指违反或违反系统安全策略的安全相关系统事件。本文档旨在为系统管理员提供有关收集和归档此类安全事件相关证据的指南。"
    },
    {
      "indent": 3,
      "text": "If evidence collection is done correctly, it is much more useful in apprehending the attacker, and stands a much greater chance of being admissible in the event of a prosecution.",
      "zh-CHS": "如果证据收集工作做得正确，那么在逮捕袭击者方面会更加有用，并且在起诉的情况下被接受的可能性也会大得多。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1 Introduction.................................................... 2\n  1.1 Conventions Used in this Document........................... 2\n2 Guiding Principles during Evidence Collection................... 3\n  2.1 Order of Volatility......................................... 4\n  2.2 Things to avoid............................................. 4\n  2.3 Privacy Considerations...................................... 5\n  2.4 Legal Considerations........................................ 5\n3 The Collection Procedure........................................ 6\n  3.1 Transparency................................................ 6\n  3.2 Collection Steps............................................ 6\n4 The Archiving Procedure......................................... 7\n  4.1 Chain of Custody............................................ 7\n  4.2 The Archive................................................. 7\n5 Tools you'll need............................................... 7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "6 References...................................................... 8\n7 Acknowledgements................................................ 8\n8 Security Considerations......................................... 8\n9 Authors' Addresses.............................................. 9\n10 Full Copyright Statement.......................................10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1 Introduction",
      "zh-CHS": "1导言"
    },
    {
      "indent": 3,
      "text": "A \"security incident\" as defined in [RFC2828] is a security-relevant system event in which the system's security policy is disobeyed or otherwise breached. The purpose of this document is to provide System Administrators with guidelines on the collection and archiving of evidence relevant to such a security incident. It's not our intention to insist that all System Administrators rigidly follow these guidelines every time they have a security incident. Rather, we want to provide guidance on what they should do if they elect to collect and protect information relating to an intrusion.",
      "zh-CHS": "[RFC2828]中定义的“安全事件”是指违反或违反系统安全策略的安全相关系统事件。本文档旨在为系统管理员提供有关收集和归档此类安全事件相关证据的指南。我们无意坚持所有系统管理员在每次发生安全事件时都严格遵守这些准则。相反，如果他们选择收集和保护与入侵相关的信息，我们希望为他们提供指导。"
    },
    {
      "indent": 3,
      "text": "Such collection represents a considerable effort on the part of the System Administrator. Great progress has been made in recent years to speed up the re-installation of the Operating System and to facilitate the reversion of a system to a 'known' state, thus making the 'easy option' even more attractive. Meanwhile little has been done to provide easy ways of archiving evidence (the difficult option). Further, increasing disk and memory capacities and the more widespread use of stealth and cover-your-tracks tactics by attackers have exacerbated the problem.",
      "zh-CHS": "这样的收集代表了系统管理员相当大的努力。近年来，在加快操作系统的重新安装和促进系统恢复到“已知”状态方面取得了巨大进展，从而使“简单选项”更具吸引力。与此同时，在提供简单的证据归档方法（困难的选择）方面几乎没有做什么。此外，磁盘和内存容量的增加以及攻击者更广泛地使用隐形和隐蔽战术加剧了这一问题。"
    },
    {
      "indent": 3,
      "text": "If evidence collection is done correctly, it is much more useful in apprehending the attacker, and stands a much greater chance of being admissible in the event of a prosecution.",
      "zh-CHS": "如果证据收集工作做得正确，那么在逮捕袭击者方面会更加有用，并且在起诉的情况下被接受的可能性也会大得多。"
    },
    {
      "indent": 3,
      "text": "You should use these guidelines as a basis for formulating your site's evidence collection procedures, and should incorporate your site's procedures into your Incident Handling documentation. The guidelines in this document may not be appropriate under all jurisdictions. Once you've formulated your site's evidence collection procedures, you should have law enforcement for your jurisdiction confirm that they're adequate.",
      "zh-CHS": "您应将这些指南作为制定现场证据收集程序的基础，并应将现场程序纳入事件处理文档中。本文件中的指南可能不适用于所有司法管辖区。一旦你制定了网站的证据收集程序，你应该让你所在司法管辖区的执法部门确认这些程序是足够的。"
    },
    {
      "indent": 0,
      "text": "1.1 Conventions Used in this Document",
      "section_title": true,
      "zh-CHS": "1.1 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"REQUIRED\", \"MUST\", \"MUST NOT\", \"SHOULD\", \"SHOULD NOT\", and \"MAY\" in this document are to be interpreted as described in \"Key words for use in RFCs to Indicate Requirement Levels\" [RFC2119].",
      "zh-CHS": "本文件中的关键词“必需”、“必须”、“不得”、“应该”、“不应该”和“可能”应按照“RFC中用于表示需求水平的关键词”中的描述进行解释[RFC2119]。"
    },
    {
      "indent": 0,
      "text": "2 Guiding Principles during Evidence Collection",
      "zh-CHS": "2证据收集的指导原则"
    },
    {
      "indent": 6,
      "text": "- Adhere to your site's Security Policy and engage the appropriate Incident Handling and Law Enforcement personnel.",
      "zh-CHS": "- 遵守网站的安全政策，并聘请适当的事件处理和执法人员。"
    },
    {
      "indent": 6,
      "text": "- Capture as accurate a picture of the system as possible.",
      "zh-CHS": "- 尽可能准确地捕捉系统的图像。"
    },
    {
      "indent": 6,
      "text": "- Keep detailed notes. These should include dates and times. If possible generate an automatic transcript. (e.g., On Unix systems the 'script' program can be used, however the output file it generates should not be to media that is part of the evidence). Notes and print-outs should be signed and dated.",
      "zh-CHS": "- 做详细的笔记。这些应该包括日期和时间。如果可能，生成一份自动成绩单。（例如，在Unix系统上，可以使用“脚本”程序，但它生成的输出文件不应发送到作为证据一部分的媒体）。注释和打印件应签字并注明日期。"
    },
    {
      "indent": 6,
      "text": "- Note the difference between the system clock and UTC. For each timestamp provided, indicate whether UTC or local time is used.",
      "zh-CHS": "- 请注意系统时钟和UTC之间的差异。对于提供的每个时间戳，指出是使用UTC时间还是本地时间。"
    },
    {
      "indent": 6,
      "text": "- Be prepared to testify (perhaps years later) outlining all actions you took and at what times. Detailed notes will be vital.",
      "zh-CHS": "- 准备好作证（也许几年后），概述你在什么时候采取的所有行动。详细的说明至关重要。"
    },
    {
      "indent": 6,
      "text": "- Minimise changes to the data as you are collecting it. This is not limited to content changes; you should avoid updating file or directory access times.",
      "zh-CHS": "- 在收集数据时尽量减少对数据的更改。这不仅限于内容变更；您应该避免更新文件或目录访问时间。"
    },
    {
      "indent": 6,
      "text": "- Remove external avenues for change.",
      "zh-CHS": "- 消除外部的改变途径。"
    },
    {
      "indent": 6,
      "text": "- When confronted with a choice between collection and analysis you should do collection first and analysis later.",
      "zh-CHS": "- 当面临收集和分析之间的选择时，您应该先进行收集，然后再进行分析。"
    },
    {
      "indent": 6,
      "text": "- Though it hardly needs stating, your procedures should be implementable. As with any aspect of an incident response policy, procedures should be tested to ensure feasibility, particularly in a crisis. If possible procedures should be automated for reasons of speed and accuracy. Be methodical.",
      "zh-CHS": "- 虽然几乎不需要说明，但您的过程应该是可实施的。与事故响应政策的任何方面一样，应对程序进行测试，以确保可行性，特别是在危机中。如果可能的话，出于速度和准确性的原因，程序应该自动化。要有条不紊。"
    },
    {
      "indent": 6,
      "text": "- For each device, a methodical approach should be adopted which follows the guidelines laid down in your collection procedure. Speed will often be critical so where there are a number of devices requiring examination it may be appropriate to spread the work among your team to collect the evidence in parallel. However on a single given system collection should be done step by step.",
      "zh-CHS": "- 对于每个设备，应采用系统的方法，遵循收集程序中规定的指南。速度通常是至关重要的，因此，如果有许多设备需要检查，那么在团队中分散工作以并行收集证据可能是合适的。但是，在单个给定系统上，应逐步完成收集。"
    },
    {
      "indent": 6,
      "text": "- Proceed from the volatile to the less volatile (see the Order of Volatility below).",
      "zh-CHS": "- 从波动性到波动性较小（见下文波动性顺序）。"
    },
    {
      "indent": 6,
      "text": "- You should make a bit-level copy of the system's media. If you wish to do forensics analysis you should make a bit-level copy of your evidence copy for that purpose, as your analysis will almost certainly alter file access times. Avoid doing forensics on the evidence copy.",
      "zh-CHS": "- 您应该制作系统介质的位级副本。如果你想做法医学分析，你应该为你的证据副本做一个小拷贝，因为你的分析几乎肯定会改变文件访问时间。避免对证据副本进行取证。"
    },
    {
      "indent": 0,
      "text": "2.1 Order of Volatility",
      "section_title": true,
      "zh-CHS": "2.1 波动顺序"
    },
    {
      "indent": 3,
      "text": "When collecting evidence you should proceed from the volatile to the less volatile. Here is an example order of volatility for a typical system.",
      "zh-CHS": "在收集证据时，你应该从易失性到不易失性。下面是一个典型系统的波动顺序示例。"
    },
    {
      "indent": 6,
      "text": "- registers, cache",
      "zh-CHS": "- 寄存器、缓存"
    },
    {
      "indent": 6,
      "text": "- routing table, arp cache, process table, kernel statistics, memory",
      "zh-CHS": "- 路由表、arp缓存、进程表、内核统计信息、内存"
    },
    {
      "indent": 6,
      "text": "- temporary file systems",
      "zh-CHS": "- 临时文件系统"
    },
    {
      "indent": 6,
      "text": "- disk",
      "zh-CHS": "- 磁盘"
    },
    {
      "indent": 6,
      "text": "- remote logging and monitoring data that is relevant to the system in question",
      "zh-CHS": "- 与相关系统相关的远程日志记录和监控数据"
    },
    {
      "indent": 6,
      "text": "- physical configuration, network topology",
      "zh-CHS": "- 物理配置、网络拓扑"
    },
    {
      "indent": 6,
      "text": "- archival media",
      "zh-CHS": "- 档案媒体"
    },
    {
      "indent": 0,
      "text": "2.2 Things to avoid",
      "section_title": true,
      "zh-CHS": "2.2 避免的事情"
    },
    {
      "indent": 3,
      "text": "It's all too easy to destroy evidence, however inadvertently.",
      "zh-CHS": "无论多么无意，销毁证据都太容易了。"
    },
    {
      "indent": 6,
      "text": "- Don't shutdown until you've completed evidence collection. Much evidence may be lost and the attacker may have altered the startup/shutdown scripts/services to destroy evidence.",
      "zh-CHS": "- 在完成证据收集之前不要关机。大量证据可能丢失，攻击者可能已更改启动/关闭脚本/服务以销毁证据。"
    },
    {
      "indent": 6,
      "text": "- Don't trust the programs on the system. Run your evidence gathering programs from appropriately protected media (see below).",
      "zh-CHS": "- 不要信任系统上的程序。从适当保护的媒体上运行证据收集程序（见下文）。"
    },
    {
      "indent": 6,
      "text": "- Don't run programs that modify the access time of all files on the system (e.g., 'tar' or 'xcopy').",
      "zh-CHS": "- 不要运行修改系统上所有文件访问时间的程序（例如，“tar”或“xcopy”）。"
    },
    {
      "indent": 6,
      "text": "- When removing external avenues for change note that simply disconnecting or filtering from the network may trigger \"deadman switches\" that detect when they're off the net and wipe evidence.",
      "zh-CHS": "- 当移除外部变更通道时，请注意，简单地断开网络连接或从网络中过滤可能会触发“死锁开关”，该开关可在断开网络时进行检测并清除证据。"
    },
    {
      "indent": 0,
      "text": "2.3 Privacy Considerations",
      "section_title": true,
      "zh-CHS": "2.3 隐私考虑"
    },
    {
      "indent": 6,
      "text": "- Respect the privacy rules and guidelines of your company and your legal jurisdiction. In particular, make sure no information collected along with the evidence you are searching for is available to anyone who would not normally have access to this information. This includes access to log files (which may reveal patterns of user behaviour) as well as personal data files.",
      "zh-CHS": "- 尊重您公司和您的法律管辖区的隐私规则和指南。特别是，请确保您所搜索的证据以及收集的信息不可供通常无法访问此信息的任何人使用。这包括访问日志文件（可能揭示用户行为模式）以及个人数据文件。"
    },
    {
      "indent": 6,
      "text": "- Do not intrude on people's privacy without strong justification. In particular, do not collect information from areas you do not normally have reason to access (such as personal file stores) unless you have sufficient indication that there is a real incident.",
      "zh-CHS": "- 无正当理由不得侵犯他人隐私。特别是，除非您有足够的证据表明发生了真实事件，否则不要从您通常没有理由访问的区域（如个人文件存储）收集信息。"
    },
    {
      "indent": 6,
      "text": "- Make sure you have the backing of your company's established procedures in taking the steps you do to collect evidence of an incident.",
      "zh-CHS": "- 在采取措施收集事件证据时，确保你有公司既定程序的支持。"
    },
    {
      "indent": 0,
      "text": "2.4 Legal Considerations",
      "section_title": true,
      "zh-CHS": "2.4 法律考虑"
    },
    {
      "indent": 3,
      "text": "Computer evidence needs to be",
      "zh-CHS": "需要对计算机证据进行分析"
    },
    {
      "indent": 6,
      "text": "- Admissible: It must conform to certain legal rules before it can be put before a court.",
      "zh-CHS": "- 可接受的：它必须符合一定的法律规则才能提交法院。"
    },
    {
      "indent": 6,
      "text": "- Authentic: It must be possible to positively tie evidentiary material to the incident.",
      "zh-CHS": "- 真实性：必须能够将证据材料与事件正面联系起来。"
    },
    {
      "indent": 6,
      "text": "- Complete: It must tell the whole story and not just a particular perspective.",
      "zh-CHS": "- 完整：它必须讲述整个故事，而不仅仅是一个特定的视角。"
    },
    {
      "indent": 6,
      "text": "- Reliable: There must be nothing about how the evidence was collected and subsequently handled that casts doubt about its authenticity and veracity.",
      "zh-CHS": "- 可靠：证据的收集和随后的处理方式决不能让人怀疑其真实性和准确性。"
    },
    {
      "indent": 6,
      "text": "- Believable: It must be readily believable and understandable by a court.",
      "zh-CHS": "- 可信的：它必须容易被法庭相信和理解。"
    },
    {
      "indent": 0,
      "text": "3 The Collection Procedure",
      "zh-CHS": "3收集程序"
    },
    {
      "indent": 3,
      "text": "Your collection procedures should be as detailed as possible. As is the case with your overall Incident Handling procedures, they should be unambiguous, and should minimise the amount of decision-making needed during the collection process.",
      "zh-CHS": "您的收款程序应尽可能详细。与您的整体事故处理程序一样，这些程序应明确无误，并应尽量减少收集过程中所需的决策量。"
    },
    {
      "indent": 0,
      "text": "3.1 Transparency",
      "section_title": true,
      "zh-CHS": "3.1 透明度"
    },
    {
      "indent": 3,
      "text": "The methods used to collect evidence should be transparent and reproducible. You should be prepared to reproduce precisely the methods you used, and have those methods tested by independent experts.",
      "zh-CHS": "用于收集证据的方法应透明且可复制。你应该准备好精确复制你使用的方法，并让独立专家对这些方法进行测试。"
    },
    {
      "indent": 0,
      "text": "3.2 Collection Steps",
      "section_title": true,
      "zh-CHS": "3.2 收集步骤"
    },
    {
      "indent": 6,
      "text": "- Where is the evidence? List what systems were involved in the incident and from which evidence will be collected.",
      "zh-CHS": "- 证据在哪里？列出事件涉及的系统以及将从中收集证据。"
    },
    {
      "indent": 6,
      "text": "- Establish what is likely to be relevant and admissible. When in doubt err on the side of collecting too much rather than not enough.",
      "zh-CHS": "- 确定可能相关和可接受的内容。当有疑问时，错误在于收集太多而不是不够。"
    },
    {
      "indent": 6,
      "text": "- For each system, obtain the relevant order of volatility.",
      "zh-CHS": "- 对于每个系统，获得相关的波动顺序。"
    },
    {
      "indent": 6,
      "text": "- Remove external avenues for change.",
      "zh-CHS": "- 消除外部的改变途径。"
    },
    {
      "indent": 6,
      "text": "- Following the order of volatility, collect the evidence with tools as discussed in Section 5.",
      "zh-CHS": "- 按照波动性顺序，使用第5节讨论的工具收集证据。"
    },
    {
      "indent": 6,
      "text": "- Record the extent of the system's clock drift.",
      "zh-CHS": "- 记录系统时钟漂移的范围。"
    },
    {
      "indent": 6,
      "text": "- Question what else may be evidence as you work through the collection steps.",
      "zh-CHS": "- 当您完成收集步骤时，询问还有哪些证据。"
    },
    {
      "indent": 6,
      "text": "- Document each step.",
      "zh-CHS": "- 记录每个步骤。"
    },
    {
      "indent": 6,
      "text": "- Don't forget the people involved. Make notes of who was there and what were they doing, what they observed and how they reacted.",
      "zh-CHS": "- 不要忘记参与其中的人。记下谁在那里，他们在做什么，他们观察到了什么，以及他们的反应。"
    },
    {
      "indent": 3,
      "text": "Where feasible you should consider generating checksums and cryptographically signing the collected evidence, as this may make it easier to preserve a strong chain of evidence. In doing so you must not alter the evidence.",
      "zh-CHS": "在可行的情况下，您应该考虑生成校验和并对所收集的证据进行密码学签名，因为这样可以更容易维护强有力的证据链。在这样做时，你不能改变证据。"
    },
    {
      "indent": 0,
      "text": "4 The Archiving Procedure",
      "zh-CHS": "4存档程序"
    },
    {
      "indent": 3,
      "text": "Evidence must be strictly secured. In addition, the Chain of Custody needs to be clearly documented.",
      "zh-CHS": "证据必须严格保密。此外，监管链需要明确记录。"
    },
    {
      "indent": 0,
      "text": "4.1 Chain of Custody",
      "section_title": true,
      "zh-CHS": "4.1 监管链"
    },
    {
      "indent": 3,
      "text": "You should be able to clearly describe how the evidence was found, how it was handled and everything that happened to it.",
      "zh-CHS": "你应该能够清楚地描述证据是如何被发现的，它是如何被处理的，以及发生在它身上的一切。"
    },
    {
      "indent": 3,
      "text": "The following need to be documented",
      "zh-CHS": "需要记录以下内容"
    },
    {
      "indent": 6,
      "text": "- Where, when, and by whom was the evidence discovered and collected.",
      "zh-CHS": "- 发现和收集证据的地点、时间和人员。"
    },
    {
      "indent": 6,
      "text": "- Where, when and by whom was the evidence handled or examined.",
      "zh-CHS": "- 证据的处理或审查地点、时间和人员。"
    },
    {
      "indent": 6,
      "text": "- Who had custody of the evidence, during what period. How was it stored.",
      "zh-CHS": "- 谁拥有证据的保管权，在什么时期。它是如何储存的。"
    },
    {
      "indent": 6,
      "text": "- When the evidence changed custody, when and how did the transfer occur (include shipping numbers, etc.).",
      "zh-CHS": "- 当证据改变保管时，转移发生的时间和方式（包括装运编号等）。"
    },
    {
      "indent": 0,
      "text": "4.2 Where and how to Archive",
      "section_title": true,
      "zh-CHS": "4.2 归档地点和方式"
    },
    {
      "indent": 3,
      "text": "If possible commonly used media (rather than some obscure storage media) should be used for archiving.",
      "zh-CHS": "如果可能，应使用常用介质（而不是一些模糊的存储介质）进行归档。"
    },
    {
      "indent": 3,
      "text": "Access to evidence should be extremely restricted, and should be clearly documented. It should be possible to detect unauthorised access.",
      "zh-CHS": "获取证据应受到严格限制，并应明确记录在案。应该能够检测未经授权的访问。"
    },
    {
      "indent": 0,
      "text": "5 Tools you'll need",
      "zh-CHS": "5个你需要的工具"
    },
    {
      "indent": 3,
      "text": "You should have the programs you need to do evidence collection and forensics on read-only media (e.g., a CD). You should have prepared such a set of tools for each of the Operating Systems that you manage in advance of having to use it.",
      "zh-CHS": "您应该拥有在只读媒体（如CD）上进行证据收集和取证所需的程序。在使用之前，您应该为您管理的每个操作系统准备这样一套工具。"
    },
    {
      "indent": 3,
      "text": "Your set of tools should include the following:",
      "zh-CHS": "您的工具集应包括以下内容："
    },
    {
      "indent": 6,
      "text": "- a program for examining processes (e.g., 'ps').",
      "zh-CHS": "- 检查过程的程序（如“ps”）。"
    },
    {
      "indent": 6,
      "text": "- programs for examining system state (e.g., 'showrev', 'ifconfig', 'netstat', 'arp').",
      "zh-CHS": "- 用于检查系统状态的程序（例如，“showrev”、“ifconfig”、“netstat”、“arp”）。"
    },
    {
      "indent": 6,
      "text": "- a program for doing bit-to-bit copies (e.g., 'dd', 'SafeBack').",
      "zh-CHS": "- 一种进行逐位复制的程序（例如，“dd”、“SafeBack”）。"
    },
    {
      "indent": 6,
      "text": "- programs for generating checksums and signatures (e.g., 'sha1sum', a checksum-enabled 'dd', 'SafeBack', 'pgp').",
      "zh-CHS": "- 用于生成校验和和签名的程序（例如，“sha1sum”，启用校验和的“dd”、“SafeBack”、“pgp”）。"
    },
    {
      "indent": 6,
      "text": "- programs for generating core images and for examining them (e.g., 'gcore', 'gdb').",
      "zh-CHS": "- 用于生成岩芯图像和检查岩芯图像的程序（例如，“gcore”、“gdb”）。"
    },
    {
      "indent": 6,
      "text": "- scripts to automate evidence collection (e.g., The Coroner's Toolkit [FAR1999]).",
      "zh-CHS": "- 自动化证据收集的脚本（例如，验尸官工具包[FAR1999]）。"
    },
    {
      "indent": 3,
      "text": "The programs in your set of tools should be statically linked, and should not require the use of any libraries other than those on the read-only media. Even then, since modern rootkits may be installed through loadable kernel modules, you should consider that your tools might not be giving you a full picture of the system.",
      "zh-CHS": "工具集中的程序应该是静态链接的，并且不需要使用只读介质上的程序库以外的任何程序库。即使如此，由于现代rootkit可能通过可加载内核模块安装，您应该考虑您的工具可能不会给您一个完整的系统图片。"
    },
    {
      "indent": 3,
      "text": "You should be prepared to testify to the authenticity and reliability of the tools that you use.",
      "zh-CHS": "您应该准备好证明您使用的工具的真实性和可靠性。"
    },
    {
      "indent": 0,
      "text": "6 References",
      "zh-CHS": "6参考文献"
    },
    {
      "indent": 3,
      "text": "[FAR1999]   Farmer, D., and W Venema, \"Computer Forensics Analysis\n            Class Handouts\", http://www.fish.com/forensics/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2196] Fraser, B., \"Site Security Handbook\", FYI 8, RFC 2196, September 1997.",
      "zh-CHS": "[RFC2196]弗雷泽，B.，《现场安全手册》，第8期，RFC 2196，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2350] Brownlee, N. and E. Guttman, \"Expectations for Computer Security Incident Response\", FYI 8, RFC 2350, June 1998.",
      "zh-CHS": "[RFC2350]Brownlee，N.和E.Guttman，“对计算机安全事件响应的期望”，FYI 8，RFC 23501998年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2828] Shirey, R., \"Internet Security Glossary\", FYI 36, RFC 2828, May 2000.",
      "zh-CHS": "[RFC2828]Shirey，R.，“互联网安全词汇表”，FYI 36，RFC 2828，2000年5月。"
    },
    {
      "indent": 0,
      "text": "7 Acknowledgements",
      "zh-CHS": "7致谢"
    },
    {
      "indent": 3,
      "text": "We gratefully acknowledge the constructive comments received from Harald Alvestrand, Byron Collie, Barbara Y. Fraser, Gordon Lennox, Andrew Rees, Steve Romig and Floyd Short.",
      "zh-CHS": "我们衷心感谢哈拉尔·阿尔韦斯特朗、拜伦·科利、芭芭拉·弗雷泽、戈登·伦诺克斯、安德鲁·里斯、史蒂夫·罗米格和弗洛伊德·肖特提出的建设性意见。"
    },
    {
      "indent": 0,
      "text": "8 Security Considerations",
      "zh-CHS": "8安全考虑"
    },
    {
      "indent": 3,
      "text": "This entire document discuses security issues.",
      "zh-CHS": "整个文档讨论了安全问题。"
    },
    {
      "indent": 0,
      "text": "9 Authors' Addresses",
      "zh-CHS": "9作者地址"
    },
    {
      "indent": 3,
      "text": "Dominique Brezinski In-Q-Tel 1000 Wilson Blvd., Ste. 2900 Arlington, VA 22209 USA",
      "zh-CHS": "多米尼克·布雷津斯基In-Q-Tel 1000威尔逊大道，圣。美国弗吉尼亚州阿灵顿市2900号，邮编22209"
    },
    {
      "indent": 3,
      "text": "EMail: dbrezinski@In-Q-Tel.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Tom Killalea Lisi/n na Bro/n Be/al A/tha na Muice Co. Mhaigh Eo IRELAND",
      "zh-CHS": "Tom Killalea Lisi/n na Bro/n Be/al A/tha na Muice Co.Mhaigh Eo IRELAND"
    },
    {
      "indent": 3,
      "text": "Phone: +1 206 266-2196\nEMail: tomk@neart.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "10. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}