{
  "title": {
    "text": "RFC 3475:  Documentation of IANA assignments for Constraint-Based LSP setup using LDP (CR-LDP) Extensions for Automatic Switched Optical Network (ASON) ",
    "zh-CHS": "RFC 3475"
  },
  "number": 3475,
  "created_at": "2021-10-27 06:41:39.161348+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      O. Aboul-Magd\nRequest for Comments: 3475                               Nortel Networks\nCategory: Informational                                       March 2003",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": " Documentation of IANA assignments for Constraint-Based LSP setup using LDP (CR-LDP) Extensions for Automatic Switched Optical Network (ASON)",
      "zh-CHS": "使用自动交换光网络（ASON）LDP（CR-LDP）扩展的基于约束的LSP设置的IANA分配文件"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Automatic Switched Optical Network (ASON) is an architecture, specified by ITU-T Study Group 15, for the introduction of a control plane for optical networks. The ASON architecture specifies a set of reference points that defines the relationship between the ASON architectural entities. Signaling over interfaces defined in those reference points can make use of protocols that are defined by the IETF in the context of Generalized Multi-Protocol Label Switching (GMPLS) work. This document describes Constraint-Based LSP setup using LDP (CR-LDP) extensions for signaling over the interfaces defined in the ASON reference points. The purpose of the document is to request that the IANA assigns code points necessary for the CR-LDP extensions. The protocol specifications for the use of the CR-LDP extensions are found in ITU-T documents.",
      "zh-CHS": "自动交换光网络（ASON）是ITU-T研究组15指定的一种体系结构，用于为光网络引入控制平面。ASON体系结构指定了一组参考点，用于定义ASON体系结构实体之间的关系。在这些参考点中定义的接口上的信令可以利用IETF在通用多协议标签交换（GMPLS）工作环境中定义的协议。本文档描述了使用LDP（CR-LDP）扩展在ASON参考点中定义的接口上发送信令的基于约束的LSP设置。本文件的目的是要求IANA分配CR-LDP扩展所需的码点。使用CR-LDP扩展的协议规范见ITU-T文件。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction .................................................  2\n2.  Overview of CR-LDP Extensions for ASON .......................  2\n3.  CR-LDP Messages for ASON .....................................  3\n   3.1 Call Setup Message ........................................  4\n      3.1.2 Call Setup Procedure .................................  5\n   3.2 The Call Release Message ..................................  5\n      3.2.1 Call Release Procedure ...............................  6\n4.  CR-LDP TLV for ASON ..........................................  6\n   4.1 Call ID TLV ...............................................  6\n      4.1.1 Call ID Procedure ....................................  8\n   4.2 Call Capability TLV .......................................  9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "   4.3 Crankback TLV .............................................  9\n5.  Additional Error Codes ....................................... 10\n6.  IANA Consideration ........................................... 11\n9.  Security Considerations ...................................... 11\n10. Normative References ......................................... 11\n11. Intellectual Property ........................................ 12\n12. Author's Address ............................................. 12\n13. Full Copyright Statement ..................................... 13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Automatic Switched Optical Network (ASON) is an architecture, specified by ITU-T Study Group 15 (SG15), for the introduction of a control plane for optical networks. The development and the standardization of ASON has been done by ITU-T SG15 and is documented in recommendation G.8080 [1]. The architecture includes a control plane with a set of reference points between the architectural components. The ASON signaling that runs over interfaces defined in those reference points are described in ITU-T recommendation G.7713 [2].",
      "zh-CHS": "自动交换光网络（ASON）是ITU-T研究组15（SG15）指定的一种体系结构，用于为光网络引入控制平面。ASON的开发和标准化已由ITU-T SG15完成，并记录在建议G.8080[1]中。该体系结构包括一个控制平面，该平面在体系结构组件之间具有一组参考点。ITU-T建议G.7713[2]中描述了在这些参考点中定义的接口上运行的ASON信令。"
    },
    {
      "indent": 3,
      "text": "Constraint-Based LSP Setup using LDP (CR-LDP) [3] is one of the protocols selected by the ITU for the realization of G.7713 and its dynamic connection management. The work specific to CR-LDP extensions for ASON is documented in ITU-T recommendation G.7713.3 [8].",
      "zh-CHS": "使用LDP（CR-LDP）[3]的基于约束的LSP设置是ITU为实现G.7713及其动态连接管理而选择的协议之一。针对ASON的CR-LDP扩展的具体工作记录在ITU-T建议G.7713.3[8]中。"
    },
    {
      "indent": 3,
      "text": "This document introduces those CR-LDP extensions that are specific to ASON and requests IANA allocation of code points for these extensions. The document does not specify how these extensions are used; that is the subject of the above mentioned ITU-T documents. This document should be considered in conjunction with RFC 3036 [4], RFC 3212 [3], and CR-LDP extensions for GMPLS [5].",
      "zh-CHS": "本文档介绍了特定于ASON的CR-LDP扩展，并请求IANA为这些扩展分配代码点。本文件未规定如何使用这些扩展；这是上述ITU-T文件的主题。本文件应与RFC 3036[4]、RFC 3212[3]和GMPLS的CR-LDP扩展[5]一起考虑。"
    },
    {
      "indent": 0,
      "text": "2. Overview of CR-LDP Extensions for ASON",
      "section_title": true,
      "zh-CHS": "2. ASON的CR-LDP扩展综述"
    },
    {
      "indent": 3,
      "text": "This document describes ASON specific CR-LDP extensions covering the following ASON signaling requirements:",
      "zh-CHS": "本文件描述了ASON专用CR-LDP扩展，涵盖以下ASON信令要求："
    },
    {
      "indent": 3,
      "text": "- Call and connection control separation - Support of Soft Permanent Connections (SPC) - Crankback - Additional error codes",
      "zh-CHS": "- 呼叫和连接控制分离-支持软永久连接（SPC）-回退-其他错误代码"
    },
    {
      "indent": 3,
      "text": "An important ASON architectural principle is the separation between the call and the connection controllers as described in G.8080. Call and connection control separation allows for a call with multiple connections associated with it. It also allows for a call with no",
      "zh-CHS": "一个重要的ASON架构原则是G.8080中描述的呼叫和连接控制器之间的分离。呼叫和连接控制分离允许一个具有多个关联连接的呼叫。它还允许在没有任何提示的情况下拨打电话"
    },
    {
      "indent": 3,
      "text": "connections (a temporary situation that might be useful during recovery).",
      "zh-CHS": "连接（恢复期间可能有用的临时情况）。"
    },
    {
      "indent": 3,
      "text": "The separation of the call and the connection controllers could be achieved using one of two models. The first model is one where the call set up request is always accompanied by a connection request. The second model is one in which call set up is done independently from connection set up. The first model is usually referred to as logical separation, while the second model is usually referred to as complete separation. CR-LDP extensions for ASON support the two separation models.",
      "zh-CHS": "可以使用两种模型中的一种来实现呼叫和连接控制器的分离。第一种模式是呼叫建立请求总是伴随着连接请求。第二种模式是独立于连接设置进行呼叫设置的模式。第一个模型通常被称为逻辑分离，而第二个模型通常被称为完全分离。ASON的CR-LDP扩展支持两种分离模型。"
    },
    {
      "indent": 3,
      "text": "Two new messages are introduced for call operations (set up and release). The Call Setup message is used for those cases where complete separation is required. Otherwise the LDP Label Request message is used for logical separation.",
      "zh-CHS": "为呼叫操作（设置和释放）引入了两条新消息。呼叫设置消息用于需要完全分离的情况。否则，LDP标签请求消息用于逻辑分离。"
    },
    {
      "indent": 3,
      "text": "A connection set up request must indicate the call to which the connection needs to be associated. A Call ID TLV is introduced to achieve this goal. The structure of the Call ID allows it to have a global or an operator scope.",
      "zh-CHS": "连接设置请求必须指明连接需要关联到的调用。为了实现这一目标，引入了调用ID TLV。调用ID的结构允许它具有全局范围或运算符范围。"
    },
    {
      "indent": 3,
      "text": "Call release is always achieved using the Call Release message. The reception of the call Release messages signifies the intention to remove all connections that are associated to the call. Connection release is achieved using the CR-LDP label release procedure (using LDP Label Release and Label Withdraw messages) as defined in [4].",
      "zh-CHS": "呼叫释放始终使用呼叫释放消息实现。接收到呼叫释放消息表示打算删除与呼叫相关的所有连接。使用[4]中定义的CR-LDP标签释放程序（使用LDP标签释放和标签撤销消息）实现连接释放。"
    },
    {
      "indent": 3,
      "text": "A Call Capability TLV is also introduced to explicitly indicate the capability of the requested call.",
      "zh-CHS": "还引入了呼叫能力TLV，以明确指示所请求呼叫的能力。"
    },
    {
      "indent": 3,
      "text": "An Soft Permanent Connection (SPC) service assumes that both source and destination user-to-network connection segments are provisioned while the network connection segment is set up via the control plane. For example when the initial request is received from an external source, e.g. from a management system, there is an implicit assumption that the control plane has adequate information to determine the specific destination (network-to-user) link connection to use. Support for CR-LDP is provided by the use of the Egress Label TLV as defined in the OIF UNI 1.0 section 11.7.5 [6] from the Optical Internetworking Forum and in RFC3476 [7].",
      "zh-CHS": "软永久连接（SPC）服务假定在通过控制平面设置网络连接段时，同时提供源和目标用户到网络连接段。例如，当从外部源（例如从管理系统）接收到初始请求时，存在控制平面具有足够信息以确定要使用的特定目的地（网络到用户）链路连接的隐含假设。CR-LDP的支持是通过使用出口标签TLV提供的，如光纤互联论坛的OIF UNI 1.0第11.7.5[6]节和RFC3476[7]中所定义。"
    },
    {
      "indent": 0,
      "text": "3. CR-LDP Messages for ASON",
      "section_title": true,
      "zh-CHS": "3. 用于ASON的CR-LDP消息"
    },
    {
      "indent": 3,
      "text": "This section describes the formats and the procedures of the two messages that are required for ASON call and connection control separation. Those messages are the Call Setup messages and the Call Release message.",
      "zh-CHS": "本节介绍ASON呼叫和连接控制分离所需的两条消息的格式和过程。这些消息是呼叫设置消息和呼叫释放消息。"
    },
    {
      "indent": 0,
      "text": "3.1 Call Setup Message",
      "section_title": true,
      "zh-CHS": "3.1 呼叫设置消息"
    },
    {
      "indent": 3,
      "text": "The format of the Call Setup message is:",
      "zh-CHS": "呼叫设置消息的格式为："
    },
    {
      "indent": 7,
      "text": "0 1 2 3",
      "zh-CHS": "0 1 2 3"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0|  Call Setup (0x0500)        |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Message ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Source ID TLV                       |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Dest ID  TLV                        |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Call ID TLV                         |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Call Capability TLV                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Optional Parameters                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Message ID: Is as defined in RFC3036 [4].",
      "zh-CHS": "消息ID：如RFC3036[4]中所定义。"
    },
    {
      "indent": 3,
      "text": "Source ID TLV: Is as defined in UNI 1.0 [6] and in [7].",
      "zh-CHS": "源ID TLV：如UNI 1.0[6]和[7]中所定义。"
    },
    {
      "indent": 3,
      "text": "Dest ID TLV: Is as defined in UNI 1.0 [6] and in [7].",
      "zh-CHS": "目的地ID TLV：如UNI 1.0[6]和[7]中所定义。"
    },
    {
      "indent": 3,
      "text": "Call ID TLV: Is as defined in section 4.1 of this document.",
      "zh-CHS": "呼叫ID TLV:定义见本文件第4.1节。"
    },
    {
      "indent": 3,
      "text": "Call Capability TLV: Is as defined in section 4.2 of this document.",
      "zh-CHS": "呼叫能力TLV：定义见本文件第4.2节。"
    },
    {
      "indent": 0,
      "text": "3.1.2 Call Setup Procedure",
      "section_title": true,
      "zh-CHS": "3.1.2 呼叫设置程序"
    },
    {
      "indent": 3,
      "text": "The Calling party sends the Call Setup message whenever a new call needs to be set up with no connection associated with it. The Call Setup message shall contain all the information required by the network to process the call. In particular, the Call Setup message shall include the calling and called party addresses as specified by the Source ID and Dest ID TLV. The setup message must include Call ID TLV. The call control entity shall identify the call using the selected identifier for the lifetime of the call. The Call Setup message shall progress through the network to the called party. The called party may accept or reject the incoming call. An LDP Notification message with the appropriate status code shall be used to inform the calling party whether the setup is successful. The call can be rejected by either the network, e.g. for policy reasons, or by the called party.",
      "zh-CHS": "只要需要在没有关联连接的情况下设置新呼叫，呼叫方就会发送呼叫设置消息。呼叫设置消息应包含网络处理呼叫所需的所有信息。特别是，呼叫设置消息应包括由源ID和目标ID TLV指定的主叫方和被叫方地址。设置消息必须包括呼叫ID TLV。呼叫控制实体应在呼叫生命周期内使用所选标识符识别呼叫。呼叫设置消息应通过网络传送至被叫方。被叫方可以接受或拒绝来电。应使用具有适当状态代码的LDP通知消息通知呼叫方设置是否成功。呼叫可以被网络拒绝（例如出于策略原因），也可以被被叫方拒绝。"
    },
    {
      "indent": 0,
      "text": "3.2 The Call Release Message",
      "section_title": true,
      "zh-CHS": "3.2 呼叫释放消息"
    },
    {
      "indent": 3,
      "text": "This format of the Call Release message is:",
      "zh-CHS": "此呼叫释放消息的格式为："
    },
    {
      "indent": 7,
      "text": "0 1 2 3",
      "zh-CHS": "0 1 2 3"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0| Call Release (0x0501)       |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Message ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Source ID TLV                       |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Dest ID TLV                         |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Call ID TLV                         |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Optional Parameters                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "3.2.1 Call Release Procedure",
      "section_title": true,
      "zh-CHS": "3.2.1 呼叫释放程序"
    },
    {
      "indent": 3,
      "text": "The Call Release message is sent by any entity of the network to terminate an already established call. The Call Release message must include the Call ID TLV of the call to be terminated. Confirmation of call release is indicated to the request initiator using a Notification message with the appropriate status code. Reception and processing of the Call Release message must trigger the release of all connections that are associated with that call. Connection release follows the normal CR-LDP procedure using Label Release and Label Withdraw messages.",
      "zh-CHS": "呼叫释放消息由网络的任何实体发送，以终止已建立的呼叫。呼叫释放消息必须包括要终止的呼叫的呼叫ID TLV。使用带有适当状态代码的通知消息向请求发起人指示呼叫释放确认。呼叫释放消息的接收和处理必须触发与该呼叫相关的所有连接的释放。连接释放遵循正常的CR-LDP过程，使用标签释放和标签收回消息。"
    },
    {
      "indent": 0,
      "text": "4. CR-LDP TLVs for ASON",
      "section_title": true,
      "zh-CHS": "4. 用于ASON的CR-LDP TLV"
    },
    {
      "indent": 3,
      "text": "This section describes the operator specific Call ID TLV, the globally unique Call ID TLV, the Call Capability TLV and the Crankback TLV introduced for ASON.",
      "zh-CHS": "本节描述了为ASON引入的特定于运营商的呼叫ID TLV、全局唯一呼叫ID TLV、呼叫能力TLV和回退TLV。"
    },
    {
      "indent": 0,
      "text": "4.1 Call ID TLV",
      "section_title": true,
      "zh-CHS": "4.1 呼叫ID TLV"
    },
    {
      "indent": 3,
      "text": "An established call may be identified by a Call ID. The Call ID is a globally unique identifier that is set by the source network. The structure for the Call ID (to guarantee global uniqueness) is to concatenate a globally unique fixed identifier (composed of country code, carrier code, unique access point code) with an operator specific identifier (where the operator specific identifier is composed of ingress network element (NE) address and a local Identifier).",
      "zh-CHS": "已建立的呼叫可由呼叫ID标识。呼叫ID是由源网络设置的全局唯一标识符。呼叫ID的结构（保证全局唯一性）是将全局唯一的固定标识符（由国家代码、载波代码、唯一接入点代码组成）与特定于运营商的标识符（其中特定于运营商的标识符由入口网元（NE）地址和本地标识符组成）连接起来。"
    },
    {
      "indent": 3,
      "text": "Therefore, a generic CALL_ID with global uniqueness includes <global Id> (composed of <country code> plus <carrier code> plus <unique access point code>) and <operator specific Id> (composed of <NE address> plus <local Identifier>). For a CALL_ID that requires only operator specific uniqueness, only the <operator specific Id> is needed, while for a CALL_ID that is required to be globally unique both <global ID> and <operator specific Id> are needed.",
      "zh-CHS": "因此，具有全局唯一性的通用呼叫ID包括<global ID>（由<country code>加<carrier code>加<unique access point code>组成）和<operator specific ID>（由<NE address>加<local Identifier>组成）。对于只需要特定于操作员的唯一性的呼叫标识，只需要<operator specific ID>，而对于要求全局唯一的呼叫标识，则需要<global ID>和<operator specific ID>。"
    },
    {
      "indent": 3,
      "text": "The <global Id> shall consist of a three-character International Segment (the <country code>) and a twelve-character National Segment (the <carrier code> plus <unique access point code>). These characters shall be coded according to ITU-T Recommendation T.50.",
      "zh-CHS": "<global Id>应包括一个三字符的国际段（国家代码）和一个十二字符的国家段（承运人代码+唯一接入点代码）。这些字符应根据ITU-T建议T.50进行编码。"
    },
    {
      "indent": 3,
      "text": "The format of the operator specific (Op-Sp) CALL_ID TLV:",
      "zh-CHS": "特定于操作员（Op Sp）的呼叫ID TLV的格式："
    },
    {
      "indent": 7,
      "text": "0 1 2 3",
      "zh-CHS": "0 1 2 3"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F|Op-Sp Call ID (0x0831)     |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   NE Address (NEA Sub TLV)                    |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Local Identifier                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Local Identifier (continued)                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "NEA Sub TLV: The Source NE Address is an address of the transport network element controlled by the source network. Its length can be 4, 6, 16, or 20 bytes long. The NEA Sub TLV is TLV Type 1.",
      "zh-CHS": "NEA子TLV：源网元地址是由源网络控制的传输网元的地址。其长度可以是4、6、16或20字节。NEA子TLV为TLV类型1。"
    },
    {
      "indent": 3,
      "text": "Local Identifier: A 64-bit identifier that remains constant over the life of the call.",
      "zh-CHS": "本地标识符：一个64位的标识符，在整个调用过程中保持不变。"
    },
    {
      "indent": 3,
      "text": "The format of the globally unique (GU) Call ID TLV:",
      "zh-CHS": "全局唯一（GU）调用ID TLV的格式："
    },
    {
      "indent": 7,
      "text": "0 1 2 3",
      "zh-CHS": "0 1 2 3"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F|GU Call ID (0x0832)        |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Reserved      |                    IS                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             NS                                |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   NE Address (NEA Sub TLV)                    |\n~                                                               ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Local Identifier                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Local Identifier (continued)                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "International Segment (IS): To be coded according to ITU-T recommendation T.50. The International Segment (IS) field provides a 3 character ISO 3166 Geographic/Political Country Code. The country code is based on the three-character uppercase alphabetic ISO 3166 Country Code (e.g., USA, FRA).",
      "zh-CHS": "国际部分（IS）：根据ITU-T建议T.50进行编码。国际段（IS）字段提供3个字符的ISO 3166地理/政治国家代码。国家/地区代码基于三字符大写字母ISO 3166国家/地区代码（例如，美国、FRA）。"
    },
    {
      "indent": 3,
      "text": "National Segment (NS): The National Segment (NS) field consists of two sub-fields:",
      "zh-CHS": "国家部分（NS）：国家部分（NS）字段由两个子字段组成："
    },
    {
      "indent": 9,
      "text": "- the first subfield contains the ITU Carrier Code - the second subfield contains a Unique Access Point Code.",
      "zh-CHS": "- 第一个子字段包含ITU载波代码-第二个子字段包含唯一的接入点代码。"
    },
    {
      "indent": 6,
      "text": "The ITU Carrier Code is a code assigned to a network operator/service provider, maintained by the ITU-T Telecommunication Service Bureauin association with Recommendation M.1400. This code consists of 1-6 left-justified alphabetic, or leading alphabetic followed by numeric, characters (bytes). If the code is less than 6 characters (bytes), it is padded with a trailing NULL to fill the subfield.",
      "zh-CHS": "ITU载波代码是分配给网络运营商/服务提供商的代码，由ITU-T电信服务局根据建议M.1400维护。此代码由1-6个左对齐字母或前导字母后跟数字字符（字节）组成。如果代码少于6个字符（字节），则用尾随NULL填充子字段。"
    },
    {
      "indent": 6,
      "text": "The Unique Access Point Code is a matter for the organization to which the country code and ITU carrier code have been assigned, provided that uniqueness is guaranteed. This code consists of 1-6 characters (bytes), trailing NULL, completing the 12-character National Segment. If the code is less than 6 characters, it is padded by a trailing NULL to fill the subfield.",
      "zh-CHS": "唯一接入点代码由国家代码和国际电联载波代码分配给的组织负责，前提是保证唯一性。该代码由1-6个字符（字节）组成，尾随NULL，完成12个字符的国家段。如果代码少于6个字符，则用尾随NULL填充子字段。"
    },
    {
      "indent": 3,
      "text": "Format of the National Segment",
      "zh-CHS": "国家部分的格式"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       ITU carrier code                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| ITU carrie dode (cont)        |  Unique access point code     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               Unique access point code (continued)            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.1.1 Call ID Procedure",
      "section_title": true,
      "zh-CHS": "4.1.1 呼叫识别程序"
    },
    {
      "indent": 3,
      "text": "The following processing rules are applicable to the CALL ID TLV:",
      "zh-CHS": "以下处理规则适用于呼叫ID TLV："
    },
    {
      "indent": 3,
      "text": "- For initial calls, the calling/originating party call controller must set the CALL ID values to all-zeros.",
      "zh-CHS": "- 对于初始呼叫，呼叫方/发起方呼叫控制器必须将呼叫ID值设置为全零。"
    },
    {
      "indent": 3,
      "text": "- For a new call request, the source networks call controller (SNCC) sets the appropriate type and value for the CALL ID. - For an existing call (in case Call ID is non zero) the SNCC verifies existence of the call. - Intermediate nodes are not allowed to alter the Call ID TLV set by the ingress node. - The destination user/client receiving the request uses the CALL ID values as a reference to the requested call between the source user and itself. Subsequent actions related to the call uses the CALL ID as the reference identifier.",
      "zh-CHS": "- 对于新的呼叫请求，源网络呼叫控制器（SNCC）为呼叫ID设置适当的类型和值。-对于现有呼叫（如果呼叫ID非零），SNCC验证呼叫的存在。-中间节点不允许更改入口节点设置的调用ID TLV。-接收请求的目标用户/客户端使用调用ID值作为源用户和自身之间请求调用的引用。与调用相关的后续操作使用调用ID作为引用标识符。"
    },
    {
      "indent": 0,
      "text": "4.2 Call Capability TLV",
      "section_title": true,
      "zh-CHS": "4.2 呼叫能力"
    },
    {
      "indent": 3,
      "text": "The format of the Call Capability TLV is:",
      "zh-CHS": "呼叫能力TLV的格式为："
    },
    {
      "indent": 7,
      "text": "0 1 2 3",
      "zh-CHS": "0 1 2 3"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F| Call Capabaility(0x0833)  |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Call Capability                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The Call Capability TLV contains a 4 byte Call Capability field. The Call Capability Field is used to explicitly indicate the configuration potentiality of the call.",
      "zh-CHS": "呼叫能力TLV包含一个4字节的呼叫能力字段。Call Capability字段用于明确指示调用的配置潜力。"
    },
    {
      "indent": 3,
      "text": "An example of values of the Call Capability field is:",
      "zh-CHS": "呼叫能力字段的值示例如下："
    },
    {
      "indent": 6,
      "text": "0x0000 Point to Point call",
      "zh-CHS": "0x0000点对点呼叫"
    },
    {
      "indent": 0,
      "text": "4.3 Crankback TLV",
      "section_title": true,
      "zh-CHS": "4.3 回转式TLV"
    },
    {
      "indent": 3,
      "text": "Crankback requires that when the Label Request message is blocked at a particular node due to unavailable resources, the node will inform the initiator of the Label Request message of the location of the blockage. The initiator can then re-compute new explicit routes that avoid the area where resource shortage is detected. A new Label Request message is sent that includes the new route.",
      "zh-CHS": "回退要求当标签请求消息因资源不可用而在特定节点被阻止时，该节点将通知标签请求消息的发起方阻塞的位置。然后，启动器可以重新计算新的显式路由，以避免检测到资源短缺的区域。发送包含新路由的新标签请求消息。"
    },
    {
      "indent": 3,
      "text": "The support of crankback in CR-LDP is facilitated by the introduction of a Crankback TLV. An LDP Notification message is used to inform the Label Request message initiator of the blocking condition. The Notification message includes the Crankback TLV that indicates the location of resource shortage. The location of the resource shortage is identified using the ER-HOP TLV. The encoding of the Crankback TLV is:",
      "zh-CHS": "CR-LDP中的回退支持通过引入回退TLV来实现。LDP通知消息用于通知标签请求消息发起方阻塞条件。通知消息包括指示资源短缺位置的回退TLV。使用ER-HOP TLV识别资源短缺的位置。回退TLV的编码为："
    },
    {
      "indent": 7,
      "text": "0 1 2 3",
      "zh-CHS": "0 1 2 3"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F| Crankback(0x0834)         |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                       ER-HOP TLV                              ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The ER-HOP TLV is specified in rfc3212 [3], and consists of an n x 4 bytes field, it could e.g. contain an IPv4 or an IPv6 address.",
      "zh-CHS": "ER-HOP TLV在rfc3212[3]中指定，由一个n x 4字节的字段组成，例如，它可以包含IPv4或IPv6地址。"
    },
    {
      "indent": 0,
      "text": "5. Additional Error Codes",
      "section_title": true,
      "zh-CHS": "5. 附加错误代码"
    },
    {
      "indent": 3,
      "text": "G.7713 includes a number of error codes that are currently not defined in earlier CR-LDP related RFCs. The list of those error conditions is given below:",
      "zh-CHS": "G.7713包括许多目前在早期CR-LDP相关RFC中未定义的错误代码。这些错误条件的列表如下所示："
    },
    {
      "indent": 6,
      "text": "Invalid SNP ID (0x04000009) Calling Party busy (0x0400000a) Unavailable SNP ID (0x0400000b) Invalid SNPP ID (0x0400000c) Unavailable SNPP ID (0x0400000d)",
      "zh-CHS": "无效SNP ID（0x0400009）主叫方忙（0x040000A）不可用SNP ID（0x040000B）无效SNPP ID（0x040000C）不可用SNPP ID（0x040000D）"
    },
    {
      "indent": 6,
      "text": "Failed to create SNC (0x0400000e) Failed to establish LC (0x040000f) Invalid Source End-User Name (0x04000010) Invalid Destination End-User Name (0x04000011) Invalid CoS (0x04000012) Unavailable CoS (0x04000013) Invalid GoS (0x04000014) Unavailable GoS (0x04000015) Failed Security Check (0x04000016) TimeOut (0x04000017) Invalid Call Name (0x04000018) Failed to Release SNC (0x04000019) Failed to Free LC (0x0400001a)",
      "zh-CHS": "无法创建SNC（0x040000E）无法建立LC（0x040000f）无效的源最终用户名（0x0400010）无效的目标最终用户名（0x0400011）无效的CoS（0x0400012）不可用的CoS（0x0400013）无效的GoS（0x0400014）不可用的GoS（0x0400015）安全检查失败（0x0400016）超时（0x0400017）无效的呼叫名称（0x0400018）未能释放SNC（0x0400019）未能释放LC（0x040001A）"
    },
    {
      "indent": 3,
      "text": "Acronyms used in above error codes:",
      "zh-CHS": "上述错误代码中使用的首字母缩略词："
    },
    {
      "indent": 6,
      "text": "SNP Sub-network Point SNPP Sub-network Point Pool SNC Sub-network Connection LC Link Connection CoS Class of Service GoS Grade of Service",
      "zh-CHS": "SNP子网点SNPP子网点池SNC子网连接LC链路连接CoS服务等级GoS服务等级"
    },
    {
      "indent": 0,
      "text": "6. IANA Consideration",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document uses the LDP RFC 3036 [4] name spaces; see http://www.iana.org/assignments/ldp-namespaces.",
      "zh-CHS": "本文件使用LDP RFC 3036[4]名称空间；看见http://www.iana.org/assignments/ldp-namespaces."
    },
    {
      "indent": 6,
      "text": "Call Setup (0x0500) Call Release (0x0501)",
      "zh-CHS": "呼叫设置（0x0500）呼叫释放（0x0501）"
    },
    {
      "indent": 3,
      "text": "The assignment for the following TLVs:",
      "zh-CHS": "以下TLV的分配："
    },
    {
      "indent": 6,
      "text": "Op-Sp Call ID TLV (0x0831) GU Call ID TLV (0x0832) Call Capability TLV (0x0833) Crankback TLV (0x0834)",
      "zh-CHS": "Op Sp呼叫ID TLV（0x0831）GU呼叫ID TLV（0x0832）呼叫能力TLV（0x0833）回退TLV（0x0834）"
    },
    {
      "indent": 3,
      "text": "The assignment for the new error codes as listed in section 5 of this document.",
      "zh-CHS": "本文件第5节中列出的新错误代码的分配。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "zh-CHS": "9. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not introduce any new security concerns other than those defined in RFC 3036 and RFC 3212.",
      "zh-CHS": "除RFC 3036和RFC 3212中定义的安全问题外，本文件不引入任何新的安全问题。"
    },
    {
      "indent": 3,
      "text": "Security aspects (if any) w.r.t. the G.8080 and G.7713 documents need to be addressed in those documents.",
      "zh-CHS": "安全方面（如有）w.r.t.需要在这些文件中说明G.8080和G.7713文件。"
    },
    {
      "indent": 0,
      "text": "10. Normative References",
      "section_title": true,
      "zh-CHS": "10. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Architecture for Automatically Switched Optical Network (ASON), ITU-T recommendation G.8080, Nov. 2001",
      "zh-CHS": "[1] 自动交换光网络（ASON）体系结构，ITU-T建议G.8080，2001年11月"
    },
    {
      "indent": 3,
      "text": "[2] Distributed Call and Connection Management (DCM), ITU-T recommendation G.7713, Dec. 2001",
      "zh-CHS": "[2] 分布式呼叫和连接管理（DCM），ITU-T建议G.77132001年12月"
    },
    {
      "indent": 3,
      "text": "[3] Jamoussi, B., Ed., Andersson, L., Callon, R., Dantu, R., Wu, L., Doolan, P., Worster, T., Feldman, N., Fredette, A., Girish, M., Gray, E., Heinanen, J., Kilty, T. and A. Malis, \"Constraint-Based LSP Setup using LDP\", RFC 3212, January 2002.",
      "zh-CHS": "[3] Jamoussi，B.，Ed.，Andersson，L.，Callon，R.，Dantu，R.，Wu，L.，Doolan，P.，Worster，T.，Feldman，N.，Fredette，A.，Girish，M.，Gray，E.，Heinanen，J.，Kilty，T.和A.Malis，“使用LDP的基于约束的LSP设置”，RFC 32122002年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Andersson, L., Doolan, P., Feldman, N., Fredette, A. and B. Thomas, \"LDP Specifications\", RFC 3036, January 2001.",
      "zh-CHS": "[4] Andersson，L.，Doolan，P.，Feldman，N.，Fredette，A.和B.Thomas，“LDP规范”，RFC 3036，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[5] Ashwood-Smith, P. and L. Berger, (Editors),\"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Constraint-based Routed Label Distribution Protocol (CR-LDP) Extensions\", RFC 3472, January 2003.",
      "zh-CHS": "[5] Ashwood Smith，P.和L.Berger，（编辑），“通用多协议标签交换（GMPLS）基于信令约束的路由标签分发协议（CR-LDP）扩展”，RFC 3472，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[6] UNI 1.0 Signaling Specification, The Optical Internetworking\n    Forum, http://www.oiforum.com/public/UNI_1.0_ia.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[7] Rajagopalan, B., \"Label Distribution Protocol (LDP) and Resource ReserVation Protocol (RSVP) Extensions for Optical UNI Signaling\", RFC 3476, March 2003.",
      "zh-CHS": "[7] Rajagopalan，B.，“用于光UNI信令的标签分配协议（LDP）和资源预留协议（RSVP）扩展”，RFC 3476，2003年3月。"
    },
    {
      "indent": 3,
      "text": "[8] Distributed Call and Connection Management signalling using GMPLS CR-LDP, ITU G.7713.3, Januray 2003.",
      "zh-CHS": "[8] 使用GMPLS CR-LDP的分布式呼叫和连接管理信令，ITU G.7713.3，2003年1月。"
    },
    {
      "indent": 0,
      "text": "11. Intellectual Property",
      "section_title": true,
      "zh-CHS": "11. 知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in RFC 2028. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何努力来确定任何此类权利。有关IETF在标准跟踪和标准相关文件中权利的程序信息，请参见RFC 2028。可从IETF秘书处获得可供发布的权利声明副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涉及实施本标准所需技术的专有权利。请将信息发送给IETF执行董事。"
    },
    {
      "indent": 0,
      "text": "12. Author's Addresses",
      "section_title": true,
      "zh-CHS": "12. 作者地址"
    },
    {
      "indent": 3,
      "text": "Osama Aboul-Magd Nortel Networks P.O. Box 3511, Station C Ottawa, Ontario, Canada K1Y 4H7 Phone: 613-599-9104 EMail: osama@nortelnetworks.com",
      "zh-CHS": "Osama Aboul Magd Nortel Networks加拿大安大略省渥太华C站3511信箱K1Y 4H7电话：613-599-9104电子邮件：osama@nortelnetworks.com"
    },
    {
      "indent": 0,
      "text": "13. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "13. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}