{
  "title": {
    "text": "RFC 3825:  Dynamic Host Configuration Protocol Option for Coordinate-based Location Configuration Information ",
    "zh-CHS": "RFC 3825"
  },
  "number": 3825,
  "created_at": "2021-11-18 05:15:37.725006+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            J. Polk\nRequest for Comments: 3825                                 J. Schnizlein\nCategory: Standards Track                                     M. Linsner\n                                                           Cisco Systems\n                                                               July 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": " Dynamic Host Configuration Protocol Option for Coordinate-based Location Configuration Information",
      "zh-CHS": "用于基于坐标的位置配置信息的动态主机配置协议选项"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document specifies a Dynamic Host Configuration Protocol Option for the coordinate-based geographic location of the client. The Location Configuration Information (LCI) includes latitude, longitude, and altitude, with resolution indicators for each. The reference datum for these values is also included.",
      "zh-CHS": "本文档为客户机基于坐标的地理位置指定了动态主机配置协议选项。位置配置信息（LCI）包括纬度、经度和高度，每个都有分辨率指示器。还包括这些值的参考基准。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n    1.1.  Conventions  . . . . . . . . . . . . . . . . . . . . . .  3\n    1.2.  Motivation . . . . . . . . . . . . . . . . . . . . . . .  3\n    1.3.  Rationale  . . . . . . . . . . . . . . . . . . . . . . .  4\n2.  Location Configuration Information (LCI) Elements. . . . . . .  4\n    2.1.  Elements of the Location Configuration Information . . .  5\n3.  Security Considerations. . . . . . . . . . . . . . . . . . . .  8\n4.  IANA Considerations. . . . . . . . . . . . . . . . . . . . . .  8\n5.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  9\nAppendix Calculations of Imprecision possible with the DHC LCI . . 10\n    A.1.  LCI of \"White House\" (Example 1) . . . . . . . . . . . . 10\n    A.2.  LCI of \"Sears Tower\" (Example 2) . . . . . . . . . . . . 12\n6.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n    6.1.  Normative References . . . . . . . . . . . . . . . . . . 13\n    6.2.  Informational References . . . . . . . . . . . . . . . . 14\n7.  Author Information . . . . . . . . . . . . . . . . . . . . . . 14\n8.  Full Copyright Statement . . . . . . . . . . . . . . . . . . . 15",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document specifies a Dynamic Host Configuration Protocol [1] Option for the coordinate-based geographic location of the client, to be provided by the server.",
      "zh-CHS": "本文档为服务器提供的基于坐标的客户端地理位置指定了动态主机配置协议[1]选项。"
    },
    {
      "indent": 3,
      "text": "The DHCP server is assumed to have determined the location from the Circuit-ID Relay Agent Information Option (RAIO) defined (as SubOpt 1) in [2]. In order to translate the circuit (switch port identifier) into a location, the DHCP server is assumed to have access to a service that maps from circuit-ID to the location at which the circuit connected to that port terminates in the building, for example, the location of the wall jack.",
      "zh-CHS": "假设DHCP服务器已根据[2]中定义的电路ID中继代理信息选项（RAIO）（作为子选项1）确定位置。为了将电路（交换机端口标识符）转换为位置，假设DHCP服务器可以访问从电路ID映射到连接到该端口的电路在建筑物中终止的位置的服务，例如，墙壁插孔的位置。"
    },
    {
      "indent": 3,
      "text": "An important feature of this specification is that after the relevant DHC exchanges have taken place, the location information is stored on the end device rather than somewhere else, where retrieving it might be difficult in practice.",
      "zh-CHS": "本规范的一个重要特征是，在相关的DHC交换发生后，位置信息存储在终端设备上，而不是存储在其他地方，在实践中检索位置信息可能很困难。"
    },
    {
      "indent": 3,
      "text": "Another important feature of this LCI is its inclusion of a resolution parameter for each of the dimensions of location. Because this resolution parameter need not apply to all dimensions equally, a resolution value is included for each of the 3 location elements.",
      "zh-CHS": "此LCI的另一个重要特征是，它包含了位置的每个维度的分辨率参数。由于此分辨率参数不必平等地应用于所有标注，因此3个位置元素中的每个元素都包含一个分辨率值。"
    },
    {
      "indent": 3,
      "text": "Resolution does not define Geographic Privacy policy.",
      "zh-CHS": "决议未定义地理隐私政策。"
    },
    {
      "indent": 3,
      "text": "The resulting location information using this resolution method is a small fixed length Configuration Information that can be easily carried in protocols, such as DHCP, which have limited packet size because this LCI is only 18 bytes long.",
      "zh-CHS": "使用此解析方法得到的位置信息是一个小的固定长度配置信息，可以很容易地在协议（如DHCP）中携带，因为此LCI只有18字节长，因此DHCP具有有限的数据包大小。"
    },
    {
      "indent": 3,
      "text": "Finally, the appendix of this document provides some arithmetic examples of the implication of different resolution values on the La/Lo/Alt.",
      "zh-CHS": "最后，本文件附录提供了不同分辨率值对La/Lo/Alt影响的一些算术示例。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions used in this document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [3].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[3]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "1.2. Motivation",
      "section_title": true,
      "zh-CHS": "1.2. 动机"
    },
    {
      "indent": 3,
      "text": "As applications such as IP Telephony are replacing conventional telephony, users are expecting the same (or greater) level of services with the new technology. One service offered by conventional telephony that is missing in any standardized fashion within IP Telephony is for a user to be automatically located by emergency responders, in a timely fashion, when the user summons help (by dialing 911 in North America, for example). Unless strict administrative rules are followed, the mobility of a wired Ethernet device within a campus negates any opportunity for an emergency responder to locate the device with any degree of expediency. Users do not want to give up the mobility IP Telephony offers. Informing the host device of its geo-location at host configuration time will allow the device to utilize this geo-location information to inform others of its current geo-location, if the user and/or application so desires.",
      "zh-CHS": "随着IP电话等应用正在取代传统电话，用户期望新技术提供相同（或更高）级别的服务。传统电话提供的一项服务在IP电话中以任何标准化方式缺失，即当用户呼叫帮助时（例如，在北美拨打911），紧急响应者可以及时自动定位用户。除非遵守严格的管理规则，否则校园内有线以太网设备的移动性将使应急响应人员无法以任何程度的便利找到该设备。用户不想放弃移动IP电话服务。如果用户和/或应用程序希望，在主机配置时通知主机设备其地理位置将允许设备利用此地理位置信息通知其他人其当前地理位置。"
    },
    {
      "indent": 3,
      "text": "The goal of this option is to enable a wired Ethernet host to obtain its location, which it could provide to an emergency responder, as one example.",
      "zh-CHS": "该选项的目标是使有线以太网主机能够获取其位置，例如，它可以向紧急响应者提供该位置。"
    },
    {
      "indent": 3,
      "text": "Wireless hosts can utilize this option to gain knowledge of the location of the radio access point used during host configuration, but would need some more exotic mechanisms, maybe GPS, or maybe a future DHCP option, which includes a list of geo-locations like that defined here, containing the locations of the radio access points that are close to the client.",
      "zh-CHS": "无线主机可以利用此选项了解主机配置期间使用的无线接入点的位置，但需要一些更奇特的机制，可能是GPS，也可能是未来的DHCP选项，其中包括此处定义的地理位置列表，包含靠近客户端的无线电接入点的位置。"
    },
    {
      "indent": 0,
      "text": "1.3. Rationale",
      "section_title": true,
      "zh-CHS": "1.3. 根本原因"
    },
    {
      "indent": 3,
      "text": "Within the LCI described here, Latitude and Longitude are represented in fixed-point 2s-complement binary degrees, for the economy of a smaller option size compared to a string encoding of digits in [7]. The integer parts of these fields are 9 bits long to accommodate +/- 180 degrees. The fractional part is 25 bits long, better than the precision of 7 decimal digits. The length of each field is 40 bits, 34 of which is the sum of the integer (9) and fractional (25) bits, plus 6 bits of resolution.",
      "zh-CHS": "在本文所述的LCI中，纬度和经度以定点2s补码二进制度数表示，与[7]中的数字字符串编码相比，选项尺寸更小。这些字段的整数部分长度为9位，以适应+/-180度。小数部分长度为25位，优于7位小数的精度。每个字段的长度为40位，其中34位是整数（9）和小数（25）位加上6位分辨率的总和。"
    },
    {
      "indent": 3,
      "text": "Altitude is determined by the Altitude Type (AT) indicated by the AT field, which is 4 bits long. Two Altitude Types are defined here, meters (code=1) and floors (code=2), both of which are 2s-complement fixed-point with 22 bits of integer part and 8 bits of fractional part. Additional Altitude Types MAY be assigned by IANA. The \"floors\" Altitude Type is provided because altitude in meters may not be known within a building, and a floor indication may be more useful.",
      "zh-CHS": "高度由AT字段指示的高度类型（AT）确定，长度为4位。这里定义了两种高度类型，米（代码=1）和楼层（代码=2），这两种高度类型都是2s补定点，整数部分22位，小数部分8位。IANA可指定其他高度类型。提供“楼层”高度类型是因为建筑物内可能不知道以米为单位的高度，楼层指示可能更有用。"
    },
    {
      "indent": 3,
      "text": "GPS systems today can use WGS84 for horizontal and vertical datums; [6] defines WGS84 as a three-dimensional datum. For other datum values that do not include a vertical component, both the horizontal and vertical datum of reference will be specified in the IANA record.",
      "zh-CHS": "今天的GPS系统可以将WGS84用于水平和垂直基准；[6] 将WGS84定义为三维基准。对于不包括垂直分量的其他基准值，IANA记录中将规定参考的水平基准和垂直基准。"
    },
    {
      "indent": 3,
      "text": "Each of these 3 elements begins with an accuracy sub-field of 6 bits, indicating the number of bits of resolution. This resolution sub-field accommodates the desire to easily adjust the precision of a reported location. Contents beyond the claimed resolution MAY be randomized to obscure greater precision that might be available.",
      "zh-CHS": "这3个元素中的每一个都以6位的精度子字段开始，表示分辨率的位数。此分辨率子字段满足轻松调整报告位置精度的要求。超出要求的分辨率的内容可能会随机化，以模糊可能可用的更高精度。"
    },
    {
      "indent": 0,
      "text": "2. DHC Location Configuration Information Elements",
      "section_title": true,
      "zh-CHS": "2. DHC位置配置信息元素"
    },
    {
      "indent": 3,
      "text": "DHCP is a binary Protocol; using protocols of LCI are likely to be text based. Since most coordinate systems translate easily between binary-based and text-based location output (even emergency services within the US), translation/conversion is a non-issue with DHCP's binary format.",
      "zh-CHS": "DHCP是一种二进制协议；使用LCI的协议可能是基于文本的。由于大多数坐标系在基于二进制和基于文本的位置输出（甚至在美国的紧急服务）之间很容易转换，因此转换/转换对于DHCP的二进制格式来说不是问题。"
    },
    {
      "indent": 3,
      "text": "This binary format provides a fortunate benefit in a mechanism for making a true/correct location coordinate imprecise. It further provides the capability to have this binary representation be deterministically imprecise.",
      "zh-CHS": "这种二进制格式在使真实/正确位置坐标不精确的机制中提供了一个幸运的好处。它还提供了使这种二进制表示具有确定性不精确性的能力。"
    },
    {
      "indent": 3,
      "text": "The LCI format is as follows:",
      "zh-CHS": "LCI格式如下所示："
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Code 123    |      16       |   LaRes   |     Latitude      +\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                Latitude (cont'd)              |    LoRes  |   +\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             Longitude                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   AT  |   AltRes  |                Altitude                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Alt (cont'd) |     Datum     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.1. Elements of the Location Configuration Information",
      "section_title": true,
      "zh-CHS": "2.1. 位置配置信息的元素"
    },
    {
      "indent": 3,
      "text": "Code 123: The code for this DHCP option.",
      "zh-CHS": "代码123：此DHCP选项的代码。"
    },
    {
      "indent": 3,
      "text": "16: The length of this option is 16 bytes.",
      "zh-CHS": "16：此选项的长度为16字节。"
    },
    {
      "indent": 3,
      "text": "LaRes: Latitude resolution. 6 bits indicating the number of valid bits in the fixed-point value of Latitude.",
      "zh-CHS": "LaRes：纬度分辨率。6位，表示纬度定点值中的有效位数。"
    },
    {
      "indent": 3,
      "text": "This value is the number of high-order Latitude bits that should be considered valid. Any bits entered to the right of this limit should not be considered valid and might be purposely false, or zeroed by the sender.",
      "zh-CHS": "此值是应视为有效的高阶纬度位数。输入到此限制右侧的任何位都不应被视为有效位，并且可能是故意为假的，或是发送方将其归零。"
    },
    {
      "indent": 3,
      "text": "The examples in the appendix illustrate that a smaller value in the resolution field increases the area within which the device is located.",
      "zh-CHS": "附录中的示例说明，分辨率字段中的较小值会增加设备所在的区域。"
    },
    {
      "indent": 3,
      "text": "LaRes does not define Geographic Privacy policy.",
      "zh-CHS": "LaRes没有定义地理隐私政策。"
    },
    {
      "indent": 14,
      "text": "Values above decimal 34 are undefined and reserved.",
      "zh-CHS": "小数点34以上的值未定义且保留。"
    },
    {
      "indent": 3,
      "text": "Latitude: a 34 bit fixed point value consisting of 9 bits of integer and 25 bits of fraction. Latitude SHOULD be normalized to within +/- 90 degrees. Positive numbers are north of the equator and negative numbers are south of the equator.",
      "zh-CHS": "纬度：由9位整数和25位小数组成的34位定点值。纬度应标准化为+/-90度。正数在赤道以北，负数在赤道以南。"
    },
    {
      "indent": 3,
      "text": "A value of 2 in the LaRes field indicates a precision of no greater than 1/6th that of the globe (in the first example of the appendix). A value of 34 in the LaRes field indicates a precision of about 3.11 mm in Latitude at the equator.",
      "zh-CHS": "LaRes字段中的值为2表示精度不大于地球仪的1/6（在附录的第一个示例中）。LaRes字段中的值为34表示赤道纬度的精度约为3.11 mm。"
    },
    {
      "indent": 3,
      "text": "LoRes: Longitude resolution. 6 bits indicating the number of valid bits in the fixed-point value of Longitude.",
      "zh-CHS": "知识：经度分辨率。6位，表示经度定点值中的有效位数。"
    },
    {
      "indent": 3,
      "text": "This value is the number of high-order Longitude bits that should be considered valid. Any bits entered to the right of this limit should not be considered valid and might be purposely false, or zeroed by the sender.",
      "zh-CHS": "此值是应被视为有效的高阶经度位数。输入到此限制右侧的任何位都不应被视为有效位，并且可能是故意为假的，或是发送方将其归零。"
    },
    {
      "indent": 3,
      "text": "LoRes does not define Geographic Privacy policy.",
      "zh-CHS": "LoRes没有定义地理隐私政策。"
    },
    {
      "indent": 14,
      "text": "Values above decimal 34 are undefined and reserved.",
      "zh-CHS": "小数点34以上的值未定义且保留。"
    },
    {
      "indent": 3,
      "text": "Longitude: a 34 bit fixed point value consisting of 9 bits of integer and 25 bits of fraction. Longitude SHOULD be normalized to within +/- 180 degrees. Positive values are East of the prime meridian and negative (2s complement) numbers are West of the prime meridian.",
      "zh-CHS": "经度：由9位整数和25位小数组成的34位定点值。经度应标准化为+/-180度。正值位于本初子午线以东，负值（2s补码）位于本初子午线以西。"
    },
    {
      "indent": 3,
      "text": "A value of 2 in the LoRes field indicates precision of no greater than 1/6th that of the globe (see first example of the appendix). A value of 34 in the LoRes field indicates a precision of about 2.42 mm in longitude (at the equator). Because lines of longitude converge at the poles, the distance is smaller (better precision) for locations away from the equator.",
      "zh-CHS": "LoRes字段中的值为2表示精度不超过地球仪精度的1/6（参见附录的第一个示例）。LoRes字段中的值为34表示经度精度约为2.42 mm（在赤道处）。因为经线在两极会聚，所以远离赤道的位置距离更小（精度更好）。"
    },
    {
      "indent": 3,
      "text": "Altitude: A 30 bit value defined by the AT field",
      "zh-CHS": "高度：由AT字段定义的30位值"
    },
    {
      "indent": 3,
      "text": "AltRes: Altitude resolution. 6 bits indicating the number of valid bits in the altitude. Values above 30 (decimal) are undefined and reserved.",
      "zh-CHS": "高度分辨率。6位，表示高度中的有效位数。大于30（十进制）的值是未定义和保留的。"
    },
    {
      "indent": 3,
      "text": "AltRes does not define Geographic Privacy policy.",
      "zh-CHS": "AltRes未定义地理隐私政策。"
    },
    {
      "indent": 3,
      "text": "AT: Altitude Type for altitude. Codes defined are:",
      "zh-CHS": "AT：高度的高度类型。定义的代码是："
    },
    {
      "indent": 3,
      "text": "1: Meters - in 2s-complement fixed-point 22-bit integer part with 8- bit fraction",
      "zh-CHS": "1:Meters-in 2s用8位小数对定点22位整数部分进行补码"
    },
    {
      "indent": 3,
      "text": "If AT = 1, an AltRes value 0.0 would indicate unknown altitude. The most precise Altitude would have an AltRes value of 30. Many values of AltRes would obscure any variation due to vertical datum differences.",
      "zh-CHS": "如果AT=1，AltRes值0.0表示未知高度。最精确的高度将具有30的AltRes值。许多AltRes值会掩盖由于垂直基准差异引起的任何变化。"
    },
    {
      "indent": 3,
      "text": "2: Floors - in 2s-complement fixed-point 22-bit integer part with 8-bit fraction",
      "zh-CHS": "2：楼层-2秒内用8位分数补全定点22位整数部分"
    },
    {
      "indent": 3,
      "text": "AT = 2 for Floors enables representing altitude in a form more relevant in buildings which have different floor-to-floor dimensions. An altitude coded as AT = 2, AltRes = 30, and Altitude = 0.0 is meaningful even outside a building, and represents ground level at the given latitude and longitude. Inside a building, 0.0 represents the floor level associated with ground level at the main entrance. This document defines a number; one must arrive at the number by counting floors from the floor defined to be 0.0.",
      "zh-CHS": "对于楼层，AT=2可以在具有不同楼层间尺寸的建筑中以更相关的形式表示高度。编码为AT=2、AltRes=30和altitude=0.0的高度即使在建筑物外也有意义，表示给定纬度和经度的地面标高。在建筑内部，0.0表示与主入口地面标高关联的楼层标高。本文件定义了一个编号；必须从定义为0.0的楼层开始计算楼层数。"
    },
    {
      "indent": 3,
      "text": "The values represented by this AT will be of local significance. Since buildings and floors can vary due to lack of common control, the values chosen to represent the characteristics of an individual building will be derived and agreed upon by the operator of the building and the intended users of the data. Attempting to standardize this type of function is beyond the scope this document.",
      "zh-CHS": "此AT表示的值将具有本地意义。由于缺乏共同控制，建筑物和楼层可能会发生变化，因此选择用于表示单个建筑物特征的值将由建筑物的运营商和数据的预期用户推导并商定。试图标准化此类功能超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "Sub-floors can be represented by non-integer values. Example: a mezzanine between floor 1 and floor 2 could be represented as a value = 1.1. Example: (2) mezzanines between floor 4 and floor 5 could be represented as values = 4.1 and 4.2 respectively.",
      "zh-CHS": "子楼层可以由非整数值表示。示例：楼层1和楼层2之间的夹层可以表示为值=1.1。示例：（2）楼层4和楼层5之间的夹层可分别表示为值=4.1和4.2。"
    },
    {
      "indent": 3,
      "text": "Floors located below ground level could be represented by negative values.",
      "zh-CHS": "位于地面以下的楼层可以用负值表示。"
    },
    {
      "indent": 3,
      "text": "Larger values represent floors that are above (higher in altitude) floors with lower values.",
      "zh-CHS": "较大的值表示位于具有较低值的楼层上方（海拔较高）的楼层。"
    },
    {
      "indent": 3,
      "text": "The AltRes field SHOULD be set to maximum precision when AT = 2 (floors) when a floor value is included in the DHCP Reply, or the AT = 0 to denote the floor isn't known.",
      "zh-CHS": "当DHCP应答中包含楼层值时，当AT=2（楼层）或AT=0表示楼层未知时，应将AltRes字段设置为最大精度。"
    },
    {
      "indent": 3,
      "text": "Any additional LCI Altitude Types(s) to be defined for use via this DHC Option MUST be done through a Standards Track RFC.",
      "zh-CHS": "通过DHC选项定义的任何其他LCI高度类型必须通过标准航迹RFC完成。"
    },
    {
      "indent": 3,
      "text": "Datum: The Map Datum used for the coordinates given in this Option",
      "zh-CHS": "基准：用于此选项中给定坐标的地图基准"
    },
    {
      "indent": 3,
      "text": "The datum must include both a horizontal and a vertical reference. Since the WGS 84 reference datum is three-dimensional, it includes both. For any additional datum parameters, the datum codepoint must specify both horizontal datum and vertical datum references.",
      "zh-CHS": "基准必须包括水平基准和垂直基准。由于WGS 84参考基准是三维的，因此它包括两个方面。对于任何其他基准参数，基准代码点必须同时指定水平基准和垂直基准参考。"
    },
    {
      "indent": 3,
      "text": "The Datum byte has 256 possibilities, of which 3 have been registered with IANA by this document (all derived from specification in [5]):",
      "zh-CHS": "基准字节有256种可能性，其中3种已通过本文件向IANA注册（均源自[5]中的规范）："
    },
    {
      "indent": 6,
      "text": "1: WGS 84 (Geographical 3D) - World Geodesic System 1984, CRS Code 4327, Prime Meridian Name: Greenwich",
      "zh-CHS": "1:WGS 84（地理3D）-1984年世界测地系统，CRS代码4327，本初子午线名称：格林威治"
    },
    {
      "indent": 6,
      "text": "2: NAD83 - North American Datum 1983, CRS Code 4269, Prime Meridian Name: Greenwich; The associated vertical datum is the North American Vertical Datum of 1988 (NAVD88)",
      "zh-CHS": "2:NAD83-北美基准面1983，CRS代码4269，本初子午线名称：格林威治；相关垂直基准为1988年北美垂直基准（NAVD88）"
    },
    {
      "indent": 17,
      "text": "This datum pair is to be used when referencing locations on land, not near tidal water (which would use Datum = 3 below)",
      "zh-CHS": "该基准对用于参考陆地上的位置，而不是靠近潮水的位置（将使用下面的基准=3）"
    },
    {
      "indent": 6,
      "text": "3: NAD83 - North American Datum 1983, CRS Code 4269, Prime Meridian Name: Greenwich; The associated vertical datum is Mean Lower Low Water (MLLW)",
      "zh-CHS": "3:NAD83-北美基准面1983，CRS代码4269，本初子午线名称：格林威治；相关垂直基准为平均低水位（MLLW）"
    },
    {
      "indent": 17,
      "text": "This datum pair is to be used when referencing locations on water/sea/ocean",
      "zh-CHS": "当参考水/海/海洋上的位置时，将使用该基准对"
    },
    {
      "indent": 3,
      "text": "Any additional LCI datum(s) to be defined for use via this DHC Option MUST be done through a Standards Track RFC.",
      "zh-CHS": "通过DHC选项定义的任何其他LCI数据必须通过标准轨道RFC完成。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Where critical decisions might be based on the value of this GeoConf option, DHCP authentication in [4] SHOULD be used to protect the integrity of the DHCP options.",
      "zh-CHS": "如果关键决策可能基于此GeoConf选项的值，则应使用[4]中的DHCP身份验证来保护DHCP选项的完整性。"
    },
    {
      "indent": 3,
      "text": "Since there is no privacy protection for DHCP messages, an eavesdropper who can monitor the link between the DHCP server and requesting client can discover this LCI.",
      "zh-CHS": "由于DHCP消息没有隐私保护，可以监视DHCP服务器和请求客户端之间链接的窃听者可以发现此LCI。"
    },
    {
      "indent": 3,
      "text": "To minimize the unintended exposure of location information, the LCI option SHOULD be returned by DHCP servers only when the DHCP client has included this option in its 'parameter request list' (section 3.5 [1]).",
      "zh-CHS": "为了尽量减少位置信息的意外暴露，只有当DHCP客户端在其“参数请求列表”（第3.5[1]节）中包含LCI选项时，DHCP服务器才应返回该选项。"
    },
    {
      "indent": 3,
      "text": "When implementing a DHC server that will serve clients across an uncontrolled network, one should consider the potential security risks.",
      "zh-CHS": "当实现在不受控制的网络上为客户提供服务的蝶翠诗服务器时，应该考虑潜在的安全风险。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a DHCP option code of 123 for the GeoConf option defined in this document.",
      "zh-CHS": "IANA已为本文档中定义的GeoConf选项分配了DHCP选项代码123。"
    },
    {
      "indent": 3,
      "text": "The GeoConf Option defines two fields for which IANA maintains a registry: The Altitude (AT) field (see Section 2) and the Datum field (see Section 2). The datum indicator MUST include specification of both horizontal and vertical datum. New values for the Altitude (AT) field are assigned through \"Standards Action\" [RFC 2434]. The initial values of the Altitude registry are as follows:",
      "zh-CHS": "GeoConf选项定义了IANA维护注册表的两个字段：海拔（AT）字段（见第2节）和基准字段（见第2节）。基准指示器必须包括水平和垂直基准的规格。高度（AT）字段的新值通过“标准操作”[RFC 2434]分配。高度注册表的初始值如下所示："
    },
    {
      "indent": 3,
      "text": "AT = 1 meters of Altitude defined by the vertical datum specified.",
      "zh-CHS": "AT=规定的垂直基准定义的1米高度。"
    },
    {
      "indent": 3,
      "text": "AT = 2 building Floors of Altitude.",
      "zh-CHS": "AT=2层建筑高度。"
    },
    {
      "indent": 3,
      "text": "Datum = 1 denotes the vertical datum WGS 84 as defined by the EPSG as their CRS Code 4327; CRS Code 4327 also specifies WGS 84 as the vertical datum",
      "zh-CHS": "基准=1表示EPSG定义为其CRS代码4327的垂直基准WGS 84；CRS代码4327还规定WGS 84为垂直基准"
    },
    {
      "indent": 3,
      "text": "Datum = 2 denotes the vertical datum NAD83 as defined by the EPSG as their CRS Code 4269; North American Vertical Datum of 1988 (NAVD88) is the associated vertical datum for NAD83",
      "zh-CHS": "基准=2表示EPSG定义为CRS代码4269的垂直基准NAD83；1988年北美垂直基准（NAVD88）是NAD83的相关垂直基准"
    },
    {
      "indent": 3,
      "text": "Datum = 3 denotes the vertical datum NAD83 as defined by the EPSG as their CRS Code 4269; Mean Lower Low Water (MLLW) is the associated vertical datum for NAD83",
      "zh-CHS": "基准=3表示EPSG定义为其CRS代码4269的垂直基准NAD83；平均低水位（MLLW）是NAD83的相关垂直基准"
    },
    {
      "indent": 3,
      "text": "Any additional LCI datum(s) to be defined for use via this DHC Option MUST be done through a Standards Track RFC.",
      "zh-CHS": "通过DHC选项定义的任何其他LCI数据必须通过标准轨道RFC完成。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Patrik Falstrom, Ralph Droms, Ted Hardie, Jon Peterson, and Nadine Abbott for their inputs and constructive comments regarding this document. Additionally, the authors would like to thank Greg Troxel for the education on vertical datums, and to Carl Reed.",
      "zh-CHS": "作者感谢Patrik Falstrom、Ralph Droms、Ted Hardie、Jon Peterson和Nadine Abbott对本文件的投入和建设性意见。此外，作者还要感谢Greg Troxel对垂直基准的教育，以及Carl Reed。"
    },
    {
      "indent": 0,
      "text": "Appendix: Calculations of Imprecision Possible with the DHC LCI",
      "zh-CHS": "附录：DHC LCI可能存在的不精确性计算"
    },
    {
      "indent": 3,
      "text": "The following examples for two different locations demonstrate how the Resolution values for Latitude, Longitude, and Altitude can be used. In both examples the geo-location values were derived from maps using the WGS84 map datum, therefore in these examples, the datum field would have a value = 1 (00000001, or 0x01).",
      "zh-CHS": "以下两个不同位置的示例演示了如何使用纬度、经度和高度的分辨率值。在这两个示例中，地理位置值都是使用WGS84地图基准从地图中得出的，因此在这些示例中，基准字段的值为1（00000001或0x01）。"
    },
    {
      "indent": 0,
      "text": "A.1. Location Configuration Information of \"White House\" (Example 1)",
      "section_title": true,
      "zh-CHS": "A.1. “白宫”的位置配置信息（示例1）"
    },
    {
      "indent": 3,
      "text": "The address was NOT picked for any political reason and can easily be found on the Internet or mapping software, but was picked as an easily identifiable location on our planet.",
      "zh-CHS": "该地址并非出于任何政治原因而选择的，可以在互联网或地图软件上轻松找到，但被选为我们星球上一个易于识别的位置。"
    },
    {
      "indent": 3,
      "text": "Postal Address: White House 1600 Pennsylvania Ave. NW Washington, DC 20006",
      "zh-CHS": "邮政地址：华盛顿特区西北宾夕法尼亚大道1600号白宫20006"
    },
    {
      "indent": 3,
      "text": "Standing on the sidewalk, north side of White House, between driveways.",
      "zh-CHS": "站在白宫北侧车道之间的人行道上。"
    },
    {
      "indent": 6,
      "text": "Latitude 38.89868 degrees North (or +38.89868 degrees)\nUsing 2s complement, 34 bit fixed point, 25 bit fraction\nLatitude = 0x04dcc1fc8,\nLatitude = 0001001101110011000001111111001000",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Longitude 77.03723 degrees West (or -77.03723 degrees)\n   Using 2s complement, 34 bit fixed point, 25 bit fraction\n   Longitude = 0xf65ecf031,\n   Longitude = 1101100101111011001111000000110001",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Altitude 15",
      "zh-CHS": "海拔15"
    },
    {
      "indent": 3,
      "text": "In this example, we are not inside a structure, therefore we will assume an altitude value of 15 meters, interpolated from the US Geological survey map, Washington West quadrangle.",
      "zh-CHS": "在本例中，我们不在建筑物内，因此我们将假设高度值为15米，根据华盛顿西四合院美国地质调查局地图插值。"
    },
    {
      "indent": 6,
      "text": "AltRes = 30, 0x1e, 011110\nAT = 1, 0x01, 000001\nAltitude = 15, 0x0F00, 00000000000000000000000001111100000000",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 2 (0x02 or 000010) and LoRes is expressed as value 2 (0x02 or 000010), then it would describe a geo-location region that is north of the equator and extends from -1 degree (west of the meridian) to -128 degrees. This would include the area from approximately 600km south of Saltpond, Ghana, due north to the North Pole and approximately 4400km",
      "zh-CHS": "如果：LaRes表示为值2（0x02或000010），LoRes表示为值2（0x02或000010），则它将描述赤道以北的地理位置区域，并从-1度（子午线以西）延伸至-128度。这将包括从加纳Saltpond以南约600公里处，北极正北约4400公里的区域"
    },
    {
      "indent": 7,
      "text": "south-southwest of Los Angeles, CA due north to the North Pole. This would cover an area of about one-sixth of the globe, approximately 20 million square nautical miles (nm).",
      "zh-CHS": "加利福尼亚州洛杉矶西南偏南，正北至北极。这将覆盖全球约六分之一的面积，约2000万平方海里（nm）。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 3 (0x03 or 000011) and LoRes is expressed as value 3 (0x03 or 000011), then it would describe a geo-location area that is north from the equator to 63 degrees north, and -65 degrees to -128 degrees longitude. This area includes south of a line from Anchorage, AL to eastern Nunavut, CN, and from the Amazons of northern Brazil to approximately 4400km south-southwest of Los Angeles, CA. This area would include North America, Central America, and parts of Venezuela and Columbia, except portions of Alaska and northern and eastern Canada, approximately 10 million square nm.",
      "zh-CHS": "如果：LaRes表示为值3（0x03或000011），LoRes表示为值3（0x03或000011），那么它将描述一个地理位置区域，该区域从赤道以北到北纬63度，经度从-65度到-128度。该区域包括从阿尔卑斯安克雷奇到北卡罗来纳州努纳武特东部，以及从巴西北部的亚马逊河到加利福尼亚州洛杉矶西南偏南约4400km的线路以南。该区域包括北美洲、中美洲以及委内瑞拉和哥伦比亚的部分地区，阿拉斯加和加拿大北部和东部除外，大约1000万平方米。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 5 (0x05 or 000101) and LoRes is expressed as value 5 (0x05 or 000101), then it would describe a geo-location area that is latitude 32 north of the equator to latitude 48 and extends from -64 degrees to -80 degrees longitude. This is approximately an east-west boundary of a time zone, an area of approximately 700,000 square nm.",
      "zh-CHS": "如果：LaRes表示为值5（0x05或000101），LoRes表示为值5（0x05或000101），则它将描述一个地理位置区域，该区域位于赤道以北纬度32至纬度48，经度从-64度延伸至-80度。这大约是一个时区的东西边界，面积约为700000平方米。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 9 (0x09 or 001001) and LoRes is expressed as value 9 (0x09 or 001001), which includes all the integer bits, then it would describe a geo-location area that is latitude 38 north of the equator to latitude 39 and extends from -77 degrees to -78 degrees longitude. This is an area of approximately 9600 square km (111.3km x 86.5km).",
      "zh-CHS": "如果：LaRes表示为值9（0x09或001001），LoRes表示为值9（0x09或001001），其中包括所有整数位，则它将描述一个地理位置区域，该区域位于赤道以北纬度38至纬度39，并从-77度延伸至-78度经度。面积约为9600平方公里（111.3公里x 86.5公里）。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 18 (0x12 or 010010) and LoRes is expressed as value 18 (0x12 or 010010), then it would describe a geo-location area that is latitude 38.8984375 north to latitude 38.9003906 and extends from -77.0390625 degrees to -77.0371094 degrees longitude. This is an area of approximately 36,600 square meters (169m x 217m).",
      "zh-CHS": "如果：LaRes表示为值18（0x12或010010），LoRes表示为值18（0x12或010010），则它将描述一个地理位置区域，该区域位于北纬38.8984375至北纬38.9003906，从-77.0390625度延伸至-77.0371094度。面积约为36600平方米（169m x 217m）。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 22 (0x16 or 010110) and LoRes is expressed as value 22 (0x16 or 010110), then it would describe a geo-location area that is latitude 38.896816 north to latitude 38.8985596 and extends from -77.0372314 degrees to -77.0371094 degrees longitude. This is an area of approximately 143 square meters (10.5m x 13.6m).",
      "zh-CHS": "如果：LaRes表示为值22（0x16或010110），LoRes表示为值22（0x16或010110），则它将描述一个地理位置区域，该区域位于北纬38.896816至北纬38.8985596，从-77.0372314度延伸至-77.0371094度。面积约143平方米（10.5米x 13.6米）。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 28 (0x1c or 011100) and LoRes is expressed as value 28 (0x1c or 011100), then it would describe a geo-location area that is latitude 38.8986797 north to latitude",
      "zh-CHS": "如果：LaRes表示为值28（0x1c或011100），LoRes表示为值28（0x1c或011100），则它将描述北纬38.8986797的地理位置区域"
    },
    {
      "indent": 7,
      "text": "38.8986816 and extends from -77.0372314 degrees to -77.0372296 degrees longitude. This is an area of approximately 339 square centimeters (20.9cm x 16.23cm).",
      "zh-CHS": "38.8986816，并从-77.0372314度延伸至-77.0372296度经度。面积约为339平方厘米（20.9厘米x 16.23厘米）。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 30 (0x1e or 011110) and LoRes is expressed as value 30 (0x1e or 011110), then it would describe a geo-location area that is latitude 38.8986797 north to latitude 38.8986802 and extends from -77.0372300 degrees to -77.0372296 degrees longitude. This is an area of approximately 19.5 square centimeters (50mm x 39mm).",
      "zh-CHS": "如果：LaRes表示为值30（0x1e或011110），LoRes表示为值30（0x1e或011110），则它将描述一个地理位置区域，该区域位于北纬38.8986797至北纬38.8986802，从-77.0372300度延伸至-77.0372296度。面积约为19.5平方厘米（50mm x 39mm）。"
    },
    {
      "indent": 3,
      "text": "If: LaRes is expressed as value 34 (0x22 or 100010) and LoRes is expressed as value 34 (0x22 or 100010), then it would describe a geo-location area that is latitude 38.8986800 north to latitude 38.8986802 and extends from -77.0372300 degrees to -77.0372296 degrees longitude. This is an area of approximately 7.5 square millimeters (3.11mm x 2.42mm).",
      "zh-CHS": "如果：LaRes表示为值34（0x22或100010），LoRes表示为值34（0x22或100010），则它将描述一个地理位置区域，该区域位于北纬38.8986800至北纬38.8986802，从-77.0372300度延伸至-77.0372296度。面积约为7.5平方毫米（3.11毫米x 2.42毫米）。"
    },
    {
      "indent": 3,
      "text": "In the (White House) example, the requirement of emergency responders in North America via their NENA Model Legislation [8] could be met by a LaRes value of 21 and a LoRes value of 20. This would yield a geo-location that is latitude 38.8984375 north to latitude 38.8988616 north and longitude -77.0371094 to longitude -77.0375977. This is an area of approximately 89 feet by 75 feet or 6669 square feet, which is very close to the 7000 square feet requested by NENA. In this example, a service provider could enforce that a device send a Location Configuration Information with this minimum amount of resolution for this particular location when calling emergency services.",
      "zh-CHS": "在（白宫）的例子中，北美应急响应人员通过NENA示范立法[8]的要求可以通过LaRes值21和LoRes值20得到满足。这将产生一个地理位置，即北纬38.8984375至北纬38.8988616，经度-77.0371094至经度-77.0375977。这一面积约为89英尺乘75英尺或6669平方英尺，非常接近NENA要求的7000平方英尺。在此示例中，服务提供商可以强制设备在调用紧急服务时发送具有此特定位置的最小分辨率的位置配置信息。"
    },
    {
      "indent": 0,
      "text": "A.2. Location Configuration Information of \"Sears Tower\" (Example 2)",
      "section_title": true,
      "zh-CHS": "A.2. “西尔斯大厦”的位置配置信息（示例2）"
    },
    {
      "indent": 3,
      "text": "Postal Address: Sears Tower 103rd Floor 233 S. Wacker Dr. Chicago, IL 60606",
      "zh-CHS": "邮政地址：伊利诺伊州芝加哥市S.Wacker博士233号西尔斯大厦103楼60606"
    },
    {
      "indent": 3,
      "text": "Viewing the Chicago area from the Observation Deck of the Sears Tower.",
      "zh-CHS": "从西尔斯大厦的观景台上观看芝加哥地区。"
    },
    {
      "indent": 3,
      "text": "Latitude 41.87884 degrees North (or +41.87884 degrees)\nUsing 2s complement, 34 bit fixed point, 25 bit fraction\nLatitude = 0x053c1f751,\nLatitude = 0001010011110000011111011101010001",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Longitude 87.63602 degrees West (or -87.63602 degrees)\nUsing 2s complement, 34 bit fixed point, 25 bit fraction\nLongitude = 0xf50ba5b97,\nLongitude = 1101010000101110100101101110010111",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Altitude 103",
      "zh-CHS": "海拔103"
    },
    {
      "indent": 3,
      "text": "In this example, we are inside a structure, therefore we will assume an altitude value of 103 to indicate the floor we are on. The Altitude Type value is 2, indicating floors. The AltRes field would indicate that all bits in the Altitude field are true, as we want to accurately represent the floor of the structure where we are located.",
      "zh-CHS": "在本例中，我们位于一个结构内部，因此我们将假设高度值为103，以指示我们所在的楼层。“高度类型”值为2，表示楼层。AltRes字段将指示高度字段中的所有位均为真，因为我们希望准确表示我们所在结构的楼层。"
    },
    {
      "indent": 3,
      "text": "AltRes = 30, 0x1e, 011110 AT = 2, 0x02, 000010 Altitude = 103, 0x00006700, 000000000000000110011100000000",
      "zh-CHS": "AltRes=30，0x1e，011110 AT=2，0x02，000010海拔=103，0x00006700000000000 110011100000000"
    },
    {
      "indent": 3,
      "text": "For the accuracy of the latitude and longitude, the best information available to us was supplied by a generic mapping service that shows a single geo-loc for all of the Sears Tower. Therefore we are going to show LaRes as value 18 (0x12 or 010010) and LoRes as value 18 (0x12 or 010010). This would be describing a geo-location area that is latitude 41.8769531 to latitude 41.8789062 and extends from -87.6367188 degrees to -87.6347657 degrees longitude. This is an area of approximately 373412 square feet (713.3 ft. x 523.5 ft.).",
      "zh-CHS": "对于纬度和经度的准确性，我们所能获得的最佳信息是由通用地图服务提供的，该服务显示所有西尔斯塔的单一地理位置。因此，我们将LaRes显示为值18（0x12或010010），LoRes显示为值18（0x12或010010）。这将描述纬度41.8769531至纬度41.8789062，并从-87.6367188度延伸至-87.6347657度经度的地理位置区域。面积约为373412平方英尺（713.3英尺x 523.5英尺）。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, March 1997.",
      "zh-CHS": "[1] Droms，R.，“动态主机配置协议”，RFC 2131，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Patrick, M., \"DHCP Relay Agent Information Option\", RFC 3046, January 2001.",
      "zh-CHS": "[2] Patrick，M.，“DHCP中继代理信息选项”，RFC 3046，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[3] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[3] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Droms, R. and W. Arbaugh, \"Authentication for DHCP Messages\", RFC 3118, June 2001.",
      "zh-CHS": "[4] Droms，R.和W.Arbaugh，“DHCP消息的身份验证”，RFC31182001年6月。"
    },
    {
      "indent": 3,
      "text": "[5] European Petroleum Survey Group, http://www.epsg.org/ and\n    http://www.ihsenergy.com/epsg/geodetic2.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[6] World Geodetic System 1984 (WGS 84), MIL-STD-2401,\n    http://www.wgs84.com/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6.2. Informational References",
      "section_title": true,
      "zh-CHS": "6.2. 参考资料"
    },
    {
      "indent": 3,
      "text": "[7] Farrell, C., Schulze, M., Pleitner, S. and D. Baldoni, \"DNS Encoding of Geographical Location\", RFC 1712, November 1994.",
      "zh-CHS": "[7] Farrell，C.，Schulze，M.，Pleitner，S.和D.Baldoni，“地理位置的DNS编码”，RFC 1712，1994年11月。"
    },
    {
      "indent": 3,
      "text": "[8] National Emergency Number Association (NENA) www.nena.org NENA Technical Information Document on Model Legislation Enhanced 911 for Multi-Line Telephone Systems.",
      "zh-CHS": "[8] 国家紧急电话号码协会（NENA）www.NENA.org NENA关于多线电话系统增强型911示范立法的技术信息文件。"
    },
    {
      "indent": 0,
      "text": "7. Author Information",
      "section_title": true,
      "zh-CHS": "7. 作者信息"
    },
    {
      "indent": 3,
      "text": "James M. Polk Cisco Systems 2200 East President George Bush Turnpike Richardson, Texas 75082 USA",
      "zh-CHS": "詹姆斯·M·波尔克思科系统2200美国德克萨斯州东总统乔治·布什收费公路理查森75082"
    },
    {
      "indent": 3,
      "text": "EMail: jmpolk@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "John Schnizlein Cisco Systems 9123 Loughran Road Fort Washington, MD 20744 USA",
      "zh-CHS": "美国马里兰州华盛顿堡Loughran路9123号思科系统公司John Schnizlein 20744"
    },
    {
      "indent": 3,
      "text": "EMail: john.schnizlein@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Marc Linsner Cisco Systems Marco Island, FL 34145 USA",
      "zh-CHS": "Marc Linsner思科系统公司美国佛罗里达州马可岛，邮编34145"
    },
    {
      "indent": 3,
      "text": "EMail: marc.linsner@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "8. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}