{
  "title": {
    "text": "RFC 3536: Terminology Used in Internationalization in the IETF ",
    "zh-CHS": "RFC 3536"
  },
  "number": 3536,
  "created_at": "2021-10-27 12:05:45.389904+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         P. Hoffman\nRequest for Comments: 3536                                    IMC & VPNC\nCategory: Informational                                         May 2003",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Terminology Used in Internationalization in the IETF",
      "zh-CHS": "IETF国际化中使用的术语"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terms used in the IETF when discussing internationalization. The purpose is to help frame discussions of internationalization in the various areas of the IETF and to help introduce the main concepts to IETF participants.",
      "zh-CHS": "本文档提供了IETF讨论国际化时使用的术语表。目的是帮助构建IETF各领域国际化讨论的框架，并帮助向IETF参与者介绍主要概念。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction...................................................  2\n  1.1 Purpose of this document....................................  2\n  1.2 Format of the definitions in this document..................  3\n2. Fundamental Terms..............................................  3\n3. Standards Bodies and Standards.................................  8\n  3.1 Standards bodies............................................  8\n  3.2 Encodings and transformation formats of ISO/IEC 10646....... 10\n  3.3 Native CCSs and charsets.................................... 11\n4. Character Issues............................................... 12\n  4.1 Types of characters......................................... 15\n5. User interface for text........................................ 17\n6. Text in current IETF protocols................................. 19\n7. Other Common Terms In Internationalization..................... 22\n8. Security Considerations........................................ 25\n9. References..................................................... 25\n  9.1 Normative References........................................ 25\n  9.2 Informative References...................................... 26\n10. Additional Interesting Reading................................ 27\n11. Index......................................................... 27\nA. Acknowledgements............................................... 29\nB. Author's Address............................................... 29\nFull Copyright Statement.......................................... 30",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As [RFC2277] summarizes: \"Internationalization is for humans. This means that protocols are not subject to internationalization; text strings are.\" Many protocols throughout the IETF use text strings that are entered by, or are visible to, humans. It should be possible for anyone to enter or read these text strings, which means that Internet users must be able to be enter text in typical input methods and displayed in any human language. Further, text containing any character should be able to be passed between Internet applications easily. This is the challenge of internationalization.",
      "zh-CHS": "正如[RFC2277]总结的那样：“国际化是为人类而设的。这意味着协议不受国际化的约束；文本字符串受国际化的约束。”整个IETF中的许多协议都使用由人类输入或可见的文本字符串。任何人都可以输入或读取这些文本字符串，这意味着互联网用户必须能够以典型的输入方法输入文本并以任何人类语言显示。此外，包含任何字符的文本应该能够在Internet应用程序之间轻松传递。这就是国际化的挑战。"
    },
    {
      "indent": 0,
      "text": "1.1 Purpose of this document",
      "section_title": true,
      "zh-CHS": "1.1 本文件的目的"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terms used in the IETF when discussing internationalization. The purpose is to help frame discussions of internationalization in the various areas of the IETF and to help introduce the main concepts to IETF participants.",
      "zh-CHS": "本文档提供了IETF讨论国际化时使用的术语表。目的是帮助构建IETF各领域国际化讨论的框架，并帮助向IETF参与者介绍主要概念。"
    },
    {
      "indent": 3,
      "text": "Internationalization is discussed in many working groups of the IETF. However, few working groups have internationalization experts. When designing or updating protocols, the question often comes up \"should we internationalize this\" (or, more likely, \"do we have to internationalize this\").",
      "zh-CHS": "IETF的许多工作组都讨论了国际化问题。然而，很少有工作组有国际化专家。在设计或更新协议时，经常会出现这样的问题：“我们是否应该将其国际化”（或者，更可能的是，“我们是否必须将其国际化”）。"
    },
    {
      "indent": 3,
      "text": "This document gives an overview of internationalization as it applies to IETF standards work by lightly covering the many aspects of internationalization and the vocabulary associated with those topics. It is not meant to be a complete description of internationalization. The definitions in this document are not normative for IETF standards; however, they are useful and standards may make informative reference to this document after it becomes an RFC. Some of the definitions in this document come from many earlier IETF documents and books.",
      "zh-CHS": "本文档通过简单介绍国际化的许多方面以及与这些主题相关的词汇，概述了国际化在IETF标准工作中的应用。这并不是对国际化的完整描述。本文件中的定义不是IETF标准的规范性定义；然而，它们是有用的，标准可能会在本文件成为RFC后提供参考。本文件中的一些定义来自许多早期的IETF文件和书籍。"
    },
    {
      "indent": 3,
      "text": "As in many fields, there is disagreement in the internationalization community on definitions for many words. The topic of language brings up particularly passionate opinions for experts and non-experts alike. This document attempts to define terms in a way that will be most useful to the IETF audience.",
      "zh-CHS": "与许多领域一样，国际化界对许多词的定义存在分歧。语言这个话题给专家和非专家带来了特别热烈的意见。本文件试图以对IETF受众最有用的方式定义术语。"
    },
    {
      "indent": 3,
      "text": "This document uses definitions from many documents that have been developed outside the IETF. The primary documents used are:",
      "zh-CHS": "本文件使用了IETF之外开发的许多文件中的定义。使用的主要文件有："
    },
    {
      "indent": 6,
      "text": "- ISO/IEC 10646 [ISOIEC10646]",
      "zh-CHS": "- ISO/IEC10646[ISO10646]"
    },
    {
      "indent": 6,
      "text": "- The Unicode Standard [UNICODE]",
      "zh-CHS": "- Unicode标准[Unicode]"
    },
    {
      "indent": 6,
      "text": "- W3C Character Model [CHARMOD]",
      "zh-CHS": "- W3C字符模型[CHARMOD]"
    },
    {
      "indent": 6,
      "text": "- IETF RFCs, including [RFC2277]",
      "zh-CHS": "- IETF RFC，包括[RFC2277]"
    },
    {
      "indent": 0,
      "text": "1.2 Format of the definitions in this document",
      "section_title": true,
      "zh-CHS": "1.2 本文件中定义的格式"
    },
    {
      "indent": 3,
      "text": "In the body of this document, the source for the definition is shown in angle brackets, such as \"<ISOIEC10646>\". Many definitions are shown as \"<NONE>\", which means that the definitions were crafted originally for this document. The angle bracket notation for the source of definitions is different than the square bracket notation used for references to documents, such as in the paragraph above; these references are given in Section 9.",
      "zh-CHS": "在本文件正文中，定义的来源用尖括号表示，如“<ISOIEC10646>”。许多定义显示为“<NONE>”，这意味着这些定义最初是为本文档编制的。定义来源的角括号符号不同于上文段落中引用文件时使用的方括号符号；这些参考资料见第9节。"
    },
    {
      "indent": 3,
      "text": "For some terms, there are commentary and examples after the definitions. In those cases, the part before the angle brackets is the definition that comes from the original source, and the part after the angle brackets is commentary that is not a definition (such as examples or further exposition).",
      "zh-CHS": "对于某些术语，在定义之后有注释和示例。在这些情况下，尖括号前的部分是来自原始来源的定义，尖括号后的部分是不是定义的评注（例如示例或进一步的阐述）。"
    },
    {
      "indent": 3,
      "text": "Examples in this document use the notation for code points and names from the Unicode Standard [UNICODE] and ISO/IEC 10646 [ISOIEC10646]. For example, the letter \"a\" may be represented as either \"U+0061\" or \"LATIN SMALL LETTER A\".",
      "zh-CHS": "本文档中的示例使用Unicode标准[Unicode]和ISO/IEC 10646[ISOIEC10646]中的代码点和名称表示法。例如，字母“a”可以表示为“U+0061”或“拉丁小写字母a”。"
    },
    {
      "indent": 0,
      "text": "2. Fundamental Terms",
      "section_title": true,
      "zh-CHS": "2. 基本术语"
    },
    {
      "indent": 3,
      "text": "This section covers basic topics that are needed for almost anyone who is involved with making IETF protocols more friendly to non-ASCII text and with other aspects of internationalization.",
      "zh-CHS": "本节介绍使IETF协议对非ASCII文本更友好以及国际化的其他方面的几乎所有人都需要的基本主题。"
    },
    {
      "indent": 3,
      "text": "language",
      "zh-CHS": "语言"
    },
    {
      "indent": 6,
      "text": "A language is a way that humans interact. The use of language occurs in many forms, the most common of which are speech, writing, and signing. <NONE>",
      "zh-CHS": "语言是人类互动的一种方式。语言的使用有多种形式，其中最常见的是演讲、写作和签名<无>"
    },
    {
      "indent": 6,
      "text": "Some languages have a close relationship between the written and spoken forms, while others have a looser relationship. [RFC3066] discusses languages in more detail and provides identifiers for languages for use in Internet protocols. Note that computer languages are explicitly excluded from this definition.",
      "zh-CHS": "一些语言的书面形式和口头形式之间有着密切的关系，而另一些语言则有着松散的关系。[RFC3066]更详细地讨论语言，并提供用于Internet协议的语言标识符。请注意，此定义中明确排除了计算机语言。"
    },
    {
      "indent": 3,
      "text": "script",
      "zh-CHS": "剧本"
    },
    {
      "indent": 6,
      "text": "A set of graphic characters used for the written form of one or more languages. <ISOIEC10646>",
      "zh-CHS": "一组图形字符，用于一种或多种语言的书面形式<ISO10646>"
    },
    {
      "indent": 6,
      "text": "Examples of scripts are Latin, Cyrillic, Greek, Arabic, and Han (the ideographs used in writing Chinese, Japanese, and Korean). [RFC2277] discusses scripts in detail.",
      "zh-CHS": "例如，拉丁语、西里尔语、希腊语、阿拉伯语和韩语（用于书写汉语、日语和韩语的表意文字）。[RFC2277]详细讨论了脚本。"
    },
    {
      "indent": 6,
      "text": "It is common for internationalization novices to mix up the terms \"language\" and \"script\". This can be a problem in protocols that differentiate the two. Almost all protocols that are designed (or were re-designed) to handle non-ASCII text deal with scripts (the written systems) or characters, while fewer actually deal with languages.",
      "zh-CHS": "国际化新手经常混淆“语言”和“脚本”这两个术语。这可能是区分两者的协议中的一个问题。几乎所有设计（或重新设计）用于处理非ASCII文本的协议都处理脚本（书面系统）或字符，而实际处理语言的协议则更少。"
    },
    {
      "indent": 6,
      "text": "A single name can mean either a language or a script; for example, \"Arabic\" is both the name of a language and the name of a script. In fact, many scripts borrow their names from the names of languages. Further, many scripts are used for many languages; for example, the Russian and Bulgarian languages are written in the Cyrillic script. Some languages can be expressed using different scripts; the Mongolian language can be written in either the Mongolian and Cyrillic scripts, and the Serbo-Croatian language is written using both the Latin and Cyrillic scripts. Further, some languages are normally expressed with more than one script at the same time; for example, the Japanese language is normally expressed in the Kanji (Han), Katakana, and Hiragana scripts in a single string of text.",
      "zh-CHS": "一个名字可以指一种语言或一个脚本；例如，“阿拉伯语”既是一种语言的名称，也是一种脚本的名称。事实上，许多脚本借用了语言的名称。此外，许多脚本用于多种语言；例如，俄语和保加利亚语是用西里尔文字书写的。有些语言可以用不同的脚本来表达；蒙古语可以用蒙古语和西里尔语书写，塞尔维亚-克罗地亚语可以用拉丁语和西里尔语书写。此外，一些语言通常同时用多个脚本表示；例如，日语通常用汉字、片假名和平假名在一个文本字符串中表达。"
    },
    {
      "indent": 3,
      "text": "character",
      "zh-CHS": "性格"
    },
    {
      "indent": 6,
      "text": "A member of a set of elements used for the organization, control, or representation of data. <ISOIEC10646>",
      "zh-CHS": "用于组织、控制或表示数据的一组元素的成员<ISO10646>"
    },
    {
      "indent": 6,
      "text": "There are at least three common definitions of the word \"character\":",
      "zh-CHS": "“字符”一词至少有三种常见定义："
    },
    {
      "indent": 9,
      "text": "- a general description of a text entity",
      "zh-CHS": "- 文本实体的一般描述"
    },
    {
      "indent": 9,
      "text": "- a unit of a writing system, often synonymous with \"letter\" or similar terms",
      "zh-CHS": "- 书写系统的一个单位，通常与“字母”或类似术语同义"
    },
    {
      "indent": 9,
      "text": "- the encoded entity itself",
      "zh-CHS": "- 编码实体本身"
    },
    {
      "indent": 6,
      "text": "When people talk about characters, they are mostly using one of the first two definitions.",
      "zh-CHS": "当人们谈论角色时，他们大多使用前两种定义中的一种。"
    },
    {
      "indent": 6,
      "text": "A particular character is identified by its name, not by its shape. A name may suggest a meaning, but the character may be used for representing other meanings as well. A name may suggest",
      "zh-CHS": "一个特定的字符是通过它的名字而不是形状来识别的。一个名字可能暗示一种含义，但这个字符也可能被用来表示其他含义。一个名字可能暗示"
    },
    {
      "indent": 6,
      "text": "a shape, but that does not imply that only that shape is commonly used in print, nor that the particular shape is associated only with that name.",
      "zh-CHS": "形状，但这并不意味着只有该形状通常用于打印，也不意味着特定形状仅与该名称关联。"
    },
    {
      "indent": 3,
      "text": "coded character",
      "zh-CHS": "编码字符"
    },
    {
      "indent": 6,
      "text": "A character together with its coded representation. <ISOIEC10646>",
      "zh-CHS": "一种字符及其编码表示<ISO10646>"
    },
    {
      "indent": 3,
      "text": "coded character set",
      "zh-CHS": "编码字符集"
    },
    {
      "indent": 6,
      "text": "A coded character set (CCS) is a set of unambiguous rules that establishes a character set and the relationship between the characters of the set and their coded representation. <ISOIEC10646>",
      "zh-CHS": "编码字符集（CCS）是一组明确的规则，用于建立字符集及其字符与其编码表示之间的关系<ISO10646>"
    },
    {
      "indent": 3,
      "text": "character encoding form",
      "zh-CHS": "字符编码形式"
    },
    {
      "indent": 6,
      "text": "A character encoding form is a mapping from a character set definition to the actual code units used to represent the data. <UNICODE>",
      "zh-CHS": "字符编码形式是从字符集定义到用于表示数据的实际代码单位的映射<UNICODE>"
    },
    {
      "indent": 3,
      "text": "repertoire",
      "zh-CHS": "可表演项目"
    },
    {
      "indent": 6,
      "text": "The collection of characters included in a character set. Also called a character repertoire. <UNICODE>",
      "zh-CHS": "字符集中包含的字符集合。也称为角色剧目<UNICODE>"
    },
    {
      "indent": 3,
      "text": "glyph",
      "zh-CHS": "字形"
    },
    {
      "indent": 6,
      "text": "A glyph is an abstract form that represents one or more glyph images. The term \"glyph\" is often a synonym for glyph image, which is the actual, concrete image of a glyph representation having been rasterized or otherwise imaged onto some display surface. In displaying character data, one or more glyphs may be selected to depict a particular character. These glyphs are selected by a rendering engine during composition and layout processing. <UNICODE>",
      "zh-CHS": "字形是表示一个或多个字形图像的抽象形式。术语“glyph”通常是glyph image的同义词，glyph image是已光栅化或以其他方式成像到某个显示表面上的glyph表示的实际具体图像。在显示字符数据时，可以选择一个或多个图示符来描述特定字符。这些图示符由渲染引擎在合成和布局处理期间选择<UNICODE>"
    },
    {
      "indent": 3,
      "text": "glyph code",
      "zh-CHS": "glyph代码"
    },
    {
      "indent": 6,
      "text": "A glyph code is a numeric code that refers to a glyph. Usually, the glyphs contained in a font are referenced by their glyph code. Glyph codes are local to a particular font; that is, a different font containing the same glyphs may use different codes. <UNICODE>",
      "zh-CHS": "字形代码是指字形的数字代码。通常，字体中包含的字形由字形代码引用。字形代码是特定字体的本地代码；也就是说，包含相同字形的不同字体可能使用不同的代码<UNICODE>"
    },
    {
      "indent": 3,
      "text": "transcoding",
      "zh-CHS": "转码"
    },
    {
      "indent": 6,
      "text": "Transcoding is the process of converting text data from one character encoding form to another. Transcoders work only at the level of character encoding and do not parse the text. Note: Transcoding may involve one-to-one, many-to-one, one-to-many or many-to-many mappings. Because some legacy mappings are glyphic, they may not only be many-to-many, but also discontinuous: thus XYZ may map to yxz. <CHARMOD>",
      "zh-CHS": "转码是将文本数据从一种字符编码形式转换为另一种字符编码形式的过程。转码器仅在字符编码级别工作，不解析文本。注意：转码可能涉及一对一、多对一、一对多或多对多映射。由于某些传统映射是字形的，它们可能不仅是多对多的，而且是不连续的：因此XYZ可能映射到yxz<CHARMOD>"
    },
    {
      "indent": 6,
      "text": "In this definition, \"many-to-one\" means a sequence of characters mapped to a single character. The \"many\" does not mean alternative characters that map to the single character.",
      "zh-CHS": "在此定义中，“多对一”指映射到单个字符的字符序列。“多”并不意味着映射到单个字符的替代字符。"
    },
    {
      "indent": 3,
      "text": "character encoding scheme",
      "zh-CHS": "字符编码方案"
    },
    {
      "indent": 6,
      "text": "A character encoding scheme (CES) is a character encoding form plus byte serialization. There are many character encoding schemes in Unicode, such as UTF-8 and UTF-16. <UNICODE>",
      "zh-CHS": "字符编码方案（CES）是字符编码形式加字节序列化。Unicode中有许多字符编码方案，如UTF-8和UTF-16<UNICODE>"
    },
    {
      "indent": 6,
      "text": "Some CESs are associated with a single CCS; for example, UTF-8 [RFC2279] applies only to ISO/IEC 10646. Other CESs, such as ISO 2022, are associated with many CCSs.",
      "zh-CHS": "Some CESs are associated with a single CCS; for example, UTF-8 [RFC2279] applies only to ISO/IEC 10646. Other CESs, such as ISO 2022, are associated with many CCSs.translate error, please retry"
    },
    {
      "indent": 3,
      "text": "charset",
      "zh-CHS": "字符集"
    },
    {
      "indent": 6,
      "text": "A charset is a method of mapping a sequence of octets to a sequence of abstract characters. A charset is, in effect, a combination of one or more CCSs with a CES. Charset names are registered by the IANA according to procedures documented in [RFC2278]. <NONE>",
      "zh-CHS": "字符集是一种将八位字节序列映射到抽象字符序列的方法。字符集实际上是一个或多个CCS与CES的组合。IANA根据[RFC2278]中记录的程序注册字符集名称<无>"
    },
    {
      "indent": 6,
      "text": "Many protocol definitions use the term \"character set\" in their descriptions. The terms \"charset\" or \"character encoding scheme\" are strongly preferred over the term \"character set\" because \"character set\" has other definitions in other contexts and this can be confusing.",
      "zh-CHS": "许多协议定义在其描述中使用术语“字符集”。术语“字符集”或“字符编码方案”比术语“字符集”更受欢迎，因为“字符集”在其他上下文中有其他定义，这可能会造成混淆。"
    },
    {
      "indent": 3,
      "text": "internationalization",
      "zh-CHS": "国际化"
    },
    {
      "indent": 6,
      "text": "In the IETF, \"internationalization\" means to add or improve the handling of non-ASCII text in a protocol. <NONE>",
      "zh-CHS": "在IETF中，“国际化”是指在协议中添加或改进非ASCII文本的处理<无>"
    },
    {
      "indent": 6,
      "text": "Many protocols that handle text only handle one script (often, the one that contains the letters used in English text), or leave the question of what character set is used up to local guesswork",
      "zh-CHS": "许多处理文本的协议只处理一个脚本（通常是包含英文文本中使用的字母的脚本），或者将使用什么字符集的问题留给本地猜测"
    },
    {
      "indent": 6,
      "text": "(which leads, of course, to interoperability problems). Adding non-ASCII text to such a protocol allows the protocol to handle more scripts, hopefully all of the ones useful in the world.",
      "zh-CHS": "（当然，这会导致互操作性问题）。将非ASCII文本添加到这样的协议中可以让协议处理更多的脚本，希望能够处理世界上所有有用的脚本。"
    },
    {
      "indent": 3,
      "text": "localization",
      "zh-CHS": "本地化"
    },
    {
      "indent": 6,
      "text": "The process of adapting an internationalized application platform or application to a specific cultural environment. In localization, the same semantics are preserved while the syntax may be changed. [FRAMEWORK]",
      "zh-CHS": "使国际化应用程序平台或应用程序适应特定文化环境的过程。在本地化中，相同的语义被保留，而语法可能被更改。[框架]"
    },
    {
      "indent": 6,
      "text": "Localization is the act of tailoring an application for a different language or script or culture. Some internationalized applications can handle a wide variety of languages. Typical users only understand a small number of languages, so the program must be tailored to interact with users in just the languages they know.",
      "zh-CHS": "本地化是为不同的语言、脚本或文化定制应用程序的行为。一些国际化应用程序可以处理多种语言。典型的用户只懂少量语言，因此必须对程序进行定制，以便仅使用他们所知道的语言与用户进行交互。"
    },
    {
      "indent": 6,
      "text": "The major work of localization is translating the user interface and documentation. Localization involves not only changing the language interaction, but also other relevant changes such as display of numbers, dates, currency, and so on. The better internationalized an application is, the easier it is to localize it for a particular language and character encoding scheme.",
      "zh-CHS": "本地化的主要工作是翻译用户界面和文档。本地化不仅涉及到语言交互的变化，还涉及到其他相关的变化，如数字、日期、货币等的显示。应用程序的国际化程度越高，就越容易针对特定语言和字符编码方案对其进行本地化。"
    },
    {
      "indent": 6,
      "text": "Localization is rarely an IETF matter, and protocols that are merely localized, even if they are serially localized for several locations, are generally considered unsatisfactory for the global Internet.",
      "zh-CHS": "本地化很少是IETF的问题，仅本地化的协议，即使它们在多个位置连续本地化，通常被认为不适合全球互联网。"
    },
    {
      "indent": 6,
      "text": "Do not confuse \"localization\" with \"locale\", which is described in Section 7 of this document.",
      "zh-CHS": "不要将本文件第7节中描述的“本地化”与“语言环境”混淆。"
    },
    {
      "indent": 3,
      "text": "i18n, l10n",
      "zh-CHS": "i18n，l10n"
    },
    {
      "indent": 6,
      "text": "These are abbreviations for \"internationalization\" and \"localization\". <NONE>",
      "zh-CHS": "这些是“国际化”和“本地化”的缩写<无>"
    },
    {
      "indent": 6,
      "text": "\"18\" is the number of characters between the \"i\" and the \"n\" in \"internationalization\", and \"10\" is the number of characters between the \"l\" and the \"n\" in \"localization\".",
      "zh-CHS": "“18”是“国际化”中“i”和“n”之间的字符数，“10”是“本地化”中“l”和“n”之间的字符数。"
    },
    {
      "indent": 3,
      "text": "multilingual",
      "zh-CHS": "多语"
    },
    {
      "indent": 6,
      "text": "The term \"multilingual\" has many widely-varying definitions and thus is not recommended for use in standards. Some of the definitions relate to the ability to handle international",
      "zh-CHS": "“多语言”一词有许多不同的定义，因此不建议在标准中使用。其中一些定义涉及处理国际事务的能力"
    },
    {
      "indent": 6,
      "text": "characters; other definitions relate to the ability to handle multiple charsets; and still others relate to the ability to handle multiple languages. <NONE>",
      "zh-CHS": "人物；其他定义涉及处理多个字符集的能力；还有一些涉及到处理多种语言的能力<无>"
    },
    {
      "indent": 3,
      "text": "displaying and rendering text",
      "zh-CHS": "显示和呈现文本"
    },
    {
      "indent": 6,
      "text": "To display text, a system puts characters on a visual display device such as a screen or a printer. To render text, a system analyzes the character input to determine how to display the text. The terms \"display\" and \"render\" are sometimes used interchangeably. Note, however, that text might be rendered as audio and/or tactile output, such as in systems that have been designed for people with visual disabilities. <NONE>",
      "zh-CHS": "为了显示文本，系统将字符放在可视显示设备（如屏幕或打印机）上。要呈现文本，系统将分析字符输入以确定如何显示文本。术语“显示”和“渲染”有时可以互换使用。但是，请注意，文本可能会呈现为音频和/或触觉输出，例如在为视觉残疾人士设计的系统中<无>"
    },
    {
      "indent": 6,
      "text": "Combining characters modify the display of the character (or, in some cases, characters) that precede them. When rendering such text, the display engine must either find the glyph in the font that represents the base character and all of the combining characters, or it must render the combination itself. Such rendering can be straight-forward, but it is sometimes complicated when the combining marks interact with each other, such as when there are two combining marks that would appear above the same character. Formatting characters can also change the way that a renderer would display text. Rendering can also be difficult for some scripts that have complex display rules for base characters, such as Arabic and Indic scripts.",
      "zh-CHS": "组合字符会修改前面字符（或在某些情况下，字符）的显示。呈现此类文本时，显示引擎必须在表示基本字符和所有组合字符的字体中找到字形，或者必须呈现组合本身。这种渲染可以是直接进行的，但当组合标记相互交互时，有时会很复杂，例如当有两个组合标记出现在同一角色上方时。格式化字符还可以更改渲染器显示文本的方式。对于一些基本字符具有复杂显示规则的脚本（如阿拉伯语和印度语脚本），渲染也可能很困难。"
    },
    {
      "indent": 0,
      "text": "3. Standards Bodies and Standards",
      "section_title": true,
      "zh-CHS": "3. 标准机构和标准"
    },
    {
      "indent": 3,
      "text": "This section describes some of the standards bodies and standards that appear in discussions of internationalization in the IETF. This is an incomplete and possibly over-full list; listing too few bodies or standards can be just as politically dangerous as listing too many. Note that there are many other bodies that deal with internationalization; however, few if any of them appear commonly in IETF standards work.",
      "zh-CHS": "本节描述了IETF国际化讨论中出现的一些标准机构和标准。这是一份不完整且可能过满的清单；列出太少的机构或标准可能与列出太多机构或标准一样具有政治危险性。注意，还有许多其他机构处理国际化问题；然而，在IETF标准工作中，它们很少出现。"
    },
    {
      "indent": 0,
      "text": "3.1 Standards bodies",
      "section_title": true,
      "zh-CHS": "3.1 标准机构"
    },
    {
      "indent": 3,
      "text": "ISO",
      "zh-CHS": "国际标准化组织"
    },
    {
      "indent": 6,
      "text": "The International Organization for Standardization has been involved with standards for characters since before the IETF was started. ISO is a non-governmental group made up of national bodies. ISO has many diverse standards in the international characters area; the one that is most used in the IETF is commonly referred to as \"ISO/IEC 10646\", although its official name has",
      "zh-CHS": "在IETF启动之前，国际标准化组织就参与了字符标准的制定。ISO是由国家机构组成的非政府组织。ISO在国际字符领域有许多不同的标准；IETF中使用最多的一个通常被称为“ISO/IEC 10646”，尽管其官方名称已被修改"
    },
    {
      "indent": 6,
      "text": "more qualifications. (The IEC is International Electrotechnical Commission). ISO/IEC 10646 describes a CCS that covers almost all known written characters in use today.",
      "zh-CHS": "更多的资格。（IEC是国际电工委员会）。ISO/IEC 10646描述了一种CCS，它涵盖了目前使用的几乎所有已知的书写字符。"
    },
    {
      "indent": 6,
      "text": "ISO/IEC 10646 is controlled by the group known as \"ISO/IEC JTC 1/SC 2 WG2\", often called \"WG2\" for short. ISO standards go through many steps before being finished, and years often go by between changes to ISO/IEC 10646. Information on WG2, and its work products, can be found at <http://www.dkuug.dk/JTC1/SC2/WG2/>.",
      "zh-CHS": "ISO/IEC 10646由称为“ISO/IEC JTC 1/SC 2 WG2”的集团控制，通常简称为“WG2”。ISO标准在完成之前要经过许多步骤，而ISO/IEC10646的更改往往需要几年的时间。有关WG2及其工作产品的信息，请访问<http://www.dkuug.dk/JTC1/SC2/WG2/>."
    },
    {
      "indent": 6,
      "text": "The standard, which comes in multiple parts, can be purchased in both print and CD-ROM versions. One example of how to cite the standard is given in [RFC2279]. Any standard that cites ISO/IEC 10646 needs to evaluate how to handle the versioning problem that is relevant to the protocol's needs.",
      "zh-CHS": "该标准分为多个部分，可购买印刷版和CD-ROM版。[RFC2279]中给出了如何引用该标准的一个示例。任何引用ISO/IEC 10646的标准都需要评估如何处理与协议需求相关的版本控制问题。"
    },
    {
      "indent": 6,
      "text": "ISO is responsible for other standards that might be of interest to protocol developers. [ISO 639] specifies the names of languages, and [ISO 3166] specifies the abbreviations of countries. Character work is done in the group known as ISO/IEC JTC1/SC22 and ISO TC46, as well as other ISO groups.",
      "zh-CHS": "ISO负责协议开发人员可能感兴趣的其他标准。[ISO 639]规定了语言名称，[ISO 3166]规定了国家的缩写。字符工作在ISO/IEC JTC1/SC22和ISO TC46以及其他ISO组中完成。"
    },
    {
      "indent": 6,
      "text": "Another relevant ISO group is JTC 1/SC22/WG20, which is\nresponsible for internationalization in JTC1, such as for\ninternational string ordering.  Information on WG20, and its work\nproducts, can be found at <http://www.dkuug.dk/jtc1/sc22/wg20/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Unicode Consortium",
      "zh-CHS": "统一码协会"
    },
    {
      "indent": 6,
      "text": "The second important group for international character standards is the Unicode Consortium. The Unicode Consortium is a trade association of companies, governments, and other groups interested in promoting the Unicode Standard [UNICODE]. The Unicode Standard is a CCS whose repertoire and code points are identical to ISO/IEC 10646. The Unicode Consortium has added features to the base CCS which make it more useful in protocols, such as defining attributes for each character. Examples of these attributes include case conversion and numeric properties.",
      "zh-CHS": "国际字符标准的第二个重要团体是Unicode联盟。Unicode联盟是一个由公司、政府和其他对推广Unicode标准[Unicode]感兴趣的团体组成的行业协会。Unicode标准是一种CCS，其指令集和代码点与ISO/IEC 10646相同。Unicode联盟为基本CCS添加了一些功能，使其在协议中更有用，例如为每个字符定义属性。这些属性的示例包括大小写转换和数字属性。"
    },
    {
      "indent": 6,
      "text": "The Unicode Consortium publishes addenda to the Unicode Standard as Unicode Technical Reports. There are many types of technical reports at various stages of maturity. The Unicode Standard and affiliated technical reports can be found at <http://www.unicode.org/>.",
      "zh-CHS": "Unicode联盟以Unicode技术报告的形式发布Unicode标准的附录。在不同的成熟阶段，有许多类型的技术报告。Unicode标准和相关技术报告可在<http://www.unicode.org/>."
    },
    {
      "indent": 3,
      "text": "World Wide Web Consortium (W3C)",
      "zh-CHS": "万维网联盟（W3C）"
    },
    {
      "indent": 6,
      "text": "This group created and maintains the standard for XML, the markup language for text that has become very popular. XML has always been fully internationalized so that there is no need for a new version to handle international text.",
      "zh-CHS": "这个小组创建并维护XML标准，XML是一种非常流行的文本标记语言。XML一直都是完全国际化的，因此不需要新版本来处理国际文本。"
    },
    {
      "indent": 3,
      "text": "local and regional standards organizations",
      "zh-CHS": "地方和区域标准组织"
    },
    {
      "indent": 6,
      "text": "Just as there are many native CCSs and charsets, there are many local and regional standards organizations to create and support them. Common examples of these are ANSI (United States), and CEN/ISSS (Europe).",
      "zh-CHS": "正如有许多本地CCS和字符集一样，也有许多本地和区域标准组织来创建和支持它们。常见的例子有ANSI（美国）和CEN/ISSS（欧洲）。"
    },
    {
      "indent": 0,
      "text": "3.2 Encodings and transformation formats of ISO/IEC 10646",
      "section_title": true,
      "zh-CHS": "3.2 ISO/IEC 10646的编码和转换格式"
    },
    {
      "indent": 3,
      "text": "Characters in the ISO/IEC 10646 CCS can be expressed in many ways. Encoding forms are direct addressing methods, while transformation formats are methods for expressing encoding forms as bits on the wire.",
      "zh-CHS": "ISO/IEC 10646 CCS中的字符可以用多种方式表示。编码形式是直接寻址方法，而转换格式是将编码形式表示为线路上的位的方法。"
    },
    {
      "indent": 3,
      "text": "Basic Multilingual Plane (BMP)",
      "zh-CHS": "基本多语言平面（BMP）"
    },
    {
      "indent": 6,
      "text": "The BMP is composed of the first 2^16 code points in ISO/IEC 10646. The BMP is also called \"plane 0\".",
      "zh-CHS": "BMP由ISO/IEC 10646中的前2^16个代码点组成。BMP也称为“平面0”。"
    },
    {
      "indent": 3,
      "text": "UCS-2 and UCS-4",
      "zh-CHS": "UCS-2和UCS-4"
    },
    {
      "indent": 6,
      "text": "UCS-2 and UCS-4 are the two encoding forms defined for ISO/IEC 10646. UCS-2 addresses only the BMP. Because many useful characters (such as many Han characters) have been defined outside of the BMP, many people would consider UCS-2 to be dead. Theoretically, UCS-4 addresses the entire range of 2^31 code points from ISO/IEC 10646 as 32-bit values. However, for interoperability with UTF-16, ISO 10646 restricts the range of characters that will actually be allocated to the values 0..0x10FFFF.",
      "zh-CHS": "UCS-2和UCS-4是为ISO/IEC 10646定义的两种编码形式。UCS-2仅处理BMP。由于许多有用的字符（如许多汉字）已被定义在BMP之外，许多人会认为UCS-2已经死亡。理论上，UCS-4将ISO/IEC 10646中的2^31码点的整个范围作为32位值进行寻址。但是，为了与UTF-16的互操作性，ISO 10646限制了实际分配给值0..0x10FFFF的字符范围。"
    },
    {
      "indent": 3,
      "text": "UTF-8",
      "zh-CHS": "UTF-8"
    },
    {
      "indent": 6,
      "text": "UTF-8, a transformation format specified in [RFC2279], is the preferred encoding for IETF protocols. Characters in the BMP are encoded as one, two, or three octets. Characters outside the BMP are encoded as four octets. Characters from the US-ASCII repertoire have the same on-the-wire representation in UTF-8 as they do in US-ASCII.",
      "zh-CHS": "UTF-8是[RFC2279]中规定的转换格式，是IETF协议的首选编码。BMP中的字符编码为一个、两个或三个八位字节。BMP之外的字符编码为四个八位字节。US-ASCII指令表中的字符在UTF-8中具有与在US-ASCII中相同的在线表示形式。"
    },
    {
      "indent": 3,
      "text": "UTF-16, UTF-16BE, and UTF-16LE",
      "zh-CHS": "UTF-16、UTF-16BE和UTF-16LE"
    },
    {
      "indent": 6,
      "text": "UTF-16, UTF-16BE, and UTF-16LE, three transformation formats defined in [RFC2781], are not required by any IETF standards, and are thus used much less often than UTF-8. Characters in the BMP are always encoded as two octets, and characters outside the BMP are encoded as four octets. The three formats differ based on the order of the octets and the presence of a special lead-in mark called the \"byte order mark\" or \"BOM\".",
      "zh-CHS": "[RFC2781]中定义的三种转换格式UTF-16、UTF-16BE和UTF-16LE不为任何IETF标准所要求，因此使用频率远低于UTF-8。BMP中的字符始终编码为两个八位字节，BMP之外的字符编码为四个八位字节。这三种格式根据八位字节的顺序和一种称为“字节顺序标记”或“BOM”的特殊引入标记的存在而有所不同。"
    },
    {
      "indent": 3,
      "text": "UTF-32",
      "zh-CHS": "UTF-32"
    },
    {
      "indent": 6,
      "text": "The Unicode Consortium has defined UTF-32 as a transformation format for UCS-4 in [UTR19].",
      "zh-CHS": "Unicode联盟在[UTR19]中将UTF-32定义为UCS-4的转换格式。"
    },
    {
      "indent": 3,
      "text": "SCSU and BOCU-1",
      "zh-CHS": "SCSU和BOCU-1"
    },
    {
      "indent": 6,
      "text": "The Unicode Consortium has defined an encoding, SCSU, which is designed to offer good compression for typical text. SCSU is described in [UTR6]. A different encoding that is meant to be MIME-friendly, BOCU-1, is described in [UTN6]. Although compression is attractive, as opposed to UTF-8 , neither of these (at the time of this writing) has attracted much interest in the IETF.",
      "zh-CHS": "Unicode联盟定义了一种编码SCSU，它旨在为典型文本提供良好的压缩。SCSU在[UTR6]中描述。[UTN6]中描述了一种不同的MIME友好编码BOCU-1。尽管与UTF-8相比，压缩是有吸引力的，但在撰写本文时，这两种压缩都没有引起IETF的兴趣。"
    },
    {
      "indent": 0,
      "text": "3.3 Native CCSs and charsets",
      "section_title": true,
      "zh-CHS": "3.3 本机ccs和字符集"
    },
    {
      "indent": 3,
      "text": "Before ISO/IEC 10646 was developed, many countries developed their own CCSs and charsets. Many dozen of these are in common use on the Internet today. Examples include ISO 8859-5 for Cyrillic and Shift-JIS for Japanese scripts.",
      "zh-CHS": "在ISO/IEC 10646开发之前，许多国家都开发了自己的CCS和字符集。其中有几十种在今天的互联网上被广泛使用。例如，西里尔文的ISO 8859-5和日文的Shift JIS。"
    },
    {
      "indent": 3,
      "text": "The official list of the registered charset names for use with IETF protocols is maintained by IANA and can be found at <http://www.iana.org/assignments/character-sets>. The list contains preferred names and aliases. Note that this list has historically contained many errors, such as names that are in fact not charsets or references that do not give enough detail to reliably map names to charsets.",
      "zh-CHS": "IETF协议使用的注册字符集名称的官方列表由IANA维护，可在<http://www.iana.org/assignments/character-sets>. 该列表包含首选名称和别名。请注意，此列表历史上曾包含许多错误，例如实际上不是字符集的名称，或者没有提供足够详细信息以可靠地将名称映射到字符集的引用。"
    },
    {
      "indent": 3,
      "text": "Probably the most well-known native CCS is ASCII [US-ASCII]. This CCS is used as the basis for keywords and parameter names in many IETF protocols, and as the sole CCS in numerous IETF protocols that have not yet been internationalized.",
      "zh-CHS": "最著名的本地CCS可能是ASCII[US-ASCII]。该CCS在许多IETF协议中用作关键字和参数名称的基础，并在许多尚未国际化的IETF协议中用作唯一的CCS。"
    },
    {
      "indent": 3,
      "text": "[UTR22] describes issues involved in mapping character data between charsets, and an XML format for mapping table data.",
      "zh-CHS": "[UTR22]描述了在字符集之间映射字符数据所涉及的问题，以及用于映射表数据的XML格式。"
    },
    {
      "indent": 0,
      "text": "4. Character Issues",
      "section_title": true,
      "zh-CHS": "4. 性格问题"
    },
    {
      "indent": 3,
      "text": "This section contains terms and topics that are commonly used in character handling and therefore are of concern to people adding non-ASCII text handling to protocols. These topics are standardized outside the IETF.",
      "zh-CHS": "本节包含字符处理中常用的术语和主题，因此，将非ASCII文本处理添加到协议中的人员非常关注这些术语和主题。这些主题在IETF之外标准化。"
    },
    {
      "indent": 3,
      "text": "combining character",
      "zh-CHS": "组合字符"
    },
    {
      "indent": 6,
      "text": "A member of an identified subset of the coded character set of ISO/IEC 10646 intended for combination with the preceding non-combining graphic character, or with a sequence of combining characters preceded by a non-combining character. <ISOIEC10646>",
      "zh-CHS": "ISO/IEC 10646编码字符集的识别子集的一个成员，用于与前面的非组合图形字符组合，或与前面有非组合字符的组合字符序列组合<ISO10646>"
    },
    {
      "indent": 3,
      "text": "composite sequence",
      "zh-CHS": "复合序列"
    },
    {
      "indent": 6,
      "text": "A sequence of graphic characters consisting of a non-combining character followed by one or more combining characters. A graphic symbol for a composite sequence generally consists of the combination of the graphic symbols of each character in the sequence. A composite sequence is not a character and therefore is not a member of the repertoire of ISO/IEC 10646. <ISOIEC10646>",
      "zh-CHS": "一种图形字符序列，由一个非组合字符后跟一个或多个组合字符组成。复合序列的图形符号通常由序列中每个字符的图形符号组合而成。复合序列不是字符，因此不是ISO/IEC 10646指令集的成员<ISO10646>"
    },
    {
      "indent": 6,
      "text": "In some CCSs, some characters consist of combinations of other characters. For example, the letter \"a with acute\" might be a combination of the two characters \"a\" and \"combining acute\", or it might be a combination of the three characters \"a\", a non-destructive backspace, and an acute. The rules for combining two or more characters are called \"composition rules\", and the rules for taking apart a character into other characters is called \"decomposition rules\". The results of composition is called a \"precomposed character\"; the results of decomposition is called a \"decomposed character\".",
      "zh-CHS": "在某些CCS中，某些字符由其他字符的组合组成。例如，字母“a with acute”可能是两个字符“a”和“combining acute”的组合，也可能是三个字符“a”、非破坏性退格和acute的组合。组合两个或多个字符的规则称为“组合规则”，将一个字符拆分为其他字符的规则称为“分解规则”。合成的结果称为“预合成字符”；分解的结果称为“分解字符”。"
    },
    {
      "indent": 3,
      "text": "normalization",
      "zh-CHS": "规范化"
    },
    {
      "indent": 6,
      "text": "Normalization is the transformation of data to a normal form, for example, to unify spelling. <UNICODE>",
      "zh-CHS": "规范化是将数据转换为标准格式，例如，统一拼写<UNICODE>"
    },
    {
      "indent": 6,
      "text": "Note that the phrase \"unify spelling\" in the definition above does not mean unifying different words with the same meaning (such as \"color\" and \"colour\"). Instead, it means unifying different character sequences that are intended to form the same composite characters (such as \"<a><n><combining tilde><o>\" and \"<a><n with tilde><o>\").",
      "zh-CHS": "请注意，上述定义中的短语“统一拼写”并不意味着统一具有相同含义的不同单词（如“颜色”和“颜色”）。相反，它意味着统一旨在形成相同组合字符的不同字符序列（例如“<a><n><combing tilde><o>”和“<a><n with tilde><o>”）。"
    },
    {
      "indent": 6,
      "text": "The purpose of normalization is to allow two strings to be compared for equivalence. The strings \"<a><n><combining tilde><o>\" and \"<a><n with tilde><o>\" would be shown identically on a text display device. If a protocol designer wants those two strings to be considered equivalent during comparison, the protocol must define where normalization occurs.",
      "zh-CHS": "规范化的目的是允许对两个字符串进行等效性比较。字符串“<a><n><combined tilde><o>”和“<a><n with tilde><o>”将在文本显示设备上以相同方式显示。如果协议设计者希望在比较期间将这两个字符串视为等效的，则协议必须定义规范化发生的位置。"
    },
    {
      "indent": 6,
      "text": "The terms \"normalization\" and \"canonicalization\" are often used interchangeably. Generally, they both mean to convert a string of one or more characters into another string based on standardized rules. Some CCSs allow multiple equivalent representations for a written string; normalization selects one among multiple equivalent representations as a base for reference purposes in comparing strings. In strings of text, these rules are usually based on decomposing combined characters or composing characters with combining characters. [UTR15] describes the process and many forms of normalization in detail. Normalization is important when comparing strings to see if they are the same.",
      "zh-CHS": "术语“规范化”和“规范化”经常互换使用。通常，它们都表示根据标准化规则将一个或多个字符的字符串转换为另一个字符串。一些CCS允许对一个写入字符串使用多个等效表示；规范化从多个等效表示中选择一个作为比较字符串时引用的基础。在文本字符串中，这些规则通常基于组合字符的分解或组合字符的组合。[UTR15]详细描述了规范化的过程和多种形式。在比较字符串以查看它们是否相同时，规范化非常重要。"
    },
    {
      "indent": 3,
      "text": "case",
      "zh-CHS": "案例"
    },
    {
      "indent": 6,
      "text": "Case is the feature of certain alphabets where the letters have two distinct forms. These variants, which may differ markedly in shape and size, are called the uppercase letter (also known as capital or majuscule) and the lowercase letter (also known as small or minuscule). Case mapping is the association of the uppercase and lowercase forms of a letter. <UNICODE>",
      "zh-CHS": "格是某些字母表的特征，字母有两种不同的形式。这些变体在形状和大小上可能存在显著差异，它们被称为大写字母（也称为大写或小写字母）和小写字母（也称为小写或小写字母）。大小写映射是字母大小写形式的关联<UNICODE>"
    },
    {
      "indent": 6,
      "text": "There is usually (but not always) a one-to-one mapping between the same letter in the two cases. However, there are many examples of characters which exist in one case but for which there is no corresponding character in the other case or for which there is a special mapping rule, such as the Turkish dotless \"i\" and some Greek characters with modifiers. Case mapping can even be dependent on locale. Converting text to have only one case is called \"case folding\".",
      "zh-CHS": "在这两种情况下，同一个字母之间通常（但并非总是）存在一对一的映射。但是，有许多字符示例存在于一种情况下，但在另一种情况下没有对应的字符，或者有一个特殊的映射规则，例如土耳其无点“i”和一些带修饰符的希腊字符。案例映射甚至可以依赖于区域设置。将文本转换为只有一个大小写称为“大小写折叠”。"
    },
    {
      "indent": 3,
      "text": "sorting and collation",
      "zh-CHS": "整理"
    },
    {
      "indent": 6,
      "text": "Collating is the process of ordering units of textual information. Collation is usually specific to a particular language. It is sometimes known as alphabetizing, although alphabetization is just a special case of sorting and collation. <UNICODE>",
      "zh-CHS": "排序是对文本信息的单位进行排序的过程。排序规则通常是特定于特定语言的。它有时被称为字母排序，尽管字母排序只是排序和排序的一种特殊情况<UNICODE>"
    },
    {
      "indent": 6,
      "text": "Collation is concerned with the determination of the relative order of any particular pair of strings, and algorithms concerned with collation focus on the problem of providing appropriate weighted keys for string values, to enable binary comparison of the key values to determine the relative ordering of the strings.",
      "zh-CHS": "排序与确定任何特定字符串对的相对顺序有关，与排序相关的算法侧重于为字符串值提供适当的加权键的问题，以使键值的二进制比较能够确定字符串的相对顺序。"
    },
    {
      "indent": 6,
      "text": "Sorting is the process of actually putting data records into specified orders, according to criteria for comparison between the records. Sorting can apply to any kind of data (including textual data) for which an ordering criterion can be defined. Algorithms concerned with sorting focus on the problem of performance (in terms of time, memory, or other resources) in actually putting the data records into a specified order.",
      "zh-CHS": "排序是根据记录之间的比较标准，将数据记录实际放入指定顺序的过程。排序可以应用于可以定义排序标准的任何类型的数据（包括文本数据）。与排序相关的算法关注的是将数据记录按指定顺序实际放入时的性能问题（在时间、内存或其他资源方面）。"
    },
    {
      "indent": 6,
      "text": "A sorting algorithm for string data can be internationalized by providing it with the appropriate collation-weighted keys corresponding to the strings to be ordered.",
      "zh-CHS": "字符串数据的排序算法可以国际化，方法是为其提供与要排序的字符串对应的适当排序加权键。"
    },
    {
      "indent": 6,
      "text": "Many processes have a need to order strings in a consistent sequence (sorted). For only a few CCS/CES combinations, there is an obvious sort order that can be done without reference to the linguistic meaning of the characters: the codepoint order is sufficient for sorting. That is, the codepoint order is also the order that a person would use in sorting the characters. For many CCS/CES combinations, the codepoint order would make no sense to a person and therefore is not useful for sorting if the results will be displayed to a person.",
      "zh-CHS": "许多进程都需要按一致的顺序（排序）对字符串排序。对于少数CCS/CES组合，有一个明显的排序顺序，可以在不参考字符语言含义的情况下完成：代码点顺序足以进行排序。也就是说，代码点顺序也是一个人在对字符进行排序时使用的顺序。对于许多CCS/CES组合，码点顺序对一个人来说毫无意义，因此，如果结果将显示给一个人，则对排序没有用处。"
    },
    {
      "indent": 6,
      "text": "Codepoint order is usually not how any human educated by a local school system expects to see strings ordered; if one orders to the expectations of a human, one has a language-specific sort. Sorting to codepoint order will seem inconsistent if the strings are not normalized before sorting because different representations of the same character will sort differently. This problem may be smaller with a language-specific sort.",
      "zh-CHS": "代码点顺序通常不是任何受过当地学校教育的人期望看到的字符串顺序；如果一个人的命令符合一个人的期望，那么他就有一种特定于语言的命令。如果字符串在排序之前未规范化，则排序到代码点顺序将看起来不一致，因为同一字符的不同表示将以不同方式排序。对于特定于语言的排序，这个问题可能会更小。"
    },
    {
      "indent": 3,
      "text": "code table",
      "zh-CHS": "代码表"
    },
    {
      "indent": 6,
      "text": "A code table is a table showing the characters allocated to the octets in a code. <ISOIEC10646>",
      "zh-CHS": "代码表是显示代码中分配给八位字节的字符的表<ISO10646>"
    },
    {
      "indent": 6,
      "text": "Code tables are also commonly called \"code charts\".",
      "zh-CHS": "代码表通常也称为“代码图”。"
    },
    {
      "indent": 0,
      "text": "4.1 Types of characters",
      "section_title": true,
      "zh-CHS": "4.1 字符类型"
    },
    {
      "indent": 3,
      "text": "The following definitions of types of characters do not clearly delineate each character into one type, nor do they allow someone to accurately predict what types would apply to a particular character. The definitions are intended for application designers to help them think about the many (sometimes confusing) properties of text.",
      "zh-CHS": "以下字符类型的定义不能清楚地将每个字符划分为一种类型，也不能让人们准确地预测将应用于特定字符的类型。这些定义是为了帮助应用程序设计人员思考文本的许多属性（有时令人困惑）。"
    },
    {
      "indent": 3,
      "text": "alphabetic",
      "zh-CHS": "字母的"
    },
    {
      "indent": 6,
      "text": "An informative Unicode property. Characters that are the primary units of alphabets and/or syllabaries, whether combining or noncombining. This includes composite characters that are canonical equivalents to a combining character sequence of an alphabetic base character plus one or more combining characters: letter digraphs; contextual variant of alphabetic characters; ligatures of alphabetic characters; contextual variants of ligatures; modifier letters; letterlike symbols that are compatibility equivalents of single alphabetic letters; and miscellaneous letter elements. <UNICODE>",
      "zh-CHS": "提供信息的Unicode属性。作为字母表和/或音节的主要单位的字符，无论是组合还是非组合。这包括组合字符，其在规范上等同于字母基字符加上一个或多个组合字符的组合字符序列：字母有向图；字母字符的上下文变体；字母字符的连字；连字的语境变体；修饰字母；与单个字母兼容的字母符号；和其他字母元素<UNICODE>"
    },
    {
      "indent": 3,
      "text": "ideographic",
      "zh-CHS": "表意的"
    },
    {
      "indent": 6,
      "text": "Any symbol that primarily denotes an idea (or meaning) in contrast to a sound (or pronunciation), for example, a symbol showing a telephone or the Han characters used in Chinese, Japanese, and Korean. <UNICODE>",
      "zh-CHS": "主要表示与声音（或发音）相反的想法（或意义）的任何符号，例如，表示电话的符号或汉语、日语和韩语中使用的汉字<UNICODE>"
    },
    {
      "indent": 3,
      "text": "punctuation",
      "zh-CHS": "标点符号"
    },
    {
      "indent": 6,
      "text": "Characters that separate units of text, such as sentences and phrases, thus clarifying the meaning of the text. The use of punctuation marks is not limited to prose; they are also used in mathematical and scientific formulae, for example. <UNICODE>",
      "zh-CHS": "分隔文本单位的字符，如句子和短语，从而阐明文本的含义。标点符号的使用不仅限于散文；例如，它们也用于数学和科学公式中<UNICODE>"
    },
    {
      "indent": 3,
      "text": "symbol",
      "zh-CHS": "象征"
    },
    {
      "indent": 6,
      "text": "One of a set of characters other than those used for letters, digits, or punctuation, and representing various concepts generally not connected to written language use per se. Examples include symbols for mathematical operators, symbols for OCR, symbols for box-drawing or graphics, and symbols for dingbats. <NONE>",
      "zh-CHS": "除用于字母、数字或标点符号以外的一组字符中的一个，代表通常与书面语言使用本身无关的各种概念。示例包括用于数学运算符的符号、用于OCR的符号、用于方框图或图形的符号以及用于DINGBAT的符号<无>"
    },
    {
      "indent": 6,
      "text": "Examples of symbols include characters for arrows, faces, and geometric shapes. [UNICODE] has a property that defines characters as symbols.",
      "zh-CHS": "符号示例包括箭头、面和几何形状的字符。[UNICODE]具有将字符定义为符号的属性。"
    },
    {
      "indent": 3,
      "text": "nonspacing character",
      "zh-CHS": "无空格字符"
    },
    {
      "indent": 6,
      "text": "A combining character whose positioning in presentation is dependent on its base character. It generally does not consume space along the visual baseline in and of itself. <UNICODE>",
      "zh-CHS": "一种组合字符，其在表示中的位置取决于其基本字符。它本身通常不会沿视觉基线消耗空间<UNICODE>"
    },
    {
      "indent": 6,
      "text": "A combining acute accent (U+0301) is an example of a nonspacing character.",
      "zh-CHS": "组合急性重音（U+0301）是非空格字符的一个示例。"
    },
    {
      "indent": 3,
      "text": "diacritic",
      "zh-CHS": "变音的"
    },
    {
      "indent": 6,
      "text": "A mark applied or attached to a symbol to create a new symbol that represents a modified or new value. They can also be marks applied to a symbol irrespective of whether it changes the value of that symbol. In the latter case, the diacritic usually represents an independent value (for example, an accent, tone, or some other linguistic information). Also called diacritical mark or diacritical. <UNICODE>",
      "zh-CHS": "应用或附加到符号上的标记，用于创建表示修改值或新值的新符号。它们也可以是应用于符号的标记，而不管它是否更改该符号的值。在后一种情况下，变音符号通常表示一个独立的值（例如，重音、音调或其他一些语言信息）。也称为变音符号或变音符号<UNICODE>"
    },
    {
      "indent": 3,
      "text": "control character",
      "zh-CHS": "控制字符"
    },
    {
      "indent": 6,
      "text": "The 65 characters in the ranges U+0000..U+001F and U+007F..U+009F.\nThey are also known as control codes.  <UNICODE>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "formatting character",
      "zh-CHS": "格式化字符"
    },
    {
      "indent": 6,
      "text": "Characters that are inherently invisible but that have an effect on the surrounding characters. <UNICODE>",
      "zh-CHS": "本质上看不见但对周围角色有影响的角色<UNICODE>"
    },
    {
      "indent": 6,
      "text": "Examples of formatting characters include characters for specifying the direction of text and characters that specify how to join multiple characters.",
      "zh-CHS": "格式化字符的示例包括用于指定文本方向的字符和用于指定如何连接多个字符的字符。"
    },
    {
      "indent": 3,
      "text": "compatibility character",
      "zh-CHS": "兼容性特征"
    },
    {
      "indent": 6,
      "text": "A graphic character included as a coded character of ISO/IEC 10646 primarily for compatibility with existing coded character sets. <ISOIEC10646>",
      "zh-CHS": "作为ISO/IEC 10646编码字符包含的图形字符，主要用于与现有编码字符集兼容<ISO10646>"
    },
    {
      "indent": 6,
      "text": "For example, U+FF01 (FULLWIDTH EXCLAMATION MARK) was included for compatibility with Asian character sets that include full-width and half-width ASCII characters.",
      "zh-CHS": "例如，包含U+FF01（全宽感叹号）是为了与包含全宽和半宽ASCII字符的亚洲字符集兼容。"
    },
    {
      "indent": 0,
      "text": "5. User interface for text",
      "section_title": true,
      "zh-CHS": "5. 文本用户界面"
    },
    {
      "indent": 3,
      "text": "Although the IETF does not standardize user interfaces, many protocols make assumptions about how a user will enter or see text that is used in the protocol. Internationalization challenges assumptions about the type and limitations of the input and output devices that may be used with applications that use various protocols. It is therefore useful to consider how users typically interact with text that might contain one or more non-ASCII characters.",
      "zh-CHS": "尽管IETF没有标准化用户界面，但许多协议都假设用户将如何输入或查看协议中使用的文本。国际化挑战了关于输入和输出设备的类型和限制的假设，这些设备可能与使用各种协议的应用程序一起使用。因此，考虑用户通常如何与可能包含一个或多个非ASCII字符的文本交互是有用的。"
    },
    {
      "indent": 3,
      "text": "input methods",
      "zh-CHS": "输入法"
    },
    {
      "indent": 6,
      "text": "An input method is a mechanism for a person to enter text into an application. <NONE>",
      "zh-CHS": "输入法是一种用于将文本输入应用程序的机制<无>"
    },
    {
      "indent": 6,
      "text": "Text can be entered into a computer in many ways. Keyboards are by far the most common device used, but many characters cannot be entered on typical computer keyboards in a single stroke. Many operating systems come with system software that lets users input characters outside the range of what is allowed by keyboards.",
      "zh-CHS": "文本可以通过多种方式输入计算机。键盘是目前最常用的设备，但许多字符无法在典型的计算机键盘上一笔输入。许多操作系统都配有系统软件，允许用户输入键盘允许范围以外的字符。"
    },
    {
      "indent": 6,
      "text": "For example, there are dozens of different input methods for Han characters in Chinese, Japanese, and Korean. Some start with phonetic input through the keyboard, while others use the number of strokes in the character. Input methods are also needed for scripts that have many diacritics, such as European characters that have two or three diacritics on a single alphabetic character.",
      "zh-CHS": "例如，汉语、日语和韩语中有几十种不同的汉字输入方法。一些是通过键盘输入语音，而另一些是使用字符的笔划数。对于具有许多变音符号的脚本，也需要输入方法，例如在一个字母字符上有两个或三个变音符号的欧洲字符。"
    },
    {
      "indent": 3,
      "text": "rendering rules",
      "zh-CHS": "渲染规则"
    },
    {
      "indent": 6,
      "text": "A rendering rule is an algorithm that a system uses to decide how to display a string of text. <NONE>",
      "zh-CHS": "渲染规则是系统用来决定如何显示文本字符串的算法<无>"
    },
    {
      "indent": 6,
      "text": "Some scripts can be directly displayed with fonts, where each character from an input stream can simply be copied from a glyph system and put on the screen or printed page. Other scripts need rules that are based on the context of the characters in order to render text for display.",
      "zh-CHS": "有些脚本可以直接用字体显示，其中输入流中的每个字符可以简单地从字形系统复制并放在屏幕或打印页面上。其他脚本需要基于字符上下文的规则来呈现文本以供显示。"
    },
    {
      "indent": 6,
      "text": "Some examples of these rendering rules include:",
      "zh-CHS": "这些渲染规则的一些示例包括："
    },
    {
      "indent": 9,
      "text": "- Scripts such as Arabic (and many others), where the form of the letter changes depending on the adjacent letters, whether the letter is standing alone, at the beginning of a word, in the middle of a word, or at the end of a word. The rendering rules must choose between two or more glyphs.",
      "zh-CHS": "- 诸如阿拉伯语（以及许多其他）的脚本，其中字母的形式取决于相邻字母，无论字母是独立的，在单词的开头，在单词的中间，或在单词的结尾。渲染规则必须在两个或多个图示符之间进行选择。"
    },
    {
      "indent": 9,
      "text": "- Scripts such as the Indic scripts, where consonants may change their form if they are adjacent to certain other consonants or may be displayed in an order different from the way they are stored and pronounced. The rendering rules must choose between two or more glyphs.",
      "zh-CHS": "- 例如印度语脚本，如果辅音与某些其他辅音相邻，则辅音可能改变其形式，或者可能以不同于其存储和发音方式的顺序显示。渲染规则必须在两个或多个图示符之间进行选择。"
    },
    {
      "indent": 9,
      "text": "- Arabic and Hebrew scripts, where the order of the characters displayed are changed by the bidirectional properties of the alphabetic characters and with right-to-left and left-to-right ordering marks. The rendering rules must choose the order that characters are displayed.",
      "zh-CHS": "- 阿拉伯文和希伯来文脚本，其中显示的字符顺序由字母字符的双向属性更改，并带有从右到左和从左到右的顺序标记。渲染规则必须选择字符的显示顺序。"
    },
    {
      "indent": 3,
      "text": "graphic symbol",
      "zh-CHS": "图形符号"
    },
    {
      "indent": 6,
      "text": "A graphic symbol is the visual representation of a graphic character or of a composite sequence. <ISOIEC10646>",
      "zh-CHS": "图形符号是图形字符或复合序列的视觉表示<ISO10646>"
    },
    {
      "indent": 3,
      "text": "font",
      "zh-CHS": "字体"
    },
    {
      "indent": 6,
      "text": "A font is a collection of glyphs used for the visual depiction of character data. A font is often associated with a set of parameters (for example, size, posture, weight, and serifness), which, when set to particular values, generate a collection of imagable glyphs. <UNICODE>",
      "zh-CHS": "字体是用于可视化描述字符数据的字形集合。字体通常与一组参数（例如，大小、姿势、重量和衬度）相关联，当设置为特定值时，这些参数会生成一组可想象的字形<UNICODE>"
    },
    {
      "indent": 3,
      "text": "bidirectional display",
      "zh-CHS": "双向显示"
    },
    {
      "indent": 6,
      "text": "The process or result of mixing left-to-right oriented text and right-to-left oriented text in a single line is called bidirectional display. <UNICODE>",
      "zh-CHS": "将从左到右的文本和从右到左的文本混合在一行中的过程或结果称为双向显示<UNICODE>"
    },
    {
      "indent": 6,
      "text": "Most of the world's written languages are displayed left-to-right. However, many widely-used written languages such as ones based on the Hebrew or Arabic scripts are displayed right-to-left. Right-to-left text often confuses protocol writers because they have to keep thinking in terms of the order of characters in a string in memory, and that order might be different than what they see on the screen. (Note that some languages are written both horizontally and vertically.)",
      "zh-CHS": "世界上大多数书面语言都是从左到右显示的。然而，许多广泛使用的书面语言，如基于希伯来语或阿拉伯语的文字，从右到左显示。从右到左的文本通常会使协议编写者感到困惑，因为他们必须一直按照内存中字符串的顺序思考，而这种顺序可能与他们在屏幕上看到的顺序不同。（请注意，有些语言是水平和垂直书写的。）"
    },
    {
      "indent": 6,
      "text": "Further, bidirectional text can cause confusion because there are formatting characters in ISO/IEC 10646 which cause the order of display of text to change. These explicit formatting characters change the display regardless of the implicit left-to-right or right-to-left properties of characters.",
      "zh-CHS": "此外，双向文本可能导致混淆，因为ISO/IEC 10646中存在导致文本显示顺序改变的格式化字符。无论字符的隐式从左到右或从右到左属性如何，这些显式格式字符都会更改显示。"
    },
    {
      "indent": 6,
      "text": "It is common to see strings with text in both directions, such as strings that include both text and numbers, or strings that contain a mixture of scripts.",
      "zh-CHS": "在两个方向上都有文本的字符串很常见，例如同时包含文本和数字的字符串，或者包含混合脚本的字符串。"
    },
    {
      "indent": 6,
      "text": "[UNICODE] has a long and incredibly detailed algorithm for displaying bidirectional text.",
      "zh-CHS": "[UNICODE]有一个长且非常详细的算法来显示双向文本。"
    },
    {
      "indent": 3,
      "text": "undisplayable character",
      "zh-CHS": "不可展开字符"
    },
    {
      "indent": 6,
      "text": "A character that has no displayable form. <NONE>",
      "zh-CHS": "没有可显示形式的字符<无>"
    },
    {
      "indent": 6,
      "text": "For instance, the zero-width space (U+200B) cannot be displayed because it takes up no horizontal space. Formatting characters such as those for setting the direction of text are also undisplayable. Note, however, that every character in [UNICODE] has a glyph associated with it, and that the glyphs for undisplayable characters are enclosed in a dashed square as an indication that the actual character is undisplayable.",
      "zh-CHS": "例如，零宽度空间（U+200B）无法显示，因为它不占用水平空间。格式化字符（如用于设置文本方向的字符）也不可显示。但是，请注意，[UNICODE]中的每个字符都有一个与其关联的标志符号，并且不可显示字符的标志符号包含在一个虚线方框中，表示实际字符不可显示。"
    },
    {
      "indent": 0,
      "text": "6. Text in current IETF protocols",
      "section_title": true,
      "zh-CHS": "6. 当前IETF协议中的文本"
    },
    {
      "indent": 3,
      "text": "Many IETF protocols started off being fully internationalized, while others have been internationalized as they were revised. In this process, IETF members have seen patterns in the way that many protocols use text. This section describes some specific protocol interactions with text.",
      "zh-CHS": "许多IETF协议一开始是完全国际化的，而其他协议在修订时已经国际化。在这个过程中，IETF成员看到了许多协议使用文本的方式。本节介绍一些与文本的特定协议交互。"
    },
    {
      "indent": 3,
      "text": "protocol elements",
      "zh-CHS": "协议要素"
    },
    {
      "indent": 6,
      "text": "Protocol elements are uniquely-named parts of a protocol. <NONE>",
      "zh-CHS": "协议元素是协议的唯一命名部分<无>"
    },
    {
      "indent": 6,
      "text": "Almost every protocol has named elements, such as \"source port\" in TCP. In some protocols, the names of the elements (or text tokens for the names) are transmitted within the protocol. For example, in SMTP and numerous other IETF protocols, the names of the verbs are part of the command stream. The names are thus part of the protocol standard. The names of protocol elements are not normally seen by end users.",
      "zh-CHS": "几乎每个协议都有命名元素，例如TCP中的“源端口”。在某些协议中，元素的名称（或名称的文本标记）在协议中传输。例如，在SMTP和许多其他IETF协议中，动词的名称是命令流的一部分。因此，这些名称是协议标准的一部分。终端用户通常看不到协议元素的名称。"
    },
    {
      "indent": 3,
      "text": "name spaces",
      "zh-CHS": "名称空间"
    },
    {
      "indent": 6,
      "text": "A name space is the set of valid names for a particular item, or the syntactic rules for generating these valid names. <NONE>",
      "zh-CHS": "名称空间是特定项的有效名称集，或者是生成这些有效名称的语法规则<无>"
    },
    {
      "indent": 6,
      "text": "Many items in Internet protocols use names to identify specific instances or values. The names may be generated (by some prescribed rules), registered centrally (e.g., such as with IANA), or have a distributed registration and control mechanism, such as the names in the DNS.",
      "zh-CHS": "Internet协议中的许多项使用名称来标识特定实例或值。这些名称可以（通过某些规定的规则）生成、集中注册（例如，使用IANA），或者具有分布式注册和控制机制，例如DNS中的名称。"
    },
    {
      "indent": 3,
      "text": "on-the-wire encoding",
      "zh-CHS": "论有线编码"
    },
    {
      "indent": 6,
      "text": "The encoding and decoding used before and after transmission over the network is often called the \"on-the-wire\" (or sometimes just \"wire\") format. <NONE>",
      "zh-CHS": "在通过网络传输之前和之后使用的编码和解码通常称为“在线”（有时只是“在线”）格式<无>"
    },
    {
      "indent": 6,
      "text": "Characters are identified by codepoints. Before being transmitted in a protocol, they must first be encoded as bits and octets. Similarly, when characters are received in a transmission, they have been encoded, and a protocol that needs to process the individual characters needs to decode them before processing.",
      "zh-CHS": "字符由代码点标识。在协议中传输之前，必须首先将其编码为位和八位字节。类似地，当在传输中接收到字符时，它们已经被编码，并且需要处理单个字符的协议需要在处理之前对它们进行解码。"
    },
    {
      "indent": 3,
      "text": "parsed text",
      "zh-CHS": "解析文本"
    },
    {
      "indent": 6,
      "text": "Text strings that is analyzed for subparts. <NONE>",
      "zh-CHS": "分析子部分的文本字符串<无>"
    },
    {
      "indent": 6,
      "text": "In some protocols, free text in text fields might be parsed. For example, many mail user agents will parse the words in the text of the Subject: field to attempt to thread based on what appears after the \"Re:\" prefix.",
      "zh-CHS": "在某些协议中，可以解析文本字段中的自由文本。例如，许多邮件用户代理将解析Subject:字段文本中的单词，以根据“Re:”前缀后出现的内容尝试执行线程。"
    },
    {
      "indent": 3,
      "text": "charset identification",
      "zh-CHS": "字符集识别"
    },
    {
      "indent": 6,
      "text": "Specification of the charset used for a string of text. <NONE>",
      "zh-CHS": "用于文本字符串的字符集的规范<无>"
    },
    {
      "indent": 6,
      "text": "Protocols that allow more than one charset to be used in the same place should require that the text be identified with the appropriate charset. Without this identification, a program looking at the text cannot definitively discern the charset of the text. Charset identification is also called \"charset tagging\".",
      "zh-CHS": "允许在同一位置使用多个字符集的协议应要求使用适当的字符集标识文本。如果没有此标识，查看文本的程序就无法最终识别文本的字符集。字符集标识也称为“字符集标记”。"
    },
    {
      "indent": 3,
      "text": "language identification",
      "zh-CHS": "语言识别"
    },
    {
      "indent": 6,
      "text": "Specification of the human language used for a string of text. <NONE>",
      "zh-CHS": "用于文本字符串的人类语言规范<无>"
    },
    {
      "indent": 6,
      "text": "Some protocols (such as MIME and HTTP) allow text that is meant for machine processing to be identified with the language used in the text. Such identification is important for machine-processing of the text, such as by systems that render the text by speaking it. Language identification is also called \"language tagging\".",
      "zh-CHS": "某些协议（如MIME和HTTP）允许使用文本中使用的语言来标识用于机器处理的文本。这种识别对于文本的机器处理非常重要，例如通过系统通过说出文本来呈现文本。语言识别也称为“语言标记”。"
    },
    {
      "indent": 3,
      "text": "MIME",
      "zh-CHS": "哑剧表演"
    },
    {
      "indent": 6,
      "text": "MIME (Multipurpose Internet Mail Extensions) is a message format that allows for textual message bodies and headers in character sets other than US-ASCII in formats that require ASCII (most notably, [RFC2822], the standard for Internet mail headers). MIME is described in RFCs 2045 through 2049, as well as more recent RFCs. <NONE>",
      "zh-CHS": "MIME（Multipurpose Internet Mail Extensions，多用途Internet邮件扩展）是一种消息格式，它允许文本消息正文和字符集中的标题，而不是要求ASCII格式的US-ASCII（最显著的是，[RFC2822]，Internet邮件标题的标准）。MIME在RFCs 2045到2049以及最近的RFCs中有描述<无>"
    },
    {
      "indent": 3,
      "text": "transfer encoding syntax",
      "zh-CHS": "传输编码语法"
    },
    {
      "indent": 6,
      "text": "A transfer encoding syntax (TES) (sometimes called a transfer encoding scheme) is a reversible transform of already-encoded data that is represented in one or more character encoding schemes. <NONE>",
      "zh-CHS": "传输编码语法（TES）（有时称为传输编码方案）是在一个或多个字符编码方案中表示的已编码数据的可逆转换<无>"
    },
    {
      "indent": 6,
      "text": "TESs are useful for encoding types of character data into an another format, usually for allowing new types of data to be transmitted over legacy protocols. The main examples of TESs used in the IETF include Base64 and quoted-printable.",
      "zh-CHS": "TESs用于将字符数据类型编码为另一种格式，通常用于允许通过传统协议传输新类型的数据。IETF中使用的TESs的主要示例包括Base64和引用的printable。"
    },
    {
      "indent": 3,
      "text": "Base64",
      "zh-CHS": "Base64"
    },
    {
      "indent": 6,
      "text": "Base64 is a transfer encoding syntax that allows binary data to be\nrepresented by the ASCII characters A through Z, a through z, 0\nthrough 9, +, /, and =.  It is defined in [RFC2045].  <NONE>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "quoted printable",
      "zh-CHS": "引用可打印"
    },
    {
      "indent": 6,
      "text": "Quoted printable is a transfer encoding syntax that allows strings that have non-ASCII characters mixed in with mostly ASCII printable characters to be somewhat human readable. It is described in [RFC2047]. <NONE>",
      "zh-CHS": "Quoted printable是一种传输编码语法，它允许非ASCII字符与大部分ASCII可打印字符混合的字符串具有一定的可读性。[RFC2047]对此进行了描述<无>"
    },
    {
      "indent": 6,
      "text": "The quoted printable syntax is generally considered to be a failure at being readable. It is jokingly referred to as \"quoted unreadable\".",
      "zh-CHS": "引用的可打印语法通常被认为是不可读的。它被戏称为“引用的不可读”。"
    },
    {
      "indent": 3,
      "text": "XML",
      "zh-CHS": "XML"
    },
    {
      "indent": 6,
      "text": "XML (which is an approximate abbreviation for Extensible Markup\nLanguage) is a popular method for structuring text.  XML text is\nexplicitly tagged with charsets.  The specification for XML can be\nfound at <http://www.w3.org/XML/>.  <NONE>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ASN.1 text formats",
      "zh-CHS": "ASN.1文本格式"
    },
    {
      "indent": 6,
      "text": "The ASN.1 data description language has many formats for text data. The formats allow for different repertoires and different encodings. Some of the formats that appear in IETF standards based on ASN.1 include IA5String (all ASCII characters), PrintableString (most ASCII characters, but missing many punctuation characters), BMPString (characters from ISO/IEC 10646 plane 0 in UTF-16BE format), UTF8String (just as the name implies), and TeletexString (also called T61String; the repertoire changes over time).",
      "zh-CHS": "ASN.1数据描述语言有多种文本数据格式。这些格式允许不同的曲目和不同的编码。基于ASN.1的IETF标准中出现的一些格式包括IA5String（所有ASCII字符）、PrintableString（大多数ASCII字符，但缺少许多标点字符）、BMPString（UTF-16BE格式的ISO/IEC 10646平面0中的字符）、UTF8String（顾名思义）和TeletextString（也称为T61String；曲目随时间而变化）。"
    },
    {
      "indent": 3,
      "text": "ASCII-compatible encoding (ACE)",
      "zh-CHS": "ASCII兼容编码（ACE）"
    },
    {
      "indent": 6,
      "text": "Starting in 1996, many ASCII-compatible encoding schemes (which are actually transfer encoding syntaxes) have been proposed as possible solutions for internationalizing host names. Their goal is to be able to encode any string of ISO/IEC 10646 characters as legal DNS host names (as described in STD 13). At the time of this writing, no ACE has become an IETF standard.",
      "zh-CHS": "从1996年开始，许多ASCII兼容编码方案（实际上是传输编码语法）被提出作为国际化主机名的可能解决方案。他们的目标是能够将ISO/IEC 10646字符的任何字符串编码为合法DNS主机名（如STD 13所述）。在撰写本文时，没有ACE成为IETF标准。"
    },
    {
      "indent": 0,
      "text": "7. Other Common Terms In Internationalization",
      "section_title": true,
      "zh-CHS": "7. 国际化中的其他常用术语"
    },
    {
      "indent": 3,
      "text": "This is a hodge-podge of other terms that have appeared in internationalization discussions in the IETF. It is likely that additional terms will be added as this document matures.",
      "zh-CHS": "这是IETF国际化讨论中出现的其他术语的大杂烩。随着本文件的到期，可能会增加额外的条款。"
    },
    {
      "indent": 3,
      "text": "locale",
      "zh-CHS": "场所"
    },
    {
      "indent": 6,
      "text": "Locale is the user-specific location and cultural information managed by a computer. <NONE>",
      "zh-CHS": "Locale是由计算机管理的用户特定位置和文化信息<无>"
    },
    {
      "indent": 6,
      "text": "Because languages differ from country to country (and even region to region within a country), the locale of the user can often be an important factor. Typically, the locale information for a user includes the language(s) used.",
      "zh-CHS": "由于语言因国家而异（甚至一个国家内的地区不同），因此用户的语言环境往往是一个重要因素。通常，用户的区域设置信息包括所使用的语言。"
    },
    {
      "indent": 6,
      "text": "Locale issues go beyond character use, and can include things such as the display format for currency, dates, and times. Some locales (especially the popular \"C\" and \"POSIX\" locales) do not include language information.",
      "zh-CHS": "区域设置问题超出了字符使用范围，可能包括货币、日期和时间的显示格式等内容。某些地区（特别是流行的“C”和“POSIX”地区）不包含语言信息。"
    },
    {
      "indent": 6,
      "text": "It should be noted that there are many thorny, unsolved issues with locale. For example, should text be viewed using the locale information of the person who wrote the text or the person viewing it? What if the person viewing it is travelling to different locations? Should only some of the locale information affect creation and editing of text?",
      "zh-CHS": "应该注意的是，locale有许多棘手的、未解决的问题。例如，应该使用编写文本的人或查看文本的人的区域设置信息来查看文本吗？如果观看它的人正在前往不同的地点怎么办？是否只有部分区域设置信息会影响文本的创建和编辑？"
    },
    {
      "indent": 3,
      "text": "Latin characters",
      "zh-CHS": "拉丁字符"
    },
    {
      "indent": 6,
      "text": "\"Latin characters\" is a not-precise term for characters historically related to ancient Greek script and currently used throughout the world. <NONE>",
      "zh-CHS": "“拉丁字符”是一个不精确的术语，指历史上与古希腊文字有关的字符，目前在世界各地使用<无>"
    },
    {
      "indent": 6,
      "text": "The base Latin characters make up the ASCII repertoire and have been augmented by many single and multiple diacritics and quite a few other characters. ISO/IEC 10646 encodes the Latin characters in the ranges U+0020..U+024F, U+1E00..U+1EFF, and other ranges.",
      "zh-CHS": "基本拉丁字符构成了ASCII指令集，并被许多单字符和多字符变音符号以及许多其他字符所扩充。ISO/IEC 10646对U+0020..U+024F、U+1E00..U+1EFF和其他范围内的拉丁字符进行编码。"
    },
    {
      "indent": 3,
      "text": "romanization",
      "zh-CHS": "罗马化"
    },
    {
      "indent": 6,
      "text": "The transliteration of a non-Latin script into Latin characters. <NONE>",
      "zh-CHS": "将非拉丁文字音译成拉丁文字<无>"
    },
    {
      "indent": 6,
      "text": "Because of the widespread use of Latin characters, people have tried to represent many languages that are not based on a Latin repertoire in Latin. For example, there are two popular romanizations of Chinese: Wade-Giles and Pinyin, the latter of which is by far more common today. Many romanization systems are inexact and do not give perfect round trip mappings between the native script and the Latin characters.",
      "zh-CHS": "由于拉丁字符的广泛使用，人们试图用拉丁语来表示许多不以拉丁语为基础的语言。例如，汉语有两种流行的罗马化：韦德·吉尔斯（Wade Giles）和拼音，后者在今天更为常见。许多罗马化系统是不精确的，不能在本地脚本和拉丁字符之间提供完美的往返映射。"
    },
    {
      "indent": 3,
      "text": "CJK characters and Han characters",
      "zh-CHS": "汉字与汉字"
    },
    {
      "indent": 6,
      "text": "The ideographic characters used in Chinese, Japanese, Korean, and traditional Vietnamese writing systems are often called 'CJK characters' after the initial letters of the language names in English. They are also called \"Han characters\", after the term in Chinese that is often used for these characters. <NONE>",
      "zh-CHS": "中文、日文、韩文和传统越南语书写系统中使用的表意文字通常在英文名称的首字母后称为“CJK字符”。他们也被称为“汉字”，在汉语中经常用于这些汉字<无>"
    },
    {
      "indent": 6,
      "text": "Note that CJK and Han characters do not include the phonetic characters used in the Japanese and Korean languages.",
      "zh-CHS": "请注意，CJK和汉字不包括日语和韩语中使用的拼音字符。"
    },
    {
      "indent": 6,
      "text": "In ISO/IEC 10646, the Han characters were \"unified\", meaning that each set of Han characters from Japanese, Chinese, and/or Korean that had the same origin was assigned a single code point. The positive result of this was that many fewer code points were needed to represent Han; the negative result of this was that characters that people who write the three languages think are different have the same code point. There is a great deal of disagreement on the nature, the origin, and the severity of the problems caused by Han unification.",
      "zh-CHS": "在ISO/IEC 10646中，汉字是“统一”的，这意味着来自日语、汉语和/或韩语的具有相同来源的每组汉字都被分配一个代码点。这样做的积极结果是，代表汉族所需的代码点要少得多；这样做的负面结果是，编写这三种语言的人认为不同的字符具有相同的代码点。关于汉朝统一所造成的问题的性质、根源和严重性，存在着很大的分歧。"
    },
    {
      "indent": 3,
      "text": "translation",
      "zh-CHS": "翻译"
    },
    {
      "indent": 6,
      "text": "The process of conveying the meaning of some passage of text in one language, so that it can be expressed equivalently in another language. <NONE>",
      "zh-CHS": "用一种语言表达某段文字的意思，以便用另一种语言表达的过程<无>"
    },
    {
      "indent": 6,
      "text": "Many language translation systems are inexact and cannot be applied repeatedly to go from one language to another to another.",
      "zh-CHS": "许多语言翻译系统是不精确的，不能重复地应用于从一种语言到另一种语言的翻译。"
    },
    {
      "indent": 3,
      "text": "transliteration",
      "zh-CHS": "音译"
    },
    {
      "indent": 6,
      "text": "The process of representing the characters of an alphabetical or syllabic system of writing by the characters of a conversion alphabet. <NONE>",
      "zh-CHS": "用转换字母表的字符表示字母或音节书写系统的字符的过程<无>"
    },
    {
      "indent": 6,
      "text": "Many script transliterations are exact, and many have perfect round-trip mappings. The notable exception to this is romanization, described above. Transliteration involves converting text expressed in one script into another script, generally on a letter-by-letter basis.",
      "zh-CHS": "许多脚本的音译都是精确的，并且许多都有完美的往返映射。值得注意的例外是上文所述的罗马化。音译包括将一个脚本中表达的文本转换成另一个脚本，通常是逐字翻译。"
    },
    {
      "indent": 3,
      "text": "transcription",
      "zh-CHS": "转录"
    },
    {
      "indent": 6,
      "text": "The process of systematically writing the sounds of some passage of spoken language, generally with the use of a technical phonetic alphabet (usually Latin-based) or other systematic transcriptional orthography. Transcription also sometimes refers to the conversion of written text into a transcribed (usually Latin-based) form, based on the sound of the text as if it had been spoken. <NONE>",
      "zh-CHS": "系统地书写口语中某些段落的声音的过程，通常使用技术语音字母表（通常以拉丁语为基础）或其他系统的转录正字法。抄写有时也指将书面文本转换成抄写（通常以拉丁语为基础）形式，以文本的声音为基础，就好像它是口语一样<无>"
    },
    {
      "indent": 6,
      "text": "Unlike transliterations, which are generally designed to be round-trip convertible, transcriptions of written material are almost never round-trip convertible to their original form.",
      "zh-CHS": "与音译不同，音译通常被设计成可来回转换的形式，书面材料的抄本几乎从不可来回转换为原始形式。"
    },
    {
      "indent": 3,
      "text": "regular expressions",
      "zh-CHS": "正则表达式"
    },
    {
      "indent": 6,
      "text": "Regular expressions provide a mechanism to select specific strings from a set of character strings. Regular expressions are a language used to search for text within strings, and possibly modify the text found with other text. <NONE>",
      "zh-CHS": "正则表达式提供了一种从一组字符串中选择特定字符串的机制。正则表达式是一种用于搜索字符串中的文本的语言，并且可能会修改与其他文本一起找到的文本<无>"
    },
    {
      "indent": 6,
      "text": "Pattern matching for text involves being able to represent one or more code points in an abstract notation, such as searching for all capital Latin letters or all punctuation. The most common mechanism in IETF protocols for naming such patterns is the use of regular expressions. There is no single regular expression language, but there are numerous very similar dialects.",
      "zh-CHS": "文本模式匹配涉及到能够以抽象符号表示一个或多个代码点，例如搜索所有大写拉丁字母或所有标点符号。IETF协议中命名此类模式的最常见机制是使用正则表达式。没有单一的正则表达式语言，但有许多非常相似的方言。"
    },
    {
      "indent": 6,
      "text": "The Unicode Consortium has a good discussion about how to adapt regular expression engines to use Unicode. [UTR18]",
      "zh-CHS": "Unicode联盟就如何调整正则表达式引擎以使用Unicode进行了很好的讨论。[18]"
    },
    {
      "indent": 3,
      "text": "private use",
      "zh-CHS": "私用"
    },
    {
      "indent": 6,
      "text": "ISO/IEC 10646 code points from U+E000 to U+F8FF, U+F0000 to\nU+FFFFD, and U+100000 to U+10FFFD are available for private use.\nThis refers to code points of the standard whose interpretation is\nnot specified by the standard and whose use may be determined by\nprivate agreement among cooperating users.  <UNICODE>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "The use of these \"private use\" characters is defined by the parties who transmit and receive them, and is thus not appropriate for standardization. (The IETF has a long history of private use names for things such as \"x-\" names in MIME types, charsets, and languages. The experience with these has been quite negative, with many implementors assuming that private use names are in fact public and long-lived.)",
      "zh-CHS": "这些“专用”字符的使用由发送和接收它们的各方定义，因此不适合标准化。（IETF在诸如MIME类型、字符集和语言中的“x-”名称的私有使用名称方面有着悠久的历史。使用这些名称的经验是相当负面的，许多实现者认为私有使用名称实际上是公共的和长期存在的。）"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Security is not discussed in this document.",
      "zh-CHS": "本文件不讨论安全性。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1 Normative References",
      "section_title": true,
      "zh-CHS": "9.1 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISOIEC10646] ISO/IEC 10646-1:2000. International Standard -- Information technology -- Universal Multiple-Octet Coded Character Set (UCS) -- Part 1: Architecture and Basic Multilingual Plane, 2000.",
      "zh-CHS": "[ISO10646]ISO/IEC10646-1:2000。国际标准信息技术通用多八位编码字符集（UCS）第1部分：体系结构和基本多语言平面，2000。"
    },
    {
      "indent": 3,
      "text": "[UNICODE] The Unicode Standard, Version 3.2.0 is defined by The Unicode Standard, Version 3.0 (Reading, MA, Addison-Wesley, 2000. ISBN 0-201-61633-5), as amended by the Unicode Standard Annex #27: Unicode 3.1 (http://www.unicode.org/reports/tr27/) and by the Unicode Standard Annex #28: Unicode 3.2 (http://www.unicode.org/reports/tr28/), The Unicode Consortium, 2002.",
      "zh-CHS": "[UNICODE]UNICODE标准3.2.0版由UNICODE标准3.0版（雷丁，马萨诸塞州，Addison-Wesley，2000.ISBN 0-201-61633-5）定义，并由UNICODE标准附录27:UNICODE 3.1修订(http://www.unicode.org/reports/tr27/)根据Unicode标准附录#28:Unicode 3.2(http://www.unicode.org/reports/tr28/),Unicode联合会，2002年。"
    },
    {
      "indent": 0,
      "text": "9.2 Informative References",
      "section_title": true,
      "zh-CHS": "9.2 资料性引用"
    },
    {
      "indent": 3,
      "text": "[CHARMOD] Character Model for the World Wide Web 1.0, W3C, <http://www.w3.org/TR/charmod/>.",
      "zh-CHS": "[CHARMOD]万维网1.0字符模型，W3C<http://www.w3.org/TR/charmod/>."
    },
    {
      "indent": 3,
      "text": "[FRAMEWORK] ISO/IEC TR 11017:1997(E). Information technology - Framework for internationalization, prepared by ISO/IEC JTC 1/SC 22/WG 20, 1997.",
      "zh-CHS": "[框架]ISO/IEC TR 11017:1997（E）。信息技术.国际化框架，由ISO/IEC JTC 1/SC 22/WG 20编制，1997年。"
    },
    {
      "indent": 3,
      "text": "[ISO 639] ISO 639:2000 (E/F) - Code for the representation of names of languages, 2000.",
      "zh-CHS": "[ISO 639]ISO 639:2000（E/F）-语言名称表示代码，2000年。"
    },
    {
      "indent": 3,
      "text": "[ISO 3166] ISO 3166:1988 (E/F) - Codes for the representation of names of countries, 2000.",
      "zh-CHS": "[ISO 3166]ISO 3166:1988（E/F）-国家名称表示代码，2000年。"
    },
    {
      "indent": 3,
      "text": "[RFC2045] Freed, N. and N. Borenstein, \"MIME Part One: Format of Internet Message Bodies\", November 1996.",
      "zh-CHS": "[RFC2045]Freed，N.和N.Borenstein，“MIME第一部分：互联网消息体的格式”，1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2047] Moore, K., \"MIME Part Three: Message Header Extensions for Non-ASCII Text\", RFC 2047, November 1996.",
      "zh-CHS": "[RFC2047]Moore，K.，“MIME第三部分：非ASCII文本的消息头扩展”，RFC 20471996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2277] Alvestrand, H., \"IETF Policy on Character Sets and Languages\", BCP 18, RFC 2277, January 1998.",
      "zh-CHS": "[RFC2277]Alvestrand，H.，“IETF字符集和语言政策”，BCP 18，RFC 2277，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2279] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", RFC 2279, January 1998.",
      "zh-CHS": "[RFC2279]Yergeau，F.，“UTF-8，ISO 10646的转换格式”，RFC 2279，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2781] Hoffman, P. and F. Yergeau, \"UTF-16, an encoding of ISO 10646\", RFC 2781, February 2000.",
      "zh-CHS": "[RFC2781]Hoffman，P.和F.Yergeau，“UTF-16，ISO 10646编码”，RFC 2781，2000年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2822] Resnick, P., \"Internet Message Format\", RFC 2822, April 2001.",
      "zh-CHS": "[RFC2822]Resnick，P.，“互联网信息格式”，RFC 2822，2001年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3066] Alvestrand, H., \"Tags for the Identification of Languages\", BCP 47, RFC 3066, January 2001.",
      "zh-CHS": "[RFC3066]Alvestrand，H.，“语言识别标签”，BCP 47，RFC 3066，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[US-ASCII] Coded Character Set -- 7-bit American Standard Code for Information Interchange, ANSI X3.4-1986, 1986.",
      "zh-CHS": "[US-ASCII]编码字符集——信息交换用7位美国标准代码，ANSI X3.4-1986，1986。"
    },
    {
      "indent": 3,
      "text": "[UTN6] \"BOCU-1: MIME-Compatible Unicode Compression\", M. Scherer & M. Davis, Unicode Technical Note #6.",
      "zh-CHS": "[UTN6]“BOCU-1:MIME兼容的Unicode压缩”，M.Scherer&M.Davis，Unicode技术说明#6。"
    },
    {
      "indent": 3,
      "text": "[UTR6] \"A Standard Compression Scheme for Unicode\", M. Wolf, et. al., Unicode Technical Report #6.",
      "zh-CHS": "[UTR6]“Unicode的标准压缩方案”，M.Wolf等人，Unicode技术报告#6。"
    },
    {
      "indent": 3,
      "text": "[UTR15] \"Unicode Normalization Forms\", M. Davis & M. Duerst, Unicode Technical Report #15.",
      "zh-CHS": "[UTR15]“Unicode规范化表单”，M.Davis&M.Duerst，Unicode技术报告#15。"
    },
    {
      "indent": 3,
      "text": "[UTR18] \"Unicode Regular Expression Guidelines\", M. Davis, Unicode Technical Report #18.",
      "zh-CHS": "[UTR18]“Unicode正则表达式指南”，M.Davis，Unicode技术报告#18。"
    },
    {
      "indent": 3,
      "text": "[UTR19] \"UTF-32\", M. Davis, Unicode Technical Report #19.",
      "zh-CHS": "[UTR19]“UTF-32”，M.Davis，Unicode技术报告#19。"
    },
    {
      "indent": 3,
      "text": "[UTR22] \"Character Mapping Markup Language\", M. Davis, Unicode Technical Report #22.",
      "zh-CHS": "[UTR22]“字符映射标记语言”，M.Davis，Unicode技术报告#22。"
    },
    {
      "indent": 0,
      "text": "10. Additional Interesting Reading",
      "section_title": true,
      "zh-CHS": "10. 额外有趣的阅读"
    },
    {
      "indent": 3,
      "text": "ALA-LC Romanization Tables, Randall Barry (ed.), U.S. Library of Congress, 1997, ISBN 0844409405",
      "zh-CHS": "ALA-LC罗马化表，Randall Barry（编辑），美国国会图书馆，1997年，ISBN 0844409405"
    },
    {
      "indent": 3,
      "text": "Blackwell Encyclopedia of Writing Systems, Florian Coulmas, Blackwell Publishers, 1999, ISBN 063121481X",
      "zh-CHS": "布莱克威尔写作系统百科全书，弗洛里安·库尔马斯，布莱克威尔出版社，1999年，ISBN 06312481X"
    },
    {
      "indent": 3,
      "text": "The World's Writing Systems, Peter Daniels and William Bright, Oxford University Press, 1996, ISBN 0195079930",
      "zh-CHS": "《世界写作系统》，彼得·丹尼尔斯和威廉·布赖特，牛津大学出版社，1996年，ISBN 0195079930"
    },
    {
      "indent": 3,
      "text": "Writing Systems of the World, Akira Nakanishi, Charles E. Tuttle Company, 1980, ISBN 0804816549",
      "zh-CHS": "《世界书写系统》，中山明，查尔斯·E·塔特尔公司，1980年，ISBN 0804816549"
    },
    {
      "indent": 0,
      "text": "11. Index",
      "section_title": true,
      "zh-CHS": "11. 指数"
    },
    {
      "indent": 3,
      "text": "alphabetic -- 4.1 ASCII-compatible encoding (ACE) -- 6 ASN.1 text formats -- 6 Base64 -- 6 Basic Multilingual Plane (BMP) -- 3.2 bidirectional display -- 5 BOCU-1 -- 3.2 case -- 4 character -- 2 character encoding form -- 2 character encoding scheme -- 2 charset -- 2 charset identification -- 6 CJK characters and Han characters -- 7 code chart -- 4 code table -- 4 coded character -- 2 coded character set -- 2 combining character -- 4 compatibility character -- 4.1 composite sequence -- 4 control character -- 4.1 diacritic -- 4.1 displaying and rendering text -- 2",
      "zh-CHS": "字母——4.1 ASCII兼容编码（ACE）——6 ASN.1文本格式——6 Base64——6基本多语言平面（BMP）--3.2双向显示--5 BOCU-1--3.2大小写--4个字符--2个字符编码格式--2个字符编码方案--2个字符集--2个字符集标识--6个CJK字符和汉字--7个代码图--4个代码表--4个编码字符--2个编码字符集--2个组合字符--4个兼容字符--4.1复合序列--4个控制字符--4.1变音字符--4.1显示和呈现文本--2"
    },
    {
      "indent": 3,
      "text": "font -- 5 formatting character -- 4.1 glyph -- 2 glyph code -- 2 graphic symbol -- 5 i18n, l10n -- 2 ideographic -- 4.1 input methods -- 5 internationalization -- 2 ISO -- 3.1 language -- 2 language identification -- 6 Latin characters -- 7 local and regional standards organizations -- 3.1 locale -- 7 localization -- 2 MIME -- 6 multilingual -- 2 name spaces -- 6 nonspacing character -- 4.1 normalization -- 4 on-the-wire encoding -- 6 parsed text -- 6 private use -- 7 protocol elements -- 6 punctuation -- 4.1 quoted printable -- 6 regular expressions -- 7 rendering rules -- 5 romanization -- 7 script -- 2 SCSU -- 3.2 sorting and collation -- 4 symbol -- 4.1 transcoding -- 2 transcription -- 7 transfer encoding syntax -- 6 translation -- 7 transliteration -- 7 UCS-2 and UCS-4 -- 3.2 undisplayable character -- 5 Unicode Consortium -- 3.1 UTF-32 -- 3.2 UTF-16, UTF-16BE, and UTF-16LE -- 3.2 UTF-8 -- 3.2 World Wide Web Consortium -- 3.1 XML -- 6",
      "zh-CHS": "字体--5格式字符--4.1字形--2字形代码--2图形符号--5 i18n，l10n--2个表意文字--4.1输入法--5个国际化--2个ISO--3.1语言--2个语言识别--6个拉丁字符--7个地方和地区标准组织--3.1语言环境--7个本地化--2个MIME--6个多语言--2个名称空间--6个非空格字符--4.1规范化--4个有线编码--6解析文本--6个专用--7个协议元素--6个标点--4.1引用的可打印--6个正则表达式--7个呈现规则--5个罗马化--7个脚本--2个SCSU--3.2排序和排序--4个符号--4.1转码--2个转录--7个传输编码语法--6个翻译--7个音译--7个UCS-2和UCS-4--3.2不可扩展字符--5 Unicode联合体--3.1 UTF-32--3.2 UTF-16、UTF-16BE和UTF-16LE--3.2 UTF-8--3.2万维网联合体--3.1 XML--6"
    },
    {
      "indent": 0,
      "text": "A. Acknowledgements",
      "zh-CHS": "A.致谢"
    },
    {
      "indent": 3,
      "text": "The definitions in this document come from many sources, including a wide variety of IETF documents.",
      "zh-CHS": "本文件中的定义来自许多来源，包括各种IETF文件。"
    },
    {
      "indent": 3,
      "text": "James Seng contributed to the initial outline of this document. Harald Alvestrand and Martin Duerst made extensive useful comments on early versions. Others who contributed to the development include:",
      "zh-CHS": "James Seng对本文件的初始大纲做出了贡献。哈拉尔德·阿尔韦斯特朗和马丁·杜尔斯特对早期版本作了大量有益的评论。其他对发展作出贡献的人包括："
    },
    {
      "indent": 6,
      "text": "Dan Kohn Jacob Palme Johan van Wingen Peter Constable Yuri Demchenko Susan Harris Zita Wenzel John Klensin Henning Schulzrinne Leslie Daigle Markus Scherer Ken Whistler",
      "zh-CHS": "Dan Kohn Jacob Palme Johan van Wingen Peter Constable Yuri Demchenko Susan Harris Zita Wenzel John Klesin Henning Schulzrinne Leslie Daigle Markus Scherer Ken Whistler"
    },
    {
      "indent": 0,
      "text": "B. Author's Address",
      "zh-CHS": "B.作者地址"
    },
    {
      "indent": 3,
      "text": "Paul Hoffman Internet Mail Consortium and VPN Consortium 127 Segre Place Santa Cruz, CA 95060 USA",
      "zh-CHS": "保罗·霍夫曼互联网邮件联盟和VPN联盟美国加利福尼亚州圣克鲁斯塞格雷广场127号，邮编95060"
    },
    {
      "indent": 3,
      "text": "EMail: paul.hoffman@imc.org and paul.hoffman@vpnc.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}