{
  "title": {
    "text": "RFC 3912:  WHOIS Protocol Specification ",
    "zh-CHS": "RFC 3912"
  },
  "number": 3912,
  "created_at": "2021-11-18 11:31:29.674527+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          L. Daigle\nRequest for Comments: 3912                                VeriSign, Inc.\nObsoletes: 954, 812                                       September 2004\nCategory: Standards Track",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "WHOIS Protocol Specification",
      "zh-CHS": "WHOIS协议规范"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document updates the specification of the WHOIS protocol, thereby obsoleting RFC 954. The update is intended to remove the material from RFC 954 that does not have to do with the on-the-wire protocol, and is no longer applicable in today's Internet. This document does not attempt to change or update the protocol per se, or document other uses of the protocol that have come into existence since the publication of RFC 954.",
      "zh-CHS": "本文件更新了WHOIS协议的规范，从而淘汰了RFC 954。该更新旨在删除RFC 954中与在线协议无关的材料，并且不再适用于当今的互联网。本文件不试图更改或更新协议本身，也不记录自RFC 954发布以来已存在的协议的其他用途。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "WHOIS is a TCP-based transaction-oriented query/response protocol that is widely used to provide information services to Internet users. While originally used to provide \"white pages\" services and information about registered domain names, current deployments cover a much broader range of information services. The protocol delivers its content in a human-readable format. This document updates the specification of the WHOIS protocol, thereby obsoleting RFC 954 [1].",
      "zh-CHS": "WHOIS是一种基于TCP的面向事务的查询/响应协议，广泛用于向Internet用户提供信息服务。虽然最初用于提供“白页”服务和有关注册域名的信息，但目前的部署涵盖了范围更广的信息服务。该协议以人类可读的格式交付其内容。本文件更新了WHOIS协议的规范，从而淘汰了RFC 954[1]。"
    },
    {
      "indent": 3,
      "text": "For historic reasons, WHOIS lacks many of the protocol design attributes, for example internationalisation and strong security, that would be expected from any recently-designed IETF protocol. This document does not attempt to rectify any of those shortcomings. Instead, this memo documents the WHOIS protocol as it is. In some areas, this document does document particular well known shortcomings of the WHOIS protocol. The discussion of possible protocols to carry out these functions, with updated capabilities to address the",
      "zh-CHS": "由于历史原因，WHOIS缺乏许多协议设计属性，例如国际化和强大的安全性，这是任何最近设计的IETF协议所期望的。本文件并不试图纠正任何这些缺点。相反，这份备忘录记录了WHOIS协议的现状。在某些领域，本文件确实记录了WHOIS议定书的一些众所周知的缺陷。讨论执行这些功能的可能协议，以及解决这些问题的更新功能"
    },
    {
      "indent": 3,
      "text": "shortcomings, is being addressed in a separate IETF activity (CRISP Working Group).",
      "zh-CHS": "缺陷，正在独立的IETF活动（CRISP工作组）中解决。"
    },
    {
      "indent": 0,
      "text": "2. Protocol Specification",
      "section_title": true,
      "zh-CHS": "2. 协议规范"
    },
    {
      "indent": 3,
      "text": "A WHOIS server listens on TCP port 43 for requests from WHOIS clients. The WHOIS client makes a text request to the WHOIS server, then the WHOIS server replies with text content. All requests are terminated with ASCII CR and then ASCII LF. The response might contain more than one line of text, so the presence of ASCII CR or ASCII LF characters does not indicate the end of the response. The WHOIS server closes its connection as soon as the output is finished. The closed TCP connection is the indication to the client that the response has been received.",
      "zh-CHS": "WHOIS服务器在TCP端口43上侦听来自WHOIS客户端的请求。WHOIS客户端向WHOIS服务器发出文本请求，然后WHOIS服务器用文本内容进行回复。所有请求都用ASCII CR和ASCII LF终止。响应可能包含多行文本，因此ASCII CR或ASCII LF字符的存在并不表示响应结束。WHOIS服务器在输出完成后立即关闭其连接。关闭的TCP连接向客户端指示已收到响应。"
    },
    {
      "indent": 0,
      "text": "3. Protocol Example",
      "section_title": true,
      "zh-CHS": "3. 协议示例"
    },
    {
      "indent": 3,
      "text": "If one places a request of the WHOIS server located at whois.nic.mil for information about \"Smith\", the packets on the wire will look like:",
      "zh-CHS": "如果有人向位于WHOIS.nic.mil的WHOIS服务器请求有关“Smith”的信息，则线路上的数据包将如下所示："
    },
    {
      "indent": 3,
      "text": "client server at whois.nic.mil",
      "zh-CHS": "位于whois.nic.mil的客户端服务器"
    },
    {
      "indent": 3,
      "text": "open TCP   ---- (SYN) ------------------------------>\n           <---- (SYN+ACK) -------------------------\nsend query ---- \"Smith<CR><LF>\" -------------------->\nget answer <---- \"Info about Smith<CR><LF>\" ---------\n           <---- \"More info about Smith<CR><LF>\" ----\nclose      <---- (FIN) ------------------------------\n           ----- (FIN) ----------------------------->",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Internationalisation",
      "section_title": true,
      "zh-CHS": "4. 国际化"
    },
    {
      "indent": 3,
      "text": "The WHOIS protocol has not been internationalised. The WHOIS protocol has no mechanism for indicating the character set in use. Originally, the predominant text encoding in use was US-ASCII. In practice, some WHOIS servers, particularly those outside the USA, might be using some other character set either for requests, replies, or both. This inability to predict or express text encoding has adversely impacted the interoperability (and, therefore, usefulness) of the WHOIS protocol.",
      "zh-CHS": "WHOIS协议尚未国际化。WHOIS协议没有用于指示正在使用的字符集的机制。最初，使用的主要文本编码是US-ASCII。实际上，一些WHOIS服务器，特别是美国以外的服务器，可能正在使用其他字符集来处理请求和/或回复。这种无法预测或表达文本编码的能力对WHOIS协议的互操作性（因此也是有用性）产生了不利影响。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The WHOIS protocol has no provisions for strong security. WHOIS lacks mechanisms for access control, integrity, and confidentiality. Accordingly, WHOIS-based services should only be used for information which is non-sensitive and intended to be accessible to everyone.",
      "zh-CHS": "WHOIS协议没有关于强安全性的规定。WHOIS缺乏访问控制、完整性和保密性机制。因此，基于WHOIS的服务应仅用于非敏感信息，且旨在供所有人访问。"
    },
    {
      "indent": 3,
      "text": "The absence of such security mechanisms means this protocol would not normally be acceptable to the IETF at the time of this writing.",
      "zh-CHS": "缺乏此类安全机制意味着在撰写本文时，IETF通常不会接受该协议。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "Ran Atkinson created an earlier version of this document. Ken Harrenstien, Mary Stahl, and Elizabeth Feinler were the authors of the original Draft Standard for WHOIS.",
      "zh-CHS": "Ran Atkinson创建了此文档的早期版本。Ken Harrenstien、Mary Stahl和Elizabeth Feinler是WHOIS原始标准草案的作者。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Harrenstien, K., Stahl, M., and E. Feinler, \"NICNAME/WHOIS\", RFC 954, October 1985.",
      "zh-CHS": "[1] K.Harrenstien、M.Stahl和E.Feinler，“NICNAME/WHOIS”，RFC 954，1985年10月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Leslie Daigle VeriSign, Inc. 21355 Ridgetop Circle Dulles, VA 20166 US",
      "zh-CHS": "Leslie Daigle VeriSign，Inc.美国弗吉尼亚州杜勒斯Ridgetop Circle 21355，邮编20166"
    },
    {
      "indent": 3,
      "text": "EMail: leslie@verisignlabs.com; leslie@thinkingcat.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and at www.rfc-editor.org, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78和www.rfc-editor.org中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/S HE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、其代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the ISOC's procedures with respect to rights in ISOC Documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关ISOC文件中权利的ISOC程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}