{
  "title": {
    "text": "RFC 3803:  Content Duration MIME Header Definition ",
    "zh-CHS": "RFC 3803"
  },
  "number": 3803,
  "created_at": "2021-11-18 03:11:59.972253+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       G. Vaudreuil\nRequest for Comments: 3803                           Lucent Technologies\nObsoletes: 2424                                               G. Parsons\nCategory: Standards Track                                Nortel Networks\n                                                               June 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Content Duration MIME Header Definition",
      "zh-CHS": "内容持续时间MIME头定义"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the MIME header Content-Duration that is\nintended for use with any time varying media content (typically\naudio/* or video/*).",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document describes the MIME header Content-Duration that is\nintended for use with any time varying media content (typically\naudio/* or video/*).  The length of time is represented in seconds\nwithout any units indication.  This document obsoletes RFC 2424.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [REQ].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[REQ]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Content-Duration Header Field",
      "section_title": true,
      "zh-CHS": "2. 内容持续时间标头字段"
    },
    {
      "indent": 3,
      "text": "Time varying media contents, for example, a spoken voice message or a video clip, have an inherent time duration. Many audio and video encodings may include their duration as header information or may allow accurate calculation based on the byte length of the data. However, it may be useful to present the time duration of the content in a MIME header to allow its simple determination without dealing with the actual content.",
      "zh-CHS": "时变媒体内容（例如，语音消息或视频剪辑）具有固有的持续时间。许多音频和视频编码可能包括其持续时间作为报头信息，或者可能允许基于数据的字节长度进行精确计算。但是，在MIME头中显示内容的持续时间可能会很有用，以便在不处理实际内容的情况下进行简单的确定。"
    },
    {
      "indent": 0,
      "text": "2.1. Syntax",
      "section_title": true,
      "zh-CHS": "2.1. 语法"
    },
    {
      "indent": 3,
      "text": "The Content-Duration field's value is a single number specifying the time duration in seconds of the content. Formally:",
      "zh-CHS": "“内容持续时间”字段的值是一个数字，指定内容的持续时间（以秒为单位）。正式地："
    },
    {
      "indent": 3,
      "text": "duration := \"Content-Duration\" \":\" 1*10DIGIT",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that practically (though highly unlikely in MIME media), the upper bound on the numerical value of the time duration is (2^^31 -1) or 2147483647.",
      "zh-CHS": "请注意，实际上（尽管在MIME媒体中不太可能），持续时间数值的上限为（2^^31-1）或2147483647。"
    },
    {
      "indent": 0,
      "text": "2.2. Semantics",
      "section_title": true,
      "zh-CHS": "2.2. 语义学"
    },
    {
      "indent": 3,
      "text": "This field represents the time duration of the associated time varying media content. The time duration is noted in seconds with no units tag. The time value should be exact, however the exact value of the time duration cannot be known without opening the content and playing it. If an exact value must be known, then the latter method should be used. This mechanism simply allows placing a sender determined time duration value in the header for easy access.",
      "zh-CHS": "此字段表示关联的时变媒体内容的持续时间。持续时间以秒为单位，无单位标记。时间值应该是精确的，但是如果不打开内容并播放，则无法知道持续时间的精确值。如果必须知道准确值，则应使用后一种方法。此机制只允许在标头中放置发送方确定的持续时间值，以便于访问。"
    },
    {
      "indent": 3,
      "text": "Though there are several ways to present this duration to the recipient (e.g., with the inbox headers, when audio attachment opened), the actual use of this field on reception is a local implementation issue.",
      "zh-CHS": "虽然有几种方式向收件人显示此持续时间（例如，打开音频附件时使用收件箱标题），但在接收时实际使用此字段是本地实现问题。"
    },
    {
      "indent": 0,
      "text": "2.3. Example",
      "section_title": true,
      "zh-CHS": "2.3. 实例"
    },
    {
      "indent": 3,
      "text": "In this example the content duration represents 33 seconds:",
      "zh-CHS": "在此示例中，内容持续时间表示33秒："
    },
    {
      "indent": 9,
      "text": "Content-Duration: 33",
      "zh-CHS": "内容持续时间：33"
    },
    {
      "indent": 0,
      "text": "3. VPIM Usage",
      "section_title": true,
      "zh-CHS": "3. VPIM使用"
    },
    {
      "indent": 3,
      "text": "The Content-Duration header field for the audio/32KADPCM sub-type is a useful component of the VPIM specification [VPIM2]. All VPIM Messages MUST contain this sub-type to carry the audio of a voice message. It may be useful in some instances (e.g., viewing on a simple MIME or non-MIME desktop) to have the time duration of the voice message available without having to open the audio content.",
      "zh-CHS": "音频/32KADPCM子类型的内容持续时间标头字段是VPIM规范[VPIM2]的一个有用组件。所有VPIM消息必须包含此子类型，才能承载语音消息的音频。在某些情况下（例如，在简单的MIME或非MIME桌面上查看），无需打开音频内容即可获得语音消息的持续时间可能很有用。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This definition introduces the option of explicitly identifying the\ntime duration of an audio/* or video/* content outside of the binary\ndata that forms the content.  In some environments (though likely not\nthe majority), the identification of the actual time duration in a\nheader field may be a security issue and as a result should not be\nnoted. Reliance on the time indicated in this header field cannot be\ntrusted for the purposes of determining the exact size of the data.\nThe exact length of the data must be determined by examining the data\nitself.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "zh-CHS": "5.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[MIME2] Gellens, R., \"The Text/Plain Format Parameter\", RFC 2646, August 1999.",
      "zh-CHS": "[MIME2]Gellens，R.，“文本/纯格式参数”，RFC 26461999年8月。"
    },
    {
      "indent": 3,
      "text": "[VPIM2R2] Vaudreuil, G., and G. Parsons, \"Voice Profile for Internet Mail - version 2 (VPIMv2)\", RFC 3801, June 2004.",
      "zh-CHS": "[VPIM2R2]Vaudreuil，G.和G.Parsons，“互联网邮件语音配置文件-第2版（VPIMv2）”，RFC 38012004年6月。"
    },
    {
      "indent": 3,
      "text": "[REQ] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[REQ]Bradner，S.，“在RFC中用于指示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "zh-CHS": "5.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[DUR] Parsons, G. and G. Vaudreuil, \"Content Duration MIME Header Definition\", RFC 2424, September 1998.",
      "zh-CHS": "[DUR]Parsons，G.和G.Vaudreuil，“内容持续时间MIME头定义”，RFC 24241998年9月。"
    },
    {
      "indent": 3,
      "text": "[VPIM2] Vaudreuil, G. and G. Parsons, \"Voice Profile for Internet Mail - version 2\", RFC 2421, September 1998.",
      "zh-CHS": "[VPIM2]Vaudreuil，G.和G.Parsons，“互联网邮件语音配置文件-第2版”，RFC 24211998年9月。"
    },
    {
      "indent": 0,
      "text": "6. Changes from RFC 2424",
      "section_title": true,
      "zh-CHS": "6. RFC 2424的更改"
    },
    {
      "indent": 3,
      "text": "Only editorial and boilerplate changes from RFC 2424 have been made to this document.",
      "zh-CHS": "本文件仅作了RFC 2424的编辑和样板更改。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "7. 作者地址"
    },
    {
      "indent": 3,
      "text": "Gregory M. Vaudreuil Lucent Technologies 7291 Williamson Rd Dallas, TX 75214 United States",
      "zh-CHS": "Gregory M.Vaudreuil-Lucent Technologies美国德克萨斯州达拉斯威廉森路7291号，邮编75214"
    },
    {
      "indent": 3,
      "text": "EMail: gregv@ieee.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Glenn W. Parsons Nortel Networks P.O. Box 3511, Station C Ottawa, ON K1Y 4H7 Canada",
      "zh-CHS": "加拿大K1Y 4H7渥太华C站Glenn W.Parsons Nortel Networks邮政信箱3511"
    },
    {
      "indent": 3,
      "text": "Phone: +1-613-763-7582\nFax:   +1-613-763-2697\nEMail: gparsons@nortelnetworks.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "8. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}