{
  "title": {
    "text": "RFC 3306:  Unicast-Prefix-based IPv6 Multicast Addresses ",
    "zh-CHS": "RFC 3306"
  },
  "number": 3306,
  "created_at": "2021-10-26 16:35:53.935125+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        B. Haberman\nRequest for Comments: 3306                                    Consultant\nCategory: Standards Track                                      D. Thaler\n                                                               Microsoft\n                                                             August 2002",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Unicast-Prefix-based IPv6 Multicast Addresses",
      "zh-CHS": "基于单播前缀的IPv6多播地址"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This specification defines an extension to the multicast addressing architecture of the IP Version 6 protocol. The extension presented in this document allows for unicast-prefix-based allocation of multicast addresses. By delegating multicast addresses at the same time as unicast prefixes, network operators will be able to identify their multicast addresses without needing to run an inter-domain allocation protocol.",
      "zh-CHS": "本规范定义了对IP版本6协议的多播寻址体系结构的扩展。本文档中提供的扩展允许基于单播前缀的多播地址分配。通过将多播地址与单播前缀同时委派，网络运营商将能够识别其多播地址，而无需运行域间分配协议。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction....................................................2\n2. Motivation......................................................2\n3. Terminology.....................................................2\n4. Multicast Address Format........................................2\n5. Address Lifetime................................................4\n6. Source-Specific Multicast Addresses.............................4\n7. Examples........................................................4\n8. Security Considerations.........................................5\n9. References......................................................5\nAuthor's Address...................................................6\nFull Copyright Statement...........................................7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document specifies an extension to the multicast portion of the IPv6 addressing architecture [ADDRARCH]. The current architecture does not contain any built-in support for dynamic address allocation. This proposal introduces encoded information in the multicast address to allow for dynamic allocation of IPv6 multicast addresses and IPv6 source-specific multicast addresses.",
      "zh-CHS": "本文档指定了IPv6寻址体系结构[ADDRARCH]的多播部分的扩展。当前体系结构不包含任何对动态地址分配的内置支持。该方案在多播地址中引入编码信息，以允许动态分配IPv6多播地址和IPv6源特定多播地址。"
    },
    {
      "indent": 0,
      "text": "2. Motivation",
      "section_title": true,
      "zh-CHS": "2. 动机"
    },
    {
      "indent": 3,
      "text": "The current IPv4 multicast address allocation architecture [RFC 2908] is based on a multi-layered, multi-protocol system. The goal of this proposal is to reduce the number of protocols that need to be deployed in order to get dynamic multicast address allocation.",
      "zh-CHS": "当前的IPv4多播地址分配体系结构[RFC 2908]基于多层、多协议系统。该方案的目标是减少需要部署的协议数量，以获得动态多播地址分配。"
    },
    {
      "indent": 3,
      "text": "The use of unicast prefix-based multicast address allocation will, at a minimum, remove the need to run the Multicast Address Allocation Protocol (AAP) [AAP WORK] and the Multicast Address-Set Claim (MASC) Protocol [RFC 2909].",
      "zh-CHS": "使用基于单播前缀的多播地址分配将至少消除运行多播地址分配协议（AAP）[AAP工作]和多播地址集声明（MASC）协议[RFC 2909]的需要。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "zh-CHS": "3. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC 2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC 2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "4. Multicast Address Format",
      "section_title": true,
      "zh-CHS": "4. 多播地址格式"
    },
    {
      "indent": 3,
      "text": "Section 2.7 of [ADDRARCH] defines the following operational format of IPv6 multicast addresses:",
      "zh-CHS": "[ADDRARCH]第2.7节定义了IPv6多播地址的以下操作格式："
    },
    {
      "indent": 6,
      "text": "|    8   |  4 |  4 |                     112                     |\n+--------+----+----+---------------------------------------------+\n|11111111|flgs|scop|                  group ID                   |\n+--------+----+----+---------------------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document introduces a new format that incorporates unicast prefix information in the multicast address. The following illustrates the new format:",
      "zh-CHS": "本文档介绍了一种新格式，该格式将单播前缀信息合并到多播地址中。以下说明了新的格式："
    },
    {
      "indent": 6,
      "text": "|   8    |  4 |  4 |   8    |    8   |       64       |    32    |\n+--------+----+----+--------+--------+----------------+----------+\n|11111111|flgs|scop|reserved|  plen  | network prefix | group ID |\n+--------+----+----+--------+--------+----------------+----------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "                                +-+-+-+-+\nflgs is a set of 4 flags:       |0|0|P|T|\n                                +-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "o P = 0 indicates a multicast address that is not assigned based on the network prefix. This indicates a multicast address as defined in [ADDRARCH].",
      "zh-CHS": "o P=0表示未根据网络前缀分配的多播地址。这表示[ADDRARCH]中定义的多播地址。"
    },
    {
      "indent": 9,
      "text": "o P = 1 indicates a multicast address that is assigned based on the network prefix.",
      "zh-CHS": "o P=1表示根据网络前缀分配的多播地址。"
    },
    {
      "indent": 9,
      "text": "o If P = 1, T MUST be set to 1, otherwise the setting of the T bit is defined in Section 2.7 of [ADDRARCH].",
      "zh-CHS": "o 如果P=1，T必须设置为1，否则T位的设置在[ADDRARCH]第2.7节中定义。"
    },
    {
      "indent": 3,
      "text": "The reserved field MUST be zero.",
      "zh-CHS": "保留字段必须为零。"
    },
    {
      "indent": 3,
      "text": "plen indicates the actual number of bits in the network prefix field that identify the subnet when P = 1.",
      "zh-CHS": "plen表示P=1时网络前缀字段中标识子网的实际位数。"
    },
    {
      "indent": 3,
      "text": "network prefix identifies the network prefix of the unicast subnet owning the multicast address. If P = 1, this field contains the unicast network prefix assigned to the domain owning, or allocating, the multicast address. All non-significant bits of the network prefix field SHOULD be zero.",
      "zh-CHS": "网络前缀标识拥有多播地址的单播子网的网络前缀。如果P=1，此字段包含分配给拥有或分配多播地址的域的单播网络前缀。网络前缀字段的所有非有效位应为零。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the Interface Identifier requirements in Section 2.5.1 of [ADDRARCH] effectively restrict the length of the unicast prefix to 64 bits, hence the network prefix portion of the multicast address will be at most 64 bits.",
      "zh-CHS": "应注意的是，[ADDRARCH]第2.5.1节中的接口标识符要求有效地将单播前缀的长度限制为64位，因此多播地址的网络前缀部分最多为64位。"
    },
    {
      "indent": 3,
      "text": "Group ID is set based on the guidelines outlined in [IPV6 GID].",
      "zh-CHS": "组ID是根据[IPV6 GID]中概述的准则设置的。"
    },
    {
      "indent": 3,
      "text": "The scope of the unicast-prefix based multicast address MUST NOT exceed the scope of the unicast prefix embedded in the multicast address.",
      "zh-CHS": "基于单播前缀的多播地址的范围不得超过嵌入在多播地址中的单播前缀的范围。"
    },
    {
      "indent": 0,
      "text": "5. Address Lifetime",
      "section_title": true,
      "zh-CHS": "5. 地址生存期"
    },
    {
      "indent": 3,
      "text": "The lifetime of a unicast prefix-based multicast address SHOULD NOT exceed the Valid Lifetime field in the Prefix Information option, corresponding to the unicast prefix being used, contained in the Neighbor Discovery Router Advertisement message [RFC 2461]. The lifetime of the multicast address is needed to support the Abstract API for Multicast Address Allocation [RFC 2771].",
      "zh-CHS": "基于单播前缀的多播地址的生存期不应超过前缀信息选项中的有效生存期字段，该字段对应于邻居发现路由器广告消息[RFC 2461]中包含的正在使用的单播前缀。需要多播地址的生存期来支持多播地址分配的抽象API[RFC 2771]。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the unicast prefix's Valid Lifetime in the Router Advertisement message does not indicate that the prefix will become invalid at the end of the lifetime. Rather, that value is typically a constant until a renumbering event is scheduled after which, the prefix does become invalid.",
      "zh-CHS": "应当注意，路由器广告消息中的单播前缀的有效生存期并不表示该前缀将在生存期结束时变为无效。相反，在计划重新编号事件之前，该值通常是一个常量，之后前缀确实变为无效。"
    },
    {
      "indent": 3,
      "text": "The use of unicast prefix-based multicast addresses after the unicast prefix has become invalid may lead to operational problems. For example, routers that perform policy checks comparing the multicast prefix against the unicast prefix assigned to an AS may discard the packet.",
      "zh-CHS": "在单播前缀无效后使用基于单播前缀的多播地址可能会导致操作问题。例如，执行将多播前缀与分配给AS的单播前缀进行比较的策略检查的路由器可以丢弃该分组。"
    },
    {
      "indent": 0,
      "text": "6. Source-Specific Multicast Addresses",
      "section_title": true,
      "zh-CHS": "6. 源特定多播地址"
    },
    {
      "indent": 3,
      "text": "The unicast prefix-based IPv6 multicast address format supports Source-specific multicast addresses, as defined by [SSM ARCH]. To accomplish this, a node MUST:",
      "zh-CHS": "根据[SSM ARCH]的定义，基于单播前缀的IPv6多播地址格式支持源特定的多播地址。为此，节点必须："
    },
    {
      "indent": 9,
      "text": "o Set P = 1. o Set plen = 0. o Set network prefix = 0.",
      "zh-CHS": "o 设置P=1。o设置增压=0。o设置网络前缀=0。"
    },
    {
      "indent": 3,
      "text": "These settings create an SSM range of FF3x::/32 (where 'x' is any valid scope value). The source address field in the IPv6 header identifies the owner of the multicast address.",
      "zh-CHS": "这些设置创建的SSM范围为FF3x:：/32（其中“x”是任何有效的范围值）。IPv6标头中的源地址字段标识多播地址的所有者。"
    },
    {
      "indent": 0,
      "text": "7. Examples",
      "section_title": true,
      "zh-CHS": "7. 例子"
    },
    {
      "indent": 3,
      "text": "The following are a few examples of the structure of unicast prefix-based multicast addresses.",
      "zh-CHS": "以下是基于单播前缀的多播地址结构的几个示例。"
    },
    {
      "indent": 9,
      "text": "- Global prefixes - A network with a unicast prefix of 3FFE:FFFF:1::/48 would also have a unicast prefix-based multicast prefix of FF3x:0030:3FFE:FFFF:0001::/96 (where 'x' is any valid scope).",
      "zh-CHS": "- 全局前缀-单播前缀为3FFE:FFFF:1:：/48的网络也将具有基于单播前缀的多播前缀FF3x:0030:3FFE:FFFF:0001:：/96（其中“x”是任何有效范围）。"
    },
    {
      "indent": 9,
      "text": "- SSM - All IPv6 SSM multicast addresses will have the format FF3x::/96.",
      "zh-CHS": "- SSM-所有IPv6 SSM多播地址的格式为FF3x:：/96。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "It is possible that the embedded unicast prefix can aid in identifying the allocation domain of a given multicast address, though an allocation domain choosing to avoid being traced has no obstacles currently to creating addresses using a prefix not assigned to it, or using a smaller scope embedded prefix.",
      "zh-CHS": "嵌入的单播前缀可能有助于识别给定多播地址的分配域，尽管选择避免被跟踪的分配域目前在使用未分配给它的前缀或使用较小范围的嵌入前缀创建地址方面没有障碍。"
    },
    {
      "indent": 3,
      "text": "Using source-specific multicast addresses can sometimes aid in the prevention of denial-of-service attacks by arbitrary sources, although no guarantee is provided. A more in-depth discussion of the security considerations for SSM can be found in [SSM ARCH].",
      "zh-CHS": "使用特定于源的多播地址有时有助于防止任意源的拒绝服务攻击，尽管没有提供任何保证。有关SSM安全注意事项的更深入讨论，请参见[SSM ARCH]。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 3,
      "text": "[RFC 2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC 2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "zh-CHS": "[RFC 2460]Deering，S.和R.Hinden，“互联网协议，第6版（IPv6）规范”，RFC 2460，1998年12月。"
    },
    {
      "indent": 3,
      "text": "[ADDRARCH] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "zh-CHS": "[ADDRARCH]Hinden，R.和S.Deering，“IP版本6寻址体系结构”，RFC 23731998年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2908] Thaler, D., Handley, M. and D. Estrin, \"The Internet Multicast Address Allocation Architecture\", RFC 2908, September 2000.",
      "zh-CHS": "[RFC 2908]Thaler，D.，Handley，M.和D.Estrin，“互联网多播地址分配架构”，RFC 2908，2000年9月。"
    },
    {
      "indent": 3,
      "text": "[AAP WORK] Handley, M. and S. Hanna, \"Multicast Address Allocation Protocol (AAP)\", Work In Progress.",
      "zh-CHS": "[AAP工作]Handley，M.和S.Hanna，“多播地址分配协议（AAP）”，工作正在进行中。"
    },
    {
      "indent": 3,
      "text": "[RFC 2909] Radoslavov, P., Estrin, D., Govindan, R., Handley, M., Kumar, S. and D. Thaler, \"The Multicast Address-Set Claim (MASC) Protocol\", RFC 2909, September 2000.",
      "zh-CHS": "[RFC 2909]Radoslavov，P.，Estrin，D.，Govindan，R.，Handley，M.，Kumar，S.和D.Thaler，“多播地址集声明（MASC）协议”，RFC 2909，2000年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1999.",
      "zh-CHS": "[RFC 2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1999年3月。"
    },
    {
      "indent": 3,
      "text": "[IPV6 GID] Haberman, B., \"Dynamic Allocation Guidelines for IPv6 Multicast Addresses\", RFC 3307, June 2002.",
      "zh-CHS": "[IPV6 GID]Haberman，B.，“IPV6多播地址的动态分配指南”，RFC33072002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2461] Narten, T., Nordmark, E. and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "zh-CHS": "[RFC 2461]Narten，T.，Nordmark，E.和W.Simpson，“IP版本6（IPv6）的邻居发现”，RFC 2461，1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2771] Finlayson, R., \"An Abstract API for Multicast Address Allocation\", RFC 2771, February 2000.",
      "zh-CHS": "[RFC 2771]Finlayson，R.，“用于多播地址分配的抽象API”，RFC 2771，2000年2月。"
    },
    {
      "indent": 3,
      "text": "[SSM ARCH] Holbrook, H. and B. Cain, \"Source-Specific Multicast for IP\", Work In Progress.",
      "zh-CHS": "[SSM ARCH]Holbrook，H.和B.Cain，“IP的源特定多播”，工作正在进行中。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Brian Haberman Consultant Phone: 1-919-949-4828 EMail: bkhabs@nc.rr.com",
      "zh-CHS": "Brian Haberman顾问电话：1-919-949-4828电子邮件：bkhabs@nc.rr.com"
    },
    {
      "indent": 3,
      "text": "Dave Thaler Microsoft Corporation One Microsoft Way Redmond, WA 48105-6399 Phone: 1-425-703-8835 EMail: dthaler@microsoft.com",
      "zh-CHS": "Dave Thaler Microsoft Corporation One Microsoft Way Redmond，WA 48105-6399电话：1-425-703-8835电子邮件：dthaler@microsoft.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}