{
  "title": {
    "text": "RFC 3975:  OMA-IETF Standardization Collaboration ",
    "zh-CHS": "RFC 3975"
  },
  "number": 3975,
  "created_at": "2021-11-18 17:06:43.299429+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     G. Huston, Ed.\nRequest for Comments: 3975                                           IAB\nCategory: Informational                                    I. Leuca, Ed.\n                                                                     OMA\n                                                            January 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "OMA-IETF Standardization Collaboration",
      "zh-CHS": "OMA-IETF标准化协作"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the standardization collaboration between the Open Mobile Alliance (OMA) and the Internet Engineering Task Force (IETF).",
      "zh-CHS": "本文档描述了开放移动联盟（OMA）和互联网工程任务组（IETF）之间的标准化协作。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document contains a set of principles and guidelines that serves as the basis for establishing a cooperation framework between the Open Mobile Alliance (OMA) and the Internet Engineering Task Force (IETF). This cooperation is intended to secure timely development of technical specifications that facilitate maximum interoperability with existing (fixed and mobile) Internet systems, devices, and protocols.",
      "zh-CHS": "本文件包含一套原则和指南，作为开放移动联盟（OMA）和互联网工程任务组（IETF）之间建立合作框架的基础。这种合作旨在确保及时制定技术规范，以促进与现有（固定和移动）互联网系统、设备和协议的最大互操作性。"
    },
    {
      "indent": 3,
      "text": "Within the OMA, specific activities are undertaken through OMA working groups, each with an area of responsibility. These activities are authorized, and their output is approved by, the OMA Technical Plenary. The list of OMA working groups, OMA Specifications for public comment, the OMA work program, and publicly available working group drafts can be found at the OMA web site, <http://www.openmobilealliance.org>.",
      "zh-CHS": "在OMA内部，通过OMA工作组开展具体活动，每个工作组都有一个职责范围。这些活动得到OMA技术全体会议的授权，其输出得到OMA技术全体会议的批准。OMA工作组列表、供公众评论的OMA规范、OMA工作计划和公开可用的工作组草案可在OMA网站上找到<http://www.openmobilealliance.org>."
    },
    {
      "indent": 3,
      "text": "Within the IETF, activities are undertaken within a framework of Areas, with specific activities being undertaken by working groups that are chartered within each Area. Working group output is reviewed by the Internet Engineering Steering Group (IESG) and published by the RFC-Editor. IETF activities are based on a",
      "zh-CHS": "在IETF中，活动在各个领域的框架内进行，具体活动由各领域内特许的工作组进行。工作组输出由互联网工程指导小组（IESG）审查，并由RFC编辑发布。IETF活动基于"
    },
    {
      "indent": 3,
      "text": "principle of open contribution and participation by any interested party. Information on IETF working groups, current work item drafts, meeting schedules, and mailing lists are published on the IETF web site, <http://www.ietf.org>.",
      "zh-CHS": "公开出资和任何利益方参与的原则。有关IETF工作组、当前工作项草案、会议日程和邮件列表的信息发布在IETF网站上<http://www.ietf.org>."
    },
    {
      "indent": 3,
      "text": "The IETF and the OMA, are cooperating with a mutual desire to support the integrity of specifications and standards developed by each body. The preferred approach is that the OMA uses the Internet standards unchanged, if feasible, and communicates requirements for change to the IETF, as needed. The parties intend to work together in an effort to avoid duplication of work.",
      "zh-CHS": "IETF和OMA正以共同的愿望进行合作，以支持各机构制定的规范和标准的完整性。首选的方法是，如果可行，OMA使用不变的互联网标准，并根据需要向IETF传达变更要求。双方打算共同努力避免工作重复。"
    },
    {
      "indent": 3,
      "text": "Each organization will operate according to its own rules and procedures, including rules governing Intellectual Property Rights (IPR), specification elaboration, approval, and maintenance.",
      "zh-CHS": "每个组织都将按照自己的规则和程序运作，包括管理知识产权（IPR）、规范制定、批准和维护的规则。"
    },
    {
      "indent": 3,
      "text": "This cooperation framework is intended to guide collaborative efforts, and should be put into use in as much as it is applicable to these efforts. If either party finds this framework inapplicable, then it may notify the other party so that this framework may be modified or withdrawn, as appropriate.",
      "zh-CHS": "该合作框架旨在指导合作努力，并应尽可能适用于这些努力。如果任何一方发现本框架不适用，则可通知另一方，以便修改或撤销本框架（视情况而定）。"
    },
    {
      "indent": 0,
      "text": "2. Basis of Collaboration",
      "section_title": true,
      "zh-CHS": "2. 合作基础"
    },
    {
      "indent": 3,
      "text": "In the further development of OMA specifications, the benefit of adopting Internet specifications has been identified.",
      "zh-CHS": "在OMA规范的进一步开发中，已经确定了采用Internet规范的好处。"
    },
    {
      "indent": 3,
      "text": "Although this document recognizes the importance of interoperability of OMA specifications with the existing Internet and hence the use of IETF standards, the OMA recognizes that additions or modifications might be needed in order to make the IETF Internet specifications meet the needs of the OMA. In such cases, the OMA will take its concerns directly to the appropriate IETF working groups for resolution. When no appropriate working group can be found or it is not known where to direct the communication, or in the case of resolution of consequent matters, the issue will be raised through the OMA's designated liaison to the IETF.",
      "zh-CHS": "尽管本文件认识到OMA规范与现有互联网互操作性的重要性，因此也认识到使用IETF标准的重要性，但OMA认识到可能需要添加或修改，以使IETF互联网规范满足OMA的需要。在这种情况下，OMA将直接将其关注事项提交给相应的IETF工作组解决。如果找不到合适的工作组，或者不知道沟通的方向，或者在解决后续问题的情况下，将通过OMA指定的IETF联络人提出问题。"
    },
    {
      "indent": 3,
      "text": "The IETF may also need to ask questions of the OMA in order to refine its understanding of OMA requirements or may wish to offer guidance to OMA on the effective use of Internet specifications. Where possible, these communications will occur in the context of a discussion between OMA and an IETF working group. In the event that a working group level discussion is deemed inappropriate for the desired communication, the matter will be raised through the IETF's designated liaison to the OMA.",
      "zh-CHS": "IETF可能还需要向OMA提问，以完善其对OMA要求的理解，或者希望向OMA提供有效使用互联网规范的指导。在可能的情况下，这些通信将在OMA和IETF工作组之间的讨论中进行。如果工作组级别的讨论被认为不适合所需的沟通，则将通过IETF指定的联络人向OMA提出该问题。"
    },
    {
      "indent": 0,
      "text": "3. Document Sharing",
      "section_title": true,
      "zh-CHS": "3. 文件共享"
    },
    {
      "indent": 3,
      "text": "Both the OMA and the IETF encourage the sharing of draft documents that are of mutual interest.",
      "zh-CHS": "OMA和IETF都鼓励共享共同感兴趣的文件草案。"
    },
    {
      "indent": 3,
      "text": "All IETF documents are publicly available from the IETF web site, and discussion of documents is hosted on open mailing lists.",
      "zh-CHS": "所有IETF文件都可以从IETF网站上公开获取，并且文件的讨论在开放邮件列表上进行。"
    },
    {
      "indent": 3,
      "text": "OMA documents intended for public consumption, including working drafts, are published for open access on the OMA web site, <http://www.openmobilealliance.org/>. Technical contributions to OMA by its members are also encouraged to make publicly available.",
      "zh-CHS": "供公众使用的OMA文件，包括工作草案，在OMA网站上公开发布<http://www.openmobilealliance.org/>. 还鼓励其成员向公众提供对OMA的技术贡献。"
    },
    {
      "indent": 3,
      "text": "The OMA and the IETF will work to update and exchange, on a regular basis, a list of dependencies between each organization's specifications and work in progress.",
      "zh-CHS": "OMA和IETF将定期更新和交换每个组织的规范和正在进行的工作之间的依赖关系列表。"
    },
    {
      "indent": 0,
      "text": "4. Participation in the IETF Process",
      "section_title": true,
      "zh-CHS": "4. 参与IETF过程"
    },
    {
      "indent": 3,
      "text": "Participation in the IETF process is completely open. This allows OMA delegates to participate to whatever extent the OMA considers appropriate in IETF meetings and mailing list discussions to assist the IETF in refining its understanding of OMA requirements and in meeting requirements that the IETF deems appropriate. This close working relationship also offers an excellent opportunity for OMA delegates to receive informal guidance from IETF on OMA's use of Internet specifications.",
      "zh-CHS": "IETF过程的参与是完全开放的。这允许OMA代表在OMA认为适当的任何程度上参与IETF会议和邮件列表讨论，以帮助IETF完善其对OMA要求的理解，并满足IETF认为适当的要求。这种密切的工作关系也为OMA代表提供了一个极好的机会，让他们从IETF获得关于OMA使用互联网规范的非正式指导。"
    },
    {
      "indent": 3,
      "text": "The vast majority of technical discussions and decision making within the IETF is undertaken by using open mailing lists. It is recommended that interested individuals subscribe to and participate on these lists.",
      "zh-CHS": "IETF内的绝大多数技术讨论和决策都是通过使用开放邮件列表进行的。建议感兴趣的个人订阅并参与这些列表。"
    },
    {
      "indent": 3,
      "text": "The OMA is to be notified of new work to be undertaken by the IETF via a nominated IETF liaison notification mechanism.",
      "zh-CHS": "将通过指定的IETF联络通知机制通知OMA IETF将开展的新工作。"
    },
    {
      "indent": 0,
      "text": "5. Designated Liaisons",
      "section_title": true,
      "zh-CHS": "5. 指定联络人"
    },
    {
      "indent": 3,
      "text": "When the informal working group level of interaction is insufficient, matters can be raised through a liaison channel. The OMA and the IETF shall each establish liaison functions for communication with the other organization and shall appoint one or more individuals to those functions.",
      "zh-CHS": "当非正式工作组的互动程度不够时，可以通过联络渠道提出问题。OMA和IETF应各自建立与其他组织沟通的联络职能，并任命一名或多名人员担任这些职能。"
    },
    {
      "indent": 0,
      "text": "5.1. IETF Liaison to OMA",
      "section_title": true,
      "zh-CHS": "5.1. IETF与OMA的联络"
    },
    {
      "indent": 3,
      "text": "The preferred way for organizations to work with IETF is through the working groups. However, IETF has a limited number of individual liaison roles with other organizations when conditions warrant the appointment of a specific person.",
      "zh-CHS": "组织与IETF合作的首选方式是通过工作组。然而，当条件允许任命特定人员时，IETF与其他组织的个人联络角色数量有限。"
    },
    {
      "indent": 3,
      "text": "The Internet Architecture Board (IAB) shall appoint a specific person to serve as the OMA Liaison. The role of the IETF's OMA Liaison is to act as an initial contact point in IETF for administrative aspects of this collaboration that cannot easily be handled in other ways (e.g., at a technical level by interactions with IETF Working Groups or Area Directors). It is agreed that the role does not carry the expectation of attendance at OMA meetings or participation in OMA administrative processes, and it is anticipated that all liaison efforts assigned to this individual will be carried out by electronic mail. It is understood that the liaison does not have the ability to make exceptions to, or special provisions for, IETF policies and procedures.",
      "zh-CHS": "互联网架构委员会（IAB）应指定一名特定人员担任OMA联络人。IETF的OMA联络人的作用是充当IETF中的初始联络点，负责以其他方式（例如，通过与IETF工作组或区域主管的互动，在技术层面）无法轻松处理的本次协作的行政方面。双方同意，该角色不期望参加OMA会议或参与OMA行政流程，并且预计分配给该人员的所有联络工作将通过电子邮件进行。据了解，联络人没有能力对IETF政策和程序作出例外或特殊规定。"
    },
    {
      "indent": 3,
      "text": "It is expected that the individual appointed to this role would:",
      "zh-CHS": "预计被任命担任这一职务的个人将："
    },
    {
      "indent": 3,
      "text": "o be informed by the OMA of OMA activities on behalf of the IETF, including new work proposals, and be able to report those using appropriate channels within the IETF,",
      "zh-CHS": "o 由OMA代表IETF告知OMA活动，包括新的工作建议，并能够使用IETF内的适当渠道报告这些活动，"
    },
    {
      "indent": 3,
      "text": "o convey liaisons statements from the OMA to the IETF, and be responsible for shepherding the OMA communication to the relevant parts of the IETF,",
      "zh-CHS": "o 将OMA的联络声明传达给IETF，并负责将OMA通信传达给IETF的相关部分，"
    },
    {
      "indent": 3,
      "text": "o report to the OMA on progress with IETF consideration of OMA liaison statements, and",
      "zh-CHS": "o 向OMA报告IETF审议OMA联络声明的进展情况，以及"
    },
    {
      "indent": 3,
      "text": "o have direct access to the OMA technical leadership as well as direct access to the IAB and IETF Area Directors, as required.",
      "zh-CHS": "o 根据需要，可直接接触OMA技术领导层以及IAB和IETF区域主管。"
    },
    {
      "indent": 3,
      "text": "OMA meetings are normally only open to delegates from OMA member organizations. To assist the information flow between the organizations, the IETF may, by prior written invitation from the OMA on a per-case basis, send a representative to participate in and represent the IETF at an OMA Technical Plenary and working group meeting under conditions set forth by the OMA. The representative could be the IETF liaison or, in the event that the liaison cannot attend, some other designated individual.",
      "zh-CHS": "OMA会议通常只对来自OMA成员组织的代表开放。为协助组织之间的信息流动，IETF可根据具体情况，通过OMA的事先书面邀请，根据OMA规定的条件，派遣一名代表参加并代表IETF参加OMA技术全体会议和工作组会议。该代表可以是IETF联络员，如果联络员不能出席，则可以是其他指定人员。"
    },
    {
      "indent": 0,
      "text": "5.2. OMA Liaison to IETF",
      "section_title": true,
      "zh-CHS": "5.2. OMA与IETF的联络"
    },
    {
      "indent": 3,
      "text": "The OMA Technical Plenary shall establish an IETF liaison to be the initial contact point in the OMA for matters pertaining to the OMA-IETF cooperation. The OMA-IETF liaison function, therefore, is expected to work with the concerned IETF and OMA working groups and to support the interaction between the OMA and the IETF.",
      "zh-CHS": "OMA技术全体会议应建立IETF联络人，作为OMA中与OMA-IETF合作相关事宜的初始联络点。因此，预计OMA-IETF联络职能部门将与相关IETF和OMA工作组合作，并支持OMA和IETF之间的互动。"
    },
    {
      "indent": 0,
      "text": "6. Formal Liaison Statements",
      "section_title": true,
      "zh-CHS": "6. 正式联络声明"
    },
    {
      "indent": 3,
      "text": "Whenever possible, and as the preferred primary method of communication and coordination of activity, communication at the working group level is strongly encouraged.",
      "zh-CHS": "在可能的情况下，作为交流和协调活动的首选主要方法，强烈鼓励工作组一级的交流。"
    },
    {
      "indent": 3,
      "text": "When deemed necessary, formal communication between OMA and IETF is also permitted. These communications are to be recorded in the form of Liaison Statements, and the IETF will use the OMA liaison role to convey these statements between the IETF and the OMA. All liaison statements made by the IETF or directed to the IETF shall be published by the IETF as public documents. All liaison statements made by the IETF will comply with the IETF IPR policy as documented in RFC 3667 [1] and RFC 3668 [2].",
      "zh-CHS": "必要时，也允许OMA和IETF之间进行正式通信。这些通信将以联络声明的形式记录，IETF将使用OMA联络角色在IETF和OMA之间传达这些声明。IETF作出的或直接提交给IETF的所有联络声明应由IETF作为公共文件发布。IETF作出的所有联络声明将符合RFC 3667[1]和RFC 3668[2]中记录的IETF知识产权政策。"
    },
    {
      "indent": 0,
      "text": "7. Contributions",
      "section_title": true,
      "zh-CHS": "7. 贡献"
    },
    {
      "indent": 3,
      "text": "OMA members may make contributions to the IETF in their capacity as IETF participants, under the IETF's IPR policy, as documented in RFC 3667 [1] and RFC3668 [2].",
      "zh-CHS": "OMA成员可根据IETF的知识产权政策，以IETF参与者的身份向IETF作出贡献，如RFC 3667[1]和RFC3668[2]所述。"
    },
    {
      "indent": 3,
      "text": "IETF participants who are also members of the OMA may make contributions to the OMA only in their capacity as OMA members, under the OMA's membership rules, including its IPR policy.",
      "zh-CHS": "同时也是OMA成员的IETF参与者只能以OMA成员的身份，根据OMA的成员规则，包括其知识产权政策，向OMA作出贡献。"
    },
    {
      "indent": 3,
      "text": "OMA mailing lists are not open to the general public. It is recommended that work of mutual interest be discussed on the relevant IETF mailing lists.",
      "zh-CHS": "OMA邮件列表不对公众开放。建议在相关IETF邮件列表上讨论共同感兴趣的工作。"
    },
    {
      "indent": 3,
      "text": "The OMA may make normative references to the IETF Proposed Standard, Draft Standard, Standard, Best Common Practice and Informational specifications that are published as part of the \"Request for Comments\" (RFC) document series.",
      "zh-CHS": "OMA可以对IETF提议的标准、标准草案、标准、最佳通用做法和信息性规范进行规范性引用，这些规范作为“征求意见”（RFC）文件系列的一部分发布。"
    },
    {
      "indent": 0,
      "text": "8. Co-development of Documents",
      "section_title": true,
      "zh-CHS": "8. 文件的共同开发"
    },
    {
      "indent": 3,
      "text": "The IETF and the OMA will not co-develop any documents or material.",
      "zh-CHS": "IETF和OMA不会共同开发任何文件或材料。"
    },
    {
      "indent": 0,
      "text": "9. Terms of Agreement",
      "section_title": true,
      "zh-CHS": "9. 协议条款"
    },
    {
      "indent": 0,
      "text": "9.1. Limitation of Liability",
      "section_title": true,
      "zh-CHS": "9.1. 赔偿责任限制"
    },
    {
      "indent": 3,
      "text": "Neither the IETF or the OMA makes any representations with respect to and does not warrant the accuracy of any information or any document. Without limiting the foregoing, each party agrees to accept the terms of and reproduce any warranty disclaimers or limitations of liability that are included in any reproduction of published material made available to it under this cooperation framework.",
      "zh-CHS": "IETF或OMA均不对任何信息或文件的准确性做出任何陈述，也不保证其准确性。在不限制上述规定的情况下，各方同意接受并复制任何担保免责声明或责任限制的条款，这些条款包含在根据本合作框架向其提供的任何出版材料的复制中。"
    },
    {
      "indent": 0,
      "text": "9.2. General",
      "section_title": true,
      "zh-CHS": "9.2. 全体的"
    },
    {
      "indent": 3,
      "text": "a. Neither the OMA or the IETF acquires any intellectual or industrial property rights under this cooperation framework or through any disclosure. No license to any patent, trademark, copyright, or other proprietary right is granted here.",
      "zh-CHS": "a. OMA或IETF均未在本合作框架下或通过任何披露获得任何知识产权或工业产权。此处未授予任何专利、商标、版权或其他所有权的许可。"
    },
    {
      "indent": 3,
      "text": "b. There is no obligation for either the OMA or the IETF to incorporate the materials presented by the other party.",
      "zh-CHS": "b. OMA或IETF均无义务纳入另一方提交的材料。"
    },
    {
      "indent": 3,
      "text": "c. This cooperation framework and the relationship between the IETF and the OMA does not constitute a partnership, joint venture, agency, or contract of employment between the IETF and the OMA.",
      "zh-CHS": "c. 本合作框架以及IETF和OMA之间的关系不构成IETF和OMA之间的合作关系、合资企业、代理或雇佣合同。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "zh-CHS": "10. 致谢"
    },
    {
      "indent": 3,
      "text": "The editors acknowledge the extensive efforts of Jorge Contreras, Leslie Daigle, Ted Hardie, Allison Mankin, Thomas Narten, Isabelle Valet-Harper, and Dean Willis in contributing to this document.",
      "zh-CHS": "编辑们感谢豪尔赫·孔特雷拉斯、莱斯利·戴格尔、特德·哈迪、艾莉森·曼金、托马斯·纳滕、伊莎贝尔·法勒·哈珀和迪安·威利斯为本文件所作的广泛努力。"
    },
    {
      "indent": 3,
      "text": "This memo took guidance from and borrowed text from RFC 3113 [3] and RFC 3131 [4].",
      "zh-CHS": "本备忘录参考了RFC 3113[3]和RFC 3131[4]的指南和参考文本。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "zh-CHS": "11. 工具书类"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "zh-CHS": "11.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"IETF Rights in Contributions\", BCP 78, RFC 3667, February 2004.",
      "zh-CHS": "[1] Bradner，S.，“IETF在贡献中的权利”，BCP 78，RFC 3667，2004年2月。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3668, February 2004.",
      "zh-CHS": "[2] Bradner，S.，“IETF技术中的知识产权”，BCP 79，RFC 3668，2004年2月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "zh-CHS": "11.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[3] Rosenbrock, K., Sanmugam, R., Bradner, S., and J. Klensin, \"3GPP-IETF Standardization Collaboration\", RFC 3113, June 2001.",
      "zh-CHS": "[3] Rosenbrock，K.，Sanmugam，R.，Bradner，S.，和J.Klesin，“3GPP-IETF标准化协作”，RFC31132001年6月。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., Calhoun, P., Cuschieri, H., Dennett, S., Flynn, G., Lipford, M., and M. McPheters, \"3GPP2-IETF Standardization Collaboration\", RFC 3131, June 2001.",
      "zh-CHS": "[4] Bradner，S.，Calhoun，P.，Cuschieri，H.，Dennett，S.，Flynn，G.，Lipford，M.，和M.McPheters，“3GPP2-IETF标准化协作”，RFC31312001年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Work Areas",
      "section_title": true,
      "zh-CHS": "附录A.工作区域"
    },
    {
      "indent": 3,
      "text": "The areas of common interest between the IETF and the OMA include the following:",
      "zh-CHS": "IETF和OMA之间共同感兴趣的领域包括："
    },
    {
      "indent": 3,
      "text": "o Instant Messaging based on SIP/SIMPLE o Presence and availability o Privacy o SIP Event Notification o Location services, such as geographic location o Device management o Multimedia messaging, including email interconnectivity and mapping o Group management o Telephone number mapping (ENUM)",
      "zh-CHS": "o 基于SIP/SIMPLE的即时消息o存在性和可用性o隐私o SIP事件通知o位置服务，如地理位置o设备管理o彩信，包括电子邮件互连和映射o组管理o电话号码映射（ENUM）"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Geoff Huston (editor) Internet Architecture Board",
      "zh-CHS": "杰夫·休斯顿（编辑）互联网架构委员会"
    },
    {
      "indent": 3,
      "text": "EMail: execd@iab.org\nURI:   http://www.iab.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Ileana Leuca (editor) Open Mobile Alliance",
      "zh-CHS": "Ileana Leuca（编辑）开放移动联盟"
    },
    {
      "indent": 3,
      "text": "EMail: ileana.leuca@Cingular.com\nURI:   http://www.openmobilealliance.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the IETF's procedures with respect to rights in IETF Documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关IETF文件中权利的IETF程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}