{
  "title": {
    "text": "RFC 3005: IETF Discussion List Charter ",
    "zh-CHS": "RFC 3005"
  },
  "number": 3005,
  "created_at": "2021-10-25 14:13:20.122117+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          S. Harris\nRequest for Comments: 3005                                 Merit Network\nBCP: 45                                                    November 2000\nCategory: Best Current Practice",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "IETF Discussion List Charter",
      "zh-CHS": "IETF讨论列表章程"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Internet Engineering Task Force (IETF) discussion mailing list furthers the development and specification of Internet technology through discussion of technical issues, and hosts discussions of IETF direction, policy, meetings, and procedures. As this is the most general IETF mailing list, considerable latitude is allowed. Advertising, whether to solicit business or promote employment opportunities, falls well outside the range of acceptable topics, as do discussions of a personal nature.",
      "zh-CHS": "互联网工程任务组（IETF）讨论邮件列表通过讨论技术问题促进互联网技术的发展和规范，并主持IETF方向、政策、会议和程序的讨论。由于这是最通用的IETF邮件列表，因此允许有相当大的自由度。广告，无论是招揽生意还是促进就业机会，都远远超出了可接受的话题范围，个人性质的讨论也是如此。"
    },
    {
      "indent": 0,
      "text": "Charter for the IETF Discussion List",
      "zh-CHS": "IETF讨论清单章程"
    },
    {
      "indent": 3,
      "text": "The IETF discussion list, ietf@ietf.org, serves two purposes. It furthers the development and specification of Internet technology through discussion of technical issues. It also hosts discussions of IETF direction, policy, meetings, and procedures. As this is the most general IETF mailing list, considerable latitude is allowed. Advertising, whether to solicit business or promote employment opportunities, falls well outside the range of acceptable topics, as do discussions of a personal nature.",
      "zh-CHS": "IETF讨论列表，ietf@ietf.org，有两个目的。它通过对技术问题的讨论进一步推动了互联网技术的发展和规范。它还主持IETF方向、政策、会议和程序的讨论。由于这是最通用的IETF邮件列表，因此允许有相当大的自由度。广告，无论是招揽生意还是促进就业机会，都远远超出了可接受的话题范围，个人性质的讨论也是如此。"
    },
    {
      "indent": 3,
      "text": "This list is meant for initial discussion only. Discussions that fall within the area of any working group or well established list should be moved to such more specific forum as soon as this is pointed out, unless the issue is one for which the working group needs wider input or direction.",
      "zh-CHS": "此列表仅供初步讨论。属于任何工作组或既定名单范围内的讨论，一旦被指出，应立即转移到更具体的论坛，除非该问题是工作组需要更广泛投入或指导的问题。"
    },
    {
      "indent": 3,
      "text": "In addition to the topics noted above, appropriate postings include:",
      "zh-CHS": "除上述主题外，适当的帖子还包括："
    },
    {
      "indent": 4,
      "text": "- Last Call discussions of proposed protocol actions - Discussion of technical issues that are candidates for IETF work, but do not yet have an appropriate e-mail venue - Discussion of IETF administrative policies - Questions and clarifications concerning IETF meetings - Announcements of conferences, events, or activities that are sponsored or endorsed by the Internet Society or IETF.",
      "zh-CHS": "- 建议的协议行动的最后通话讨论-讨论IETF工作的候选技术问题，但尚未有适当的电子邮件地址-讨论IETF管理政策-关于IETF会议的问题和澄清-会议、活动的公告，或由互联网协会或IETF赞助或认可的活动。"
    },
    {
      "indent": 3,
      "text": "Inappropriate postings include:",
      "zh-CHS": "不恰当的帖子包括："
    },
    {
      "indent": 4,
      "text": "- Unsolicited bulk e-mail - Discussion of subjects unrelated to IETF policy, meetings, activities, or technical concerns - Unprofessional commentary, regardless of the general subject - Announcements of conferences, events, or activities that are not sponsored or endorsed by the Internet Society or IETF.",
      "zh-CHS": "- 未经请求的批量电子邮件-讨论与IETF政策、会议、活动或技术问题无关的主题-非专业评论，无论一般主题如何-未经互联网协会或IETF赞助或认可的会议、活动或活动的公告。"
    },
    {
      "indent": 3,
      "text": "The IETF Chair, the IETF Executive Director, or a sergeant-at-arms appointed by the Chair is empowered to restrict posting by a person, or of a thread, when the content is inappropriate and represents a pattern of abuse. They are encouraged to take into account the overall nature of the postings by an individual and whether particular postings are an aberration or typical. Complaints regarding their decisions should be referred to the IAB.",
      "zh-CHS": "IETF主席、IETF执行董事或主席任命的军士有权在内容不适当且代表滥用模式时限制个人或帖子的发布。鼓励他们考虑个人发布的总体性质，以及特定发布是反常的还是典型的。有关其决定的投诉应提交IAB。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "Comments by Donald E. Eastlake 3rd and other members of the IETF POISSON working group are gratefully acknowledged.",
      "zh-CHS": "感谢Donald E.Eastlake 3rd和IETF POISSON工作组其他成员的评论。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Susan R. Harris Merit Network, Inc. 4251 Plymouth Rd., Suite C Ann Arbor, MI 48105-2785",
      "zh-CHS": "Susan R.Harris Merit Network，Inc.密歇根州安娜堡普利茅斯路4251号C室，邮编：48105-2785"
    },
    {
      "indent": 3,
      "text": "Phone: (734) 936-2100 Fax: (734) 647-3185 EMail: srh@merit.edu",
      "zh-CHS": "电话：（734）936-2100传真：（734）647-3185电子邮件：srh@merit.edu"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2000年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}