{
  "title": {
    "text": "RFC 3439:  Some Internet Architectural Guidelines and Philosophy ",
    "zh-CHS": "RFC 3439"
  },
  "number": 3439,
  "created_at": "2021-10-27 03:21:54.566504+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            R. Bush\nRequest for Comments: 3439                                      D. Meyer\nUpdates: 1958                                              December 2002\nCategory: Informational",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Some Internet Architectural Guidelines and Philosophy",
      "zh-CHS": "一些互联网架构指南和理念"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document extends RFC 1958 by outlining some of the philosophical guidelines to which architects and designers of Internet backbone networks should adhere. We describe the Simplicity Principle, which states that complexity is the primary mechanism that impedes efficient scaling, and discuss its implications on the architecture, design and engineering issues found in large scale Internet backbones.",
      "zh-CHS": "本文件通过概述互联网骨干网络的架构师和设计师应遵守的一些哲学准则，扩展了RFC 1958。我们描述了简单性原则，即复杂性是阻碍有效扩展的主要机制，并讨论了它对大规模互联网主干网的架构、设计和工程问题的影响。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction . . . . . . . . . . . . . . . . . . . . . . . .  2\n2. Large Systems and The Simplicity Principle . . . . . . . . .  3\n2.1. The End-to-End Argument and Simplicity   . . . . . . . . .  3\n2.2. Non-linearity and Network Complexity   . . . . . . . . . .  3\n2.2.1. The Amplification Principle. . . . . . . . . . . . . . .  4\n2.2.2. The Coupling Principle . . . . . . . . . . . . . . . . .  5\n2.3. Complexity lesson from voice. . . . .  . . . . . . . . . .  6\n2.4. Upgrade cost of complexity. . . . . .  . . . . . . . . . .  7\n3. Layering Considered Harmful. . . . . . . . . . . . . . . . .  7\n3.1. Optimization Considered Harmful . . .  . . . . . . . . . .  8\n3.2. Feature Richness Considered Harmful .  . . . . . . . . . .  9\n3.3. Evolution of Transport Efficiency for IP.  . . . . . . . .  9\n3.4. Convergence Layering. . . . . . . . . . .  . . . . . . . .  9\n3.4.1. Note on Transport Protocol Layering. . . . . . . . . . . 11\n3.5. Second Order Effects   . . . . . . . . . . . . . . . . . . 11\n3.6. Instantiating the EOSL Model with IP   . . . . . . . . . . 12\n4. Avoid the Universal Interworking Function. . . . . . . . . . 12\n4.1. Avoid Control Plane Interworking . . . . . . . . . . . . . 13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "5. Packet versus Circuit Switching: Fundamental Differences . . 13\n5.1. Is PS is inherently more efficient than CS?  . . . . . . . 13\n5.2. Is PS simpler than CS? . . . . . . . . . . . . . . . . . . 14\n5.2.1. Software/Firmware Complexity . . . . . . . . . . . . . . 15\n5.2.2. Macro Operation Complexity . . . . . . . . . . . . . . . 15\n5.2.3. Hardware Complexity. . . . . . . . . . . . . . . . . . . 15\n5.2.4. Power. . . . . . . . . . . . . . . . . . . . . . . . . . 16\n5.2.5. Density. . . . . . . . . . . . . . . . . . . . . . . . . 16\n5.2.6. Fixed versus variable costs. . . . . . . . . . . . . . . 16\n5.2.7. QoS. . . . . . . . . . . . . . . . . . . . . . . . . . . 17\n5.2.8. Flexibility. . . . . . . . . . . . . . . . . . . . . . . 17\n5.3. Relative Complexity  . . . . . . . . . . . . . . . . . . . 17\n5.3.1. HBHI and the OPEX Challenge. . . . . . . . . . . . . . . 18\n6. The Myth of Over-Provisioning. . . . . . . . . . . . . . . . 18\n7. The Myth of Five Nines . . . . . . . . . . . . . . . . . . . 19\n8. Architectural Component Proportionality Law. . . . . . . . . 20\n8.1. Service Delivery Paths . . . . . . . . . . . . . . . . . . 21\n9. Conclusions. . . . . . . . . . . . . . . . . . . . . . . . . 21\n10. Security Considerations . . . . . . . . . . . . . . . . . . 22\n11. Acknowledgments . . . . . . . . . . . . . . . . . . . . . . 23\n12. References. . . . . . . . . . . . . . . . . . . . . . . . . 23\n13. Authors' Addresses. . . . . . . . . . . . . . . . . . . . . 27\n14. Full Copyright Statement. . . . . . . . . . . . . . . . . . 28",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "RFC 1958 [RFC1958] describes the underlying principles of the Internet architecture. This note extends that work by outlining some of the philosophical guidelines to which architects and designers of Internet backbone networks should adhere. While many of the areas outlined in this document may be controversial, the unifying principle described here, controlling complexity as a mechanism to control costs and reliability, should not be. Complexity in carrier networks can derive from many sources. However, as stated in [DOYLE2002], \"Complexity in most systems is driven by the need for robustness to uncertainty in their environments and component parts far more than by basic functionality\". The major thrust of this document, then, is to raise awareness about the complexity of some of our current architectures, and to examine the effect such complexity will almost certainly have on the IP carrier industry's ability to succeed.",
      "zh-CHS": "RFC 1958[RFC1958]描述了互联网体系结构的基本原理。本说明通过概述互联网骨干网络的架构师和设计师应遵守的一些哲学准则，扩展了这项工作。虽然本文件中概述的许多领域可能存在争议，但此处描述的统一原则，即控制复杂性作为控制成本和可靠性的机制，不应被忽略。载波网络的复杂性可能来自多个来源。然而，正如[DOYLE2002]中所述，“大多数系统的复杂性是由对其环境和组件中的不确定性的鲁棒性的需求驱动的，而不是由基本功能驱动的”。因此，本文档的主要目的是提高对我们当前某些体系结构复杂性的认识，并研究这种复杂性几乎肯定会对IP运营商行业的成功能力产生的影响。"
    },
    {
      "indent": 3,
      "text": "The rest of this document is organized as follows: The first section describes the Simplicity Principle and its implications for the design of very large systems. The remainder of the document outlines the high-level consequences of the Simplicity Principle and how it should guide large scale network architecture and design approaches.",
      "zh-CHS": "本文档的其余部分组织如下：第一部分描述了简单性原则及其对超大系统设计的影响。本文档的其余部分概述了简单性原则的高级后果，以及它应该如何指导大规模网络体系结构和设计方法。"
    },
    {
      "indent": 0,
      "text": "2. Large Systems and The Simplicity Principle",
      "section_title": true,
      "zh-CHS": "2. 大系统与简单性原则"
    },
    {
      "indent": 3,
      "text": "The Simplicity Principle, which was perhaps first articulated by Mike O'Dell, former Chief Architect at UUNET, states that complexity is the primary mechanism which impedes efficient scaling, and as a result is the primary driver of increases in both capital expenditures (CAPEX) and operational expenditures (OPEX). The implication for carrier IP networks then, is that to be successful we must drive our architectures and designs toward the simplest possible solutions.",
      "zh-CHS": "简单性原则可能最早由UUNET前首席架构师迈克·奥戴尔（Mike O’Dell）提出，指出复杂性是阻碍有效扩展的主要机制，因此是资本支出（CAPEX）和运营支出（OPEX）增加的主要驱动力。因此，运营商IP网络的含义是，为了取得成功，我们必须推动我们的架构和设计朝着最简单的解决方案发展。"
    },
    {
      "indent": 0,
      "text": "2.1. The End-to-End Argument and Simplicity",
      "section_title": true,
      "zh-CHS": "2.1. 端到端的论证和简单性"
    },
    {
      "indent": 3,
      "text": "The end-to-end argument, which is described in [SALTZER] (as well as in RFC 1958 [RFC1958]), contends that \"end-to-end protocol design should not rely on the maintenance of state (i.e., information about the state of the end-to-end communication) inside the network. Such state should be maintained only in the end points, in such a way that the state can only be destroyed when the end point itself breaks.\" This property has also been related to Clark's \"fate-sharing\" concept [CLARK]. We can see that the end-to-end principle leads directly to the Simplicity Principle by examining the so-called \"hourglass\" formulation of the Internet architecture [WILLINGER2002]. In this model, the thin waist of the hourglass is envisioned as the (minimalist) IP layer, and any additional complexity is added above the IP layer. In short, the complexity of the Internet belongs at the edges, and the IP layer of the Internet should remain as simple as possible.",
      "zh-CHS": "[SALTZER]（以及RFC 1958[RFC1958]）中描述的端到端论点主张“端到端协议设计不应依赖于状态的维护（即，关于端到端通信状态的信息）在网络内部。这种状态应该只在端点保持，这样只有当端点本身断裂时，状态才能被破坏。”这一属性也与克拉克的“命运共享”概念有关[Clark]。通过检查互联网架构的所谓“沙漏”公式，我们可以看到端到端原则直接导致了简单性原则[WILLINGER2002]。在这个模型中，沙漏的细腰被设想为（最低限度的）IP层，任何额外的复杂性都被添加到IP层之上。简言之，互联网的复杂性属于边缘，互联网的IP层应该尽可能简单。"
    },
    {
      "indent": 3,
      "text": "Finally, note that the End-to-End Argument does not imply that the core of the Internet will not contain and maintain state. In fact, a huge amount coarse grained state is maintained in the Internet's core (e.g., routing state). However, the important point here is that this (coarse grained) state is almost orthogonal to the state maintained by the end-points (e.g., hosts). It is this minimization of interaction that contributes to simplicity. As a result, consideration of \"core vs. end-point\" state interaction is crucial when analyzing protocols such as Network Address Translation (NAT), which reduce the transparency between network and hosts.",
      "zh-CHS": "最后，请注意，端到端的论点并不意味着互联网的核心将不包含和维护状态。事实上，互联网的核心保持着大量的粗粒度状态（例如，路由状态）。然而，这里重要的一点是，该（粗粒度）状态几乎与端点（例如主机）维护的状态正交。正是这种相互作用的最小化有助于简化。因此，在分析诸如网络地址转换（NAT）之类的协议时，考虑“核心与端点”状态交互至关重要，因为NAT降低了网络和主机之间的透明度。"
    },
    {
      "indent": 0,
      "text": "2.2. Non-linearity and Network Complexity",
      "section_title": true,
      "zh-CHS": "2.2. 非线性与网络复杂性"
    },
    {
      "indent": 3,
      "text": "Complex architectures and designs have been (and continue to be) among the most significant and challenging barriers to building cost-effective large scale IP networks. Consider, for example, the task of building a large scale packet network. Industry experience has shown that building such a network is a different activity (and hence requires a different skill set) than building a small to medium scale",
      "zh-CHS": "复杂的体系结构和设计已经（并将继续）成为建设成本效益高的大规模IP网络的最重要和最具挑战性的障碍之一。例如，考虑构建大规模分组网络的任务。行业经验表明，构建这样一个网络与构建中小型网络是不同的活动（因此需要不同的技能）"
    },
    {
      "indent": 3,
      "text": "network, and as such doesn't have the same properties. In particular, the largest networks exhibit, both in theory and in practice, architecture, design, and engineering non-linearities which are not exhibited at smaller scale. We call this Architecture, Design, and Engineering (ADE) non-linearity. That is, systems such as the Internet could be described as highly self-dissimilar, with extremely different scales and levels of abstraction [CARLSON]. The ADE non-linearity property is based upon two well-known principles from non-linear systems theory [THOMPSON]:",
      "zh-CHS": "网络，因此不具有相同的属性。特别是，最大的网络在理论和实践上都表现出了架构、设计和工程非线性，而这些非线性在较小的规模上都没有表现出来。我们称之为架构、设计和工程（ADE）非线性。也就是说，像互联网这样的系统可以被描述为高度自异的，具有极其不同的规模和抽象层次[CARLSON]。ADE非线性特性基于非线性系统理论[THOMPSON]的两个著名原理："
    },
    {
      "indent": 0,
      "text": "2.2.1. The Amplification Principle",
      "section_title": true,
      "zh-CHS": "2.2.1. 放大原理"
    },
    {
      "indent": 3,
      "text": "The Amplification Principle states that there are non-linearities which occur at large scale which do not occur at small to medium scale.",
      "zh-CHS": "放大原理表明，在大尺度上存在非线性，而在中小尺度上不存在非线性。"
    },
    {
      "indent": 3,
      "text": "COROLLARY: In many large networks, even small things can and do cause huge events. In system-theoretic terms, in large systems such as these, even small perturbations on the input to a process can destabilize the system's output.",
      "zh-CHS": "推论：在许多大型网络中，即使是很小的事情也会引起重大事件。从系统理论的角度来看，在这样的大系统中，即使对过程输入的微小扰动也会使系统的输出不稳定。"
    },
    {
      "indent": 3,
      "text": "An important example of the Amplification Principle is non-linear resonant amplification, which is a powerful process that can transform dynamic systems, such as large networks, in surprising ways with seemingly small fluctuations. These small fluctuations may slowly accumulate, and if they are synchronized with other cycles, may produce major changes. Resonant phenomena are examples of non-linear behavior where small fluctuations may be amplified and have influences far exceeding their initial sizes. The natural world is filled with examples of resonant behavior that can produce system-wide changes, such as the destruction of the Tacoma Narrows bridge (due to the resonant amplification of small gusts of wind). Other examples include the gaps in the asteroid belts and rings of Saturn which are created by non-linear resonant amplification. Some features of human behavior and most pilgrimage systems are influenced by resonant phenomena involving the dynamics of the solar system, such as solar days, the 27.3 day (sidereal) and 29.5 day (synodic) cycles of the moon or the 365.25 day cycle of the sun.",
      "zh-CHS": "放大原理的一个重要例子是非线性共振放大，这是一个强大的过程，可以用看似微小的波动以令人惊讶的方式改变动态系统，如大型网络。这些小波动可能会慢慢累积，如果它们与其他周期同步，可能会产生重大变化。共振现象是非线性行为的例子，小波动可能被放大，其影响远远超过其初始大小。自然界充满了共振行为的例子，这些共振行为可以产生全系统的变化，例如塔科马海峡大桥的破坏（由于小阵风的共振放大）。其他的例子包括小行星带和土星环上的缝隙，这些缝隙是由非线性共振放大产生的。人类行为和大多数朝圣系统的某些特征受到涉及太阳系动力学的共振现象的影响，例如太阳日、月球的27.3天（恒星）和29.5天（同向）周期或太阳的365.25天周期。"
    },
    {
      "indent": 3,
      "text": "In the Internet domain, it has been shown that increased inter-connectivity results in more complex and often slower BGP routing convergence [AHUJA]. A related result is that a small amount of inter-connectivity causes the output of a routing mesh to be significantly more complex than its input [GRIFFIN]. An important method for reducing amplification is ensure that local changes have only local effect (this is as opposed to systems in which local changes have global effect). Finally, ATM provides an excellent example of an amplification effect: if you lose one cell, you destroy",
      "zh-CHS": "在互联网领域，研究表明，互联互通的增加会导致更复杂、更慢的BGP路由收敛[AHUJA]。一个相关的结果是，少量的互连会导致路由网格的输出远比其输入复杂[GRIFFIN]。减少放大的一个重要方法是确保局部变化仅具有局部效应（这与局部变化具有全局效应的系统相反）。最后，ATM为放大效应提供了一个很好的例子：如果你失去一个信元，你就毁灭了它"
    },
    {
      "indent": 3,
      "text": "the entire packet (and it gets worse, as in the absence of mechanisms such as Early Packet Discard [ROMANOV], you will continue to carry the already damaged packet).",
      "zh-CHS": "整个数据包（情况变得更糟，因为在缺少早期数据包丢弃[ROMANOV]等机制的情况下，您将继续携带已经损坏的数据包）。"
    },
    {
      "indent": 3,
      "text": "Another interesting example of amplification comes from the engineering domain, and is described in [CARLSON]. They consider the Boeing 777, which is a \"fly-by-wire\" aircraft, containing as many as 150,000 subsystems and approximately 1000 CPUs. What they observe is that while the 777 is robust to large-scale atmospheric disturbances, turbulence boundaries, and variations in cargo loads (to name a few), it could be catastrophically disabled my microscopic alterations in a very few large CPUs (as the point out, fortunately this is a very rare occurrence). This example illustrates the issue \"that complexity can amplify small perturbations, and the design engineer must ensure such perturbations are extremely rare.\" [CARLSON]",
      "zh-CHS": "另一个有趣的放大例子来自工程领域，见[CARLSON]。他们考虑波音777，它是一种“飞线”飞机，包含多达150000个子系统和大约1000个CPU。他们观察到的是，尽管777对大规模大气干扰、湍流边界和货物负载变化（仅举几例）具有很强的鲁棒性，但它可能会在极少数大型CPU中被灾难性地禁用（正如所指出的，幸运的是，这是一种非常罕见的情况）。这个例子说明了一个问题：“复杂性会放大小扰动，设计工程师必须确保这种扰动极其罕见。”[CARLSON]"
    },
    {
      "indent": 0,
      "text": "2.2.2. The Coupling Principle",
      "section_title": true,
      "zh-CHS": "2.2.2. 耦合原理"
    },
    {
      "indent": 3,
      "text": "The Coupling Principle states that as things get larger, they often exhibit increased interdependence between components.",
      "zh-CHS": "耦合原理指出，随着事物变得越来越大，组件之间的相互依赖性往往会增加。"
    },
    {
      "indent": 3,
      "text": "COROLLARY: The more events that simultaneously occur, the larger the likelihood that two or more will interact. This phenomenon has also been termed \"unforeseen feature interaction\" [WILLINGER2002].",
      "zh-CHS": "推论：同时发生的事件越多，两个或更多事件相互作用的可能性就越大。这种现象也被称为“不可预见的特征交互”[WILLINGER2002]。"
    },
    {
      "indent": 3,
      "text": "Much of the non-linearity observed large systems is largely due to coupling. This coupling has both horizontal and vertical components. In the context of networking, horizontal coupling is exhibited between the same protocol layer, while vertical coupling occurs between layers.",
      "zh-CHS": "在大型系统中观察到的许多非线性很大程度上是由耦合引起的。该联轴器具有水平和垂直组件。在网络环境中，水平耦合出现在同一协议层之间，而垂直耦合出现在层之间。"
    },
    {
      "indent": 3,
      "text": "Coupling is exhibited by a wide variety of natural systems, including plasma macro-instabilities (hydro-magnetic, e.g., kink, fire-hose, mirror, ballooning, tearing, trapped-particle effects) [NAVE], as well as various kinds of electrochemical systems (consider the custom fluorescent nucleotide synthesis/nucleic acid labeling problem [WARD]). Coupling of clock physical periodicity has also been observed [JACOBSON], as well as coupling of various types of biological cycles.",
      "zh-CHS": "耦合表现为多种自然系统，包括等离子体宏观不稳定性（水磁，例如扭结、消防软管、镜子、气球、撕裂、捕获粒子效应）[NAVE]，以及各种电化学系统（考虑自定义荧光核苷酸合成/核酸标记问题[WARD]）。还观察到了时钟物理周期的耦合[JACOBSON]，以及各种生物周期的耦合。"
    },
    {
      "indent": 3,
      "text": "Several canonical examples also exist in well known network systems. Examples include the synchronization of various control loops, such as routing update synchronization and TCP Slow Start synchronization [FLOYD,JACOBSON]. An important result of these observations is that coupling is intimately related to synchronization. Injecting randomness into these systems is one way to reduce coupling.",
      "zh-CHS": "在众所周知的网络系统中也存在一些典型的例子。示例包括各种控制循环的同步，例如路由更新同步和TCP慢启动同步[FLOYD，JACOBSON]。这些观察的一个重要结果是，耦合与同步密切相关。向这些系统中注入随机性是减少耦合的一种方法。"
    },
    {
      "indent": 3,
      "text": "Interestingly, in analyzing risk factors for the Public Switched Telephone Network (PSTN), Charles Perrow decomposes the complexity problem along two related axes, which he terms \"interactions\" and \"coupling\" [PERROW]. Perrow cites interactions and coupling as significant factors in determining the reliability of a complex system (and in particular, the PSTN). In this model, interactions refer to the dependencies between components (linear or non-linear), while coupling refers to the flexibility in a system. Systems with simple, linear interactions have components that affect only other components that are functionally downstream. Complex system components interact with many other components in different and possibly distant parts of the system. Loosely coupled systems are said to have more flexibility in time constraints, sequencing, and environmental assumptions than do tightly coupled systems. In addition, systems with complex interactions and tight coupling are likely to have unforeseen failure states (of course, complex interactions permit more complications to develop and make the system hard to understand and predict); this behavior is also described in [WILLINGER2002]. Tight coupling also means that the system has less flexibility in recovering from failure states.",
      "zh-CHS": "有趣的是，在分析公共交换电话网（PSTN）的风险因素时，Charles Perrow沿着两个相关轴分解了复杂性问题，他称之为“交互”和“耦合”[Perrow]。Perrow引用交互和耦合作为决定复杂系统（尤其是PSTN）可靠性的重要因素。在这个模型中，交互是指组件之间的依赖关系（线性或非线性），而耦合是指系统中的灵活性。具有简单线性交互作用的系统的组件仅影响功能下游的其他组件。复杂的系统组件与系统中不同且可能较远的部分中的许多其他组件进行交互。据说松耦合系统比紧耦合系统在时间约束、排序和环境假设方面具有更大的灵活性。此外，具有复杂交互和紧密耦合的系统可能具有不可预见的故障状态（当然，复杂交互会导致更复杂的开发，并使系统难以理解和预测）；[WILLINGER2002]中也描述了这种行为。紧密耦合还意味着系统在从故障状态恢复时灵活性较低。"
    },
    {
      "indent": 3,
      "text": "The PSTN's SS7 control network provides an interesting example of what can go wrong with a tightly coupled complex system. Outages such as the well publicized 1991 outage of AT&T's SS7 demonstrates the phenomenon: the outage was caused by software bugs in the switches' crash recovery code. In this case, one switch crashed due to a hardware glitch. When this switch came back up, it (plus a reasonably probable timing event) caused its neighbors to crash When the neighboring switches came back up, they caused their neighbors to crash, and so on [NEUMANN] (the root cause turned out to be a misplaced 'break' statement; this is an excellent example of cross-layer coupling). This phenomenon is similar to the phase-locking of weakly coupled oscillators, in which random variations in sequence times plays an important role in system stability [THOMPSON].",
      "zh-CHS": "PSTN的SS7控制网络提供了一个有趣的例子，说明了紧密耦合的复杂系统会出现什么问题。诸如广为宣传的1991年AT&T七号信令中断之类的中断证明了这一现象：中断是由交换机故障恢复代码中的软件错误引起的。在这种情况下，一个交换机由于硬件故障而崩溃。当这个交换机重新启动时，它（加上一个合理可能的定时事件）导致了它的邻居崩溃。当相邻的交换机重新启动时，它们导致了它们的邻居崩溃，等等[NEUMANN]（根本原因是错误放置的“break”语句；这是跨层耦合的一个很好的例子）。这种现象类似于弱耦合振荡器的锁相，其中序列时间的随机变化对系统稳定性起着重要作用[THOMPSON]。"
    },
    {
      "indent": 0,
      "text": "2.3. Complexity lesson from voice",
      "section_title": true,
      "zh-CHS": "2.3. 语音的复杂性教训"
    },
    {
      "indent": 3,
      "text": "In the 1970s and 1980s, the voice carriers competed by adding features which drove substantial increases in the complexity of the PSTN, especially in the Class 5 switching infrastructure. This complexity was typically software-based, not hardware driven, and therefore had cost curves worse than Moore's Law. In summary, poor margins on voice products today are due to OPEX and CAPEX costs not dropping as we might expect from simple hardware-bound implementations.",
      "zh-CHS": "在20世纪70年代和80年代，语音运营商通过增加功能进行竞争，这推动了PSTN复杂性的大幅增加，尤其是在5级交换基础设施中。这种复杂性通常是基于软件的，而不是硬件驱动的，因此成本曲线比摩尔定律更糟糕。总之，今天语音产品的利润率很低是因为运营成本和资本支出成本没有像我们预期的那样从简单的硬件绑定实现中下降。"
    },
    {
      "indent": 0,
      "text": "2.4. Upgrade cost of complexity",
      "section_title": true,
      "zh-CHS": "2.4. 升级复杂性成本"
    },
    {
      "indent": 3,
      "text": "Consider the cost of providing new features in a complex network. The traditional voice network has little intelligence in its edge devices (phone instruments), and a very smart core. The Internet has smart edges, computers with operating systems, applications, etc., and a simple core, which consists of a control plane and packet forwarding engines. Adding an new Internet service is just a matter of distributing an application to the a few consenting desktops who wish to use it. Compare this to adding a service to voice, where one has to upgrade the entire core.",
      "zh-CHS": "考虑在复杂网络中提供新功能的成本。传统语音网络的边缘设备（电话设备）几乎没有智能，核心非常智能。互联网有智能边缘、带有操作系统的计算机、应用程序等，还有一个简单的核心，由控制平面和数据包转发引擎组成。添加一个新的互联网服务只需将一个应用程序分发给少数同意使用它的台式机即可。将此与向语音添加服务进行比较，在语音中必须升级整个核心。"
    },
    {
      "indent": 0,
      "text": "3. Layering Considered Harmful",
      "section_title": true,
      "zh-CHS": "3. 分层被认为是有害的"
    },
    {
      "indent": 3,
      "text": "There are several generic properties of layering, or vertical integration as applied to networking. In general, a layer as defined in our context implements one or more of",
      "zh-CHS": "应用于网络的分层或垂直集成有几个通用属性。通常，在我们的上下文中定义的层实现以下一个或多个"
    },
    {
      "indent": 4,
      "text": "Error Control: The layer makes the \"channel\" more reliable (e.g., reliable transport layer)",
      "zh-CHS": "差错控制：该层使“通道”更加可靠（例如，可靠传输层）"
    },
    {
      "indent": 4,
      "text": "Flow Control: The layer avoids flooding slower peer (e.g., ATM flow control)",
      "zh-CHS": "流量控制：该层避免淹没较慢的对等方（例如，ATM流量控制）"
    },
    {
      "indent": 4,
      "text": "Fragmentation: Dividing large data chunks into smaller pieces, and subsequent reassembly (e.g., TCP MSS fragmentation/reassembly)",
      "zh-CHS": "分段：将大数据块划分为较小的块，然后重新组装（例如，TCP MSS分段/重新组装）"
    },
    {
      "indent": 4,
      "text": "Multiplexing: Allow several higher level sessions share single lower level \"connection\" (e.g., ATM PVC)",
      "zh-CHS": "多路复用：允许多个较高级别的会话共享单个较低级别的“连接”（例如，ATM PVC）"
    },
    {
      "indent": 4,
      "text": "Connection Setup: Handshaking with peer (e.g., TCP three-way handshake, ATM ILMI)",
      "zh-CHS": "连接设置：与对等方握手（例如TCP三方握手、ATM ILMI）"
    },
    {
      "indent": 4,
      "text": "Addressing/Naming: Locating, managing identifiers associated with entities (e.g., GOSSIP 2 NSAP Structure [RFC1629])",
      "zh-CHS": "寻址/命名：定位、管理与实体相关的标识符（例如，GOSSIP 2 NSAP结构[RFC1629]）"
    },
    {
      "indent": 3,
      "text": "Layering of this type does have various conceptual and structuring advantages. However, in the data networking context structured layering implies that the functions of each layer are carried out completely before the protocol data unit is passed to the next layer. This means that the optimization of each layer has to be done separately. Such ordering constraints are in conflict with efficient implementation of data manipulation functions. One could accuse the layered model (e.g., TCP/IP and ISO OSI) of causing this conflict. In fact, the operations of multiplexing and segmentation both hide vital information that lower layers may need to optimize their",
      "zh-CHS": "这种类型的分层确实具有各种概念和结构优势。然而，在数据网络上下文中，结构化分层意味着在将协议数据单元传递到下一层之前，每个层的功能都已完全执行。这意味着每个层的优化必须单独进行。这种排序约束与数据操作功能的有效实现相冲突。人们可以指责分层模型（如TCP/IP和ISO OSI）导致了这种冲突。事实上，多路复用和分段操作都隐藏了底层可能需要优化其性能的重要信息"
    },
    {
      "indent": 3,
      "text": "performance. For example, layer N may duplicate lower level functionality, e.g., error recovery hop-hop versus end-to-end error recovery. In addition, different layers may need the same information (e.g., time stamp): layer N may need layer N-2 information (e.g., lower layer packet sizes), and the like [WAKEMAN]. A related and even more ironic statement comes from Tennenhouse's classic paper, \"Layered Multiplexing Considered Harmful\" [TENNENHOUSE]: \"The ATM approach to broadband networking is presently being pursued within the CCITT (and elsewhere) as the unifying mechanism for the support of service integration, rate adaptation, and jitter control within the lower layers of the network architecture. This position paper is specifically concerned with the jitter arising from the design of the \"middle\" and \"upper\" layers that operate within the end systems and relays of multi-service networks (MSNs).\"",
      "zh-CHS": "表演例如，层N可以复制较低级别的功能，例如，错误恢复跳与端到端错误恢复。此外，不同层可能需要相同的信息（例如，时间戳）：层N可能需要层N-2信息（例如，较低层分组大小），等等[WAKEMAN]。Tennenhouse的经典论文《分层复用被认为是有害的》[Tennenhouse]中有一个相关的、甚至更具讽刺意味的陈述：“目前，CCITT（和其他地方）正在研究宽带网络的ATM方法作为支持服务集成、速率自适应和抖动控制的统一机制，在网络体系结构的较低层内。本立场文件特别关注“中间”和“上层”设计引起的抖动“在多业务网络（MSN）的终端系统和中继中运行的层。”"
    },
    {
      "indent": 3,
      "text": "As a result of inter-layer dependencies, increased layering can quickly lead to violation of the Simplicity Principle. Industry experience has taught us that increased layering frequently increases complexity and hence leads to increases in OPEX, as is predicted by the Simplicity Principle. A corollary is stated in RFC 1925 [RFC1925], section 2(5):",
      "zh-CHS": "由于层间的依赖性，增加的分层会很快导致违反简单性原则。行业经验告诉我们，增加的分层经常会增加复杂性，从而导致运营成本的增加，正如简单性原则所预测的那样。RFC 1925[RFC1925]第2（5）节规定了一个推论："
    },
    {
      "indent": 6,
      "text": "\"It is always possible to agglutinate multiple separate problems into a single complex interdependent solution. In most cases this is a bad idea.\"",
      "zh-CHS": "“总是有可能将多个独立的问题凝聚成一个复杂的相互依存的解决方案。在大多数情况下，这是一个坏主意。”"
    },
    {
      "indent": 3,
      "text": "The first order conclusion then, is that horizontal (as opposed to vertical) separation may be more cost-effective and reliable in the long term.",
      "zh-CHS": "因此，一级结论是，从长远来看，水平（相对于垂直）分离可能更具成本效益和可靠性。"
    },
    {
      "indent": 0,
      "text": "3.1. Optimization Considered Harmful",
      "section_title": true,
      "zh-CHS": "3.1. 被认为有害的优化"
    },
    {
      "indent": 3,
      "text": "A corollary of the layering arguments above is that optimization can also be considered harmful. In particular, optimization introduces complexity, and as well as introducing tighter coupling between components and layers.",
      "zh-CHS": "上述分层论证的一个推论是，优化也可能被认为是有害的。特别是，优化引入了复杂性，并且在组件和层之间引入了更紧密的耦合。"
    },
    {
      "indent": 3,
      "text": "An important and related effect of optimization is described by the Law of Diminishing Returns, which states that if one factor of production is increased while the others remain constant, the overall returns will relatively decrease after a certain point [SPILLMAN]. The implication here is that trying to squeeze out efficiency past that point only adds complexity, and hence leads to less reliable systems.",
      "zh-CHS": "收益递减定律描述了优化的一个重要相关效应，该定律指出，如果一个生产要素增加，而其他生产要素保持不变，那么在某一点之后，总体收益将相对减少[SPILLMAN]。这里的含义是，试图挤出效率超过这一点只会增加复杂性，从而导致系统可靠性降低。"
    },
    {
      "indent": 0,
      "text": "3.2. Feature Richness Considered Harmful",
      "section_title": true,
      "zh-CHS": "3.2. 被认为有害的特征丰富性"
    },
    {
      "indent": 3,
      "text": "While adding any new feature may be considered a gain (and in fact frequently differentiates vendors of various types of equipment), but there is a danger. The danger is in increased system complexity.",
      "zh-CHS": "虽然添加任何新功能都可能被认为是一种优势（事实上，不同类型设备的供应商之间往往存在差异），但也存在一种危险。危险在于系统复杂性的增加。"
    },
    {
      "indent": 0,
      "text": "3.3. Evolution of Transport Efficiency for IP",
      "section_title": true,
      "zh-CHS": "3.3. IP网络传输效率的演变"
    },
    {
      "indent": 3,
      "text": "The evolution of transport infrastructures for IP offers a good example of how decreasing vertical integration has lead to various efficiencies. In particular,",
      "zh-CHS": "IP运输基础设施的发展提供了一个很好的例子，说明了垂直一体化的减少如何导致各种效率的提高。特别地，"
    },
    {
      "indent": 3,
      "text": " | IP over ATM over SONET  -->\n | IP over SONET over WDM  -->\n | IP over WDM\n |\n\\|/\nDecreasing complexity, CAPEX, OPEX",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The key point here is that layers are removed resulting in CAPEX and OPEX efficiencies.",
      "zh-CHS": "这里的关键点是，层被移除，从而产生资本支出和运营支出效率。"
    },
    {
      "indent": 0,
      "text": "3.4. Convergence Layering",
      "section_title": true,
      "zh-CHS": "3.4. 收敛分层"
    },
    {
      "indent": 3,
      "text": "Convergence is related to the layering concepts described above in that convergence is achieved via a \"convergence layer\". The end state of the convergence argument is the concept of Everything Over Some Layer (EOSL). Conduit, DWDM, fiber, ATM, MPLS, and even IP have all been proposed as convergence layers. It is important to note that since layering typically drives OPEX up, we expect convergence will as well. This observation is again consistent with industry experience.",
      "zh-CHS": "收敛与上述分层概念相关，因为收敛是通过“收敛层”实现的。收敛论元的最终状态是某一层上的一切（EOSL）的概念。导管、DWDM、光纤、ATM、MPLS甚至IP都被提议作为汇聚层。需要注意的是，由于分层通常会导致运营成本上升，我们预计也会出现收敛。这一观察结果再次符合行业经验。"
    },
    {
      "indent": 3,
      "text": "There are many notable examples of convergence layer failure. Perhaps the most germane example is IP over ATM. The immediate and most obvious consequence of ATM layering is the so-called cell tax: First, note that the complete answer on ATM efficiency is that it depends upon packet size distributions. Let's assume that typical Internet type traffic patterns, which tend to have high percentages of packets at 40, 44, and 552 bytes. Recent data [CAIDA] shows that about 95% of WAN bytes and 85% of packets are TCP. Much of this traffic is composed of 40/44 byte packets.",
      "zh-CHS": "收敛层失效的例子很多。也许最密切的例子是ATM上的IP。ATM分层的直接和最明显的结果是所谓的信元税：首先，请注意，ATM效率的完整答案是它取决于数据包大小分布。让我们假设典型的互联网类型的流量模式，往往有40、44和552字节的高百分比数据包。最近的数据[CAIDA]显示，大约95%的广域网字节和85%的数据包是TCP。其中大部分流量由40/44字节的数据包组成。"
    },
    {
      "indent": 3,
      "text": "Now, consider the case of a a DS3 backbone with PLCP turned on.  Then\nthe maximum cell rate is 96,000 cells/sec.  If you multiply this\nvalue by the number of bits in the payload, you get: 96000 cells/sec\n* 48 bytes/cell * 8 = 36.864 Mbps.  This, however, is unrealistic\nsince it",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "assumes perfect payload packing. There are two other things that contribute to the ATM overhead (cell tax): The wasted padding and the 8 byte SNAP header.",
      "zh-CHS": "假设有效载荷包装完美。还有两个因素会导致ATM开销（信元税）：浪费的填充和8字节的快照头。"
    },
    {
      "indent": 3,
      "text": "It is the SNAP header which causes most of the problems (and you can't do anything about this), forcing most small packets to consume two cells, with the second cell to be mostly empty padding (this interacts really poorly with the data quoted above, e.g., that most packets are 40-44 byte TCP Ack packets). This causes a loss of about another 16% from the 36.8 Mbps ideal throughput.",
      "zh-CHS": "SNAP报头导致了大多数问题（对此您无能为力），迫使大多数小数据包使用两个单元，而第二个单元大部分为空填充（这与上面引用的数据交互非常差，例如，大多数数据包是40-44字节的TCP Ack数据包）。这将导致36.8 Mbps的理想吞吐量再损失约16%。"
    },
    {
      "indent": 3,
      "text": "So the total throughput ends up being (for a DS3):",
      "zh-CHS": "因此，总吞吐量最终为（对于DS3）："
    },
    {
      "indent": 13,
      "text": "DS3 Line Rate:              44.736\nPLCP Overhead              - 4.032\nPer Cell Header:           - 3.840\nSNAP Header & Padding:     - 5.900\n                          =========\n                            30.960 Mbps",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Result: With a DS3 line rate of 44.736 Mbps, the total overhead is about 31%.",
      "zh-CHS": "结果：当DS3线路速率为44.736Mbps时，总开销约为31%。"
    },
    {
      "indent": 3,
      "text": "Another way to look at this is that since a large fraction of WAN traffic is comprised of TCP ACKs, one can make a different but related calculation. IP over ATM requires:",
      "zh-CHS": "另一种方法是，由于广域网流量的很大一部分由TCP ACK组成，因此可以进行不同但相关的计算。ATM上的IP要求："
    },
    {
      "indent": 13,
      "text": "IP data (40 bytes in this case) 8 bytes SNAP 8 bytes AAL5 stuff 5 bytes for each cell + as much more as it takes to fill out the last cell",
      "zh-CHS": "IP数据（本例中为40字节）8字节快照8字节AAL5填充每个单元格5字节+填充最后一个单元格所需的数据量"
    },
    {
      "indent": 3,
      "text": "On ATM, this becomes two cells - 106 bytes to convey 40 bytes of information. The next most common size seems to be one of several sizes in the 504-556 byte range - 636 bytes to carry IP, TCP, and a 512 byte TCP payload - with messages larger than 1000 bytes running third.",
      "zh-CHS": "在ATM上，这变成了两个信元——106个字节来传输40个字节的信息。下一个最常见的大小似乎是504-556字节范围内的几种大小之一—636字节用于承载IP、TCP和512字节TCP负载—大于1000字节的消息在第三个字节中运行。"
    },
    {
      "indent": 3,
      "text": "One would imagine that 87% payload (556 byte message size) is better than 37% payload (TCP Ack size), but it's not the 95-98% that customers are used to, and the predominance of TCP Acks skews the average.",
      "zh-CHS": "可以想象87%的有效负载（556字节的消息大小）比37%的有效负载（TCP Ack大小）好，但这并不是客户习惯的95-98%，TCP Ack的优势使平均值出现偏差。"
    },
    {
      "indent": 0,
      "text": "3.4.1. Note on Transport Protocol Layering",
      "section_title": true,
      "zh-CHS": "3.4.1. 关于传输协议分层的说明"
    },
    {
      "indent": 3,
      "text": "Protocol layering models are frequently cast as \"X over Y\" models. In these cases, protocol Y carries protocol X's protocol data units (and possibly control data) over Y's data plane, i.e., Y is a \"convergence layer\". Examples include Frame Relay over ATM, IP over ATM, and IP over MPLS. While X over Y layering has met with only marginal success [TENNENHOUSE,WAKEMAN], there have been a few notable instances where efficiency can be and is gained. In particular, \"X over Y efficiencies\" can be realized when there is a kind of \"isomorphism\" between the X and Y (i.e., there is a small convergence layer). In these cases X's data, and possibly control traffic, are \"encapsulated\" and transported over Y. Examples include Frame Relay over ATM, and Frame Relay, AAL5 ATM and Ethernet over L2TPv3 [L2TPV3]; the simplifying factors here are that there is no requirement that a shared clock be recovered by the communicating end points, and that control-plane interworking is minimized. An alternative is to interwork the X and Y's control and data planes; control-plane interworking is discussed below.",
      "zh-CHS": "协议分层模型通常被转换为“X对Y”模型。在这些情况下，协议Y在Y的数据平面上承载协议X的协议数据单元（以及可能的控制数据），即Y是“汇聚层”。示例包括ATM上的帧中继、ATM上的IP和MPLS上的IP。虽然X-over-Y分层只取得了微乎其微的成功[TENNENHOUSE，WAKEMAN]，但也有一些显著的例子可以提高效率。特别地，当X和Y之间存在一种“同构”（即存在一个小的收敛层）时，可以实现“X对Y效率”。在这些情况下，X的数据和可能的控制流量被“封装”并通过Y传输。示例包括ATM上的帧中继和L2TPv3[L2TPv3]上的帧中继、AAL5 ATM和以太网；这里的简化因素是，不需要通过通信端点恢复共享时钟，并且控制平面互通被最小化。另一种方法是将X和Y的控制平面和数据平面相互连接；下面讨论控制平面互通。"
    },
    {
      "indent": 0,
      "text": "3.5. Second Order Effects",
      "section_title": true,
      "zh-CHS": "3.5. 二阶效应"
    },
    {
      "indent": 3,
      "text": "IP over ATM provides an excellent example of unanticipated second order effects. In particular, Romanov and Floyd's classic study on TCP good-put [ROMANOV] on ATM showed that large UBR buffers (larger than one TCP window size) are required to achieve reasonable performance, that packet discard mechanisms (such as Early Packet Discard, or EPD) improve the effective usage of the bandwidth and that more elaborate service and drop strategies than FIFO+EPD, such as per VC queuing and accounting, might be required at the bottleneck to ensure both high efficiency and fairness. Though all studies clearly indicate that a buffer size not less than one TCP window size is required, the amount of extra buffer required naturally depends on the packet discard mechanism used and is still an open issue.",
      "zh-CHS": "ATM上的IP提供了一个未预料到的二阶效应的极好例子。特别是，Romanov和Floyd关于ATM上TCP良好put[Romanov]的经典研究表明，需要大的UBR缓冲区（大于一个TCP窗口大小）来实现合理的性能，即数据包丢弃机制（如早期数据包丢弃，或EPD）提高带宽的有效利用率，瓶颈处可能需要比FIFO+EPD更精细的服务和丢弃策略，如按VC排队和记帐，以确保高效率和公平性。尽管所有研究都清楚地表明，需要不小于一个TCP窗口大小的缓冲区，但所需的额外缓冲区数量自然取决于所使用的数据包丢弃机制，仍然是一个悬而未决的问题。"
    },
    {
      "indent": 3,
      "text": "Examples of this kind of problem with layering abound in practical networking. Consider, for example, the effect of IP transport's implicit assumptions of lower layers. In particular:",
      "zh-CHS": "这种分层问题的例子在实际网络中比比皆是。例如，考虑IP传输的低层隐含假设的影响。特别地："
    },
    {
      "indent": 4,
      "text": "o Packet loss: TCP assumes that packet losses are indications of congestion, but sometimes losses are from corruption on a wireless link [RFC3115].",
      "zh-CHS": "o 数据包丢失：TCP假定数据包丢失是拥塞的迹象，但有时丢失是由于无线链路上的损坏[RFC3115]。"
    },
    {
      "indent": 4,
      "text": "o Reordered packets: TCP assumes that significantly reordered packets are indications of congestion. This is not always the case [FLOYD2001].",
      "zh-CHS": "o 重新排序的数据包：TCP假定严重重新排序的数据包表示拥塞。情况并非总是如此[FLOYD2001]。"
    },
    {
      "indent": 4,
      "text": "o Round-trip times: TCP measures round-trip times, and assumes that the lack of an acknowledgment within a period of time based on the measured round-trip time is a packet loss, and therefore an indication of congestion [KARN].",
      "zh-CHS": "o 往返时间：TCP测量往返时间，并假设在基于测量的往返时间的一段时间内没有确认是数据包丢失，因此表示拥塞[KARN]。"
    },
    {
      "indent": 4,
      "text": "o Congestion control: TCP congestion control implicitly assumes that all the packets in a flow are treated the same by the network, but this is not always the case [HANDLEY].",
      "zh-CHS": "o 拥塞控制：TCP拥塞控制隐式地假设网络对流中的所有数据包都进行相同的处理，但情况并非总是如此[HANDLEY]。"
    },
    {
      "indent": 0,
      "text": "3.6. Instantiating the EOSL Model with IP",
      "section_title": true,
      "zh-CHS": "3.6. 用IP实例化EOSL模型"
    },
    {
      "indent": 3,
      "text": "While IP is being proposed as a transport for almost everything, the base assumption, that Everything over IP (EOIP) will result in OPEX and CAPEX efficiencies, requires critical examination. In particular, while it is the case that many protocols can be efficiently transported over an IP network (specifically, those protocols that do not need to recover synchronization between the communication end points, such as Frame Relay, Ethernet, and AAL5 ATM), the Simplicity and Layering Principles suggest that EOIP may not represent the most efficient convergence strategy for arbitrary services. Rather, a more CAPEX and OPEX efficient convergence layer might be much lower (again, this behavior is predicted by the Simplicity Principle).",
      "zh-CHS": "虽然IP被提议作为几乎所有东西的传输，但基本假设，即IP上的所有东西（EOIP）将导致运营支出和资本支出效率，需要严格审查。特别是，虽然许多协议可以通过IP网络高效传输（具体地说，那些不需要恢复通信端点之间的同步的协议，例如帧中继、以太网和AAL5 ATM），简单性和分层原则表明，EOIP可能不是任意服务的最有效的聚合策略。相反，资本支出和运营支出效率更高的收敛层可能要低得多（同样，这种行为是由简单性原则预测的）。"
    },
    {
      "indent": 3,
      "text": "An example of where EOIP would not be the most OPEX and CAPEX efficient transport would be in those cases where a service or protocol needed SONET-like restoration times (e.g., 50ms). It is not hard to imagine that it would cost more to build and operate an IP network with this kind of restoration and convergence property (if that were even possible) than it would to build the SONET network in the first place.",
      "zh-CHS": "EOIP不是运营支出和资本支出效率最高的传输的一个例子是，服务或协议需要类似SONET的恢复时间（例如50毫秒）。不难想象，构建和运营具有这种恢复和融合特性的IP网络（如果可能的话）的成本将高于构建SONET网络的成本。"
    },
    {
      "indent": 0,
      "text": "4. Avoid the Universal Interworking Function",
      "section_title": true,
      "zh-CHS": "4. 避免通用互通功能"
    },
    {
      "indent": 3,
      "text": "While there have been many implementations of Universal Interworking unction (UIWF), IWF approaches have been problematic at large scale. his concern is codified in the Principle of Minimum Intervention BRYANT]:",
      "zh-CHS": "虽然有许多通用互通功能（UIWF）的实现，但IWF方法在大规模上存在问题。他的关注被编纂在最低干预原则中："
    },
    {
      "indent": 3,
      "text": "\"To minimise the scope of information, and to improve the efficiency of data flow through the Encapsulation Layer, the payload should, where possible, be transported as received without modification.\"",
      "zh-CHS": "“为了最大限度地减少信息范围，并提高通过封装层的数据流的效率，在可能的情况下，有效载荷应在不经修改的情况下按接收方式传输。”"
    },
    {
      "indent": 0,
      "text": "4.1. Avoid Control Plane Interworking",
      "section_title": true,
      "zh-CHS": "4.1. 避免控制平面互通"
    },
    {
      "indent": 3,
      "text": "This corollary is best understood in the context of the integrated solutions space. In this case, the architecture and design frequently achieves the worst of all possible worlds. This is due to the fact that such integrated solutions perform poorly at both ends of the performance/CAPEX/OPEX spectrum: the protocols with the least switching demand may have to bear the cost of the most expensive, while the protocols with the most stringent requirements often must make concessions to those with different requirements. Add to this the various control plane interworking issues and you have a large opportunity for failure. In summary, interworking functions should be restricted to data plane interworking and encapsulations, and these functions should be carried out at the edge of the network.",
      "zh-CHS": "最好在集成解决方案空间的上下文中理解这一推论。在这种情况下，架构和设计往往会达到所有可能的世界中最差的。这是由于这样一个事实，即这种集成解决方案在性能/资本支出/运营支出范围的两端都表现不佳：交换需求最少的协议可能必须承担最昂贵的协议的成本，而要求最严格的协议通常必须向不同要求的协议做出让步。再加上各种控制平面的交互问题，您就有很大的失败机会。总之，互通功能应限于数据平面互通和封装，这些功能应在网络边缘执行。"
    },
    {
      "indent": 3,
      "text": "As described above, interworking models have been successful in those cases where there is a kind of \"isomorphism\" between the layers being interworked. The trade-off here, frequently described as the \"Integrated vs. Ships In the Night trade-off\" has been examined at various times and at various protocol layers. In general, there are few cases in which such integrated solutions have proven efficient. Multi-protocol BGP [RFC2283] is a subtly different but notable exception. In this case, the control plane is independent of the format of the control data. That is, no control plane data conversion is required, in contrast with control plane interworking models such as the ATM/IP interworking envisioned by some soft-switch manufacturers, and the so-called \"PNNI-MPLS SIN\" interworking [ATMMPLS].",
      "zh-CHS": "如上所述，互通模型在被互通的层之间存在一种“同构”的情况下是成功的。这里的权衡，经常被描述为“夜间综合与船舶权衡”，已经在不同的时间和不同的协议层进行了研究。一般来说，很少有这样的集成解决方案被证明是有效的。多协议BGP[RFC2283]是一个略有不同但值得注意的例外。在这种情况下，控制平面独立于控制数据的格式。也就是说，与一些软交换制造商设想的ATM/IP互通和所谓的“PNNI-MPLS SIN”互通[ATMMPLS]等控制平面互通模型相比，不需要控制平面数据转换。"
    },
    {
      "indent": 0,
      "text": "5. Packet versus Circuit Switching: Fundamental Differences",
      "section_title": true,
      "zh-CHS": "5. 分组与电路交换：根本区别"
    },
    {
      "indent": 3,
      "text": "Conventional wisdom holds that packet switching (PS) is inherently more efficient than circuit switching (CS), primarily because of the efficiencies that can be gained by statistical multiplexing and the fact that routing and forwarding decisions are made independently in a hop-by-hop fashion [[MOLINERO2002]. Further, it is widely assumed that IP is simpler that circuit switching, and hence should be more economical to deploy and manage [MCK2002]. However, if one examines these and related assumptions, a different picture emerges (see for example [ODLYZKO98]). The following sections discuss these assumptions.",
      "zh-CHS": "传统观点认为，分组交换（PS）本质上比电路交换（CS）更有效，主要是因为可以通过统计复用获得效率，并且路由和转发决策是以逐跳方式独立做出的。[MOLINERO2002]。此外，人们普遍认为IP比电路交换更简单，因此部署和管理起来应该更经济[MCK2002]。然而，如果检查这些假设和相关假设，就会出现不同的情况（例如参见[ODLYZKO98]）。以下各节将讨论这些假设。"
    },
    {
      "indent": 0,
      "text": "5.1. Is PS is inherently more efficient than CS?",
      "section_title": true,
      "zh-CHS": "5.1. PS是否天生比CS更有效？"
    },
    {
      "indent": 3,
      "text": "It is well known that packet switches make efficient use of scarce bandwidth [BARAN]. This efficiency is based on the statistical multiplexing inherent in packet switching. However, we continue to be puzzled by what is generally believed to be the low utilization of",
      "zh-CHS": "众所周知，分组交换机有效地利用了稀缺的带宽[BARAN]。这种效率基于分组交换中固有的统计复用。然而，我们仍然对普遍认为的低利用率感到困惑"
    },
    {
      "indent": 3,
      "text": "Internet backbones. The first question we might ask is what is the current average utilization of Internet backbones, and how does that relate to the utilization of long distance voice networks? Odlyzko and Coffman [ODLYZKO,COFFMAN] report that the average utilization of links in the IP networks was in the range between 3% and 20% (corporate intranets run in the 3% range, while commercial Internet backbones run in the 15-20% range). On the other hand, the average utilization of long haul voice lines is about 33%. In addition, for 2002, the average utilization of optical networks (all services) appears to be hovering at about 11%, while the historical average is approximately 15% [ML2002]. The question then becomes why we see such utilization levels, especially in light of the assumption that PS is inherently more efficient than CS. The reasons cited by Odlyzko and Coffman include:",
      "zh-CHS": "互联网骨干。我们可能会问的第一个问题是，目前互联网主干网的平均利用率是多少，这与长途语音网络的利用率有何关系？Odlyzko和Coffman[Odlyzko，Coffman]报告，IP网络中链路的平均利用率在3%到20%之间（公司内部网在3%的范围内运行，而商业互联网主干网在15-20%的范围内运行）。另一方面，长途电话线的平均利用率约为33%。此外，2002年，光网络（所有服务）的平均利用率似乎徘徊在11%左右，而历史平均利用率约为15%[ML2002]。接下来的问题是，我们为什么会看到这样的利用率水平，特别是在假设PS天生比CS更高效的情况下。奥德利兹科和科夫曼引用的理由包括："
    },
    {
      "indent": 6,
      "text": "(i). Internet traffic is extremely asymmetric and bursty, but links are symmetric and of fixed capacity (i.e., don't know the traffic matrix, or required link capacities);",
      "zh-CHS": "（i） 。互联网流量极为不对称和突发，但链路对称且容量固定（即，不知道流量矩阵或所需链路容量）；"
    },
    {
      "indent": 6,
      "text": "(ii). It is difficult to predict traffic growth on a link, so operators tend to add bandwidth aggressively;",
      "zh-CHS": "(ii)。很难预测链路上的流量增长，因此运营商倾向于积极增加带宽；"
    },
    {
      "indent": 6,
      "text": "(iii). Falling prices for coarser bandwidth granularity make it appear more economical to add capacity in large increments.",
      "zh-CHS": "(iii)。较粗带宽粒度的价格下降使得以较大增量增加容量显得更经济。"
    },
    {
      "indent": 3,
      "text": "Other static factors include protocol overhead, other kinds of equipment granularity, restoration capacity, and provisioning lag time all contribute to the need to \"over-provision\" [MC2001].",
      "zh-CHS": "其他静态因素包括协议开销、其他类型的设备粒度、恢复能力和资源调配滞后时间，所有这些因素都会导致“资源调配过度”[MC2001]。"
    },
    {
      "indent": 0,
      "text": "5.2. Is PS simpler than CS?",
      "section_title": true,
      "zh-CHS": "5.2. PS比CS简单吗？"
    },
    {
      "indent": 3,
      "text": "The end-to-end principle can be interpreted as stating that the complexity of the Internet belongs at the edges. However, today's Internet backbone routers are extremely complex. Further, this complexity scales with line rate. Since the relative complexity of circuit and packet switching seems to have resisted direct analysis, we instead examine several artifacts of packet and circuit switching as complexity metrics. Among the metrics we might look at are software complexity, macro operation complexity, hardware complexity, power consumption, and density. Each of these metrics is considered below.",
      "zh-CHS": "端到端原则可以解释为表明互联网的复杂性属于边缘。然而，今天的互联网骨干路由器是极其复杂的。此外，这种复杂性随着线路速率的增加而增加。由于电路和分组交换的相对复杂性似乎阻碍了直接分析，因此我们将分组和电路交换的几个伪影作为复杂性度量进行研究。我们可以查看的指标包括软件复杂性、宏操作复杂性、硬件复杂性、功耗和密度。下面考虑这些指标中的每一个。"
    },
    {
      "indent": 0,
      "text": "5.2.1. Software/Firmware Complexity",
      "section_title": true,
      "zh-CHS": "5.2.1. 软件/固件复杂性"
    },
    {
      "indent": 3,
      "text": "One measure of software/firmware complexity is the number of instructions required to program the device. The typical software image for an Internet router requires between eight and ten million instructions (including firmware), whereas a typical transport switch requires on average about three million instructions [MCK2002].",
      "zh-CHS": "软件/固件复杂性的一个度量是设备编程所需的指令数。互联网路由器的典型软件映像需要800万到1000万条指令（包括固件），而典型的传输交换机平均需要300万条指令[MCK2002]。"
    },
    {
      "indent": 3,
      "text": "This difference in software complexity has tended to make Internet routers unreliable, and has notable other second order effects (e.g., it may take a long time to reboot such a router). As another point of comparison, consider that the AT&T (Lucent) 5ESS class 5 switch, which has a huge number of calling features, requires only about twice the number of lines of code as an Internet core router [EICK].",
      "zh-CHS": "软件复杂性的这种差异往往使Internet路由器不可靠，并具有显著的其他二阶效应（例如，重新启动此类路由器可能需要很长时间）。作为另一个比较点，考虑AT&T（朗讯）5ESS 5交换机，它具有大量的呼叫特性，只需要大约两倍的代码行作为因特网核心路由器[EKE]。"
    },
    {
      "indent": 3,
      "text": "Finally, since routers are as much or more software than hardware devices, another result of the code complexity is that the cost of routers benefits less from Moore's Law than less software-intensive devices. This causes a bandwidth/device trade-off that favors bandwidth more than less software-intensive devices.",
      "zh-CHS": "最后，由于路由器与硬件设备一样或更多地是软件设备，代码复杂性的另一个结果是，路由器的成本从摩尔定律中得到的好处比软件密集度较低的设备少。这会导致带宽/设备的权衡，与软件密集度较低的设备相比，带宽更受青睐。"
    },
    {
      "indent": 0,
      "text": "5.2.2. Macro Operation Complexity",
      "section_title": true,
      "zh-CHS": "5.2.2. 宏操作复杂性"
    },
    {
      "indent": 3,
      "text": "An Internet router's line card must perform many complex operations, including processing the packet header, longest prefix match, generating ICMP error messages, processing IP header options, and buffering the packet so that TCP congestion control will be effective (this typically requires a buffer of size proportional to the line rate times the RTT, so a buffer will hold around 250 ms of packet data). This doesn't include route and packet filtering, or any QoS or VPN filtering.",
      "zh-CHS": "Internet路由器的线路卡必须执行许多复杂的操作，包括处理数据包头、最长前缀匹配、生成ICMP错误消息、处理IP头选项和缓冲数据包，以便TCP拥塞控制有效（这通常需要一个大小与线路速率乘以RTT成比例的缓冲区，因此一个缓冲区将容纳大约250毫秒的数据包）。这不包括路由和数据包过滤，或任何QoS或VPN过滤。"
    },
    {
      "indent": 3,
      "text": "On the other hand, a transport switch need only to map ingress time-slots to egress time-slots and interfaces, and therefore can be considerably less complex.",
      "zh-CHS": "另一方面，传输交换机只需要将入口时隙映射到出口时隙和接口，因此可以大大降低复杂性。"
    },
    {
      "indent": 0,
      "text": "5.2.3. Hardware Complexity",
      "section_title": true,
      "zh-CHS": "5.2.3. 硬件复杂性"
    },
    {
      "indent": 3,
      "text": "One measure of hardware complexity is the number of logic gates on a line card [MOLINERO2002]. Consider the case of a high-speed Internet router line card: An OC192 POS router line card contains at least 30 million gates in ASICs, at least one CPU, 300 Mbytes of packet buffers, 2 Mbytes of forwarding table, and 10 Mbytes of other",
      "zh-CHS": "硬件复杂性的一个度量是线路卡上逻辑门的数量[MOLINERO2002]。考虑高速互联网路由器线卡的情况：OC192 POS路由器线卡至少包含一个ASIC中的3000万个门、至少一个CPU、300兆字节的包缓冲器、2兆字节的转发表和10兆字节的其他。"
    },
    {
      "indent": 3,
      "text": "state memory. On the other hand, a comparable transport switch line card has 7.5 million logic gates, no CPU, no packet buffer, no forwarding table, and an on-chip state memory. Rather, the line-card of an electronic transport switch typically contains a SONET framer, a chip to map ingress time-slots to egress time-slots, and an interface to the switch fabric.",
      "zh-CHS": "状态存储器。另一方面，一个可比的传输交换线路卡有750万个逻辑门，没有CPU，没有数据包缓冲区，没有转发表和片上状态存储器。相反，电子传输交换机的线路卡通常包含SONET成帧器、将入口时隙映射到出口时隙的芯片以及到交换机结构的接口。"
    },
    {
      "indent": 0,
      "text": "5.2.4. Power",
      "section_title": true,
      "zh-CHS": "5.2.4. 权力"
    },
    {
      "indent": 3,
      "text": "Since transport switches have traditionally been built from simpler hardware components, they also consume less power [PMC].",
      "zh-CHS": "由于传输交换机传统上是由更简单的硬件组件构建而成，因此它们的功耗也更低[PMC]。"
    },
    {
      "indent": 0,
      "text": "5.2.5. Density",
      "section_title": true,
      "zh-CHS": "5.2.5. 密集"
    },
    {
      "indent": 3,
      "text": "The highest capacity transport switches have about four times the capacity of an IP router [CISCO,CIENA], and sell for about one-third as much per Gigabit/sec. Optical (OOO) technology pushes this complexity difference further (e.g., tunable lasers, MEMs switches. e.g., [CALIENT]), and DWDM multiplexers provide technology to build extremely high capacity, low power transport switches.",
      "zh-CHS": "容量最高的传输交换机的容量约为IP路由器容量的四倍[CISCO，CIENA]，每千兆位/秒的售价约为三分之一。光学（OOO）技术进一步推动了这种复杂性差异（例如，可调谐激光器、MEMs开关，例如[CALIENT]），DWDM多路复用器提供了构建超高容量、低功耗传输开关的技术。"
    },
    {
      "indent": 3,
      "text": "A related metric is physical footprint. In general, by virtue of their higher density, transport switches have a smaller \"per-gigabit\" physical footprint.",
      "zh-CHS": "一个相关的指标是物理足迹。一般来说，由于密度较高，传输交换机的“每千兆位”物理占用空间较小。"
    },
    {
      "indent": 0,
      "text": "5.2.6. Fixed versus variable costs",
      "section_title": true,
      "zh-CHS": "5.2.6. 固定成本与可变成本"
    },
    {
      "indent": 3,
      "text": "Packet switching would seem to have high variable cost, meaning that it costs more to send the n-th piece of information using packet switching than it might in a circuit switched network. Much of this advantage is due to the relatively static nature of circuit switching, e.g., circuit switching can take advantage of of pre-scheduled arrival of information to eliminate operations to be performed on incoming information. For example, in the circuit switched case, there is no need to buffer incoming information, perform loop detection, resolve next hops, modify fields in the packet header, and the like. Finally, many circuit switched networks combine relatively static configuration with out-of-band control planes (e.g., SS7), which greatly simplifies data-plane switching. The bottom line is that as data rates get large, it becomes more and more complex to switch packets, while circuit switching scales more or less linearly.",
      "zh-CHS": "分组交换似乎具有较高的可变成本，这意味着使用分组交换发送第n条信息的成本高于电路交换网络中的成本。这种优势很大程度上是由于电路切换的相对静态性质，例如，电路切换可以利用预先安排的信息到达来消除对传入信息执行的操作。例如，在电路交换的情况下，不需要缓冲输入信息、执行循环检测、解析下一跳、修改分组报头中的字段等。最后，许多电路交换网络将相对静态的配置与带外控制平面（例如，SS7）相结合，这大大简化了数据平面交换。底线是，随着数据速率的增大，交换数据包变得越来越复杂，而电路交换则或多或少呈线性扩展。"
    },
    {
      "indent": 0,
      "text": "5.2.7. QoS",
      "section_title": true,
      "zh-CHS": "5.2.7. 服务质量"
    },
    {
      "indent": 3,
      "text": "While the components of a complete solution for Internet QoS, including call admission control, efficient packet classification, and scheduling algorithms, have been the subject of extensive research and standardization for more than 10 years, end-to-end signaled QoS for the Internet has not become a reality. Alternatively, QoS has been part of the circuit switched infrastructure almost from its inception. On the other hand, QoS is usually deployed to determine queuing disciplines to be used when there is insufficient bandwidth to support traffic. But unlike voice traffic, packet drop or severe delay may have a much more serious effect on TCP traffic due to its congestion-aware feedback loop (in particular, TCP backoff/slow start).",
      "zh-CHS": "虽然一个完整的Internet QoS解决方案的组成部分，包括呼叫接纳控制、有效的分组分类和调度算法，十多年来一直是广泛研究和标准化的主题，但Internet的端到端信号QoS尚未成为现实。或者，QoS几乎从一开始就是电路交换基础设施的一部分。另一方面，通常部署QoS来确定在带宽不足以支持流量时要使用的排队规则。但与语音通信不同，由于其拥塞感知反馈环路（特别是TCP退避/慢启动），数据包丢失或严重延迟可能对TCP通信产生更严重的影响。"
    },
    {
      "indent": 0,
      "text": "5.2.8. Flexibility",
      "section_title": true,
      "zh-CHS": "5.2.8. 灵活性"
    },
    {
      "indent": 3,
      "text": "A somewhat harder to quantify metric is the inherent flexibility of the Internet. While the Internet's flexibility has led to its rapid growth, this flexibility comes with a relatively high cost at the edge: the need for highly trained support personnel. A standard rule of thumb is that in an enterprise setting, a single support person suffices to provide telephone service for a group, while you need ten computer networking experts to serve the networking requirements of the same group [ODLYZKO98A]. This phenomenon is also described in [PERROW].",
      "zh-CHS": "一个更难量化的指标是互联网固有的灵活性。虽然互联网的灵活性导致了其快速增长，但这种灵活性带来了相对较高的边缘成本：需要训练有素的支持人员。一个标准的经验法则是，在企业环境中，单个支持人员足以为一个组提供电话服务，而您需要十名计算机网络专家来满足同一组的网络需求[ODLYZKO98A]。[PERROW]中也描述了这种现象。"
    },
    {
      "indent": 0,
      "text": "5.3. Relative Complexity",
      "section_title": true,
      "zh-CHS": "5.3. 相对复杂性"
    },
    {
      "indent": 3,
      "text": "The relative computational complexity of circuit switching as compared to packet switching has been difficult to describe in formal terms [PARK]. As such, the sections above seek to describe the complexity in terms of observable artifacts. With this in mind, it is clear that the fundamental driver producing the increased complexities outlined above is the hop-by-hop independence (HBHI) inherent in the IP architecture. This is in contrast to the end to end architectures such as ATM or Frame Relay.",
      "zh-CHS": "与分组交换相比，电路交换的相对计算复杂性很难用形式术语来描述[PARK]。因此，以上各节试图从可观察到的伪影的角度来描述复杂性。考虑到这一点，很明显，导致上述复杂性增加的基本驱动因素是IP体系结构中固有的逐跳独立性（HBHI）。这与端到端架构（如ATM或帧中继）形成对比。"
    },
    {
      "indent": 3,
      "text": "[WILLINGER2002] describes this phenomenon in terms of the robustness requirement of the original Internet design, and how this requirement has the driven complexity of the network. In particular, they describe a \"complexity/robustness\" spiral, in which increases in complexity create further and more serious sensitivities, which then requires additional robustness (hence the spiral).",
      "zh-CHS": "[WILLINGER2002]从原始互联网设计的健壮性要求以及该要求如何驱动网络的复杂性方面描述了这种现象。特别是，它们描述了一个“复杂性/鲁棒性”螺旋，在这个螺旋中，复杂性的增加产生了进一步和更严重的敏感性，这需要额外的鲁棒性（因此螺旋）。"
    },
    {
      "indent": 3,
      "text": "The important lesson of this section is that the Simplicity Principle, while applicable to circuit switching as well as packet switching, is crucial in controlling the complexity (and hence OPEX and CAPEX properties) of packet networks. This idea is reinforced by the observation that while packet switching is a younger, less mature discipline than circuit switching, the trend in packet switches is toward more complex line cards, while the complexity of circuit switches appears to be scaling linearly with line rates and aggregate capacity.",
      "zh-CHS": "本节的重要经验是，简单性原则虽然适用于电路交换和分组交换，但对于控制分组网络的复杂性（以及因此产生的运营成本和资本支出性质）至关重要。观察到，虽然分组交换比电路交换更年轻、更不成熟，但分组交换的趋势是向更复杂的线路卡发展，而电路交换机的复杂性似乎随着线路速率和总容量线性扩展，这一观点得到了加强。"
    },
    {
      "indent": 0,
      "text": "5.3.1. HBHI and the OPEX Challenge",
      "section_title": true,
      "zh-CHS": "5.3.1. HBHI和OPEX挑战"
    },
    {
      "indent": 3,
      "text": "As a result of HBHI, we need to approach IP networks in a fundamentally different way than we do circuit based networks. In particular, the major OPEX challenge faced by the IP network is that debugging of a large-scale IP network still requires a large degree of expertise and understanding, again due to the hop-by-hop independence inherent in a packet architecture (again, note that this hop-by-hop independence is not present in virtual circuit networks such as ATM or Frame Relay). For example, you may have to visit a large set of your routers only to discover that the problem is external to your own network. Further, the debugging tools used to diagnose problems are also complex and somewhat primitive. Finally, IP has to deal with people having problems with their DNS or their mail or news or some new application, whereas this is usually not the case for TDM/ATM/etc. In the case of IP, this can be eased by improving automation (note that much of what we mention is customer facing). In general, there are many variables external to the network that effect OPEX.",
      "zh-CHS": "由于HBHI，我们需要以一种根本不同于基于电路的网络的方式来处理IP网络。特别是，IP网络面临的主要OPEX挑战是，大规模IP网络的调试仍然需要大量的专业知识和理解，这也是由于分组体系结构中固有的逐跳独立性（再次注意，这种逐跳独立性在ATM或帧中继等虚拟电路网络中不存在）。例如，您可能必须访问一大组路由器，才发现问题出在您自己的网络之外。此外，用于诊断问题的调试工具也很复杂，有些原始。最后，IP必须处理DNS、邮件、新闻或某些新应用程序有问题的人，而TDM/ATM/etc通常不是这种情况。在IP情况下，可以通过提高自动化程度来缓解这种情况（注意，我们提到的很多内容都是面向客户的）。一般来说，网络外部有许多变量会影响运营成本。"
    },
    {
      "indent": 3,
      "text": "Finally, it is important to note that the quantitative relationship between CAPEX, OPEX, and a network's inherent complexity is not well understood. In fact, there are no agreed upon and quantitative metrics for describing a network's complexity, so a precise relationship between CAPEX, OPEX, and complexity remains elusive.",
      "zh-CHS": "最后，值得注意的是，资本支出、运营支出和网络固有复杂性之间的定量关系尚未得到很好的理解。事实上，对于描述一个网络的复杂性，目前还没有一个统一的量化指标，因此资本支出、运营支出和复杂性之间的精确关系仍然是难以捉摸的。"
    },
    {
      "indent": 0,
      "text": "6. The Myth of Over-Provisioning",
      "section_title": true,
      "zh-CHS": "6. 过度供应的神话"
    },
    {
      "indent": 3,
      "text": "As noted in [MC2001] and elsewhere, much of the complexity we observe in today's Internet is directed at increasing bandwidth utilization. As a result, the desire of network engineers to keep network utilization below 50% has been termed \"over-provisioning\". However, this use of the term over-provisioning is a misnomer. Rather, in modern Internet backbones the unused capacity is actually protection capacity. In particular, one might view this as \"1:1 protection at the IP layer\". Viewed in this way, we see that an IP network provisioned to run at 50% utilization is no more over-provisioned than the typical SONET network. However, the important advantages",
      "zh-CHS": "正如[MC2001]和其他地方指出的，我们在当今互联网中观察到的许多复杂性都是针对提高带宽利用率的。因此，网络工程师希望将网络利用率保持在50%以下的愿望被称为“过度供应”。然而，过度供应这个术语的使用是用词不当的。相反，在现代互联网主干网中，未使用的容量实际上是保护容量。特别是，可以将其视为“IP层的1:1保护”。从这个角度来看，我们可以看到，配置为以50%的利用率运行的IP网络并不比典型的SONET网络配置过多。然而，重要的优势"
    },
    {
      "indent": 3,
      "text": "that accrue to an IP network provisioned in this way include close to speed of light delay and close to zero packet loss [FRALEIGH]. These benefits can been seen as a \"side-effect\" of 1:1 protection provisioning.",
      "zh-CHS": "以这种方式配置的IP网络产生的延迟包括接近光速的延迟和接近零的数据包丢失[FRALEIGH]。这些好处可视为1:1保护资源调配的“副作用”。"
    },
    {
      "indent": 3,
      "text": "There are also other, system-theoretic reasons for providing 1:1-like protection provisioning. Most notable among these reasons is that packet-switched networks with in-band control loops can become unstable and can experience oscillations and synchronization when congested. Complex and non-linear dynamic interaction of traffic means that congestion in one part of the network will spread to other parts of the network. When routing protocol packets are lost due to congestion or route-processor overload, it causes inconsistent routing state, and this may result in traffic loops, black holes, and lost connectivity. Thus, while statistical multiplexing can in theory yield higher network utilization, in practice, to maintain consistent performance and a reasonably stable network, the dynamics of the Internet backbones favor 1:1 provisioning and its side effects to keep the network stable and delay low.",
      "zh-CHS": "提供1:1保护配置还有其他系统理论原因。这些原因中最值得注意的是，具有带内控制环路的分组交换网络可能变得不稳定，并且在拥塞时可能经历振荡和同步。交通的复杂和非线性动态相互作用意味着网络某个部分的拥塞将扩散到网络的其他部分。当路由协议数据包由于拥塞或路由处理器过载而丢失时，会导致路由状态不一致，这可能导致流量循环、黑洞和连接丢失。因此，虽然统计多路复用在理论上可以产生更高的网络利用率，但在实践中，为了保持一致的性能和合理稳定的网络，互联网主干网的动态特性有利于1:1的供应及其副作用，以保持网络稳定和低延迟。"
    },
    {
      "indent": 0,
      "text": "7. The Myth of Five Nines",
      "section_title": true,
      "zh-CHS": "7. 五九神话"
    },
    {
      "indent": 3,
      "text": "Paul Baran, in his classic paper, \"SOME PERSPECTIVES ON NETWORKS-- PAST, PRESENT AND FUTURE\", stated that \"The tradeoff curves between cost and system reliability suggest that the most reliable systems might be built of relatively unreliable and hence low cost elements, if it is system reliability at the lowest overall system cost that is at issue\" [BARAN77].",
      "zh-CHS": "Paul Baran在其经典论文《网络的某些观点——过去、现在和未来》中指出，“成本和系统可靠性之间的折衷曲线表明，最可靠的系统可能是由相对不可靠的、因此成本较低的元件构成的，前提是以最低的总体系统成本实现系统可靠性。”[BARAN77]。"
    },
    {
      "indent": 3,
      "text": "Today we refer to this phenomenon as \"the myth of five nines\". Specifically, so-called five nines reliability in packet network elements is consider a myth for the following reasons: First, since 80% of unscheduled outages are caused by people or process errors [SCOTT], there is only a 20% window in which to optimize. Thus, in order to increase component reliability, we add complexity (optimization frequently leads to complexity), which is the root cause of 80% of the unplanned outages. This effectively narrows the 20% window (i.e., you increase the likelihood of people and process failure). This phenomenon is also characterized as a \"complexity/robustness\" spiral [WILLINGER2002], in which increases in complexity create further and more serious sensitivities, which then requires additional robustness, and so on (hence the spiral).",
      "zh-CHS": "今天，我们把这种现象称为“五九神话”。具体来说，分组网络单元中所谓的五NNES可靠性被认为是一个神话，原因如下：首先，由于80%的未调度中断是由人或过程错误[史葛]引起的，所以只有20%个窗口来优化。因此，为了提高组件可靠性，我们增加了复杂性（优化经常导致复杂性），这是80%计划外停机的根本原因。这有效地缩小了20%的窗口（即，增加了人员和流程失败的可能性）。这一现象也被描述为“复杂性/鲁棒性”螺旋[WILLINGER2002]，其中复杂性的增加产生了进一步和更严重的敏感性，这需要额外的鲁棒性，依此类推（因此螺旋）。"
    },
    {
      "indent": 3,
      "text": "The conclusion, then is that while a system like the Internet can reach five-nines-like reliability, it is undesirable (and likely impossible) to try to make any individual component, especially the most complex ones, reach that reliability standard.",
      "zh-CHS": "由此得出的结论是，尽管像互联网这样的系统可以达到“五个9”的可靠性，但试图使任何单个组件，尤其是最复杂的组件达到该可靠性标准是不可取的（而且可能是不可能的）。"
    },
    {
      "indent": 0,
      "text": "8. Architectural Component Proportionality Law",
      "section_title": true,
      "zh-CHS": "8. 建筑构件比例律"
    },
    {
      "indent": 3,
      "text": "As noted in the previous section, the computational complexity of packet switched networks such as the Internet has proven difficult to describe in formal terms. However, an intuitive, high level definition of architectural complexity might be that the complexity of an architecture is proportional to its number of components, and that the probability of achieving a stable implementation of an architecture is inversely proportional to its number of components. As described above, components include discrete elements such as hardware elements, space and power requirements, as well as software, firmware, and the protocols they implement.",
      "zh-CHS": "如前一节所述，分组交换网络（如互联网）的计算复杂性已证明难以用正式术语描述。然而，架构复杂性的直观、高层次定义可能是架构的复杂性与其组件数量成正比，而实现架构稳定实现的概率与其组件数量成反比。如上所述，组件包括离散元素，例如硬件元素、空间和电源需求，以及软件、固件和它们实现的协议。"
    },
    {
      "indent": 3,
      "text": "Stated more abstractly:",
      "zh-CHS": "更抽象地说："
    },
    {
      "indent": 7,
      "text": "Let",
      "zh-CHS": "允许"
    },
    {
      "indent": 9,
      "text": "A be a representation of architecture A,",
      "zh-CHS": "A是建筑A的代表，"
    },
    {
      "indent": 9,
      "text": "|A| be number of distinct components in the service delivery path of architecture A,",
      "zh-CHS": "|A |是架构A的服务交付路径中的不同组件的数量，"
    },
    {
      "indent": 9,
      "text": "w be a monotonically increasing function,",
      "zh-CHS": "w是单调递增函数，"
    },
    {
      "indent": 9,
      "text": "P be the probability of a stable implementation of an architecture, and let",
      "zh-CHS": "P是体系结构稳定实现的概率，让"
    },
    {
      "indent": 7,
      "text": "Then",
      "zh-CHS": "然后"
    },
    {
      "indent": 9,
      "text": "Complexity(A) = O(w(|A|))\nP(A)          = O(1/w(|A|))",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "where",
      "zh-CHS": "哪里"
    },
    {
      "indent": 7,
      "text": "O(f) = {g:N->R | there exists c > 0 and n such that g(n)\n< c*f(n)}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "[That is, O(f) comprises the set of functions g for which there exists a constant c and a number n, such that g(n) is smaller or equal to c*f(n) for all n. That is, O(f) is the set of all functions that do not grow faster than f, disregarding constant factors]",
      "zh-CHS": "[也就是说，O（f）包含函数集g，其中存在常数c和数字n，使得g（n）小于或等于所有n的c*f（n）。也就是说，O（f）是增长速度不超过f的所有函数集，忽略常数因子]"
    },
    {
      "indent": 3,
      "text": "Interestingly, the Highly Optimized Tolerance (HOT) model [HOT] attempts to characterize complexity in general terms (HOT is one recent attempt to develop a general framework for the study of complexity, and is a member of a family of abstractions generally termed \"the new science of complexity\" or \"complex adaptive",
      "zh-CHS": "有趣的是，高度优化公差（HOT）模型[HOT]试图用一般术语来描述复杂性（HOT是开发复杂性研究一般框架的最新尝试之一，并且是通常称为“复杂性新科学”或“复杂适应性”的抽象家族的成员"
    },
    {
      "indent": 3,
      "text": "systems\"). Tolerance, in HOT semantics, means that \"robustness in complex systems is a constrained and limited quantity that must be carefully managed and protected.\" One focus of the HOT model is to characterize heavy-tailed distributions such as Complexity(A) in the above example (other examples include forest fires, power outages, and Internet traffic distributions). In particular, Complexity(A) attempts to map the extreme heterogeneity of the parts of the system (Internet), and the effect of their organization into highly structured networks, with hierarchies and multiple scales.",
      "zh-CHS": "在热语义中，公差意味着“复杂系统中的鲁棒性是一个受约束和有限的数量，必须仔细管理和保护。”热模型的一个重点是描述重尾分布，如上述示例中的复杂性（a）（其他例子包括森林火灾、停电和互联网流量分布）。特别是，复杂性（A）试图将系统（互联网）各部分的极端异质性及其组织效果映射到具有层次结构和多重规模的高度结构化网络中。"
    },
    {
      "indent": 0,
      "text": "8.1. Service Delivery Paths",
      "section_title": true,
      "zh-CHS": "8.1. 服务交付路径"
    },
    {
      "indent": 3,
      "text": "The Architectural Component Proportionality Law (ACPL) states that the complexity of an architecture is proportional to its number of components.",
      "zh-CHS": "建筑构件比例定律（ACPL）指出，建筑的复杂性与其构件数量成正比。"
    },
    {
      "indent": 3,
      "text": "COROLLARY: Minimize the number of components in a service delivery path, where the service delivery path can be a protocol path, a software path, or a physical path.",
      "zh-CHS": "推论：最小化服务交付路径中的组件数量，其中服务交付路径可以是协议路径、软件路径或物理路径。"
    },
    {
      "indent": 3,
      "text": "This corollary is an important consequence of the ACPL, as the path between a customer and the desired service is particularly sensitive to the number and complexity of elements in the path. This is due to the fact that the complexity \"smoothing\" that we find at high levels of aggregation [ZHANG] is missing as you move closer to the edge, as well as having complex interactions with backoffice and CRM systems. Examples of architectures that haven't found a market due to this effect include TINA-based CRM systems, CORBA/TINA based service architectures. The basic lesson here was that the only possibilities for deploying these systems were \"Limited scale deployments (such) as in Starvision can avoid coping with major unproven scalability issues\", or \"Otherwise need massive investments (like the carrier-grade ORB built almost from scratch)\" [TINA]. In other words, these systems had complex service delivery paths, and were too complex to be feasibly deployed.",
      "zh-CHS": "这一推论是ACPL的一个重要结果，因为客户和所需服务之间的路径对路径中元素的数量和复杂性特别敏感。这是因为我们在高聚合级别[ZHANG]中发现的复杂性“平滑”在您靠近边缘时丢失，并且与后台和CRM系统的交互也很复杂。由于这种影响而没有找到市场的架构示例包括基于TINA的CRM系统、基于CORBA/TINA的服务架构。这里的基本经验是，部署这些系统的唯一可能性是“有限规模的部署（如在饥饿状态下）可以避免处理未经证实的重大可扩展性问题”，或者“需要大量投资（如几乎从头开始构建的运营商级ORB）”[TINA]。换句话说，这些系统具有复杂的服务交付路径，并且过于复杂，无法进行切实可行的部署。"
    },
    {
      "indent": 0,
      "text": "9. Conclusions",
      "section_title": true,
      "zh-CHS": "9. 结论"
    },
    {
      "indent": 3,
      "text": "This document attempts to codify long-understood Internet architectural principles. In particular, the unifying principle described here is best expressed by the Simplicity Principle, which states complexity must be controlled if one hopes to efficiently scale a complex object. The idea that simplicity itself can lead to some form of optimality has been a common theme throughout history, and has been stated in many other ways and along many dimensions. For example, consider the maxim known as Occam's Razor, which was formulated by the medieval English philosopher and Franciscan monk William of Ockham (ca. 1285-1349), and states \"Pluralitas non est",
      "zh-CHS": "本文件试图编纂长期以来被理解的互联网架构原则。特别是，这里描述的统一原则最好用简单原则来表达，即如果希望有效地缩放复杂对象，就必须控制复杂性。简单本身可以导致某种形式的优化，这一观点在历史上一直是一个共同的主题，并在许多其他方面得到了阐述。例如，考虑被称为奥卡姆剃刀的格言，它是由中世纪英国哲学家和奥克汉姆的弗朗西斯肯和尚威廉制定的。"
    },
    {
      "indent": 3,
      "text": "ponenda sine neccesitate\" or \"plurality should not be posited without necessity.\" (hence Occam's Razor is sometimes called \"the principle of unnecessary plurality\" and \" the principle of simplicity\"). A perhaps more contemporary formulation of Occam's Razor states that the simplest explanation for a phenomenon is the one preferred by nature. Other formulations of the same idea can be found in the KISS (Keep It Simple Stupid) principle and the Principle of Least Astonishment (the assertion that the most usable system is the one that least often leaves users astonished). [WILLINGER2002] provides a more theoretical discussion of \"robustness through simplicity\", and in discussing the PSTN, [KUHN87] states that in most systems, \"a trade-off can be made between simplicity of interactions and looseness of coupling\".",
      "zh-CHS": "ponenda sine neccesitate”或“多元性不应在没有必要的情况下被假定。”（因此，奥卡姆的剃刀有时被称为“不必要的多元性原则”和“简单性原则”）奥卡姆剃须刀的一个可能更为现代的表述是，对一种现象的最简单解释是大自然偏爱的解释。相同观点的其他表述可以在亲吻（保持简单愚蠢）原则和最小惊讶原则中找到（最有用的系统是最不经常让用户感到惊讶的系统的断言）。[WILLINGER2002]提供了关于“通过简单实现健壮性”的更多理论讨论，在讨论PSTN时，[KUHN87]指出，在大多数系统中，“可以在交互的简单性和耦合的松散性之间进行权衡”。"
    },
    {
      "indent": 3,
      "text": "When applied to packet switched network architectures, the Simplicity Principle has implications that some may consider heresy, e.g., that highly converged approaches are likely to be less efficient than \"less converged\" solutions. Otherwise stated, the \"optimal\" convergence layer may be much lower in the protocol stack that is conventionally believed. In addition, the analysis above leads to several conclusions that are contrary to the conventional wisdom surrounding packet networking. Perhaps most significant is the belief that packet switching is simpler than circuit switching. This belief has lead to conclusions such as \"since packet is simpler than circuit, it must cost less to operate\". This study finds to the contrary. In particular, by examining the metrics described above, we find that packet switching is more complex than circuit switching. Interestingly, this conclusion is borne out by the fact that normalized OPEX for data networks is typically significantly greater than for voice networks [ML2002].",
      "zh-CHS": "当应用于分组交换网络体系结构时，简单性原则具有一些可能会考虑异端邪说的影响，例如，高度收敛的方法可能比“不收敛”的解决方案效率低。否则，传统上认为的协议栈中的“最佳”收敛层可能要低得多。此外，上面的分析得出了一些结论，这些结论与围绕分组网络的传统观点相反。也许最重要的是相信分组交换比电路交换简单。这种信念导致了这样的结论：“由于数据包比电路简单，所以操作成本必须更低”。这项研究发现恰恰相反。特别是，通过检查上述指标，我们发现分组交换比电路交换更复杂。有趣的是，数据网络的标准化运营成本通常显著高于语音网络[ML2002]，这一事实证明了这一结论。"
    },
    {
      "indent": 3,
      "text": "Finally, the important conclusion of this work is that for packet networks that are of the scale of today's Internet or larger, we must strive for the simplest possible solutions if we hope to build cost effective infrastructures. This idea is eloquently stated in [DOYLE2002]: \"The evolution of protocols can lead to a robustness/complexity/fragility spiral where complexity added for robustness also adds new fragilities, which in turn leads to new and thus spiraling complexities\". This is exactly the phenomenon that the Simplicity Principle is designed to avoid.",
      "zh-CHS": "最后，这项工作的重要结论是，对于当今互联网规模或更大的分组网络，如果我们希望构建经济高效的基础设施，我们必须努力寻求最简单的解决方案。这一观点在[DOYLE2002]中得到了有力的阐述：“协议的演变可能导致健壮性/复杂性/脆弱性螺旋上升，为健壮性增加的复杂性也会增加新的脆弱性，而这反过来又会导致新的螺旋上升的复杂性”。这正是简单性原则旨在避免的现象。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "zh-CHS": "10. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not directly effect the security of any existing Internet protocol. However, adherence to the Simplicity Principle does have a direct affect on our ability to implement secure systems. In particular, a system's complexity grows, it becomes more difficult to model and analyze, and hence it becomes more difficult",
      "zh-CHS": "本文件不会直接影响任何现有互联网协议的安全性。然而，遵守简单性原则确实会直接影响我们实现安全系统的能力。特别是，系统的复杂性增加，建模和分析变得更加困难，因此变得更加困难"
    },
    {
      "indent": 3,
      "text": "to find and understand the security implications inherent in its architecture, design, and implementation.",
      "zh-CHS": "找到并理解其体系结构、设计和实现中固有的安全含义。"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgments",
      "section_title": true,
      "zh-CHS": "11. 致谢"
    },
    {
      "indent": 3,
      "text": "Many of the ideas for comparing the complexity of circuit switched and packet switched networks were inspired by conversations with Nick McKeown. Scott Bradner, David Banister, Steve Bellovin, Steward Bryant, Christophe Diot, Susan Harris, Ananth Nagarajan, Andrew Odlyzko, Pete and Natalie Whiting, and Lixia Zhang made many helpful comments on early drafts of this document.",
      "zh-CHS": "许多比较电路交换和分组交换网络复杂性的想法都是从与尼克·麦基翁的对话中得到启发的。Scott Bradner、David Banister、Steve Bellovin、Steward Bryant、Christophe Diot、Susan Harris、Ananth Nagarajan、Andrew Odlyzko、Pete和Natalie Whiting以及Lixia Zhang对本文件的早期草稿发表了许多有益的评论。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "zh-CHS": "12. 工具书类"
    },
    {
      "indent": 3,
      "text": "[AHUJA] \"The Impact of Internet Policy and Topology on Delayed Routing Convergence\", Labovitz, et. al. Infocom, 2001.",
      "zh-CHS": "[AHUJA]“互联网政策和拓扑结构对延迟路由收敛的影响”，Labovitz等人，Infocom，2001年。"
    },
    {
      "indent": 3,
      "text": "[ATMMPLS] \"ATM-MPLS Interworking Migration Complexities Issues and Preliminary Assessment\", School of Interdisciplinary Computing and Engineering, University of Missouri-Kansas City, April 2002",
      "zh-CHS": "2002年4月，堪萨斯市密苏里堪萨斯大学跨学科计算与工程学院，“ATMPLS”“ATMPLS互通迁移复杂性问题与初步评估”"
    },
    {
      "indent": 3,
      "text": "[BARAN] \"On Distributed Communications\", Paul Baran, Rand Corporation Memorandum RM-3420-PR, http://www.rand.org/publications/RM/RM3420\", August, 1964.",
      "zh-CHS": "[BARAN]“关于分布式通信”，Paul BARAN，兰德公司备忘录RM-3420-PR，http://www.rand.org/publications/RM/RM3420“，1964年8月。"
    },
    {
      "indent": 3,
      "text": "[BARAN77] \"SOME PERSPECTIVES ON NETWORKS--PAST, PRESENT AND FUTURE\", Paul Baran, Information Processing 77, North-Holland Publishing Company, 1977,",
      "zh-CHS": "[BARAN77]“网络的一些观点——过去、现在和未来”，Paul Baran，信息处理77，北荷兰出版公司，1977年，"
    },
    {
      "indent": 3,
      "text": "[BRYANT] \"Protocol Layering in PWE3\", Bryant et al, Work in Progress.",
      "zh-CHS": "[BRYANT]“PWE3中的协议分层”，BRYANT等人，正在进行中。"
    },
    {
      "indent": 3,
      "text": "[CAIDA]         http://www.caida.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[CALLIENT]      http://www.calient.net/home.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[CARLSON]       \"Complexity and Robustness\", J.M. Carlson and John\n                Doyle, Proc. Natl. Acad. Sci. USA, Vol. 99, Suppl. 1,\n                2538-2545, February 19, 2002.\n                http://www.pnas.org/cgi/doi/10.1073/pnas.012582499",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[CIENA]         \"CIENA Multiwave CoreDiretor\",\n                http://www.ciena.com/downloads/products/\n                coredirector.pdf",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[CISCO]         http://www.cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[CLARK] \"The Design Philosophy of the DARPA Internet Protocols\", D. Clark, Proc. of the ACM SIGCOMM, 1988.",
      "zh-CHS": "[CLARK]“DARPA互联网协议的设计理念”，D.CLARK，Proc。ACM SIGCOMM，1988年。"
    },
    {
      "indent": 3,
      "text": "[COFFMAN] \"Internet Growth: Is there a 'Moores Law' for Data Traffic\", K.G. Coffman and A.M. Odlyzko, pp. 47-93, Handbook of Massive Data Stes, J. Elli, P. M. Pardalos, and M. G. C. Resende, Editors. Kluwer, 2002.",
      "zh-CHS": "[COFFMAN]“互联网增长：数据流量是否存在‘摩尔定律’”，K.G.COFFMAN和a.M.Odlyzko，第47-93页，《海量数据存储手册》，J.Elli，P.M.Pardalos和M.G.C.Resende，编辑。克鲁沃，2002年。"
    },
    {
      "indent": 3,
      "text": "[DOYLE2002] \"Robustness and the Internet: Theoretical Foundations\", John C. Doyle, et. al. Work in Progress.",
      "zh-CHS": "[DOYLE2002]“稳健性与互联网：理论基础”，John C.Doyle等人，正在进行的工作。"
    },
    {
      "indent": 3,
      "text": "[EICK] \"Visualizing Software Changes\", S.G. Eick, et al, National Institute of Statistical Sciences, Technical Report 113, December 2000.",
      "zh-CHS": "[EICK]“可视化软件变化”，S.G.EICK等，国家统计科学研究所，技术报告113，2000年12月。"
    },
    {
      "indent": 3,
      "text": "[MOLINERO2002] \"TCP Switching: Exposing Circuits to IP\", Pablo Molinero-Fernandez and Nick McKeown, IEEE January, 2002.",
      "zh-CHS": "[MOLINERO2002]“TCP交换：将电路暴露于IP”，Pablo Molinero Fernandez和Nick McKeown，IEEE，2002年1月。"
    },
    {
      "indent": 3,
      "text": "[FLOYD] \"The Synchronization of Periodic Routing Messages\", Sally Floyd and Van Jacobson, IEEE ACM Transactions on Networking, 1994.",
      "zh-CHS": "[FLOYD]“定期路由消息的同步”，Sally FLOYD和Van Jacobson，IEEE ACM网络事务，1994年。"
    },
    {
      "indent": 3,
      "text": "[FLOYD2001] \"A Report on Some Recent Developments in TCP Congestion Control, IEEE Communications Magazine, S. Floyd, April 2001.",
      "zh-CHS": "[FLOYD2001]“关于TCP拥塞控制的一些最新发展的报告，IEEE通信杂志，S.Floyd，2001年4月。"
    },
    {
      "indent": 3,
      "text": "[FRALEIGH] \"Provisioning IP Backbone Networks to Support Delay-Based Service Level Agreements\", Chuck Fraleigh, Fouad Tobagi, and Christophe Diot, 2002.",
      "zh-CHS": "[FRALEIGH]“提供IP骨干网络以支持基于延迟的服务级别协议”，Chuck FRALEIGH，Fouad Tobagi和Christophe Diot，2002年。"
    },
    {
      "indent": 3,
      "text": "[GRIFFIN] \"What is the Sound of One Route Flapping\", Timothy G. Griffin, IPAM Workshop on Large-Scale Communication Networks: Topology, Routing, Traffic, and Control, March, 2002.",
      "zh-CHS": "[GRIFFIN]“一条路线拍打的声音是什么”，Timothy G.GRIFFIN，IPAM大型通信网络研讨会：拓扑、路由、流量和控制，2002年3月。"
    },
    {
      "indent": 3,
      "text": "[HANDLEY] \"On Inter-layer Assumptions (A view from the Transport Area), slides from a presentation at the IAB workshop on Wireless Internetworking\", M. Handley, March 2000.",
      "zh-CHS": "[HANDLEY]“关于层间假设（从运输领域的观点），IAB无线互联研讨会上的演示幻灯片”，M.HANDLEY，2000年3月。"
    },
    {
      "indent": 3,
      "text": "[HOT] J.M. Carlson and John Doyle, Phys. Rev. E 60, 1412- 1427, 1999.",
      "zh-CHS": "[热门]J.M.Carlson和John Doyle，物理系。牧师。E 60，1412-1427，1999年。"
    },
    {
      "indent": 3,
      "text": "[ISO10589] \"Intermediate System to Intermediate System Intradomain Routing Exchange Protocol (IS-IS)\".",
      "zh-CHS": "[ISO10589]“中间系统到中间系统域内路由交换协议（IS-IS）”。"
    },
    {
      "indent": 3,
      "text": "[JACOBSON] \"Congestion Avoidance and Control\", Van Jacobson, Proceedings of ACM Sigcomm 1988, pp. 273-288.",
      "zh-CHS": "[JACOBSON]“拥塞避免和控制”，Van JACOBSON，ACM Sigcomm会议录，1988年，第273-288页。"
    },
    {
      "indent": 3,
      "text": "[KARN] \"TCP vs Link Layer Retransmission\" in P. Karn et al., Advice for Internet Subnetwork Designers, Work in Progress.",
      "zh-CHS": "[KARN]“TCP与链路层重传”，见P.KARN等人，《互联网子网设计师建议》，正在进行中。"
    },
    {
      "indent": 3,
      "text": "[KUHN87] \"Sources of Failure in the Public Switched Telephone Network\", D. Richard Kuhn, EEE Computer, Vol. 30, No. 4, April, 1997.",
      "zh-CHS": "[KUHN87]“公共交换电话网络的故障来源”，D.Richard Kuhn，EEE Computer，第30卷，第4期，1997年4月。"
    },
    {
      "indent": 3,
      "text": "[L2TPV3] Lan, J., et. al., \"Layer Two Tunneling Protocol (Version 3) -- L2TPv3\", Work in Progress.",
      "zh-CHS": "[L2TPV3]Lan，J.等，“第二层隧道协议（第3版）--L2TPV3”，正在进行中的工作。"
    },
    {
      "indent": 3,
      "text": "[MC2001] \"U.S Communications Infrastructure at A Crossroads: Opportunities Amid the Gloom\", McKinsey&Company for Goldman-Sachs, August 2001.",
      "zh-CHS": "[MC2001]“十字路口的美国通信基础设施：黑暗中的机遇”，麦肯锡高盛公司，2001年8月。"
    },
    {
      "indent": 3,
      "text": "[MCK2002] Nick McKeown, personal communication, April, 2002.",
      "zh-CHS": "[MCK2002]Nick McKeown，《个人通信》，2002年4月。"
    },
    {
      "indent": 3,
      "text": "[ML2002] \"Optical Systems\", Merril Lynch Technical Report, April, 2002.",
      "zh-CHS": "[ML2002]“光学系统”，美林技术报告，2002年4月。"
    },
    {
      "indent": 3,
      "text": "[NAVE] \"The influence of mode coupling on the non-linear evolution of tearing modes\", M.F.F. Nave, et al, Eur. Phys. J. D 8, 287-297.",
      "zh-CHS": "[NAVE]“模式耦合对撕裂模式非线性演化的影响”，M.F.F.NAVE等人，欧洲。物理。J.D.8287-297。"
    },
    {
      "indent": 3,
      "text": "[NEUMANN]       \"Cause of AT&T network failure\", Peter G. Neumann,\n                http://catless.ncl.ac.uk/Risks/9.62.html#subj2",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[ODLYZKO] \"Data networks are mostly empty for good reason\", A.M. Odlyzko, IT Professional 1 (no. 2), pp. 67-69, Mar/Apr 1999.",
      "zh-CHS": "[ODLYZKO]“数据网络大多是空的，这是有充分理由的”，A.M.ODLYZKO，IT专业人士1（第2期），第67-69页，1999年3月/4月。"
    },
    {
      "indent": 3,
      "text": "[ODLYZKO98A] \"Smart and stupid networks: Why the Internet is like Microsoft\". A. M. Odlyzko, ACM Networker, 2(5), December, 1998.",
      "zh-CHS": "[ODLYZKO98A]“智能和愚蠢的网络：为什么互联网像微软”。A.M.Odlyzko，ACM Networker，2（5），1998年12月。"
    },
    {
      "indent": 3,
      "text": "[ODLYZKO98]     \"The economics of the Internet: Utility, utilization,\n                pricing, and Quality of Service\", A.M. Odlyzko, July,\n                1998.\n                http://www.dtc.umn.edu/~odlyzko/doc/networks.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[PARK] \"The Internet as a Complex System: Scaling, Complexity and Control\", Kihong Park and Walter Willinger, AT&T Research, 2002.",
      "zh-CHS": "[PARK]“互联网作为一个复杂系统：规模、复杂性和控制”，Kihong PARK和Walter Willinger，AT&T研究，2002年。"
    },
    {
      "indent": 3,
      "text": "[PERROW] \"Normal Accidents: Living with High Risk Technologies\", Basic Books, C. Perrow, New York, 1984.",
      "zh-CHS": "[PERROW]“正常事故：生活在高风险技术中”，基本书籍，C.PERROW，纽约，1984年。"
    },
    {
      "indent": 3,
      "text": "[PMC]           \"The Design of a 10 Gigabit Core Router\n                Architecture\", PMC-Sierra, http://www.pmc-\n                sierra.com/products/diagrams/CoreRouter_lg.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[RFC1629] Colella, R., Callon, R., Gardner, E. and Y. Rekhter, \"Guidelines for OSI NSAP Allocation in the Internet\", RFC 1629, May 1994.",
      "zh-CHS": "[RFC1629]Colella，R.，Callon，R.，Gardner，E.和Y.Rekhter，“互联网上OSI NSAP分配指南”，RFC 1629，1994年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1925] Callon, R., \"The Twelve Networking Truths\", RFC 1925, 1 April 1996.",
      "zh-CHS": "[RFC1925]Callon，R.，“十二个网络真理”，RFC 1925，1996年4月1日。"
    },
    {
      "indent": 3,
      "text": "[RFC1958] Carpenter, B., Ed., \"Architectural principles of the Internet\", RFC 1958, June 1996.",
      "zh-CHS": "[RFC1958]Carpenter，B.，Ed.“互联网的架构原则”，RFC19581996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2283] Bates, T., Chandra, R., Katz, D. and Y. Rekhter, \"Multiprotocol Extensions for BGP4\", RFC 2283, February 1998.",
      "zh-CHS": "[RFC2283]Bates，T.，Chandra，R.，Katz，D.和Y.Rekhter，“BGP4的多协议扩展”，RFC 2283，1998年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3155] Dawkins, S., Montenegro, G., Kojo, M. and N. Vaidya, \"End-to-end Performance Implications of Links with Errors\", BCP 50, RFC 3155, May 2001.",
      "zh-CHS": "[RFC3155]Dawkins，S.，黑山，G.，Kojo，M.和N.Vaidya，“带错误链接的端到端性能影响”，BCP 50，RFC 3155，2001年5月。"
    },
    {
      "indent": 3,
      "text": "[ROMANOV] \"Dynamics of TCP over ATM Networks\", A. Romanov, S. Floyd, IEEE JSAC, vol. 13, No 4, pp.633-641, May 1995.",
      "zh-CHS": "[ROMANOV]“ATM网络上TCP的动态”，A.ROMANOV，S.Floyd，IEEE JSAC，第13卷，第4期，第633-641页，1995年5月。"
    },
    {
      "indent": 3,
      "text": "[SALTZER] \"End-To-End Arguments in System Design\", J.H. Saltzer, D.P. Reed, and D.D. Clark, ACM TOCS, Vol 2, Number 4, November 1984, pp 277-288.",
      "zh-CHS": "[SALTZER]“系统设计中的端到端参数”，J.H.SALTZER，D.P.Reed和D.D.Clark，ACM TOCS，第2卷，第4期，1984年11月，第277-288页。"
    },
    {
      "indent": 3,
      "text": "[SCOTT] \"Making Smart Investments to Reduce Unplanned Downtime\", D. Scott, Tactical Guidelines, TG-07-4033, Gartner Group Research Note, March 1999.",
      "zh-CHS": "[SCOTT]“进行明智投资以减少计划外停机”，D.SCOTT，战术指南，TG-07-4033，Gartner Group研究报告，1999年3月。"
    },
    {
      "indent": 3,
      "text": "[SPILLMAN] \"The Law of Diminishing Returns:, W. J. Spillman and E. Lang, 1924.",
      "zh-CHS": "[斯皮尔曼]“收益递减定律：”，W.J.斯皮尔曼和E.朗，1924年。"
    },
    {
      "indent": 3,
      "text": "[STALLINGS] \"Data and Computer Communications (2nd Ed)\", William Stallings, Maxwell Macmillan, 1989.",
      "zh-CHS": "[史泰林斯]“数据和计算机通信（第二版）”，威廉·史泰林斯，麦克斯韦·麦克米伦，1989年。"
    },
    {
      "indent": 3,
      "text": "[TENNENHOUSE] \"Layered multiplexing considered harmful\", D. Tennenhouse, Proceedings of the IFIP Workshop on Protocols for High-Speed Networks, Rudin ed., North Holland Publishers, May 1989.",
      "zh-CHS": "[TENNENHOUSE]“分层复用被认为是有害的”，D.TENNENHOUSE，IFIP高速网络协议研讨会论文集，Rudin ed，北荷兰出版社，1989年5月。"
    },
    {
      "indent": 3,
      "text": "[THOMPSON] \"Nonlinear Dynamics and Chaos\". J.M.T. Thompson and H.B. Stewart, John Wiley and Sons, 1994, ISBN 0471909602.",
      "zh-CHS": "[汤普森]“非线性动力学与混沌”。J.M.T.汤普森和H.B.斯图尔特，约翰·威利和儿子，1994年，ISBN 0471909602。"
    },
    {
      "indent": 3,
      "text": "[TINA] \"What is TINA and is it useful for the TelCos?\", Paolo Coppo, Carlo A. Licciardi, CSELT, EURESCOM Participants in P847 (FT, IT, NT, TI)",
      "zh-CHS": "[TINA]“什么是TINA？它对电信公司有用吗？”，Paolo Coppo、Carlo A.Licciardi、CSELT、EURESCOM参与P847（FT、it、NT、TI）"
    },
    {
      "indent": 3,
      "text": "[WAKEMAN] \"Layering considered harmful\", Ian Wakeman, Jon Crowcroft, Zheng Wang, and Dejan Sirovica, IEEE Network, January 1992, p. 7-16.",
      "zh-CHS": "[WAKEMAN]“分层被认为是有害的”，Ian WAKEMAN、Jon Crowcroft、Zheng Wang和Dejan Sirovica，IEEE网络，1992年1月，第页。7-16."
    },
    {
      "indent": 3,
      "text": "[WARD] \"Custom fluorescent-nucleotide synthesis as an alternative method for nucleic acid labeling\", Octavian Henegariu*, Patricia Bray-Ward and David C. Ward, Nature Biotech 18:345-348 (2000).",
      "zh-CHS": "[WARD]“定制荧光核苷酸合成作为核酸标记的替代方法”，Octavian Henegariu*，Patricia Bray WARD和David C.WARD，自然生物技术18:345-348（2000）。"
    },
    {
      "indent": 3,
      "text": "[WILLINGER2002] \"Robustness and the Internet: Design and evolution\", Walter Willinger and John Doyle, 2002.",
      "zh-CHS": "[WILLINGER2002]“健壮性与互联网：设计与进化”，Walter Willinger和John Doyle，2002年。"
    },
    {
      "indent": 3,
      "text": "[ZHANG] \"Impact of Aggregation on Scaling Behavior of Internet Backbone Traffic\", Sprint ATL Technical Report TR02-ATL-020157 Zhi-Li Zhang, Vinay Ribeiroj, Sue Moon, Christophe Diot, February, 2002.",
      "zh-CHS": "[ZHANG]“聚合对互联网主干流量扩展行为的影响”，Sprint ATL技术报告TR02-ATL-020157 Zhi Li ZHANG，Vinay Ribeiroj，Sue Moon，Christophe Diot，2002年2月。"
    },
    {
      "indent": 0,
      "text": "13. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "13. 作者地址"
    },
    {
      "indent": 3,
      "text": "Randy Bush EMail: randy@psg.com",
      "zh-CHS": "兰迪·布什电子邮件：randy@psg.com"
    },
    {
      "indent": 3,
      "text": "David Meyer EMail: dmm@maoz.com",
      "zh-CHS": "David Meyer电子邮件：dmm@maoz.com"
    },
    {
      "indent": 0,
      "text": "14. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "14. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}