{
  "title": {
    "text": "RFC 3189:  RTP Payload Format for DV (IEC 61834) Video ",
    "zh-CHS": "RFC 3189"
  },
  "number": 3189,
  "created_at": "2021-10-26 05:31:57.571011+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       K. Kobayashi\nRequest for Comments: 3189             Communication Research Laboratory\nCategory: Standards Track                                       A. Ogawa\n                                                         Keio University\n                                                               S. Casner\n                                                           Packet Design\n                                                              C. Bormann\n                                                 Universitaet Bremen TZI\n                                                            January 2002",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "RTP Payload Format for DV (IEC 61834) Video",
      "zh-CHS": "DV（IEC 61834）视频的RTP有效负载格式"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document specifies the packetization scheme for encapsulating the compressed digital video data streams commonly known as \"DV\" into a payload format for the Real-Time Transport Protocol (RTP).",
      "zh-CHS": "本文件规定了将压缩数字视频数据流（通常称为“DV”）封装为实时传输协议（RTP）的有效载荷格式的打包方案。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document specifies payload formats for encapsulating both consumer- and professional-use DV format data streams into the Real-time Transport Protocol (RTP), version 2 [6]. DV compression audio and video formats were designed for helical-scan magnetic tape media. The DV standards for consumer-market devices, the IEC 61883 and 61834 series, cover many aspects of consumer-use digital video, including mechanical specifications of a cassette, magnetic recording format, error correction on the magnetic tape, DCT video encoding format, and audio encoding format [1]. The digital interface part of IEC 61883 defines an interface on an IEEE 1394 network [2,3]. This specification set supports several video formats: SD-VCR (Standard Definition), HD-VCR (High Definition), SDL-VCR (Standard Definition - Long), PALPlus, DVB (Digital Video Broadcast) and ATV (Advanced Television). North American formats are indicated with a number of lines and \"/60\", while European formats use \"/50\". DV standards",
      "zh-CHS": "本文件规定了将消费者和专业人士使用的DV格式数据流封装到实时传输协议（RTP）版本2[6]中的有效载荷格式。DV压缩音频和视频格式是为螺旋扫描磁带媒体设计的。消费市场设备的DV标准IEC 61883和61834系列涵盖了消费数字视频的许多方面，包括盒式磁带的机械规格、磁记录格式、磁带纠错、DCT视频编码格式和音频编码格式[1]。IEC 61883的数字接口部分定义了IEEE 1394网络上的接口[2,3]。本规范集支持多种视频格式：SD-VCR（标准清晰度）、HD-VCR（高清晰度）、SDL-VCR（标准清晰度-长）、Perpllus、DVB（数字视频广播）和ATV（高级电视）。北美格式用许多行和“/60”表示，而欧洲格式用“/50”表示。DV标准"
    },
    {
      "indent": 3,
      "text": "extended for professional use were published by SMPTE as 306M and 314M, for different sampling systems, higher color resolution, and faster bit rates [4,5].",
      "zh-CHS": "SMPTE发布了306M和314M两种扩展专业用途，用于不同的采样系统、更高的颜色分辨率和更快的比特率[4,5]。"
    },
    {
      "indent": 3,
      "text": "There are two kinds of DV, one for consumer use and the other for professional. The original \"DV\" specification designed for consumer-use digital VCRs is approved as the IEC 61834 standard set. The specifications for professional DV are published as SMPTE 306M and 314M. Both encoding formats are based on consumer DV and used in SMPTE D-7 and D-9 video systems. The RTP payload format specified in this document supports IEC 61834 consumer DV and professional SMPTE 306M and 314M (DV-Based) formats.",
      "zh-CHS": "有两种DV，一种供消费者使用，另一种供专业人士使用。最初为消费者使用的数字录像机设计的“DV”规范被批准为IEC 61834标准集。专业DV的规范发布为SMPTE 306M和314M。这两种编码格式均基于消费者DV，并用于SMPTE D-7和D-9视频系统。本文件中规定的RTP有效载荷格式支持IEC 61834消费者DV和专业SMPTE 306M和314M（基于DV）格式。"
    },
    {
      "indent": 3,
      "text": "IEC 61834 also includes magnetic tape recording for digital TV broadcasting systems (such as DVB and ATV) that use MPEG2 encoding. The payload format for encapsulating MPEG2 into RTP has already been defined in RFC 2250 [7] and others.",
      "zh-CHS": "IEC 61834还包括使用MPEG2编码的数字电视广播系统（如DVB和ATV）的磁带记录。RFC 2250[7]和其他文件中已经定义了将MPEG2封装到RTP中的有效负载格式。"
    },
    {
      "indent": 3,
      "text": "Consequently, the payload specified in this document will support six video formats of the IEC standard: SD-VCR (525/60, 625/50), HD-VCR (1125/60, 1250/50) and SDL-VCR (525/60, 625/50), and six of the SMPTE standards: 306M (525/60, 625/50), 314M 25Mbps (525/60, 625/50) and 314M 50Mbps (525/60, 625/50). In the future it can be extended into other high-definition formats.",
      "zh-CHS": "因此，本文件中规定的有效载荷将支持IEC标准的六种视频格式：SD-VCR（525/60625/50）、HD-VCR（1125/601250/50）和SDL-VCR（525/60625/50），以及六种SMPTE标准：306M（525/60625/50）、314M 25Mbps（525/60625/50）和314M 50Mbps（525/60625/50）。将来，它可以扩展到其他高清晰度格式。"
    },
    {
      "indent": 3,
      "text": "Throughout this specification, we make extensive use of the terminology of IEC and SMPTE standards. The reader should consult the original references for definitions of these terms.",
      "zh-CHS": "在本规范中，我们广泛使用了IEC和SMPTE标准的术语。读者应查阅原始参考文献，了解这些术语的定义。"
    },
    {
      "indent": 0,
      "text": "1.1 Terminology",
      "section_title": true,
      "zh-CHS": "1.1 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [8].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[8]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. DV format encoding",
      "section_title": true,
      "zh-CHS": "2. DV格式编码"
    },
    {
      "indent": 3,
      "text": "The DV format only uses the DCT compression technique within each frame, contrasted with the interframe compression of the MPEG video standards [9,10]. All video data, including audio and other system data, are managed within the picture frame unit of video.",
      "zh-CHS": "DV格式仅在每个帧内使用DCT压缩技术，与MPEG视频标准的帧间压缩形成对比[9,10]。所有视频数据，包括音频和其他系统数据，都在视频的图片帧单元内进行管理。"
    },
    {
      "indent": 3,
      "text": "The DV video encoding is composed of a three-level hierarchical structure. A picture frame is divided into rectangle- or clipped-rectangle-shaped DCT super blocks. DCT super blocks are divided into 27 rectangle- or square-shaped DCT macro blocks.",
      "zh-CHS": "DV视频编码由三级层次结构组成。图片帧被划分为矩形或剪裁的矩形DCT超级块。DCT超级块分为27个矩形或方形DCT宏块。"
    },
    {
      "indent": 3,
      "text": "Audio data is encoded with PCM format. The sampling frequency is 32 kHz, 44.1 kHz or 48 kHz and the quantization is 12-bit non-linear, 16-bit linear or 20-bit linear. The number of channels may be up to 8. Only certain combinations of these parameters are allowed depending upon the video format; the restrictions are specified in each document.",
      "zh-CHS": "音频数据采用PCM格式编码。采样频率为32 kHz、44.1 kHz或48 kHz，量化为12位非线性、16位线性或20位线性。通道数最多可为8个。根据视频格式，仅允许这些参数的某些组合；每个文档中都指定了限制条件。"
    },
    {
      "indent": 3,
      "text": "A frame of data in the DV format stream is divided into several \"DIF sequences\". A DIF sequence is composed of an integral number of 80- byte DIF blocks. A DIF block is the primitive unit for all treatment of DV streams. Each DIF block contains a 3-byte ID header that specifies the type of the DIF block and its position in the DIF sequence. Five types of DIF blocks are defined: DIF sequence header, Subcode, Video Auxiliary information (VAUX), Audio, and Video. Audio DIF blocks are composed of 5 bytes of Audio Auxiliary data (AAUX) and 72 bytes of audio data.",
      "zh-CHS": "DV格式流中的数据帧被划分为若干“DIF序列”。DIF序列由整数个80字节的DIF块组成。DIF块是所有DV流处理的基本单元。每个DIF块都包含一个3字节的ID头，用于指定DIF块的类型及其在DIF序列中的位置。定义了五种类型的DIF块：DIF序列头、子码、视频辅助信息（VAUX）、音频和视频。音频DIF块由5字节的音频辅助数据（AAUX）和72字节的音频数据组成。"
    },
    {
      "indent": 3,
      "text": "Each RTP packet starts with the RTP header as defined in RFC 1889 [6]. No additional payload-format-specific header is required for this payload format.",
      "zh-CHS": "每个RTP数据包都以RFC 1889[6]中定义的RTP报头开始。此有效负载格式不需要额外的有效负载格式特定标头。"
    },
    {
      "indent": 0,
      "text": "2.1 RTP header usage",
      "section_title": true,
      "zh-CHS": "2.1 RTP头使用"
    },
    {
      "indent": 3,
      "text": "The RTP header fields that have a meaning specific to the DV format are described as follows:",
      "zh-CHS": "具有DV格式特定含义的RTP头字段描述如下："
    },
    {
      "indent": 3,
      "text": "Payload type (PT): The payload type is dynamically assigned by means outside the scope of this document. If multiple DV encoding formats are to be used within one RTP session, then multiple dynamic payload types MUST be assigned, one for each DV encoding format. The sender MUST change to the corresponding payload type whenever the encoding format is changed.",
      "zh-CHS": "有效负载类型（PT）：有效负载类型通过本文档范围之外的方式动态分配。如果要在一个RTP会话中使用多个DV编码格式，则必须分配多个动态负载类型，每个DV编码格式一个。每当编码格式更改时，发送方必须更改为相应的有效负载类型。"
    },
    {
      "indent": 3,
      "text": "Timestamp: 32-bit 90 kHz timestamp representing the time at which the first data in the frame was sampled. All RTP packets within the same video frame MUST have the same timestamp. The timestamp SHOULD increment by a multiple of the nominal interval for one frame time, as given in the following table:",
      "zh-CHS": "时间戳：32位90 kHz时间戳，表示帧中第一个数据的采样时间。同一视频帧内的所有RTP数据包必须具有相同的时间戳。时间戳应在一帧时间内以标称间隔的倍数递增，如下表所示："
    },
    {
      "indent": 7,
      "text": "Mode Frame rate (Hz) Increase of one frame in 90kHz timestamp",
      "zh-CHS": "模式帧速率（Hz）以90kHz时间戳增加一帧"
    },
    {
      "indent": 6,
      "text": "525-60 29.97 3003 625-50 25 3600 1125-60 30 3000 1250-50 25 3600",
      "zh-CHS": "525-60 29.97 3003 625-50 25 3600 1125-60 30 3000 1250-50 25 3600"
    },
    {
      "indent": 3,
      "text": "When the DV stream is obtained from an IEEE 1394 interface, the progress of video frame times MAY be monitored using the SYT timestamp carried in the CIP header as specified in IEC 61883 [2].",
      "zh-CHS": "当从IEEE 1394接口获得DV流时，可以使用IEC 61883[2]中规定的CIP报头中携带的SYT时间戳来监视视频帧时间的进度。"
    },
    {
      "indent": 3,
      "text": "Marker bit (M): The marker bit of the RTP fixed header is set to one on the last packet of a video frame, and otherwise, must be zero. The M bit allows the receiver to know that it has received the last packet of a frame so it can display the image without waiting for the first packet of the next frame to arrive to detect the frame change. However, detection of a frame change MUST NOT rely on the marker bit since the last packet of the frame might be lost. Detection of a frame change MUST be based on a difference in the RTP timestamp.",
      "zh-CHS": "标记位（M）：RTP固定报头的标记位在视频帧的最后一个数据包上设置为1，否则必须为零。M位允许接收机知道它已经接收到帧的最后一个分组，因此它可以显示图像，而无需等待下一帧的第一个分组到达以检测帧变化。然而，帧变化的检测不能依赖于标记位，因为帧的最后一个分组可能丢失。帧变化的检测必须基于RTP时间戳的差异。"
    },
    {
      "indent": 0,
      "text": "2.2 DV data encapsulation into RTP payload",
      "section_title": true,
      "zh-CHS": "2.2 DV数据封装到RTP有效负载中"
    },
    {
      "indent": 3,
      "text": "Integral DIF blocks are placed into the RTP payload beginning immediately after the RTP header. Any number of DIF blocks may be packed into one RTP packet, except that all DIF blocks in one RTP packet must be from the same video frame. DIF blocks from the next video frame MUST NOT be packed into the same RTP packet even if more payload space remains. This requirement stems from the fact that the transition from one video frame to the next is indicated by a change in the RTP timestamp. It also reduces the processing complexity on the receiver. Since the RTP payload contains an integral number of DIF blocks, the length of the RTP payload will be a multiple of 80 bytes.",
      "zh-CHS": "整体DIF块被放置在RTP有效负载中，从RTP头之后立即开始。可以将任意数量的DIF块打包到一个RTP分组中，但一个RTP分组中的所有DIF块必须来自同一视频帧。来自下一视频帧的DIF块不得打包到同一RTP数据包中，即使还有更多有效负载空间。这一要求源于这样一个事实，即从一个视频帧到下一个视频帧的转换由RTP时间戳的变化表示。它还降低了接收机上的处理复杂度。由于RTP有效负载包含整数个DIF块，因此RTP有效负载的长度将是80字节的倍数。"
    },
    {
      "indent": 3,
      "text": "Audio and video data may be transmitted as one bundled RTP stream or in separate RTP streams (unbundled). The choice MUST be indicated as part of the assignment of the dynamic payload type and MUST remain unchanged for the duration of the RTP session to avoid complicated procedures of sequence number synchronization. The RTP sender MAY omit DIF-sequence header and subcode DIF blocks from a stream since the information is either known out-of-band or may not be required for RTP transport. When sending DIF-sequence header and subcode DIF blocks, both types of blocks MUST be included in the video stream.",
      "zh-CHS": "音频和视频数据可以作为一个捆绑的RTP流或在单独的RTP流（非捆绑）中传输。选择必须作为动态有效负载类型分配的一部分进行指示，并且在RTP会话期间必须保持不变，以避免复杂的序列号同步过程。RTP发送方可以从流中省略DIF序列头和子码DIF块，因为该信息在带外已知或者RTP传输可能不需要。发送DIF序列头和子码DIF块时，视频流中必须包括这两种类型的块。"
    },
    {
      "indent": 3,
      "text": "DV streams include \"source\" and \"source control\" packs that carry information indispensable for proper decoding, such as aspect ratio, picture position, quantization of audio sampling, number of audio channels, audio channel assignment, and language of the audio. However, describing all of these attributes with a signaling protocol would require large descriptions to enumerate all the combinations. Therefore, no Session Description Protocol (SDP) [13] parameters for these attributes are defined in this document. Instead, the RTP sender MUST transmit at least those VAUX DIF blocks and/or audio DIF blocks with AAUX information bytes that include \"source\" and \"source control\" packs containing the indispensable information for decoding.",
      "zh-CHS": "DV流包括“源”和“源控制”包，它们携带正确解码所必需的信息，例如纵横比、图片位置、音频采样量化、音频通道数量、音频通道分配和音频语言。然而，用信令协议描述所有这些属性需要大量的描述来枚举所有的组合。因此，本文档中未定义这些属性的会话描述协议（SDP）[13]参数。相反，RTP发送方必须传输至少那些具有AAUX信息字节的VAUX DIF块和/或音频DIF块，这些AAUX信息字节包括包含解码所必需信息的“源”和“源控制”包。"
    },
    {
      "indent": 3,
      "text": "In the case of one bundled stream, DIF blocks for both audio and video are packed into RTP packets in the same order as they were encoded.",
      "zh-CHS": "在一个捆绑流的情况下，音频和视频的DIF块按照编码顺序打包到RTP包中。"
    },
    {
      "indent": 3,
      "text": "In the case of an unbundled stream, only the header, subcode, video and VAUX DIF blocks are sent within the video stream. Audio is sent in a different stream if desired, using a different RTP payload type. It is also possible to send audio duplicated in a separate stream, in addition to bundling it in with the video stream.",
      "zh-CHS": "在非绑定流的情况下，仅在视频流中发送报头、子代码、视频和VAUX DIF块。如果需要，音频将使用不同的RTP有效负载类型以不同的流发送。除了将音频与视频流捆绑在一起之外，还可以发送在单独流中复制的音频。"
    },
    {
      "indent": 3,
      "text": "When using unbundled mode, it is RECOMMENDED that the audio stream data be extracted from the DIF blocks and repackaged into the corresponding RTP payload format for the audio encoding (DAT12, L16, L20) [11,12] in order to maximize interoperability with non-DV-capable receivers while maintaining the original source quality.",
      "zh-CHS": "当使用非绑定模式时，建议从DIF块提取音频流数据，并将其重新打包为相应的RTP有效载荷格式，用于音频编码（DAT12、L16、L20）[11,12]，以便在保持原始源质量的同时最大限度地提高与不支持DV的接收机的互操作性。"
    },
    {
      "indent": 3,
      "text": "In the case of unbundled transmission where both audio and video are sent in the DV format, the same timestamp SHOULD be used for both audio and video data within the same frame to simplify the lip synchronization effort on the receiver. Lip synchronization may also be achieved using reference timestamps passed in RTCP as described in RFC 1889 [6].",
      "zh-CHS": "在以DV格式发送音频和视频的非绑定传输的情况下，相同帧内的音频和视频数据应使用相同的时间戳，以简化接收器上的lip同步工作。如RFC 1889[6]所述，也可以使用在RTCP中传递的参考时间戳来实现Lip同步。"
    },
    {
      "indent": 3,
      "text": "The sender MAY reduce the video frame rate by discarding the video data and VAUX DIF blocks for some of the video frames. The RTP timestamp must still be incremented to account for the discarded frames. The sender MAY alternatively reduce bandwidth by discarding video data DIF blocks for portions of the image which are unchanged from the previous image. To enable this bandwidth reduction, receivers SHOULD implement an error concealment strategy to accommodate lost or missing DIF blocks, e.g., repeating the corresponding DIF block from the previous image.",
      "zh-CHS": "发送方可以通过丢弃一些视频帧的视频数据和VAUX-DIF块来降低视频帧速率。RTP时间戳仍然必须增加，以考虑丢弃的帧。发送方可替代地通过丢弃与先前图像相同的图像部分的视频数据DIF块来减少带宽。为了实现这种带宽减少，接收机应实施错误隐藏策略，以适应丢失或丢失的DIF块，例如，重复前一图像中的相应DIF块。"
    },
    {
      "indent": 0,
      "text": "3. SDP Signaling for RTP/DV",
      "section_title": true,
      "zh-CHS": "3. 用于RTP/DV的SDP信令"
    },
    {
      "indent": 3,
      "text": "When using SDP (Session Description Protocol) [13] for negotiation of the RTP payload information, the format described in this document SHOULD be used. SDP descriptions will be slightly different for a bundled stream and an unbundled stream.",
      "zh-CHS": "当使用SDP（会话描述协议）[13]协商RTP有效负载信息时，应使用本文档中描述的格式。捆绑流和非捆绑流的SDP描述略有不同。"
    },
    {
      "indent": 3,
      "text": "When a DV stream is sent to port 31394 using RTP payload type identifier 111, the m=?? line will be like:",
      "zh-CHS": "当使用RTP有效负载类型标识符111将DV流发送到端口31394时，m=？？该行将类似于："
    },
    {
      "indent": 6,
      "text": "m=video 31394 RTP/AVP 111",
      "zh-CHS": "m=视频31394 RTP/AVP 111"
    },
    {
      "indent": 3,
      "text": "The a=rtpmap attribute will be like:",
      "zh-CHS": "a=rtpmap属性如下所示："
    },
    {
      "indent": 6,
      "text": "a=rtpmap:111 DV/90000",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "\"DV\" is the encoding name for the DV video payload format defined in this document. The \"90000\" specifies the RTP timestamp clock rate, which for the payload format defined in this document is a 90kHz clock.",
      "zh-CHS": "“DV”是本文档中定义的DV视频有效负载格式的编码名称。“90000”指定RTP时间戳时钟速率，对于本文档中定义的有效负载格式，该速率为90kHz时钟。"
    },
    {
      "indent": 3,
      "text": "In SDP, format-specific parameters are defined as a=fmtp, as below:",
      "zh-CHS": "在SDP中，特定于格式的参数定义为a=fmtp，如下所示："
    },
    {
      "indent": 6,
      "text": "a=fmtp:<format> <format-specific parameters>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "In the DV video payload format, the a=fmtp line will be used to show the encoding type within the DV video and will be used as below:",
      "zh-CHS": "在DV视频有效载荷格式中，a=fmtp行将用于显示DV视频中的编码类型，并将按如下方式使用："
    },
    {
      "indent": 6,
      "text": "a=fmtp:<payload type> encode=<DV-video encoding>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The required parameter <DV-video encoding> specifies which type of DV format is used. The DV format name will be one of the following:",
      "zh-CHS": "所需参数<DV video encoding>指定使用哪种类型的DV格式。DV格式名称将是以下之一："
    },
    {
      "indent": 6,
      "text": "SD-VCR/525-60 SD-VCR/625-50 HD-VCR/1125-60 HD-VCR/1250-50 SDL-VCR/525-60 SDL-VCR/625-50 306M/525-60 306M/625-50 314M-25/525-60 314M-25/625-50 314M-50/525-60 314M-50/625-50",
      "zh-CHS": "SD-VCR/525-60 SD-VCR/625-50 HD-VCR/1125-60 HD-VCR/1250-50 SDL-VCR/525-60 SDL-VCR/625-50 306M/525-60 306M/625-50 314M-25/525-60 314M-25/625-50 314M-50/525-60 314M-50/625-50"
    },
    {
      "indent": 3,
      "text": "In order to show whether the audio data is bundled into the DV stream or not, a format specific parameter is defined as below:",
      "zh-CHS": "为了显示音频数据是否捆绑到DV流中，特定于格式的参数定义如下："
    },
    {
      "indent": 6,
      "text": "a=fmtp:<payload type> audio=<audio bundled>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The optional parameter <audio bundled> will be one of the following:",
      "zh-CHS": "可选参数<audio bundled>将是以下参数之一："
    },
    {
      "indent": 6,
      "text": "bundled none (default)",
      "zh-CHS": "捆绑无（默认）"
    },
    {
      "indent": 3,
      "text": "If the fmtp audio parameter is not present, then audio data MUST NOT be bundled into the DV video stream.",
      "zh-CHS": "如果fmtp audio参数不存在，则不得将音频数据捆绑到DV视频流中。"
    },
    {
      "indent": 0,
      "text": "3.1 SDP description for unbundled streams",
      "section_title": true,
      "zh-CHS": "3.1 非绑定流的SDP描述"
    },
    {
      "indent": 3,
      "text": "When using unbundled mode, the RTP streams for video and audio will be sent separately to different ports or different multicast groups. When this is done, SDP carries several m=?? lines, one for each media type of the session (see RFC 2327 [13]).",
      "zh-CHS": "使用非绑定模式时，视频和音频的RTP流将分别发送到不同的端口或不同的多播组。完成此操作后，SDP携带数个m=？？行，会话的每种媒体类型一行（参见RFC 2327[13]）。"
    },
    {
      "indent": 3,
      "text": "An example SDP description using these attributes is:",
      "zh-CHS": "使用这些属性的SDP说明示例如下："
    },
    {
      "indent": 6,
      "text": "v=0\no=ikob 2890844526 2890842807 IN IP4 126.16.64.4\ns=POI Seminar\ni=A Seminar on how to make Presentations on the Internet\nu=http://www.koganei.wide.ad.jp/~ikob/POI/index.html\ne=ikob@koganei.wide.ad.jp (Katsushi Kobayashi)\nc=IN IP4 224.2.17.12/127\nt=2873397496 2873404696\nm=audio 49170 RTP/AVP 112\na=rtpmap:112 L16/32000/2\nm=video 50000 RTP/AVP 113\na=rtpmap:113 DV/90000\na=fmtp:113 encode=SD-VCR/525-60\na=fmtp:113 audio=none",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This describes a session where audio and video streams are sent separately. The session is sent to a multicast group 224.2.17.12. The audio is sent using L16 format, and the video is sent using SD-VCR 525/60 format which corresponds to NTSC format in consumer DV.",
      "zh-CHS": "这描述了音频和视频流分别发送的会话。会话被发送到多播组224.2.17.12。音频使用L16格式发送，视频使用SD-VCR 525/60格式发送，该格式对应于消费者DV中的NTSC格式。"
    },
    {
      "indent": 0,
      "text": "3.2 SDP description for bundled streams",
      "section_title": true,
      "zh-CHS": "3.2 捆绑流的SDP描述"
    },
    {
      "indent": 3,
      "text": "When sending a bundled stream, all the DIF blocks including system data will be sent through a single RTP stream. An example SDP description for a bundled DV stream is:",
      "zh-CHS": "当发送捆绑流时，包括系统数据在内的所有DIF块将通过单个RTP流发送。捆绑DV流的示例SDP描述为："
    },
    {
      "indent": 6,
      "text": "v=0\no=ikob 2890844526 2890842807 IN IP4 126.16.64.4\ns=POI Seminar\ni=A Seminar on how to make Presentations on the Internet\nu=http://www.koganei.wide.ad.jp/~ikob/POI/index.html\ne=ikob@koganei.wide.ad.jp (Katsushi Kobayashi)\nc=IN IP4 224.2.17.12/127\nt=2873397496 2873404696\nm=video 49170 RTP/AVP 112 113\na=rtpmap:112 DV/90000\na=fmtp: 112 encode=SD-VCR/525-60\na=fmtp: 112 audio=bundled\na=fmtp: 113 encode=306M/525-60\na=fmtp: 113 audio=bundled",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This SDP record describes a session where audio and video streams are sent bundled. The session is sent to a multicast group 224.2.17.12. The video is sent using both 525/60 consumer DV and SMPTE standard 306M formats, when the payload type is 112 and 113, respectively.",
      "zh-CHS": "此SDP记录描述捆绑发送音频和视频流的会话。会话被发送到多播组224.2.17.12。当有效负载类型分别为112和113时，使用525/60消费者DV和SMPTE标准306M格式发送视频。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "RTP packets using the payload format defined in this specification are subject to the security considerations discussed in the RTP specification [6], and any appropriate RTP profile. This implies that confidentiality of the media streams is achieved by encryption. Because the data compression used with this payload format is applied to end-to-end, encryption may be performed after compression so there is no conflict between the two operations.",
      "zh-CHS": "使用本规范中定义的有效负载格式的RTP数据包受RTP规范[6]和任何适当RTP配置文件中讨论的安全注意事项的约束。这意味着媒体流的机密性是通过加密实现的。由于与此有效负载格式一起使用的数据压缩应用于端到端，因此可以在压缩后执行加密，因此两个操作之间没有冲突。"
    },
    {
      "indent": 3,
      "text": "A potential denial-of-service threat exists for data encodings using compression techniques that have non-uniform receiver-end computational load. The attacker can inject pathological datagrams into the stream which are complex to decode and cause the receiver to be overloaded. However, this encoding does not exhibit any significant non-uniformity.",
      "zh-CHS": "使用压缩技术的数据编码存在潜在的拒绝服务威胁，这种压缩技术具有非均匀的接收端计算负载。攻击者可以向流中注入病理数据报，这些数据报解码复杂，并导致接收器过载。然而，这种编码并没有表现出任何显著的非均匀性。"
    },
    {
      "indent": 3,
      "text": "As with any IP-based protocol, in some circumstances a receiver may be overloaded simply by the receipt of too many packets, either desired or undesired. Network-layer authentication may be used to discard packets from undesired sources, but the processing cost of the authentication itself may be too high. In a multicast environment, pruning of specific sources may be implemented in future versions of IGMP [14] and in multicast routing protocols to allow a receiver to select which sources are allowed to reach it.",
      "zh-CHS": "与任何基于IP的协议一样，在某些情况下，接收机可能仅仅因为接收了太多的数据包而过载，不管是想要的还是不想要的。网络层认证可用于丢弃来自不希望的源的数据包，但认证本身的处理成本可能过高。在多播环境中，可以在IGMP[14]的未来版本和多播路由协议中实现特定源的修剪，以允许接收机选择允许哪些源到达它。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document defines a new RTP payload name and associated MIME type, DV. The registration forms for the MIME types for both video and audio are shown in the next sections.",
      "zh-CHS": "本文档定义了一个新的RTP负载名称和相关的MIME类型DV。视频和音频MIME类型的注册表格将在下一节中显示。"
    },
    {
      "indent": 0,
      "text": "5.1 DV video MIME registration form",
      "section_title": true,
      "zh-CHS": "5.1 DV视频MIME注册表格"
    },
    {
      "indent": 3,
      "text": "MIME media type name: video",
      "zh-CHS": "MIME媒体类型名称：视频"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: DV",
      "zh-CHS": "MIME子类型名称：DV"
    },
    {
      "indent": 3,
      "text": "Required parameters: encode: type of DV format. Permissible values for encode are SD-VCR/525-60, SD-VCR/625-50, HD-VCR/1125-60 HD-VCR/1250-50, SDL-VCR/525-60, SDL-VCR/625-50, 306M/525-60, 306M/625-50, 314M-25/525-60, 314M-25/625-50, 314M-50/525-60, and 314M-50/625-50.",
      "zh-CHS": "所需参数：编码：DV格式的类型。编码的允许值为SD-VCR/525-60、SD-VCR/625-50、HD-VCR/1125-60 HD-VCR/1250-50、SDL-VCR/525-60、SDL-VCR/625-50、306M/525-60、306M/625-50、314M-25/525-60、314M-25/625-50、314M-50/525-60和314M-50/625-50。"
    },
    {
      "indent": 3,
      "text": "Optional parameters: audio: whether the DV stream includes audio data or not. Permissible values for audio are bundled and none. Defaults to none.",
      "zh-CHS": "可选参数：音频：DV流是否包含音频数据。音频的允许值是捆绑的，没有。默认为“无”。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: DV video can be transmitted with RTP as specified in RFC 3189. Other transport methods are not specified.",
      "zh-CHS": "编码注意事项：DV视频可以按照RFC 3189中的规定使用RTP传输。未指定其他运输方法。"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 4 of RFC 3189.",
      "zh-CHS": "安全注意事项：见RFC 3189第4节。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: NONE",
      "zh-CHS": "互操作性注意事项：无"
    },
    {
      "indent": 3,
      "text": "Published specification: IEC 61834 Standard SMPTE 306M SMPTE 314M RFC 3189",
      "zh-CHS": "发布规范：IEC 61834标准SMPTE 306M SMPTE 314M RFC 3189"
    },
    {
      "indent": 3,
      "text": "Applications which use this media type: Video communication.",
      "zh-CHS": "使用此媒体类型的应用程序：视频通信。"
    },
    {
      "indent": 3,
      "text": "Additional information: None\n   Magic number(s): None\n   File extension(s): None\n   Macintosh File Type Code(s): None",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: Katsushi Kobayashi e-mail: ikob@koganei.wide.ad.jp",
      "zh-CHS": "联系人和电子邮件地址以获取更多信息：Katsushi Kobayashi电子邮件：ikob@koganei.wide.ad.jp"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Author/Change controller: Katsushi Kobayashi e-mail: ikob@koganei.wide.ad.jp",
      "zh-CHS": "作者/变更控制员：Katsushi Kobayashi电子邮件：ikob@koganei.wide.ad.jp"
    },
    {
      "indent": 0,
      "text": "5.2 DV audio MIME registration form",
      "section_title": true,
      "zh-CHS": "5.2 DV音频MIME注册表格"
    },
    {
      "indent": 3,
      "text": "MIME media type name: audio",
      "zh-CHS": "MIME媒体类型名称：音频"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: DV",
      "zh-CHS": "MIME子类型名称：DV"
    },
    {
      "indent": 3,
      "text": "Required parameters: encode: type of DV format. Permissible values for encode are SD-VCR/525-60, SD-VCR/625-50, HD-VCR/1125-60 HD-VCR/1250-50, SDL-VCR/525-60, SDL-VCR/625-50, 306M/525-60, 306M/625-50, 314M-25/525-60, 314M-25/625-50, 314M-50/525-60, and 314M-50/625-50.",
      "zh-CHS": "所需参数：编码：DV格式的类型。编码的允许值为SD-VCR/525-60、SD-VCR/625-50、HD-VCR/1125-60 HD-VCR/1250-50、SDL-VCR/525-60、SDL-VCR/625-50、306M/525-60、306M/625-50、314M-25/525-60、314M-25/625-50、314M-50/525-60和314M-50/625-50。"
    },
    {
      "indent": 3,
      "text": "Optional parameters: NONE",
      "zh-CHS": "可选参数：无"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: DV audio can be transmitted with RTP as specified in RFC 3189. Other transport methods are not specified.",
      "zh-CHS": "编码注意事项：DV音频可以按照RFC 3189中的规定使用RTP传输。未指定其他运输方法。"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 4 of RFC 3189.",
      "zh-CHS": "安全注意事项：见RFC 3189第4节。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: NONE",
      "zh-CHS": "互操作性注意事项：无"
    },
    {
      "indent": 3,
      "text": "Published specification: IEC 61834 Standard SMPTE 306M SMPTE 314M RFC 3189",
      "zh-CHS": "发布规范：IEC 61834标准SMPTE 306M SMPTE 314M RFC 3189"
    },
    {
      "indent": 3,
      "text": "Applications which use this media type: Audio communication.",
      "zh-CHS": "使用此媒体类型的应用程序：音频通信。"
    },
    {
      "indent": 3,
      "text": "Additional information: None\n   Magic number(s): None\n   File extension(s): None\n   Macintosh File Type Code(s): None",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: Katsushi Kobayashi e-mail: ikob@koganei.wide.ad.jp",
      "zh-CHS": "联系人和电子邮件地址以获取更多信息：Katsushi Kobayashi电子邮件：ikob@koganei.wide.ad.jp"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Author/Change controller: Katsushi Kobayashi e-mail: ikob@koganei.wide.ad.jp",
      "zh-CHS": "作者/变更控制员：Katsushi Kobayashi电子邮件：ikob@koganei.wide.ad.jp"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] IEC 61834, Helical-scan digital video cassette recording system using 6,35 mm magnetic tape for consumer use (525-60, 625-50, 1125-60 and 1250-50 systems).",
      "zh-CHS": "[1] IEC 61834，使用6.35mm磁带的消费者用螺旋扫描数字盒式录像系统（525-60、625-50、1125-60和1250-50系统）。"
    },
    {
      "indent": 3,
      "text": "[2] IEC 61883, Consumer audio/video equipment - Digital interface.",
      "zh-CHS": "[2] IEC 61883，消费者音频/视频设备-数字接口。"
    },
    {
      "indent": 3,
      "text": "[3] IEEE Std 1394-1995, Standard for a High Performance Serial Bus",
      "zh-CHS": "[3] IEEE标准1394-1995，高性能串行总线标准"
    },
    {
      "indent": 3,
      "text": "[4] SMPTE 306M, 6.35-mm type D-7 component format - video compression at 25Mb/s -525/60 and 625/50.",
      "zh-CHS": "[4] SMPTE 306M，6.35毫米D-7型组件格式-25Mb/s的视频压缩-525/60和625/50。"
    },
    {
      "indent": 3,
      "text": "[5] SMPTE 314M, Data structure for DV-based audio and compressed video 25 and 50Mb/s.",
      "zh-CHS": "[5] SMPTE 314M，基于DV的音频和压缩视频数据结构25和50Mb/s。"
    },
    {
      "indent": 3,
      "text": "[6] Schulzrinne, H., Casner, S., Frederick, R. and V. Jacobson, \"RTP: A transport protocol for real-time applications\", RFC 1889, January 1996.",
      "zh-CHS": "[6] Schulzrinne，H.，Casner，S.，Frederick，R.和V.Jacobson，“RTP：实时应用的传输协议”，RFC 1889，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[7] Hoffman, D., Fernando, G., Goyal, V. and M. Civanlar, \"RTP Payload Format for MPEG1/MPEG2 Video\", RFC 2250, January 1998.",
      "zh-CHS": "[7] Hoffman，D.，Fernando，G.，Goyal，V.和M.Civanlar，“MPEG1/MPEG2视频的RTP有效载荷格式”，RFC 2250，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[8] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[8] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[9] ISO/IEC 11172, Coding of moving pictures and associated audio for digital storage media up to about 1,5 Mbits/s.",
      "zh-CHS": "[9] ISO/IEC 11172，高达约1.5 Mbits/s的数字存储媒体的运动图像和相关音频编码。"
    },
    {
      "indent": 3,
      "text": "[10] ISO/IEC 13818, Generic coding of moving pictures and associated audio information.",
      "zh-CHS": "[10] ISO/IEC 13818，运动图像和相关音频信息的通用编码。"
    },
    {
      "indent": 3,
      "text": "[11] Schulzrinne, H., \"RTP Profile for Audio and Video Conferences with Minimal Control\", RFC 1890, January 1996.",
      "zh-CHS": "[11] Schulzrinne，H.，“具有最小控制的音频和视频会议的RTP配置文件”，RFC 1890，1996年1月。"
    },
    {
      "indent": 3,
      "text": "[12] Kobayashi, K., Ogawa, A., Casner S. and C. Bormann, \"RTP Payload Format for 12-bit DAT Audio and 20- and 24-bit Linear Sampled Audio\", RFC 3190, January 2002.",
      "zh-CHS": "[12] Kobayashi，K.，Ogawa，A.，Casner S.和C.Bormann，“12位DAT音频和20位和24位线性采样音频的RTP有效载荷格式”，RFC 3190，2002年1月。"
    },
    {
      "indent": 3,
      "text": "[13] Handley, M. and V. Jacobson, \"SDP: Session Description Protocol\", RFC 2327, April 1998.",
      "zh-CHS": "[13] Handley，M.和V.Jacobson，“SDP：会话描述协议”，RFC 2327，1998年4月。"
    },
    {
      "indent": 3,
      "text": "[14] Deering, S., \"Host Extensions for IP Multicasting\", STD 5, RFC 1112, August 1989.",
      "zh-CHS": "[14] Deering，S.，“IP多播的主机扩展”，STD 5，RFC 1112，1989年8月。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "7. 作者地址"
    },
    {
      "indent": 3,
      "text": "Katsushi Kobayashi Communication Research Laboratory 4-2-1 Nukii-kitamachi, Koganei Tokyo 184-8795 JAPAN",
      "zh-CHS": "小林善胜通信研究实验室4-2-1日本东京小江内北町Nukii 184-8795"
    },
    {
      "indent": 3,
      "text": "EMail: ikob@koganei.wide.ad.jp",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Akimichi Ogawa Keio University 5322 Endo, Fujisawa Kanagawa 252 JAPAN",
      "zh-CHS": "小川秋美庆应大学5322日本藤泽神奈川内都252"
    },
    {
      "indent": 3,
      "text": "EMail: akimichi@sfc.wide.ad.jp",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stephen L. Casner Packet Design 2465 Latham Street Mountain View, CA 94040 United States",
      "zh-CHS": "Stephen L.Casner包装设计2465美国加利福尼亚州莱瑟姆街山景城，邮编94040"
    },
    {
      "indent": 3,
      "text": "EMail: casner@acm.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Carsten Bormann Universitaet Bremen TZI Postfach 330440 D-28334 Bremen, Germany",
      "zh-CHS": "德国不来梅卡斯滕·鲍曼大学邮政学院330440 D-28334"
    },
    {
      "indent": 3,
      "text": "Phone: +49 421 218 7024\nFax:   +49 421 218 7000\nEMail: cabo@tzi.orgEMail: cabo@tzi.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "8. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}