{
  "title": {
    "text": "RFC 3092:  Etymology of \"Foo\" ",
    "zh-CHS": "RFC 3092"
  },
  "number": 3092,
  "created_at": "2021-10-25 21:46:18.103408+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    D. Eastlake 3rd\nRequest for Comments: 3092                                      Motorola\nCategory: Informational                                        C. Manros\n                                                                   Xerox\n                                                              E. Raymond\n                                                  Open Source Initiative\n                                                            1 April 2001",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 27,
      "text": "Etymology of \"Foo\"",
      "zh-CHS": "“Foo”的词源"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Approximately 212 RFCs so far, starting with RFC 269, contain the terms `foo', `bar', or `foobar' as metasyntactic variables without any proper explanation or definition. This document rectifies that deficiency.",
      "zh-CHS": "到目前为止，大约212个RFC（以RFC 269开始）包含术语“foo”、“bar”或“foobar”作为元语法变量，但没有任何适当的解释或定义。这份文件纠正了这一缺陷。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction............................................1\n2. Definition and Etymology................................2\n3. Acronyms................................................5\nAppendix...................................................7\nSecurity Considerations...................................11\nReferences................................................12\nAuthors' Addresses........................................13\nFull Copyright Statement..................................14",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Approximately 212 RFCs, or about 7% of RFCs issued so far, starting with [RFC269], contain the terms `foo', `bar', or `foobar' used as a metasyntactic variable without any proper explanation or definition. This may seem trivial, but a number of newcomers, especially if English is not their native language, have had problems in understanding the origin of those terms. This document rectifies that deficiency.",
      "zh-CHS": "从[RFC269]开始，到目前为止，大约212份RFC，或大约7%的RFC包含术语“foo”、“bar”或“foobar”，用作元语法变量，但没有任何适当的解释或定义。这似乎微不足道，但许多新来者，特别是如果英语不是他们的母语，在理解这些术语的起源方面遇到了问题。这份文件纠正了这一缺陷。"
    },
    {
      "indent": 3,
      "text": "Section 2 below describes the definition and etymology of these words and Section 3 interprets them as acronyms.",
      "zh-CHS": "下文第2节介绍了这些词的定义和词源，第3节将其解释为首字母缩略词。"
    },
    {
      "indent": 3,
      "text": "As an Appendix, we include a table of RFC occurrences of these words as metasyntactic variables.",
      "zh-CHS": "作为附录，我们列出了这些单词作为元语法变量出现的RFC表。"
    },
    {
      "indent": 0,
      "text": "2. Definition and Etymology",
      "section_title": true,
      "zh-CHS": "2. 定义和词源"
    },
    {
      "indent": 3,
      "text": "bar /bar/ n. [JARGON]",
      "zh-CHS": "酒吧，酒吧。[行话]"
    },
    {
      "indent": 3,
      "text": "1. The second metasyntactic variable, after foo and before baz. \"Suppose we have two functions: FOO and BAR. FOO calls BAR....\"",
      "zh-CHS": "1. 第二个元语法变量，在foo之后和baz之前。“假设我们有两个函数：FOO和BAR。FOO调用BAR…”"
    },
    {
      "indent": 3,
      "text": "2. Often appended to foo to produce foobar.",
      "zh-CHS": "2. 通常附加到foo以生成foobar。"
    },
    {
      "indent": 3,
      "text": "foo /foo/",
      "zh-CHS": "foo/foo/"
    },
    {
      "indent": 3,
      "text": "1. interj. Term of disgust.",
      "zh-CHS": "1. interj。厌恶的术语。"
    },
    {
      "indent": 3,
      "text": "2. Used very generally as a sample name for absolutely anything, esp. programs and files (esp. scratch files).",
      "zh-CHS": "2. 通常用作任何东西的示例名称，特别是程序和文件（特别是临时文件）。"
    },
    {
      "indent": 3,
      "text": "3. First on the standard list of metasyntactic variables used in syntax examples (bar, baz, qux, quux, corge, grault, garply, waldo, fred, plugh, xyzzy, thud). [JARGON]",
      "zh-CHS": "3. 首先是语法示例中使用的元语法变量的标准列表（bar、baz、qux、qux、corge、grault、garply、waldo、fred、plugh、xyzy、thud）。[行话]"
    },
    {
      "indent": 6,
      "text": "When used in connection with `bar' it is generally traced to the WW II era Army slang acronym FUBAR (`Fucked Up Beyond All Repair'), later modified to foobar. Early versions of the Jargon File [JARGON] interpreted this change as a post-war bowdlerization, but it now seems more likely that FUBAR was itself a derivative of `foo' perhaps influenced by German `furchtbar' (terrible) - `foobar' may actually have been the original form.",
      "zh-CHS": "当与'bar'连用时，它通常可以追溯到二战时期陆军俚语的首字母缩略词FUBAR（'Fucked Up Beyond All Repair'），后来被修改为foobar。早期版本的行话文件[Jargon]将这一变化解释为战后的Bowdlezation，但现在似乎更可能的是，FUBAR本身是“foo”的派生词，可能受德语“furchbar”（可怕）的影响——“foobar”可能实际上是原始形式。"
    },
    {
      "indent": 6,
      "text": "For, it seems, the word `foo' itself had an immediate prewar history in comic strips and cartoons. In the 1938 Warner Brothers cartoon directed by Robert Clampett, \"The Daffy Doc\", a very early version of Daffy Duck holds up a sign saying \"SILENCE IS FOO!\" `FOO' and `BAR' also occurred in Walt Kelly's \"Pogo\" strips. The earliest documented uses were in the surrealist \"Smokey Stover\" comic strip by Bill Holman about a fireman. This comic strip appeared in various American comics including \"Everybody's\" between about 1930 and 1952. It frequently included the word \"FOO\" on license plates of cars, in nonsense sayings in the background of some frames such as \"He who foos last foos best\" or \"Many smoke but foo men chew\", and had Smokey say \"Where there's foo, there's fire\". Bill Holman, the author of the strip, filled it with odd jokes and personal contrivances, including other",
      "zh-CHS": "因为“foo”这个词本身似乎在战前漫画和卡通片中有着直接的历史。在罗伯特·克莱佩特导演的1938年华纳兄弟动画片《达菲医生》中，达菲鸭的早期版本挂着一块牌子，上面写着“沉默就是福！”‘福’和‘巴’也出现在沃尔特·凯利的《波戈》连续剧中。最早有文献记载的用法是比尔·霍尔曼（Bill Holman）关于消防员的超现实主义“Smokey Stover”漫画。这部漫画大约在1930年至1952年间出现在各种美国漫画中，包括《每个人的》。它经常在汽车牌照上加上“FOO”一词，在一些画面的背景下，比如“谁吃最后一个foos最好”或“很多烟，但是FOO人嚼东西”，并让Smokey说“哪里有FOO，哪里就有火”。这部连环漫画的作者比尔·霍尔曼（Bill Holman）在书中充满了古怪的笑话和个人发明，包括其他一些"
    },
    {
      "indent": 6,
      "text": "nonsense phrases such as \"Notary Sojac\" and \"1506 nix nix\". According to the Warner Brothers Cartoon Companion [WBCC] Holman claimed to have found the word \"foo\" on the bottom of a Chinese figurine. This is plausible; Chinese statuettes often have apotropaic inscriptions, and this may have been the Chinese word `fu' (sometimes transliterated `foo'), which can mean \"happiness\" when spoken with the proper tone (the lion-dog guardians flanking the steps of many Chinese restaurants are properly called \"fu dogs\") [PERS]. English speakers' reception of Holman's `foo' nonsense word was undoubtedly influenced by Yiddish `feh' and English `fooey' and `fool'. [JARGON, FOLDOC]",
      "zh-CHS": "诸如“公证人Sojac”和“1506 nix nix”之类的无意义短语。据华纳兄弟卡通同伴称，霍尔曼声称在一个中国小雕像的底部发现了“foo”这个词。这是有道理的；中国雕像上经常有向远的铭文，这可能是中文单词“福”（有时音译为“福”），如果用适当的语调说话，可能意味着“幸福”（许多中国餐馆台阶两侧的狮子狗守护者被恰当地称为“福狗”）。英语使用者对霍尔曼的“foo”无意义词的接受无疑受到了意第绪语“feh”和英语“fooey”和“fool”的影响。[行话，FOLDOC]"
    },
    {
      "indent": 6,
      "text": "Holman's strip featured a firetruck called the Foomobile that rode on two wheels. The comic strip was tremendously popular in the late 1930s, and legend has it that a manufacturer in Indiana even produced an operable version of Holman's Foomobile. According to the Encyclopedia of American Comics [EAC], `Foo' fever swept the U.S., finding its way into popular songs and generating over 500 `Foo Clubs.' The fad left `foo' references embedded in popular culture (including the couple of appearances in Warner Brothers cartoons of 1938-39) but with their origins rapidly forgotten. [JARGON]",
      "zh-CHS": "霍尔曼的漫画中有一辆叫做Foomobile的消防车，它是两轮驱动的。这部连环漫画在20世纪30年代末非常流行，传说印第安纳州的一家制造商甚至生产了一款可操作版本的霍尔曼的Foomobile。根据《美国漫画百科全书》（Encyclopedia of American Comics）[EAC]，“Foo”热席卷美国，进入流行歌曲，并产生了500多个“Foo俱乐部”。这一时尚在流行文化中留下了“Foo”的参考语（包括1938-1939年在华纳兄弟（Warner Brothers）动画片中的几次出现），但它们的起源很快被遗忘。[行话]"
    },
    {
      "indent": 6,
      "text": "One place they are known to have remained live is in the U.S. military during the WWII years. In 1944-45, the term `foo fighters' [FF] was in use by radar operators for the kind of mysterious or spurious trace that would later be called a UFO (the older term resurfaced in popular American usage in 1995 via the name of one of the better grunge-rock bands [BFF]). Informants connected the term to the Smokey Stover strip [PERS].",
      "zh-CHS": "据了解，他们一直居住的一个地方是二战期间的美国军队。1944年至1945年，雷达操作员使用“foo fighters”一词来表示一种神秘或虚假的痕迹，这种痕迹后来被称为不明飞行物（1995年在美国流行的用法中，旧的术语通过一个更好的垃圾摇滚乐队[BFF]重新出现）。线人将该术语与Smokey Stover strip[PERS]联系起来。"
    },
    {
      "indent": 6,
      "text": "The U.S. and British militaries frequently swapped slang terms during the war. Period sources reported that `FOO' became a semi-legendary subject of WWII British-army graffiti more or less equivalent to the American Kilroy [WORDS]. Where British troops went, the graffito \"FOO was here\" or something similar showed up. Several slang dictionaries aver that FOO probably came from Forward Observation Officer, but this (like the contemporaneous \"FUBAR\") was probably a backronym [JARGON]. Forty years later, Paul Dickson's excellent book \"Words\" [WORDS] traced \"Foo\" to an unspecified British naval magazine in 1946, quoting as follows:",
      "zh-CHS": "美国和英国军队在战争期间经常交换俚语。据时代消息人士报道，“福”成为二战期间英国军队涂鸦的半传奇主题，或多或少相当于美国的基尔罗伊（Kilroy）[WORDS]。在英国军队去的地方，出现了“福在这里”或类似的涂鸦。一些俚语词典断言，FOO可能来自Forward-Observation-Officer，但这（就像同时代的“FUBAR”）可能是一个backronym[行话]。四十年后，保罗·迪克森（Paul Dickson）的优秀著作《词语》（Words）追溯到1946年一家未指明的英国海军杂志上的“Foo”，引用如下："
    },
    {
      "indent": 9,
      "text": "\"Mr. Foo is a mysterious Second World War product, gifted with bitter omniscience and sarcasm.\"",
      "zh-CHS": "“傅先生是一个神秘的二战产品，他天生就有苦涩的无所不知和讽刺。”"
    },
    {
      "indent": 6,
      "text": "Earlier versions of the Jargon File suggested the possibility that hacker usage actually sprang from \"FOO, Lampoons and Parody\", the title of a comic book first issued in September 1958, a joint",
      "zh-CHS": "该行话文件的早期版本表明，黑客的使用可能实际上源于1958年9月首次发行的一本漫画书的标题“FOO、讽刺和模仿”，这是一本联合出版的漫画书"
    },
    {
      "indent": 6,
      "text": "project of Charles and Robert Crumb. Though Robert Crumb (then in his mid-teens) later became one of the most important and influential artists in underground comics, this venture was hardly a success; indeed, the brothers later burned most of the existing copies in disgust. The title FOO was featured in large letters on the front cover. However, very few copies of this comic actually circulated, and students of Crumb's `oeuvre' have established that this title was a reference to the earlier Smokey Stover comics. The Crumbs may also have been influenced by a short-lived Canadian parody magazine named `Foo' published in 1951-52. [JARGON]",
      "zh-CHS": "查尔斯和罗伯特·克拉姆的计划。尽管罗伯特·克拉姆（当时才十几岁）后来成为地下漫画界最重要、最有影响力的艺术家之一，但这项事业几乎没有成功；事实上，兄弟俩后来厌恶地烧毁了大部分现存的复制品。封面上用大字写着标题“福”。然而，这本漫画实际上很少流传，克拉姆的“作品集”的学生们已经证实，这本书名是指早期的Smokey Stover漫画。这些面包屑也可能受到1951-52年出版的一本名为《福》的加拿大短命模仿杂志的影响。[行话]"
    },
    {
      "indent": 6,
      "text": "An old-time member reports that in the 1959 \"Dictionary of the TMRC Language\", compiled at TMRC (the Tech Model Railroad Club at MIT) there was an entry for Foo. The current on-line version, in which \"Foo\" is the only word coded to appear red, has the following [TMRC]:",
      "zh-CHS": "一位老会员报告说，在1959年由TMRC（麻省理工学院技术模型铁路俱乐部）编写的《TMRC语言词典》中，有一个词条是Foo。当前的在线版本，其中“Foo”是唯一编码为红色的单词，具有以下[TMRC]："
    },
    {
      "indent": 9,
      "text": "Foo: The sacred syllable (FOO MANI PADME HUM); to be spoken only when under obligation to commune with the Deity. Our first obligation is to keep the Foo Counters turning.",
      "zh-CHS": "Foo：神圣的音节（foomanipadmehum）；只有在有义务与神沟通时才说话。我们的第一项义务是保持Foo计数器转动。"
    },
    {
      "indent": 6,
      "text": "This definition used Bill Holman's nonsense word, then only two decades old and demonstrably still live in popular culture and slang, to make a \"ha ha only serious\" analogy with esoteric Tibetan Buddhism. Today's hackers would find it difficult to resist elaborating a joke like that, and it is not likely 1959's were any less susceptible. [JARGON]",
      "zh-CHS": "这一定义使用了比尔·霍尔曼（Bill Holman）的胡言乱语（当时只有二十年历史，显然仍生活在流行文化和俚语中）来与藏传佛教进行“哈哈，只有严肃”的类比。今天的黑客们会发现很难抗拒这样的笑话，而且1959年的黑客们也不太可能不那么容易受到攻击。[行话]"
    },
    {
      "indent": 3,
      "text": "4. [EF] Prince Foo was the last ruler of Pheebor and owner of the Phee Helm, about 400 years before the reign of Entharion. When Foo was beheaded by someone he called an \"eastern fop\" from Borphee, the glorious age of Pheebor ended, and Borphee rose to the prominence it now enjoys.",
      "zh-CHS": "4. [EF]富王子是菲波的最后一位统治者，也是菲波头盔的所有者，大约在安萨里奥统治前400年。当傅被一个他称之为来自波菲的“东方fop”的人斩首时，波菲的辉煌时代结束了，波菲上升到了它现在享有的显赫地位。"
    },
    {
      "indent": 3,
      "text": "5. [OED] A 13th-16th century usage for the devil or any other enemy. The earliest citation it gives is from the year 1366, Chaucer A B C (84): \"Lat not our alder foo [devil] make his bobance [boast]\". Chaucer's \"Foo\" is probably related to modern English \"foe\".",
      "zh-CHS": "5. 13-16世纪对魔鬼或其他敌人的用法。它给出的最早引证是1366年，乔叟A B C（84）：“我们的奥尔德福[魔鬼]不会夸耀自己”。乔叟的“Foo”可能与现代英语的“foe”有关。"
    },
    {
      "indent": 3,
      "text": "6. Rare species of dog.",
      "zh-CHS": "6. 稀有品种的狗。"
    },
    {
      "indent": 6,
      "text": "A spitz-type dog discovered to exist after having long been considered extinct, the Chinese Foo Dog, or Sacred Dog of Sinkiang, may have originated through a crossing of Northern European hunting dogs and the ancient Chow Chow from Mongolia or be the missing link between the Chinese Wolf and the Chow Chow. It probably derives its name from foochow, of the kind or style",
      "zh-CHS": "斯皮茨犬是一种在长期被认为已经灭绝后被发现的犬类，中国的猎狗，或者说是新疆的神犬，可能是北欧猎狗和来自蒙古的古代狼杂交而来，或者是中国狼和狼之间缺失的一环。它的名字很可能是从福州来的"
    },
    {
      "indent": 6,
      "text": "prevalent in Foochow, of or from the city of Foochow (now Minhow) in southeast China. [DOG]",
      "zh-CHS": "流行于福州，属于或来自中国东南部的福州市（现在的闵行）。[狗]"
    },
    {
      "indent": 3,
      "text": "foobar n.",
      "zh-CHS": "福巴。"
    },
    {
      "indent": 6,
      "text": "[JARGON] A widely used metasyntactic variable; see foo for etymology. Probably originally propagated through DECsystem manuals by Digital Equipment Corporation (DEC) in 1960s and early 1970s; confirmed sightings there go back to 1972. Hackers do not generally use this to mean FUBAR in either the slang or jargon sense. It has been plausibly suggested that \"foobar\" spread among early computer engineers partly because of FUBAR and partly because \"foo bar\" parses in electronics techspeak as an inverted foo signal.",
      "zh-CHS": "[行话]广泛使用的元语法变量；词源见foo。可能最初由数字设备公司（DEC）在20世纪60年代和70年代初通过DEC系统手册传播；确认的目击事件可以追溯到1972年。黑客通常不会用这个词来表示黑话或行话意义上的FUBAR。有人似乎认为，“foobar”在早期计算机工程师中的传播部分是因为FUBAR，部分是因为“foobar”在电子技术演讲中解析为一个反向foo信号。"
    },
    {
      "indent": 3,
      "text": "foo-fighter n.",
      "zh-CHS": "福斗士。"
    },
    {
      "indent": 6,
      "text": "World War II term for Unidentified Flying Objects (UFOs) noted by both German and British military. See [FF] and entry above for \"foo\".",
      "zh-CHS": "第二次世界大战中，德国和英国军方都注意到的不明飞行物（UFO）的术语。参见[FF]和上面的“foo”条目。"
    },
    {
      "indent": 0,
      "text": "3. Acronyms",
      "section_title": true,
      "zh-CHS": "3. 缩略词"
    },
    {
      "indent": 3,
      "text": "The following information is derived primarily from the compilations at University Cork College <http://www.ucc.ie/acronyms> and Acronym Finder <http://www.AcronymFinder.com> generally filtered for computer usage.",
      "zh-CHS": "以下信息主要来源于科克大学学院的汇编<http://www.ucc.ie/acronyms>和首字母缩略词查找器<http://www.AcronymFinder.com>通常为计算机使用而过滤。"
    },
    {
      "indent": 3,
      "text": ".bar:",
      "zh-CHS": ".酒吧："
    },
    {
      "indent": 6,
      "text": "Generic file extension which is not meant to imply anything about the file type.",
      "zh-CHS": "泛型文件扩展名，并不意味着与文件类型有关的任何内容。"
    },
    {
      "indent": 3,
      "text": "BAR:",
      "zh-CHS": "酒吧："
    },
    {
      "indent": 6,
      "text": "Base Address Register",
      "zh-CHS": "基址寄存器"
    },
    {
      "indent": 6,
      "text": "Buffer Address Register",
      "zh-CHS": "缓冲地址寄存器"
    },
    {
      "indent": 3,
      "text": "FOO:",
      "zh-CHS": "傅："
    },
    {
      "indent": 6,
      "text": "Forward Observation Observer.",
      "zh-CHS": "前方观察观察员。"
    },
    {
      "indent": 6,
      "text": "FOO Of Oberlin. An organization whose name is a recursive acronym. Motto: The FOO, the Proud, the FOO. See <http://cs.oberlin.edu/students/jmankoff/FOO/home.html>.",
      "zh-CHS": "奥伯林的福。名称为递归首字母缩略词的组织。座右铭：富，骄傲，富。看<http://cs.oberlin.edu/students/jmankoff/FOO/home.html>."
    },
    {
      "indent": 6,
      "text": "File Open for Output. An NFILE error code [RFC1037].",
      "zh-CHS": "打开文件进行输出。文件错误代码[RFC1037]。"
    },
    {
      "indent": 3,
      "text": "FOOBAR:",
      "zh-CHS": "福巴："
    },
    {
      "indent": 6,
      "text": "FTP Operation Over Big Address Records [RFC1639]. (Particularly appropriate given that the first RFC to use \"foo\", [RFC269], was also about file transfer.)",
      "zh-CHS": "大地址记录上的FTP操作[RFC1639]。（考虑到第一个使用“foo”[RFC269]的RFC也是关于文件传输的，这一点特别合适。）"
    },
    {
      "indent": 3,
      "text": "FUBAR:",
      "zh-CHS": "福巴："
    },
    {
      "indent": 6,
      "text": "Failed UniBus Address Register - in a VAX, from Digital Equipment Corporation Engineering.",
      "zh-CHS": "失败的单总线地址寄存器-在VAX中，来自数字设备公司工程部。"
    },
    {
      "indent": 6,
      "text": "Fucked Up Beyond All Recognition/Repair - From US Military in World War II. Sometimes sanitized to \"Fouled Up ...\".",
      "zh-CHS": "在第二次世界大战中，从美国军方那里搞得面目全非。有时经过消毒“弄脏了…”。"
    },
    {
      "indent": 3,
      "text": "FUBARD - Past tense of FUBAR.",
      "zh-CHS": "FUBARD-FUBAR的过去式。"
    },
    {
      "indent": 0,
      "text": "Appendix",
      "zh-CHS": "附录"
    },
    {
      "indent": 3,
      "text": "Below is a table of RFC occurrences of these words as metasyntactic variables. (This excludes other uses that are reasonably clear like \"vertical bar\" or \"bar BoF\".) Many of these uses are for example domain names. That usage may decrease with the specification in [RFC 2606] of a Best Current Practice for example domain names.",
      "zh-CHS": "下面是这些单词作为元语法变量的RFC出现情况表。（这不包括其他合理清晰的用途，如“竖线”或“条形图”。）其中许多用途是例如域名。随着[RFC 2606]中对当前最佳实践（例如域名）的规定，这种使用可能会减少。"
    },
    {
      "indent": 3,
      "text": "+------+-----+-----+---------+-------+-----+\n| RFC# | bar | foo | foo.bar | fubar |  #  |\n|      |     |     | foobar  |       |     |\n+------+-----+-----+---------+-------+-----+\n|  269 |  X  |  X  |         |       |   1 |\n|  441 |  X  |  X  |         |       |   2 |\n|  614 |     |  X  |         |       |   3 |\n|  686 |     |  X  |         |       |   4 |\n|  691 |     |  X  |         |       |   5 |\n|  733 |  X  |  X  |         |       |   6 |\n|  742 |     |  X  |         |       |   7 |\n|  743 |  X  |  X  |         |       |   8 |\n|  756 |     |  X  |         |       |   9 |\n|  765 |  X  |  X  |         |       |  10 |\n|  772 |  X  |  X  |         |   X   |  11 |\n|  775 |     |     |    X    |       |  12 |\n|  780 |  X  |  X  |         |   X   |  13 |\n|  788 |  X  |  X  |         |       |  14 |\n|  810 |  X  |  X  |    X    |       |  15 |\n|  819 |     |  X  |         |       |  16 |\n|  821 |  X  |  X  |         |       |  17 |\n|  822 |  X  |  X  |         |       |  18 |\n|  882 |  X  |  X  |         |       |  19 |\n|  883 |     |  X  |         |       |  20 |\n|  897 |  X  |  X  |         |       |  21 |\n|  913 |     |  X  |         |       |  22 |\n|  921 |  X  |  X  |         |       |  23 |\n|  934 |     |  X  |         |       |  24 |\n|  952 |  X  |  X  |    X    |       |  25 |\n|  959 |     |     |    X    |       |  26 |\n|  976 |     |     |    X    |       |  27 |\n|  977 |     |  X  |    X    |       |  28 |\n|  987 |     |     |    X    |       |  29 |\n| 1013 |     |  X  |         |       |  30 |\n| 1033 |  X  |  X  |         |       |  31 |\n| 1035 |     |  X  |         |       |  32 |\n| 1037 |     |  X  |         |       |  33 |\n| 1056 |  X  |  X  |    X    |       |  34 |\n| 1068 |     |  X  |         |       |  35 |\n| 1137 |     |     |    X    |       |  36 |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "| 1138 |     |  X  |    X    |       |  37 |\n| 1148 |     |  X  |    X    |       |  38 |\n| 1173 |     |     |    X    |       |  39 |\n| 1176 |     |     |    X    |       |  40 |\n| 1186 |     |  X  |         |       |  41 |\n| 1194 |     |  X  |         |       |  42 |\n| 1196 |     |  X  |         |       |  43 |\n| 1203 |     |  X  |    X    |       |  44 |\n| 1288 |     |  X  |         |       |  45 |\n| 1291 |     |  X  |         |       |  46 |\n| 1309 |     |  X  |         |       |  47 |\n| 1327 |     |  X  |    X    |       |  48 |\n| 1341 |  X  |  X  |    X    |       |  49 |\n| 1343 |     |  X  |    X    |       |  50 |\n| 1344 |     |  X  |         |       |  51 |\n| 1348 |     |     |    X    |       |  52 |\n| 1386 |     |  X  |         |       |  53 |\n| 1408 |     |  X  |         |       |  54 |\n| 1411 |     |  X  |         |       |  55 |\n| 1412 |     |  X  |         |       |  56 |\n| 1459 |  X  |  X  |    X    |   X   |  57 |\n| 1480 |     |  X  |         |       |  58 |\n| 1505 |     |  X  |         |       |  59 |\n| 1519 |     |  X  |         |       |  60 |\n| 1521 |  X  |  X  |         |       |  61 |\n| 1523 |     |  X  |         |       |  62 |\n| 1524 |     |  X  |    X    |       |  63 |\n| 1526 |  X  |  X  |         |       |  64 |\n| 1535 |  X  |  X  |    X    |       |  65 |\n| 1536 |  X  |     |    X    |       |  66 |\n| 1537 |     |  X  |    X    |       |  67 |\n| 1563 |     |  X  |         |       |  68 |\n| 1564 |     |     |    X    |       |  69 |\n| 1572 |     |  X  |         |       |  70 |\n| 1573 |     |  X  |         |       |  71 |\n| 1622 |     |  X  |         |       |  72 |\n| 1635 |     |     |    X    |       |  73 |\n| 1636 |     |  X  |    X    |       |  74 |\n| 1642 |     |  X  |         |       |  75 |\n| 1645 |     |     |    X    |       |  76 |\n| 1649 |     |  X  |         |       |  77 |\n| 1664 |     |     |    X    |       |  78 |\n| 1681 |     |     |    X    |       |  79 |\n| 1697 |     |  X  |         |       |  80 |\n| 1716 |     |  X  |         |       |  81 |\n| 1718 |     |  X  |         |       |  82 |\n| 1730 |  X  |  X  |    X    |       |  83 |\n| 1734 |     |     |    X    |       |  84 |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "| 1738 |     |  X  |         |       |  85 |\n| 1783 |     |     |    X    |       |  86 |\n| 1784 |     |     |    X    |       |  87 |\n| 1786 |  X  |  X  |         |       |  88 |\n| 1813 |  X  |  X  |         |       |  89 |\n| 1835 |     |  X  |    X    |       |  90 |\n| 1856 |     |     |    X    |       |  91 |\n| 1861 |     |     |    X    |       |  92 |\n| 1866 |     |  X  |         |       |  93 |\n| 1894 |     |     |    X    |       |  94 |\n| 1896 |     |  X  |         |       |  95 |\n| 1898 |     |  X  |         |       |  96 |\n| 1913 |     |  X  |    X    |       |  97 |\n| 1945 |  X  |  X  |         |       |  98 |\n| 1985 |     |  X  |    X    |       |  99 |\n| 2015 |  X  |  X  |         |       | 100 |\n| 2017 |     |  X  |         |       | 101 |\n| 2033 |  X  |  X  |         |       | 102 |\n| 2045 |     |     |    X    |       | 103 |\n| 2046 |  X  |  X  |         |       | 104 |\n| 2049 |  X  |  X  |         |       | 105 |\n| 2055 |     |  X  |         |       | 106 |\n| 2060 |  X  |  X  |    X    |       | 107 |\n| 2065 |     |  X  |         |       | 108 |\n| 2068 |     |     |    X    |       | 109 |\n| 2071 |     |  X  |         |       | 110 |\n| 2088 |     |     |    X    |       | 111 |\n| 2109 |     |  X  |         |       | 112 |\n| 2110 |     |  X  |    X    |       | 113 |\n| 2111 |  X  |  X  |    X    |       | 114 |\n| 2141 |     |  X  |         |       | 115 |\n| 2150 |     |  X  |         |       | 116 |\n| 2152 |     |  X  |         |       | 117 |\n| 2156 |     |  X  |    X    |       | 118 |\n| 2163 |     |     |    X    |       | 119 |\n| 2167 |     |     |    X    |       | 120 |\n| 2168 |     |     |    X    |       | 121 |\n| 2169 |     |     |    X    |       | 122 |\n| 2180 |  X  |  X  |         |       | 123 |\n| 2193 |  X  |  X  |         |       | 124 |\n| 2224 |     |  X  |         |       | 125 |\n| 2227 |  X  |  X  |         |       | 126 |\n| 2233 |     |  X  |         |       | 127 |\n| 2234 |  X  |  X  |    X    |       | 128 |\n| 2243 |     |  X  |         |       | 129 |\n| 2255 |     |  X  |    X    |       | 130 |\n| 2280 |  X  |  X  |         |       | 131 |\n| 2295 |     |  X  |         |       | 132 |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "| 2302 |     |  X  |         |       | 133 |\n| 2311 |  X  |     |         |       | 134 |\n| 2326 |  X  |  X  |    X    |       | 135 |\n| 2342 |     |  X  |         |       | 136 |\n| 2348 |     |     |    X    |       | 137 |\n| 2349 |     |     |    X    |       | 138 |\n| 2359 |     |     |    X    |       | 139 |\n| 2369 |  X  |  X  |    X    |       | 140 |\n| 2378 |     |  X  |         |       | 141 |\n| 2384 |     |     |    X    |       | 142 |\n| 2392 |  X  |  X  |    X    |       | 143 |\n| 2396 |     |     |    X    |       | 144 |\n| 2401 |     |     |    X    |       | 145 |\n| 2407 |     |     |    X    |       | 146 |\n| 2421 |     |  X  |         |       | 147 |\n| 2425 |     |     |    X    |       | 148 |\n| 2434 |     |  X  |         |       | 149 |\n| 2446 |     |  X  |    X    |       | 150 |\n| 2447 |  X  |  X  |         |       | 151 |\n| 2458 |     |  X  |    X    |       | 152 |\n| 2459 |     |     |    X    |       | 153 |\n| 2476 |     |  X  |         |       | 154 |\n| 2483 |  X  |  X  |         |       | 155 |\n| 2486 |     |  X  |         |       | 156 |\n| 2505 |  X  |  X  |         |       | 157 |\n| 2518 |  X  |  X  |    X    |       | 158 |\n| 2535 |     |  X  |         |       | 159 |\n| 2538 |     |  X  |         |       | 160 |\n| 2543 |  X  |  X  |    X    |       | 161 |\n| 2554 |     |     |    X    |       | 162 |\n| 2557 |     |  X  |    X    |       | 163 |\n| 2565 |     |  X  |    X    |       | 164 |\n| 2569 |  X  |  X  |         |       | 165 |\n| 2593 |  X  |  X  |         |       | 166 |\n| 2595 |     |  X  |         |       | 167 |\n| 2608 |     |  X  |         |       | 168 |\n| 2609 |     |  X  |         |       | 169 |\n| 2616 |  X  |  X  |    X    |       | 170 |\n| 2622 |  X  |  X  |         |       | 171 |\n| 2626 |     |  X  |         |       | 172 |\n| 2633 |  X  |     |         |       | 173 |\n| 2640 |     |  X  |    X    |       | 174 |\n| 2645 |     |     |    X    |       | 175 |\n| 2650 |  X  |     |         |       | 176 |\n| 2659 |     |     |    X    |       | 177 |\n| 2673 |     |  X  |    X    |       | 178 |\n| 2693 |     |  X  |         |       | 179 |\n| 2704 |  X  |  X  |         |       | 180 |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "| 2705 |  X  |  X  |         |       | 181 |\n| 2717 |     |  X  |    X    |       | 182 |\n| 2725 |  X  |  X  |         |       | 183 |\n| 2731 |  X  |  X  |    X    |       | 184 |\n| 2732 |     |  X  |         |       | 185 |\n| 2782 |     |  X  |    X    |       | 186 |\n| 2803 |     |  X  |         |       | 187 |\n| 2806 |     |  X  |         |       | 188 |\n| 2812 |  X  |  X  |    X    |   X   | 189 |\n| 2818 |  X  |  X  |         |       | 190 |\n| 2828 |     |  X  |    X    |       | 191 |\n| 2830 |  X  |     |         |       | 192 |\n| 2831 |  X  |  X  |    X    |       | 193 |\n| 2839 |     |  X  |         |       | 194 |\n| 2846 |  X  |  X  |         |       | 195 |\n| 2853 |     |  X  |         |       | 196 |\n| 2863 |     |  X  |         |       | 197 |\n| 2910 |     |  X  |    X    |       | 198 |\n| 2912 |     |  X  |    X    |       | 199 |\n| 2915 |     |  X  |         |       | 200 |\n| 2926 |     |     |    X    |       | 201 |\n| 2942 |     |  X  |         |       | 202 |\n| 2965 |     |  X  |         |       | 203 |\n| 2967 |  X  |  X  |    X    |       | 204 |\n| 2970 |     |  X  |         |       | 205 |\n| 2993 |  X  |  X  |         |       | 206 |\n| 3010 |  X  |  X  |         |       | 207 |\n| 3023 |     |  X  |         |       | 208 |\n| 3028 |     |  X  |         |       | 209 |\n| 3075 |  X  |  X  |         |       | 210 |\n| 3080 |     |  X  |         |       | 211 |\n| 3092 |  X  |  X  |    X    |   X   | 212 |\n+------+-----+-----+---------+-------+-----+\n| RFC# | bar | foo | foo.bar | fubar |  #  |\n|      |     |     | foobar  |       |     |\n+------+-----+-----+---------+-------+-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "zh-CHS": "安全考虑"
    },
    {
      "indent": 3,
      "text": "Security issues are not discussed in this memo.",
      "zh-CHS": "本备忘录不讨论安全问题。"
    },
    {
      "indent": 0,
      "text": "References",
      "zh-CHS": "工具书类"
    },
    {
      "indent": 3,
      "text": "[BFF] \"Best of Foo Fighters: Signature Licks\", Troy Stetina, Foo Fighters, October 2000, Hal Leonard Publishing Corporation, ISBN 063401470.",
      "zh-CHS": "[BFF]“最好的Foo战斗机：签名舔”，特洛伊·斯蒂蒂娜，Foo战斗机，2000年10月，哈尔·伦纳德出版公司，ISBN 063401470。"
    },
    {
      "indent": 3,
      "text": "[DOG] <http://www.rarebreed.com/breeds/foo/foo.html>.",
      "zh-CHS": "[狗]<http://www.rarebreed.com/breeds/foo/foo.html>."
    },
    {
      "indent": 3,
      "text": "[EAC] \"Encyclopedia of American Comics\", Ron Goulart, 1990, Facts on File.",
      "zh-CHS": "[EAC]“美国漫画百科全书”，罗恩·古拉特，1990年，事实档案。"
    },
    {
      "indent": 3,
      "text": "[EF]      \"Encyclopedia Frobozzica\",\n          <http://www.everything2.com/index.pl?node=Prince%20Foo>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[FF] Foo Fighters - \"The Rainbow Conspiracy\", Brad Steiger, Sherry Hansen Steiger, December 1998, Kensington Publishing Corp., ISBN 1575663635. - Computer UFO Network <http://www.cufon.org> particularly <http://www.cufon.org/cufon/foo.htm>.",
      "zh-CHS": "[FF]Foo Fighters-“彩虹阴谋”，布拉德·施泰格，雪莉·汉森·施泰格，1998年12月，肯辛顿出版公司，ISBN 15756635计算机UFO网络<http://www.cufon.org>特别是<http://www.cufon.org/cufon/foo.htm>."
    },
    {
      "indent": 3,
      "text": "[FOLDOC] \"Free On-Line Dictionary Of Computing\", <http://www.foldoc.org>.",
      "zh-CHS": "[FOLDOC]“免费在线计算词典”<http://www.foldoc.org>."
    },
    {
      "indent": 3,
      "text": "[JARGON] The Jargon File. See <http://www.jargon.org>. Last printed as \"The New Hacker's Dictionary\", Eric S. Raymond, 3rd Edition, MIT Press, ISBN 0-262-68092-0, 1996.",
      "zh-CHS": "[行话]行话文件。看<http://www.jargon.org>. 最后一次印刷为“新黑客词典”，Eric s.Raymond，第三版，麻省理工学院出版社，ISBN 0-262-68092-012996。"
    },
    {
      "indent": 3,
      "text": "[OED] \"The Oxford English Dictionary\", J. A. Simpson, 1989, Oxford University Press, ISBN 0198611862.",
      "zh-CHS": "《牛津英语词典》，J.A.辛普森，1989年，牛津大学出版社，ISBN 0198611862。"
    },
    {
      "indent": 3,
      "text": "[PERS] Personal communications.",
      "zh-CHS": "个人通讯。"
    },
    {
      "indent": 3,
      "text": "[RFC269] Brodie, H., \"Some Experience with File Transfer\", RFC 269, December 1971.",
      "zh-CHS": "[RFC269]布罗迪，H.，“文件传输的一些经验”，RFC2691971年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC1037] Greenberg, B. and S. Keene, \"NFILE - A File Access Protocol\", RFC 1037, December 1987.",
      "zh-CHS": "[RFC1037]Greenberg，B.和S.Keene，“NFILE-A文件访问协议”，RFC1037，1987年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC1639] Piscitello, D., \"FTP Operation Over Big Address Records (FOOBAR)\", RFC 1639, June 1994.",
      "zh-CHS": "[RFC1639]Piscitello，D.，“大地址记录上的FTP操作（FOOBAR）”，RFC1639，1994年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2606] Eastlake, D. and A. Panitz, \"Reserved Top Level DNS Names\", BCP 32, RFC 2606, June 1999.",
      "zh-CHS": "[RFC2606]Eastlake，D.和A.Panitz，“保留顶级DNS名称”，BCP 32，RFC 26061999年6月。"
    },
    {
      "indent": 3,
      "text": "[TMRC] The Tech Model Railroad Club (The Model Railroad Club of the Massachusetts Institute of Technology) Dictionary, <http://tmrc-www.mit.edu/dictionary.html>.",
      "zh-CHS": "[TMRC]技术模型铁路俱乐部（麻省理工学院模型铁路俱乐部）词典<http://tmrc-www.mit.edu/dictionary.html>."
    },
    {
      "indent": 3,
      "text": "[WBCC] \"Warner Brothers Cartoon Companion\", <http://members.aol.com/EOCostello/>.",
      "zh-CHS": "[WBCC]“华纳兄弟卡通伴侣”<http://members.aol.com/EOCostello/>."
    },
    {
      "indent": 3,
      "text": "[WORDS] \"Words\", Paul Dickson, ISBN 0-440-52260-7, Dell, 1982.",
      "zh-CHS": "[文字]“文字”，保罗·迪克森，ISBN 0-440-52260-7，戴尔，1982年。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "The authors of this document are:",
      "zh-CHS": "本文件的作者是："
    },
    {
      "indent": 3,
      "text": "Donald E. Eastlake 3rd Motorola 155 Beaver Street Milford, MA 01757 USA",
      "zh-CHS": "Donald E.Eastlake 3rd Motorola美国马萨诸塞州米尔福德海狸街155号01757"
    },
    {
      "indent": 3,
      "text": "Phone:  +1 508-261-5434 (w)\n        +1 508-634-2066 (h)\nFax:    +1 508-261-4777 (w)\nEMail:  Donald.Eastlake@motorola.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Carl-Uno Manros Xerox Corporation 701 Aviation Blvd. El Segundo, CA 90245 USA",
      "zh-CHS": "卡尔·乌诺·曼罗斯施乐公司航空大道701号。美国加利福尼亚州塞贡多市，邮编90245"
    },
    {
      "indent": 3,
      "text": "Phone:  +1 310-333-8273\nFax:    +1 310-333-5514\nEMail:  manros@cp10.es.xerox.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Eric S. Raymond Open Source Initiative 6 Karen Drive Malvern, PA 19355",
      "zh-CHS": "Eric S.Raymond开源倡议6宾夕法尼亚州卡伦大道马尔文，19355"
    },
    {
      "indent": 3,
      "text": "Phone:  +1 610-296-5718\nEMail:  esr@thyrsus.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}