{
  "title": {
    "text": "RFC 3985: Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture ",
    "zh-CHS": "RFC 3985"
  },
  "number": 3985,
  "created_at": "2021-10-16 00:35:13.629239+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     S. Bryant, Ed.\nRequest for Comments: 3985                                 Cisco Systems\nCategory: Informational                                     P. Pate, Ed.\n                                                 Overture Networks, Inc.\n                                                              March 2005",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 9,
      "text": "Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture",
      "zh-CHS": "伪线仿真边到边（PWE3）体系结构"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes an architecture for Pseudo Wire Emulation Edge-to-Edge (PWE3). It discusses the emulation of services such as Frame Relay, ATM, Ethernet, TDM, and SONET/SDH over packet switched networks (PSNs) using IP or MPLS. It presents the architectural framework for pseudo wires (PWs), defines terminology, and specifies the various protocol elements and their functions.",
      "zh-CHS": "本文档描述了一种用于边到边（PWE3）伪线仿真的体系结构。它讨论了使用IP或MPLS在分组交换网络（PSN）上模拟帧中继、ATM、以太网、TDM和SONET/SDH等服务。它介绍了伪线（PWs）的体系结构框架，定义了术语，并指定了各种协议元素及其功能。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.   Introduction. . . . . . . . . . . . . . . . . . . . . . . . .  2\n     1.1.  Pseudo Wire Definition. . . . . . . . . . . . . . . . .  2\n     1.2.  PW Service Functionality. . . . . . . . . . . . . . . .  3\n     1.3.  Non-Goals of This Document. . . . . . . . . . . . . . .  4\n     1.4.  Terminology . . . . . . . . . . . . . . . . . . . . . .  4\n2.   PWE3 Applicability. . . . . . . . . . . . . . . . . . . . . .  6\n3.   Protocol Layering Model . . . . . . . . . . . . . . . . . . .  6\n     3.1.  Protocol Layers . . . . . . . . . . . . . . . . . . . .  7\n     3.2.  Domain of PWE3. . . . . . . . . . . . . . . . . . . . .  8\n     3.3.  Payload Types . . . . . . . . . . . . . . . . . . . . .  8\n4.   Architecture of Pseudo Wires. . . . . . . . . . . . . . . . . 11\n     4.1.  Network Reference Model . . . . . . . . . . . . . . . . 12\n     4.2.  PWE3 Pre-processing . . . . . . . . . . . . . . . . . . 12\n     4.3.  Maintenance Reference Model . . . . . . . . . . . . . . 16\n     4.4.  Protocol Stack Reference Model. . . . . . . . . . . . . 17\n     4.5.  Pre-processing Extension to Protocol Stack Reference\n           Model . . . . . . . . . . . . . . . . . . . . . . . . . 17\n5.   PW Encapsulation. . . . . . . . . . . . . . . . . . . . . . . 18",
      "raw": true,
      "toc": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 3,
      "text": "     5.1.  Payload Convergence Layer . . . . . . . . . . . . . . . 19\n     5.2.  Payload-independent PW Encapsulation Layers . . . . . . 21\n     5.3.  Fragmentation . . . . . . . . . . . . . . . . . . . . . 24\n     5.4.  Instantiation of the Protocol Layers. . . . . . . . . . 24\n6.   PW Demultiplexer Layer and PSN Requirements . . . . . . . . . 27\n     6.1.  Multiplexing. . . . . . . . . . . . . . . . . . . . . . 27\n     6.2.  Fragmentation . . . . . . . . . . . . . . . . . . . . . 28\n     6.3.  Length and Delivery . . . . . . . . . . . . . . . . . . 28\n     6.4.  PW-PDU Validation . . . . . . . . . . . . . . . . . . . 28\n     6.5.  Congestion Considerations . . . . . . . . . . . . . . . 28\n7.   Control Plane . . . . . . . . . . . . . . . . . . . . . . . . 29\n     7.1.  Set-up or Teardown of Pseudo Wires. . . . . . . . . . . 29\n     7.2.  Status Monitoring . . . . . . . . . . . . . . . . . . . 30\n     7.3.  Notification of Pseudo Wire Status Changes. . . . . . . 30\n     7.4.  Keep-alive. . . . . . . . . . . . . . . . . . . . . . . 31\n     7.5.  Handling Control Messages of the Native Services. . . . 32\n8.   Management and Monitoring . . . . . . . . . . . . . . . . . . 32\n     8.1.  Status and Statistics . . . . . . . . . . . . . . . . . 32\n     8.2.  PW SNMP MIB Architecture. . . . . . . . . . . . . . . . 33\n     8.3.  Connection Verification and Traceroute. . . . . . . . . 36\n9.   IANA Considerations . . . . . . . . . . . . . . . . . . . . . 37\n10.  Security Considerations . . . . . . . . . . . . . . . . . . . 37\n11.  Acknowledgements. . . . . . . . . . . . . . . . . . . . . . . 38\n12.  References. . . . . . . . . . . . . . . . . . . . . . . . . . 38\n     12.1.  Normative References . . . . . . . . . . . . . . . . . 38\n     12.2.  Informative References . . . . . . . . . . . . . . . . 39\n13.  Co-Authors. . . . . . . . . . . . . . . . . . . . . . . . . . 40\n14.  Editors' Addresses. . . . . . . . . . . . . . . . . . . . . . 41\n     Full Copyright Statement. . . . . . . . . . . . . . . . . . . 42",
      "raw": true,
      "toc": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document describes an architecture for Pseudo Wire Emulation Edge-to-Edge (PWE3) in support of [RFC3916]. It discusses the emulation of services such as Frame Relay, ATM, Ethernet, TDM, and SONET/SDH over packet switched networks (PSNs) using IP or MPLS. It presents the architectural framework for pseudo wires (PWs), defines terminology, and specifies the various protocol elements and their functions.",
      "zh-CHS": "本文档描述了支持[RFC3916]的伪线仿真边到边（PWE3）的体系结构。它讨论了使用IP或MPLS在分组交换网络（PSN）上模拟帧中继、ATM、以太网、TDM和SONET/SDH等服务。它介绍了伪线（PWs）的体系结构框架，定义了术语，并指定了各种协议元素及其功能。"
    },
    {
      "indent": 0,
      "text": "1.1. Pseudo Wire Definition",
      "section_title": true,
      "zh-CHS": "1.1. 伪导线定义"
    },
    {
      "indent": 3,
      "text": "PWE3 is a mechanism that emulates the essential attributes of a telecommunications service (such as a T1 leased line or Frame Relay) over a PSN. PWE3 is intended to provide only the minimum necessary functionality to emulate the wire with the required degree of faithfulness for the given service definition. Any required switching functionality is the responsibility of a forwarder function",
      "zh-CHS": "PWE3是一种模拟PSN上电信服务（如T1专线或帧中继）基本属性的机制。PWE3旨在仅提供最低限度的必要功能，以模拟具有给定服务定义所需忠实度的连线。任何所需的交换功能均由转发器功能负责"
    },
    {
      "indent": 3,
      "text": "(FWRD). Any translation or other operation needing knowledge of the payload semantics is carried out by native service processing (NSP) elements. The functional definition of any FWRD or NSP elements is outside the scope of PWE3.",
      "zh-CHS": "（续）。任何需要有效负载语义知识的翻译或其他操作都由本机服务处理（NSP）元素执行。任何FWRD或NSP元件的功能定义不在PWE3的范围内。"
    },
    {
      "indent": 3,
      "text": "The required functions of PWs include encapsulating service-specific bit streams, cells, or PDUs arriving at an ingress port and carrying them across an IP path or MPLS tunnel. In some cases it is necessary to perform other operations such as managing their timing and order, to emulate the behavior and characteristics of the service to the required degree of faithfulness.",
      "zh-CHS": "PWs所需的功能包括封装到达入口端口的特定于服务的比特流、小区或PDU，并通过IP路径或MPLS隧道携带它们。在某些情况下，有必要执行其他操作，例如管理它们的时间和顺序，以模拟服务的行为和特性，达到所需的忠实程度。"
    },
    {
      "indent": 3,
      "text": "From the perspective of Customer Edge Equipment (CE), the PW is characterized as an unshared link or circuit of the chosen service. In some cases, there may be deficiencies in the PW emulation that impact the traffic carried over a PW and therefore limit the applicability of this technology. These limitations must be fully described in the appropriate service-specific documentation.",
      "zh-CHS": "从客户边缘设备（CE）的角度来看，PW的特征是所选服务的非共享链路或电路。在某些情况下，PW仿真中可能存在影响通过PW的流量的缺陷，因此限制了该技术的适用性。这些限制必须在相应的特定于服务的文档中充分说明。"
    },
    {
      "indent": 3,
      "text": "For each service type, there will be one default mode of operation that all PEs offering that service type must support. However, optional modes may be defined to improve the faithfulness of the emulated service, if it can be clearly demonstrated that the additional complexity associated with the optional mode is offset by the value it offers to PW users.",
      "zh-CHS": "对于每种服务类型，都有一种默认操作模式，所有提供该服务类型的PEs都必须支持该模式。然而，如果可以清楚地证明与可选模式相关联的额外复杂性被其提供给PW用户的值所抵消，则可以定义可选模式以提高模拟服务的忠实性。"
    },
    {
      "indent": 0,
      "text": "1.2. PW Service Functionality",
      "section_title": true,
      "zh-CHS": "1.2. PW服务功能"
    },
    {
      "indent": 3,
      "text": "PWs provide the following functions in order to emulate the behavior and characteristics of the native service.",
      "zh-CHS": "PWs提供以下函数以模拟本机服务的行为和特征。"
    },
    {
      "indent": 7,
      "text": "o Encapsulation of service-specific PDUs or circuit data arriving at the PE-bound port (logical or physical). o Carriage of the encapsulated data across a PSN tunnel. o Establishment of the PW, including the exchange and/or distribution of the PW identifiers used by the PSN tunnel endpoints. o Managing the signaling, timing, order, or other aspects of the service at the boundaries of the PW. o Service-specific status and alarm management.",
      "zh-CHS": "o 封装到达PE绑定端口（逻辑或物理）的特定于服务的PDU或电路数据。o通过PSN隧道传输封装数据。o建立PW，包括交换和/或分发PSN隧道端点使用的PW标识符。o在PW边界管理信号、定时、顺序或服务的其他方面。o特定于服务的状态和报警管理。"
    },
    {
      "indent": 0,
      "text": "1.3. Non-Goals of This Document",
      "section_title": true,
      "zh-CHS": "1.3. 本文件的非目标"
    },
    {
      "indent": 3,
      "text": "The following are non-goals for this document:",
      "zh-CHS": "以下是本文件的非目标："
    },
    {
      "indent": 6,
      "text": "o The on-the-wire specification of PW encapsulations. o The detailed definition of the protocols involved in PW setup and maintenance.",
      "zh-CHS": "o PW封装的在线规范。o PW设置和维护所涉及协议的详细定义。"
    },
    {
      "indent": 3,
      "text": "The following are outside the scope of PWE3:",
      "zh-CHS": "以下内容不属于PWE3的范围："
    },
    {
      "indent": 6,
      "text": "o Any multicast service not native to the emulated medium. Thus, Ethernet transmission to a \"multicast\" IEEE-48 address is in scope, but multicast services such as MARS [RFC2022] that are implemented on top of the medium are not. o Methods to signal or control the underlying PSN.",
      "zh-CHS": "o 任何非模拟介质本机的多播服务。因此，到“多播”IEEE-48地址的以太网传输在范围内，但在介质顶部实现的多播服务（如MARS[RFC2022]）不在范围内。o发送信号或控制基础PSN的方法。"
    },
    {
      "indent": 0,
      "text": "1.4. Terminology",
      "section_title": true,
      "zh-CHS": "1.4. 术语"
    },
    {
      "indent": 3,
      "text": "This document uses the following definitions of terms. These terms are illustrated in context in Figure 2.",
      "zh-CHS": "本文件使用以下术语定义。这些术语如图2所示。"
    },
    {
      "indent": 3,
      "text": "Attachment Circuit The physical or virtual circuit attaching (AC) a CE to a PE. An attachment Circuit may be, for example, a Frame Relay DLCI, an ATM VPI/VCI, an Ethernet port, a VLAN, a PPP connection on a physical interface, a PPP session from an L2TP tunnel, or an MPLS LSP. If both physical and virtual ACs are of the same technology (e.g., both ATM, both Ethernet, both Frame Relay), the PW is said to provide \"homogeneous transport\"; otherwise, it is said to provide \"heterogeneous transport\".",
      "zh-CHS": "连接电路将CE连接到PE的物理或虚拟电路。例如，连接电路可以是帧中继DLCI、ATM VPI/VCI、以太网端口、VLAN、物理接口上的PPP连接、来自L2TP隧道的PPP会话或MPLS LSP。如果物理和虚拟ACs都采用相同的技术（例如，两个ATM、两个以太网、两个帧中继），则PW被称为提供“同质传输”；否则，它被称为提供“异构传输”。"
    },
    {
      "indent": 3,
      "text": "CE-bound The traffic direction in which PW-PDUs are received on a PW via the PSN, processed, and then sent to the destination CE.",
      "zh-CHS": "CE绑定PW PDU通过PSN在PW上接收、处理然后发送到目标CE的通信方向。"
    },
    {
      "indent": 3,
      "text": "CE Signaling Messages sent and received by the CE's control plane. It may be desirable or even necessary for the PE to participate in or to monitor this signaling in order to emulate the service effectively.",
      "zh-CHS": "CE的控制平面发送和接收的CE信令消息。为了有效地模拟服务，PE可能需要或甚至必须参与或监视该信令。"
    },
    {
      "indent": 3,
      "text": "Control Word (CW) A four-octet header used in some encapsulations to carry per-packet information when the PSN is MPLS.",
      "zh-CHS": "控制字（CW）在某些封装中使用的四个八位组的报头，当PSN是MPLS时，它携带每个包的信息。"
    },
    {
      "indent": 3,
      "text": "Customer Edge (CE) A device where one end of a service originates and/or terminates. The CE is not aware that it is using an emulated service rather than a native service.",
      "zh-CHS": "客户边缘（CE）服务一端发起和/或终止的设备。CE不知道它正在使用模拟服务而不是本机服务。"
    },
    {
      "indent": 3,
      "text": "Forwarder (FWRD) A PE subsystem that selects the PW to use in order to transmit a payload received on an AC.",
      "zh-CHS": "转发器（FWRD）一个PE子系统，它选择要使用的PW，以便传输AC上接收到的有效负载。"
    },
    {
      "indent": 3,
      "text": "Fragmentation The action of dividing a single PDU into multiple PDUs before transmission with the intent of the original PDU being reassembled elsewhere in the network. Packets may undergo fragmentation if they are larger than the MTU of the network they will traverse.",
      "zh-CHS": "分段在传输之前将单个PDU划分为多个PDU的操作，目的是在网络中的其他位置重新组装原始PDU。如果数据包大于它们将要穿越的网络的MTU，则它们可能会发生碎片。"
    },
    {
      "indent": 3,
      "text": "Maximum Transmission The packet size (excluding data link header) unit (MTU) that an interface can transmit without needing to fragment.",
      "zh-CHS": "最大传输接口无需分段即可传输的数据包大小（不包括数据链路头）单元（MTU）。"
    },
    {
      "indent": 3,
      "text": "Native Service Processing of the data received by the PE Processing (NSP) from the CE before presentation to the PW for transmission across the core, or processing of the data received from a PW by a PE before it is output on the AC. NSP functionality is defined by standards bodies other than the IETF, such as ITU-T,ANSI, or ATMF.)",
      "zh-CHS": "PE处理（NSP）从CE接收的数据在呈现给PW进行跨核心传输之前的本机服务处理，或PE从PW接收的数据在输出到AC之前的处理。NSP功能由IETF以外的标准机构定义，如ITU-T、ANSI或ATMF。）"
    },
    {
      "indent": 3,
      "text": "Packet Switched Within the context of PWE3, this is a Network (PSN) network using IP or MPLS as the mechanism for packet forwarding.",
      "zh-CHS": "在PWE3的上下文中进行分组交换，这是一种使用IP或MPLS作为分组转发机制的网络（PSN）。"
    },
    {
      "indent": 3,
      "text": "PE-Bound The traffic direction in which information from a CE is adapted to a PW, and PW-PDUs are sent into the PSN.",
      "zh-CHS": "PE绑定来自CE的信息适配于PW的业务方向，并且PW PDU被发送到PSN。"
    },
    {
      "indent": 3,
      "text": "PE/PW Maintenance Used by the PEs to set up, maintain, and tear down the PW. It may be coupled with CE Signaling in order to manage the PW effectively.",
      "zh-CHS": "PEs用于设置、维护和拆卸PW的PE/PW维护。它可以与CE信令耦合以有效地管理PW。"
    },
    {
      "indent": 3,
      "text": "Protocol Data The unit of data output to, or received Unit (PDU) from, the network by a protocol layer.",
      "zh-CHS": "协议数据通过协议层向网络输出或从网络接收数据的单元（PDU）。"
    },
    {
      "indent": 3,
      "text": "Provider Edge (PE) A device that provides PWE3 to a CE.",
      "zh-CHS": "提供商边缘（PE）向CE提供PWE3的设备。"
    },
    {
      "indent": 3,
      "text": "Pseudo Wire (PW) A mechanism that carries the essential elements of an emulated service from one PE to one or more other PEs over a PSN.",
      "zh-CHS": "伪线路（PW）通过PSN将模拟服务的基本元素从一个PE传输到一个或多个其他PE的机制。"
    },
    {
      "indent": 3,
      "text": "Pseudo Wire A mechanism that emulates the essential Emulation Edge to attributes of service (such as a T1 leased Edge (PWE3) line or Frame Relay) over a PSN.",
      "zh-CHS": "伪连线通过PSN将基本仿真边缘模拟到服务属性（如T1租用边缘（PWE3）线路或帧中继）的机制。"
    },
    {
      "indent": 3,
      "text": "Pseudo Wire PDU A PDU sent on the PW that contains all of (PW-PDU) the data and control information necessary to emulate the desired service.",
      "zh-CHS": "伪线PDU在PW上发送的PDU，包含模拟所需服务所需的所有（PW-PDU）数据和控制信息。"
    },
    {
      "indent": 3,
      "text": "PSN Tunnel A tunnel across a PSN, inside which one or more PWs can be carried.",
      "zh-CHS": "PSN隧道穿过PSN的隧道，其中可承载一个或多个PW。"
    },
    {
      "indent": 3,
      "text": "PSN Tunnel Used to set up, maintain, and tear down the Signaling underlying PSN tunnel.",
      "zh-CHS": "PSN隧道用于设置、维护和拆除基础PSN隧道的信令。"
    },
    {
      "indent": 3,
      "text": "PW Demultiplexer Data-plane method of identifying a PW terminating at a PE.",
      "zh-CHS": "PW解复用器数据平面识别终止于PE的PW的方法。"
    },
    {
      "indent": 3,
      "text": "Time Domain Time Division Multiplexing. Frequently used Multiplexing (TDM) to refer to the synchronous bit streams at rates defined by G.702.",
      "zh-CHS": "时域时分复用。频繁使用的多路复用（TDM）指的是以G.702规定的速率传输的同步比特流。"
    },
    {
      "indent": 3,
      "text": "Tunnel A method of transparently carrying information over a network.",
      "zh-CHS": "隧道通过网络透明地传送信息的一种方法。"
    },
    {
      "indent": 0,
      "text": "2. PWE3 Applicability",
      "section_title": true,
      "zh-CHS": "2. PWE3适用性"
    },
    {
      "indent": 3,
      "text": "The PSN carrying a PW will subject payload packets to loss, delay, delay variation, and re-ordering. During a network transient there may be a sustained period of impaired service. The applicability of PWE3 to a particular service depends on the sensitivity of that service (or the CE implementation) to these effects, and on the ability of the adaptation layer to mask them. Some services, such as IP over FR over PWE3, may prove quite resilient to IP and MPLS PSN characteristics. Other services, such as the interconnection of PBX systems via PWE3, will require more careful consideration of the PSN and adaptation layer characteristics. In some instances, traffic engineering of the underlying PSN will be required, and in some cases the constraints may make the required service guarantees impossible to provide.",
      "zh-CHS": "携带PW的PSN将使有效载荷分组遭受丢失、延迟、延迟变化和重新排序。在网络过渡期间，可能会有一段持续的服务受损期。PWE3对特定服务的适用性取决于该服务（或CE实现）对这些影响的敏感性，以及适配层屏蔽这些影响的能力。一些服务，如IP over FR over PWE3，可能证明对IP和MPLS PSN特性具有相当的弹性。其他服务，如通过PWE3的PBX系统互连，将需要更仔细地考虑PSN和适配层特性。在某些情况下，需要对基础PSN进行流量工程，在某些情况下，这些限制可能使所需的服务保证无法提供。"
    },
    {
      "indent": 0,
      "text": "3. Protocol Layering Model",
      "section_title": true,
      "zh-CHS": "3. 协议分层模型"
    },
    {
      "indent": 3,
      "text": "The PWE3 protocol-layering model is intended to minimize the differences between PWs operating over different PSN types. The design of the protocol-layering model has the goals of making each PW definition independent of the underlying PSN, and of maximizing the reuse of IETF protocol definitions and their implementations.",
      "zh-CHS": "PWE3协议分层模型旨在最小化在不同PSN类型上运行的PWs之间的差异。协议分层模型的设计目标是使每个PW定义独立于基础PSN，并最大限度地重用IETF协议定义及其实现。"
    },
    {
      "indent": 0,
      "text": "3.1. Protocol Layers",
      "section_title": true,
      "zh-CHS": "3.1. 协议层"
    },
    {
      "indent": 3,
      "text": "The logical protocol-layering model required to support a PW is shown in Figure 1.",
      "zh-CHS": "支持PW所需的逻辑协议分层模型如图1所示。"
    },
    {
      "indent": 10,
      "text": "+---------------------------+\n|         Payload           |\n+---------------------------+\n|      Encapsulation        | <==== may be empty\n+---------------------------+\n|     PW Demultiplexer      |\n+---------------------------+\n|     PSN Convergence       | <==== may be empty\n+---------------------------+\n|           PSN             |\n+---------------------------+\n|         Data-Link         |\n+---------------------------+\n|          Physical         |\n+---------------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 20,
      "text": "Figure 1. Logical Protocol Layering Model",
      "zh-CHS": "图1。逻辑协议分层模型"
    },
    {
      "indent": 3,
      "text": "The payload is transported over the Encapsulation Layer. The Encapsulation Layer carries any information, not already present within the payload itself, that is needed by the PW CE-bound PE interface to send the payload to the CE via the physical interface. If no further information is needed in the payload itself, this layer is empty.",
      "zh-CHS": "有效载荷通过封装层传输。封装层携带PW-CE绑定的PE接口通过物理接口向CE发送有效负载所需的、有效负载本身中尚未存在的任何信息。如果有效载荷本身不需要更多信息，则该层为空。"
    },
    {
      "indent": 3,
      "text": "The Encapsulation Layer also provides support for real-time processing, and if needed for sequencing.",
      "zh-CHS": "封装层还支持实时处理，如果需要，还支持排序。"
    },
    {
      "indent": 3,
      "text": "The PW Demultiplexer layer provides the ability to deliver multiple PWs over a single PSN tunnel. The PW demultiplexer value used to identify the PW in the data plane may be unique per PE, but this is not a PWE3 requirement. It must, however, be unique per tunnel endpoint. If it is necessary to identify a particular tunnel, then that is the responsibility of the PSN layer.",
      "zh-CHS": "PW解复用器层提供通过单个PSN隧道传送多个PW的能力。用于识别数据平面中的PW的PW解复用器值可能是每个PE唯一的，但这不是PWE3要求。但是，它必须是每个隧道端点唯一的。如果需要识别特定隧道，则这是PSN层的责任。"
    },
    {
      "indent": 3,
      "text": "The PSN Convergence layer provides the enhancements needed to make the PSN conform to the assumed PSN service requirement. Therefore, this layer provides a consistent interface to the PW, making the PW independent of the PSN type. If the PSN already meets the service requirements, this layer is empty.",
      "zh-CHS": "PSN融合层提供了使PSN符合假定PSN服务需求所需的增强功能。因此，该层为PW提供了一致的接口，使PW独立于PSN类型。如果PSN已经满足服务要求，则该层为空。"
    },
    {
      "indent": 3,
      "text": "The PSN header, MAC/Data-Link, and Physical Layer definitions are outside the scope of this document. The PSN can be IPv4, IPv6, or MPLS.",
      "zh-CHS": "PSN报头、MAC/数据链路和物理层定义不在本文档范围内。PSN可以是IPv4、IPv6或MPLS。"
    },
    {
      "indent": 0,
      "text": "3.2. Domain of PWE3",
      "section_title": true,
      "zh-CHS": "3.2. PWE3域"
    },
    {
      "indent": 3,
      "text": "PWE3 defines the Encapsulation Layer, the method of carrying various payload types, and the interface to the PW Demultiplexer Layer. It is expected that the other layers will be provided by tunneling methods such as L2TP or MPLS over the PSN.",
      "zh-CHS": "PWE3定义了封装层、承载各种有效负载类型的方法以及与PW解复用器层的接口。预计其他层将通过隧道方法提供，如PSN上的L2TP或MPLS。"
    },
    {
      "indent": 0,
      "text": "3.3. Payload Types",
      "section_title": true,
      "zh-CHS": "3.3. 有效载荷类型"
    },
    {
      "indent": 3,
      "text": "The payload is classified into the following generic types of native data units:",
      "zh-CHS": "有效负载分为以下通用类型的本机数据单元："
    },
    {
      "indent": 7,
      "text": "o Packet o Cell o Bit stream o Structured bit stream",
      "zh-CHS": "o 分组o单元o比特流o结构化比特流"
    },
    {
      "indent": 3,
      "text": "Within these generic types there are specific service types:",
      "zh-CHS": "在这些通用类型中，有特定的服务类型："
    },
    {
      "indent": 7,
      "text": "Generic Payload Type    PW Service\n--------------------    ----------\nPacket                  Ethernet (all types), HDLC framing,\n                        Frame Relay, ATM AAL5 PDU.",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 7,
      "text": "Cell ATM.",
      "zh-CHS": "信元自动柜员机。"
    },
    {
      "indent": 7,
      "text": "Bit stream Unstructured E1, T1, E3, T3.",
      "zh-CHS": "比特流非结构化E1、T1、E3、T3。"
    },
    {
      "indent": 7,
      "text": "Structured bit stream SONET/SDH (e.g., SPE, VT, NxDS0).",
      "zh-CHS": "结构化比特流SONET/SDH（例如SPE、VT、NxDS0）。"
    },
    {
      "indent": 0,
      "text": "3.3.1. Packet Payload",
      "section_title": true,
      "zh-CHS": "3.3.1. 数据包有效载荷"
    },
    {
      "indent": 3,
      "text": "A packet payload is a variable-size data unit delivered to the PE via the AC. A packet payload may be large compared to the PSN MTU. The delineation of the packet boundaries is encapsulation specific. HDLC or Ethernet PDUs can be considered examples of packet payloads. Typically, a packet will be stripped of transmission overhead such as HDLC flags and stuffing bits before transmission over the PW.",
      "zh-CHS": "分组有效载荷是经由AC传送到PE的可变大小的数据单元。分组有效载荷与PSN MTU相比可能较大。数据包边界的划分是特定于封装的。HDLC或以太网PDU可被视为分组有效负载的示例。通常，在通过PW传输之前，分组将被去除传输开销，例如HDLC标志和填充位。"
    },
    {
      "indent": 3,
      "text": "A packet payload would normally be relayed across the PW as a single unit. However, there will be cases where the combined size of the packet payload and its associated PWE3 and PSN headers exceeds the PSN path MTU. In these cases, some fragmentation methodology has to be applied. This may, for example, be the case when a user provides",
      "zh-CHS": "数据包有效载荷通常作为单个单元在PW上中继。然而，在某些情况下，分组有效载荷及其相关联的PWE3和PSN报头的组合大小超过PSN路径MTU。在这些情况下，必须采用一些分段方法。例如，当用户提供"
    },
    {
      "indent": 3,
      "text": "the service and attaches to the service provider via Ethernet, or when nested pseudo-wires are involved. Fragmentation is discussed in more detail in section 5.3.",
      "zh-CHS": "服务，并通过以太网或涉及嵌套伪线时连接到服务提供商。第5.3节对碎片进行了更详细的讨论。"
    },
    {
      "indent": 3,
      "text": "A packet payload may need sequencing and real-time support.",
      "zh-CHS": "数据包有效负载可能需要排序和实时支持。"
    },
    {
      "indent": 3,
      "text": "In some situations, the packet payload may be selected from the packets presented on the emulated wire on the basis of some sub-multiplexing technique. For example, one or more Frame Relay PDUs may be selected for transport over a particular pseudo wire based on the Frame Relay Data-Link Connection Identifier (DLCI), or, in the case of Ethernet payloads, by using a suitable MAC bridge filter. This is a forwarder function, and this selection would therefore be made before the packet was presented to the PW Encapsulation Layer.",
      "zh-CHS": "在一些情况下，可以基于一些子复用技术从仿真导线上呈现的分组中选择分组有效载荷。例如，可以基于帧中继数据链路连接标识符（DLCI），或者在以太网有效负载的情况下，通过使用合适的MAC网桥滤波器，选择一个或多个帧中继pdu用于通过特定伪线进行传输。这是一个转发器功能，因此在将数据包提交给PW封装层之前，将进行此选择。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Cell Payload",
      "section_title": true,
      "zh-CHS": "3.3.2. 小区有效载荷"
    },
    {
      "indent": 3,
      "text": "A cell payload is created by capturing, transporting, and replaying groups of octets presented on the wire in a fixed-size format. The delineation of the group of bits that comprise the cell is specific to the encapsulation type. Two common examples of cell payloads are ATM 53-octet cells, and the larger 188-octet MPEG Transport Stream packets [DVB].",
      "zh-CHS": "小区有效载荷是通过捕获、传输和重放以固定大小格式呈现在线路上的八位字节组来创建的。构成单元的比特组的描绘特定于封装类型。信元有效负载的两个常见示例是ATM 53八位字节信元和较大的188八位字节MPEG传输流分组[DVB]。"
    },
    {
      "indent": 3,
      "text": "To reduce per-PSN packet overhead, multiple cells may be concatenated into a single payload. The Encapsulation Layer may consider the payload complete on the expiry of a timer, after a fixed number of cells have been received or when a significant cell (e.g., an ATM OAM cell) has been received. The benefit of concatenating multiple PDUs should be weighed against a possible increase in packet delay variation and the larger penalty incurred by packet loss. In some cases, it may be appropriate for the Encapsulation Layer to perform some type of compression, such as silence suppression or voice compression.",
      "zh-CHS": "为了减少每个PSN分组的开销，可以将多个小区连接到单个有效负载中。封装层可以考虑在定时器期满之后、在接收到固定数量的小区之后或当接收到重要小区（例如，ATM OAM小区）时的有效负载。连接多个PDU的好处应与数据包延迟变化的可能增加和数据包丢失带来的更大惩罚进行权衡。在某些情况下，封装层可能适合执行某种类型的压缩，例如静音抑制或语音压缩。"
    },
    {
      "indent": 3,
      "text": "The generic cell payload service will normally need sequence number support and may also need real-time support. The generic cell payload service would not normally require fragmentation.",
      "zh-CHS": "通用小区有效载荷服务通常需要序列号支持，也可能需要实时支持。一般小区有效负载服务通常不需要分段。"
    },
    {
      "indent": 3,
      "text": "The Encapsulation Layer may apply some form of compression to some of these sub-types (e.g., idle cells may be suppressed).",
      "zh-CHS": "封装层可以对这些子类型中的一些应用某种形式的压缩（例如，可以抑制空闲单元）。"
    },
    {
      "indent": 3,
      "text": "In some instances, the cells to be incorporated in the payload may be selected by filtering them from the stream of cells presented on the wire. For example, an ATM PWE3 service may select cells based on their VCI or VPI fields. This is a forwarder function, and the selection would therefore be made before the packet was presented to the PW Encapsulation Layer.",
      "zh-CHS": "在一些实例中，可通过从呈现在导线上的小区流中过滤它们来选择要并入有效载荷中的小区。例如，ATM PWE3服务可以基于其VCI或VPI字段选择信元。这是一个转发器功能，因此在将数据包提交给PW封装层之前进行选择。"
    },
    {
      "indent": 0,
      "text": "3.3.3. Bit Stream",
      "section_title": true,
      "zh-CHS": "3.3.3. 比特流"
    },
    {
      "indent": 3,
      "text": "A bit stream payload is created by capturing, transporting, and replaying the bit pattern on the emulated wire, without taking advantage of any structure that, on inspection, may be visible within the relayed traffic (i.e., the internal structure has no effect on the fragmentation into packets).",
      "zh-CHS": "比特流有效载荷是通过捕获、传输和重放模拟导线上的比特模式而创建的，而不利用在检查时在中继通信量中可能可见的任何结构（即，内部结构对分组的分段没有影响）。"
    },
    {
      "indent": 3,
      "text": "In some instances it is possible to apply suppression to bit streams. For example, E1 and T1 send \"all-ones\" to indicate failure. This condition can be detected without any knowledge of the structure of the bit stream, and transmission of packetized can be data suppressed.",
      "zh-CHS": "在某些情况下，可以对比特流应用抑制。例如，E1和T1发送“所有”以指示故障。这种情况可以在不知道比特流结构的情况下被检测，并且可以抑制分组数据的传输。"
    },
    {
      "indent": 3,
      "text": "This service will require sequencing and real-time support.",
      "zh-CHS": "这项服务需要排序和实时支持。"
    },
    {
      "indent": 0,
      "text": "3.3.4. Structured Bit Stream",
      "section_title": true,
      "zh-CHS": "3.3.4. 结构化比特流"
    },
    {
      "indent": 3,
      "text": "A structured bit stream payload is created by using some knowledge of the underlying structure of the bit stream to capture, transport, and replay the bit pattern on the emulated wire.",
      "zh-CHS": "结构化比特流有效负载是通过使用比特流底层结构的一些知识来捕获、传输和重放模拟导线上的比特模式而创建的。"
    },
    {
      "indent": 3,
      "text": "Two important points distinguish structured and unstructured bit streams:",
      "zh-CHS": "区分结构化和非结构化比特流的两个要点："
    },
    {
      "indent": 7,
      "text": "o Some parts of the original bit stream may be stripped in the PSN-bound direction by an NSP block. For example, in Structured SONET the section and line overhead (and possibly more) may be stripped. A framer is required to enable such stripping. It is also required for frame/payload alignment for fractional T1/E1 applications.",
      "zh-CHS": "o 原始比特流的某些部分可以由NSP块在PSN绑定方向上剥离。例如，在结构化SONET中，区段和架空线路（可能更多）可能被剥离。需要一个框架来启用这种剥离。分数T1/E1应用的帧/有效负载对齐也需要它。"
    },
    {
      "indent": 7,
      "text": "o The PW must preserve the structure across the PSN so that the CE-bound NSP block can insert it correctly into the reconstructed unstructured bit stream. The stripped information (such as SONET pointer justifications) may appear in the encapsulation layer to facilitate this reconstitution.",
      "zh-CHS": "o PW必须跨PSN保留结构，以便绑定CE的NSP块可以将其正确插入重建的非结构化比特流中。剥离的信息（例如SONET指针对正）可能出现在封装层中，以促进这种重构。"
    },
    {
      "indent": 3,
      "text": "As an option, the Encapsulation Layer may also perform silence/idle suppression or similar compression on a structured bit stream.",
      "zh-CHS": "作为选项，封装层还可以对结构化比特流执行静默/空闲抑制或类似压缩。"
    },
    {
      "indent": 3,
      "text": "Structured bit streams are distinguished from cells in that the structures may be too long to be carried in a single packet. Note that \"short\" structures are indistinguishable from cells and may benefit from the use of methods described in section 3.3.2.",
      "zh-CHS": "结构化比特流与小区的区别在于结构可能太长，无法在单个分组中承载。请注意，“短”结构与单元无法区分，使用第3.3.2节中所述的方法可能会使其受益。"
    },
    {
      "indent": 3,
      "text": "This service requires sequencing and real-time support.",
      "zh-CHS": "此服务需要排序和实时支持。"
    },
    {
      "indent": 0,
      "text": "3.3.5. Principle of Minimum Intervention",
      "section_title": true,
      "zh-CHS": "3.3.5. 最低干预原则"
    },
    {
      "indent": 3,
      "text": "To minimize the scope of information, and to improve the efficiency of data flow through the Encapsulation Layer, the payload should be transported as received, with as few modifications as possible [RFC1958].",
      "zh-CHS": "为了最小化信息范围，并提高通过封装层的数据流的效率，有效载荷应在接收时进行传输，并进行尽可能少的修改[RFC1958]。"
    },
    {
      "indent": 3,
      "text": "This minimum intervention approach decouples payload development from PW development and requires fewer translations at the NSP in a system with similar CE interfaces at each end. It also prevents unwanted side effects due to subtle misrepresentation of the payload in the intermediate format.",
      "zh-CHS": "这种最小干预方法将有效载荷开发与PW开发分离，并且在两端具有类似CE接口的系统中，NSP需要较少的翻译。它还可以防止由于在中间格式中对有效负载的细微误报而产生不必要的副作用。"
    },
    {
      "indent": 3,
      "text": "An approach that does intervene can be more wire efficient in some cases and may result in fewer translations at the NSP whereby the CE interfaces are of different types. Any intermediate format effectively becomes a new framing type, requiring documentation and assured interoperability. This increases the amount of work for handling the protocol that the intermediate format carries and is undesirable.",
      "zh-CHS": "在某些情况下，确实进行干预的方法可能会更有效，并且可能会导致NSP中较少的转换，从而使CE接口具有不同的类型。任何中间格式都有效地成为一种新的框架类型，需要文档和有保证的互操作性。这增加了处理中间格式承载的协议的工作量，这是不可取的。"
    },
    {
      "indent": 0,
      "text": "4. Architecture of Pseudo Wires",
      "section_title": true,
      "zh-CHS": "4. 伪导线结构"
    },
    {
      "indent": 3,
      "text": "This section describes the PWE3 architectural model.",
      "zh-CHS": "本节介绍PWE3体系结构模型。"
    },
    {
      "indent": 0,
      "text": "4.1. Network Reference Model",
      "section_title": true,
      "zh-CHS": "4.1. 网络参考模型"
    },
    {
      "indent": 3,
      "text": "Figure 2 illustrates the network reference model for point-to-point PWs.",
      "zh-CHS": "图2说明了点到点PWs的网络参考模型。"
    },
    {
      "indent": 6,
      "text": "      |<-------------- Emulated Service ---------------->|\n      |                                                  |\n      |          |<------- Pseudo Wire ------>|          |\n      |          |                            |          |\n      |          |    |<-- PSN Tunnel -->|    |          |\n      |          V    V                  V    V          |\n      V    AC    +----+                  +----+     AC   V\n+-----+    |     | PE1|==================| PE2|     |    +-----+\n|     |----------|............PW1.............|----------|     |\n| CE1 |    |     |    |                  |    |     |    | CE2 |\n|     |----------|............PW2.............|----------|     |\n+-----+  ^ |     |    |==================|    |     | ^  +-----+\n      ^  |       +----+                  +----+     | |  ^\n      |  |   Provider Edge 1         Provider Edge 2  |  |\n      |  |                                            |  |\nCustomer |                                            | Customer\nEdge 1   |                                            | Edge 2\n         |                                            |\n         |                                            |\n   Native service                               Native service",
      "raw": true,
      "toc": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 19,
      "text": "Figure 2. PWE3 Network Reference Model",
      "zh-CHS": "图2。PWE3网络参考模型"
    },
    {
      "indent": 3,
      "text": "The two PEs (PE1 and PE2) have to provide one or more PWs on behalf of their client CEs (CE1 and CE2) to enable the client CEs to communicate over the PSN. A PSN tunnel is established to provide a data path for the PW. The PW traffic is invisible to the core network, and the core network is transparent to the CEs. Native data units (bits, cells, or packets) arrive via the AC, are encapsulated in a PW-PDU, and are carried across the underlying network via the PSN tunnel. The PEs perform the necessary encapsulation and decapsulation of PW-PDUs and handle any other functions required by the PW service, such as sequencing or timing.",
      "zh-CHS": "两个PE（PE1和PE2）必须代表其客户CE（CE1和CE2）提供一个或多个PW，以使客户CE能够通过PSN进行通信。建立PSN隧道，为PW提供数据路径。PW通信量对核心网络不可见，核心网络对CEs透明。本机数据单元（位、单元或数据包）通过AC到达，封装在PW-PDU中，并通过PSN隧道在底层网络中传输。PEs执行PW PDU的必要封装和去封装，并处理PW服务所需的任何其他功能，如排序或计时。"
    },
    {
      "indent": 0,
      "text": "4.2. PWE3 Pre-processing",
      "section_title": true,
      "zh-CHS": "4.2. PWE3预处理"
    },
    {
      "indent": 3,
      "text": "Some applications have to perform operations on the native data units received from the CE (including both payload and signaling traffic) before they are transmitted across the PW by the PE. Examples include Ethernet bridging, SONET cross-connect, translation of locally-significant identifiers such as VCI/VPI, or translation to another service type. These operations could be carried out in external equipment, and the processed data could be sent to the PE",
      "zh-CHS": "一些应用程序必须在从CE接收的本机数据单元（包括有效载荷和信令通信量）上执行操作，然后才能由PE通过PW进行传输。示例包括以太网桥接、SONET交叉连接、本地重要标识符（如VCI/VPI）的转换或到另一种服务类型的转换。这些操作可在外部设备中进行，处理后的数据可发送至PE"
    },
    {
      "indent": 3,
      "text": "over one or more physical interfaces. In most cases, could be in undertaking these operations within the PE provides cost and operational benefits. Processed data is then presented to the PW via a virtual interface within the PE. These pre-processing operations are included in the PWE3 reference model to provide a common reference point, but the detailed description of these operations is outside the scope of the PW definition given here.",
      "zh-CHS": "通过一个或多个物理接口。在大多数情况下，可在PE范围内开展这些业务，以提供成本和运营效益。然后，处理后的数据通过PE内的虚拟接口呈现给PW。这些预处理操作包含在PWE3参考模型中，以提供公共参考点，但这些操作的详细描述不在此处给出的PW定义的范围内。"
    },
    {
      "indent": 7,
      "text": "                PW\n             End Service\n                 |\n                 |<------- Pseudo Wire ------>|\n                 |                            |\n                 |    |<-- PSN Tunnel -->|    |\n                 V    V                  V    V     PW\n           +-----+----+                  +----+ End Service\n+-----+    |PREP | PE1|==================| PE2|     |    +-----+\n|     |    |     |............PW1.............|----------|     |\n| CE1 |----|     |    |                  |    |     |    | CE2 |\n|     | ^  |     |............PW2.............|----------|     |\n+-----+ |  |     |    |==================|    |     | ^  +-----+\n        |  +-----+----+                  +----+     | |\n        |        ^                                  | |\n        |        |                                  | |\n        |        |<------- Emulated Service ------->| |\n        |        |                                    |\n        | Virtual physical                            |\n        |  termination                                |\n        |        ^                                    |\n   CE1 native    |                                CE2 native\n    service      |                                service\n                 |\n            CE2 native\n             service",
      "raw": true,
      "toc": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 7,
      "text": "Figure 3. Pre-processing within the PWE3 Network Reference Model",
      "zh-CHS": "图3。PWE3网络参考模型内的预处理"
    },
    {
      "indent": 3,
      "text": "Figure 3 shows the interworking of one PE with pre-processing (PREP), and a second without this functionality. This reference point emphasizes that the functional interface between PREP and the PW is that represented by a physical interface carrying the service. This effectively defines the necessary inter-working specification.",
      "zh-CHS": "图3显示了一个PE与预处理（PREP）的互通，另一个PE没有此功能。该参考点强调，PREP和PW之间的功能接口由承载服务的物理接口表示。这有效地定义了必要的互操作规范。"
    },
    {
      "indent": 3,
      "text": "The operation of a system in which both PEs include PREP functionality is also supported.",
      "zh-CHS": "还支持系统的操作，其中两个PEs都包含PREP功能。"
    },
    {
      "indent": 3,
      "text": "The required pre-processing can be divided into two components:",
      "zh-CHS": "所需的预处理可分为两个部分："
    },
    {
      "indent": 7,
      "text": "o Forwarder (FWRD) o Native Service Processing (NSP)",
      "zh-CHS": "o 转发器（FWRD）o本机服务处理（NSP）"
    },
    {
      "indent": 0,
      "text": "4.2.1. Forwarders",
      "section_title": true,
      "zh-CHS": "4.2.1. 货代"
    },
    {
      "indent": 3,
      "text": "Some applications have to forward payload elements selectively from one or more ACs to one or more PWs. In such cases, there will also be a need to perform the inverse function on PWE3-PDUs received by a PE from the PSN. This is the function of the forwarder.",
      "zh-CHS": "一些应用程序必须有选择地将有效负载元素从一个或多个ACs转发到一个或多个PW。在这种情况下，还需要对PE从PSN接收到的PWE3 PDU执行反向功能。这是货代的职能。"
    },
    {
      "indent": 3,
      "text": "The forwarder selects the PW based on, for example, the incoming AC, the contents of the payload, or some statically and/or dynamically configured forwarding information.",
      "zh-CHS": "转发器基于例如传入AC、有效载荷的内容或一些静态和/或动态配置的转发器信息来选择PW。"
    },
    {
      "indent": 7,
      "text": "        +----------------------------------------+\n        |                PE Device               |\n        +----------------------------------------+\n Single |                 |                      |\n AC     |                 |        Single        | PW Instance\n<------>o   Forwarder     +      PW Instance     X<===========>\n        |                 |                      |\n        +----------------------------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 19,
      "text": "Figure 4a. Simple Point-to-Point Service",
      "zh-CHS": "图4a。简单点对点服务"
    },
    {
      "indent": 7,
      "text": "        +----------------------------------------+\n        |                PE Device               |\n        +----------------------------------------+\nMultiple|                 |        Single        | PW Instance\nAC      |                 +      PW Instance     X<===========>\n<------>o                 |                      |\n        |                 |----------------------|\n<------>o                 |        Single        | PW Instance\n        |    Forwarder    +      PW Instance     X<===========>\n<------>o                 |                      |\n        |                 |----------------------|\n<------>o                 |        Single        | PW Instance\n        |                 +      PW Instance     X<===========>\n<------>o                 |                      |\n        +----------------------------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 15,
      "text": "Figure 4b. Multiple AC to Multiple PW Forwarding",
      "zh-CHS": "图4b。多AC到多PW转发"
    },
    {
      "indent": 3,
      "text": "Figure 4a shows a simple forwarder that performs some type of filtering operation. Because the forwarder has a single input and a single output interface, filtering is the only type of forwarding",
      "zh-CHS": "图4a显示了一个执行某种过滤操作的简单转发器。因为转发器只有一个输入和一个输出接口，所以过滤是唯一的转发器类型"
    },
    {
      "indent": 3,
      "text": "operation that applies. Figure 4b shows a more general forwarding situation where payloads are extracted from one or more ACs and directed to one or more PWs. In this case filtering, direction, and combination operations may be performed on the payloads. For example, if the AC were Frame Relay, the forwarder might perform Frame Relay switching and the PW instances might be the inter-switch links.",
      "zh-CHS": "适用的操作。图4b显示了一种更一般的转发情况，其中有效负载从一个或多个ACs提取并定向到一个或多个PW。在这种情况下，可以对有效载荷执行滤波、方向和组合操作。例如，如果AC是帧中继，则转发器可能执行帧中继切换，而PW实例可能是交换机间链路。"
    },
    {
      "indent": 0,
      "text": "4.2.2. Native Service Processing",
      "section_title": true,
      "zh-CHS": "4.2.2. 本机服务处理"
    },
    {
      "indent": 3,
      "text": "Some applications required some form of data or address translation, or some other operation requiring knowledge of the semantics of the payload. This is the function of the Native Service Processor (NSP).",
      "zh-CHS": "一些应用程序需要某种形式的数据或地址转换，或者需要了解有效负载语义的其他操作。这是本机服务处理器（NSP）的功能。"
    },
    {
      "indent": 3,
      "text": "The use of the NSP approach simplifies the design of the PW by restricting a PW to homogeneous operation. NSP is included in the reference model to provide a defined interface to this functionality. The specification of the various types of NSP is outside the scope of PWE3.",
      "zh-CHS": "NSP方法的使用通过将PW限制为均质操作简化了PW的设计。NSP包含在参考模型中，以提供此功能的定义接口。各类NSP的规范不在PWE3的范围内。"
    },
    {
      "indent": 8,
      "text": "        +----------------------------------------+\n        |                PE Device               |\nMultiple+----------------------------------------+\nAC      |      |          |        Single        | PW Instance\n<------>o  NSP #          +      PW Instance     X<===========>\n        |      |          |                      |\n        |------|          |----------------------|\n        |      |          |        Single        | PW Instance\n<------>o  NSP #Forwarder +      PW Instance     X<===========>\n        |      |          |                      |\n        |------|          |----------------------|\n        |      |          |        Single        | PW Instance\n<------>o  NSP #          +      PW Instance     X<===========>\n        |      |          |                      |\n        +----------------------------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 10,
      "text": "Figure 5. NSP in a Multiple AC to Multiple PW Forwarding PE",
      "zh-CHS": "图5。多AC到多PW转发PE中的NSP"
    },
    {
      "indent": 3,
      "text": "Figure 5 illustrates the relationship between NSP, forwarder, and PWs in a PE. The NSP function may apply any transformation operation (modification, injection, etc.) on the payloads as they pass between the physical interface to the CE and the virtual interface to the forwarder. These transformation operations will, of course, be limited to those that have been implemented in the data path, and that are enabled by the PE configuration. A PE device may contain more than one forwarder.",
      "zh-CHS": "图5说明了PE中NSP、转发器和PWs之间的关系。NSP功能可在有效载荷在物理接口与CE之间和虚拟接口与转发器之间传递时，对有效载荷应用任何转换操作（修改、注入等）。当然，这些转换操作将仅限于那些已经在数据路径中实现并由PE配置启用的操作。PE设备可能包含多个转发器。"
    },
    {
      "indent": 3,
      "text": "This model also supports the operation of a system in which the NSP functionality includes terminating the data-link, and the application of Network Layer processing to the payload.",
      "zh-CHS": "该模型还支持系统的运行，其中NSP功能包括终止数据链路，以及对有效负载应用网络层处理。"
    },
    {
      "indent": 0,
      "text": "4.3. Maintenance Reference Model",
      "section_title": true,
      "zh-CHS": "4.3. 维修参考模型"
    },
    {
      "indent": 3,
      "text": "Figure 6 illustrates the maintenance reference model for PWs.",
      "zh-CHS": "图6说明了PWs的维护参考模型。"
    },
    {
      "indent": 7,
      "text": "      |<------- CE (end-to-end) Signaling ------>|\n      |     |<---- PW/PE Maintenance ----->|     |\n      |     |     |<-- PSN Tunnel -->|     |     |\n      |     |     |    Signaling     |     |     |\n      |     V     V  (out of scope)  V     V     |\n      v     +-----+                  +-----+     v\n+-----+     | PE1 |==================| PE2 |     +-----+\n|     |-----|.............PW1..............|-----|     |\n| CE1 |     |     |                  |     |     | CE2 |\n|     |-----|.............PW2..............|-----|     |\n+-----+     |     |==================|     |     +-----+\n            +-----+                  +-----+\nCustomer   Provider                 Provider     Customer\n Edge 1     Edge 1                   Edge 2       Edge 2",
      "raw": true,
      "toc": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 18,
      "text": "Figure 6. PWE3 Maintenance Reference Model",
      "zh-CHS": "图6。PWE3维修参考模型"
    },
    {
      "indent": 3,
      "text": "The following signaling mechanisms are required:",
      "zh-CHS": "需要以下信号机制："
    },
    {
      "indent": 7,
      "text": "o The CE (end-to-end) signaling is between the CEs. This signaling could be Frame Relay PVC status signaling, ATM SVC signaling, TDM CAS signaling, etc.",
      "zh-CHS": "o CE（端到端）信令在CEs之间。该信令可以是帧中继PVC状态信令、ATM SVC信令、TDM CAS信令等。"
    },
    {
      "indent": 7,
      "text": "o The PW/PE Maintenance is used between the PEs (or NSPs) to set up, maintain, and tear down PWs, including any required coordination of parameters.",
      "zh-CHS": "o PW/PE维护用于PEs（或NSPs）之间，以设置、维护和拆除PWs，包括任何所需的参数协调。"
    },
    {
      "indent": 7,
      "text": "o The PSN Tunnel signaling controls the PW multiplexing and some elements of the underlying PSN. Examples are L2TP control protocol, MPLS LDP, and RSVP-TE. The definition of the information that PWE3 needs signaled is within the scope of PWE3, but the signaling protocol itself is not.",
      "zh-CHS": "o PSN隧道信令控制PW多路复用和底层PSN的某些元素。例如L2TP控制协议、MPLS LDP和RSVP-TE。PWE3需要发送信号的信息的定义在PWE3的范围内，但信令协议本身不在PWE3的范围内。"
    },
    {
      "indent": 0,
      "text": "4.4. Protocol Stack Reference Model",
      "section_title": true,
      "zh-CHS": "4.4. 协议栈参考模型"
    },
    {
      "indent": 3,
      "text": "Figure 7 illustrates the protocol stack reference model for PWs.",
      "zh-CHS": "图7说明了PWs的协议栈参考模型。"
    },
    {
      "indent": 4,
      "text": "+-----------------+                           +-----------------+\n|Emulated Service |                           |Emulated Service |\n|(e.g., TDM, ATM) |<==== Emulated Service ===>|(e.g., TDM, ATM) |\n+-----------------+                           +-----------------+\n|    Payload      |                           |    Payload      |\n|  Encapsulation  |<====== Pseudo Wire ======>|  Encapsulation  |\n+-----------------+                           +-----------------+\n|PW Demultiplexer |                           |PW Demultiplexer |\n|   PSN Tunnel,   |<======= PSN Tunnel ======>|  PSN Tunnel,    |\n| PSN & Physical  |                           | PSN & Physical  |\n|     Layers      |                           |    Layers       |\n+-------+---------+        ___________        +---------+-------+\n        |                /             \\                |\n        +===============/     PSN       \\===============+\n                        \\               /\n                         \\_____________/",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 15,
      "text": "Figure 7. PWE3 Protocol Stack Reference Model",
      "zh-CHS": "图7。PWE3协议栈参考模型"
    },
    {
      "indent": 3,
      "text": "The PW provides the CE with an emulated physical or virtual connection to its peer at the far end. Native service PDUs from the CE are passed through an Encapsulation Layer at the sending PE and then sent over the PSN. The receiving PE removes the encapsulation and restores the payload to its native format for transmission to the destination CE.",
      "zh-CHS": "PW为CE提供一个模拟的物理或虚拟连接，连接到远端的对等方。来自CE的本机服务PDU通过发送PE的封装层，然后通过PSN发送。接收PE移除封装并将有效负载恢复为其本机格式，以便传输到目的地CE。"
    },
    {
      "indent": 0,
      "text": "4.5. Pre-processing Extension to Protocol Stack Reference Model",
      "section_title": true,
      "zh-CHS": "4.5. 协议栈参考模型的预处理扩展"
    },
    {
      "indent": 3,
      "text": "Figure 8 illustrates how the protocol stack reference model is extended to include the provision of pre-processing (forwarding and NSP). This shows the placement of the physical interface relative to the CE.",
      "zh-CHS": "图8说明了如何扩展协议栈参考模型，以包括提供预处理（转发和NSP）。这显示了物理接口相对于CE的位置。"
    },
    {
      "indent": 3,
      "text": "  /======================================\\\n  H             Forwarder                H<----Pre-processing\n  H----------------======================/\n  H Native Service H   |                 |\n  H  Processing    H   |                 |\n  \\================/   |                 |\n  |                |   | Emulated        |\n  | Service        |   | Service         |\n  | Interface      |   | (TDM, ATM,      |\n  | (TDM, ATM,     |   | Ethernet,       |<== Emulated Service ==\n  | Ethernet,      |   | Frame Relay,    |\n  | Frame Relay,   |   | etc.)           |\n  | etc.)          |   +-----------------+\n  |                |   |    Payload      |\n  |                |   | Encapsulation   |<=== Pseudo Wire ======\n  |                |   +-----------------+\n  |                |   |PW Demultiplexer |\n  |                |   |  PSN Tunnel,    |\n  |                |   | PSN & Physical  |<=== PSN Tunnel =======\n  |                |   |    Headers      |\n  +----------------+   +-----------------+\n  |   Physical     |   |   Physical      |\n  +-------+--------+   +-------+---------+\n          |                    |\n          |                    |\n          |                    |\n          |                    |\n          |                    |\n          |                    |\nTo CE <---+                    +---> To PSN",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 7,
      "text": "Figure 8. Protocol Stack Reference Model with Pre-processing",
      "zh-CHS": "图8。带预处理的协议栈参考模型"
    },
    {
      "indent": 0,
      "text": "5. PW Encapsulation",
      "section_title": true,
      "zh-CHS": "5. PW封装"
    },
    {
      "indent": 3,
      "text": "The PW Encapsulation Layer provides the necessary infrastructure to adapt the specific payload type being transported over the PW to the PW Demultiplexer Layer used to carry the PW over the PSN.",
      "zh-CHS": "PW封装层提供必要的基础设施，以使通过PW传输的特定有效负载类型适应用于在PSN上传输PW的PW解复用器层。"
    },
    {
      "indent": 3,
      "text": "The PW Encapsulation Layer consists of three sub-layers:",
      "zh-CHS": "PW封装层由三个子层组成："
    },
    {
      "indent": 7,
      "text": "o Payload Convergence o Timing o Sequencing",
      "zh-CHS": "o 有效载荷收敛o定时o排序"
    },
    {
      "indent": 3,
      "text": "The PW Encapsulation sub-layering and its context with the protocol stack are shown in Figure 9.",
      "zh-CHS": "PW封装子层及其与协议栈的上下文如图9所示。"
    },
    {
      "indent": 10,
      "text": "+---------------------------+\n|         Payload           |\n/===========================\\ <------ Encapsulation\nH    Payload Convergence    H         Layer\nH---------------------------H\nH          Timing           H\nH---------------------------H\nH        Sequencing         H\n\\===========================/\n|     PW Demultiplexer      |\n+---------------------------+\n|     PSN Convergence       |\n+---------------------------+\n|           PSN             |\n+---------------------------+\n|         Data-Link         |\n+---------------------------+\n|          Physical         |\n+---------------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 18,
      "text": "Figure 9. PWE3 Encapsulation Layer in Context",
      "zh-CHS": "图9。上下文中的PWE3封装层"
    },
    {
      "indent": 3,
      "text": "The Payload Convergence sub-layer is highly tailored to the specific payload type. However grouping a number of target payload types into a generic class, and then providing a single convergence sub-layer type common to the group, reduces the number of payload convergence sub-layer types. This decreases implementation complexity. The provision of per-packet signaling and other out-of-band information (other than sequencing or timing) is undertaken by this layer.",
      "zh-CHS": "有效负载聚合子层高度定制为特定的有效负载类型。然而，将多个目标有效负载类型分组到一个泛型类中，然后提供一个组通用的聚合子层类型，减少了有效负载聚合子层类型的数量。这降低了实现的复杂性。该层负责提供每包信令和其他带外信息（序列或定时除外）。"
    },
    {
      "indent": 3,
      "text": "The Timing and Sequencing Layers provide generic services to the Payload Convergence Layer for all payload types that require them.",
      "zh-CHS": "定时和排序层为需要它们的所有有效负载类型的有效负载聚合层提供通用服务。"
    },
    {
      "indent": 0,
      "text": "5.1. Payload Convergence Layer",
      "section_title": true,
      "zh-CHS": "5.1. 有效载荷汇聚层"
    },
    {
      "indent": 0,
      "text": "5.1.1. Encapsulation",
      "section_title": true,
      "zh-CHS": "5.1.1. 封装"
    },
    {
      "indent": 3,
      "text": "The primary task of the Payload Convergence Layer is the encapsulation of the payload in PW-PDUs. The native data units to be encapsulated may contain an L2 header or L1 overhead. This is service specific. The Payload Convergence header carries the additional information needed to replay the native data units at the CE-bound physical interface. The PW Demultiplexer header is not considered part of the PW header.",
      "zh-CHS": "有效载荷聚合层的主要任务是将有效载荷封装在PW PDU中。要封装的本机数据单元可以包含L2报头或L1开销。这是特定于服务的。有效负载聚合报头携带在绑定CE的物理接口上重播本机数据单元所需的附加信息。PW解复用器报头不被视为PW报头的一部分。"
    },
    {
      "indent": 3,
      "text": "Not all the additional information needed to replay the native data units have to be carried in the PW header of the PW PDUs. Some information (e.g., service type of a PW) may be stored as state information at the destination PE during PW set up.",
      "zh-CHS": "并非回放本机数据单元所需的所有附加信息都必须包含在PW PDU的PW头中。在PW设置期间，一些信息（例如，PW的服务类型）可以作为状态信息存储在目的地PE。"
    },
    {
      "indent": 0,
      "text": "5.1.2. PWE3 Channel Types",
      "section_title": true,
      "zh-CHS": "5.1.2. PWE3通道类型"
    },
    {
      "indent": 3,
      "text": "The PW Encapsulation Layer and its associated signaling require one or more of the following types of channels from its underlying PW Demultiplexer and PSN Layers (channel type 1 plus one or more of channel types 2 through 4):",
      "zh-CHS": "PW封装层及其相关信令需要来自其底层PW解复用器和PSN层的以下一种或多种信道类型（信道类型1加上信道类型2到4中的一种或多种）："
    },
    {
      "indent": 3,
      "text": "1. A reliable control channel for signaling line events, status indications, and, in exceptional cases, CE-CE events that must be translated and sent reliably between PEs. PWE3 may need this type of control channel to provide faithful emulation of complex data-link protocols.",
      "zh-CHS": "1. 可靠的控制通道，用于发送线路事件、状态指示，以及在特殊情况下，必须在PEs之间可靠转换和发送的CE-CE事件。PWE3可能需要这种类型的控制通道来提供复杂数据链路协议的可靠仿真。"
    },
    {
      "indent": 3,
      "text": "2. A high-priority, unreliable, sequenced channel. A typical use is for CE-to-CE signaling. \"High priority\" may simply be indicated via the DSCP bits for IP or the EXP bits for MPLS, giving the packet priority during transit. This channel type could also use a bit in the tunnel header itself to indicate that packets received at the PE should be processed with higher priority [RFC2474].",
      "zh-CHS": "2. 高优先级、不可靠、有序的通道。典型的用途是CE到CE信令。“高优先级”可以简单地通过用于IP的DSCP位或用于MPLS的EXP位来指示，从而在传输期间给予分组优先级。这种信道类型还可以使用隧道报头本身中的一个位来指示在PE接收的数据包应以更高的优先级进行处理[RFC2474]。"
    },
    {
      "indent": 3,
      "text": "3. A sequenced channel for data traffic that is sensitive to packet reordering (one classification for use could be for any non-IP traffic).",
      "zh-CHS": "3. 对数据包重新排序敏感的数据通信的顺序通道（一种分类可用于任何非IP通信）。"
    },
    {
      "indent": 3,
      "text": "4. An unsequenced channel for data traffic insensitive to packet order.",
      "zh-CHS": "4. 数据通信的未排序通道，对数据包顺序不敏感。"
    },
    {
      "indent": 3,
      "text": "The data channels (2, 3, and 4 above) should be carried \"in band\" with one another to as much of a degree as is reasonably possible on a PSN.",
      "zh-CHS": "数据信道（上面的2、3和4）应在PSN上以合理可能的程度相互“带内”传输。"
    },
    {
      "indent": 3,
      "text": "Where end-to-end connectivity may be disrupted by address translation [RFC3022], access-control lists, firewalls, etc., the control channel may be able to pass traffic and setup the PW, while the PW data traffic is blocked by one or more of these mechanisms. In these cases unless the control channel is also carried \"in band\", the signaling to set up the PW will not confirm the existence of an end-to-end data path. In some cases there is a need to synchronize CE events with the data carried over a PW. This is especially the case",
      "zh-CHS": "当端到端连接可能因地址转换[RFC3022]、访问控制列表、防火墙等而中断时，控制通道可能能够传递通信量并设置PW，而PW数据通信量则被一个或多个机制阻塞。在这些情况下，除非控制信道也在“带内”承载，否则设置PW的信令将不会确认端到端数据路径的存在。在某些情况下，需要将CE事件与PW上携带的数据同步。尤其如此"
    },
    {
      "indent": 3,
      "text": "with TDM circuits (e.g., the on-hook/off-hook events in PSTN switches might be carried over a reliable control channel whereas the associated bit stream is carried over a sequenced data channel).",
      "zh-CHS": "使用TDM电路（例如，PSTN交换机中的挂机/摘机事件可能通过可靠的控制信道进行传输，而相关的比特流通过顺序数据信道进行传输）。"
    },
    {
      "indent": 3,
      "text": "PWE3 channel types that are not needed by the supported PWs need not be included in such an implementation.",
      "zh-CHS": "支持的PWs不需要的PWE3信道类型不需要包括在这样的实现中。"
    },
    {
      "indent": 0,
      "text": "5.1.3. Quality of Service Considerations",
      "section_title": true,
      "zh-CHS": "5.1.3. 服务质素考虑"
    },
    {
      "indent": 3,
      "text": "Where possible, it is desirable to employ mechanisms to provide PW Quality of Service (QoS) support over PSNs.",
      "zh-CHS": "在可能的情况下，希望采用机制在PSN上提供PW服务质量（QoS）支持。"
    },
    {
      "indent": 0,
      "text": "5.2. Payload-Independent PW Encapsulation Layers",
      "section_title": true,
      "zh-CHS": "5.2. 有效载荷无关的PW封装层"
    },
    {
      "indent": 3,
      "text": "Two PWE3 Encapsulation sub-layers provide common services to all payload types: Sequencing and Timing. These services are optional and are only used if a particular PW instance needs them. If the service is not needed, the associated header may be omitted in order to conserve processing and network resources.",
      "zh-CHS": "两个PWE3封装子层为所有有效负载类型提供公共服务：排序和定时。这些服务是可选的，仅在特定PW实例需要时使用。如果不需要该服务，则可以省略相关联的报头以节省处理和网络资源。"
    },
    {
      "indent": 3,
      "text": "Sometimes a specific payload type will require transport with or without sequence and/or real-time support. For example, an invariant of Frame Relay transport is the preservation of packet order. Some Frame Relay applications expect delivery in order and may not cope with reordering of the frames. However, where the Frame Relay service is itself only being used to carry IP, it may be desirable to relax this constraint to reduce per-packet processing cost.",
      "zh-CHS": "有时，特定的有效负载类型将需要有或无顺序和/或实时支持的传输。例如，帧中继传输的一个不变量是保持数据包顺序。一些帧中继应用程序希望按顺序交付，可能无法处理帧的重新排序。然而，在帧中继服务本身仅被用于承载IP的情况下，可能希望放松该约束以降低每个分组的处理成本。"
    },
    {
      "indent": 3,
      "text": "The guiding principle is that, when possible, an existing IETF protocol should be used to provide these services. When a suitable protocol is not available, the existing protocol should be extended or modified to meet the PWE3 requirements, thereby making that protocol available for other IETF uses. In the particular case of timing, more than one general method may be necessary to provide for the full scope of payload timing requirements.",
      "zh-CHS": "指导原则是，在可能的情况下，应使用现有的IETF协议来提供这些服务。当没有合适的协议可用时，应扩展或修改现有协议以满足PWE3要求，从而使该协议可用于其他IETF用途。在特定的定时情况下，可能需要一种以上的通用方法来提供有效载荷定时要求的全部范围。"
    },
    {
      "indent": 0,
      "text": "5.2.1. Sequencing",
      "section_title": true,
      "zh-CHS": "5.2.1. 排序"
    },
    {
      "indent": 3,
      "text": "The sequencing function provides three services: frame ordering, frame duplication detection, and frame loss detection. These services allow the emulation of the invariant properties of a physical wire. Support for sequencing depends on the payload type and may be omitted if it is not needed.",
      "zh-CHS": "排序功能提供三种服务：帧排序、帧重复检测和帧丢失检测。这些服务允许模拟物理导线的不变特性。对排序的支持取决于有效负载类型，如果不需要，可以省略。"
    },
    {
      "indent": 3,
      "text": "The size of the sequence-number space depends on the speed of the emulated service, and on the maximum time of the transient conditions in the PSN. A sequence number space greater than 2^16 may therefore be needed to prevent the sequence number space from wrapping during the transient.",
      "zh-CHS": "序列号空间的大小取决于模拟服务的速度以及PSN中瞬态条件的最长时间。因此，可能需要大于2^16的序列号空间，以防止序列号空间在瞬态期间缠绕。"
    },
    {
      "indent": 0,
      "text": "5.2.1.1. Frame Ordering",
      "section_title": true,
      "zh-CHS": "5.2.1.1. 帧排序"
    },
    {
      "indent": 3,
      "text": "When packets carrying the PW-PDUs traverse a PSN, they may arrive out of order at the destination PE. For some services, the frames (control frames, data frames, or both) must be delivered in order. For these services, some mechanism must be provided for ensuring in-order delivery. Providing a sequence number in the sequence sub-layer header for each packet is one possible approach. Alternatively, it can be noted that sequencing is a subset of the problem of delivering timed packets, and that a single combined mechanism such as [RFC3550] may be employed.",
      "zh-CHS": "当携带PW pdu的分组穿过PSN时，它们可能会无序地到达目的地PE。对于某些服务，帧（控制帧、数据帧或两者）必须按顺序交付。对于这些服务，必须提供一些机制来确保有序交付。在序列子层报头中为每个分组提供序列号是一种可能的方法。或者，可以注意到，排序是传递定时分组的问题的子集，并且可以采用诸如[RFC3550]的单个组合机制。"
    },
    {
      "indent": 3,
      "text": "There are two possible misordering strategies:",
      "zh-CHS": "有两种可能的错误排序策略："
    },
    {
      "indent": 7,
      "text": "o Drop misordered PW PDUs.",
      "zh-CHS": "o 丢弃错误订购的PW PDU。"
    },
    {
      "indent": 7,
      "text": "o Try to sort PW PDUs into the correct order.",
      "zh-CHS": "o 尝试将PW PDU排序为正确的顺序。"
    },
    {
      "indent": 3,
      "text": "The choice of strategy will depend on",
      "zh-CHS": "战略的选择将取决于"
    },
    {
      "indent": 7,
      "text": "o how critical the loss of packets is to the operation of the PW (e.g., the acceptable bit error rate),",
      "zh-CHS": "o 数据包丢失对PW操作的重要性（例如，可接受的误码率），"
    },
    {
      "indent": 7,
      "text": "o the speeds of the PW and PSN,",
      "zh-CHS": "o PW和PSN的速度，"
    },
    {
      "indent": 7,
      "text": "o the acceptable delay (as delay must be introduced to reorder), and",
      "zh-CHS": "o 可接受的延迟（因为重新订购时必须引入延迟），以及"
    },
    {
      "indent": 7,
      "text": "o the expected incidence of misordering.",
      "zh-CHS": "o 错误排序的预期发生率。"
    },
    {
      "indent": 0,
      "text": "5.2.1.2. Frame Duplication Detection",
      "section_title": true,
      "zh-CHS": "5.2.1.2. 帧重复检测"
    },
    {
      "indent": 3,
      "text": "In rare cases, packets traversing a PW may be duplicated by the underlying PSN. For some services, frame duplication is not acceptable. For these services, some mechanism must be provided to ensure that duplicated frames will not be delivered to the destination CE. The mechanism may be the same as that used to ensure in-order frame delivery.",
      "zh-CHS": "在极少数情况下，穿越PW的数据包可能被底层PSN复制。对于某些服务，帧复制是不可接受的。对于这些服务，必须提供一些机制，以确保复制的帧不会传递到目标CE。该机制可能与用于确保有序框架交付的机制相同。"
    },
    {
      "indent": 0,
      "text": "5.2.1.3. Frame Loss Detection",
      "section_title": true,
      "zh-CHS": "5.2.1.3. 帧丢失检测"
    },
    {
      "indent": 3,
      "text": "A destination PE can determine whether a frame has been lost by tracking the sequence numbers of the PW PDUs received.",
      "zh-CHS": "目的地PE可以通过跟踪接收到的PW pdu的序列号来确定帧是否丢失。"
    },
    {
      "indent": 3,
      "text": "In some instances, if a PW PDU fails to arrive within a certain time, a destination PE will have to presume that it is lost. If a PW-PDU that has been processed as lost subsequently arrives, the destination PE must discard it.",
      "zh-CHS": "在某些情况下，如果PW PDU未能在特定时间内到达，则目的地PE必须假定其丢失。如果处理为丢失的PW-PDU随后到达，则目标PE必须将其丢弃。"
    },
    {
      "indent": 0,
      "text": "5.2.2. Timing",
      "section_title": true,
      "zh-CHS": "5.2.2. 时机"
    },
    {
      "indent": 3,
      "text": "A number of native services have timing expectations based on the characteristics of the networks they were designed to travel over. The emulated service may have to duplicate these network characteristics as closely as possible: e.g., in delivering native traffic with bitrate, jitter, wander, and delay characteristics similar to those received at the sending PE.",
      "zh-CHS": "许多本机服务基于其设计用于传输的网络的特性具有定时期望。模拟服务可能必须尽可能地复制这些网络特性：例如，在传送具有比特率、抖动、漂移和延迟特性的本机流量时，这些特性与在发送PE接收到的特性相似。"
    },
    {
      "indent": 3,
      "text": "In such cases, the receiving PE has to play out the native traffic as it was received at the sending PE. This relies on timing information either sent between the two PEs, or in some cases received from an external reference.",
      "zh-CHS": "在这种情况下，接收PE必须播放在发送PE接收的本机流量。这取决于两个PE之间发送的定时信息，或者在某些情况下从外部参考接收的定时信息。"
    },
    {
      "indent": 3,
      "text": "Therefore, Timing Sub-layer must support two timing functions: clock recovery and timed payload delivery. A particular payload type may require either or both of these services.",
      "zh-CHS": "因此，定时子层必须支持两个定时功能：时钟恢复和定时有效负载交付。特定的有效负载类型可能需要这两种服务中的一种或两种。"
    },
    {
      "indent": 0,
      "text": "5.2.2.1. Clock Recovery",
      "section_title": true,
      "zh-CHS": "5.2.2.1. 时钟恢复"
    },
    {
      "indent": 3,
      "text": "Clock recovery is the extraction of output transmission bit timing information from the delivered packet stream, and it requires a suitable mechanism. A physical wire carries the timing information natively, but extracting timing from a highly jittered source, such as packet stream, is a relatively complex task. Therefore, it is desirable that an existing real-time protocol such as [RFC3550] be used for this purpose, unless it can be shown that this is unsuitable or unnecessary for a particular payload type.",
      "zh-CHS": "时钟恢复是从传送的分组流中提取输出传输比特定时信息，它需要合适的机制。物理线路本机携带定时信息，但从高度抖动的源（如数据包流）提取定时是一项相对复杂的任务。因此，期望将诸如[RFC3550]的现有实时协议用于此目的，除非可以证明这对于特定有效负载类型不合适或不必要。"
    },
    {
      "indent": 0,
      "text": "5.2.2.2. Timed Delivery",
      "section_title": true,
      "zh-CHS": "5.2.2.2. 定时交货"
    },
    {
      "indent": 3,
      "text": "Timed delivery is the delivery of non-contiguous PW PDUs to the PW output interface with a constant phase relative to the input interface. The timing of the delivery may be relative to a clock derived from the packet stream received over the PSN clock recovery, or to an external clock.",
      "zh-CHS": "定时传送是将非连续PW PDU传送到PW输出接口，相对于输入接口具有恒定相位。传送的定时可以是相对于从通过PSN时钟恢复接收的分组流导出的时钟，或者相对于外部时钟。"
    },
    {
      "indent": 0,
      "text": "5.3. Fragmentation",
      "section_title": true,
      "zh-CHS": "5.3. 碎裂"
    },
    {
      "indent": 3,
      "text": "Ideally, a payload would be relayed across the PW as a single unit. However, there will be cases where the combined size of the payload and its associated PWE3 and PSN headers will exceed the PSN path MTU. When a packet size exceeds the MTU of a given network, fragmentation and reassembly have to be performed for the packet to be delivered. Since fragmentation and reassembly generally consume considerable network resources, as compared to simply switching a packet in its entirety, the need for fragmentation and reassembly throughout a network should be reduced or eliminated to the extent possible. Of particular concern for fragmentation and reassembly are aggregation points where large numbers of PWs are processed (e.g., at the PE).",
      "zh-CHS": "理想情况下，有效载荷将作为单个单元在PW上中继。然而，在某些情况下，有效负载及其相关PWE3和PSN报头的组合大小将超过PSN路径MTU。当数据包大小超过给定网络的MTU时，必须对要传送的数据包执行分段和重新组装。由于碎片和重组通常消耗相当多的网络资源，与简单地交换整个分组相比，应该尽可能减少或消除在整个网络中对碎片和重组的需求。碎片和重新组装特别关注的是聚集点，其中处理了大量PW（例如，在PE处）。"
    },
    {
      "indent": 3,
      "text": "Ideally, the equipment originating the traffic sent over the PW will have adaptive measures in place (e.g., [RFC1191], [RFC1981]) that ensure that packets needing to be fragmented are not sent. When this fails, the point closest to the sending host with fragmentation and reassembly capabilities should attempt to reduce the size of packets to satisfy the PSN MTU. Thus, in the reference model for PWE3 (Figure 3), fragmentation should first be performed at the CE if possible. Only if the CE cannot adhere to an acceptable MTU size for the PW should the PE attempt its own fragmentation method.",
      "zh-CHS": "理想情况下，发起通过PW发送的业务的设备将具有适当的自适应措施（例如，[RFC1191]、[RFC1981]），以确保不发送需要分段的数据包。当此操作失败时，距离发送主机最近且具有碎片和重组功能的点应尝试减小数据包的大小，以满足PSN MTU的要求。因此，在PWE3的参考模型（图3）中，如果可能，应首先在CE处执行碎片化。只有当CE无法遵守PW的可接受MTU大小时，PE才应尝试其自己的分段方法。"
    },
    {
      "indent": 3,
      "text": "In cases where MTU management fails to limit the payload to a size suitable for transmission of the PW, the PE may fall back to either a generic PW fragmentation method or, if available, the fragmentation service of the underlying PSN.",
      "zh-CHS": "在MTU管理未能将有效载荷限制到适合于PW传输的大小的情况下，PE可退回到通用PW分段方法或基础PSN的分段服务（如果可用）。"
    },
    {
      "indent": 3,
      "text": "It is acceptable for a PE implementation not to support fragmentation. A PE that does not will drop packets that exceed the PSN MTU, and the management plane of the encapsulating PE may be notified.",
      "zh-CHS": "PE实现不支持分段是可以接受的。不会丢弃超过PSN MTU的分组的PE，并且可以通知封装PE的管理平面。"
    },
    {
      "indent": 3,
      "text": "If the length of a L2/L1 frame, restored from a PW PDU, exceeds the MTU of the destination AC, it must be dropped. In this case, the management plane of the destination PE may be notified.",
      "zh-CHS": "如果从PW PDU恢复的L2/L1帧的长度超过目标AC的MTU，则必须丢弃该帧。在这种情况下，可以通知目的地PE的管理平面。"
    },
    {
      "indent": 0,
      "text": "5.4. Instantiation of the Protocol Layers",
      "section_title": true,
      "zh-CHS": "5.4. 协议层的实例化"
    },
    {
      "indent": 3,
      "text": "This document does not address the detailed mapping of the Protocol Layering model to existing or future IETF standards. The instantiation of the logical Protocol Layering model is shown in Figure 9.",
      "zh-CHS": "本文件不涉及协议分层模型到现有或未来IETF标准的详细映射。逻辑协议分层模型的实例化如图9所示。"
    },
    {
      "indent": 0,
      "text": "5.4.1. PWE3 over an IP PSN",
      "section_title": true,
      "zh-CHS": "5.4.1. IP PSN上的PWE3"
    },
    {
      "indent": 3,
      "text": "The protocol definition of PWE3 over an IP PSN should employ existing IETF protocols where possible.",
      "zh-CHS": "IP PSN上PWE3的协议定义应尽可能采用现有的IETF协议。"
    },
    {
      "indent": 7,
      "text": "+---------------------+              +-------------------------+\n|      Payload        |------------->| Raw payload if possible |\n/=====================\\              +-------------------------+\nH Payload Convergence H-----------+->|     Flags, seq #, etc.  |\nH---------------------H          /   +-------------------------+\nH       Timing        H---------/--->|            RTP          |\nH---------------------H        /     +-------------+           |\nH     Sequencing      H----one of    |             |\n\\=====================/        \\     |             +-----------+\n|  PW Demultiplexer   |---------+--->|     L2TP, MPLS, etc.    |\n+---------------------+              +-------------------------+\n|  PSN Convergence    |------------->|       Not needed        |\n+---------------------+              +-------------------------+\n|        PSN          |------------->|            IP           |\n+---------------------+              +-------------------------+\n|      Data-Link      |------------->|         Data-link       |\n+---------------------+              +-------------------------+\n|       Physical      |------------->|          Physical       |\n+---------------------+              +-------------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 24,
      "text": "Figure 10. PWE3 over an IP PSN",
      "zh-CHS": "图10。IP PSN上的PWE3"
    },
    {
      "indent": 3,
      "text": "Figure 10 shows the protocol layering for PWE3 over an IP PSN. As a rule, the payload should be carried as received from the NSP, with the Payload Convergence Layer provided when needed. However, in certain circumstances it may be justifiable to transmit the payload in some processed form. The reasons for this must be documented in the Encapsulation Layer definition for that payload type.",
      "zh-CHS": "图10显示了IP PSN上PWE3的协议分层。通常，有效载荷应按照从NSP接收的信息进行携带，并在需要时提供有效载荷聚合层。然而，在某些情况下，以某种处理形式传输有效载荷可能是合理的。这种情况的原因必须记录在该有效负载类型的封装层定义中。"
    },
    {
      "indent": 3,
      "text": "Where appropriate, explicit timing is provided by RTP [RFC3550], which, when used, also provides a sequencing service. When the PSN is UDP/IP, the RTP header follows the UDP header and precedes the PW control field. For all other cases the RTP header follows the PW control header.",
      "zh-CHS": "在适当的情况下，RTP[RFC3550]提供显式定时，在使用时，RTP还提供排序服务。当PSN为UDP/IP时，RTP报头跟随UDP报头并位于PW控制字段之前。对于所有其他情况，RTP标头跟随PW控制标头。"
    },
    {
      "indent": 3,
      "text": "The encapsulation layer may additionally carry a sequence number. Sequencing is to be provided either by RTP or by the PW encapsulation layer, but not by both.",
      "zh-CHS": "封装层还可以携带序列号。排序由RTP或PW封装层提供，但不能同时由两者提供。"
    },
    {
      "indent": 3,
      "text": "PW Demultiplexing is provided by the PW label, which may take the form specified in a number of IETF protocols; e.g., an MPLS label [MPLSIP], an L2TP session ID [RFC3931], or a UDP port number [RFC768]. When PWs are carried over IP, the PSN Convergence Layer will not be needed.",
      "zh-CHS": "PW解复用由PW标签提供，PW标签可以采用许多IETF协议中规定的形式；e、 例如，MPLS标签[MPLSIP]、L2TP会话ID[RFC3931]或UDP端口号[RFC768]。当PWs通过IP传输时，不需要PSN汇聚层。"
    },
    {
      "indent": 3,
      "text": "As a special case, if the PW Demultiplexer is an MPLS label, the protocol architecture of section 5.4.2 can be used instead of the protocol architecture of this section.",
      "zh-CHS": "作为特例，如果PW解复用器是MPLS标签，则可以使用第5.4.2节的协议体系结构代替本节的协议体系结构。"
    },
    {
      "indent": 0,
      "text": "5.4.2. PWE3 over an MPLS PSN",
      "section_title": true,
      "zh-CHS": "5.4.2. MPLS PSN上的PWE3"
    },
    {
      "indent": 3,
      "text": "The MPLS ethos places importance on wire efficiency. By using a control word, some components of the PWE3 protocol layers can be compressed to increase this efficiency.",
      "zh-CHS": "MPLS的精神强调布线效率。通过使用控制字，可以压缩PWE3协议层的一些组件以提高效率。"
    },
    {
      "indent": 3,
      "text": "+---------------------+\n|      Payload        |\n/=====================\\\nH Payload Convergence H--+\nH---------------------H  |       +--------------------------------+\nH       Timing        H--------->|              RTP               |\nH---------------------H  |       +--------------------------------+\nH     Sequencing      H--+------>| Flags, Frag, Len, Seq #, etc   |\n\\=====================/  |       +--------------------------------+\n|  PW Demultiplexer   |--------->|           PW Label             |\n+---------------------+  |       +--------------------------------+\n|  PSN Convergence    |--+  +--->| Outer Label or MPLS-in-IP encap|\n+---------------------+     |    +--------------------------------+\n|        PSN          |-----+\n+---------------------+\n|      Data-Link      |\n+---------------------+\n|       Physical      |\n+---------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 10,
      "text": "Figure 11. PWE3 over an MPLS PSN Using a Control Word",
      "zh-CHS": "图11。使用控制字的MPLS PSN上的PWE3"
    },
    {
      "indent": 3,
      "text": "Figure 11 shows the protocol layering for PWE3 over an MPLS PSN. An inner MPLS label is used to provide the PW demultiplexing function. A control word is used to carry most of the information needed by the PWE3 Encapsulation Layer and the PSN Convergence Layer in a compact format. The flags in the control word provide the necessary payload convergence. A sequence field provides support for both in-order payload delivery and a PSN fragmentation service within the PSN Convergence Layer (supported by a fragmentation control method). Ethernet pads all frames to a minimum size of 64 bytes. The MPLS header does not include a length indicator. Therefore, to allow PWE3",
      "zh-CHS": "图11显示了MPLS PSN上PWE3的协议分层。内部MPLS标签用于提供PW解复用功能。控制字用于以紧凑的格式承载PWE3封装层和PSN汇聚层所需的大部分信息。控制字中的标志提供必要的有效负载聚合。序列字段为顺序有效负载交付和PSN聚合层内的PSN分段服务（由分段控制方法支持）提供支持。以太网将所有帧的最小大小填充为64字节。MPLS标头不包括长度指示符。因此，允许PWE3"
    },
    {
      "indent": 3,
      "text": "to be carried in MPLS to pass correctly over an Ethernet data-link, a length correction field is needed in the control word. As with an IP PSN, where appropriate, timing is provided by RTP [RFC3550].",
      "zh-CHS": "为了在MPLS中正确地通过以太网数据链路，控制字中需要一个长度校正字段。与IP PSN一样，在适当的情况下，定时由RTP[RFC3550]提供。"
    },
    {
      "indent": 3,
      "text": "In some networks, it may be necessary to carry PWE3 over MPLS over IP. In these circumstances, the PW is encapsulated for carriage over MPLS as described in this section, and then a method of carrying MPLS over an IP PSN (such as GRE [RFC2784], [RFC2890]) is applied to the resultant PW-PDU.",
      "zh-CHS": "在某些网络中，可能需要通过IP上的MPLS传输PWE3。在这些情况下，如本节所述，将PW封装为通过MPLS承载，然后将通过IP PSN承载MPLS的方法（例如GRE[RFC2784]、[RFC2890]）应用于生成的PW-PDU。"
    },
    {
      "indent": 0,
      "text": "5.4.3. PW-IP Packet Discrimination",
      "section_title": true,
      "zh-CHS": "5.4.3. PW-IP包鉴别"
    },
    {
      "indent": 3,
      "text": "For MPLS PSNs, there is an additional constraint on the PW packet format. Some label switched routers detect IP packets based on the initial four bits of the packet content. To facilitate proper functioning, these bits in PW packets must not be the same as an IP version number in current use.",
      "zh-CHS": "对于MPLS PSN，对PW数据包格式有一个附加约束。一些标签交换路由器根据数据包内容的初始四位来检测IP数据包。为便于正常运行，PW数据包中的这些位不得与当前使用的IP版本号相同。"
    },
    {
      "indent": 0,
      "text": "6. PW Demultiplexer Layer and PSN Requirements",
      "section_title": true,
      "zh-CHS": "6. PW解复用器层和PSN要求"
    },
    {
      "indent": 3,
      "text": "PWE3 places three service requirements on the protocol layers used to carry it across the PSN:",
      "zh-CHS": "PWE3对用于在PSN上传输的协议层提出了三个服务要求："
    },
    {
      "indent": 7,
      "text": "o Multiplexing o Fragmentation o Length and Delivery",
      "zh-CHS": "o 多路复用o长度和传输"
    },
    {
      "indent": 0,
      "text": "6.1. Multiplexing",
      "section_title": true,
      "zh-CHS": "6.1. 多路复用"
    },
    {
      "indent": 3,
      "text": "The purpose of the PW Demultiplexer Layer is to allow multiple PWs to be carried in a single tunnel. This minimizes complexity and conserves resources.",
      "zh-CHS": "PW解复用器层的目的是允许在单个隧道中承载多个PW。这将复杂性降至最低并节约资源。"
    },
    {
      "indent": 3,
      "text": "Some types of native service are capable of grouping multiple circuits into a \"trunk\"; e.g., multiple ATM VCs in a VP, multiple Ethernet VLANs on a physical media, or multiple DS0 services within a T1 or E1. A PW may interconnect two end-trunks. That trunk would have a single multiplexing identifier.",
      "zh-CHS": "某些类型的本机服务能够将多个电路分组为一个“主干”；e、 例如，VP中有多个ATM VCs，物理介质上有多个以太网VLAN，或者T1或E1中有多个DS0服务。PW可互连两个端部干线。该中继将具有单个多路复用标识符。"
    },
    {
      "indent": 3,
      "text": "When a MPLS label is used as a PW Demultiplexer, setting of the TTL value [RFC3032] in the PW label is application specific.",
      "zh-CHS": "当MPLS标签用作PW解复用器时，PW标签中TTL值[RFC3032]的设置是特定于应用程序的。"
    },
    {
      "indent": 0,
      "text": "6.2. Fragmentation",
      "section_title": true,
      "zh-CHS": "6.2. 碎裂"
    },
    {
      "indent": 3,
      "text": "If the PSN provides a fragmentation and reassembly service of adequate performance, it may be used to obtain an effective MTU that is large enough to transport the PW PDUs. See section 5.3 for a full discussion of the PW fragmentation issues.",
      "zh-CHS": "如果PSN提供了足够性能的碎片和重新组装服务，则可以使用它来获得足够大的有效MTU，以运输PW PDU。有关PW碎片问题的完整讨论，请参见第5.3节。"
    },
    {
      "indent": 0,
      "text": "6.3. Length and Delivery",
      "section_title": true,
      "zh-CHS": "6.3. 长度和交付"
    },
    {
      "indent": 3,
      "text": "PDU delivery to the egress PE is the function of the PSN Layer.",
      "zh-CHS": "PDU传送到出口PE是PSN层的功能。"
    },
    {
      "indent": 3,
      "text": "If the underlying PSN does not provide all the information necessary to determine the length of a PW-PDU, the Encapsulation Layer must provide it.",
      "zh-CHS": "如果基础PSN未提供确定PW-PDU长度所需的所有信息，则封装层必须提供该信息。"
    },
    {
      "indent": 0,
      "text": "6.4. PW-PDU Validation",
      "section_title": true,
      "zh-CHS": "6.4. PW-PDU验证"
    },
    {
      "indent": 3,
      "text": "It is a common practice to use an error detection mechanism such as a CRC or similar mechanism to ensure end-to-end integrity of frames. The PW service-specific mechanisms must define whether the packet's checksum shall be preserved across the PW or be removed from PE-bound PDUs and then be recalculated for insertion in CE-bound data.",
      "zh-CHS": "通常使用错误检测机制（如CRC）或类似机制来确保帧的端到端完整性。特定于PW服务的机制必须定义是在整个PW中保留数据包的校验和，还是从PE绑定的PDU中删除数据包的校验和，然后重新计算以插入CE绑定的数据。"
    },
    {
      "indent": 3,
      "text": "The former approach saves work, whereas the latter saves bandwidth. For a given implementation, the choice may be dictated by hardware restrictions, which may not allow the preservation of the checksum.",
      "zh-CHS": "前者可以节省工作，而后者可以节省带宽。对于给定的实现，选择可能由硬件限制决定，这可能不允许保留校验和。"
    },
    {
      "indent": 3,
      "text": "For protocols such as ATM and FR, the scope of the checksum is restricted to a single link. This is because the circuit identifiers (e.g., FR DLCI or ATM VPI/VCI) only have local significance and are changed on each hop or span. If the circuit identifier (and thus checksum) were going to change as part of the PW emulation, it would be more efficient to strip and recalculate the checksum.",
      "zh-CHS": "对于ATM和FR等协议，校验和的范围仅限于单个链路。这是因为电路标识符（例如，FR DLCI或ATM VPI/VCI）仅具有局部意义，并且在每个跃点或跨距上都会改变。如果电路标识符（以及校验和）将作为PW仿真的一部分进行更改，则剥离和重新计算校验和将更加有效。"
    },
    {
      "indent": 3,
      "text": "The service-specific document for each protocol must describe the validation scheme to be used.",
      "zh-CHS": "每个协议的服务特定文档必须描述要使用的验证方案。"
    },
    {
      "indent": 0,
      "text": "6.5. Congestion Considerations",
      "section_title": true,
      "zh-CHS": "6.5. 交通挤塞考虑"
    },
    {
      "indent": 3,
      "text": "The PSN carrying the PW may be subject to congestion. The congestion characteristics will vary with the PSN type, the network architecture and configuration, and the loading of the PSN.",
      "zh-CHS": "承载PW的PSN可能会出现拥塞。拥塞特性将随PSN类型、网络架构和配置以及PSN的负载而变化。"
    },
    {
      "indent": 3,
      "text": "If the traffic carried over the PW is known to be TCP friendly (by, for example, packet inspection), packet discard in the PSN will trigger the necessary reduction in offered load, and no additional congestion avoidance action is necessary.",
      "zh-CHS": "如果通过PW传输的流量已知是TCP友好的（例如，通过数据包检查），PSN中的数据包丢弃将触发所提供负载的必要减少，并且不需要额外的拥塞避免操作。"
    },
    {
      "indent": 3,
      "text": "If the PW is operating over a PSN that provides enhanced delivery, the PEs should monitor packet loss to ensure that the requested service is actually being delivered. If it is not, then the PE should assume that the PSN is providing a best-effort service and should use the best-effort service congestion avoidance measures described below.",
      "zh-CHS": "如果PW在提供增强传送的PSN上运行，则PEs应监控数据包丢失，以确保请求的服务实际传送。如果不是，则PE应假设PSN正在提供尽力而为服务，并应使用下文所述的尽力而为服务拥塞避免措施。"
    },
    {
      "indent": 3,
      "text": "If best-effort service is being used and the traffic is not known to be TCP friendly, the PEs should monitor packet loss to ensure that the loss rate is within acceptable parameters. Packet loss is considered acceptable if a TCP flow across the same network path and experiencing the same network conditions would achieve an average throughput, measured on a reasonable timescale, not less than that which the PW flow is achieving. This condition can be satisfied by implementing a rate-limiting measure in the NSP, or by shutting down one or more PWs. The choice of which approach to use depends upon the type of traffic being carried. Where congestion is avoided by shutting down a PW, a suitable mechanism must be provided to prevent it from immediately returning to service and causing a series of congestion pulses.",
      "zh-CHS": "如果正在使用尽力而为的服务，并且不知道流量是TCP友好的，则PEs应监控数据包丢失，以确保丢失率在可接受的参数范围内。如果通过相同网络路径并经历相同网络条件的TCP流能够达到在合理时间尺度上测量的平均吞吐量，且不低于PW流所达到的平均吞吐量，则认为丢包是可接受的。通过在NSP中实施限速措施，或关闭一个或多个PWs，可以满足此条件。使用哪种方法的选择取决于所承载的交通类型。如果通过关闭PW来避免拥塞，则必须提供适当的机制，以防止其立即恢复服务并导致一系列拥塞脉冲。"
    },
    {
      "indent": 3,
      "text": "The comparison to TCP cannot be specified exactly but is intended as an \"order-of-magnitude\" comparison in timescale and throughput. The timescale on which TCP throughput is measured is the round-trip time of the connection. In essence, this requirement states that it is not acceptable to deploy an application (using PWE3 or any other transport protocol) on the best-effort Internet, which consumes bandwidth arbitrarily and does not compete fairly with TCP within an order of magnitude. One method of determining an acceptable PW bandwidth is described in [RFC3448].",
      "zh-CHS": "无法准确指定与TCP的比较，但其目的是在时间尺度和吞吐量方面进行“数量级”比较。测量TCP吞吐量的时间尺度是连接的往返时间。本质上，该要求表明，在尽力而为的互联网上部署应用程序（使用PWE3或任何其他传输协议）是不可接受的，因为该互联网任意消耗带宽，并且在一个数量级内无法与TCP公平竞争。[RFC3448]中描述了一种确定可接受PW带宽的方法。"
    },
    {
      "indent": 0,
      "text": "7. Control Plane",
      "section_title": true,
      "zh-CHS": "7. 控制平面"
    },
    {
      "indent": 3,
      "text": "This section describes PWE3 control plane services.",
      "zh-CHS": "本节介绍PWE3控制平面服务。"
    },
    {
      "indent": 0,
      "text": "7.1. Setup or Teardown of Pseudo Wires",
      "section_title": true,
      "zh-CHS": "7.1. 伪导线的设置或拆卸"
    },
    {
      "indent": 3,
      "text": "A PW must be set up before an emulated service can be established and must be torn down when an emulated service is no longer needed.",
      "zh-CHS": "必须先设置PW，然后才能建立模拟服务，并且在不再需要模拟服务时必须拆除PW。"
    },
    {
      "indent": 3,
      "text": "Setup or teardown of a PW can be triggered by an operator command, from the management plane of a PE, by signaling set-up or teardown of an AC (e.g., an ATM SVC), or by an auto-discovery mechanism.",
      "zh-CHS": "PW的设置或拆卸可由来自PE管理平面的操作员命令、AC（例如ATM SVC）的信号设置或拆卸或自动发现机制触发。"
    },
    {
      "indent": 3,
      "text": "During the setup process, the PEs have to exchange information (e.g., learn each other's capabilities). The tunnel signaling protocol may be extended to provide mechanisms that enable the PEs to exchange all necessary information on behalf of the PW.",
      "zh-CHS": "在设置过程中，PEs必须交换信息（例如，了解彼此的能力）。隧道信令协议可被扩展以提供使PEs能够代表PW交换所有必要信息的机制。"
    },
    {
      "indent": 3,
      "text": "Manual configuration of PWs can be considered a special kind of signaling and is allowed.",
      "zh-CHS": "PWs的手动配置可被视为一种特殊的信令，是允许的。"
    },
    {
      "indent": 0,
      "text": "7.2. Status Monitoring",
      "section_title": true,
      "zh-CHS": "7.2. 状态监测"
    },
    {
      "indent": 3,
      "text": "Some native services have mechanisms for status monitoring. For example, ATM supports OAM for this purpose. For these services, the corresponding emulated services must specify how to perform status monitoring.",
      "zh-CHS": "某些本机服务具有状态监视机制。例如，ATM为此目的支持OAM。对于这些服务，相应的模拟服务必须指定如何执行状态监视。"
    },
    {
      "indent": 0,
      "text": "7.3. Notification of Pseudo Wire Status Changes",
      "section_title": true,
      "zh-CHS": "7.3. 伪导线状态更改通知"
    },
    {
      "indent": 0,
      "text": "7.3.1. Pseudo Wire Up/Down Notification",
      "section_title": true,
      "zh-CHS": "7.3.1. 伪连线向上/向下通知"
    },
    {
      "indent": 3,
      "text": "If a native service requires bi-directional connectivity, the corresponding emulated service can only be signaled as being up when the PW and PSN tunnels (if used), are functional in both directions.",
      "zh-CHS": "如果本机服务需要双向连接，则只有当PW和PSN隧道（如果使用）在两个方向上都起作用时，相应的模拟服务才能发出启动信号。"
    },
    {
      "indent": 3,
      "text": "Because the two CEs of an emulated service are not adjacent, a failure may occur at a place so that one or both physical links between the CEs and PEs remain up. For example, in Figure 2, if the physical link between CE1 and PE1 fails, the physical link between CE2 and PE2 will not be affected and will remain up. Unless CE2 is notified about the remote failure, it will continue to send traffic over the emulated service to CE1. Such traffic will be discarded at PE1. Some native services have failure notification so that when the services fail, both CEs will be notified. For these native services, the corresponding PWE3 service must provide a failure notification mechanism.",
      "zh-CHS": "由于模拟服务的两个CE不相邻，因此可能会在某个位置发生故障，从而使CE和PE之间的一个或两个物理链路保持正常。例如，在图2中，如果CE1和PE1之间的物理链路出现故障，则CE2和PE2之间的物理链路将不会受到影响，并将保持正常。除非通知CE2远程故障，否则它将继续通过模拟服务向CE1发送通信量。此类交通将在PE1被丢弃。某些本机服务具有失败通知，因此当服务失败时，将通知两个CE。对于这些本机服务，相应的PWE3服务必须提供故障通知机制。"
    },
    {
      "indent": 3,
      "text": "Similarly, if a native service has notification mechanisms so that all the affected services will change status from \"Down\" to \"Up\" when a network failure is fixed, the corresponding emulated service must provide a similar mechanism for doing so.",
      "zh-CHS": "类似地，如果本机服务具有通知机制，以便在修复网络故障时，所有受影响的服务的状态将从“向下”更改为“向上”，则相应的模拟服务必须提供类似的机制。"
    },
    {
      "indent": 3,
      "text": "These mechanisms may already be built into the tunneling protocol. For example, the L2TP control protocol [RFC2661] [RFC3931] has this capability, and LDP has the ability to withdraw the corresponding MPLS label.",
      "zh-CHS": "这些机制可能已经内置到隧道协议中。例如，L2TP控制协议[RFC2661][RFC3931]具有此能力，LDP具有撤回相应MPLS标签的能力。"
    },
    {
      "indent": 0,
      "text": "7.3.2. Misconnection and Payload Type Mismatch",
      "section_title": true,
      "zh-CHS": "7.3.2. 错误连接和有效负载类型不匹配"
    },
    {
      "indent": 3,
      "text": "With PWE3, misconnection and payload type mismatch can occur. Misconnection can breach the integrity of the system. Payload mismatch can disrupt the customer network. In both instances, there are security and operational concerns.",
      "zh-CHS": "使用PWE3，可能会发生错误连接和有效负载类型不匹配。错误连接会破坏系统的完整性。负载不匹配会中断客户网络。在这两种情况下，都存在安全和操作问题。"
    },
    {
      "indent": 3,
      "text": "The services of the underlying tunneling mechanism and its associated control protocol can be used to mitigate this. As part of the PW setup, a PW-TYPE identifier is exchanged. This is then used by the forwarder and the NSP to verify the compatibility of the ACs.",
      "zh-CHS": "底层隧道机制及其相关控制协议的服务可用于缓解这一问题。作为PW设置的一部分，交换PW类型标识符。然后，转发器和NSP将使用它来验证ACs的兼容性。"
    },
    {
      "indent": 0,
      "text": "7.3.3. Packet Loss, Corruption, and Out-of-Order Delivery",
      "section_title": true,
      "zh-CHS": "7.3.3. 数据包丢失、损坏和无序传递"
    },
    {
      "indent": 3,
      "text": "A PW can incur packet loss, corruption, and out-of-order delivery on the PSN path between the PEs. This can affect the working condition of an emulated service. For some payload types, packet loss, corruption, and out-of-order delivery can be mapped either to a bit error burst, or to loss of carrier on the PW. If a native service has some mechanism to deal with bit error, the corresponding PWE3 service should provide a similar mechanism.",
      "zh-CHS": "PW可能导致PEs之间的PSN路径上的数据包丢失、损坏和无序交付。这可能会影响模拟服务的工作条件。对于某些有效负载类型，数据包丢失、损坏和无序交付可以映射到比特错误突发或PW上的载波丢失。如果本机服务具有某种机制来处理位错误，则相应的PWE3服务应提供类似的机制。"
    },
    {
      "indent": 0,
      "text": "7.3.4. Other Status Notification",
      "section_title": true,
      "zh-CHS": "7.3.4. 其他状态通知"
    },
    {
      "indent": 3,
      "text": "A PWE3 approach may provide a mechanism for other status notifications, if any are needed.",
      "zh-CHS": "如果需要，PWE3方法可以为其他状态通知提供机制。"
    },
    {
      "indent": 0,
      "text": "7.3.5. Collective Status Notification",
      "section_title": true,
      "zh-CHS": "7.3.5. 集体地位通知"
    },
    {
      "indent": 3,
      "text": "The status of a group of emulated services may be affected identically by a single network incident. For example, when the physical link (or sub-network) between a CE and a PE fails, all the emulated services that go through that link (or sub-network) will fail. It is likely that a group of emulated services all terminate at a remote CE. There may also be multiple such CEs affected by the failure. Therefore, it is desirable that a single notification message be used to notify failure of the whole group of emulated services.",
      "zh-CHS": "一组模拟服务的状态可能会受到单个网络事件的相同影响。例如，当CE和PE之间的物理链路（或子网络）出现故障时，通过该链路（或子网络）的所有模拟服务都将失败。一组模拟服务很可能都在远程CE处终止。也可能有多个此类CE受到故障的影响。因此，希望使用单个通知消息来通知整个模拟服务组的故障。"
    },
    {
      "indent": 3,
      "text": "A PWE3 approach may provide a mechanism for notifying status changes of a group of emulated circuits. One possible method is to associate each emulated service with a group ID when the PW for that emulated service is set up. Multiple emulated services can then be grouped by associating them with the same group ID. In status notification, this group ID can be used to refer all the emulated services in that group. The group ID mechanism should be a mechanism provided by the underlying tunnel signaling protocol.",
      "zh-CHS": "PWE3方法可提供用于通知一组仿真电路的状态变化的机制。一种可能的方法是在为每个模拟服务设置PW时，将其与组ID关联。然后，可以通过将多个模拟服务与相同的组ID关联来对其进行分组。在状态通知中，此组ID可用于引用该组中的所有模拟服务。组ID机制应该是由底层隧道信令协议提供的机制。"
    },
    {
      "indent": 0,
      "text": "7.4. Keep-Alive",
      "section_title": true,
      "zh-CHS": "7.4. 活命"
    },
    {
      "indent": 3,
      "text": "If a native service has a keep-alive mechanism, the corresponding emulated service must provide a mechanism to propagate it across the PW. Transparently transporting keep-alive messages over the PW would follow the principle of minimum intervention. However, to reproduce",
      "zh-CHS": "如果本机服务具有保持活动机制，则相应的模拟服务必须提供一种机制，以便在PW中传播它。通过PW透明地传输保持活动状态的消息将遵循最小干预的原则。然而，复制"
    },
    {
      "indent": 3,
      "text": "the semantics of the native mechanism accurately, some PWs may require an alternative approach, such as piggy-backing on the PW signaling mechanism.",
      "zh-CHS": "本机机制的语义准确地说，一些PW可能需要另一种方法，例如借助PW信号机制。"
    },
    {
      "indent": 0,
      "text": "7.5. Handling Control Messages of the Native Services",
      "section_title": true,
      "zh-CHS": "7.5. 处理本机服务的控制消息"
    },
    {
      "indent": 3,
      "text": "Some native services use control messages for circuit maintenance. These control messages may be in-band (e.g., Ethernet flow control, ATM performance management, or TDM tone signaling) or out-of-band, (e.g., the signaling VC of an ATM VP, or TDM CCS signaling).",
      "zh-CHS": "某些本机服务使用控制消息进行电路维护。这些控制消息可以是带内（例如，以太网流量控制、ATM性能管理或TDM音调信令）或带外（例如，ATM VP的信令VC或TDM CCS信令）。"
    },
    {
      "indent": 3,
      "text": "Given the principle of minimum intervention, it is desirable that the PEs participate as little as possible in the signaling and maintenance of the native services. This principle should not, however, override the need to emulate the native service satisfactorily.",
      "zh-CHS": "考虑到最小干预的原则，期望PEs尽可能少地参与本机服务的信令和维护。但是，这一原则不应超越令人满意地模拟本机服务的需要。"
    },
    {
      "indent": 3,
      "text": "If control messages are passed through, it may be desirable to send them by using either a higher priority or a reliable channel provided by the PW Demultiplexer layer. See Section 5.1.2, PWE3 Channel Types.",
      "zh-CHS": "如果控制消息通过，则可能希望通过使用更高优先级或PW解复用器层提供的可靠信道来发送它们。参见第5.1.2节，PWE3通道类型。"
    },
    {
      "indent": 0,
      "text": "8. Management and Monitoring",
      "section_title": true,
      "zh-CHS": "8. 管理和监测"
    },
    {
      "indent": 3,
      "text": "This section describes the management and monitoring architecture for PWE3.",
      "zh-CHS": "本节介绍PWE3的管理和监控体系结构。"
    },
    {
      "indent": 0,
      "text": "8.1. Status and Statistics",
      "section_title": true,
      "zh-CHS": "8.1. 现状和统计"
    },
    {
      "indent": 3,
      "text": "The PE should report the status of the interface and tabulate statistics that help monitor the state of the network and help measure service-level agreements (SLAs). Typical counters include the following:",
      "zh-CHS": "PE应报告接口的状态并将统计数据制成表格，以帮助监控网络状态并帮助测量服务级别协议（SLA）。典型计数器包括以下各项："
    },
    {
      "indent": 7,
      "text": "o Counts of PW-PDUs sent and received, with and without errors. o Counts of sequenced PW-PDUs lost. o Counts of service PDUs sent and received over the PSN, with and without errors (non-TDM). o Service-specific interface counts. o One-way delay and delay variation.",
      "zh-CHS": "o 发送和接收的PW PDU计数，有无错误。o序列PW PDU丢失的计数。o通过PSN发送和接收的服务PDU计数，有无错误（非TDM）。o特定于服务的接口计数。o单向延迟和延迟变化。"
    },
    {
      "indent": 3,
      "text": "These counters would be contained in a PW-specific MIB, and they should not replicate existing MIB counters.",
      "zh-CHS": "这些计数器将包含在特定于PW的MIB中，它们不应复制现有的MIB计数器。"
    },
    {
      "indent": 0,
      "text": "8.2. PW SNMP MIB Architecture",
      "section_title": true,
      "zh-CHS": "8.2. PW SNMP MIB体系结构"
    },
    {
      "indent": 3,
      "text": "This section describes the general architecture for SNMP MIBs used to manage PW services and the underlying PSN. The intent here is to provide a clear picture of how all the pertinent MIBs fit together to form a cohesive management framework for deploying PWE3 services. Note that the names of MIB modules used below are suggestions and do not necessarily require that the actual modules used to realize the components in the architecture be named exactly so.",
      "zh-CHS": "本节介绍用于管理PW服务和底层PSN的SNMP MIB的一般体系结构。这里的目的是提供一个清晰的画面，说明所有相关MIB如何组合在一起，以形成用于部署PWE3服务的内聚管理框架。请注意，下面使用的MIB模块的名称是建议，并不一定要求用于实现体系结构中组件的实际模块的名称完全相同。"
    },
    {
      "indent": 0,
      "text": "8.2.1. MIB Layering",
      "section_title": true,
      "zh-CHS": "8.2.1. MIB分层"
    },
    {
      "indent": 3,
      "text": "The SNMP MIBs created for PWE3 should fit the architecture shown in Figure 12. The architecture provides a layered modular model into which any supported emulated service can be connected to any supported PSN type. This model fosters reuse of as much functionality as possible. For instance, the emulated service layer MIB modules do not redefine the existing emulated service MIB module; rather, they only associate it with the pseudo wires used to carry the emulated service over the configured PSN. In this way, the PWE3 MIB architecture follows the overall PWE3 architecture.",
      "zh-CHS": "为PWE3创建的SNMP MIB应符合图12所示的体系结构。该体系结构提供了一个分层的模块化模型，任何受支持的模拟服务都可以连接到任何受支持的PSN类型。该模型促进了尽可能多的功能重用。例如，仿真服务层MIB模块不重新定义现有的仿真服务MIB模块；相反，它们仅将其与用于在配置的PSN上承载模拟服务的伪线路相关联。这样，PWE3 MIB体系结构遵循整个PWE3体系结构。"
    },
    {
      "indent": 3,
      "text": "The architecture does allow for the joining of unsupported emulated service or PSN types by simply defining additional MIB modules to associate new types with existing ones. These new modules can subsequently be standardized. Note that there is a separate MIB module for each emulated service, as well as one for each underlying PSN. These MIB modules may be used in various combinations as needed.",
      "zh-CHS": "该体系结构只需定义额外的MIB模块，将新类型与现有类型关联起来，就允许加入不受支持的模拟服务或PSN类型。这些新模块随后可以标准化。请注意，每个模拟服务以及每个底层PSN都有一个单独的MIB模块。这些MIB模块可根据需要以各种组合使用。"
    },
    {
      "indent": 3,
      "text": "    Native\n Service MIBs    ...           ...               ...\n                  |             |                 |\n            +-----------+ +-----------+     +-----------+\n  Service   |    CEP    | | Ethernet  |     |    ATM    |\n   Layer    |Service MIB| |Service MIB| ... |Service MIB|\n            +-----------+ +-----------+     +-----------+\n                    \\           |             /\n                      \\         |           /\n- - - - - - - - - - - - \\ - - - | - - - - / - - - - - - -\n                          \\     |       /\n            +-------------------------------------------+\n Generic PW |            Generic PW MIBs                |\n   Layer    +-------------------------------------------+\n                         /             \\\n- - - - - - - - - - - - / - - - - - - - - \\ - - - - - - -\n                      /                     \\\n                    /                         \\\n            +--------------+             +----------------+\n  PSN VC    |L2TP VC MIB(s)|             | MPLS VC MIB(s) |\n   Layer    +--------------+             +----------------+\n                   |                              |\n  Native     +-----------+                  +-----------+\n   PSN       |L2TP MIB(s)|                  |MPLS MIB(s)|\n   MIBs      +-----------+                  +-----------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 15,
      "text": "Figure 12. MIB Module Layering Relationship",
      "zh-CHS": "图12。MIB模块分层关系"
    },
    {
      "indent": 3,
      "text": "Figure 13 shows an example for a SONET PW carried over MPLS Traffic Engineering Tunnel and an LDP-signaled LSP.",
      "zh-CHS": "图13显示了通过MPLS流量工程隧道承载的SONET PW和LDP信令LSP的示例。"
    },
    {
      "indent": 11,
      "text": "                 +-----------------+\n                 |    SONET MIB    |  RFC3592\n                 +-----------------+\n                          |\n            +------------------------------+\n Service    | Circuit Emulation Service MIB|\n  Layer     +------------------------------+\n- - - - - - - - - - - - - | - - - - - - - - - - - - -\n                 +-----------------+\nGeneric PW       | Generic PW MIB  |\n  Layer          +-----------------+\n- - - - - - - - - - - - - | - - - - - - - - - - - - -\n                 +-----------------+\n  PSN VC         |   MPLS VC MIBs  |\n  Layer          +-----------------+\n                    |           |\n       +-----------------+  +------------------+\n       | MPLS-TE-STD-MIB |  | MPLS-LSR-STD-MIB |\n       +-----------------+  +------------------+",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 12,
      "text": "Figure 13. SONET PW over MPLS PSN Service-Specific Example",
      "zh-CHS": "图13。SONET PW over MPLS PSN服务特定示例"
    },
    {
      "indent": 0,
      "text": "8.2.2. Service Layer MIB Modules",
      "section_title": true,
      "zh-CHS": "8.2.2. 服务层MIB模块"
    },
    {
      "indent": 3,
      "text": "This conceptual layer in the model contains MIB modules used to represent the relationship between emulated PWE3 services such as Ethernet, ATM, or Frame Relay and the pseudo-wire used to carry that service across the PSN. This layer contains corresponding MIB modules used to mate or adapt those emulated services to the generic pseudo-wire representation these are represented in the \"Generic PW MIB\" functional block in Figure 13 above. This working group should not produce any MIB modules for managing the general service; rather, it should produce just those modules used to interface or adapt the emulated service onto the PWE3 management framework as shown above. For example, the standard SONET-MIB [RFC3592] is designed and maintained by another working group. The SONET-MIB is designed to manage the native service without PW emulation. However, the PWE3 working group is chartered to produce standards that show how to emulate existing technologies such as SONET/SDH over pseudo-wires rather than reinvent those modules.",
      "zh-CHS": "模型中的这一概念层包含MIB模块，用于表示模拟PWE3服务（如以太网、ATM或帧中继）与用于跨PSN传输该服务的伪线之间的关系。该层包含相应的MIB模块，用于将这些模拟服务匹配或调整为通用伪线表示，这些表示在上面图13中的“通用PW MIB”功能块中。该工作组不应制作任何管理一般事务的MIB模块；相反，它应该只生成用于将模拟服务与PWE3管理框架进行接口或调整的模块，如上所示。例如，标准SONET-MIB[RFC3592]由另一个工作组设计和维护。SONET-MIB设计用于在不进行PW仿真的情况下管理本机服务。然而，PWE3工作组被授权制定标准，展示如何通过伪线模拟SONET/SDH等现有技术，而不是重新发明这些模块。"
    },
    {
      "indent": 0,
      "text": "8.2.3. Generic PW MIB Modules",
      "section_title": true,
      "zh-CHS": "8.2.3. 通用PW MIB模块"
    },
    {
      "indent": 3,
      "text": "The middle layer in the architecture is referred to as the Generic PW Layer. MIBs in this layer are responsible for providing pseudo-wire specific counters and service models used for monitoring and configuration of PWE3 services over any supported PSN service. That is, this layer provides a general model of PWE3 abstraction for management purposes. This MIB is used to interconnect the MIB modules residing in the Service Layer to the PSN VC Layer MIBs (see section 8.2.4).",
      "zh-CHS": "体系结构中的中间层称为通用PW层。该层中的MIB负责提供伪线路特定计数器和服务模型，用于通过任何受支持的PSN服务监控和配置PWE3服务。也就是说，该层为管理目的提供了PWE3抽象的通用模型。该MIB用于将驻留在服务层的MIB模块与PSN VC层MIB互连（见第8.2.4节）。"
    },
    {
      "indent": 0,
      "text": "8.2.4. PSN VC Layer MIB Modules",
      "section_title": true,
      "zh-CHS": "8.2.4. PSN VC层MIB模块"
    },
    {
      "indent": 3,
      "text": "The third layer in the PWE3 management architecture is referred to as the PSN VC Layer. It is composed of MIBs that are specifically designed to associate pseudo-wires onto those underlying PSN transport technologies that carry the pseudo-wire payloads across the PSN. In general, this means that the MIB module provides a mapping between the emulated service that is mapped to the pseudo-wire via the Service Layer and the Generic PW MIB Layer onto the native PSN service. For example, in the case of MPLS, for example, it is required that the general VC service be mapped into MPLS LSPs via the MPLS-LSR-STD-MIB [RFC3813] or Traffic-Engineered (TE) Tunnels via the MPLS-TE-STD-MIB [RFC3812]. In addition, the MPLS-LDP-STD-MIB [RFC3815] may be used to reveal the MPLS labels that are distributed over the MPLS PSN in order to maintain the PW service. As with the native service MIB modules described earlier, the MIB modules used to manage the native PSN services are produced by other working groups that design and specify the native PSN services. These MIBs should contain the appropriate mechanisms for monitoring and configuring the PSN service that the emulated PWE3 service will function correctly.",
      "zh-CHS": "PWE3管理体系结构中的第三层称为PSN VC层。它由MIB组成，专门设计用于将伪线关联到那些在PSN上承载伪线有效载荷的底层PSN传输技术。通常，这意味着MIB模块提供了仿真服务（通过服务层映射到伪线）和通用PW MIB层到本机PSN服务之间的映射。例如，在MPLS的情况下，例如，需要通过MPLS-LSR-STD-MIB[RFC3813]将通用VC服务映射到MPLS lsp，或者通过MPLS-TE-STD-MIB[RFC3812]将流量工程（TE）隧道映射到MPLS lsp。此外，MPLS-LDP-STD-MIB[RFC3815]可用于揭示分布在MPLS PSN上的MPLS标签，以维持PW服务。与前面描述的本机服务MIB模块一样，用于管理本机PSN服务的MIB模块由设计和指定本机PSN服务的其他工作组生成。这些MIB应包含适当的机制，用于监控和配置PSN服务，以确保仿真PWE3服务能够正确运行。"
    },
    {
      "indent": 0,
      "text": "8.3. Connection Verification and Traceroute",
      "section_title": true,
      "zh-CHS": "8.3. 连接验证和跟踪路由"
    },
    {
      "indent": 3,
      "text": "A connection verification mechanism should be supported by PWs. Connection verification and other alarm mechanisms can alert the operator that a PW has lost its remote connection. The opaque nature of a PW means that it is not possible to specify a generic connection verification or traceroute mechanism that passes this status to the CEs over the PW. If connection verification status of the PW is needed by the CE, it must be mapped to the native connection status method.",
      "zh-CHS": "PWs应支持连接验证机制。连接验证和其他报警机制可提醒操作员PW失去远程连接。PW的不透明性意味着不可能指定通过PW将此状态传递给CEs的通用连接验证或跟踪路由机制。如果CE需要PW的连接验证状态，则必须将其映射到本机连接状态方法。"
    },
    {
      "indent": 3,
      "text": "For troubleshooting purposes, it is sometimes desirable to know the exact functional path of a PW between PEs. This is provided by the traceroute service of the underlying PSN. The opaque nature of the PW means that this traceroute information is only available within the provider network; e.g., at the PEs.",
      "zh-CHS": "为了进行故障排除，有时需要知道PEs之间PW的确切功能路径。这是由底层PSN的跟踪路由服务提供的。PW的不透明性质意味着该跟踪路由信息仅在提供商网络内可用；e、 g.在PEs。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "zh-CHS": "9. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA considerations will be identified in the PWE3 documents that define the PWE3 encapsulation, control, and management protocols.",
      "zh-CHS": "IANA注意事项将在定义PWE3封装、控制和管理协议的PWE3文件中确定。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "zh-CHS": "10. 安全考虑"
    },
    {
      "indent": 3,
      "text": "PWE3 provides no means of protecting the integrity, confidentiality, or delivery of the native data units. The use of PWE3 can therefore expose a particular environment to additional security threats. Assumptions that might be appropriate when all communicating systems are interconnected via a point-to-point or circuit-switched network may no longer hold when they are interconnected with an emulated wire carried over some types of PSN. It is outside the scope of this specification to fully analyze and review the risks of PWE3, particularly as these risks will depend on the PSN. An example should make the concern clear. A number of IETF standards employ relatively weak security mechanisms when communicating nodes are expected to be connected to the same local area network. The Virtual Router Redundancy Protocol [RFC3768] is one instance. The relatively weak security mechanisms represent a greater vulnerability in an emulated Ethernet connected via a PW.",
      "zh-CHS": "PWE3不提供保护本机数据单元的完整性、机密性或交付的方法。因此，使用PWE3可能会使特定环境面临额外的安全威胁。当所有通信系统通过点对点或电路交换网络互连时，可能适用的假设可能不再适用，当它们与通过某些类型的PSN传输的模拟导线互连时。全面分析和审查PWE3的风险不在本规范的范围内，特别是因为这些风险将取决于PSN。举一个例子可以清楚地说明问题。当通信节点预期连接到同一局域网时，许多IETF标准采用相对较弱的安全机制。虚拟路由器冗余协议[RFC3768]就是一个实例。相对较弱的安全机制在通过PW连接的模拟以太网中表现出更大的漏洞。"
    },
    {
      "indent": 3,
      "text": "Exploitation of vulnerabilities from within the PSN may be directed to the PW Tunnel end point so that PW Demultiplexer and PSN tunnel services are disrupted. Controlling PSN access to the PW Tunnel end point is one way to protect against this. By restricting PW Tunnel end point access to legitimate remote PE sources of traffic, the PE may reject traffic that would interfere with the PW Demultiplexing and PSN tunnel services.",
      "zh-CHS": "利用PSN内的漏洞可能会被引导到PW隧道端点，从而中断PW解复用器和PSN隧道服务。控制PSN进入PW隧道终点是防止这种情况发生的一种方法。通过限制PW隧道端点对合法远程PE通信源的访问，PE可以拒绝干扰PW解复用和PSN隧道服务的通信。"
    },
    {
      "indent": 3,
      "text": "Protection mechanisms must also address the spoofing of tunneled PW data. The validation of traffic addressed to the PW Demultiplexer end-point is paramount in ensuring integrity of PW encapsulation. Security protocols such as IPSec [RFC2401] may be used by the PW Demultiplexer Layer in order provide authentication and data integrity of the data between the PW Demultiplexer End-points.",
      "zh-CHS": "保护机制还必须解决隧道PW数据的欺骗问题。验证发送到PW解复用器端点的通信量对于确保PW封装的完整性至关重要。PW解复用器层可以使用诸如IPSec[RFC2401]之类的安全协议，以便在PW解复用器端点之间提供数据的认证和数据完整性。"
    },
    {
      "indent": 3,
      "text": "IPSec may provide authentication, integrity, and confidentiality, of data transferred between two PEs. It cannot provide the equivalent services to the native service.",
      "zh-CHS": "IPSec可以为两个PE之间传输的数据提供身份验证、完整性和机密性。它无法向本机服务提供等效的服务。"
    },
    {
      "indent": 3,
      "text": "Based on the type of data being transferred, the PW may indicate to the PW Demultiplexer Layer that enhanced security services are required. The PW Demultiplexer Layer may define multiple protection profiles based on the requirements of the PW emulated service. CE-to-CE signaling and control events emulated by the PW and some data types may require additional protection mechanisms. Alternatively,",
      "zh-CHS": "基于正在传输的数据的类型，PW可向PW解复用器层指示需要增强的安全服务。PW解复用器层可基于PW模拟服务的要求定义多个保护配置文件。PW和某些数据类型模拟的CE到CE信令和控制事件可能需要额外的保护机制。或者，"
    },
    {
      "indent": 3,
      "text": "the PW Demultiplexer Layer may use peer authentication for every PSN packet to prevent spoofed native data units from being sent to the destination CE.",
      "zh-CHS": "PW解复用器层可以对每个PSN分组使用对等认证，以防止伪造的本机数据单元被发送到目的地CE。"
    },
    {
      "indent": 3,
      "text": "The unlimited transformation capability of the NSP may be perceived as a security risk. In practice the type of operation that the NSP may perform will be limited to those that have been implemented in the data path. A PE designed and managed to best current practice will have controls in place that protect and validate its configuration, and these will be sufficient to ensure that the NSP behaves as expected.",
      "zh-CHS": "NSP的无限转换能力可能被视为安全风险。在实践中，NSP可能执行的操作类型将限于已在数据路径中实现的操作。按照当前最佳实践设计和管理的PE将具有保护和验证其配置的控制措施，这些措施足以确保NSP按预期运行。"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgements",
      "section_title": true,
      "zh-CHS": "11. 致谢"
    },
    {
      "indent": 3,
      "text": "We thank Sasha Vainshtein for his work on Native Service Processing and advice on bit stream over PW services and Thomas K. Johnson for his work on the background and motivation for PWs.",
      "zh-CHS": "我们感谢Sasha Vainstein在本机服务处理方面的工作和PW服务比特流方面的建议，感谢Thomas K.Johnson在PWs背景和动机方面的工作。"
    },
    {
      "indent": 3,
      "text": "We also thank Ron Bonica, Stephen Casner, Durai Chinnaiah, Jayakumar Jayakumar, Ghassem Koleyni, Danny McPherson, Eric Rosen, John Rutemiller, Scott Wainner, and David Zelig for their comments and contributions.",
      "zh-CHS": "我们还感谢Ron Bonica、Stephen Casner、Durai Chinnaiah、Jayakumar Jayakumar、Ghassem Koleyni、Danny McPherson、Eric Rosen、John Rutemiller、Scott Wainner和David Zelig的评论和贡献。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "zh-CHS": "12. 工具书类"
    },
    {
      "indent": 0,
      "text": "12.1. Normative References",
      "section_title": true,
      "zh-CHS": "12.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3931] Lau, J., Townsley, M., and I. Goyret, \"Layer Two Tunneling Protocol - Version 3 (L2TPv3), RFC 3931, March 2005.",
      "zh-CHS": "[RFC3931]Lau，J.，Townsley，M.，和I.Goyret，“第二层隧道协议-版本3（L2TPv3）”，RFC 39312005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC768] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, August 1980.",
      "zh-CHS": "[RFC768]Postel，J.，“用户数据报协议”，STD 6，RFC 768，1980年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2401] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "zh-CHS": "[RFC2401]Kent，S.和R.Atkinson，“互联网协议的安全架构”，RFC 2401，1998年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2474] Nichols, K., Blake, S., Baker, F., and D. Black, \"Definition of the Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998.",
      "zh-CHS": "[RFC2474]Nichols，K.，Blake，S.，Baker，F.，和D.Black，“IPv4和IPv6头中区分服务字段（DS字段）的定义”，RFC 2474，1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3592] Tesink, K., \"Definitions of Managed Objects for the Synchronous Optical Network/Synchronous Digital Hierarchy (SONET/SDH) Interface Type\", RFC 3592, September 2003.",
      "zh-CHS": "[RFC3592]Tesink，K.“同步光网络/同步数字体系（SONET/SDH）接口类型的受管对象定义”，RFC 3592，2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2661] Townsley, W., Valencia, A., Rubens, A., Pall, G., Zorn, G., and B. Palter, \"Layer Two Tunneling Protocol \"L2TP\"\", RFC 2661, August 1999.",
      "zh-CHS": "[RFC2661]汤斯利，W.，瓦伦西亚，A.，鲁本斯，A.，帕尔，G.，佐恩，G.，和B.帕尔特，“第二层隧道协议“L2TP”，RFC 26611999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2784] Farinacci, D., Li, T., Hanks, S., Meyer, D., and P. Traina, \"Generic Routing Encapsulation (GRE)\", RFC 2784, March 2000.",
      "zh-CHS": "[RFC2784]Farinaci，D.，Li，T.，Hanks，S.，Meyer，D.，和P.Traina，“通用路由封装（GRE）”，RFC 27842000年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2890] Dommety, G., \"Key and Sequence Number Extensions to GRE\", RFC 2890, September 2000.",
      "zh-CHS": "[RFC2890]Dommety，G.“GRE的密钥和序列号扩展”，RFC 28902000年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3032] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinacci, D., Li, T., and A. Conta, \"MPLS Label Stack Encoding\", RFC 3032, January 2001.",
      "zh-CHS": "[RFC3032]Rosen，E.，Tappan，D.，Fedorkow，G.，Rekhter，Y.，Farinaci，D.，Li，T.，和A.Conta，“MPLS标签堆栈编码”，RFC 3032，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "zh-CHS": "[RFC3550]Schulzrinne，H.，Casner，S.，Frederick，R.，和V.Jacobson，“RTP：实时应用的传输协议”，STD 64，RFC 35502003年7月。"
    },
    {
      "indent": 0,
      "text": "12.2. Informative References",
      "section_title": true,
      "zh-CHS": "12.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[DVB] EN 300 744 Digital Video Broadcasting (DVB); Framing structure, channel coding and modulation for digital terrestrial television (DVB-T), European Telecommunications Standards Institute (ETSI).",
      "zh-CHS": "[DVB]EN 300 744数字视频广播（DVB）；欧洲电信标准协会（ETSI）数字地面电视（DVB-T）的帧结构、信道编码和调制。"
    },
    {
      "indent": 3,
      "text": "[RFC3815] Cucchiara, J., Sjostrand, H., and J. Luciani, \"Definitions of Managed Objects for the Multiprotocol Label Switching (MPLS), Label Distribution Protocol (LDP)\", RFC 3815, June 2004.",
      "zh-CHS": "[RFC3815]Cucchiara，J.，Sjostrand，H.，和J.Luciani，“多协议标签交换（MPLS）管理对象的定义，标签分发协议（LDP）”，RFC 3815，2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3813] Srinivasan, C., Viswanathan, A., and T. Nadeau, \"Multiprotocol Label Switching (MPLS) Label Switching Router (LSR) Management Information Base (MIB)\", RFC 3813, June 2004.",
      "zh-CHS": "[RFC3813]Srinivasan，C.，Viswanathan，A.，和T.Nadeau，“多协议标签交换（MPLS）标签交换路由器（LSR）管理信息库（MIB）”，RFC 38132004年6月。"
    },
    {
      "indent": 3,
      "text": "[MPLSIP] Rosen et al, \"Encapsulating MPLS in IP or Generic Routing Encapsulation (GRE)\", Work in Progress, March 2004.",
      "zh-CHS": "[MPLSIP]Rosen等人，“在IP或通用路由封装（GRE）中封装MPLS”，正在进行的工作，2004年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC1191] Mogul, J. and S. Deering, \"Path MTU discovery\", RFC 1191, November 1990.",
      "zh-CHS": "[RFC1191]Mogul，J.和S.Deering，“MTU发现路径”，RFC1191，1990年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC1958] Carpenter, B., \"Architectural Principles of the Internet\", RFC 1958, June 1996.",
      "zh-CHS": "[RFC1958]Carpenter，B.，“互联网的建筑原理”，RFC19581996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC1981] McCann, J., Deering, S., and J. Mogul, \"Path MTU Discovery for IP version 6\", RFC 1981, August 1996.",
      "zh-CHS": "[RFC1981]McCann，J.，Deering，S.，和J.Mogul，“IP版本6的路径MTU发现”，RFC 1981，1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2022] Armitage, G., \"Support for Multicast over UNI 3.0/3.1 based ATM Networks\", RFC 2022, November 1996.",
      "zh-CHS": "[RFC2022]Armitage，G.“支持基于UNI 3.0/3.1的ATM网络上的多播”，RFC 2022，1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3768] Hinden, R., \"Virtual Router Redundancy Protocol (VRRP)\", RFC 3768, April 2004.",
      "zh-CHS": "[RFC3768]Hinden，R.，“虚拟路由器冗余协议（VRRP）”，RFC 3768，2004年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, January 2001.",
      "zh-CHS": "[RFC3022]Srisuresh，P.和K.Egevang，“传统IP网络地址转换器（传统NAT）”，RFC 3022，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3448] Handley, M., Floyd, S., Padhye, J., and J. Widmer, \"TCP Friendly Rate Control (TFRC): Protocol Specification\", RFC 3448, January 2003.",
      "zh-CHS": "[RFC3448]Handley，M.，Floyd，S.，Padhye，J.，和J.Widmer，“TCP友好速率控制（TFRC）：协议规范”，RFC 3448，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3812] Srinivasan, C., Viswanathan, A., and T. Nadeau, \"Multiprotocol Label Switching (MPLS) Traffic Engineering (TE) Management Information Base (MIB)\", RFC 3812, June 2004.",
      "zh-CHS": "[RFC3812]Srinivasan，C.，Viswanathan，A.，和T.Nadeau，“多协议标签交换（MPLS）流量工程（TE）管理信息库（MIB）”，RFC 3812，2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3916] Xiao, X., McPherson, D., and P. Pate, Eds, \"Requirements for Pseudo-Wire Emulation Edge-to-Edge (PWE3)\", RFC 3916, September 2004.",
      "zh-CHS": "[RFC3916]Xiao，X.，McPherson，D.，和P.Pate，编辑，“伪线仿真边对边（PWE3）的要求”，RFC 39162004年9月。"
    },
    {
      "indent": 0,
      "text": "13. Co-Authors",
      "section_title": true,
      "zh-CHS": "13. 合著者"
    },
    {
      "indent": 3,
      "text": "The following are co-authors of this document:",
      "zh-CHS": "以下是本文件的共同作者："
    },
    {
      "indent": 3,
      "text": "Thomas K. Johnson Litchfield Communications",
      "zh-CHS": "托马斯·约翰逊·利奇菲尔德通信公司"
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella Juniper Networks, Inc.",
      "zh-CHS": "Kireeti Kompella Juniper网络公司。"
    },
    {
      "indent": 3,
      "text": "Andrew G. Malis Tellabs",
      "zh-CHS": "安德鲁·G·马里斯·特拉布"
    },
    {
      "indent": 3,
      "text": "Thomas D. Nadeau Cisco Systems",
      "zh-CHS": "Thomas D.Nadeau思科系统公司"
    },
    {
      "indent": 3,
      "text": "Tricci So Caspian Networks",
      "zh-CHS": "Tricci So里海网络"
    },
    {
      "indent": 3,
      "text": "W. Mark Townsley Cisco Systems",
      "zh-CHS": "W.马克·汤斯利思科系统公司"
    },
    {
      "indent": 3,
      "text": "Craig White Level 3 Communications, LLC.",
      "zh-CHS": "克雷格·怀特三级通信有限责任公司。"
    },
    {
      "indent": 3,
      "text": "Lloyd Wood Cisco Systems",
      "zh-CHS": "劳埃德伍德思科系统公司"
    },
    {
      "indent": 0,
      "text": "14. Editors' Addresses",
      "section_title": true,
      "zh-CHS": "14. 编辑地址"
    },
    {
      "indent": 3,
      "text": "Stewart Bryant Cisco Systems 250, Longwater Green Park Reading, RG2 6GB, United Kingdom",
      "zh-CHS": "Stewart Bryant Cisco Systems 250，Longwater Green Park Reading，RG2 6GB，英国"
    },
    {
      "indent": 3,
      "text": "EMail: stbryant@cisco.com",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 3,
      "text": "Prayson Pate Overture Networks, Inc. 507 Airport Boulevard Morrisville, NC, USA 27560",
      "zh-CHS": "Prayson Pate Overture Networks，Inc.美国北卡罗来纳州莫里斯维尔机场大道507号，邮编27560"
    },
    {
      "indent": 3,
      "text": "EMail: prayson.pate@overturenetworks.com",
      "raw": true,
      "zh-CHS": "translate error, please retry"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}