{
  "title": {
    "text": "RFC 3946:  Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control ",
    "zh-CHS": "RFC 3946"
  },
  "number": 3946,
  "created_at": "2021-11-18 14:31:03.767550+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          E. Mannie\nRequest for Comments: 3946                                    Consultant\nCategory: Standards Track                               D. Papadimitriou\n                                                                 Alcatel\n                                                            October 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control",
      "zh-CHS": "用于同步光网络（SONET）和同步数字体系（SDH）控制的通用多协议标签交换（GMPLS）扩展"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document is a companion to the Generalized Multi-Protocol Label Switching (GMPLS) signaling. It defines the Synchronous Optical Network (SONET)/Synchronous Digital Hierarchy (SDH) technology specific information needed when using GMPLS signaling.",
      "zh-CHS": "本文件是通用多协议标签交换（GMPLS）信令的配套文件。它定义了使用GMPLS信令时所需的同步光网络（SONET）/同步数字体系（SDH）技术特定信息。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction .................................................  2\n2.  SONET and SDH Traffic Parameters .............................  2\n    2.1.  SONET/SDH Traffic Parameters ...........................  3\n    2.2.  RSVP-TE Details ........................................  9\n    2.3.  CR-LDP Details .........................................  9\n3.  SONET and SDH Labels ......................................... 10\n4.  Acknowledgments .............................................. 15\n5.  Security Considerations ...................................... 16\n6.  IANA Considerations .......................................... 16\n7.  References ................................................... 16\n    7.1.  Normative References ................................... 16\nAppendix 1 - Signal Type Values Extension for VC-3 ............... 18\nAnnex 1 - Examples ............................................... 18\nContributors ..................................................... 21\nAuthors' Addresses ............................................... 25\nFull Copyright Statement ......................................... 26",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As described in [RFC3945], Generalized MPLS (GMPLS) extends MPLS from supporting packet (Packet Switching Capable - PSC) interfaces and switching to include support of four new classes of interfaces and switching: Layer-2 Switch Capable (L2SC), Time-Division Multiplex (TDM), Lambda Switch Capable (LSC) and Fiber-Switch Capable (FSC). A functional description of the extensions to MPLS signaling needed to support the new classes of interfaces and switching is provided in [RFC3471]. [RFC3473] describes RSVP-TE specific formats and mechanisms needed to support all five classes of interfaces, and CR-LDP extensions can be found in [RFC3472]. This document presents details that are specific to Synchronous Optical Network (SONET)/Synchronous Digital Hierarchy (SDH). Per [RFC3471], SONET/SDH specific parameters are carried in the signaling protocol in traffic parameter specific objects.",
      "zh-CHS": "如[RFC3945]所述，通用MPLS（GMPLS）将MPLS从支持分组（支持分组交换-PSC）接口和交换扩展到支持四类新的接口和交换：支持第二层交换机（L2SC）、时分多路复用（TDM）、支持Lambda交换机（LSC）和支持光纤交换机（FSC）。[RFC3471]中提供了支持新型接口和交换所需的MPLS信令扩展的功能描述。[RFC3473]描述了支持所有五类接口所需的RSVP-TE特定格式和机制，CR-LDP扩展可在[RFC3472]中找到。本文档介绍了特定于同步光网络（SONET）/同步数字体系（SDH）的详细信息。根据[RFC3471]，SONET/SDH特定参数在信令协议中的流量参数特定对象中携带。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "Moreover, the reader is assumed to be familiar with the terminology in ANSI [T1.105], ITU-T [G.707] as well as [RFC3471], [RFC3472], and [RFC3473]. The following abbreviations are used in this document:",
      "zh-CHS": "此外，假定读者熟悉ANSI[T1.105]、ITU-T[G.707]以及[RFC3471]、[RFC3472]和[RFC3473]中的术语。本文件中使用了以下缩写："
    },
    {
      "indent": 3,
      "text": "DCC: Data Communications Channel. LOVC: Lower Order Virtual Container HOVC: Higher Order Virtual Container MS: Multiplex Section. MSOH: Multiplex Section overhead. POH: Path overhead. RS: Regenerator Section. RSOH: Regenerator section overhead. SDH: Synchronous digital hierarchy. SOH: Section overhead. SONET: Synchronous Optical Network. SPE: Synchronous Payload Envelope. STM(-N): Synchronous Transport Module (-N) (SDH). STS(-N): Synchronous Transport Signal-Level N (SONET). VC-n: Virtual Container-n (SDH). VTn: Virtual Tributary-n (SONET).",
      "zh-CHS": "数据通信信道。LOVC：低阶虚拟容器HOVC：高阶虚拟容器MS：复用段。MSOH：多路复用段开销。路径开销。RS：再生器部分。RSOH：再生器段顶置。SDH：同步数字体系。SOH：部分开销。同步光网络。SPE：同步有效负载包络。STM（-N）：同步传输模块（-N）（SDH）。STS（-N）：同步传输信号电平N（SONET）。VC-n：虚拟容器n（SDH）。虚拟支路-n（SONET）。"
    },
    {
      "indent": 0,
      "text": "2. SONET and SDH Traffic Parameters",
      "section_title": true,
      "zh-CHS": "2. SONET和SDH业务参数"
    },
    {
      "indent": 3,
      "text": "This section defines the GMPLS traffic parameters for SONET/SDH. The protocol specific formats, for the SONET/SDH-specific RSVP-TE objects and CR-LDP TLVs are described in sections 2.2 and 2.3 respectively.",
      "zh-CHS": "本节定义了SONET/SDH的GMPLS流量参数。SONET/SDH特定RSVP-TE对象和CR-LDP TLV的协议特定格式分别在第2.2节和第2.3节中描述。"
    },
    {
      "indent": 3,
      "text": "These traffic parameters specify indeed a base set of capabilities for SONET ANSI [T1.105] and SDH ITU-T [G.707] such as concatenation and transparency. Other documents may further enhance this set of capabilities in the future. For instance, signaling for SDH over PDH ITU-T G.832 or sub-STM-0 ITU-T G.708 interfaces could be defined.",
      "zh-CHS": "这些流量参数实际上为SONET ANSI[T1.105]和SDH ITU-T[G.707]指定了一组基本功能，如连接和透明。将来，其他文档可能会进一步增强这组功能。例如，可以定义PDH ITU-T G.832或sub-STM-0 ITU-T G.708接口上的SDH信令。"
    },
    {
      "indent": 3,
      "text": "The traffic parameters defined hereafter (see Section 2.1) MUST be used when the label is encoded as SUKLM as defined in this memo (see Section 3). They MUST also be used when requesting one of Section/RS or Line/MS overhead transparent STS-1/STM-0, STS-3*N/STM-N (N=1, 4, 16, 64, 256) signals.",
      "zh-CHS": "当标签编码为本备忘录（见第3节）中定义的SUKLM时，必须使用下文定义的交通参数（见第2.1节）。当请求区段/RS或线路/MS架空透明STS-1/STM-0、STS-3*N/STM-N（N=1,4,16,64,256）信号时，也必须使用它们。"
    },
    {
      "indent": 3,
      "text": "The traffic parameters and label encoding defined in [RFC3471], Section 3.2, MUST be used for fully transparent STS-1/STM-0, STS-3*N/STM-N (N=1, 4, 16, 64, 256) signal requests. A fully transparent signal is one for which all overhead is left unmodified by intermediate nodes, i.e., when all defined Transparency (T) bits would be set if the traffic parameters defined in section 2.1 were used.",
      "zh-CHS": "[RFC3471]第3.2节中定义的流量参数和标签编码必须用于完全透明的STS-1/STM-0、STS-3*N/STM-N（N=1,4,16,64,256）信号请求。完全透明信号是指中间节点不修改所有开销的信号，即，如果使用第2.1节中定义的流量参数，将设置所有定义的透明（T）位。"
    },
    {
      "indent": 0,
      "text": "2.1. SONET/SDH Traffic Parameters",
      "section_title": true,
      "zh-CHS": "2.1. SONET/SDH业务参数"
    },
    {
      "indent": 3,
      "text": "The traffic parameters for SONET/SDH are organized as follows:",
      "zh-CHS": "SONET/SDH的业务参数组织如下："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Signal Type  |      RCC      |              NCC              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              NVC              |        Multiplier (MT)        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Transparency (T)                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Profile (P)                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Annex 1 lists examples of SONET and SDH signal coding.",
      "zh-CHS": "附件1列出了SONET和SDH信号编码的示例。"
    },
    {
      "indent": 3,
      "text": "Signal Type (ST): 8 bits",
      "zh-CHS": "信号类型（ST）：8位"
    },
    {
      "indent": 3,
      "text": "This field indicates the type of Elementary Signal that comprises the requested LSP. Several transforms can be applied successively on the Elementary Signal to build the Final Signal being actually requested for the LSP.",
      "zh-CHS": "此字段指示组成所请求LSP的基本信号的类型。可以对基本信号连续应用多个变换，以构建LSP实际请求的最终信号。"
    },
    {
      "indent": 3,
      "text": "Each transform application is optional and must be ignored if zero, except the Multiplier (MT) that cannot be zero and is ignored if equal to one.",
      "zh-CHS": "每个变换应用程序都是可选的，如果为零，则必须忽略，但乘数（MT）不能为零，如果等于1，则忽略。"
    },
    {
      "indent": 3,
      "text": "Transforms must be applied strictly in the following order:",
      "zh-CHS": "必须严格按照以下顺序应用变换："
    },
    {
      "indent": 3,
      "text": "- First, contiguous concatenation (by using the RCC and NCC fields) can be optionally applied on the Elementary Signal, resulting in a contiguously concatenated signal.",
      "zh-CHS": "- 首先，可以选择性地对基本信号应用连续级联（通过使用RCC和NCC字段），从而产生连续级联的信号。"
    },
    {
      "indent": 3,
      "text": "- Second, virtual concatenation (by using the NVC field) can be optionally applied on the Elementary Signal resulting in a virtually concatenated signal.",
      "zh-CHS": "- 第二，虚拟级联（通过使用NVC字段）可以选择性地应用于基本信号，从而产生虚拟级联信号。"
    },
    {
      "indent": 3,
      "text": "- Third, some transparency (by using the Transparency field) can be optionally specified when requesting a frame as signal rather than an SPE or VC based signal.",
      "zh-CHS": "- 第三，当请求帧作为信号而不是基于SPE或VC的信号时，可以选择指定一些透明度（通过使用透明度字段）。"
    },
    {
      "indent": 3,
      "text": "- Fourth, a multiplication (by using the Multiplier field) can be optionally applied either directly on the Elementary Signal, or on the contiguously concatenated signal obtained from the first phase, or on the virtually concatenated signal obtained from the second phase, or on these signals combined with some transparency.",
      "zh-CHS": "- 第四，乘法（通过使用乘法器字段）可以任选地直接应用于基本信号，或者应用于从第一相位获得的连续级联信号，或者应用于从第二相位获得的虚拟级联信号，或者应用于结合了某种透明度的这些信号。"
    },
    {
      "indent": 3,
      "text": "Permitted Signal Type values for SONET/SDH are:",
      "zh-CHS": "SONET/SDH允许的信号类型值为："
    },
    {
      "indent": 3,
      "text": "Value  Type (Elementary Signal)\n-----  ------------------------\n 1     VT1.5  SPE / VC-11\n 2     VT2    SPE / VC-12\n 3     VT3    SPE\n 4     VT6    SPE / VC-2\n 5     STS-1  SPE / VC-3\n 6     STS-3c SPE / VC-4\n 7     STS-1      / STM-0   (only when requesting transparency)\n 8     STS-3      / STM-1   (only when requesting transparency)\n 9     STS-12     / STM-4   (only when requesting transparency)\n 10    STS-48     / STM-16  (only when requesting transparency)\n 11    STS-192    / STM-64  (only when requesting transparency)\n 12    STS-768    / STM-256 (only when requesting transparency)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A dedicated signal type is assigned to a SONET STS-3c SPE instead of coding it as a contiguous concatenation of three STS-1 SPEs. This is done in order to provide easy interworking between SONET and SDH signaling.",
      "zh-CHS": "将专用信号类型分配给SONET STS-3c SPE，而不是将其编码为三个STS-1 SPE的连续级联。这样做是为了在SONET和SDH信令之间提供方便的互通。"
    },
    {
      "indent": 3,
      "text": "Appendix 1 adds one signal type (optional) to the above values.",
      "zh-CHS": "附录1为上述值增加了一种信号类型（可选）。"
    },
    {
      "indent": 3,
      "text": "Requested Contiguous Concatenation (RCC): 8 bits",
      "zh-CHS": "请求的连续连接（RCC）：8位"
    },
    {
      "indent": 3,
      "text": "This field is used to request the optional SONET/SDH contiguous concatenation of the Elementary Signal.",
      "zh-CHS": "此字段用于请求基本信号的可选SONET/SDH连续级联。"
    },
    {
      "indent": 3,
      "text": "This field is a vector of flags. Each flag indicates the support of a particular type of contiguous concatenation. Several flags can be set at the same time to indicate a choice.",
      "zh-CHS": "此字段是标志向量。每个标志都表示支持特定类型的连续连接。可以同时设置多个标志以指示选择。"
    },
    {
      "indent": 3,
      "text": "These flags allow an upstream node to indicate to a downstream node the different types of contiguous concatenation that it supports. However, the downstream node decides which one to use according to its own rules.",
      "zh-CHS": "这些标志允许上游节点向下游节点指示其支持的不同类型的连续连接。但是，下游节点根据自己的规则决定使用哪个节点。"
    },
    {
      "indent": 3,
      "text": "A downstream node receiving simultaneously more than one flag chooses a particular type of contiguous concatenation, if any supported, and based on criteria that are out of this document scope. A downstream node that doesn't support any of the concatenation types indicated by the field must refuse the LSP request. In particular, it must refuse the LSP request if it doesn't support contiguous concatenation at all.",
      "zh-CHS": "同时接收多个标志的下游节点根据超出此文档范围的条件选择特定类型的连续连接（如果支持）。不支持该字段指示的任何串联类型的下游节点必须拒绝LSP请求。特别是，如果它根本不支持连续连接，就必须拒绝LSP请求。"
    },
    {
      "indent": 3,
      "text": "When several flags have been set, the upstream node retrieves the (single) type of contiguous concatenation the downstream node has selected by looking at the position indicated by the first label and the number of label(s) as returned by the downstream node (see also Section 3).",
      "zh-CHS": "当设置了多个标志时，上游节点通过查看第一个标签指示的位置和下游节点返回的标签数量（另请参见第3节），检索下游节点已选择的（单一）连续连接类型。"
    },
    {
      "indent": 3,
      "text": "The entire field is set to zero to indicate that no contiguous concatenation is requested at all (default value). A non-zero field indicates that some contiguous concatenation is requested.",
      "zh-CHS": "整个字段设置为零，表示根本不请求连续连接（默认值）。非零字段表示请求某些连续连接。"
    },
    {
      "indent": 3,
      "text": "The following flag is defined:",
      "zh-CHS": "定义了以下标志："
    },
    {
      "indent": 6,
      "text": "Flag 1 (bit 1): Standard contiguous concatenation.",
      "zh-CHS": "标志1（位1）：标准连续连接。"
    },
    {
      "indent": 3,
      "text": "Flag 1 indicates that the standard SONET/SDH contiguous concatenation as defined in [T1.105]/[G.707] is supported. Note that bit 1 is the low order bit. Other flags are reserved for extensions, if not used they must be set to zero when sent, and should be ignored when received.",
      "zh-CHS": "标志1表示支持[T1.105]/[G.707]中定义的标准SONET/SDH连续级联。请注意，位1是低阶位。其他标志为扩展保留，如果未使用，则在发送时必须将其设置为零，在接收时应忽略。"
    },
    {
      "indent": 3,
      "text": "See note 1 hereafter in the section on the NCC about the SONET contiguous concatenation of STS-1 SPEs when the number of components is a multiple of three.",
      "zh-CHS": "当组件数量为三的倍数时，有关STS-1 SPE的SONET连续级联的NCC部分见下文注释1。"
    },
    {
      "indent": 6,
      "text": "Number of Contiguous Components (NCC): 16 bits",
      "zh-CHS": "连续组件数（NCC）：16位"
    },
    {
      "indent": 3,
      "text": "This field indicates the number of identical SONET SPEs/SDH VCs (i.e., Elementary Signal) that are requested to be concatenated, as specified in the RCC field.",
      "zh-CHS": "该字段表示按照RCC字段中的规定，请求连接的相同SONET SPE/SDH VCs（即基本信号）的数量。"
    },
    {
      "indent": 3,
      "text": "Note 1: when requesting a SONET STS-Nc SPE with N=3*X, the Elementary Signal to use must always be an STS-3c_SPE signal type and the value of NCC must always be equal to X. This allows also facilitating the interworking between SONET and SDH. In particular, it means that the contiguous concatenation of three STS-1 SPEs can not be requested because according to this specification, this type of signal must be coded using the STS-3c SPE signal type.",
      "zh-CHS": "注1：当请求N=3*X的SONET STS Nc SPE时，要使用的基本信号必须始终为STS-3c_SPE信号类型，且NCC值必须始终等于X。这还允许促进SONET和SDH之间的互通。特别是，这意味着不能请求三个STS-1 SPE的连续级联，因为根据本规范，必须使用STS-3c SPE信号类型对此类信号进行编码。"
    },
    {
      "indent": 3,
      "text": "Note 2: when requesting a transparent STS-N/STM-N signal limited to a single contiguously concatenated STS-Nc_SPE/VC-4-Nc, the signal type must be STS-N/STM-N, RCC with flag 1 and NCC set to 1.",
      "zh-CHS": "注2：当请求透明STS-N/STM-N信号仅限于单个连续连接的STS-Nc_SPE/VC-4-Nc时，信号类型必须为STS-N/STM-N、RCC，且标志1和NCC设置为1。"
    },
    {
      "indent": 3,
      "text": "The NCC value must be consistent with the type of contiguous concatenation being requested in the RCC field. In particular, this field is irrelevant if no contiguous concatenation is requested (RCC = 0), in that case it must be set to zero when sent, and should be ignored when received. A RCC value different from 0 must imply a number of contiguous components greater than 1.",
      "zh-CHS": "NCC值必须与RCC字段中请求的连续连接类型一致。特别是，如果未请求连续连接（RCC=0），则此字段不相关，在这种情况下，发送时必须将其设置为零，接收时应忽略此字段。不同于0的RCC值必须表示多个连续组件大于1。"
    },
    {
      "indent": 6,
      "text": "Number of Virtual Components (NVC): 16 bits",
      "zh-CHS": "虚拟组件数（NVC）：16位"
    },
    {
      "indent": 3,
      "text": "This field indicates the number of signals that are requested to be virtually concatenated. These signals are all of the same type by definition. They are Elementary Signal SPEs/VCs for which signal types are defined in this document, i.e., VT1.5_SPE/VC-11, VT2_SPE/VC-12, VT3_SPE, VT6_SPE/VC-2, STS-1_SPE/VC-3 or STS-3c_SPE/VC-4.",
      "zh-CHS": "此字段表示请求进行虚拟连接的信号数。根据定义，这些信号都属于同一类型。它们是基本信号SPE/VC，本文件中定义了其信号类型，即VT1.5_SPE/VC-11、VT2_SPE/VC-12、VT3_SPE、VT6_SPE/VC-2、STS-1_SPE/VC-3或STS-3c_SPE/VC-4。"
    },
    {
      "indent": 3,
      "text": "This field is set to 0 (default value) to indicate that no virtual concatenation is requested.",
      "zh-CHS": "此字段设置为0（默认值），表示未请求虚拟连接。"
    },
    {
      "indent": 6,
      "text": "Multiplier (MT): 16 bits",
      "zh-CHS": "乘法器（MT）：16位"
    },
    {
      "indent": 3,
      "text": "This field indicates the number of identical signals that are requested for the LSP, i.e., that form the Final Signal. These signals can be either identical Elementary Signals, or identical contiguously concatenated signals, or identical virtually concatenated signals. Note that all these signals belong thus to the same LSP.",
      "zh-CHS": "该字段表示为LSP请求的相同信号的数量，即形成最终信号的数量。这些信号可以是相同的基本信号，或者相同的连续级联信号，或者相同的虚拟级联信号。请注意，所有这些信号因此属于同一LSP。"
    },
    {
      "indent": 3,
      "text": "The distinction between the components of multiple virtually concatenated signals is done via the order of the labels that are specified in the signaling. The first set of labels must describe the first component (set of individual signals belonging to the first",
      "zh-CHS": "通过信令中指定的标签顺序来区分多个虚拟级联信号的分量。第一组标签必须描述第一个组件（属于第一个组件的一组单独信号"
    },
    {
      "indent": 3,
      "text": "virtual concatenated signal), the second set must describe the second component (set of individual signals belonging to the second virtual concatenated signal) and so on.",
      "zh-CHS": "虚拟级联信号），第二组必须描述第二个组件（属于第二个虚拟级联信号的单个信号集），依此类推。"
    },
    {
      "indent": 3,
      "text": "This field is set to one (default value) to indicate that exactly one instance of a signal is being requested. Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested multiplier value. If the requested values can not be supported, the receiver node MUST generate a PathErr/NOTIFICATION message (see Section 2.2/2.3, respectively).",
      "zh-CHS": "此字段设置为一（默认值），以指示正请求一个信号的一个实例。中间和出口节点必须验证节点本身和将在其上建立LSP的接口是否能够支持请求的乘数值。如果请求的值不受支持，则接收方节点必须生成PathErr/通知消息（分别参见第2.2/2.3节）。"
    },
    {
      "indent": 3,
      "text": "Zero is an invalid value. If received, the node MUST generate a PathErr/NOTIFICATION message (see Section 2.2/2.3, respectively).",
      "zh-CHS": "零是无效值。如果收到，节点必须生成PathErr/通知消息（分别参见第2.2/2.3节）。"
    },
    {
      "indent": 3,
      "text": "Note 1: when requesting a transparent STS-N/STM-N signal limited to a single contiguously concatenated STS-Nc-SPE/VC-4-Nc, the multiplier field MUST be equal to 1 (only valid value).",
      "zh-CHS": "注1：当请求限制为单个连续串联STS Nc SPE/VC-4-Nc的透明STS-N/STM-N信号时，乘法器字段必须等于1（仅有效值）。"
    },
    {
      "indent": 6,
      "text": "Transparency (T): 32 bits",
      "zh-CHS": "透明度（T）：32位"
    },
    {
      "indent": 3,
      "text": "This field is a vector of flags that indicates the type of transparency being requested. Several flags can be combined to provide different types of transparency. Not all combinations are necessarily valid. The default value for this field is zero, i.e., no transparency requested.",
      "zh-CHS": "此字段是一个标志向量，指示所请求的透明度类型。可以组合多个标志以提供不同类型的透明度。并非所有的组合都一定有效。此字段的默认值为零，即不要求透明度。"
    },
    {
      "indent": 3,
      "text": "Transparency, as defined from the point of view of this signaling specification, is only applicable to the fields in the SONET/SDH frame overheads. In the SONET case, these are the fields in the Section Overhead (SOH), and the Line Overhead (LOH). In the SDH case, these are the fields in the Regenerator Section Overhead (RSOH), the Multiplex Section overhead (MSOH), and the pointer fields between the two. With SONET, the pointer fields are part of the LOH.",
      "zh-CHS": "从本信令规范的角度定义的透明度仅适用于SONET/SDH帧开销中的字段。在SONET情况下，这些是区段开销（SOH）和线路开销（LOH）中的字段。在SDH情况下，这些是再生器部分开销（RSOH）、多路复用部分开销（MSOH）中的字段，以及两者之间的指针字段。对于SONET，指针字段是LOH的一部分。"
    },
    {
      "indent": 3,
      "text": "Note as well that transparency is only applicable when using the following Signal Types: STS-1/STM-0, STS-3/STM-1, STS-12/STM-4, STS-48/STM-16, STS-192/STM-64 and STS-768/STM-256. At least one transparency type must be specified when requesting such a signal type.",
      "zh-CHS": "还要注意，透明度仅在使用以下信号类型时适用：STS-1/STM-0、STS-3/STM-1、STS-12/STM-4、STS-48/STM-16、STS-192/STM-64和STS-768/STM-256。请求此类信号类型时，必须至少指定一种透明度类型。"
    },
    {
      "indent": 3,
      "text": "Transparency indicates precisely which fields in these overheads must be delivered unmodified at the other end of the LSP. An ingress LSR requesting transparency will pass these overhead fields that must be delivered to the egress LSR without any change. From the ingress and egress LSRs point of views, these fields must be seen as unmodified.",
      "zh-CHS": "透明度精确地指示这些开销中的哪些字段必须在LSP的另一端不经修改地交付。请求透明性的入口LSR将传递这些开销字段，这些开销字段必须在没有任何更改的情况下传递给出口LSR。从入口和出口LSR的角度来看，这些字段必须视为未修改。"
    },
    {
      "indent": 3,
      "text": "Transparency is not applied at the interfaces with the initiating and terminating LSRs, but is only applied between intermediate LSRs.",
      "zh-CHS": "透明度不应用于与起始和终止LSR的接口，而仅应用于中间LSR之间。"
    },
    {
      "indent": 3,
      "text": "The transparency field is used to request an LSP that supports the requested transparency type; it may also be used to setup the transparency process to be applied at each intermediate LSR.",
      "zh-CHS": "透明度字段用于请求支持请求的透明度类型的LSP；它还可用于设置将应用于每个中间LSR的透明度过程。"
    },
    {
      "indent": 3,
      "text": "The different transparency flags are the following:",
      "zh-CHS": "不同的透明度标志如下所示："
    },
    {
      "indent": 6,
      "text": "Flag 1 (bit 1): Section/Regenerator Section layer. Flag 2 (bit 2): Line/Multiplex Section layer.",
      "zh-CHS": "标志1（位1）：截面/再生器截面层。标志2（位2）：线路/多路复用部分层。"
    },
    {
      "indent": 3,
      "text": "Where bit 1 is the low order bit. Other flags are reserved, they should be set to zero when sent, and should be ignored when received. A flag is set to one to indicate that the corresponding transparency is requested.",
      "zh-CHS": "其中，位1是低阶位。其他标志是保留的，发送时应设置为零，接收时应忽略。将标志设置为1，以指示请求了相应的透明度。"
    },
    {
      "indent": 3,
      "text": "Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested transparency. If the requested flags can not be supported, the receiver node MUST generate a PathErr/NOTIFICATION message (see Section 2.2/2.3, respectively).",
      "zh-CHS": "中间和出口节点必须验证节点本身以及将在其上建立LSP的接口是否能够支持请求的透明度。如果请求的标志不受支持，则接收方节点必须生成PathErr/通知消息（分别参见第2.2/2.3节）。"
    },
    {
      "indent": 3,
      "text": "Section/Regenerator Section layer transparency means that the entire frames must be delivered unmodified. This implies that pointers cannot be adjusted. When using Section/Regenerator Section layer transparency all other flags MUST be ignored.",
      "zh-CHS": "截面/再生器截面层透明度意味着整个框架必须在未修改的情况下交付。这意味着指针无法调整。使用截面/再生器截面层透明度时，必须忽略所有其他标志。"
    },
    {
      "indent": 3,
      "text": "Line/Multiplex Section layer transparency means that the LOH/MSOH must be delivered unmodified. This implies that pointers cannot be adjusted.",
      "zh-CHS": "线路/多路复用部分层透明度意味着LOH/MSOH必须在未经修改的情况下交付。这意味着指针无法调整。"
    },
    {
      "indent": 3,
      "text": "Profile (P): 32 bits",
      "zh-CHS": "配置文件（P）：32位"
    },
    {
      "indent": 3,
      "text": "This field is intended to indicate particular capabilities that must be supported for the LSP, for example monitoring capabilities.",
      "zh-CHS": "此字段用于指示LSP必须支持的特定功能，例如监控功能。"
    },
    {
      "indent": 3,
      "text": "No standard profile is currently defined and this field SHOULD be set to zero when transmitted and SHOULD be ignored when received.",
      "zh-CHS": "当前未定义标准配置文件，此字段在传输时应设置为零，在接收时应忽略。"
    },
    {
      "indent": 3,
      "text": "In the future TLV based extensions may be created.",
      "zh-CHS": "将来可能会创建基于TLV的扩展。"
    },
    {
      "indent": 0,
      "text": "2.2. RSVP-TE Details",
      "section_title": true,
      "zh-CHS": "2.2. RSVP-TE详细信息"
    },
    {
      "indent": 3,
      "text": "For RSVP-TE, the SONET/SDH traffic parameters are carried in the SONET/SDH SENDER_TSPEC and FLOWSPEC objects. The same format is used both for SENDER_TSPEC object and FLOWSPEC objects. The content of the objects is defined above in Section 2.1. The objects have the following class and type:",
      "zh-CHS": "对于RSVP-TE，SONET/SDH流量参数在SONET/SDH发送方和FLOWSPEC对象中携带。SENDER_TSPEC对象和FLOWSPEC对象使用相同的格式。上述第2.1节定义了对象的内容。对象具有以下类别和类型："
    },
    {
      "indent": 3,
      "text": "For SONET ANSI T1.105 and SDH ITU-T G.707:",
      "zh-CHS": "对于SONET ANSI T1.105和SDH ITU-T G.707："
    },
    {
      "indent": 3,
      "text": "SONET/SDH SENDER_TSPEC object: Class = 12, C-Type = 4\nSONET/SDH FLOWSPEC object: Class = 9, C-Type = 4",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "There is no Adspec associated with the SONET/SDH SENDER_TSPEC. Either the Adspec is omitted or an int-serv Adspec with the Default General Characterization Parameters and Guaranteed Service fragment is used, see [RFC2210].",
      "zh-CHS": "没有与SONET/SDH发送方相关的Adspec。要么省略Adspec，要么使用具有默认通用特征参数和保证服务片段的int-serv Adspec，请参见[RFC2210]。"
    },
    {
      "indent": 3,
      "text": "For a particular sender in a session the contents of the FLOWSPEC object received in a Resv message SHOULD be identical to the contents of the SENDER_TSPEC object received in the corresponding Path message. If the objects do not match, a ResvErr message with a \"Traffic Control Error/Bad Flowspec value\" error SHOULD be generated.",
      "zh-CHS": "对于会话中的特定发送方，在Resv消息中接收的FLOWSPEC对象的内容应与在相应Path消息中接收的发送方\\u TSPEC对象的内容相同。如果对象不匹配，则应生成带有“交通控制错误/错误的Flowspec值”错误的ResvErr消息。"
    },
    {
      "indent": 3,
      "text": "Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested Signal Type, RCC, NCC, NVC and Multiplier (as defined in Section 2.1). If the requested value(s) can not be supported, the receiver node MUST generate a PathErr message with a \"Traffic Control Error/ Service unsupported\" indication (see [RFC2205]).",
      "zh-CHS": "中间和出口节点必须验证节点本身和将建立LSP的接口是否能够支持请求的信号类型、RCC、NCC、NVC和乘法器（如第2.1节所定义）。如果请求的值不受支持，则接收方节点必须生成带有“流量控制错误/服务不受支持”指示的PathErr消息（请参阅[RFC2205]）。"
    },
    {
      "indent": 3,
      "text": "In addition, if the MT field is received with a zero value, the node MUST generate a PathErr message with a \"Traffic Control Error/Bad Tspec value\" indication (see [RFC2205]).",
      "zh-CHS": "此外，如果收到的MT字段值为零值，则节点必须生成带有“流量控制错误/错误Tspec值”指示的PathErr消息（请参阅[RFC2205]）。"
    },
    {
      "indent": 3,
      "text": "Intermediate nodes MUST also verify that the node itself and the interfaces on which the LSP will be established can support the requested Transparency (as defined in Section 2.1). If the requested value(s) can not be supported, the receiver node MUST generate a PathErr message with a \"Traffic Control Error/Service unsupported\" indication (see [RFC2205]).",
      "zh-CHS": "中间节点还必须验证节点本身和将建立LSP的接口是否能够支持请求的透明度（如第2.1节所定义）。如果请求的值不受支持，则接收方节点必须生成带有“流量控制错误/服务不受支持”指示的PathErr消息（请参阅[RFC2205]）。"
    },
    {
      "indent": 0,
      "text": "2.3. CR-LDP Details",
      "section_title": true,
      "zh-CHS": "2.3. CR-LDP详细信息"
    },
    {
      "indent": 3,
      "text": "For CR-LDP, the SONET/SDH traffic parameters are carried in the SONET/SDH Traffic Parameters TLV. The content of the TLV is defined above in Section 2.1. The header of the TLV has the following format:",
      "zh-CHS": "对于CR-LDP，SONET/SDH业务参数在SONET/SDH业务参数TLV中携带。TLV的内容见上文第2.1节。TLV的标题具有以下格式："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F|          Type             |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The type field for the SONET/SDH Traffic Parameters TLV is: 0x0838.",
      "zh-CHS": "SONET/SDH流量参数TLV的类型字段为：0x0838。"
    },
    {
      "indent": 3,
      "text": "Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested Signal Type, RCC, NCC, NVC and Multiplier (as defined in Section 2.1). If the requested value(s) can not be supported, the receiver node MUST generate a NOTIFICATION message with a \"Resource Unavailable\" status code (see [RFC3212]).",
      "zh-CHS": "中间和出口节点必须验证节点本身和将建立LSP的接口是否能够支持请求的信号类型、RCC、NCC、NVC和乘法器（如第2.1节所定义）。如果无法支持请求的值，则接收方节点必须生成带有“资源不可用”状态代码的通知消息（请参阅[RFC3212]）。"
    },
    {
      "indent": 3,
      "text": "In addition, if the MT field is received with a zero value, the node MUST generate a NOTIFICATION message with a \"Resource Unavailable\" status code (see [RFC3212]).",
      "zh-CHS": "此外，如果收到的MT字段值为零值，则节点必须生成带有“资源不可用”状态代码的通知消息（请参阅[RFC3212]）。"
    },
    {
      "indent": 3,
      "text": "Intermediate nodes MUST also verify that the node itself and the interfaces on which the LSP will be established can support the requested Transparency (as defined in Section 2.1). If the requested value(s) can not be supported, the receiver node MUST generate a NOTIFICATION message with a \"Resource Unavailable\" status code (see [RFC3212]).",
      "zh-CHS": "中间节点还必须验证节点本身和将建立LSP的接口是否能够支持请求的透明度（如第2.1节所定义）。如果无法支持请求的值，则接收方节点必须生成带有“资源不可用”状态代码的通知消息（请参阅[RFC3212]）。"
    },
    {
      "indent": 0,
      "text": "3. SONET and SDH Labels",
      "section_title": true,
      "zh-CHS": "3. SONET和SDH标签"
    },
    {
      "indent": 3,
      "text": "SONET and SDH each define a multiplexing structure. Both structures are trees whose roots are respectively an STS-N or an STM-N; and whose leaves are the signals that can be transported via the time-slots and switched between time-slots within an ingress port and time-slots within an egress port, i.e., a VTx SPE, an STS-x SPE or a VC-x. A SONET/SDH label will identify the exact position (i.e., first time-slot) of a particular VTx SPE, STS-x SPE or VC-x signal in a multiplexing structure. SONET and SDH labels are carried in the Generalized Label per [RFC3473] and [RFC3472].",
      "zh-CHS": "SONET和SDH各自定义了多路复用结构。这两种结构都是根分别为STS-N或STM-N的树；其叶是可以经由时隙传输并在入口端口内的时隙和出口端口内的时隙之间切换的信号，即VTx SPE、STS-x SPE或VC-x。SONET/SDH标签将标识多路复用结构中特定VTx SPE、STS-x SPE或VC-x信号的准确位置（即第一个时隙）。SONET和SDH标签按照[RFC3473]和[RFC3472]在通用标签中携带。"
    },
    {
      "indent": 3,
      "text": "Note that by time-slots we mean the time-slots as they appear logically and sequentially in the multiplex, not as they appear after any possible interleaving.",
      "zh-CHS": "注意，时隙是指多路复用中逻辑和顺序出现的时隙，而不是在任何可能的交织后出现的时隙。"
    },
    {
      "indent": 3,
      "text": "These multiplexing structures will be used as naming trees to create unique multiplex entry names or labels. The same format of label is used for SONET and SDH. As explained in [RFC3471], a label does not identify the \"class\" to which the label belongs. This is implicitly determined by the link on which the label is used.",
      "zh-CHS": "这些多路复用结构将用作命名树，以创建唯一的多路复用条目名称或标签。SONET和SDH使用相同格式的标签。如[RFC3471]所述，标签不标识标签所属的“类别”。这由使用标签的链接隐式确定。"
    },
    {
      "indent": 3,
      "text": "In case of signal concatenation or multiplication, a list of labels can appear in the Label field of a Generalized Label.",
      "zh-CHS": "在信号串联或乘法的情况下，标签列表可以出现在通用标签的标签字段中。"
    },
    {
      "indent": 3,
      "text": "In case of contiguous concatenation, only one label appears in the Label field. This label identifies the lowest time-slot occupied by the contiguously concatenated signal. By lowest time-slot we mean the one having the lowest label (value) when compared as integer values, i.e., the time-slot occupied by the first component signal of the concatenated signal encountered when descending the tree.",
      "zh-CHS": "在连续连接的情况下，标签字段中只显示一个标签。此标签标识连续级联信号占用的最低时隙。最低时隙是指当作为整数值进行比较时具有最低标签（值）的时隙，即，下行树时遇到的级联信号的第一分量信号占用的时隙。"
    },
    {
      "indent": 3,
      "text": "In case of virtual concatenation, the explicit ordered list of all labels in the concatenation is given. Each label indicates the first time-slot occupied by a component of the virtually concatenated signal. The order of the labels must reflect the order of the payloads to concatenate (not the physical order of time-slots). The above representation limits virtual concatenation to remain within a single (component) link; it imposes as such a restriction compared to the ANSI [T1.105]/ITU-T [G.707] recommendations.",
      "zh-CHS": "在虚拟连接的情况下，将给出连接中所有标签的显式有序列表。每个标签表示虚拟级联信号的一个分量占用的第一个时隙。标签的顺序必须反映要连接的有效负载的顺序（而不是时隙的物理顺序）。上述表示将虚拟连接限制为保留在单个（组件）链路内；与ANSI[T1.105]/ITU-T[G.707]建议相比，它施加了这样的限制。"
    },
    {
      "indent": 3,
      "text": "The standard definition for virtual concatenation allows each virtual concatenation components to travel over diverse paths. Within GMPLS, virtual concatenation components must travel over the same (component) link if they are part of the same LSP. This is due to the way that labels are bound to a (component) link. Note however, that the routing of components on different paths is indeed equivalent to establishing different LSPs, each one having its own route. Several LSPs can be initiated and terminated between the same nodes and their corresponding components can then be associated together (i.e., virtually concatenated).",
      "zh-CHS": "虚拟连接的标准定义允许每个虚拟连接组件在不同的路径上移动。在GMPLS中，如果虚拟连接组件是同一LSP的一部分，则它们必须在同一（组件）链路上传输。这是由于标签绑定到（组件）链接的方式造成的。但是请注意，不同路径上组件的路由实际上相当于建立不同的LSP，每个LSP都有自己的路由。可以在相同节点之间启动和终止多个LSP，然后可以将它们相应的组件关联在一起（即，虚拟连接）。"
    },
    {
      "indent": 3,
      "text": "In case of multiplication (i.e., using the multiplier transform), the explicit ordered list of all labels that take part in the Final Signal is given. In case of multiplication of virtually concatenated signals, the first set of labels indicates the time-slots occupied by the first virtually concatenated signal, the second set of labels indicates the time-slots occupied by the second virtually concatenated signal, and so on. The above representation limits multiplication to remain within a single (component) link.",
      "zh-CHS": "在乘法的情况下（即，使用乘法器变换），给出参与最终信号的所有标签的显式有序列表。在虚拟级联信号相乘的情况下，第一组标签指示由第一虚拟级联信号占用的时隙，第二组标签指示由第二虚拟级联信号占用的时隙，依此类推。上述表示法将乘法限制在单个（组件）链接内。"
    },
    {
      "indent": 3,
      "text": "The format of the label for SONET and/or SDH TDM-LSR link is:",
      "zh-CHS": "SONET和/或SDH TDM-LSR链路的标签格式为："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               S               |   U   |   K   |   L   |   M   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This is an extension of the numbering scheme defined in [G.707] sections 7.3.7 to 7.3.13, i.e., the (K, L, M) numbering. Note that the higher order numbering scheme defined in [G.707] sections 7.3.1 to 7.3.6 is not used here.",
      "zh-CHS": "这是[G.707]第7.3.7节至第7.3.13节中定义的编号方案的扩展，即（K，L，M）编号。注意，此处不使用[G.707]第7.3.1至7.3.6节中定义的高阶编号方案。"
    },
    {
      "indent": 3,
      "text": "Each letter indicates a possible branch number starting at the parent node in the multiplex structure. Branches are considered as numbered in increasing order, starting from the top of the multiplexing structure. The numbering starts at 1, zero is used to indicate a non-significant or ignored field.",
      "zh-CHS": "每个字母表示从多路复用结构中的父节点开始的可能的分支编号。分支被视为按递增顺序编号，从多路复用结构的顶部开始。编号从1开始，零用于表示不重要或忽略的字段。"
    },
    {
      "indent": 3,
      "text": "When a field is not significant or ignored in a particular context it MUST be set to zero when transmitted, and MUST be ignored when received.",
      "zh-CHS": "当某个字段在特定上下文中不重要或被忽略时，它在传输时必须设置为零，在接收时必须被忽略。"
    },
    {
      "indent": 3,
      "text": "When a hierarchy of SONET/SDH LSPs is used, a higher order LSP with a given bandwidth can be used to carry lower order LSPs. Remember here that a higher order LSP is established through a SONET/SDH higher order path layer network and a lower order LSP, through a SONET/SDH lower order path layer network (see also ITU-T G.803, Section 3 for the corresponding definitions). In this context, the higher order SONET/SDH LSP behaves as a \"virtual link\" with a given bandwidth (e.g., VC-3), it may also be used as a Forwarding Adjacency. A lower order SONET/SDH LSP can be established through that higher order LSP. Since a label is local to a (virtual) link, the highest part of that label (i.e., the S, U and K fields) is non-significant and is set to zero, i.e., the label is \"0,0,0,L,M\". Similarly, if the structure of the lower order LSP is unknown or not relevant, the lowest part of that label (i.e., the L and M fields) is non-significant and is set to zero, i.e., the label is \"S,U,K,0,0\".",
      "zh-CHS": "当使用SONET/SDH LSP层次结构时，具有给定带宽的高阶LSP可用于承载低阶LSP。请记住，高阶LSP是通过SONET/SDH高阶路径层网络建立的，而低阶LSP是通过SONET/SDH低阶路径层网络建立的（相应定义参见ITU-T G.803第3节）。在该上下文中，高阶SONET/SDH LSP表现为具有给定带宽（例如VC-3）的“虚拟链路”，它还可以用作转发邻接。通过高阶LSP可以建立低阶SONET/SDH LSP。由于标签是（虚拟）链接的本地标签，因此该标签的最高部分（即S、U和K字段）不重要，并设置为零，即标签为“0,0,0，L，M”。类似地，如果低阶LSP的结构是未知的或不相关的，则该标签的最低部分（即L和M字段）是不重要的，并且被设置为零，即，标签是“S，U，K，0，0”。"
    },
    {
      "indent": 3,
      "text": "For instance, a VC-3 LSP can be used to carry lower order LSPs. In that case the labels allocated between the two ends of the VC-3 LSP for the lower order LSPs will have S, U and K set to zero, i.e., non-significant, while L and M will be used to indicate the signal allocated in that VC-3.",
      "zh-CHS": "例如，VC-3 LSP可用于携带低阶LSP。在这种情况下，分配给低阶LSP的VC-3 LSP两端之间的标签将S、U和K设置为零，即不重要，而L和M将用于指示分配给该VC-3的信号。"
    },
    {
      "indent": 3,
      "text": "In case of tunneling such as VC-4 containing VC-3 containing VC-12/VC-11 where the SUKLM structure is not adequate to represent the full signal structure, a hierarchical approach must be used, i.e., per layer network signaling.",
      "zh-CHS": "在隧道情况下，如含有VC-3的VC-4含有VC-12/VC-11，其中SUKLM结构不足以表示完整的信号结构，则必须使用分层方法，即每层网络信令。"
    },
    {
      "indent": 3,
      "text": "The possible values of S, U, K, L and M are defined as follows:",
      "zh-CHS": "S、U、K、L和M的可能值定义如下："
    },
    {
      "indent": 3,
      "text": "1. S=1->N is the index of a particular STS-3/AUG-1 inside an STS-N/STM-N multiplex. S is only significant for SONET STS-N (N>1) and SDH STM-N (N>0). S must be 0 and ignored for STS-1 and STM-0.",
      "zh-CHS": "1. S=1->N是STS-N/STM-N多路复用器内特定STS-3/AUG-1的索引。S仅对SONET STS-N（N>1）和SDH STM-N（N>0）有效。对于STS-1和STM-0，S必须为0并忽略。"
    },
    {
      "indent": 3,
      "text": "2. U=1->3 is the index of a particular STS-1_SPE/VC-3 within an STS-3/AUG-1. U is only significant for SONET STS-N (N>1) and SDH STM-N (N>0). U must be 0 and ignored for STS-1 and STM-0.",
      "zh-CHS": "2. U=1->3是STS-3/AUG-1中特定STS-1_SPE/VC-3的索引。U仅对SONET STS-N（N>1）和SDH STM-N（N>0）有效。对于STS-1和STM-0，U必须为0且被忽略。"
    },
    {
      "indent": 3,
      "text": "3. K=1->3 is the index of a particular TUG-3 within a VC-4. K is only significant for an SDH VC-4 structured in TUG-3s. K must be 0 and ignored in all other cases.",
      "zh-CHS": "3. K=1->3是VC-4中特定拖船-3的索引。K仅对TUG-3s中构造的SDH VC-4有效。K必须为0，并在所有其他情况下忽略。"
    },
    {
      "indent": 3,
      "text": "4. L=1->7 is the index of a particular VT_Group/TUG-2 within an STS-1_SPE/TUG-3 or VC-3. L must be 0 and ignored in all other cases.",
      "zh-CHS": "4. L=1->7是STS-1_SPE/TUG-3或VC-3中特定VT_组/TUG-2的索引。L必须为0，并且在所有其他情况下忽略。"
    },
    {
      "indent": 3,
      "text": "5. M is the index of a particular VT1.5_SPE/VC-11, VT2_SPE/VC-12 or VT3_SPE within a VT_Group/TUG-2. M=1->2 indicates a specific VT3 SPE inside the corresponding VT Group, these values MUST NOT be used for SDH since there is no equivalent of VT3 with SDH. M=3->5 indicates a specific VT2_SPE/VC-12 inside the corresponding VT_Group/TUG-2. M=6->9 indicates a specific VT1.5_SPE/VC-11 inside the corresponding VT_Group/TUG-2.",
      "zh-CHS": "5. M是VT_组/TUG-2内特定VT1.5_SPE/VC-11、VT2_SPE/VC-12或VT3_SPE的索引。M=1->2表示对应VT组内的特定VT3 SPE，这些值不得用于SDH，因为不存在VT3与SDH的等效值。M=3->5表示相应VT_组/TUG-2内的特定VT2_SPE/VC-12。M=6->9表示对应VT_组/TUG-2内的特定VT1.5_SPE/VC-11。"
    },
    {
      "indent": 3,
      "text": "Note that a label always has to be interpreted according the SONET/SDH traffic parameters, i.e., a label by itself does not allow knowing which signal is being requested (a label is context sensitive).",
      "zh-CHS": "请注意，标签始终必须根据SONET/SDH流量参数进行解释，即标签本身不允许知道正在请求哪个信号（标签是上下文敏感的）。"
    },
    {
      "indent": 3,
      "text": "The label format defined in this section, referred to as SUKLM, MUST be used for any SONET/SDH signal requests that are not transparent i.e., when all Transparency (T) bits defined in section 2.1 are set to zero. Any transparent STS-1/STM-0/STS-3*N/STM-N (N=1, 4, 16, 64, 256) signal request MUST use a label format as defined in [RFC3471].",
      "zh-CHS": "本节中定义的标签格式（称为SUKLM）必须用于任何不透明的SONET/SDH信号请求，即当第2.1节中定义的所有透明（T）位设置为零时。任何透明STS-1/STM-0/STS-3*N/STM-N（N=1,4,16,64,256）信号请求必须使用[RFC3471]中定义的标签格式。"
    },
    {
      "indent": 3,
      "text": "The S encoding is summarized in the following table:",
      "zh-CHS": "下表总结了S编码："
    },
    {
      "indent": 3,
      "text": " S    SDH                     SONET\n------------------------------------------------\n 0    other                   other\n 1    1st AUG-1               1st STS-3\n 2    2nd AUG-1               2nd STS-3\n 3    3rd AUG-1               3rd STS-3\n 4    4rd AUG-1               4rd STS-3\n :    :                       :\n N    Nth AUG-1               Nth STS-3",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The U encoding is summarized in the following table:",
      "zh-CHS": "下表总结了U编码："
    },
    {
      "indent": 3,
      "text": " U    SDH AUG-1               SONET STS-3\n-------------------------------------------------\n 0    other                   other\n 1    1st VC-3                1st STS-1 SPE\n 2    2nd VC-3                2nd STS-1 SPE\n 3    3rd VC-3                3rd STS-1 SPE",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The K encoding is summarized in the following table:",
      "zh-CHS": "下表总结了K编码："
    },
    {
      "indent": 3,
      "text": " K    SDH VC-4\n---------------\n 0    other\n 1    1st TUG-3\n 2    2nd TUG-3\n 3    3rd TUG-3",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The L encoding is summarized in the following table:",
      "zh-CHS": "下表总结了L编码："
    },
    {
      "indent": 3,
      "text": " L    SDH TUG-3    SDH VC-3    SONET STS-1 SPE\n-------------------------------------------------\n 0    other        other       other\n 1    1st TUG-2    1st TUG-2   1st VTG\n 2    2nd TUG-2    2nd TUG-2   2nd VTG\n 3    3rd TUG-2    3rd TUG-2   3rd VTG\n 4    4th TUG-2    4th TUG-2   4th VTG\n 5    5th TUG-2    5th TUG-2   5th VTG\n 6    6th TUG-2    6th TUG-2   6th VTG\n 7    7th TUG-2    7th TUG-2   7th VTG",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The M encoding is summarized in the following table:",
      "zh-CHS": "下表总结了M编码："
    },
    {
      "indent": 3,
      "text": " M    SDH TUG-2                 SONET VTG\n-------------------------------------------------\n 0    other                     other\n 1    -                         1st VT3 SPE\n 2    -                         2nd VT3 SPE\n 3    1st VC-12                 1st VT2 SPE\n 4    2nd VC-12                 2nd VT2 SPE\n 5    3rd VC-12                 3rd VT2 SPE\n 6    1st VC-11                 1st VT1.5 SPE\n 7    2nd VC-11                 2nd VT1.5 SPE\n 8    3rd VC-11                 3rd VT1.5 SPE\n 9    4th VC-11                 4th VT1.5 SPE",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Examples of labels:",
      "zh-CHS": "标签示例："
    },
    {
      "indent": 3,
      "text": "Example 1: the label for the STS-3c_SPE/VC-4 in the Sth STS-3/AUG-1 is: S>0, U=0, K=0, L=0, M=0.",
      "zh-CHS": "示例1:Sth STS-3/AUG-1中STS-3c_SPE/VC-4的标签为：S>0，U=0，K=0，L=0，M=0。"
    },
    {
      "indent": 3,
      "text": "Example 2: the label for the VC-3 within the Kth-1 TUG-3 within the VC-4 in the Sth AUG-1 is: S>0, U=0, K>0, L=0, M=0.",
      "zh-CHS": "例2:Sth AUG-1中VC-4内Kth-1拖船-3内VC-3的标签为：S>0，U=0，K>0，L=0，M=0。"
    },
    {
      "indent": 3,
      "text": "Example 3: the label for the Uth-1 STS-1_SPE/VC-3 within the Sth STS-3/AUG-1 is: S>0, U>0, K=0, L=0, M=0.",
      "zh-CHS": "例3:Sth STS-3/AUG-1中的Uth-1 STS-1SPE/VC-3标签为：S>0，U>0，K=0，L=0，M=0。"
    },
    {
      "indent": 3,
      "text": "Example 4: the label for the VT6/VC-2 in the Lth-1 VT Group/TUG-2 in the Uth-1 STS-1_SPE/VC-3 within the Sth STS-3/AUG-1 is: S>0, U>0, K=0, L>0, M=0.",
      "zh-CHS": "例4:Sth STS-3/AUG-1中的Uth-1 STS-1_SPE/VC-3中的Lth-1 VT组/TUG-2中的VT6/VC-2的标签为：S>0，U>0，K=0，L>0，M=0。"
    },
    {
      "indent": 3,
      "text": "Example 5: the label for the 3rd VT1.5_SPE/VC-11 in the Lth-1 VT Group/TUG-2 within the Uth-1 STS-1_SPE/VC-3 within the Sth STS-3/AUG-1 is: S>0, U>0, K=0, L>0, M=8.",
      "zh-CHS": "例5:Sth-3/AUG-1中的Uth-1 STS-1_SPE/VC-3中的Lth-1 VT组/TUG-2中的第3 VT1.5_SPE/VC-11的标签为：S>0，U>0，K=0，L>0，M=8。"
    },
    {
      "indent": 3,
      "text": "Example 6: the label for the STS-12c/VC-4-4c which uses the 9th STS-3/AUG-1 as its first timeslot is: S=9, U=0, K=0, L=0, M=0.",
      "zh-CHS": "示例6:STS-12c/VC-4-4c的标签使用第9个STS-3/AUG-1作为其第一个时隙：S=9，U=0，K=0，L=0，M=0。"
    },
    {
      "indent": 3,
      "text": "In case of contiguous concatenation, the label that is used is the lowest label (value) of the contiguously concatenated signal as explained before. The higher part of the label indicates where the signal starts and the lowest part is not significant.",
      "zh-CHS": "在连续级联的情况下，所使用的标签是如前所述的连续级联信号的最低标签（值）。标签的较高部分表示信号开始的位置，最低部分不重要。"
    },
    {
      "indent": 3,
      "text": "In case of STM-0/STS-1, the values of S, U and K must be equal to zero according to the field coding rules. For instance, when requesting a VC-3 in an STM-0 the label is S=0, U=0, K=0, L=0, M=0. When requesting a VC-11 in a VC-3 in an STM-0 the label is S=0, U=0, K=0, L>0, M=6..9.",
      "zh-CHS": "对于STM-0/STS-1，根据字段编码规则，S、U和K的值必须等于零。例如，在STM-0中请求VC-3时，标签为S=0、U=0、K=0、L=0、M=0。当在STM-0中的VC-3中请求VC-11时，标签为S=0、U=0、K=0、L>0、M=6..9。"
    },
    {
      "indent": 3,
      "text": "Note: when a Section/RS or Line/MS transparent STS-1/STM-0/STS-3*N/STM-N (N=1, 4, 16, 64, 256) signal is requested, the SUKLM label format and encoding is not applicable and the label encoding MUST follow the rules defined in [RFC3471] Section 3.2.",
      "zh-CHS": "注：当请求Section/RS或Line/MS透明STS-1/STM-0/STS-3*N/STM-N（N=1,4,16,64,256）信号时，SUKLM标签格式和编码不适用，标签编码必须遵循[RFC3471]第3.2节中定义的规则。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgments",
      "section_title": true,
      "zh-CHS": "4. 致谢"
    },
    {
      "indent": 3,
      "text": "Valuable comments and input were received from the CCAMP mailing list where outstanding discussions took place.",
      "zh-CHS": "从CCAMP邮件列表中收到了宝贵的意见和投入，在该邮件列表中进行了杰出的讨论。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security considerations to either [RFC3473] or [RFC3472]. GMPLS security is described in section 11 of [RFC3471] and refers to [RFC3209] for RSVP-TE and to [RFC3212] for CR-LDP.",
      "zh-CHS": "本文档未向[RFC3473]或[RFC3472]引入新的安全注意事项。[RFC3471]第11节描述了GMPLS安全性，RSVP-TE参考[RFC3209]，CR-LDP参考[RFC3212]。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "Three values have been defined by IANA for this document:",
      "zh-CHS": "IANA为本文件定义了三个值："
    },
    {
      "indent": 3,
      "text": "Two RSVP C-Types in registry:\n   http://www.iana.org/assignments/rsvp-parameters",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "- A SONET/SDH SENDER_TSPEC object: Class = 12, C-Type = 4 (see section 2.2).",
      "zh-CHS": "- SONET/SDH发送器\\u TSPEC对象：Class=12，C-Type=4（见第2.2节）。"
    },
    {
      "indent": 3,
      "text": "- A SONET/SDH FLOWSPEC object: Class = 9, C-Type = 4 (see section 2.2).",
      "zh-CHS": "- SONET/SDH FLOWSPEC对象：类别=9，C型=4（见第2.2节）。"
    },
    {
      "indent": 3,
      "text": "One LDP TLV Type in registry:\n   http://www.iana.org/assignments/ldp-namespaces",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "- A type field for the SONET/SDH Traffic Parameters TLV (see section 2.3).",
      "zh-CHS": "- SONET/SDH业务参数TLV的类型字段（见第2.3节）。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[G.707] ITU-T Recommendation G.707, \"Network Node Interface for the Synchronous Digital Hierarchy\", October 2000.",
      "zh-CHS": "[G.707]ITU-T建议G.707，“同步数字体系的网络节点接口”，2000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "zh-CHS": "[RFC2205]Braden，R.，Zhang，L.，Berson，S.，Herzog，S.，和S.Jamin，“资源预留协议（RSVP）——第1版功能规范”，RFC 22052997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2210] Wroclawski, J., \"The Use of RSVP with IETF Integrated Services\", RFC 2210, September 1997.",
      "zh-CHS": "[RFC2210]Wroclawski，J.，“RSVP与IETF集成服务的使用”，RFC 2210，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "zh-CHS": "[RFC3209]Awduche，D.，Berger，L.，Gan，D.，Li，T.，Srinivasan，V.，和G.Swallow，“RSVP-TE：LSP隧道RSVP的扩展”，RFC 3209，2001年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3212] Jamoussi, B., Andersson, L., Callon, R., Dantu, R., Wu, L., Doolan, P., Worster, T., Feldman, N., Fredette, A., Girish, M., Gray, E., Heinanen, J., Kilty, T., and A. Malis, \"Constraint-Based LSP Setup using LDP\", RFC 3212, January 2002.",
      "zh-CHS": "[RFC3212]Jamoussi，B.，Andersson，L.，Callon，R.，Dantu，R.，Wu，L.，Doolan，P.，Worster，T.，Feldman，N.，Fredette，A.，Girish，M.，Gray，E.，Heinanen，J.，Kilty，T.，和A.Malis，“使用LDP的基于约束的LSP设置”，RFC 3212，2002年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., \"Generalized Multi-Protocol Label Switching (MPLS) Signaling Functional Description\", RFC 3471, January 2003.",
      "zh-CHS": "[RFC3471]Berger，L.“通用多协议标签交换（MPLS）信令功能描述”，RFC 3471，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3472] Ashwood-Smith, P. and L. Berger, \"Generalized Multi-Protocol Label Switching (MPLS) Signaling - Constraint-based Routed Label Distribution Protocol (CR-LDP) Extensions\", RFC 3472, January 2003.",
      "zh-CHS": "[RFC3472]Ashwood Smith，P.和L.Berger，“通用多协议标签交换（MPLS）信令-基于约束的路由标签分发协议（CR-LDP）扩展”，RFC 3472，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., \"Generalized Multi-Protocol Label Switching (MPLS) Signaling - Resource ReserVation Protocol Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003.",
      "zh-CHS": "[RFC3473]Berger，L.“通用多协议标签交换（MPLS）信令-资源预留协议流量工程（RSVP-TE）扩展”，RFC 3473，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3945] Mannie, E., Ed., \"Generalized Multiprotocol Label Switching (GMPLS) Architecture\", RFC 3945, October 2004.",
      "zh-CHS": "[RFC3945]Mannie，E.，Ed.“通用多协议标签交换（GMPLS）体系结构”，RFC 39452004年10月。"
    },
    {
      "indent": 3,
      "text": "[T1.105] \"Synchronous Optical Network (SONET): Basic Description Including Multiplex Structure, Rates, and Formats\", ANSI T1.105, October 2000.",
      "zh-CHS": "[T1.105]“同步光网络（SONET）：基本描述，包括多路复用结构、速率和格式”，ANSI T1.105，2000年10月。"
    },
    {
      "indent": 0,
      "text": "Appendix 1 - Signal Type Values Extension for VC-3",
      "zh-CHS": "附录1-VC-3的信号类型值扩展"
    },
    {
      "indent": 3,
      "text": "This appendix defines the following optional additional Signal Type value for the Signal Type field of section 2.1:",
      "zh-CHS": "本附录定义了第2.1节信号类型字段的以下可选附加信号类型值："
    },
    {
      "indent": 3,
      "text": "Value         Type\n-----  ---------------------\n 20     \"VC-3 via AU-3 at the end\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "According to the ITU-T [G.707] recommendation a VC-3 in the TU-3/TUG-3/VC-4/AU-4 branch of the SDH multiplex cannot be structured in TUG-2s, however a VC-3 in the AU-3 branch can be. In addition, a VC-3 could be switched between the two branches if required.",
      "zh-CHS": "根据ITU-T[G.707]建议，SDH多路复用的TU-3/TUG-3/VC-4/AU-4分支中的VC-3不能在TUG-2s中构造，但AU-3分支中的VC-3可以是。此外，如果需要，可以在两个分支之间切换VC-3。"
    },
    {
      "indent": 3,
      "text": "A VC-3 circuit could be terminated on an ingress interface of an LSR (e.g., forming a VC-3 forwarding adjacency). This LSR could then want to demultiplex this VC-3 and switch internal low order LSPs. For implementation reasons, this could be only possible if the LSR receives the VC-3 in the AU-3 branch. E.g., for an LSR not able to switch internally from a TU-3 branch to an AU-3 branch on its incoming interface before demultiplexing and then switching the content with its switch fabric.",
      "zh-CHS": "VC-3电路可以端接在LSR的入口接口上（例如，形成VC-3转发邻接）。然后，该LSR可能想要解复用该VC-3并切换内部低阶LSP。出于实施原因，只有当LSR在AU-3分支中接收到VC-3时，这才可能实现。例如，对于LSR，在解复用然后使用其交换结构切换内容之前，无法在其传入接口上从TU-3分支内部切换到AU-3分支。"
    },
    {
      "indent": 3,
      "text": "In that case it is useful to indicate that the VC-3 LSP must be terminated at the end in the AU-3 branch instead of the TU-3 branch.",
      "zh-CHS": "在这种情况下，指出VC-3 LSP必须在AU-3分支而不是TU-3分支的末端终止是有用的。"
    },
    {
      "indent": 3,
      "text": "This is achieved by using the \"VC-3 via AU-3 at the end\" signal type. This information can be used, for instance, by the penultimate LSR to switch an incoming VC-3 received in any branch to the AU-3 branch on the outgoing interface to the destination LSR.",
      "zh-CHS": "这是通过使用“末端通过AU-3的VC-3”信号类型实现的。例如，倒数第二个LSR可以使用该信息将任何分支中接收到的传入VC-3切换到输出接口上的AU-3分支到目标LSR。"
    },
    {
      "indent": 3,
      "text": "The \"VC-3 via AU-3 at the end\" signal type does not imply that the VC-3 must be switched via the AU-3 branch at some other places in the network. The VC-3 signal type just indicates that a VC-3 in any branch is suitable.",
      "zh-CHS": "“末端通过AU-3的VC-3”信号类型并不意味着必须通过网络中其他一些地方的AU-3分支切换VC-3。VC-3信号类型仅表明任何分支中的VC-3都是合适的。"
    },
    {
      "indent": 0,
      "text": "Annex 1 - Examples",
      "zh-CHS": "附件1-示例"
    },
    {
      "indent": 3,
      "text": "This annex defines examples of SONET and SDH signal coding. Their objective is to help the reader to understand how works the traffic parameter coding and not to give examples of typical SONET or SDH signals.",
      "zh-CHS": "本附录定义了SONET和SDH信号编码的示例。其目的是帮助读者理解交通参数编码的工作原理，而不是给出典型SONET或SDH信号的示例。"
    },
    {
      "indent": 3,
      "text": "As stated above, signal types are Elementary Signals to which successive concatenation, multiplication and transparency transforms can be applied to obtain Final Signals.",
      "zh-CHS": "如上所述，信号类型是基本信号，可以对其应用连续的级联、乘法和透明变换以获得最终信号。"
    },
    {
      "indent": 3,
      "text": "1. A VC-4 signal is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1 and T with value 0 to a VC-4 Elementary Signal.",
      "zh-CHS": "1. 将值为0的RCC、值为0的NCC、值为0的NVC、值为1的MT和值为0的T应用于VC-4基本信号，形成VC-4信号。"
    },
    {
      "indent": 3,
      "text": "2. A VC-4-7v signal is formed by the application of RCC with value 0, NCC with value 0, NVC with value 7 (virtual concatenation of 7 components), MT with value 1 and T with value 0 to a VC-4 Elementary Signal.",
      "zh-CHS": "2. VC-4-7v信号是通过将值为0的RCC、值为0的NCC、值为7的NVC（7个组件的虚拟串联）、值为1的MT和值为0的T应用于VC-4基本信号而形成的。"
    },
    {
      "indent": 3,
      "text": "3. A VC-4-16c signal is formed by the application of RCC with flag 1 (standard contiguous concatenation), NCC with value 16, NVC with value 0, MT with value 1 and T with value 0 to a VC-4 Elementary Signal.",
      "zh-CHS": "3. VC-4-16c信号是通过将带有标志1（标准连续级联）的RCC、带有值16的NCC、带有值0的NVC、带有值1的MT和带有值0的T应用于VC-4基本信号而形成的。"
    },
    {
      "indent": 3,
      "text": "4. An STM-16 signal with Multiplex Section layer transparency is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1 and T with flag 2 to an STM-16 Elementary Signal.",
      "zh-CHS": "4. 通过将值为0的RCC、值为0的NCC、值为0的NVC、值为1的MT和标记为2的T应用于STM-16基本信号，形成具有复用截面层透明度的STM-16信号。"
    },
    {
      "indent": 3,
      "text": "5. An STM-4 signal with Multiplex Section layer transparency is formed by the application of RCC with flag 0, NCC with value 0, NVC with value 0, MT with value 1 and T with flag 2 applied to an STM-4 Elementary Signal.",
      "zh-CHS": "5. 通过将带标志0的RCC、带值0的NCC、带值0的NVC、带值1的MT和带标志2的T应用于STM-4基本信号，形成具有多路复用截面层透明度的STM-4信号。"
    },
    {
      "indent": 3,
      "text": "6. An STM-256 signal with Multiplex Section layer transparency is formed by the application of RCC with flag 0, NCC with value 0, NVC with value 0, MT with value 1 and T with flag 2 applied to an STM-256 Elementary Signal.",
      "zh-CHS": "6. 通过将带标志0的RCC、带值0的NCC、带值0的NVC、带值1的MT和带标志2的T应用于STM-256基本信号，形成具有多路复用部分层透明度的STM-256信号。"
    },
    {
      "indent": 3,
      "text": "7. An STS-1 SPE signal is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1 and T with value 0 to an STS-1 SPE Elementary Signal.",
      "zh-CHS": "7. STS-1 SPE信号是通过将值为0的RCC、值为0的NCC、值为0的NVC、值为1的MT和值为0的T应用于STS-1 SPE基本信号而形成的。"
    },
    {
      "indent": 3,
      "text": "8. An STS-3c SPE signal is formed by the application of RCC with value 1 (standard contiguous concatenation), NCC with value 1, NVC with value 0, MT with value 1 and T with value 0 to an STS-3c SPE Elementary Signal.",
      "zh-CHS": "8. STS-3c SPE信号是通过将值为1的RCC（标准连续级联）、值为1的NCC、值为0的NVC、值为1的MT和值为0的T应用于STS-3c SPE基本信号而形成的。"
    },
    {
      "indent": 3,
      "text": "9. An STS-48c SPE signal is formed by the application of RCC with flag 1 (standard contiguous concatenation), NCC with value 16, NVC with value 0, MT with value 1 and T with value 0 to an STS-3c SPE Elementary Signal.",
      "zh-CHS": "9. STS-48c SPE信号由带标志1（标准连续级联）的RCC、带值16的NCC、带值0的NVC、带值1的MT和带值0的T应用于STS-3c SPE基本信号形成。"
    },
    {
      "indent": 3,
      "text": "10. An STS-1-3v SPE signal is formed by the application of RCC with value 0, NVC with value 3 (virtual concatenation of 3 components), MT with value 1 and T with value 0 to an STS-1 SPE Elementary Signal.",
      "zh-CHS": "10. STS-1-3v SPE信号是通过将值为0的RCC、值为3的NVC（3个组件的虚拟串联）、值为1的MT和值为0的T应用于STS-1 SPE基本信号而形成的。"
    },
    {
      "indent": 3,
      "text": "11. An STS-3c-9v SPE signal is formed by the application of RCC with value 1, NCC with value 1, NVC with value 9 (virtual concatenation of 9 STS-3c), MT with value 1 and T with value 0 to an STS-3c SPE Elementary Signal.",
      "zh-CHS": "11. 将值为1的RCC、值为1的NCC、值为9的NVC（9个STS-3c的虚拟串联）、值为1的MT和值为0的T应用于STS-3c SPE基本信号，形成STS-3c-9v SPE信号。"
    },
    {
      "indent": 3,
      "text": "12. An STS-12 signal with Section layer (full) transparency is formed by the application of RCC with value 0, NVC with value 0, MT with value 1 and T with flag 1 to an STS-12 Elementary Signal.",
      "zh-CHS": "12. 将值为0的RCC、值为0的NVC、值为1的MT和标志为1的T应用于STS-12基本信号，形成具有剖面层（全）透明度的STS-12信号。"
    },
    {
      "indent": 3,
      "text": "13. 3 x STS-768c SPE signal is formed by the application of RCC with flag 1, NCC with value 256, NVC with value 0, MT with value 3, and T with value 0 to an STS-3c SPE Elementary Signal.",
      "zh-CHS": "13. 3 x STS-768c SPE信号由带标志1的RCC、带值256的NCC、带值0的NVC、带值3的MT和带值0的T应用于STS-3c SPE基本信号形成。"
    },
    {
      "indent": 3,
      "text": "14. 5 x VC-4-13v composed signal is formed by the application of RCC with value 0, NVC with value 13, MT with value 5 and T with value 0 to a VC-4 Elementary Signal.",
      "zh-CHS": "14. 将值为0的RCC、值为13的NVC、值为5的MT和值为0的T应用于VC-4基本信号，形成5 x VC-4-13v合成信号。"
    },
    {
      "indent": 3,
      "text": "The encoding of these examples is summarized in the following table:",
      "zh-CHS": "下表总结了这些示例的编码："
    },
    {
      "indent": 3,
      "text": "Signal                     ST   RCC   NCC   NVC   MT   T\n--------------------------------------------------------\nVC-4                        6     0     0     0    1   0\nVC-4-7v                     6     0     0     7    1   0\nVC-4-16c                    6     1    16     0    1   0\nSTM-16 MS transparent      10     0     0     0    1   2\nSTM-4 MS transparent        9     0     0     0    1   2\nSTM-256 MS transparent     12     0     0     0    1   2\nSTS-1 SPE                   5     0     0     0    1   0\nSTS-3c SPE                  6     1     1     0    1   0\nSTS-48c SPE                 6     1    16     0    1   0\nSTS-1-3v SPE                5     0     0     3    1   0\nSTS-3c-9v SPE               6     1     1     9    1   0\nSTS-12 Section transparent  9     0     0     0    1   1\n3 x STS-768c SPE            6     1   256     0    3   0\n5 x VC-4-13v                6     0     0    13    5   0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Contributors",
      "zh-CHS": "贡献者"
    },
    {
      "indent": 3,
      "text": "Contributors are listed by alphabetical order:",
      "zh-CHS": "贡献者按字母顺序列出："
    },
    {
      "indent": 3,
      "text": "Stefan Ansorge (Alcatel) Lorenzstrasse 10 70435 Stuttgart, Germany",
      "zh-CHS": "Stefan Ansorge（阿尔卡特）Lorenzstrasse 10 70435德国斯图加特"
    },
    {
      "indent": 3,
      "text": "EMail: stefan.ansorge@alcatel.de",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Peter Ashwood-Smith (Nortel) PO. Box 3511 Station C, Ottawa, ON K1Y 4H7, Canada",
      "zh-CHS": "彼得·阿什伍德·史密斯（北电）波。加拿大K1Y 4H7渥太华C站3511号信箱"
    },
    {
      "indent": 3,
      "text": "EMail:petera@nortelnetworks.com",
      "zh-CHS": "电邮：petera@nortelnetworks.com"
    },
    {
      "indent": 3,
      "text": "Ayan Banerjee (Calient) 5853 Rue Ferrari San Jose, CA 95138, USA",
      "zh-CHS": "美国加利福尼亚州圣何塞法拉利街5853号阿扬·班纳吉（Calient），邮编95138"
    },
    {
      "indent": 3,
      "text": "EMail: abanerjee@calient.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Lou Berger (Movaz) 7926 Jones Branch Drive McLean, VA 22102, USA",
      "zh-CHS": "美国弗吉尼亚州麦克莱恩琼斯支路7926号卢·伯杰（莫瓦兹）邮编：22102"
    },
    {
      "indent": 3,
      "text": "EMail: lberger@movaz.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Greg Bernstein (Ciena) 10480 Ridgeview Court Cupertino, CA 94014, USA",
      "zh-CHS": "格雷格·伯恩斯坦（Ciena）10480美国加利福尼亚州库珀蒂诺市里奇维尤法院，邮编94014"
    },
    {
      "indent": 3,
      "text": "EMail: greg@ciena.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Angela Chiu (Celion) One Sheila Drive, Suite 2 Tinton Falls, NJ 07724-2658",
      "zh-CHS": "Angela Chiu（Celion）新泽西州丁顿瀑布2号套房希拉大道1号07724-2658"
    },
    {
      "indent": 3,
      "text": "EMail: angela.chiu@celion.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "John Drake (Calient) 5853 Rue Ferrari San Jose, CA 95138, USA",
      "zh-CHS": "美国加利福尼亚州圣何塞法拉利街5853号约翰·德雷克（Calient），邮编95138"
    },
    {
      "indent": 3,
      "text": "EMail: jdrake@calient.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Yanhe Fan (Axiowave) 100 Nickerson Road Marlborough, MA 01752, USA",
      "zh-CHS": "美国马萨诸塞州马尔堡尼克森路100号延河范（Axiowave）01752"
    },
    {
      "indent": 3,
      "text": "EMail: yfan@axiowave.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Michele Fontana (Alcatel) Via Trento 30, I-20059 Vimercate, Italy",
      "zh-CHS": "米歇尔丰塔纳（阿尔卡特）途经意大利维梅卡特市特伦托30号I-20059"
    },
    {
      "indent": 3,
      "text": "EMail: michele.fontana@alcatel.it",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Gert Grammel (Alcatel) Lorenzstrasse, 10 70435 Stuttgart, Germany",
      "zh-CHS": "Gert Grammel（阿尔卡特）Lorenzstrasse，10 70435斯图加特，德国"
    },
    {
      "indent": 3,
      "text": "EMail: gert.grammel@alcatel.de",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Juergen Heiles (Siemens) Hofmannstr. 51 D-81379 Munich, Germany",
      "zh-CHS": "Juergen Heiles（西门子）Hofmannstr。51 D-81379德国慕尼黑"
    },
    {
      "indent": 3,
      "text": "EMail: juergen.heiles@siemens.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Suresh Katukam (Cisco) 1450 N. McDowell Blvd, Petaluma, CA 94954-6515, USA",
      "zh-CHS": "Suresh Katukam（思科）美国加利福尼亚州佩塔卢马市麦克道尔大道北1450号，邮编94954-6515"
    },
    {
      "indent": 3,
      "text": "EMail: suresh.katukam@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella (Juniper) 1194 N. Mathilda Ave. Sunnyvale, CA 94089, USA",
      "zh-CHS": "Kireeti Kompella（Juniper）美国加利福尼亚州桑尼维尔市马蒂尔达大道北1194号，邮编94089"
    },
    {
      "indent": 3,
      "text": "EMail: kireeti@juniper.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jonathan P. Lang (Calient) 25 Castilian Goleta, CA 93117, USA",
      "zh-CHS": "乔纳森·P·朗（Calient）美国加利福尼亚州卡斯蒂利亚戈列塔25号，邮编93117"
    },
    {
      "indent": 3,
      "text": "EMail: jplang@calient.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Fong Liaw (Solas Research)",
      "zh-CHS": "方丽雅（Solas研究）"
    },
    {
      "indent": 3,
      "text": "EMail: fongliaw@yahoo.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Zhi-Wei Lin (Lucent) 101 Crawfords Corner Rd Holmdel, NJ 07733-3030, USA",
      "zh-CHS": "林志伟（朗讯）美国新泽西州霍姆德尔克劳福德角路101号，邮编07733-3030"
    },
    {
      "indent": 3,
      "text": "EMail: zwlin@lucent.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Ben Mack-Crane (Tellabs)",
      "zh-CHS": "本麦克起重机（Tellabs）"
    },
    {
      "indent": 3,
      "text": "EMail: ben.mack-crane@tellabs.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dimitrios Pendarakis (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA",
      "zh-CHS": "美国新泽西州海洋港901号邮政信箱新月广场2号Dimitrios Pendarakis（Tellium）07757-0901"
    },
    {
      "indent": 3,
      "text": "EMail: dpendarakis@tellium.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mike Raftelis (White Rock) 18111 Preston Road Dallas, TX 75252, USA",
      "zh-CHS": "美国德克萨斯州达拉斯普雷斯顿路18111号，邮编75252"
    },
    {
      "indent": 3,
      "text": "Bala Rajagopalan (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA",
      "zh-CHS": "美国新泽西州海洋港901号邮政信箱新月广场2号巴拉·拉贾戈帕兰（Tellium）07757-0901"
    },
    {
      "indent": 3,
      "text": "EMail: braja@tellium.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Yakov Rekhter (Juniper) 1194 N. Mathilda Ave. Sunnyvale, CA 94089, USA",
      "zh-CHS": "亚科夫·雷克特（Juniper）美国加利福尼亚州桑尼维尔市马蒂尔达大道北1194号，邮编94089"
    },
    {
      "indent": 3,
      "text": "EMail: yakov@juniper.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Debanjan Saha (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA",
      "zh-CHS": "美国新泽西州海洋港901号邮政信箱新月广场2号德班詹萨哈（Tellium）07757-0901"
    },
    {
      "indent": 3,
      "text": "EMail: dsaha@tellium.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Vishal Sharma (Metanoia) 335 Elan Village Lane San Jose, CA 95134, USA",
      "zh-CHS": "Vishal Sharma（梅塔诺亚）335 Elan Village Lane San Jose，CA 95134，美国"
    },
    {
      "indent": 3,
      "text": "EMail: vsharma87@yahoo.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "George Swallow (Cisco) 250 Apollo Drive Chelmsford, MA 01824, USA",
      "zh-CHS": "乔治·斯沃恩（思科）美国马萨诸塞州切姆斯福德阿波罗大道250号01824"
    },
    {
      "indent": 3,
      "text": "EMail: swallow@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Z. Bo Tang (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA",
      "zh-CHS": "Z.Bo Tang（Tellium）美国新泽西州海港901号邮政信箱新月广场2号，邮编：07757-0901"
    },
    {
      "indent": 3,
      "text": "EMail: btang@tellium.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Eve Varma (Lucent) 101 Crawfords Corner Rd Holmdel, NJ 07733-3030, USA",
      "zh-CHS": "Eve Varma（朗讯）美国新泽西州霍姆德尔克劳福德角路101号，邮编：07733-3030"
    },
    {
      "indent": 3,
      "text": "EMail: evarma@lucent.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Yangguang Xu (Lucent) 21-2A41, 1600 Osgood Street North Andover, MA 01845, USA",
      "zh-CHS": "杨光旭（朗讯）美国马萨诸塞州安多佛市奥斯古德北街1600号21-2A41，邮编：01845"
    },
    {
      "indent": 3,
      "text": "EMail: xuyg@lucent.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Eric Mannie (Consultant) Avenue de la Folle Chanson, 2 B-1050 Brussels, Belgium Phone: +32 2 648-5023 Mobile: +32 (0)495-221775",
      "zh-CHS": "Eric Mannie（顾问）de la Folle Chanson大道2号B-1050比利时布鲁塞尔电话：+32 2 648-5023手机：+32（0）495-221775"
    },
    {
      "indent": 3,
      "text": "EMail:  eric_mannie@hotmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dimitri Papadimitriou (Alcatel) Francis Wellesplein 1, B-2018 Antwerpen, Belgium Phone: +32 3 240-8491",
      "zh-CHS": "Dimitri Papadimitriou（阿尔卡特）Francis Wellesplein 1，B-2018比利时安特卫普电话：+32 3 240-8491"
    },
    {
      "indent": 3,
      "text": "EMail:  dimitri.papadimitriou@alcatel.be",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the IETF's procedures with respect to rights in IETF Documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关IETF文件中权利的IETF程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}