{
  "title": {
    "text": "RFC 3624:  The Media Gateway Control Protocol (MGCP) Bulk Audit Package ",
    "zh-CHS": "RFC 3624"
  },
  "number": 3624,
  "created_at": "2021-11-21 23:23:15.444053+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          B. Foster\nRequest for Comments: 3624                                   D. Auerbach\nCategory: Informational                                     F. Andreasen\n                                                           Cisco Systems\n                                                           November 2003",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "The Media Gateway Control Protocol (MGCP) Bulk Audit Package",
      "zh-CHS": "媒体网关控制协议（MGCP）批量审核包"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "zh-CHS": "IESG注释"
    },
    {
      "indent": 3,
      "text": "This document is being published for the information of the community. It describes a non-IETF protocol that is currently being deployed in a number of products. Implementers should be aware of RFC 3015, which was developed in the IETF Megaco Working Group and the ITU-T SG16, and which is considered by the IETF and the ITU-T to be the standards-based (including reviewed security considerations) way to meet the needs that MGCP was designed to address.",
      "zh-CHS": "本文件发布供社区参考。它描述了目前正在许多产品中部署的非IETF协议。实施者应了解RFC 3015，它是在IETF Megaco工作组和ITU-T SG16中开发的，并且被IETF和ITU-T视为基于标准（包括经审查的安全考虑）的方式，以满足MGCP设计所要满足的需求。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The base Media Gateway Control Protocol (MGCP) includes audit commands that only allow a Call Agent to audit endpoint and/or connection state one endpoint at a time. This document describes a new MGCP package for bulk auditing of a group of gateway endpoints. It allows a Call Agent to determine the endpoint naming convention, the list of instantiated endpoints as well connection and endpoint state for the group of endpoints.",
      "zh-CHS": "基本媒体网关控制协议（MGCP）包括审计命令，该命令一次只允许呼叫代理审计一个端点和/或连接状态。本文档描述了一个新的MGCP包，用于对一组网关端点进行批量审核。它允许调用代理确定端点命名约定、实例化端点列表以及端点组的连接和端点状态。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction. . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Bulk Audit Package. . . . . . . . . . . . . . . . . . . . . .   2\n    2.1.  Package Definition. . . . . . . . . . . . . . . . . . .   2\n          2.1.1. Package Parameters . . . . . . . . . . . . . . .   3\n          2.1.2. Bulk Auditing of Non-persistent Virtual\n                 Endpoints. . . . . . . . . . . . . . . . . . . .  11\n          2.1.3. Package Specific Return Codes. . . . . . . . . .  12\n    2.2.  Examples of Package Use . . . . . . . . . . . . . . . .  13\n          2.2.1. Endpoint List. . . . . . . . . . . . . . . . . .  13\n          2.2.2. Connection Count List. . . . . . . . . . . . . .  13\n          2.2.3. Connection Mode List . . . . . . . . . . . . . .  15\n          2.2.4. Endpoint State . . . . . . . . . . . . . . . . .  15\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  17\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .  17\n5.  References. . . . . . . . . . . . . . . . . . . . . . . . . .  18\n6.  Authors' Addresses. . . . . . . . . . . . . . . . . . . . . .  18\n7.  Full Copyright Statement. . . . . . . . . . . . . . . . . . .  19",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The reader is assumed to be familiar with the base MGCP protocol [3].",
      "zh-CHS": "假定读者熟悉基本MGCP协议[3]。"
    },
    {
      "indent": 3,
      "text": "The base Media Gateway Control Protocol (MGCP) [3] includes audit commands that only allow a Call Agent to audit an endpoint and/or a connection state, one endpoint at a time. This document describes a new MGCP package for bulk auditing of a group of gateway endpoints. It allows a Call Agent to determine the endpoint naming convention, to determine the list of instantiated endpoints, and to determine the connection and endpoint state for the group of endpoints. This is particularly important in fail-over situations in which there are gateways that have large numbers of endpoints.",
      "zh-CHS": "基本媒体网关控制协议（MGCP）[3]包括仅允许呼叫代理一次审计一个端点和/或连接状态的审计命令。本文档描述了一个新的MGCP包，用于对一组网关端点进行批量审核。它允许调用代理确定端点命名约定，确定实例化端点的列表，并确定端点组的连接和端点状态。在存在具有大量端点的网关的故障转移情况下，这一点尤为重要。"
    },
    {
      "indent": 3,
      "text": "Conventions Used in this Document",
      "zh-CHS": "本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [2].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[2]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Bulk Audit Package",
      "section_title": true,
      "zh-CHS": "2. 批量审计包"
    },
    {
      "indent": 0,
      "text": "2.1. Package Definition",
      "section_title": true,
      "zh-CHS": "2.1. 包定义"
    },
    {
      "indent": 3,
      "text": "Package Name: BA",
      "zh-CHS": "包裹名称：BA"
    },
    {
      "indent": 3,
      "text": "Package Version: 0",
      "zh-CHS": "软件包版本：0"
    },
    {
      "indent": 3,
      "text": "Package Description: This package provides the Call Agent the ability to audit and obtain high-level view of endpoint and connection state for a group of endpoints in a gateway.",
      "zh-CHS": "包说明：此包为调用代理提供了审核和获取网关中一组端点的端点和连接状态的高级视图的能力。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Package Parameters",
      "section_title": true,
      "zh-CHS": "2.1.1. 包参数"
    },
    {
      "indent": 3,
      "text": "A new BulkRequestedInfo parameter is defined for use in the AuditEndpoint command. The parameter can be used to request a compact list of EndpointIds or to request a high level view of endpoint or connection state for a group of endpoints as defined below:",
      "zh-CHS": "定义了一个新的BulkRequestedInfo参数，用于AuditEndpoint命令。该参数可用于请求端点ID的压缩列表，或请求一组端点的端点或连接状态的高级视图，定义如下："
    },
    {
      "indent": 6,
      "text": "ReturnCode,\n[EndPointNameList,]\n[InstantiatedEndpointList,]\n[ConnectionCountList,]\n[ConnectionModeList,]\n[EndpointStateList,]\n[NextEndpointName,]\n[ReportedEndpointList]\n<-- AuditEndPoint(EndpointId,\n                    [StartEndpointName,]\n                    [MaxNumEndpoints,]\n                    [BulkRequestedInfo])",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Unlike the normal RequestedInfo parameter in the base MGCP specification, the BulkRequestedInfo parameter associated with the Bulk Audits package can be used with \"all-of\" wildcards for auditing a collection of endpoints. However, it is not an error to specify an EndpointId without wildcards.",
      "zh-CHS": "与基本MGCP规范中的普通RequestedInfo参数不同，与批量审核包关联的BulkRequestedInfo参数可与“all of”通配符一起用于审核端点集合。但是，在没有通配符的情况下指定EndpointId不是错误的。"
    },
    {
      "indent": 3,
      "text": "The following sub-sections describe the parameters associated with the Bulk Audit Command in detail. Sections 2.1.1.1 and 2.1.1.2 describe the parameters that can be included with a request and sections 2.1.1.3 to 2.1.1.8 describe return parameters.",
      "zh-CHS": "以下小节详细描述了与批量审核命令相关的参数。第2.1.1.1节和第2.1.1.2节描述了可包含在请求中的参数，第2.1.1.3节至第2.1.1.8节描述了返回参数。"
    },
    {
      "indent": 0,
      "text": "2.1.1.1. StartEndpointName and MaxNumEndpoints Parameters",
      "section_title": true,
      "zh-CHS": "2.1.1.1. StartEndpointName和MaxNumEndpoints参数"
    },
    {
      "indent": 3,
      "text": "Because wild-carding may not be sufficient to qualify the endpoints of interest, further qualification can be provided by including a StartEndpointName (the first endpoint of interest) and MaxNumEndPoints (the maximum number of endpoints of interest). These parameters are described according to the following Augmented BNF (ABNF) Syntax (refer to RFC 2234 for ABNF syntax definitions [1]):",
      "zh-CHS": "由于wild carding可能不足以限定感兴趣的端点，因此可以通过包括StartEndpointName（感兴趣的第一个端点）和MaxNumEndPoints（感兴趣的最大端点数）来提供进一步的限定。这些参数根据以下扩充BNF（ABNF）语法进行描述（ABNF语法定义参见RFC 2234[1]）："
    },
    {
      "indent": 6,
      "text": "\"BA/SE\" \":\" 0*WSP LocalEndpointName",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "\"BA/NU\" \":\" 0*WSP MaxNumEndpoints",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where MaxNumEndpoints is the decimal number of endpoints with a value in the range 1 to 65535. The MaxNumEndpoints parameter SHOULD only be included when requesting an audit for an EndpointStateList and/or ConnectionCountList. If included in a request for the EndPointNameList or InstantiatedEndpointList, it MAY be ignored.",
      "zh-CHS": "其中，MaxNumEndpoints是值在1到65535之间的端点的十进制数。仅当请求对EndpointStateList和/或ConnectionCountList进行审核时，才应包含MaxNumEndpoints参数。如果包含在对EndPointNameList或InstancedEndpointList的请求中，则可能会忽略它。"
    },
    {
      "indent": 3,
      "text": "Note that only the LocalEndpointName (see ABNF grammar in [3]) is provided in request and response parameter lines for this package rather than the full EndpointName. This is done for the sake of compactness, i.e., the domain name portion is left out since it is already available in the command line portion of a given request.",
      "zh-CHS": "请注意，此包的请求和响应参数行中只提供了LocalEndpointName（请参见[3]中的ABNF语法），而不是完整的EndpointName。这样做是为了紧凑，也就是说，域名部分被省略了，因为它已经在给定请求的命令行部分可用。"
    },
    {
      "indent": 3,
      "text": "If the list of endpoints defined by the StartEndpointName and MaxNumEndPoints is outside the range designated by the wild-carding, a report will only be returned for endpoints up to those specified within the wild-card range.",
      "zh-CHS": "如果StartEndpointName和MaxNumEndPoints定义的端点列表不在通配符指定的范围内，则只会为通配符范围内指定的端点返回报告。"
    },
    {
      "indent": 0,
      "text": "2.1.1.2. BulkRequestedInfo Parameter",
      "section_title": true,
      "zh-CHS": "2.1.1.2. BulkRequestedInfo参数"
    },
    {
      "indent": 3,
      "text": "The BulkRequestedInfo parameter line is described according to the following ABNF syntax definitions:",
      "zh-CHS": "BulkRequestedInfo参数行根据以下ABNF语法定义进行描述："
    },
    {
      "indent": 6,
      "text": "BulkRequestedInfo = \"BA/F:\" 0*WSP\n       *( EndpointOrInstantList *(\",\" EndpointOrInstantList))\n     / *( EndpointOrConnState *(\",\" EndpointOrConnState))",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "EndpointOrConnState = \"BA/C\" / \"BA/M\" /  EndpointStateParam",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "EndpointOrInstantList = \"BA/Z\" / \"BA/X\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "EndpointStateParam = \"BA/S\" \"(\" StateType\n                                   0*(\",\" 0*(WSP) StateType)\")\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "StateType = \"I\" / \"D\" / \"N\" / \"S\" / \"H\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where the BulkRequestedInfo parameters have the following meaning:",
      "zh-CHS": "其中，BulkRequestedInfo参数具有以下含义："
    },
    {
      "indent": 6,
      "text": "* \"BA/Z\" is a request to return EndPointNameList\n* \"BA/X\" is a request to return InstantiatedEndpointList\n* \"BA/C\" is a request to return the ConnectionCountList\n* \"BA/M\" is a request to return the ConnectionModeList\n* \"BA/S\" is a request to return the EndpointStateList",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Each of the parameters can be provided at most once in the BulkRequestedInfo.",
      "zh-CHS": "在BulkRequestedInfo中，每个参数最多只能提供一次。"
    },
    {
      "indent": 3,
      "text": "EndpointStateParam Parameter:",
      "zh-CHS": "EndpointStateParam参数："
    },
    {
      "indent": 3,
      "text": "As indicated in the above ABNF, the EndpointStateParam parameter is itself parameterized with one or more StateType parameters that define the conditions to be evaluated for the endpoint:",
      "zh-CHS": "如上述ABNF所示，EndpointStateParam参数本身由一个或多个StateType参数参数参数化，这些参数定义了要为端点计算的条件："
    },
    {
      "indent": 3,
      "text": "* \"I\" - the endpoint is in-service, * \"D\" - the endpoint is disconnected (see sections 4.3 and 4.4.7 of [3] for a discussion on disconnected endpoints), * \"N\" - the endpoint is in the notification state, * \"L\" - the endpoint is in lockstep state (i.e., waiting for an RQNT after a response to a NTFY has occurred while in lockstep mode) * \"S\" - there is an active on-off (OO) or timeout (TO) signal on the endpoint, * \"H\" - the endpoint is in some state other than \"idle\". The meaning of this last parameter depends on the type of endpoint: * The parameter has no meaning for endpoints that only provide bearer services (with no state that the endpoint is aware of). In this case, the condition is always evaluated to false (corresponding to \"idle\"). * For endpoints that have a state machine associated with them (such as a CAS endpoint), the endpoint MUST be in some state other than the \"idle\" state in order for the condition to be evaluated as true. * In the case where the endpoint has hook-state associated with it, the hook-state MUST be off-hook. In the case of digital channel associated signaling (CAS) connections, hook-state may be provided in either direction. If the hook-state in either direction is off-hook, the endpoint is considered non-idle, i.e., the condition is satisfied.",
      "zh-CHS": "* “I”-端点处于服务状态，*“D”-端点处于断开连接状态（有关断开连接的端点的讨论，请参见[3]的第4.3节和第4.4.7节），*“N”-端点处于通知状态，*“L”-端点处于锁步状态（即在锁步模式下发生对NTFY的响应后等待RQNT）*“S”-端点上存在活动的开-关（OO）或超时（TO）信号，*“H”-端点处于“空闲”以外的其他状态。最后一个参数的含义取决于终结点的类型：*该参数对于仅提供承载服务的终结点（没有终结点知道的状态）没有意义。在这种情况下，条件的计算结果始终为false（对应于“idle”）*对于具有关联状态机的终结点（如CAS终结点），终结点必须处于“空闲”状态以外的其他状态，才能将条件评估为true。*在端点具有关联的钩子状态的情况下，钩子状态必须为off-hook。在数字信道相关信令（CAS）连接的情况下，可以在任一方向上提供钩子状态。如果任一方向上的挂钩状态为脱钩，则端点被视为非空闲，即满足条件。"
    },
    {
      "indent": 3,
      "text": "The list of StateTypes may be extended in the future. If an unknown StateType is encountered, the command MUST be rejected with error code 803 (i.e., \"unsupported StateType\").",
      "zh-CHS": "StateTypes的列表将来可能会扩展。如果遇到未知的StateType，则必须拒绝该命令，并返回错误代码803（即“unsupported StateType”）。"
    },
    {
      "indent": 3,
      "text": "The report, provided as a result of this request, yields an indication of either \"True\", \"False\", or \"Out of Service\" for each endpoint. If the endpoint is in-service and any one of the criteria holds true, then the report for the endpoint will evaluate to \"True\". A \"False\" indication will only be reported if the endpoint is in-service and all criteria evaluate to false. The report thus provides the logical \"OR\" function over the conditions audited for endpoints in-service. Irrespective of the state being audited, an \"Out of Service\" indication will always be reported if the endpoint is considered out-of-service.",
      "zh-CHS": "作为该请求的结果提供的报告为每个端点生成“真”、“假”或“停止服务”的指示。如果端点处于服务中且任何一个条件为true，则端点的报告将计算为“true”。只有当端点处于服务中且所有标准评估为False时，才会报告“False”指示。因此，该报告在为服务中的端点审核的条件上提供逻辑“或”函数。无论正在审核的状态如何，如果端点被视为停止服务，则始终会报告“停止服务”指示。"
    },
    {
      "indent": 3,
      "text": "Note that the criteria \"D\", \"N\", \"L\", \"S\" and \"H\" can only be true if the endpoint is in-service, so that requesting \"I\" at the same time (although allowed) would be unnecessary (i.e., redundant).",
      "zh-CHS": "请注意，标准“D”、“N”、“L”、“S”和“H”仅在端点处于服务状态时为真，因此同时请求“I”（尽管允许）将是不必要的（即冗余的）。"
    },
    {
      "indent": 3,
      "text": "Example: If the request for EndpointStateList for one or more endpoints includes the parameter line:",
      "zh-CHS": "示例：如果一个或多个端点的EndpointStateList请求包含参数行："
    },
    {
      "indent": 6,
      "text": "BA/F: BA/S(D,N)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "indicating a request for a report on whether endpoints are disconnected or in the notification state. If a given endpoint is in either a \"disconnected\" or \"notification\" state, then the report will indicate \"True\" for that endpoint. If the endpoint is neither in a disconnected state nor in a notification state, but is in-service, then the report for that endpoint will indicate \"False\". If the endpoint is out-of-service, then the report for that endpoint will indicate \"Out of Service\".",
      "zh-CHS": "指示请求报告端点是否已断开连接或处于通知状态。如果给定端点处于“断开连接”或“通知”状态，则报告将为该端点指示“True”。如果端点既不处于断开连接状态，也不处于通知状态，而是处于服务中，则该端点的报告将指示“False”。如果端点已停止服务，则该端点的报告将指示“停止服务”。"
    },
    {
      "indent": 3,
      "text": "In order to only determine whether an endpoint is in-service or out-of service, the Call Agent should make a request with only the \"I\" StateType parameter.",
      "zh-CHS": "为了仅确定端点是在服务中还是在服务外，调用代理应仅使用“I”StateType参数发出请求。"
    },
    {
      "indent": 0,
      "text": "2.1.1.3. EndPointNameList and InstantiatedEndpointList Parameters",
      "section_title": true,
      "zh-CHS": "2.1.1.3. EndPointNameList和实例化的edEndPointList参数"
    },
    {
      "indent": 3,
      "text": "EndPointNameList Parameter:",
      "zh-CHS": "EndPointNameList参数："
    },
    {
      "indent": 3,
      "text": "The EndPointNameList is a list of the endpoint names (i.e., the endpoint naming convention for the endpoints configured for service) supported by the gateway as qualified by the wildcarded EndPointId, and possibly StartEndPointName and MaxNumEndpoints parameters. This list can include one or more lines in the following ABNF format:",
      "zh-CHS": "EndPointNameList是网关支持的端点名称（即为服务配置的端点的端点命名约定）列表，由通配符EndPointId限定，可能还有StartEndPointName和MaxNumEndpoints参数。此列表可以包括以下ABNF格式的一行或多行："
    },
    {
      "indent": 6,
      "text": "\"BA/Z:\" 0*WSP RangedLocalName 0*(\",\" 0*WSP RangedLocalName)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where RangedLocalName is a LocalEndpointName that may include the ranged wildcard notation described in Appendix E (section E.5) of [3], i.e.,:",
      "zh-CHS": "其中RangedLocalName是一个LocalEndpointName，可能包括[3]附录E（第E.5节）中描述的范围通配符符号，即："
    },
    {
      "indent": 6,
      "text": "RangeWildcard = \"[\" NumericalRange *( \",\" NumericalRange ) \"]\" NumericalRange = 1*(DIGIT) [ \"-\" 1*(DIGIT) ].",
      "zh-CHS": "RangeWildcard=“[“NumericalRange*（”，“NumericalRange）”]”NumericalRange=1*（数字）[“-”1*（数字）]。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "zh-CHS": "例子："
    },
    {
      "indent": 6,
      "text": "ba/z: ds/ds1-1/[1-24], ds/ds1-2/[1-24], ds/ds1-3/[1-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "or simply:",
      "zh-CHS": "或者简单地说："
    },
    {
      "indent": 6,
      "text": "ba/z: ds/ds1-[1-3]/[1-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that, since range wildcards use the character \"[\" to indicate the start of a range, the \"[\" character MUST NOT be used in endpoint names that use range wildcards.",
      "zh-CHS": "请注意，由于范围通配符使用“[”字符表示范围的开始，因此在使用范围通配符的端点名称中不得使用“[”字符。"
    },
    {
      "indent": 3,
      "text": "Note that the ranged wildcard notation (RangeWildcard above) also allows commas between ranges like:",
      "zh-CHS": "请注意，范围通配符表示法（上面的范围通配符）也允许在范围之间使用逗号，如："
    },
    {
      "indent": 6,
      "text": "ba/z: ds/ds1-1/[1,3-5,8-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For virtual endpoints, that are automatically created and deleted on the fly by the gateway, there is a difference between reporting the endpoint names (i.e., the \"naming convention\") used in describing the endpoints and reporting the actual endpoints that are instantiated at the time the request is made. For this case:",
      "zh-CHS": "对于由网关动态自动创建和删除的虚拟端点，报告用于描述端点的端点名称（即“命名约定”）与报告在发出请求时实例化的实际端点之间存在差异。在这种情况下："
    },
    {
      "indent": 3,
      "text": "* EndPointNameList is a request to return the naming convention and",
      "zh-CHS": "* EndPointNameList是返回命名约定和"
    },
    {
      "indent": 3,
      "text": "* InstantiatedEndpointList is a request to return the \"real\" (or instantiated) endpoints.",
      "zh-CHS": "* InstancedEndpointList是返回“真实”（或实例化）端点的请求。"
    },
    {
      "indent": 3,
      "text": "InstantiatedEndpointList Parameter:",
      "zh-CHS": "实例化的edEndPointList参数："
    },
    {
      "indent": 6,
      "text": "The syntax of the InstantiatedEndpointList value is the same as the EndPointNameList value returned with EndPointNameList, i.e., a number of lines may be returned with the following syntax:",
      "zh-CHS": "实例化的edEndPointList值的语法与使用EndPointNameList返回的EndPointNameList值相同，即，可以使用以下语法返回多行："
    },
    {
      "indent": 9,
      "text": "\"BA/X:\" 0*WSP RangedLocalName 0*(\",\" 0*WSP RangedLocalName)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "In the case of hard-wired/physical endpoints (such as DSO's) or other persistent endpoints, the InstantiatedEndpointList would normally not be requested. However, if it is requested, the InstantiatedEndpointList and the EndPointNameList will be the same.",
      "zh-CHS": "对于硬接线/物理端点（如DSO）或其他持久端点，通常不会请求实例化的edPointList。但是，如果请求，实例化的edEndPointList和EndPointNameList将是相同的。"
    },
    {
      "indent": 3,
      "text": "For virtual endpoints that are not persistent, an \"all of\" wild card (\"*\") is returned for the leftmost term of the name, which is dynamically assigned in the EndPointNameList to indicate that arbitrary names apply, and that the endpoints are virtual and non-persistent. The \"all of\" wild card notation MUST NOT be used when returning the EndPointNameList for persistent endpoints however. The following example illustrates this:",
      "zh-CHS": "对于非持久性的虚拟端点，将为名称的最左侧项返回一个“全部”通配符（“*”），该通配符在EndPointNameList中动态分配，以指示应用任意名称，并且端点是虚拟的和非持久的。但是，在返回持久端点的EndPointNameList时，不能使用“all of”通配符。以下示例说明了这一点："
    },
    {
      "indent": 3,
      "text": "ba/z: announcement/*\nba/z: foo/bar/*\nba/z: foo/foo/*",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The \"all of\" wildcard tells us, that \"announcement\" is simply the leftmost term for a dynamic set of non-persistent virtual endpoints. To instantiate one of these endpoints, we would include the \"any of\" wildcard (e.g., \"announcement/$\") as the LocalEndpointName in the EndpointId of a request (e.g., NotificationRequest or CreateConnection). The response would then include the SpecificEndpointId indicating the instantiated endpoint. Also, note in the above example that \"foo\" defines two different levels of non-persistent virtual endpoints.",
      "zh-CHS": "“all of”通配符告诉我们，“announcement”只是一组动态的非持久性虚拟端点的最左边的术语。为了实例化其中一个端点，我们将在请求（例如NotificationRequest或CreateConnection）的端点ID中包含“any of”通配符（例如，“announcement/$”）作为LocalEndpointName。然后，响应将包括指示实例化端点的SpecificEndpointId。另外，请注意，在上面的示例中，“foo”定义了两个不同级别的非持久性虚拟端点。"
    },
    {
      "indent": 0,
      "text": "2.1.1.4. ConnectionCountList",
      "section_title": true,
      "zh-CHS": "2.1.1.4. 连接计数表"
    },
    {
      "indent": 3,
      "text": "The ConnectionCountList indicates the number of connections on a series of endpoints. It consists of a number of lines with the following ABNF syntax:",
      "zh-CHS": "ConnectionCountList指示一系列端点上的连接数。它由以下ABNF语法的多行组成："
    },
    {
      "indent": 6,
      "text": "\"BA/C:\" 0*WSP NumConnections 0*(NumConnections)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where NumConnections is either:",
      "zh-CHS": "其中NumConnections是："
    },
    {
      "indent": 3,
      "text": "* a hexadecimal digit indicating the number of connections on the endpoint corresponding to the position on the list, or",
      "zh-CHS": "* 十六进制数字，指示与列表上的位置相对应的端点上的连接数，或"
    },
    {
      "indent": 3,
      "text": "* the letter \"Z\" indicating that there are more than 15 connections on this endpoint.",
      "zh-CHS": "* 字母“Z”表示此端点上有15个以上的连接。"
    },
    {
      "indent": 0,
      "text": "2.1.1.5. ConnectionModeList",
      "section_title": true,
      "zh-CHS": "2.1.1.5. 连接模型列表"
    },
    {
      "indent": 3,
      "text": "The ConnectionModeList indicates the connection modes for all the connections on a series of endpoints. It consists of a number of lines with the following ABNF syntax:",
      "zh-CHS": "ConnectionModelList指示一系列端点上所有连接的连接模式。它由以下ABNF语法的多行组成："
    },
    {
      "indent": 6,
      "text": "\"BA/M:\" 0*WSP ModeOrCount 0*(ModOrCount)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "ModeOrCount = ConnCount / ConnMode",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "ConnMode = \"I\" / \"S\" / \"R\" / \"B\" / \"C\" / \"L\" / \"T\" / \"N\" / \"U\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where ConnCount is either hexadecimal value corresponding to 0-15 connections on an endpoint or the value \"Z\", indicating that more than 15 connections are present.",
      "zh-CHS": "其中，ConnCount是十六进制值，对应于端点上的0-15个连接，或者是值“Z”，表示存在超过15个连接。"
    },
    {
      "indent": 3,
      "text": "ConnMode indicates the connection mode where:",
      "zh-CHS": "ConnMode表示连接模式，其中："
    },
    {
      "indent": 6,
      "text": "* \"I\" indicates \"inactive\" connection mode * \"S\" indicates \"sendonly\" connection mode * \"R\" indicates \"recvonly\" connection mode * \"B\" indicates \"sendrecv\" connection mode * \"C\" indicates \"confrnce\" connection mode * \"L\" indicates \"loopback\" connection mode * \"T\" indicates \"conttest\" connection mode * \"N\" indicates \"netwloop\" connection mode * \"U\" indicates some other connection mode",
      "zh-CHS": "* “I”表示“非活动”连接模式*“S”表示“仅发送”连接模式*“R”表示“仅发送”连接模式*“B”表示“仅发送”连接模式*“C”表示“仅发送”连接模式*“L”表示“环回”连接模式*“T”表示“连续测试”连接模式*“N”表示“netwloop”连接模式*“U”指示其他连接模式"
    },
    {
      "indent": 3,
      "text": "For a definition of MGCP connection modes, refer to section 3.2.2.6 of [3].",
      "zh-CHS": "有关MGCP连接模式的定义，请参阅[3]的第3.2.2.6节。"
    },
    {
      "indent": 3,
      "text": "If an endpoint has no connections on it, ModeOrCount is given the value \"0\". If there is one connection associated with the endpoint, the symbol for the connection mode (ConnMode) is provided. If, on the other hand, there are from 2 to 15 connections, a symbol representing the number of connections (ConnCount) is provided followed by a list of symbols indicating the connection mode (ConnMode) for each connection. If there are more than 15 connections, \"Z\" is indicated for ConnCount and no connection modes are provided for the connections on that endpoint.",
      "zh-CHS": "如果端点上没有连接，则ModeOrCount的值为“0”。如果有一个连接与端点关联，则会提供连接模式（ConnMode）的符号。另一方面，如果有2到15个连接，则会提供一个表示连接数（ConnCount）的符号，后面是一个符号列表，指示每个连接的连接模式（ConnMode）。如果连接超过15个，则ConnCount将显示“Z”，并且该端点上的连接不提供任何连接模式。"
    },
    {
      "indent": 0,
      "text": "2.1.1.6. EndpointStateList Parameter",
      "section_title": true,
      "zh-CHS": "2.1.1.6. EndpointStateList参数"
    },
    {
      "indent": 3,
      "text": "The EndpointStateList gives an overview of the endpoint state for a series of endpoints. It consists of a number of lines with the following ABNF syntax:",
      "zh-CHS": "EndpointStateList概述了一系列端点的端点状态。它由以下ABNF语法的多行组成："
    },
    {
      "indent": 6,
      "text": "\"BA/S:\" 0*WSP EndPointState 0*(EndPointState)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "EndPointState = \"T\" / \"F\" / \"O\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where:",
      "zh-CHS": "哪里："
    },
    {
      "indent": 6,
      "text": "* \"T\" indicates \"True\" * \"F\" indicates \"False\" * \"O\" indicates \"Out of Service\"",
      "zh-CHS": "* “T”表示“真”*“F”表示“假”*“O”表示“停止服务”"
    },
    {
      "indent": 3,
      "text": "The \"True\" or \"False\" determination is based on the criteria supplied in StateType parameters when the request is made.",
      "zh-CHS": "“真”或“假”的确定基于发出请求时StateType参数中提供的标准。"
    },
    {
      "indent": 3,
      "text": "Note that the EndPointState indicator does not say anything about the connection state of the endpoint.",
      "zh-CHS": "请注意，EndPointState指示符没有说明端点的连接状态。"
    },
    {
      "indent": 0,
      "text": "2.1.1.7. NextEndpointName Parameter",
      "section_title": true,
      "zh-CHS": "2.1.1.7. NextEndpointName参数"
    },
    {
      "indent": 3,
      "text": "The NextEndpointName parameter will be included in the return, if there are additional endpoints in this gateway covered by the wild-carded endpoint name that were not reported, but for which information was available to be reported.",
      "zh-CHS": "如果通配符端点名称所涵盖的网关中有其他端点未报告，但可报告其信息，则返回中将包含NextEndpointName参数。"
    },
    {
      "indent": 3,
      "text": "Note that the NextEndpointName is the LocalEndpointName (as opposed to EndpointName) of the next endpoint after the last endpoint reported. The syntax is as follows:",
      "zh-CHS": "请注意，NextEndpointName是报告最后一个端点之后的下一个端点的LocalEndpointName（与EndpointName相反）。语法如下："
    },
    {
      "indent": 6,
      "text": "\"BA/NE\" \":\" 0*WSP LocalEndpointName",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A gateway may supply a report that is shorter than the request if the resulting report would have resulted in a message that would be too large (i.e., such that the report is larger than the maximum datagram size). In the case where the gateway supplied a response for less endpoints than requested, the gateway MUST supply NextEndpointName in the response.",
      "zh-CHS": "如果生成的报告将导致消息过大（即，使得报告大于最大数据报大小），则网关可以提供比请求短的报告。如果网关提供的端点响应少于请求的端点响应，则网关必须在响应中提供NextEndpointName。"
    },
    {
      "indent": 3,
      "text": "In order to continue the audit on a following set of endpoints, the Call Agent can make a further request by using the NextEndpointName as the starting point (e.g., as the StartEndpointName in a following request).",
      "zh-CHS": "为了继续对以下一组端点进行审核，调用代理可以通过使用NextEndpointName作为起点（例如，作为以下请求中的StartEndpointName）发出进一步的请求。"
    },
    {
      "indent": 0,
      "text": "2.1.1.8. ReportedEndpointList Parameter",
      "section_title": true,
      "zh-CHS": "2.1.1.8. ReportedEndpointList参数"
    },
    {
      "indent": 3,
      "text": "A ReportedEndpointList MUST be provided in a response line before list(s) of EndpointStateList and/or ConnectionCountList in order to clearly specify the list of endpoints that are being reported. The ABNF syntax is as follows:",
      "zh-CHS": "必须在EndpointStateList和/或ConnectionCountList列表之前的响应行中提供ReportedEndpointList，以便明确指定正在报告的端点列表。ABNF语法如下所示："
    },
    {
      "indent": 6,
      "text": "\"BA/EL:\" 0*WSP LimitedRangedName 0*(\",\" 0*WSP LimitRangedName)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where LimitedRangedName is a LocalEndpointName that may include a ranged wildcard notation (RangeWildcard syntax indicated earlier). However, unlike the RangedLocalName that allows the range wildcard notation to be used on multiple terms of the local name at the same time, LimitedRangedName only allows the range notation to be used for the last term, i.e., the following is valid:",
      "zh-CHS": "其中LimitedRangedName是一个LocalEndpointName，可能包含一个范围通配符符号（前面指出的范围通配符语法）。但是，与RangedLocalName不同，RangedLocalName允许在本地名称的多个术语上同时使用范围通配符表示法，LimitedRangedName只允许在最后一个术语上使用范围表示法，即，以下内容有效："
    },
    {
      "indent": 6,
      "text": "ba/el: ds/ds1-1/[1,3-5,8-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "or",
      "zh-CHS": "或"
    },
    {
      "indent": 6,
      "text": "ba/el: ds/ds1-1/[1-24], ds/ds1-2/[1-24], ds/ds1-3/[1-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "However, the following is not valid:",
      "zh-CHS": "但是，以下内容无效："
    },
    {
      "indent": 6,
      "text": "ba/el: ds/ds1-[1-3]/[1-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that a single bulk audit request may include a request to return both ConnectionCountList and EndpointStateList. However, the resulting report that includes both MUST cover the same endpoints.",
      "zh-CHS": "请注意，单个批量审核请求可能包括同时返回ConnectionCountList和EndpointStateList的请求。但是，包含两者的结果报告必须覆盖相同的端点。"
    },
    {
      "indent": 3,
      "text": "A single bulk audit request may also include a request to return both EndPointNameList and InstantiatedEndpointList. However, requests for either an EndPointNameList and/or an InstantiatedEndpointList MUST NOT include a request for either ConnectionCountList or EndpointStateList.",
      "zh-CHS": "单个批量审核请求还可能包括返回EndPointNameList和InstancedEndpointList的请求。但是，对EndPointNameList和/或InstancedEndpointList的请求不得包括对ConnectionCountList或EndpointStateList的请求。"
    },
    {
      "indent": 0,
      "text": "2.1.2. Bulk Auditing of Non-persistent Virtual Endpoints",
      "section_title": true,
      "zh-CHS": "2.1.2. 非持久性虚拟终结点的批量审核"
    },
    {
      "indent": 3,
      "text": "Note that gateways that have non-persistent virtual endpoints may have instantiated endpoints that are disjoint with respect to the name space. The ReportedEndpointList in front of a ConnectionCountList and/or EndpointStateList describes exactly which endpoints are being reported.",
      "zh-CHS": "请注意，具有非持久虚拟端点的网关可能具有相对于名称空间不相交的实例化端点。ConnectionCountList和/或EndpointStateList前面的ReportedEndpointList准确地描述了正在报告的端点。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "zh-CHS": "例子："
    },
    {
      "indent": 6,
      "text": "A Call Agent requests to know about the EndPointNameList for the endpoints on a conference bridge:",
      "zh-CHS": "呼叫代理请求了解会议网桥上端点的端点名称列表："
    },
    {
      "indent": 6,
      "text": "AUEP 1200 *@gw1.x.net MGCP 1.0\nBA/F: BA/Z",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Response:",
      "zh-CHS": "答复："
    },
    {
      "indent": 6,
      "text": "200 1200 OK\nba/z: cnf/*",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This indicates the naming convention but in fact not all of these endpoints are instantiated. A request for the list of instantiated endpoints, i.e.,:",
      "zh-CHS": "这表示命名约定，但实际上并非所有这些端点都是实例化的。对实例化端点列表的请求，即："
    },
    {
      "indent": 6,
      "text": "AUEP 1201 cnf/*@gw1.x.net MGCP 1.0\nBA/F: BA/X",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "might yield:",
      "zh-CHS": "可能产生："
    },
    {
      "indent": 6,
      "text": "200 1201 OK\nba/x: cnf/[1-3]\nba/x: cnf/[6-12]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "indicating that only these particular endpoints are instantiated.",
      "zh-CHS": "指示仅实例化这些特定端点。"
    },
    {
      "indent": 3,
      "text": "Suppose the Call Agent now asks for the ConnectionCountList i.e.,:",
      "zh-CHS": "假设呼叫代理现在请求ConnectionCountList，即："
    },
    {
      "indent": 6,
      "text": "AUEP 1202 cnf/*@gw1.x.net MGCP 1.0\nBA/F: BA/C",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The resulting instantiated virtual endpoints may be disjoint, which would be indicated by the ReportedEndpointList in front of the ConnectionCountList, e.g.,:",
      "zh-CHS": "生成的实例化虚拟端点可能是不相交的，这将由ConnectionCountList前面的ReportedEndpointList指示，例如："
    },
    {
      "indent": 6,
      "text": "200 1202 OK\nba/el: cnf/[1-3]\nba/c: 035\nba/el: cnf/[6-12]\nba/c: 3450333",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "or alternatively:",
      "zh-CHS": "或者："
    },
    {
      "indent": 6,
      "text": "200 1202 OK\nba/el: cnf/[1-3], ba/el: cnf/[6-12]\nba/c: 035\nba/c: 3450333",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "or",
      "zh-CHS": "或"
    },
    {
      "indent": 6,
      "text": "200 1202 OK\nba/el: cnf/[1-3], ba/el: cnf/[6-12]\nba/c: 0353450333",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.1.3. Package Specific Return Codes",
      "section_title": true,
      "zh-CHS": "2.1.3. 包特定返回代码"
    },
    {
      "indent": 3,
      "text": "The following return codes are specific to this package:",
      "zh-CHS": "以下返回代码特定于此软件包："
    },
    {
      "indent": 6,
      "text": "800 Invalid NextEndpointName 801 Invalid StartEndpointName 802 Invalid or unsupported BulkRequestInfo Parameter 803 Invalid or unsupported StateType 804 Bulk Audit Type not supported 805 Incorrectly specified endpoint range 806 Requested StartEndpoint unknown or unavailable",
      "zh-CHS": "800无效的NextEndpointName 801无效的StartEndpointName 802无效或不受支持的BulkRequestInfo参数803无效或不受支持的StateType 804批量审核类型不受支持805错误指定的端点范围806请求的StartEndpoint未知或不可用"
    },
    {
      "indent": 3,
      "text": "Note that package specific error codes includes the package name following the error code. For example, if error code 801 occurs in response to a request with a transaction ID of 1001 it would be sent as:",
      "zh-CHS": "请注意，特定于包的错误代码包括错误代码后面的包名称。例如，如果在响应事务ID为1001的请求时出现错误代码801，则它将被发送为："
    },
    {
      "indent": 6,
      "text": "801 1001 /BA",
      "zh-CHS": "8011001/BA"
    },
    {
      "indent": 0,
      "text": "2.2. Examples of Package Use",
      "section_title": true,
      "zh-CHS": "2.2. 包装使用示例"
    },
    {
      "indent": 0,
      "text": "2.2.1. Endpoint List",
      "section_title": true,
      "zh-CHS": "2.2.1. 端点列表"
    },
    {
      "indent": 3,
      "text": "This section contains examples of how to obtain a list of endpoints.",
      "zh-CHS": "本节包含如何获取端点列表的示例。"
    },
    {
      "indent": 3,
      "text": "Example 1: This is an example of a gateway that contains a single OC3 that contains a single level of hierarchy at the T1 level.",
      "zh-CHS": "示例1：这是一个包含单个OC3的网关示例，该OC3包含T1级别的单个层次结构。"
    },
    {
      "indent": 3,
      "text": "The request is made:",
      "zh-CHS": "请求是："
    },
    {
      "indent": 6,
      "text": "AUEP 1200 *@gw1.x.net MGCP 1.0\nBA/F: BA/Z",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This may result in a single \"BA/Z\" term with ranges specifying all of the endpoints.",
      "zh-CHS": "这可能会产生一个“BA/Z”术语，其范围指定所有端点。"
    },
    {
      "indent": 6,
      "text": "200 1200 OK\nba/z: ds/ds1-[1-84]/[1-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example 2: In this example the gateway has 10 analog lines and a single T1. The same request is made as in example 1, but now the response is:",
      "zh-CHS": "示例2：在这个示例中，网关有10条模拟线和一个T1。发出与示例1相同的请求，但现在的响应是："
    },
    {
      "indent": 6,
      "text": "200 1200 OK\nba/z: aaln/[1-10]\nba/z: ds/ds1-1/[1-24]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.2.2. Connection Count List",
      "section_title": true,
      "zh-CHS": "2.2.2. 连接计数列表"
    },
    {
      "indent": 3,
      "text": "Example1: Audit the number of connections on endpoints of a single E1:",
      "zh-CHS": "示例1：审核单个E1的端点上的连接数："
    },
    {
      "indent": 6,
      "text": "AUEP 2111 ds/e1-3/*@gw1.net\nBA/F: BA/C",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Response:",
      "zh-CHS": "答复："
    },
    {
      "indent": 6,
      "text": "200 2111 OK\nBA/EL: ds/e1-3/[1-30]\nBA/C:  012111210001000001000001000010",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example 2: Audit the number of connections on endpoints of a DS3:",
      "zh-CHS": "示例2：审核DS3端点上的连接数："
    },
    {
      "indent": 6,
      "text": "AUEP 1144 ds/ds3-1/*@gateway.net\nBA/F: BA/C",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Response:",
      "zh-CHS": "答复："
    },
    {
      "indent": 6,
      "text": "200 1144 OK\nBA/EL: ds/ds3-1/[1-192]\nBA/C:  010000010001000001000001\nBA/C:  001000000101000000001001\n:\nBA/C:  011000100010000010000010\nBA/C:  011111010001000001000001\nBA/C:  011000001100000001000001\nBA/NE: ds/ds3-1/193",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "In this case, the response provided by the gateway contained information about the first 192 endpoints. If the ds-3 contained a T1 hierarchy, the \"BA/EL\" and \"BA/NE\" values would indicate that hierarchy e.g.,:",
      "zh-CHS": "在这种情况下，网关提供的响应包含关于前192个端点的信息。如果ds-3包含T1层次结构，“BA/EL”和“BA/NE”值将指示该层次结构，例如："
    },
    {
      "indent": 6,
      "text": "200 1144 OK\nBA/EL: ds/ds3-1/ds1-1/[1-24]\nBA/C:  010000010001000001000001\nBA/EL: ds/ds3-1/ds1-2/[1-24]\nBA/C:  001000000101000000001001\n:\nBA/EL: ds/ds3-1/ds1-6/[1-24]\nBA/C:  011000100010000010000010\nBA/EL: ds/ds3-1/ds1-7/[1-24]\nBA/C:  011111010001000001000001\nBA/EL: ds/ds3-1/ds1-8/[1-24]\nBA/C:  011000001100000001000001\nBA/NE: ds/ds3-1/ds1-9/1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The Call Agent could continue to request endpoints by indicating the starting endpoint where it left off, i.e., simply using the returned \"BE/NE\" value as the \"BA/SE\" value for the next request:",
      "zh-CHS": "呼叫代理可以通过指示停止的起始端点来继续请求端点，即，仅使用返回的“BE/NE”值作为下一个请求的“BA/SE”值："
    },
    {
      "indent": 6,
      "text": "AUEP 1145 ds/ds3-3/*@gw1.net\nBA/F: BA/C\nBA/SE: ds/ds3-1/ds1-9/1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example 3: In this case, the Call Agent wants to know about the connection state of 12 DS0's starting with the endpoint with the LocalEndpointName \"ds/ds3-1/ds1-6/4\":",
      "zh-CHS": "示例3：在本例中，调用代理希望了解12个DS0的连接状态，该连接状态从LocalEndpointName为“ds/ds3-1/ds1-6/4”的端点开始："
    },
    {
      "indent": 6,
      "text": "AUEP 1146 ds/ds3-1/*@gw1.net\nBA/F: BA/C\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Response:",
      "zh-CHS": "答复："
    },
    {
      "indent": 6,
      "text": "200 1144 OK\nBA/EL: ds/ds3-1/ds1-6/[4-15]\nBA/C:  011000010001\nBA/NE: ds/ds3-1/ds1-6/16",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.2.3. Connection Mode List",
      "section_title": true,
      "zh-CHS": "2.2.3. 连接模式列表"
    },
    {
      "indent": 3,
      "text": "Example: Audit the connection modes for connections on the endpoints of a single E1:",
      "zh-CHS": "示例：审核单个E1端点上连接的连接模式："
    },
    {
      "indent": 6,
      "text": "AUEP 2111 ds/e1-3/*@gw1.net\nBA/F: BA/M",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Response:",
      "zh-CHS": "答复："
    },
    {
      "indent": 6,
      "text": "200 2111 OK\nBA/EL: ds/e1-3/[1-30]\nBA/M:  0R2BRBBB2RRB000B00000B00000B0000B0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This shows that:",
      "zh-CHS": "这表明："
    },
    {
      "indent": 3,
      "text": "* Endpoint ds/e1-3/1 has no connections * Endpoint ds/e1-3/2 has one connection and it is in \"recvonly\" mode. * Endpoint ds/e1-3/3 has two connections which are in \"sendrecv\" and \"recvonly\" mode * Endpoints ds/e1-3/4 to ds/e1-3/6 each have one connection - in \"sendrecv\" mode in all cases * Endpoints ds/e1-3/7 has two connections, both in \"recvonly\" mode * etc.",
      "zh-CHS": "* 端点ds/e1-3/1没有连接*端点ds/e1-3/2有一个连接，并且处于“RecvoOnly”模式。*端点ds/e1-3/3有两个连接，分别处于“sendrecv”和“RecvoOnly”模式*端点ds/e1-3/4到ds/e1-3/6各有一个连接-在所有情况下都处于“sendrecv”模式*端点ds/e1-3/7有两个连接，均处于“RecvoOnly”模式*等。"
    },
    {
      "indent": 0,
      "text": "2.2.4. Endpoint State",
      "section_title": true,
      "zh-CHS": "2.2.4. 端点状态"
    },
    {
      "indent": 3,
      "text": "Endpoint state requests and responses are similar. An example of requesting endpoint state similar to example 3 in the previous section:",
      "zh-CHS": "端点状态请求和响应类似。请求端点状态的示例类似于上一节中的示例3："
    },
    {
      "indent": 6,
      "text": "AUEP 1150 ds/ds3-1/*@gw1.net\nBA/F: BA/S(I)\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Response:",
      "zh-CHS": "答复："
    },
    {
      "indent": 6,
      "text": "200 1150 OK\nBA/EL: ds/ds3-1/ds1-6/[4-15]\nBA/S:  TOOTTOOTTOOT\nBA/NE: ds/ds3-1/ds1-6/16",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The request for in-service endpoints returns \"True\" for all endpoints in-service, and \"O\" for all endpoints \"Out of Service\".",
      "zh-CHS": "对服务内端点的请求对于所有服务内端点返回“True”，对于所有“服务外”端点返回“O”。"
    },
    {
      "indent": 3,
      "text": "A similar request but with additional parameters might be:",
      "zh-CHS": "类似的请求，但带有其他参数，可能是："
    },
    {
      "indent": 6,
      "text": "AUEP 1151 ds/ds3-1/*@gw1.net\nBA/F: BA/S(H,N)\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Response:",
      "zh-CHS": "答复："
    },
    {
      "indent": 6,
      "text": "200 1151 OK\nBA/EL: ds/ds3-1/ds1-6/[4-15]\nBA/S:  FFFTFFFFFFFO\nBA/NE: ds/ds3-1/ds1-6/16",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This indicates that at least one of the StateType parameters \"H\" (off-hook) and \"N\" (notification state) evaluated to true for the endpoints that have a \"T\" associated with then (i.e., ds/ds3-1/ds1- 6/7 and ds/ds3-1/ds1-6/16 since the request started from ds/ds3- 1/ds1-6/4). All other endpoints are neither off-hook nor in the \"notification state\". Note that endpoint ds/ds3-1/ds1-6/15 is marked as being out-of-service.",
      "zh-CHS": "这表明，对于具有与之关联的“T”的端点（即，自请求从ds/ds3-1/ds1-6/4启动以来，ds/ds3-1/ds1-6/7和ds/ds3-1/ds1-6/16），至少有一个StateType参数“H”（摘机）和“N”（通知状态）评估为true。所有其他端点既没有脱离连接，也没有处于“通知状态”。请注意，端点ds/ds3-1/ds1-6/15被标记为停止服务。"
    },
    {
      "indent": 3,
      "text": "It is possible to request both connection state and endpoint state in the same request such as:",
      "zh-CHS": "可以在同一请求中请求连接状态和端点状态，例如："
    },
    {
      "indent": 6,
      "text": "AUEP 1151 ds/ds3-1/*@gw1.net\nBA/F: BA/S(H,N), BA/C\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "In this case, the response might be:",
      "zh-CHS": "在这种情况下，响应可能是："
    },
    {
      "indent": 6,
      "text": "200 1151 OK\nBA/EL: ds/ds3-1/ds1-6/[4-15]\nBA/S:  FFFTFFFFFFFO\nBA/C:  011000010001\nBA/NE: ds/ds3-1/ds1-6/16",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The MGCP package title, \"Bulk Audit\", with the name, \"BA\", has been registered with IANA as indicated in Appendix C.1 in [3].",
      "zh-CHS": "MGCP文件包标题“批量审计”，名称为“BA”，已在IANA注册，如[3]附录C.1所示。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Section 5 of the base MGCP specification [3] discusses security requirements for the base protocol, which apply equally to the package defined in this document. Use of a security Protocol such as IPsec [4, 5] that provides per message authentication and integrity services is required in order to ensure that requests and responses are obtained from authenticated sources and that messages have not been modified. Without such services, gateways and Call Agents are open to attacks.",
      "zh-CHS": "基本MGCP规范[3]第5节讨论了基本协议的安全要求，这些要求同样适用于本文件中定义的包。为了确保请求和响应是从经过身份验证的来源获得的，并且消息没有被修改，需要使用提供每消息身份验证和完整性服务的安全协议（如IPsec[4,5]）。如果没有这些服务，网关和呼叫代理就容易受到攻击。"
    },
    {
      "indent": 3,
      "text": "For example, although audit requests from unauthorized sources will not modify media gateway state, the information provided could be used to locate idle endpoints, which could then lead to making unauthorized calls. Similarly, an attack that modifies a response to an audit returned to a Call Agent could lead to a denial of service attack in which a Call Agent that is provided misinformation as to endpoint state could take some incorrect action such as taking valid calls out of service.",
      "zh-CHS": "例如，尽管来自未经授权来源的审核请求不会修改媒体网关状态，但提供的信息可用于定位空闲端点，这可能会导致进行未经授权的呼叫。类似地，修改对返回给呼叫代理的审核的响应的攻击可能会导致拒绝服务攻击，在这种攻击中，提供有关端点状态的错误信息的呼叫代理可能会采取一些错误的操作，例如使有效呼叫退出服务。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "zh-CHS": "[1] Crocker，D.和P.Overell，“语法规范的扩充BNF:ABNF”，RFC 2234，1997年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[2] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Andreasen, F. and B. Foster, \"Media Gateway Control Protocol (MGCP) Version 1.0\", RFC 3435, January 2003.",
      "zh-CHS": "[3] Andreasen，F.和B.Foster，“媒体网关控制协议（MGCP）1.0版”，RFC 3435，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "zh-CHS": "[4] Kent，S.和R.Atkinson，“互联网协议的安全架构”，RFC 2401，1998年11月。"
    },
    {
      "indent": 3,
      "text": "[5] Kent, S. and R. Atkinson, \"IP Encapsulating Security Payload (ESP)\", RFC 2406, November 1998.",
      "zh-CHS": "[5] Kent，S.和R.Atkinson，“IP封装安全有效载荷（ESP）”，RFC 2406，1998年11月。"
    },
    {
      "indent": 0,
      "text": "6. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "6. 作者地址"
    },
    {
      "indent": 3,
      "text": "Flemming Andreasen Cisco Systems 499 Thornall Street, 8th Floor Edison, NJ 08837",
      "zh-CHS": "弗莱明·安德里森思科系统公司，地址：新泽西州爱迪生市索纳尔街499号8楼，邮编：08837"
    },
    {
      "indent": 3,
      "text": "EMail: fandreas@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "David Auerbach Cisco Systems Inc. 170 W. Tasman Drive San Jose, CA, 95134",
      "zh-CHS": "大卫·奥尔巴赫思科系统公司，加利福尼亚州圣何塞塔斯曼大道西170号，邮编：95134"
    },
    {
      "indent": 3,
      "text": "EMail: dea@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Bill Foster Cisco Systems",
      "zh-CHS": "比尔·福斯特思科系统公司"
    },
    {
      "indent": 3,
      "text": "EMail: bfoster@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "7. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}