{
  "title": {
    "text": "RFC 3953: Telephone Number Mapping (ENUM) Service Registration for Presence Services ",
    "zh-CHS": "RFC 3953"
  },
  "number": 3953,
  "created_at": "2021-11-18 15:14:43.891730+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        J. Peterson\nRequest for Comments: 3953                                       NeuStar\nCategory: Standards Track                                   January 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Telephone Number Mapping (ENUM) Service Registration for Presence Services",
      "zh-CHS": "状态服务的电话号码映射（ENUM）服务注册"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document registers a Telephone Number Mapping (ENUM) service for presence. Specifically, this document focuses on provisioning pres URIs in ENUM.",
      "zh-CHS": "本文档注册了一个电话号码映射（ENUM）服务。具体而言，本文档重点介绍在ENUM中设置pres-uri。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2. ENUM Service Registration  . . . . . . . . . . . . . . . . . . . 2\n3. Presence for E.164 Numbers . . . . . . . . . . . . . . . . . . . 2\n4. The 'E2U+pres' Enumservice . . . . . . . . . . . . . . . . . . . 3\n5. Example of E2U+pres Enumservice  . . . . . . . . . . . . . . . . 4\n6. Security Considerations  . . . . . . . . . . . . . . . . . . . . 4\n7. IANA Considerations  . . . . . . . . . . . . . . . . . . . . . . 5\n8. References . . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n   8.1.  Normative References . . . . . . . . . . . . . . . . . . . 5\n   8.2.  Informative References . . . . . . . . . . . . . . . . . . 5\nAuthor's Address. . . . . . . . . . . . . . . . . . . . . . . . . . 6\nFull Copyright Statement. . . . . . . . . . . . . . . . . . . . . . 7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "ENUM (E.164 Number Mapping, RFC 3761 [1]) is a system that uses DNS (Domain Name Service, RFC 1034 [8]) to translate telephone numbers, such as +12025332600, into URIs (Uniform Resource Identifiers, RFC 2396 [9]), such as pres:user@host.com. ENUM exists primarily to facilitate the interconnection of systems that rely on telephone numbers with those that use URIs to identify resources.",
      "zh-CHS": "ENUM（E.164数字映射，RFC 3761[1]）是一个使用DNS（域名服务，RFC 1034[8]）将电话号码（如+12025332600）转换为URI（统一资源标识符，RFC 2396[9]）的系统，如pres：user@host.com. ENUM的存在主要是为了促进依赖电话号码的系统与使用URI识别资源的系统之间的互连。"
    },
    {
      "indent": 3,
      "text": "Presence is a service defined in RFC 2778 [2] that allows users of a communications service to monitor one another's availability and disposition in order to make decisions about communicating. Presence information is highly dynamic and generally characterizes whether a user is online or offline, busy or idle, away from communications devices or nearby, and the like.",
      "zh-CHS": "存在是RFC 2778[2]中定义的一种服务，它允许通信服务的用户监控彼此的可用性和配置，以便做出有关通信的决策。存在信息是高度动态的，并且通常表征用户是在线还是离线、忙碌还是空闲、远离通信设备还是附近等等。"
    },
    {
      "indent": 3,
      "text": "The IETF has defined a generic URI used to identify a presence service for a particular resource: the 'pres' URI scheme (defined in CPP [4]). This document describes an enumservice for advertising presence information associated with an E.164 number.",
      "zh-CHS": "IETF定义了一个通用URI，用于识别特定资源的状态服务：“pres”URI方案（在CPP[4]中定义）。本文档描述了一种用于与E.164号码相关联的广告状态信息的enumservice。"
    },
    {
      "indent": 0,
      "text": "2. ENUM Service Registration",
      "section_title": true,
      "zh-CHS": "2. 枚举服务注册"
    },
    {
      "indent": 3,
      "text": "As defined in [1], the following is a template covering information needed for the registration of the enumservice specified in this document:",
      "zh-CHS": "如[1]中所定义，以下模板涵盖了注册本文档中指定的enumservice所需的信息："
    },
    {
      "indent": 6,
      "text": "Service name: \"E2U+pres\"",
      "zh-CHS": "服务名称：“E2U+pres”"
    },
    {
      "indent": 6,
      "text": "URI scheme(s): \"pres:\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Functional Specification: See section 4.",
      "zh-CHS": "功能规范：见第4节。"
    },
    {
      "indent": 6,
      "text": "Security considerations: See section 6.",
      "zh-CHS": "安全注意事项：见第6节。"
    },
    {
      "indent": 6,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 6,
      "text": "Author: Jon Peterson (jon.peterson@neustar.biz)",
      "zh-CHS": "作者：Jon Peterson（Jon。peterson@neustar.biz)"
    },
    {
      "indent": 6,
      "text": "Any other information that the author deems interesting: See section 3.",
      "zh-CHS": "作者认为有趣的任何其他信息：见第3节。"
    },
    {
      "indent": 0,
      "text": "3. Presence for E.164 Numbers",
      "section_title": true,
      "zh-CHS": "3. E.164号码的存在"
    },
    {
      "indent": 3,
      "text": "This document specifies an enumservice field that allows presence information to be provided for an E.164 number. This may include presence states associated with telephones, or presence of non-telephony communications services advertised by ENUM.",
      "zh-CHS": "本文档指定了允许为E.164号码提供状态信息的enumservice字段。这可能包括与电话相关联的存在状态，或ENUM广告的非电话通信服务的存在。"
    },
    {
      "indent": 3,
      "text": "Endpoints that participate in a presence architecture are known (following the framework in RFC 2778 [2]) as watchers and presentities. Watchers subscribe to the presence of presentities and are notified when the presence of a presentity changes. Watchers generally monitor the presence of a group of presentities with whom they have an ongoing association. As an example, consider how this might apply to a telephony service. Most cellular telephones today have an address book-like feature, a small database of names and telephone numbers. Such a telephone might act as a watcher, subscribing to the presence of some or all of the telephone numbers in its address book. The display of the telephone might then show its user, when a presence-enabled telephone number is selected, the availability of the destination. With this information, the user might change their calling habits to correspond better to the availability of his or her associates.",
      "zh-CHS": "参与存在体系结构的端点称为观察者和存在实体（遵循RFC 2778[2]中的框架）。观察者订阅存在实体的存在，并在存在实体的存在发生变化时收到通知。观察者通常监控与他们有持续联系的一组存在实体的存在。作为一个例子，考虑这可能如何应用于电话服务。如今，大多数手机都有一个类似通讯录的功能，一个包含姓名和电话号码的小型数据库。这种电话可以充当观察者，订阅其地址簿中的部分或全部电话号码。然后，当选择支持状态的电话号码时，电话显示屏可能会向其用户显示目的地的可用性。有了这些信息，用户可能会改变他们的通话习惯，以便更好地适应其同事的可用性。"
    },
    {
      "indent": 3,
      "text": "The presence information that is shared varies by communications service. The IETF has defined a Presence Information Data Format (or PIDF [6]) for describing the presence data associated with a presentity. The baseline PIDF specification declares only two presence states: OPEN and CLOSED (these terms are defined in RFC 2778 [2]); the former suggests that the destination resource is able to accept communication requests, the latter that it is not. These two states provide useful but rudimentary insight into the communications status of a presentity. For that reason, PIDF is an extensible format, and new sorts of statuses can be defined for specific communications services. For example, a telephony-based presence service might define a status corresponding to 'busy'. Extending PIDF for telephony services is, however, outside the scope of this document.",
      "zh-CHS": "共享的状态信息因通信服务而异。IETF定义了用于描述与存在实体相关联的存在数据的存在信息数据格式（或PIDF[6]）。基线PIDF规范仅声明了两种存在状态：打开和关闭（这些术语在RFC 2778[2]中定义）；前者表示目标资源能够接受通信请求，后者表示不能。这两种状态提供了对存在实体通信状态的有用但基本的洞察。因此，PIDF是一种可扩展的格式，可以为特定的通信服务定义新的状态类型。例如，基于电话的状态服务可以定义与“忙”对应的状态。但是，为电话服务扩展PIDF超出了本文档的范围。"
    },
    {
      "indent": 0,
      "text": "4. The 'E2U+pres' Enumservice",
      "section_title": true,
      "zh-CHS": "4. “E2U+pres”枚举服务"
    },
    {
      "indent": 3,
      "text": "Traditionally, the services field of an NAPTR record (as defined in [10]) contains a string composed of two subfields: a 'protocol' subfield and a 'resolution service' subfield. ENUM in particular defines an 'E2U' (E.164 to URI) resolution service. This document defines an 'E2U+pres' enumservice for presence.",
      "zh-CHS": "传统上，NAPTR记录的服务字段（如[10]中所定义）包含由两个子字段组成的字符串：“协议”子字段和“解析服务”子字段。ENUM特别定义了一个“E2U”（E.164到URI）解析服务。本文档为状态定义了“E2U+pres”枚举服务。"
    },
    {
      "indent": 3,
      "text": "The scheme of the URI that will appear in the regexp field of an NAPTR record using the 'E2U+pres' enumservice SHOULD be the 'pres' URI scheme. Other URI schemes appropriate to presence services MAY be used; however, the use of the 'pres' URI scheme ensures a greater level of compatibility than would the use of any URI specific to a particular presence protocol. The purpose of a pres URI is to provide a generic way to locate a presence service. Techniques for dereferencing the pres URI to locate a presence service are given in [5].",
      "zh-CHS": "使用“E2U+pres”枚举服务将出现在NAPTR记录的regexp字段中的URI方案应为“pres”URI方案。可以使用适合于存在服务的其他URI方案；然而，“pres”URI方案的使用确保了比使用特定于特定存在协议的任何URI更高级别的兼容性。presuri的目的是提供一种通用的方法来定位状态服务。[5]中给出了用于解引用pres URI以定位存在服务的技术。"
    },
    {
      "indent": 3,
      "text": "The 'pres' URI scheme does not identify any particular protocol that will be used to handle presence operations (such as subscriptions and notifications). Rather, the mechanism in [5] details a way to discover whether the presence protocol(s) supported by the watcher is/are also supported by the presentity. SIP [7] is one protocol that can be used to convey presence information and manage subscriptions/notifications.",
      "zh-CHS": "“pres”URI方案未标识任何将用于处理状态操作（如订阅和通知）的特定协议。相反，[5]中的机制详细说明了发现观察者支持的存在协议是否也被存在实体支持的方法。SIP[7]是一种可用于传递状态信息和管理订阅/通知的协议。"
    },
    {
      "indent": 0,
      "text": "5. Example of E2U+pres enumservice",
      "section_title": true,
      "zh-CHS": "5. E2U+pres枚举服务示例"
    },
    {
      "indent": 3,
      "text": "The following is an example of the use of the enumservice registered by this document in an NAPTR resource record.",
      "zh-CHS": "下面是在NAPTR资源记录中使用此文档注册的enumservice的示例。"
    },
    {
      "indent": 0,
      "text": "$ORIGIN 3.8.0.0.6.9.2.3.6.1.4.4.e164.arpa.\n   IN NAPTR 100 10 \"u\" \"E2U+pres\" \"!^.*$!pres:jon.peterson@example.net!\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "DNS does not make policy decisions about the records it shares with an inquirer. All DNS records must be assumed to be available to all inquirers at all times. The information provided within an ENUM record set must therefore be considered open to the public -- which is a cause for some privacy considerations.",
      "zh-CHS": "DNS不会对其与查询者共享的记录做出策略决定。必须假设所有DNS记录在任何时候都可供所有查询者使用。因此，枚举记录集中提供的信息必须被视为对公众开放——这是一些隐私考虑的原因。"
    },
    {
      "indent": 3,
      "text": "Revealing a pres URI in and of itself is unlikely to introduce many privacy concerns, although, depending on the structure of the URI, it might reveal the full name or employer of the target. The use of anonymous URIs mitigates this risk. More serious privacy concerns are associated with the unauthorized distribution of presence information. For this reason, presence protocols have a number of security requirements (detailed in RFC 2779 [3]) that call for authentication of watchers, integrity and confidentiality properties, and similar measures to prevent abuse of presence information. Any presence protocol used in conjunction with the 'pres' URI scheme is required to meet these requirements.",
      "zh-CHS": "披露pres URI本身不太可能引起许多隐私问题，尽管根据URI的结构，可能会披露目标公司的全名或雇主。匿名URI的使用减轻了这种风险。更严重的隐私问题与未经授权发布状态信息有关。因此，存在协议有许多安全要求（详见RFC 2779[3]），要求对观察者进行身份验证、完整性和保密属性，以及防止存在信息滥用的类似措施。任何与“pres”URI方案结合使用的存在协议都需要满足这些要求。"
    },
    {
      "indent": 3,
      "text": "Unlike a traditional telephone number, the resource identified by a pres URI may require that callers provide cryptographic credentials for authentication and authorization before presence information is returned. In concert with presence protocols, ENUM can actually provide far greater protection from unwanted callers than does the existing PSTN, despite the public availability of ENUM records.",
      "zh-CHS": "与传统电话号码不同，由pres URI标识的资源可能要求呼叫者在返回状态信息之前提供用于身份验证和授权的加密凭据。与状态存在协议相结合，尽管ENUM记录可以公开使用，但与现有的PSTN相比，ENUM实际上可以提供更大的保护，防止不需要的呼叫者。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document registers the 'E2U+pres' enumservice under the enumservice registry described in the IANA considerations in RFC 3761. Details of the registration are given in section 2.",
      "zh-CHS": "本文档在RFC 3761中IANA注意事项中描述的enumservice注册表下注册“E2U+pres”enumservice。注册详情见第2节。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Faltstrom, P. and M. Mealling, \"The E.164 to Uniform Resource Identifiers (URI) Dynamic Delegation Discovery System (DDDS) Application\", RFC 3761, April 2004.",
      "zh-CHS": "[1] Faltstrom，P.和M.Mealling，“E.164到统一资源标识符（URI）动态委托发现系统（DDDS）应用程序”，RFC 3761，2004年4月。"
    },
    {
      "indent": 3,
      "text": "[2] Day, M., Rosenberg, J., and H. Sugano, \"A Model for Presence and Instant Messaging\", RFC 2778, February 2000.",
      "zh-CHS": "[2] Day，M.，Rosenberg，J.，和H.Sugano，“状态和即时信息模型”，RFC 27782000年2月。"
    },
    {
      "indent": 3,
      "text": "[3] Day, M., Aggarwal, S., Mohr, G., and J. Vincent, \"Instant Messaging / Presence Protocol Requirements\", RFC 2779, February 2000.",
      "zh-CHS": "[3] Day，M.，Aggarwal，S.，Mohr，G.，和J.Vincent，“即时消息传递/存在协议要求”，RFC 2779，2000年2月。"
    },
    {
      "indent": 3,
      "text": "[4] Peterson, J., \"Common Profile for Presence (CPP)\", RFC 3859, August 2004.",
      "zh-CHS": "[4] 彼得森，J.，“在场的共同概况（CPP）”，RFC 3859，2004年8月。"
    },
    {
      "indent": 3,
      "text": "[5] Peterson, J., \"Address Resolution for Instant Messaging and Presence\", RFC 3861, August 2004.",
      "zh-CHS": "[5] Peterson，J.，“即时消息和状态的地址解析”，RFC 38612004年8月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[6] Sugano, H., Fujimoto, S., Klyne, G., Bateman, A., Carr, W., and J. Peterson, \"Presence Information Data Format (PIDF)\", RFC 3863, August 2004.",
      "zh-CHS": "[6] Sugano，H.，Fujimoto，S.，Klyne，G.，Batman，A.，Carr，W.，和J.Peterson，“状态信息数据格式（PIDF）”，RFC 38632004年8月。"
    },
    {
      "indent": 3,
      "text": "[7] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[7] Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.，和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[8] Mockapetris, P., \"Domain Names - Concepts and Facilities\", STD 13, RFC 1034, November 1987.",
      "zh-CHS": "[8] Mockapetris，P.，“域名-概念和设施”，STD 13，RFC 1034，1987年11月。"
    },
    {
      "indent": 3,
      "text": "[9] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifiers (URI): Generic Syntax\", RFC 2396, August 1998.",
      "zh-CHS": "[9] Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，RFC 2396，1998年8月。"
    },
    {
      "indent": 3,
      "text": "[10] Mealling, M., \"Dynamic Delegation Discovery System (DDDS) Part Three: The Domain Name System (DNS) Database\", RFC 3403, October 2002.",
      "zh-CHS": "[10] Mealling，M.“动态委托发现系统（DDDS）第三部分：域名系统（DNS）数据库”，RFC3403，2002年10月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Jon Peterson NeuStar, Inc. 1800 Sutter St. Suite 570 Concord, CA 94520 USA",
      "zh-CHS": "美国加利福尼亚州康科德市萨特街1800号570室Jon Peterson NeuStar，Inc.94520"
    },
    {
      "indent": 3,
      "text": "Phone: +1 925/363-8720\nEMail: jon.peterson@neustar.biz\nURI:   http://www.neustar.biz/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the IETF's procedures with respect to rights in IETF Documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关IETF文件中权利的IETF程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}