{
  "title": {
    "text": "RFC 3669:  Guidelines for Working Groups on Intellectual Property Issues ",
    "zh-CHS": "RFC 3669"
  },
  "number": 3669,
  "created_at": "2021-11-17 15:45:21.326321+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            S. Brim\nRequest for Comments: 3669                           Cisco Systems, Inc.\nUpdates: 2026                                              February 2004\nCategory: Informational",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Guidelines for Working Groups on Intellectual Property Issues",
      "zh-CHS": "知识产权问题工作组指南"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo lays out a conceptual framework and rules of thumb useful for working groups dealing with Intellectual Property Rights (IPR) issues. It documents specific examples of how IPR issues have been dealt with in the IETF.",
      "zh-CHS": "本备忘录列出了一个概念框架和经验法则，对处理知识产权（IPR）问题的工作组非常有用。它记录了IETF中如何处理知识产权问题的具体示例。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  The Problem  . . . . . . . . . . . . . . . . . . . . . . . . .  2\n3.  The Approach . . . . . . . . . . . . . . . . . . . . . . . . .  3\n4.  Case Studies . . . . . . . . . . . . . . . . . . . . . . . . .  4\n    4.1.  PPP CCP and ECP. . . . . . . . . . . . . . . . . . . . .  4\n    4.2.  IPS WG (IP Storage). . . . . . . . . . . . . . . . . . .  5\n    4.3.  PEM and PKI issues . . . . . . . . . . . . . . . . . . .  5\n    4.4.  VRRP (Virtual Router Redundancy Protocol). . . . . . . .  6\n    4.5.  Secure Shell (SecSH) . . . . . . . . . . . . . . . . . .  6\n    4.6.  IDN (Internationalized Domain Name). . . . . . . . . . .  7\n5.  General Principles . . . . . . . . . . . . . . . . . . . . . .  8\n    5.1.  Types of IPR . . . . . . . . . . . . . . . . . . . . . .  8\n    5.2.  When to Think About IPR. . . . . . . . . . . . . . . . .  9\n    5.3.  IPR as a Technology Evaluation Factor. . . . . . . . . .  9\n    5.4.  Patents versus Pending Patents Applied For . . . . . . . 10\n    5.5.  Applicability: It's Hard to Prove a Negative . . . . . . 11\n    5.6.  Licensing Terms. . . . . . . . . . . . . . . . . . . . . 12\n    5.7.  Third-Party Disclosure of IPR Claims . . . . . . . . . . 14\n          5.7.1 Third-Party Disclosure Advice. . . . . . . . . . . 14\n6.  Security Considerations. . . . . . . . . . . . . . . . . . . . 15\n7.  Acknowledgments. . . . . . . . . . . . . . . . . . . . . . . . 15",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 15\n    8.1.  Normative References . . . . . . . . . . . . . . . . . . 15\n    8.2.  Informative References . . . . . . . . . . . . . . . . . 16\n9.  Author's Address . . . . . . . . . . . . . . . . . . . . . . . 16\n10. Full Copyright Statement . . . . . . . . . . . . . . . . . . . 17",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo lays out a conceptual framework and rules of thumb to assist working groups dealing with IPR issues. The goal is to achieve a balance between the needs of IPR claimants and the implementers of IETF standards which is appropriate to current times. As part of trying to distill out principles for dealing with IPR in IETF working groups, it provides case studies of working group IPR treatment. In other words, it documents the running code of the IETF process.",
      "zh-CHS": "本备忘录列出了一个概念框架和经验法则，以协助处理知识产权问题的工作组。目标是在知识产权权利人的需求和IETF标准的实施者之间实现一种平衡，这种平衡适合当今时代。作为努力提炼出IETF工作组处理知识产权原则的一部分，它提供了工作组知识产权处理的案例研究。换句话说，它记录了IETF过程的运行代码。"
    },
    {
      "indent": 3,
      "text": "This memo does not describe IPR procedures for document authors or IPR claimants. Those are covered in two other memos, on submission rights [5] and IPR in the IETF [6]. Rather, this memo is for working groups that are trying to decide what to do about technology contributions which have associated IPR claims.",
      "zh-CHS": "本备忘录未说明文件作者或知识产权申请人的知识产权程序。另外两份备忘录涉及这些内容，即IETF中的提交权[5]和知识产权[6]。相反，这份备忘录是为那些试图决定如何处理与知识产权相关的技术贡献的工作组准备的。"
    },
    {
      "indent": 0,
      "text": "2. The Problem",
      "section_title": true,
      "zh-CHS": "2. 问题"
    },
    {
      "indent": 3,
      "text": "Traditionally the IETF has tried to avoid technologies which were \"protected\" through IPR claims. However, compromises have been made since before the IETF was born. The \"common knowledge\" of the IETF, that IPR-impacted technology was anathema, has never recognized that the Internet has run on IPR-impacted technologies from the beginning. Nowadays the majority of the useful technologies brought to the IETF have some sort of IPR claim associated with them.",
      "zh-CHS": "传统上，IETF试图避免通过知识产权声明“保护”的技术。然而，在IETF诞生之前就已经做出了妥协。IETF的“常识”认为受知识产权影响的技术是令人憎恶的，但从未意识到互联网从一开始就运行在受知识产权影响的技术上。如今，IETF所采用的大多数有用技术都有某种与之相关的知识产权要求。"
    },
    {
      "indent": 3,
      "text": "It will always be better for the Internet to develop standards based on technology which can be used without concern about selective or costly licensing. However, increasingly, choosing a technology which is not impacted by IPR over an alternative that is may produce a weaker Internet. Sometimes there simply isn't any technology in an area that is not IPR-impacted. It is not always the wrong decision to select IPR-impacted technology, if the choice is made knowingly, after considering the alternatives and taking the IPR issues into account.",
      "zh-CHS": "互联网最好是基于技术制定标准，而不必担心选择性或昂贵的许可。然而，选择一种不受知识产权影响的技术，而不是选择一种受知识产权影响的技术，可能会越来越削弱互联网。有时，在一个不受知识产权影响的领域，根本没有任何技术。选择受知识产权影响的技术并不总是错误的决定，如果在考虑替代方案和知识产权问题后，在知情的情况下做出选择。"
    },
    {
      "indent": 3,
      "text": "The IETF is not a membership organization. Other standards-making bodies may have membership agreements that member organizations must sign and adhere to in order to participate. Membership agreements may include strict procedures for dealing with IPR, or perhaps a",
      "zh-CHS": "IETF不是一个会员组织。其他标准制定机构可能有成员协议，成员组织必须签署并遵守这些协议才能参与。成员协议可能包括处理知识产权的严格程序，或者"
    },
    {
      "indent": 3,
      "text": "requirement that technology must be licensed royalty-free. This is currently not possible in the IETF.",
      "zh-CHS": "技术必须免版税许可的要求。这在IETF中目前是不可能的。"
    },
    {
      "indent": 3,
      "text": "Even if the IETF had membership agreements, they would be difficult to formulate in a way that covered IPR issues, because the IETF's work includes technology from other sources and because the IETF collaborates with organizations that work with different approaches to intellectual property. The IETF can encounter four different IPR situations, at almost any time during the life of a document:",
      "zh-CHS": "即使IETF有成员协议，也很难以涵盖知识产权问题的方式制定协议，因为IETF的工作包括来自其他来源的技术，并且IETF与采用不同方法处理知识产权的组织合作。IETF几乎在文档生命周期内的任何时候都会遇到四种不同的知识产权情况："
    },
    {
      "indent": 3,
      "text": "o A document submitter notes their (or their represented organization's) IPR claim regarding the contents of the document.",
      "zh-CHS": "o 文件提交人记录其（或其代表的组织）关于文件内容的知识产权声明。"
    },
    {
      "indent": 3,
      "text": "o A non-submitter IETF participant claims that the contents of a document are covered by their (or their represented organization's) own IPR.",
      "zh-CHS": "o 非提交人IETF参与者声称文件内容由其（或其代表的组织）自己的知识产权覆盖。"
    },
    {
      "indent": 3,
      "text": "o An IETF participant notes IPR that is claimed by an individual or organization with which neither an author of the document, nor the participant noting the IPR, have an affiliation.",
      "zh-CHS": "o IETF参与者注意到个人或组织声称的知识产权，该个人或组织既非文件作者，也非注意到知识产权的参与者。"
    },
    {
      "indent": 3,
      "text": "o An individual or organization that does not participate in the IETF, but that monitors its activities, discovers that a document intersects that individual's or organization's established or pending intellectual property claims. It may come forward right away, or wait and let the IETF work progress.",
      "zh-CHS": "o 未参与IETF但对其活动进行监控的个人或组织发现文件与该个人或组织已确定或未决的知识产权主张相交叉。它可能会马上出现，或者等待IETF的工作进展。"
    },
    {
      "indent": 3,
      "text": "In working group activities, the IETF does not have detailed rules for each situation. Working groups have essentially only one rule they can invoke -- about individuals not participating in activities related to a technology if they do not disclose known IPR. Beyond that a working group can only make recommendations and requests.",
      "zh-CHS": "在工作组活动中，IETF没有针对每种情况的详细规则。工作组基本上只有一条规则可以援引，即如果个人不披露已知的知识产权，就不参与与技术相关的活动。除此之外，工作组只能提出建议和请求。"
    },
    {
      "indent": 3,
      "text": "Since every case is unique, and there are close to no general rules, working groups need a great deal of freedom in dealing with IPR issues. However, some amount of consistency is important so that both contributors and users of eventual standards can know what to expect.",
      "zh-CHS": "由于每个案例都是独特的，几乎没有一般规则，工作组在处理知识产权问题时需要很大的自由。然而，一定程度的一致性是很重要的，这样最终标准的贡献者和用户都可以知道会发生什么。"
    },
    {
      "indent": 0,
      "text": "3. The Approach",
      "section_title": true,
      "zh-CHS": "3. 方法"
    },
    {
      "indent": 3,
      "text": "The goal of this memo is not to make rules. The goal is to give working groups as much information as possible to make informed decisions, and then step out of the way. The other IPR working group memos [5][6] lay out what needs to be done once a particular piece of technology is selected as a working group draft. However, this doesn't help when a working group is trying to decide whether or not to select a technology in the first place. This third memo is",
      "zh-CHS": "这份备忘录的目的不是制定规则。目标是为工作组提供尽可能多的信息，以便做出明智的决定，然后让路。知识产权工作组的其他备忘录[5][6]列出了一旦某项技术被选为工作组草案，需要做什么。然而，当一个工作组试图决定是否首先选择一种技术时，这并没有帮助。第三份备忘录是"
    },
    {
      "indent": 3,
      "text": "written to help in making that decision. We want to build a conceptual framework, a new set of \"common knowledge\", to make it easier for working groups to deal with intellectual property issues.",
      "zh-CHS": "写这封信是为了帮助做出那个决定。我们希望建立一个概念框架，一套新的“共同知识”，使工作组更容易处理知识产权问题。"
    },
    {
      "indent": 3,
      "text": "To do so, we first present \"case studies\" in Section 4 -- real events that have happened in recent years, and how different working groups dealt with them -- plus notes on possible lessons to be learned. In",
      "zh-CHS": "为此，我们首先在第4节中介绍“案例研究”——近年来发生的真实事件，以及不同工作组如何处理这些事件——以及可能要吸取的经验教训。在里面"
    },
    {
      "indent": 3,
      "text": "Section 5, we expand on these lessons and try to extract general principles.",
      "zh-CHS": "第5节，我们将对这些教训进行扩展，并试图提炼出一般原则。"
    },
    {
      "indent": 0,
      "text": "4. Case Studies",
      "section_title": true,
      "zh-CHS": "4. 案例研究"
    },
    {
      "indent": 3,
      "text": "The best way to know what works in dealing with IPR is to look at past attempts to do so. The following are selected as cases from which general lessons might be extracted. Other lessons might be extracted from other cases, but the cases below cover the important ones.",
      "zh-CHS": "了解如何应对知识产权的最佳方法是回顾过去的尝试。以下是可从中吸取一般经验教训的案例。可以从其他案例中汲取其他经验教训，但以下案例涵盖了重要的经验教训。"
    },
    {
      "indent": 0,
      "text": "4.1. PPP CCP and ECP",
      "section_title": true,
      "zh-CHS": "4.1. PPP CCP和ECP"
    },
    {
      "indent": 3,
      "text": "The PPP Working Group adopted technology for PPP's Connection Control Protocol and Encryption Control Protocol about which an IPR disclosure had been received. They indicated to the IESG that they believed the patented technology was the best approach, and was better than no standards at all.",
      "zh-CHS": "PPP工作组采用了PPP的连接控制协议和加密控制协议的技术，该协议的知识产权披露已经收到。他们向IESG表示，他们认为专利技术是最好的方法，比没有标准要好。"
    },
    {
      "indent": 3,
      "text": "At that time, under the policies documented in RFC 1602 [1] (the precursor to RFC 2026), progress on any standard was to stop at the Proposed Standard phase until specific assurances about licensing terms could be obtained from all IPR claimants. However, as described in RFC 1915 [3], in the case of PPP ECP and CCP, the IPR claimant balked at the requirement for specific assurances.",
      "zh-CHS": "当时，根据RFC 1602[1]（RFC 2026的前身）中记录的政策，任何标准的进展都将在拟议的标准阶段停止，直到所有知识产权权利人能够获得关于许可条款的具体保证。然而，如RFC 1915[3]所述，在PPP ECP和CCP的情况下，知识产权申请人对具体保证的要求犹豫不决。"
    },
    {
      "indent": 3,
      "text": "In the end, with support from the working group, the variance procedure described in RFC 1871 [2] was followed to grant an exception to the RFC 1602 requirements. If it had not been granted, the ECP and CCP standards could have been blocked permanently.",
      "zh-CHS": "最后，在工作组的支持下，遵循RFC 1871[2]中描述的变更程序，对RFC 1602要求给予例外。如果没有批准，ECP和CCP标准可能会被永久封锁。"
    },
    {
      "indent": 3,
      "text": "Lessons:",
      "zh-CHS": "经验教训："
    },
    {
      "indent": 3,
      "text": "o IPR claimants, even when their intentions are good, may strongly resist being forced to make specific public statements about licensing terms. If explicit statements of licensing terms are required, then the publicly stated terms will probably be \"worst-case\", which would provide little useful information.",
      "zh-CHS": "o 知识产权权利人，即使他们的意图是好的，也可能强烈抵制被迫就许可条款发表具体的公开声明。如果需要明确声明许可条款，那么公开声明的条款可能是“最坏情况”，提供的有用信息很少。"
    },
    {
      "indent": 0,
      "text": "4.2. IPS WG (IP Storage)",
      "section_title": true,
      "zh-CHS": "4.2. IP工作组（IP存储）"
    },
    {
      "indent": 3,
      "text": "The IPS (IP Storage) Working Group evaluated technology developed outside of the working group, \"secure remote password\" (SRP, RFC 2945 [7]). At the time, there was one known IPR claim, and the proposed licensing terms were apparently reasonable. SRP had become a proposed standard without going through any working group, so IETF participants may have been less likely to notice it in order to make statements about IPR. In any case, two more possible IPR claims were uncovered after the IPS working group had already decided to make SRP required. One of the possible IPR claimants did not make a strong IPR claim itself, and did not want to take the time to determine whether it actually had a claim, though it acknowledged it might have a claim. In both cases it was difficult to obtain concrete information on possible licensing terms, even though words like \"reasonable\" and \"non-discriminatory\" were used in the IPR statements. Rumors of what they might be like did not sound good. The working group participants took the claims, potential and otherwise, very seriously, and decided not to use SRP after all, even though they had already chosen it based on other criteria.",
      "zh-CHS": "IPS（IP存储）工作组评估了在工作组“安全远程密码”（SRP，RFC 2945[7]）之外开发的技术。当时，有一项已知的知识产权索赔，拟议的许可条款显然是合理的。SRP在没有经过任何工作组的情况下已成为一项拟议的标准，因此IETF参与者可能不太可能注意到它，以便就知识产权发表声明。无论如何，在IPS工作组已经决定要求SRP后，又发现了两个可能的知识产权索赔。其中一个可能的知识产权索赔人本身并没有提出强有力的知识产权索赔，也不想花时间来确定自己是否确实提出了索赔，尽管它承认自己可能提出了索赔。在这两种情况下，很难获得关于可能的许可条款的具体信息，即使在知识产权声明中使用了“合理”和“非歧视性”等词语。关于他们可能是什么样的谣言听起来并不好。工作组参与者非常认真地对待索赔、潜在索赔和其他索赔，并决定不使用SRP，尽管他们已经根据其他标准选择了SRP。"
    },
    {
      "indent": 3,
      "text": "Lessons:",
      "zh-CHS": "经验教训："
    },
    {
      "indent": 3,
      "text": "o IPR claims may appear at any time in the standards process.",
      "zh-CHS": "o 知识产权声明可能在标准过程中随时出现。"
    },
    {
      "indent": 3,
      "text": "o Take impreciseness seriously. Attempt to get clarification on both IPR claims and licensing terms.",
      "zh-CHS": "o 认真对待不精确性。试图澄清知识产权声明和许可条款。"
    },
    {
      "indent": 0,
      "text": "4.3. PEM and PKI issues",
      "section_title": true,
      "zh-CHS": "4.3. PEM和PKI问题"
    },
    {
      "indent": 3,
      "text": "The PEM (Privacy-Enhanced Mail) Working Group wanted to use public key technology. In the mid-90s, the basic principles of public key infrastructure had been patented for years. The patent holder had shown a tendency to actively enforce its rights, and to prefer software sales to licensing. This was seen as a significant potential issue, one which could possibly interfere with the easy deployment of Internet technology. However, there was no alternative technology that came close to its capabilities. Adopting an alternative would have damaged the standard's usefulness even more than adopting a technology with IPR claims. The case was so compelling that the working group participants decided to move forward on standardizing it and even requiring it.",
      "zh-CHS": "PEM（隐私增强邮件）工作组希望使用公钥技术。在90年代中期，公钥基础设施的基本原则已经获得专利多年。专利持有人已经表现出积极执行其权利的倾向，并且更喜欢软件销售而不是许可。这被视为一个重大的潜在问题，可能会干扰互联网技术的轻松部署。然而，没有替代技术接近其能力。采用替代方案会比采用具有知识产权声明的技术更损害标准的实用性。该案如此引人注目，以至于工作组参与者决定推进标准化，甚至要求标准化。"
    },
    {
      "indent": 3,
      "text": "One factor which was noted was that the patents were mature, and would expire within a few years. That meant that although the patents might be significant to start with, they would not be in the long run. This lowered the perceived risk of using the IPR-impacted technology.",
      "zh-CHS": "一个值得注意的因素是，专利已经成熟，并将在几年内到期。这意味着，尽管这些专利从一开始可能意义重大，但从长远来看，它们并不重要。这降低了使用受知识产权影响的技术的感知风险。"
    },
    {
      "indent": 3,
      "text": "Lessons:",
      "zh-CHS": "经验教训："
    },
    {
      "indent": 3,
      "text": "o IPR is just one issue in deciding whether to adopt a technology.",
      "zh-CHS": "o 知识产权只是决定是否采用某项技术的一个问题。"
    },
    {
      "indent": 3,
      "text": "o IPR is not an all-or-nothing issue. There are different types and levels of IPR protection.",
      "zh-CHS": "o 知识产权不是一个全有或全无的问题。知识产权保护有不同的类型和级别。"
    },
    {
      "indent": 3,
      "text": "o The IPR's lifecycle phase can be a consideration.",
      "zh-CHS": "o 可以考虑IPR的生命周期阶段。"
    },
    {
      "indent": 0,
      "text": "4.4. VRRP (Virtual Router Redundancy Protocol)",
      "section_title": true,
      "zh-CHS": "4.4. VRRP（虚拟路由器冗余协议）"
    },
    {
      "indent": 3,
      "text": "The working group was standardizing VRRP based on a protocol developed outside the IETF. The IPR claimant supported that protocol and stated that it would license its IPR for that protocol if it became the standard, but not for the similar protocol the working group was developing. The working group participants decided to go ahead and standardize the protocol developed in the working group anyway. The IPR claimant has only claimed its patent when someone else claimed a patent against it. There is no evidence that the working group participants actually thought about the implications of the IPR claim when they went ahead with their choice of protocol.",
      "zh-CHS": "工作组正在根据IETF之外开发的协议对VRRP进行标准化。知识产权索赔人支持该议定书，并表示，如果该议定书成为标准，它将为该议定书发放知识产权许可证，但不会为工作组正在制定的类似议定书发放许可证。工作组参与者决定继续进行，并将工作组制定的协议标准化。知识产权权利人仅在其他人对其申请专利时才申请其专利。没有证据表明，工作组参与者在选择议定书时确实考虑了知识产权主张的影响。"
    },
    {
      "indent": 3,
      "text": "Lessons:",
      "zh-CHS": "经验教训："
    },
    {
      "indent": 3,
      "text": "o IPR claims should never be disregarded without good cause. Due diligence should be done to understand the consequences of each claim.",
      "zh-CHS": "o 没有正当理由，绝不能无视知识产权主张。应进行尽职调查，以了解每项索赔的后果。"
    },
    {
      "indent": 0,
      "text": "4.5. Secure Shell (SecSH)",
      "section_title": true,
      "zh-CHS": "4.5. 安全壳（SecSH）"
    },
    {
      "indent": 3,
      "text": "This is primarily an unfinished trademark issue, not a patent issue, since the patent issue has been worked out outside of the IETF. The holder of a trademark wants the IETF to stop using \"SSH\" in the names and bodies of its proposed standards. The working group participants have thought through the details of the claims, and possible implications and risks, and decided to go ahead and continue using the names as they are now.",
      "zh-CHS": "这主要是一个未完成的商标问题，而不是专利问题，因为专利问题是在IETF之外解决的。商标持有人希望IETF停止在其拟议标准的名称和主体中使用“SSH”。工作组参与者已经仔细考虑了索赔的细节、可能的影响和风险，并决定继续使用这些名称。"
    },
    {
      "indent": 3,
      "text": "Lessons:",
      "zh-CHS": "经验教训："
    },
    {
      "indent": 3,
      "text": "o Working group participants can evaluate IPR claims not only for their possible validity, but also for the risk of misjudging that validity. The impact of honoring the IPR claim may be major or minor.",
      "zh-CHS": "o 工作组参与者不仅可以评估知识产权声明的可能有效性，还可以评估误判其有效性的风险。尊重知识产权权利主张的影响可能很大，也可能很小。"
    },
    {
      "indent": 0,
      "text": "4.6. IDN (Internationalized Domain Name)",
      "section_title": true,
      "zh-CHS": "4.6. IDN（国际化域名）"
    },
    {
      "indent": 3,
      "text": "The IDN Working Group dealt with a number of IPR claims. Several were made which did not overlap with the technology -- the IPR claimants said the patents were being announced just in case the working group decided to go that way. In one case, even though a patent was announced as purely defensive, many working group participants investigated the claims themselves. They concluded that it did not overlap.",
      "zh-CHS": "IDN工作组处理了一些知识产权索赔。其中有几项与该技术没有重叠——知识产权权利人表示，这些专利是在工作组决定这样做的情况下宣布的。在一个案例中，尽管一项专利被宣布为纯粹的防御性专利，但许多工作组参与者自己调查了这些权利主张。他们得出的结论是，这一点没有重叠。"
    },
    {
      "indent": 3,
      "text": "In one case, an IPR claimant asserted that the working group's documents, and in fact the IETF as a whole, were infringing on its rights. Individual working group participants consulted with their legal advisers, concluded that the claims would not overlap the working group's developing technology, and decided that they need not be concerned about the claims. This was reflected in the direction the group as a whole decided to take.",
      "zh-CHS": "在一个案件中，一名知识产权索赔人声称，工作组的文件，事实上，IETF作为一个整体，正在侵犯其权利。个别工作组参与者与其法律顾问进行了磋商，得出结论认为，这些索赔不会与工作组正在开发的技术重叠，并决定他们不必担心这些索赔。这反映在整个小组决定采取的方向上。"
    },
    {
      "indent": 3,
      "text": "In another case, patent claims were asserted that appeared to be derived from working group discussion, rather than vice versa (or independent discovery). The claimants were known to be following the working group's work when the ideas were proposed, and their patent filing was considerably subsequent to that time.",
      "zh-CHS": "在另一个案例中，主张的专利权似乎来自工作组的讨论，而不是工作组的讨论（或独立发现）。众所周知，当提出这些想法时，索赔人正在关注工作组的工作，他们的专利申请也在这段时间之后进行。"
    },
    {
      "indent": 3,
      "text": "In 2000 the IDN Working Group discovered a patent that some participants thought might apply to one of their main drafts. If it did, it could affect their work profoundly -- to the extent that some suggested that if they could not work out reasonable licensing terms with the IPR claimant they might just disband. As a group and individually, participants corresponded with the IPR claimant in order to get an explicit statement of licensing terms, preferably royalty-free. By doing so they gained a better understanding of just which working group activities were seen as infringing on the patent, and at least some understanding of the IPR claimant's intentions and philosophy. Since the patent holder seemed to have an interest in using the patent for profit, the group discussed the issues on its mailing list. They overtly talked about how they could change their proposed technology to avoid having to contest the patent, and the extent to which the patent might be countered by claims of prior art. Meanwhile, individually they were talking to their legal advisors. Gradually, a collective opinion formed that the working group documents did not infringe on the patent. Since then, the patent has been ignored. However, they are keeping a watchful eye out for continuation patents which might have already been submitted.",
      "zh-CHS": "2000年，IDN工作组发现了一项专利，一些参与者认为该专利可能适用于他们的主要草案之一。如果真是这样的话，这可能会对他们的工作产生深远的影响，甚至有人建议，如果他们不能与知识产权权利人达成合理的许可条款，他们可能会解散。作为一个团体和个人，参与者与知识产权权利人通信，以获得许可条款的明确声明，最好是免版税的。通过这样做，他们更好地了解了哪些工作组活动被视为侵犯了专利权，并且至少对知识产权权利人的意图和理念有了一些了解。由于专利持有人似乎有兴趣将专利用于盈利，小组讨论了其邮寄名单上的问题。他们公开谈论了如何改变他们提出的技术以避免对专利提出异议，以及专利可能在多大程度上受到现有技术权利要求的反驳。与此同时，他们分别与法律顾问交谈。渐渐地，形成了一种集体意见，认为工作组文件没有侵犯专利权。从那时起，这项专利就被忽视了。然而，他们正在密切关注可能已经提交的后续专利。"
    },
    {
      "indent": 3,
      "text": "Lessons:",
      "zh-CHS": "经验教训："
    },
    {
      "indent": 3,
      "text": "o It's sometimes beneficial to push IPR claimants to find out what they think their claims cover and what their licensing terms are.",
      "zh-CHS": "o 有时，促使知识产权权利人了解他们认为他们的权利要求涵盖的内容以及他们的许可条款是有益的。"
    },
    {
      "indent": 3,
      "text": "o Possibilities of prior art should be considered.",
      "zh-CHS": "o 应考虑现有技术的可能性。"
    },
    {
      "indent": 3,
      "text": "o It's all right, and sometimes beneficial, to discuss IPR claims and gather information about possible prior art on the group list. The results of such discussion can be considered when deciding whether to develop a technology (but remember that neither the IETF nor any working group takes a stand on such claims as a body, and the group is not the best place to get legal advice).",
      "zh-CHS": "o 讨论知识产权权利主张并收集关于组列表中可能存在的现有技术的信息是正确的，有时也是有益的。在决定是否开发一项技术时，可以考虑此类讨论的结果（但请记住，IETF或任何工作组都不会作为一个机构对此类索赔采取立场，而且该工作组也不是获得法律咨询的最佳场所）。"
    },
    {
      "indent": 0,
      "text": "5. General Principles",
      "section_title": true,
      "zh-CHS": "5. 一般原则"
    },
    {
      "indent": 3,
      "text": "Given the case studies above, there are a few principles that working groups can start with in dealing with IPR. Every working group needs to develop and follow its own consensus, and actual treatments will vary as much as they have in the past. However, every working group also needs to take IPR seriously, and consider the needs of the Internet community and the public at large, including possible future implementers and users who will not have participated in the working group process when the standardization is taking place.",
      "zh-CHS": "鉴于上述案例研究，工作组在处理知识产权问题时可以从几个原则开始。每个工作组都需要形成并遵循自己的共识，而实际的治疗方法也将和过去一样千差万别。然而，每个工作组也需要认真对待知识产权，并考虑网络社区和公众的需求，包括可能的未来实施者和不参与工作组过程的用户在标准化发生的时候。"
    },
    {
      "indent": 0,
      "text": "5.1. Types of IPR",
      "section_title": true,
      "zh-CHS": "5.1. 知识产权的类型"
    },
    {
      "indent": 3,
      "text": "A primer on the different types of IPR would be large, unreliable, and redundant with other Working Group documents [4][5][6]. For informal exploration, see those documents and other relevant sources on the web. Readers with more serious concerns should consult their legal advisors. In the United States, briefly:",
      "zh-CHS": "关于不同类型知识产权的初级读物将庞大、不可靠，并且与其他工作组文件重复[4][5][6]。有关非正式的探索，请参阅这些文档和web上的其他相关来源。有更严重问题的读者应咨询他们的法律顾问。在美国，简而言之："
    },
    {
      "indent": 3,
      "text": "o Trademarks indicate the sources of goods. Service marks indicate the sources of services. They protect the use of particular marks or similar marks.",
      "zh-CHS": "o 商标表明商品的来源。服务标记表示服务的来源。它们保护特定标记或类似标记的使用。"
    },
    {
      "indent": 3,
      "text": "o Copyrights protect the expressions of ideas (not the ideas themselves), in almost any form, and allow \"fair use\". Copyrights expire but they can be renewed.",
      "zh-CHS": "o 版权保护几乎任何形式的想法表达（而不是想法本身），并允许“合理使用”。版权过期，但可以续期。"
    },
    {
      "indent": 3,
      "text": "o Patents protect \"inventions\". They expire (utility patents expire after 20 years), but follow-on patents can cover similar technologies and can have nearly the same implications for use in the Internet as the original patents.",
      "zh-CHS": "o 专利保护“发明”。它们将到期（实用专利将在20年后到期），但后续专利可以涵盖类似的技术，并且在互联网上使用的含义与原始专利几乎相同。"
    },
    {
      "indent": 0,
      "text": "5.2. When to Think About IPR",
      "section_title": true,
      "zh-CHS": "5.2. 什么时候考虑知识产权"
    },
    {
      "indent": 3,
      "text": "This memo does not describe IPR procedures for document authors or IPR claimants. Rather, this memo is for working group participants who are trying to decide what to do about IPR claims related to their work. A working group as a whole needs to think about IPR issues:",
      "zh-CHS": "本备忘录未说明文件作者或知识产权申请人的知识产权程序。相反，这份备忘录是为那些试图决定如何处理与其工作相关的知识产权索赔的工作组参与者准备的。整个工作组需要考虑知识产权问题："
    },
    {
      "indent": 3,
      "text": "o when examining a technology, and deciding whether to initiate work on it.",
      "zh-CHS": "o 在检查一项技术并决定是否开始对其进行研究时。"
    },
    {
      "indent": 3,
      "text": "o when deciding whether to adopt a draft as a working group document.",
      "zh-CHS": "o 在决定是否将草案作为工作组文件通过时。"
    },
    {
      "indent": 3,
      "text": "o when choosing between two or more working group drafts that use different technologies.",
      "zh-CHS": "o 在使用不同技术的两个或多个工作组草案之间进行选择时。"
    },
    {
      "indent": 3,
      "text": "o when deciding whether to depend on a technology developed outside the working group.",
      "zh-CHS": "o 在决定是否依赖工作组以外开发的技术时。"
    },
    {
      "indent": 3,
      "text": "o when comparing different kinds of IPR protection.",
      "zh-CHS": "o 在比较不同类型的知识产权保护时。"
    },
    {
      "indent": 3,
      "text": "At each of these times, the working group is strongly encouraged to solicit disclosure of IPR claims and licensing terms. A working group's job will be a lot easier if IPR details are discovered early, but it should realize that IPR claims may appear at any time. Working groups should anticipate that an IPR claimant might choose not to participate in the IETF, but instead to monitor from a distance while the relevant technology is being discussed and evaluated. A working group's knowledge of IPR claims may therefore depend upon when a claimant steps forward during the course of a working group's deliberations.",
      "zh-CHS": "强烈鼓励工作组每次都要求披露知识产权权利主张和许可条款。如果及早发现知识产权的细节，工作组的工作会轻松得多，但它应该意识到，知识产权索赔可能随时出现。工作组应预计，知识产权权利人可能会选择不参加IETF，而是在讨论和评估相关技术时进行远距离监测。因此，工作组对知识产权索赔的了解可能取决于索赔人在工作组审议过程中何时挺身而出。"
    },
    {
      "indent": 0,
      "text": "5.3. IPR as a Technology Evaluation Factor",
      "section_title": true,
      "zh-CHS": "5.3. 知识产权作为技术评价因素"
    },
    {
      "indent": 3,
      "text": "How do you weigh IPR claims against other issues when deciding whether to adopt a technology?",
      "zh-CHS": "在决定是否采用某项技术时，您如何权衡知识产权索赔与其他问题？"
    },
    {
      "indent": 3,
      "text": "The ultimate goal of the IETF is to promote the overall health, robustness, flexibility, and utility of the Internet infrastructure. We base architectural decisions on our long-term extrapolations of requirements by thinking in these terms. When considering a particular technology, we compare it with other technologies not just for its elegance of design in and of itself, but also for how it fits in the bigger picture. This is done at multiple levels. It is examined for how it fits into the overall design of the working group's output, how it fits into the particular Internet infrastructure area, how it fits with work going on in other areas, and how it fits in the long view of the Internet architecture.",
      "zh-CHS": "IETF的最终目标是促进互联网基础设施的整体健康、健壮性、灵活性和实用性。我们将架构决策建立在对需求的长期推断的基础上，通过这些术语进行思考。在考虑某项特定技术时，我们将其与其他技术进行比较，不仅是因为它本身的设计优雅，还因为它如何适应更大的前景。这是在多个层次上完成的。它将检查它如何融入工作组输出的总体设计，如何融入特定的互联网基础设施领域，如何融入其他领域正在进行的工作，以及如何融入互联网架构的长远观点。"
    },
    {
      "indent": 3,
      "text": "Similarly, when evaluating a technology, working group participants consider IPR claims on it (including possible copyright issues with text describing it). The issue is not whether a particular piece of technology is IPR-impacted -- we use IPR-impacted technology every minute. The question is how much the IPR protection will limit the technology's usefulness in building a robust, highly useful Internet. Thus, the only significant questions are: is the IPR claim relevant, and what are the terms under which the technology can be used? When technology is free from IPR protection the answer is easy. When it is IPR-impacted, some licensing terms make the IPR issues insignificant compared to the engineering issues. Other terms can make a technology unusable even if it is perfect otherwise.",
      "zh-CHS": "类似地，当评估一项技术时，工作组的参与者考虑其上的知识产权要求（包括可能的版权问题与描述它的文本）。问题不在于某项技术是否受到知识产权的影响——我们每分钟都在使用受知识产权影响的技术。问题是，知识产权保护将在多大程度上限制该技术在建设一个强大、高度有用的互联网方面的作用。因此，唯一重要的问题是：知识产权声明是否相关，以及使用该技术的条件是什么？当技术不受知识产权保护时，答案很简单。当受到知识产权影响时，与工程问题相比，某些许可条款使得知识产权问题无关紧要。其他术语可以使一项技术无法使用，即使它在其他方面是完美的。"
    },
    {
      "indent": 3,
      "text": "The problem with IPR as a technology evaluation factor is that it is unlikely that a working group, as an entity, can ever claim to have reached consensus on most IPR issues. The IETF as a whole, and a working group as a whole, takes no stance on the validity of any IPR claim. It would be inappropriate for a working group chair to declare that consensus had been reached that, for example, a company's patent was invalid. Individual participants will need to use whatever legal advice resources they have access to in order to form their own individual opinions. Discussions about the validity of IPR may take place under the auspices of the working group, in particular about relative risks of technology choices. Individual participants may take these discussions into account. The working group as a body may not take a stance on validity, but it may make choices based on perceived risk.",
      "zh-CHS": "知识产权作为技术评估因素的问题在于，作为一个实体，工作组不大可能声称就大多数知识产权问题达成了共识。IETF作为一个整体，以及一个工作组作为一个整体，对任何知识产权主张的有效性不持任何立场。工作组主席宣布已经达成共识，例如，一家公司的专利无效，这是不合适的。个人参与者需要使用他们能够获得的任何法律咨询资源，以形成自己的个人意见。关于知识产权有效性的讨论可以在工作组的主持下进行，特别是关于技术选择的相对风险。个别参与者可以考虑这些讨论。作为一个机构，工作组可能不会对有效性采取立场，但它可以根据感知的风险做出选择。"
    },
    {
      "indent": 0,
      "text": "5.4. Patents versus Pending Patents Applied For",
      "section_title": true,
      "zh-CHS": "5.4. 申请的专利与未决专利"
    },
    {
      "indent": 3,
      "text": "The IETF does not (cannot) expect IPR claimants to tell a working group specifically how they think a particular patent applies. If a patent has already been granted, the IETF can reasonably expect disclosure of the patent number and possibly the relevant IETF document sections, which will allow working group participants to explore details of the claims. If a patent has not yet been granted (or if knowledge of the patent is restricted, e.g., for security reasons), significantly less information is available. In most countries patent applications are published 18 months after they are filed, but in the USA that can be avoided if the applicant does not also file outside the USA. In some countries applications are a matter of public record, but details of pending claims can be modified at any time by the claim submitter before the patent is granted. It is not known before then what rights will actually be granted. Finally, rights can be contested in court, and nothing is final until the courts decide -- perhaps not even then. All the IETF",
      "zh-CHS": "IETF不（不能）期望知识产权权利人具体告知工作组他们认为某项专利如何适用。如果已经授予专利，IETF可以合理地预期专利号和相关IETF文件部分的披露，这将允许工作组参与者探索权利要求的细节。如果一项专利尚未授予（或者如果专利知识受到限制，例如出于安全原因），可用的信息将显著减少。在大多数国家，专利申请在提交18个月后发布，但在美国，如果申请人不在美国境外提交，则可以避免这种情况。在一些国家，申请是公开记录的事项，但在授予专利之前，权利要求提交人可以随时修改未决权利要求的细节。在此之前，我们还不知道究竟会授予哪些权利。最后，权利可以在法庭上进行辩论，在法庭作出决定之前，没有任何事情是最终的——甚至在那时也可能不会。所有的IETF"
    },
    {
      "indent": 3,
      "text": "can expect regarding a pending patent is disclosure that it exists, the related IETF documents, and possibly the relevant IETF document sections and some statement about licensing terms.",
      "zh-CHS": "关于待决专利，可以预期的是其存在的披露、相关IETF文件、可能的相关IETF文件部分以及一些关于许可条款的声明。"
    },
    {
      "indent": 0,
      "text": "5.5. Applicability: It's Hard to Prove a Negative",
      "section_title": true,
      "zh-CHS": "5.5. 适用性：很难证明是否定的"
    },
    {
      "indent": 3,
      "text": "Working group participants must make their own decisions about what level of confidence they need as to whether IPR is applicable. However, perfect knowledge is not a worthwhile goal.",
      "zh-CHS": "工作组参与者必须自行决定他们对知识产权是否适用所需的信心水平。然而，完美的知识并不是一个值得追求的目标。"
    },
    {
      "indent": 3,
      "text": "In general, a working group should strive to find out about all IPR claims related to technologies it is considering, and at least the general facts about licensing terms for each case -- for example whether the terms will be royalty-free, or perhaps \"reasonable and non-discriminatory\". Working group participants should also investigate possibilities of prior art which would counter the IPR claims. However, even if the working group participants do exhaustive searches, both externally and internally to their employers, it is impossible to prove that a particular technology is not covered by a particular IPR claim, let alone prove that it is not covered by any IPR claim. Anything a working group adopts may, in the future, turn out to be IPR-impacted, although the IPR claim may not be discovered until years later. Claims are open to interpretation even after rights are granted. Drafts can be very fluid, even up to the time of last call, and IPR issues may unknowingly be taken on at any time. Absolute certainty about IPR claims is rare.",
      "zh-CHS": "一般而言，工作组应努力了解与其正在审议的技术相关的所有知识产权索赔，至少了解每种情况下许可条款的一般事实——例如，这些条款是否免版税，或者可能是“合理和非歧视性的”。工作组参与者还应调查现有技术反驳知识产权主张的可能性。然而，即使工作组参与者对其雇主进行了详尽的外部和内部搜索，也无法证明某项特定技术不在某项特定知识产权索赔范围内，更不用说证明该技术不在任何知识产权索赔范围内。工作组采取的任何措施在未来都可能受到知识产权的影响，尽管知识产权声明可能要到几年后才能被发现。即使在授予权利之后，索赔也可以解释。草稿可能非常不稳定，甚至直到最后一次通话时，知识产权问题可能会在不知不觉中随时出现。知识产权权利主张的绝对确定性是罕见的。"
    },
    {
      "indent": 3,
      "text": "However, the level of confidence needed to consider IPR when evaluating a technology is often not hard to get to. There are cases where risk is high (e.g., where licensing terms may be onerous) and thus a high level of confidence about applicability is needed, but history shows that most of the time \"rough\" confidence is good enough.",
      "zh-CHS": "然而，在评估技术时需要考虑知识产权的信心水平通常不难达到。在有些情况下，风险很高（例如，许可条款可能很繁重），因此需要对适用性有较高的信心，但历史表明，大多数情况下，“粗略”的信心已经足够了。"
    },
    {
      "indent": 3,
      "text": "In all cases, licensing terms are a more significant consideration than the validity of the IPR claims. Licensing terms often do not limit the usefulness of the technology. It is difficult to be sure about the validity of IPR claims. If the licensing terms can be determined to be reasonable, then the IPR claims become much less important.",
      "zh-CHS": "在所有情况下，许可条款比知识产权声明的有效性更重要。许可条款通常不会限制技术的实用性。很难确定知识产权主张的有效性。如果可以确定许可条款是合理的，那么知识产权声明就变得不那么重要了。"
    },
    {
      "indent": 0,
      "text": "5.6. Licensing Terms",
      "section_title": true,
      "zh-CHS": "5.6. 许可条款"
    },
    {
      "indent": 3,
      "text": "Licensing terms vary across a range from no license required at all to prohibitive. In general, working groups show a preference for technologies with IPR considerations in approximately the following order. This list does not constitute a rule, and every working group needs to take its own circumstances into account.",
      "zh-CHS": "许可条款从根本不需要许可证到禁止性许可证不等。一般来说，工作组倾向于采用知识产权考虑的技术，其顺序大致如下。这份清单并不构成一项规则，每个工作组都需要考虑到自己的情况。"
    },
    {
      "indent": 3,
      "text": "o License not required.",
      "zh-CHS": "o 不需要许可证。"
    },
    {
      "indent": 3,
      "text": "o IPR licensed with no restrictions.",
      "zh-CHS": "o 知识产权许可不受限制。"
    },
    {
      "indent": 3,
      "text": "o IPR licensed with no material restrictions, e.g., no trademark license required.",
      "zh-CHS": "o 无实质性限制的知识产权许可，例如，无需商标许可。"
    },
    {
      "indent": 3,
      "text": "o IPR licensed for a particular field of use but with no other material restrictions, e.g., licensed solely for implementations complying with a standard.",
      "zh-CHS": "o 知识产权许可用于特定的使用领域，但没有其他实质性限制，例如，仅许可用于符合标准的实施。"
    },
    {
      "indent": 3,
      "text": "o IPR licensed under royalty-free terms and reasonable and non-discriminatory restrictions.",
      "zh-CHS": "o 根据免版税条款和合理的非歧视性限制许可知识产权。"
    },
    {
      "indent": 3,
      "text": "o IPR licensed under reasonable and non-discriminatory restrictions. This may include payment of a royalty.",
      "zh-CHS": "o 在合理和非歧视性限制下许可的知识产权。这可能包括支付特许权使用费。"
    },
    {
      "indent": 3,
      "text": "o IPR which is otherwise licensable.",
      "zh-CHS": "o 其他方面可获得许可的知识产权。"
    },
    {
      "indent": 3,
      "text": "o IPR which is not licensable, i.e., which is only available as an implementation.",
      "zh-CHS": "o 不可许可的知识产权，即仅作为实施可用的知识产权。"
    },
    {
      "indent": 3,
      "text": "o IPR which is not available under any conditions.",
      "zh-CHS": "o 在任何情况下都不可用的知识产权。"
    },
    {
      "indent": 3,
      "text": "Many IPR claimants do not like to publish specific terms under which they will issue licenses. They may use standard terms for many licensees, but they prefer to negotiate terms for some. Therefore, do not expect any IPR disclosure statement to lay out detailed blanket terms for licensing.",
      "zh-CHS": "许多知识产权权利人不喜欢公布他们将颁发许可证的具体条款。他们可能会对许多被许可人使用标准条款，但他们更愿意为一些人协商条款。因此，不要指望任何知识产权披露声明会详细列出许可的一揽子条款。"
    },
    {
      "indent": 3,
      "text": "If an IPR disclosure statement lists only vague terms, that doesn't mean the terms that will be offered in individual licenses will be any worse than those offered if an IPR disclosure makes very specific statements. Obviously, if an IPR claimant refuses to suggest any terms at all, the working group is going to have trouble evaluating the future utility of the technology.",
      "zh-CHS": "如果知识产权披露声明只列出模糊的条款，这并不意味着个人许可证中提供的条款将比知识产权披露做出非常具体的声明时提供的条款更糟糕。显然，如果知识产权权利人拒绝提出任何条款，工作组将难以评估该技术的未来效用。"
    },
    {
      "indent": 3,
      "text": "There is a class of restriction which involves \"reciprocity\", in which intellectual property may be licensed if the licensee is willing to license its intellectual property in return. The",
      "zh-CHS": "有一类限制涉及“互惠”，即如果被许可人愿意许可其知识产权作为回报，则可以许可其知识产权。这个"
    },
    {
      "indent": 3,
      "text": "specificity of such agreements can vary, and the same or similar terms may be required. Another potential licensing restriction is defensive suspension, where a licensor may revoke or suspend the license if the licensee asserts a patent claim against the licensor. For interpretation of any particular reciprocity or related issue, consult your legal adviser.",
      "zh-CHS": "此类协议的特殊性可能有所不同，可能需要相同或类似的条款。另一个潜在的许可限制是防御性暂停，如果被许可人对许可人提出专利要求，许可人可以撤销或暂停许可。有关任何特定互惠或相关问题的解释，请咨询您的法律顾问。"
    },
    {
      "indent": 3,
      "text": "Words such as \"reasonable\", \"fair\", and \"non-discriminatory\" have no objective legal or financial definition. The actual licensing terms can vary tremendously. Also, IPR claimants have occasionally asserted that there were already sufficient licenses for a particular technology to meet \"reasonable\" multisource and competitiveness requirements and, hence, that refusing to grant any licenses to new applicants was both fair and non-discriminatory. The best way to find out what an IPR claimant really means by those terms is to ask, explicitly. It also helps to gather knowledge about licenses actually issued, for that technology or for others, and about other experiences with the IPR claimant.",
      "zh-CHS": "“合理”、“公平”和“非歧视性”等词没有客观的法律或财务定义。实际的许可条款可能差异很大。此外，知识产权权利人偶尔声称，某项技术已经有足够的许可证满足“合理的”多源和竞争力要求，因此，拒绝向新申请人发放任何许可证是公平和非歧视的。要了解知识产权权利人使用这些术语的真正含义，最好的方法是明确询问。它还有助于收集有关该技术或其他技术的实际颁发许可证的知识，以及知识产权权利人的其他经验。"
    },
    {
      "indent": 3,
      "text": "Despite the fact that IPR claimants often don't like to publish explicit terms, there are levels of vagueness, and individuals and even working groups can sometimes successfully push an IPR claimant toward less vagueness. Many employers of IETF participants know that the IETF prefers explicit terms, and do feel pressure to produce them.",
      "zh-CHS": "尽管知识产权权利人通常不喜欢公布明确的条款，但存在一定程度的模糊性，个人甚至工作组有时可以成功地促使知识产权权利人减少模糊性。IETF参与者的许多雇主都知道IETF更喜欢明确的条款，并且确实感到产生这些条款的压力。"
    },
    {
      "indent": 3,
      "text": "If working group participants are dissatisfied with the confidence level they can obtain directly about licensing terms for a particular technology, they can possibly extrapolate from history. In order for licensed technology to become a draft standard, at least two independent licenses need to have been issued. If the IPR claimant for the technology the working group is considering has licensed other technology in the past, there is a record of the sorts of terms they are willing to grant, at least in those specific cases. This sort of thing is weak but everything counts, and it may be of some help.",
      "zh-CHS": "如果工作组参与者对他们可以直接获得的关于特定技术许可条款的信心水平不满意，他们可以从历史中推断。为了使许可技术成为标准草案，至少需要颁发两个独立的许可证。如果工作组正在考虑的技术的知识产权权利人过去曾许可过其他技术，则至少在这些特定情况下，他们愿意授予的条款种类记录在案。这类事情很脆弱，但一切都很重要，可能会有所帮助。"
    },
    {
      "indent": 3,
      "text": "In many jurisdictions that issue patents, inventors are required to file patent applications within 12 months of public disclosure or use of a novel method or process. Since many of these jurisdictions also provide for publication of pending patent applications 18 months after a patent application is filed, the ability to determine whether or not claims have been made at all relating to a particular technology increases 30 months (12 + 18) after the public disclosure or use of that technology.",
      "zh-CHS": "在许多颁发专利的司法管辖区，发明人必须在公开披露或使用新方法或工艺后12个月内提交专利申请。由于许多这些司法管辖区还规定在提交专利申请18个月后公布未决专利申请，因此在公开披露或使用某项技术后30个月（12+18）内，确定是否已提出与该项技术相关的权利要求的能力增加。"
    },
    {
      "indent": 0,
      "text": "5.7. Third-Party Disclosure of IPR Claims",
      "section_title": true,
      "zh-CHS": "5.7. 知识产权索赔的第三方披露"
    },
    {
      "indent": 3,
      "text": "It is good to notify the IETF of relevant IPR claims even when they are not one's own, and [6] says to do so \"as soon as possible\". However, anyone considering such a disclosure should do some preliminary exploration with the affected working group(s) beforehand (see Section 5.7.1). Third-party disclosure is a potential denial of service threat to the working group, and therefore it is good form to proceed slowly at first.",
      "zh-CHS": "最好将相关知识产权声明通知IETF，即使这些声明不是自己的，并且[6]表示要“尽快”通知IETF。但是，任何考虑此类披露的人应事先与受影响的工作组进行初步探讨（见第5.7.1节）。第三方披露对工作组来说是一种潜在的拒绝服务威胁，因此最好先慢慢进行。"
    },
    {
      "indent": 3,
      "text": "Working group participants should be aware that third-party disclosure can be used, knowingly or unknowingly, to defocus and distract the working group and hinder its progress. They should evaluate third-party disclosures accordingly. Working group chairs should be willing and able to discipline those they think are using the third-party disclosure system inappropriately. Those who think they are being unfairly blocked may take the matter up with the Area Directors and/or the IESG.",
      "zh-CHS": "工作组参与者应意识到，第三方披露可能被有意或无意地用来分散工作组的注意力，妨碍工作组的进展。他们应该相应地评估第三方披露。工作组主席应当愿意并且能够对那些他们认为不适当地使用第三方披露制度的人进行处罚。那些认为自己被不公平地阻止的人可能会向区域主管和/或IESG提出这一问题。"
    },
    {
      "indent": 3,
      "text": "All of the criteria for evaluating IPR claims discussed in the sections above apply in the case of third-party disclosures as well, to the extent they can be practiced.",
      "zh-CHS": "上述章节中讨论的所有评估知识产权权利要求的标准也适用于第三方披露的情况，只要可以实施。"
    },
    {
      "indent": 0,
      "text": "5.7.1. Third-Party Disclosure Advice",
      "section_title": true,
      "zh-CHS": "5.7.1. 第三方披露建议"
    },
    {
      "indent": 3,
      "text": "This subsection provides advice to those considering making third-party disclosures. While not required, the actions described here are encouraged to aid working groups in dealing with the possible implications of third-party disclosures. In evaluating what (if anything) to do in response to a third-party disclosure, a working group may consider the extent to which the discloser has followed this advice (for example, in considering whether a disclosure is intended primarily to defocus and distract the working group).",
      "zh-CHS": "本小节向考虑进行第三方披露的人提供建议。虽然不是必需的，但鼓励此处描述的行动帮助工作组处理第三方披露的可能影响。在评估对第三方披露作出反应时（如果有什么），工作组可以考虑披露者遵循该建议的程度（例如，在考虑披露是否主要是为了散焦和分散工作组）。"
    },
    {
      "indent": 3,
      "text": "In general a potential discloser should exchange mail with the working group chair(s) first, to open the way for discussion. Also, if the potential discloser is not sure if the IPR claim applies, this is the time to reach some kind of agreement with the working group chair(s) before saying anything publicly. After discussion with the working group chair(s), the potential discloser should bring the issue to the attention of the working group, and to the attention of the IPR claimant if doing so is not too difficult. Such discussion should help the potential discloser to become more sure, one way or the other. If the potential discloser is sure the discovered IPR claim applies, and the IPR claimant does not submit a first-party disclosure itself, then the potential discloser is encouraged to submit a third-party disclosure.",
      "zh-CHS": "一般而言，潜在披露方应首先与工作组主席交换邮件，为讨论开辟道路。此外，如果潜在披露方不确定知识产权主张是否适用，那么在公开发表任何意见之前，现在是与工作组主席达成某种协议的时候了。在与工作组主席讨论后，潜在披露方应提请工作组注意该问题，如果不太困难，还应提请知识产权权利人注意。这样的讨论应该有助于潜在的披露方以这样或那样的方式变得更加确定。如果潜在披露方确信所发现的知识产权索赔适用，且知识产权索赔人本身未提交第一方披露，则鼓励潜在披露方提交第三方披露。"
    },
    {
      "indent": 3,
      "text": "Intellectual property often applies to more than one working group. A person thinking of making a third-party disclosure should consider what other working groups might be affected, and communicate with them in the same manner.",
      "zh-CHS": "知识产权通常适用于多个工作组。一个想做第三方披露的人应该考虑其他工作组可能会受到什么影响，并以同样的方式与他们进行沟通。"
    },
    {
      "indent": 3,
      "text": "Don't bring up IPR issues that are unrelated to the areas where the working group is focusing at that time. Don't bring IPR claims to the working group's attention just in case they might be relevant in a few months, but only if they have implications for current work. Messages to the working group list should be substantive, and a single message should focus on a specific issue. They can reference multiple claims or patents related to that issue.",
      "zh-CHS": "不要提出与工作组当时关注的领域无关的知识产权问题。不要将知识产权声明提请工作组注意，以防它们在几个月后可能相关，但前提是它们对当前工作有影响。向工作组名单发出的信息应是实质性的，单一信息应侧重于具体问题。他们可以引用与该问题相关的多项权利要求或专利。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This memo relates to IETF process, not any particular technology. There are security considerations when adopting any technology, whether IPR claims are asserted against it or not. A working group should take those security considerations into account as one part of evaluating the technology, just as IPR is one part, but they are not issues of security with IPR procedures.",
      "zh-CHS": "本备忘录涉及IETF过程，而非任何特定技术。在采用任何技术时都会考虑到安全问题，无论是否有针对该技术的知识产权主张。工作组应将这些安全考虑因素作为评估技术的一部分加以考虑，就像知识产权是其中一部分一样，但它们不是知识产权程序的安全问题。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The author would like to acknowledge the help of the IETF IPR Working Group. The author would also like to thank the following for their extensive comments and suggestions: Robert Barr, David Black, Scott Bradner, Jorge Contreras, Paul Gleichauf, Keith Moore, Russell Nelson, Jon Peterson, Randy Presuhn, Pekka Savola, Valerie See, Bob Wyman, and Joe Zebarth.",
      "zh-CHS": "作者要感谢IETF知识产权工作组的帮助。作者还想感谢以下人士的广泛评论和建议：罗伯特·巴尔、大卫·布莱克、斯科特·布拉德纳、豪尔赫·孔特雷拉斯、保罗·格雷肖夫、基思·摩尔、拉塞尔·纳尔逊、乔恩·彼得森、兰迪·普雷森、佩卡·萨沃拉、瓦莱丽·西、鲍勃·怀曼和乔·泽巴斯。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Huitema, C. and P. Gross, \"The Internet Standards Process -- Revision 2\", RFC 1602, March 1994.",
      "zh-CHS": "[1] Huitema，C.和P.Gross，“互联网标准过程——修订2”，RFC1602，1994年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Postel, J., \"Addendum to RFC 1602 -- Variance Procedure\", BCP 2, RFC 1871, November 1995.",
      "zh-CHS": "[2] Postel，J.，“RFC 1602补遗——变更程序”，BCP 2，RFC 1871，1995年11月。"
    },
    {
      "indent": 3,
      "text": "[3] Kastenholz, F., \"Variance for The PPP Connection Control Protocol and The PPP Encryption Control Protocol\", BCP 3, RFC 1915, February 1996.",
      "zh-CHS": "[3] Kastenholz，F.，“PPP连接控制协议和PPP加密控制协议的差异”，BCP 3，RFC 1915，1996年2月。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[4] Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[5] Bradner, S., Ed., \"IETF Rights in Contributions\", BCP 78, RFC 3667, February 2004.",
      "zh-CHS": "[5] Bradner，S.，编辑，“IETF在贡献中的权利”，BCP 78，RFC 3667，2004年2月。"
    },
    {
      "indent": 3,
      "text": "[6] Bradner, S., Ed., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3668, February 2004.",
      "zh-CHS": "[6] Bradner，S.，编辑，“IETF技术中的知识产权”，BCP 79，RFC 3668，2004年2月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[7] Wu, T., \"The SRP Authentication and Key Exchange System\", RFC 2945, September 2000.",
      "zh-CHS": "[7] Wu，T.，“SRP认证和密钥交换系统”，RFC 29452000年9月。"
    },
    {
      "indent": 0,
      "text": "9. Author's Address",
      "section_title": true,
      "zh-CHS": "9. 作者地址"
    },
    {
      "indent": 3,
      "text": "Scott Brim Cisco Systems, Inc. 146 Honness Lane Ithaca, NY 14850 USA",
      "zh-CHS": "斯科特·布里姆思科系统公司，美国纽约州伊萨卡Honness Lane 146号，邮编：14850"
    },
    {
      "indent": 3,
      "text": "EMail: sbrim@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "10. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78 and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}