{
  "title": {
    "text": "RFC 3691:  Internet Message Access Protocol (IMAP) UNSELECT command ",
    "zh-CHS": "RFC 3691"
  },
  "number": 3691,
  "created_at": "2021-11-17 17:10:24.879078+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        A. Melnikov\nRequest for Comments: 3691                                    Isode Ltd.\nCategory: Standards Track                                  February 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Internet Message Access Protocol (IMAP) UNSELECT command",
      "zh-CHS": "Internet消息访问协议（IMAP）取消选择命令"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines an UNSELECT command that can be used to close the current mailbox in an Internet Message Access Protocol - version 4 (IMAP4) session without expunging it. Certain types of IMAP clients need to release resources associated with the selected mailbox without selecting a different mailbox. While IMAP4 provides this functionality (via a SELECT command with a nonexistent mailbox name or reselecting the same mailbox with EXAMINE command), a more clean solution is desirable.",
      "zh-CHS": "本文档定义了一个UNSELECT命令，该命令可用于关闭Internet邮件访问协议版本4（IMAP4）会话中的当前邮箱，而无需将其删除。某些类型的IMAP客户端需要释放与所选邮箱关联的资源，而无需选择其他邮箱。虽然IMAP4提供了此功能（通过使用不存在的邮箱名称的SELECT命令或使用EXECINE命令重新选择相同的邮箱），但需要一个更干净的解决方案。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  UNSELECT command . . . . . . . . . . . . . . . . . . . . . . .  2\n3.  Security Considerations. . . . . . . . . . . . . . . . . . . .  3\n4.  Formal Syntax. . . . . . . . . . . . . . . . . . . . . . . . .  3\n5.  IANA Considerations. . . . . . . . . . . . . . . . . . . . . .  3\n6.  Acknowledgments. . . . . . . . . . . . . . . . . . . . . . . .  3\n7.  Normative References . . . . . . . . . . . . . . . . . . . . .  4\n8.  Author's Address . . . . . . . . . . . . . . . . . . . . . . .  4\n9.  Full Copyright Statement . . . . . . . . . . . . . . . . . . .  5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Certain types of IMAP clients need to release resources associated with the selected mailbox without selecting a different mailbox. While [IMAP4] provides this functionality (via a SELECT command with a nonexistent mailbox name or reselecting the same mailbox with EXAMINE command), a more clean solution is desirable.",
      "zh-CHS": "某些类型的IMAP客户端需要释放与所选邮箱关联的资源，而无需选择其他邮箱。虽然[IMAP4]提供了此功能（通过一个不存在邮箱名称的SELECT命令或使用EXCEINE命令重新选择同一邮箱），但需要一个更干净的解决方案。"
    },
    {
      "indent": 3,
      "text": "[IMAP4] defines the CLOSE command that closes the selected mailbox as well as permanently removes all messages with the \\Deleted flag set.",
      "zh-CHS": "[IMAP4]定义关闭所选邮箱以及永久删除设置了\\Deleted标志的所有邮件的关闭命令。"
    },
    {
      "indent": 3,
      "text": "However [IMAP4] lacks a command that simply closes the mailbox without expunging it. This document defines the UNSELECT command for this purpose.",
      "zh-CHS": "但是[IMAP4]缺少一个命令，该命令只关闭邮箱而不删除邮箱。本文档定义了用于此目的的取消选择命令。"
    },
    {
      "indent": 3,
      "text": "A server which supports this extension indicates this with a capability name of \"UNSELECT\".",
      "zh-CHS": "支持此扩展的服务器使用功能名称“UNSELECT”指示此扩展。"
    },
    {
      "indent": 3,
      "text": "\"C:\" and \"S:\" in examples show lines sent by the client and server respectively.",
      "zh-CHS": "示例中的“C:”和“S:”分别显示了客户端和服务器发送的行。"
    },
    {
      "indent": 3,
      "text": "The keywords \"MUST\", \"MUST NOT\", \"SHOULD\", \"SHOULD NOT\", and \"MAY\" in this document when typed in uppercase are to be interpreted as defined in \"Key words for use in RFCs to Indicate Requirement Levels\" [KEYWORDS].",
      "zh-CHS": "本文件中的关键字“必须”、“不得”、“应该”、“不应该”和“可能”在大写时应按照“RFCs中用于指示需求水平的关键字”[关键字]中的定义进行解释。"
    },
    {
      "indent": 0,
      "text": "2. UNSELECT Command",
      "section_title": true,
      "zh-CHS": "2. 取消选择命令"
    },
    {
      "indent": 3,
      "text": "Arguments: none",
      "zh-CHS": "论点：无"
    },
    {
      "indent": 3,
      "text": "Responses: no specific responses for this command",
      "zh-CHS": "响应：此命令没有特定的响应"
    },
    {
      "indent": 3,
      "text": "Result: OK - unselect completed, now in authenticated state BAD - no mailbox selected, or argument supplied but none permitted",
      "zh-CHS": "结果：确定-取消选择已完成，现在处于已验证状态错误-未选择邮箱，或提供参数，但不允许使用任何参数"
    },
    {
      "indent": 6,
      "text": "The UNSELECT command frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as CLOSE, except that no messages are permanently removed from the currently selected mailbox.",
      "zh-CHS": "UNSELECT命令释放与所选邮箱关联的服务器资源，并将服务器返回到已验证状态。此命令执行与关闭相同的操作，但不会从当前选定的邮箱中永久删除任何邮件。"
    },
    {
      "indent": 3,
      "text": "Example: C: A341 UNSELECT S: A341 OK Unselect completed",
      "zh-CHS": "示例：C:A341取消选择S:A341正常取消选择完成"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "It is believed that this extension doesn't raise any additional security concerns not already discussed in [IMAP4].",
      "zh-CHS": "据信，此扩展不会引起[IMAP4]中未讨论的任何其他安全问题。"
    },
    {
      "indent": 0,
      "text": "4. Formal Syntax",
      "section_title": true,
      "zh-CHS": "4. 形式语法"
    },
    {
      "indent": 3,
      "text": "The following syntax specification uses the Augmented Backus-Naur Form (ABNF) notation as specified in [ABNF]. Non-terminals referenced but not defined below are as defined by [IMAP4].",
      "zh-CHS": "以下语法规范使用[ABNF]中指定的增广Backus Naur Form（ABNF）表示法。以下引用但未定义的非端子由[IMAP4]定义。"
    },
    {
      "indent": 3,
      "text": "Except as noted otherwise, all alphabetic characters are case-insensitive. The use of upper or lower case characters to define token strings is for editorial clarity only. Implementations MUST accept these strings in a case-insensitive fashion.",
      "zh-CHS": "除非另有说明，否则所有字母字符都不区分大小写。使用大写或小写字符定义标记字符串仅为编辑目的。实现必须以不区分大小写的方式接受这些字符串。"
    },
    {
      "indent": 3,
      "text": "command-select /= \"UNSELECT\"",
      "zh-CHS": "命令select/=“取消选择”"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IMAP4 capabilities are registered by publishing a standards track or IESG approved experimental RFC. The registry is currently located at:",
      "zh-CHS": "IMAP4功能通过发布标准跟踪或IESG批准的实验RFC进行注册。注册处目前位于："
    },
    {
      "indent": 6,
      "text": "http://www.iana.org/assignments/imap4-capabilities",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document defines the UNSELECT IMAP capabilities. IANA has added this capability to the registry.",
      "zh-CHS": "本文档定义了取消选择IMAP功能。IANA已将此功能添加到注册表中。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "UNSELECT command was originally implemented by Tim Showalter in Cyrus IMAP server.",
      "zh-CHS": "UNSELECT命令最初由Tim Showalter在Cyrus IMAP服务器中实现。"
    },
    {
      "indent": 3,
      "text": "Also, the author of the document would like to thank Vladimir Butenko and Mark Crispin for reminding that UNSELECT has to be documented. Also thanks to Simon Josefsson for pointing out that there are multiple ways to implement UNSELECT.",
      "zh-CHS": "此外，该文件的作者还要感谢弗拉基米尔·布滕科和马克·克里斯平提醒必须记录取消选择。还要感谢Simon Josefsson指出有多种方法可以实现取消选择。"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "zh-CHS": "7. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[关键词]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[IMAP4] Crispin, M., \"Internet Message Access Protocol - Version 4rev1\", RFC 3501, March 2003.",
      "zh-CHS": "[IMAP4]Crispin，M.，“互联网消息访问协议-版本4rev1”，RFC 35012003年3月。"
    },
    {
      "indent": 3,
      "text": "[ABNF] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "zh-CHS": "[ABNF]Crocker，D.，Ed.和P.Overell，“语法规范的扩充BNF:ABNF”，RFC 2234，1997年11月。"
    },
    {
      "indent": 0,
      "text": "8. Author's Address",
      "section_title": true,
      "zh-CHS": "8. 作者地址"
    },
    {
      "indent": 3,
      "text": "Alexey Melnikov Isode Limited 5 Castle Business Village Hampton, Middlesex TW12 2BX",
      "zh-CHS": "Alexey Melnikov Isode Limited 5城堡商业村汉普顿，米德尔塞克斯TW12 2BX"
    },
    {
      "indent": 3,
      "text": "EMail: Alexey.Melnikov@isode.com\nURI: http://www.melnikov.ca/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "9. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78 and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}