{
  "title": {
    "text": "RFC 3043:  The Network Solutions Personal Internet Name (PIN): A URN Namespace for People and Organizations ",
    "zh-CHS": "RFC 3043"
  },
  "number": 3043,
  "created_at": "2021-10-25 18:19:06.131753+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        M. Mealling\nRequest for Comments: 3043                       Network Solutions, Inc.\nCategory: Informational                                     January 2001",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "The Network Solutions Personal Internet Name (PIN): A URN Namespace for People and Organizations",
      "zh-CHS": "网络解决方案个人互联网名称（PIN）：个人和组织的URN名称空间"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace that is engineered by Network Solutions, Inc. for naming people and organizations.",
      "zh-CHS": "本文档描述了由Network Solutions，Inc.设计的统一资源名称（URN）命名空间，用于命名人员和组织。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "In many cases Network Solutions' maintained directory applications require some unique and persistent way to talk about an individual or organization. For example, white pages style services need to determine if one entry is distinct from another even if some of the data happens to be the same. Also, e-commerce authentication mechanisms needs to identify a user and/or company uniquely and possibly over large spans of time. In many cases a customer relationship can last several decades. Such long term customer relationships can outlast any specific email address, Internet service provider, surname, or possibly even the DNS itself.",
      "zh-CHS": "在许多情况下，网络解决方案维护的目录应用程序需要某种独特和持久的方式来谈论个人或组织。例如，即使某些数据恰好相同，白页样式的服务也需要确定一个条目是否与另一个条目不同。此外，电子商务身份验证机制需要在较长的时间跨度内唯一地识别用户和/或公司。在许多情况下，客户关系可以持续几十年。这种长期的客户关系可以持续到任何特定的电子邮件地址、互联网服务提供商、姓氏，甚至可能是DNS本身。"
    },
    {
      "indent": 3,
      "text": "The intent for these applications is that they be used and integrated into other, non-NSI maintained applications in much the same way that domain-names that exist in Network Solution's database are primarily used in application that Network Solutions is _not_ involved in. In much the same way that ISBNs are maintained by specific entities but used in widely varying applications, NSI's PIN namespace is intended to be used in many applications where there is a need for a well maintained identifier that names a person or organization.",
      "zh-CHS": "这些应用程序的目的是使用它们并将其集成到其他非NSI维护的应用程序中，就像Network Solutions数据库中存在的域名主要用于Network Solutions不参与的应用程序一样。与ISBN由特定实体维护但用于各种应用程序的方式大致相同，NSI的PIN名称空间旨在用于许多需要维护良好的标识符来命名个人或组织的应用程序。"
    },
    {
      "indent": 3,
      "text": "A URN namespace is uniquely suited to solve the persistent identification needs of these applications since they are also required to be unique and persistent. The availability of a standardized resolution mechanism makes it possible for other applications to reference and resolve PIN URNs in their own systems in an open, non-proprietary way.",
      "zh-CHS": "URN名称空间非常适合解决这些应用程序的持久标识需求，因为它们也需要是唯一和持久的。标准化解析机制的可用性使其他应用程序能够以开放、非专有的方式在自己的系统中引用和解析PIN URN。"
    },
    {
      "indent": 3,
      "text": "This namespace specification is for a formal namespace.",
      "zh-CHS": "此名称空间规范适用于正式名称空间。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "zh-CHS": "2. 规范模板"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 7,
      "text": "\"pin\" requested.",
      "zh-CHS": "请输入“pin”。"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 7,
      "text": "Registration Version Number: 1 Registration Date: 2000-09-30",
      "zh-CHS": "注册版本号：1注册日期：2000-09-30"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 7,
      "text": "Network Solutions 505 Huntmar Park Drive Herndon, VA 22070",
      "zh-CHS": "网络解决方案505亨特马公园大道赫恩登，弗吉尼亚州22070"
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "zh-CHS": "结构声明："
    },
    {
      "indent": 7,
      "text": "The structure of the NSS is a flat space of alphanumeric characters which have no knowable structure outside of the context of Network Solutions internal resolver. Future changes to the assignment methods may allow others to assign sub-spaces of the flat namespace but again, this knowledge is only valid internally and should never be inferred or relied upon externally.",
      "zh-CHS": "NSS的结构是一个字母数字字符的平面空间，在网络解决方案内部解析器的上下文之外没有已知的结构。分配方法的未来更改可能允许其他人分配平面命名空间的子空间，但同样，此知识仅在内部有效，不应在外部推断或依赖。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 7,
      "text": "None",
      "zh-CHS": "没有一个"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 7,
      "text": "Identifiers are assigned by Network Solutions proprietary registration system in a way that guarantees uniqueness. At this time the algorithm is to iterate from the last assigned number by some positive integer. In the future this algorithm may change to incorporate a full range of alphanumeric",
      "zh-CHS": "网络解决方案专有注册系统以保证唯一性的方式分配标识符。此时，算法是从最后一个指定的数字开始迭代某个正整数。在未来，这种算法可能会改变，以纳入一个完整的字母数字范围"
    },
    {
      "indent": 9,
      "text": "elements. In either case, the system will compare the newly created identifier with all of the previous ones to ensure that it has not already been assigned.",
      "zh-CHS": "元素。在任何一种情况下，系统都会将新创建的标识符与以前的所有标识符进行比较，以确保尚未分配该标识符。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 7,
      "text": "The assignment process guarantees that names are not reassigned and that the binding between the name and the person or organization is permanent, regardless of any personal name changes, corporate restructuring, death or dissolution.",
      "zh-CHS": "转让流程保证不会重新分配姓名，并且姓名与个人或组织之间的约束力是永久性的，无论个人姓名发生任何变更、公司重组、死亡或解散。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 7,
      "text": "Names are granted via Network Solutions proprietary registration procedures.",
      "zh-CHS": "名称通过网络解决方案专有注册程序授予。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 7,
      "text": "PIN URNs are resolved via URN resolvers run by Network Solutions. Since a PIN URN identifies a person or organization, resolving a PIN URN will only be able to return information from an electronic proxy that is merely a representation of the actual person or organization being named.",
      "zh-CHS": "PIN URN通过网络解决方案运行的URN解析器进行解析。由于PIN-URN标识个人或组织，因此解析PIN-URN只能从电子代理返回信息，而电子代理仅代表被命名的实际个人或组织。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 7,
      "text": "The entire URN is case-insensitive.",
      "zh-CHS": "整个URN不区分大小写。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 7,
      "text": "There are no additional characters reserved.",
      "zh-CHS": "没有保留其他字符。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 7,
      "text": "None additional to resolution specified",
      "zh-CHS": "除指定的决议外，无其他决议"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 7,
      "text": "Global",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are listed for pedagogical reasons only.",
      "zh-CHS": "以下示例不能保证是真实的。它们仅出于教学原因列出。"
    },
    {
      "indent": 6,
      "text": "URN:pin:bs4321234\nURN:pin:324kj5hkj45\nURN:pin:mm2136",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Since the URNs in this namespace are opaque there are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "由于此命名空间中的URN是不透明的，因此除了通常与URN的使用和解析相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 3,
      "text": "It is noted however that attempting to resolve a PIN URN through a resolver other than the one provided by Network Solution is error prone. In any case it is not considered authoritative.",
      "zh-CHS": "但需要注意的是，尝试通过网络解决方案提供的解析程序以外的解析程序解析PIN URN容易出错。无论如何，它都不被认为是权威的。"
    },
    {
      "indent": 0,
      "text": "References",
      "zh-CHS": "工具书类"
    },
    {
      "indent": 3,
      "text": "[1] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[1] 护城河，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Michael Mealling Network Solutions, Inc. 505 Huntmar Park Drive Herndon, VA 22070 US",
      "zh-CHS": "迈克尔·米林网络解决方案公司，美国弗吉尼亚州亨特马公园大道505号，邮编：22070"
    },
    {
      "indent": 3,
      "text": "Phone: +1 770 935 5492\nEMail: michaelm@netsol.com\nURI:   http://www.netsol.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}