{
  "title": {
    "text": "RFC 3272:  Overview and Principles of Internet Traffic Engineering ",
    "zh-CHS": "RFC 3272"
  },
  "number": 3272,
  "created_at": "2021-10-26 12:34:54.188303+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         D. Awduche\nRequest for Comments: 3272                                Movaz Networks\nCategory: Informational                                          A. Chiu\n                                                         Celion Networks\n                                                              A. Elwalid\n                                                              I. Widjaja\n                                                     Lucent Technologies\n                                                                 X. Xiao\n                                                        Redback Networks\n                                                                May 2002",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Overview and Principles of Internet Traffic Engineering",
      "zh-CHS": "互联网流量工程概述及原理"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo describes the principles of Traffic Engineering (TE) in the Internet. The document is intended to promote better understanding of the issues surrounding traffic engineering in IP networks, and to provide a common basis for the development of traffic engineering capabilities for the Internet. The principles, architectures, and methodologies for performance evaluation and performance optimization of operational IP networks are discussed throughout this document.",
      "zh-CHS": "本备忘录描述了互联网流量工程（TE）的原理。本文件旨在促进对IP网络流量工程相关问题的更好理解，并为互联网流量工程能力的开发提供共同基础。本文将讨论操作IP网络性能评估和性能优化的原则、体系结构和方法。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.0 Introduction...................................................3\n   1.1 What is Internet Traffic Engineering?.......................4\n   1.2 Scope.......................................................7\n   1.3 Terminology.................................................8\n2.0 Background....................................................11\n   2.1 Context of Internet Traffic Engineering....................12\n   2.2 Network Context............................................13\n   2.3 Problem Context............................................14\n      2.3.1 Congestion and its Ramifications......................16\n   2.4 Solution Context...........................................16\n      2.4.1 Combating the Congestion Problem......................18\n   2.5 Implementation and Operational Context.....................21",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "3.0 Traffic Engineering Process Model.............................21\n   3.1 Components of the Traffic Engineering Process Model........23\n   3.2 Measurement................................................23\n   3.3 Modeling, Analysis, and Simulation.........................24\n   3.4 Optimization...............................................25\n4.0 Historical Review and Recent Developments.....................26\n   4.1 Traffic Engineering in Classical Telephone Networks........26\n   4.2 Evolution of Traffic Engineering in the Internet...........28\n      4.2.1 Adaptive Routing in ARPANET...........................28\n      4.2.2 Dynamic Routing in the Internet.......................29\n      4.2.3 ToS Routing...........................................30\n      4.2.4 Equal Cost Multi-Path.................................30\n      4.2.5 Nimrod................................................31\n   4.3 Overlay Model..............................................31\n   4.4 Constraint-Based Routing...................................32\n   4.5 Overview of Other IETF Projects Related to Traffic\n       Engineering................................................32\n      4.5.1 Integrated Services...................................32\n      4.5.2 RSVP..................................................33\n      4.5.3 Differentiated Services...............................34\n      4.5.4 MPLS..................................................35\n      4.5.5 IP Performance Metrics................................36\n      4.5.6 Flow Measurement......................................37\n      4.5.7 Endpoint Congestion Management........................37\n   4.6 Overview of ITU Activities Related to Traffic\n       Engineering................................................38\n   4.7 Content Distribution.......................................39\n5.0 Taxonomy of Traffic Engineering Systems.......................40\n   5.1 Time-Dependent Versus State-Dependent......................40\n   5.2 Offline Versus Online......................................41\n   5.3 Centralized Versus Distributed.............................42\n   5.4 Local Versus Global........................................42\n   5.5 Prescriptive Versus Descriptive............................42\n   5.6 Open-Loop Versus Closed-Loop...............................43\n   5.7 Tactical vs Strategic......................................43\n6.0 Recommendations for Internet Traffic Engineering..............43\n   6.1 Generic Non-functional Recommendations.....................44\n   6.2 Routing Recommendations....................................46\n   6.3 Traffic Mapping Recommendations............................48\n   6.4 Measurement Recommendations................................49\n   6.5 Network Survivability......................................50\n      6.5.1 Survivability in MPLS Based Networks..................52\n      6.5.2 Protection Option.....................................53\n   6.6 Traffic Engineering in Diffserv Environments...............54\n   6.7 Network Controllability....................................56\n7.0 Inter-Domain Considerations...................................57\n8.0 Overview of Contemporary TE Practices in Operational\n    IP Networks...................................................59",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "9.0 Conclusion....................................................63\n10.0 Security Considerations......................................63\n11.0 Acknowledgments..............................................63\n12.0 References...................................................64\n13.0 Authors' Addresses...........................................70\n14.0 Full Copyright Statement.....................................71",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1.0 Introduction",
      "section_title": true,
      "zh-CHS": "1.0 介绍"
    },
    {
      "indent": 3,
      "text": "This memo describes the principles of Internet traffic engineering. The objective of the document is to articulate the general issues and principles for Internet traffic engineering; and where appropriate to provide recommendations, guidelines, and options for the development of online and offline Internet traffic engineering capabilities and support systems.",
      "zh-CHS": "本备忘录描述了互联网流量工程的原理。本文件的目的是阐明互联网流量工程的一般问题和原则；并在适当的情况下，为在线和离线互联网流量工程能力和支持系统的开发提供建议、指南和选项。"
    },
    {
      "indent": 3,
      "text": "This document can aid service providers in devising and implementing traffic engineering solutions for their networks. Networking hardware and software vendors will also find this document helpful in the development of mechanisms and support systems for the Internet environment that support the traffic engineering function.",
      "zh-CHS": "本文档可帮助服务提供商为其网络设计和实施流量工程解决方案。网络硬件和软件供应商还将发现，本文件有助于为支持流量工程功能的互联网环境开发机制和支持系统。"
    },
    {
      "indent": 3,
      "text": "This document provides a terminology for describing and understanding common Internet traffic engineering concepts. This document also provides a taxonomy of known traffic engineering styles. In this context, a traffic engineering style abstracts important aspects from a traffic engineering methodology. Traffic engineering styles can be viewed in different ways depending upon the specific context in which they are used and the specific purpose which they serve. The combination of styles and views results in a natural taxonomy of traffic engineering systems.",
      "zh-CHS": "本文档提供了描述和理解常见互联网流量工程概念的术语。本文档还提供了已知流量工程样式的分类。在这种情况下，流量工程风格从流量工程方法中抽象出重要方面。交通工程样式可以通过不同的方式查看，这取决于使用它们的特定环境和它们所服务的特定目的。样式和视图的组合形成了交通工程系统的自然分类。"
    },
    {
      "indent": 3,
      "text": "Even though Internet traffic engineering is most effective when applied end-to-end, the initial focus of this document document is intra-domain traffic engineering (that is, traffic engineering within a given autonomous system). However, because a preponderance of Internet traffic tends to be inter-domain (originating in one autonomous system and terminating in another), this document provides an overview of aspects pertaining to inter-domain traffic engineering.",
      "zh-CHS": "尽管互联网流量工程在端到端应用时最为有效，但本文档的最初重点是域内流量工程（即给定自治系统内的流量工程）。然而，由于互联网流量的优势往往是域间的（起源于一个自治系统，终止于另一个自治系统），本文档概述了域间流量工程的相关方面。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不得”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "1.1. What is Internet Traffic Engineering?",
      "section_title": true,
      "zh-CHS": "1.1. 什么是互联网流量工程？"
    },
    {
      "indent": 3,
      "text": "Internet traffic engineering is defined as that aspect of Internet network engineering dealing with the issue of performance evaluation and performance optimization of operational IP networks. Traffic Engineering encompasses the application of technology and scientific principles to the measurement, characterization, modeling, and control of Internet traffic [RFC-2702, AWD2].",
      "zh-CHS": "Internet流量工程是指Internet网络工程中处理运行IP网络的性能评估和性能优化问题的一个方面。流量工程包括将技术和科学原理应用于互联网流量的测量、表征、建模和控制[RFC-2702，AWD2]。"
    },
    {
      "indent": 3,
      "text": "Enhancing the performance of an operational network, at both the traffic and resource levels, are major objectives of Internet traffic engineering. This is accomplished by addressing traffic oriented performance requirements, while utilizing network resources economically and reliably. Traffic oriented performance measures include delay, delay variation, packet loss, and throughput.",
      "zh-CHS": "提高运营网络在流量和资源级别的性能是互联网流量工程的主要目标。这是通过满足面向流量的性能要求来实现的，同时经济可靠地利用网络资源。面向流量的性能度量包括延迟、延迟变化、数据包丢失和吞吐量。"
    },
    {
      "indent": 3,
      "text": "An important objective of Internet traffic engineering is to facilitate reliable network operations [RFC-2702]. Reliable network operations can be facilitated by providing mechanisms that enhance network integrity and by embracing policies emphasizing network survivability. This results in a minimization of the vulnerability of the network to service outages arising from errors, faults, and failures occurring within the infrastructure.",
      "zh-CHS": "互联网流量工程的一个重要目标是促进可靠的网络运行[RFC-2702]。通过提供增强网络完整性的机制和采用强调网络生存性的策略，可以促进可靠的网络操作。这将使网络对基础架构内发生的错误、故障和故障导致的服务中断的脆弱性降至最低。"
    },
    {
      "indent": 3,
      "text": "The Internet exists in order to transfer information from source nodes to destination nodes. Accordingly, one of the most significant functions performed by the Internet is the routing of traffic from ingress nodes to egress nodes. Therefore, one of the most distinctive functions performed by Internet traffic engineering is the control and optimization of the routing function, to steer traffic through the network in the most effective way.",
      "zh-CHS": "互联网的存在是为了将信息从源节点传输到目标节点。因此，因特网执行的最重要的功能之一是从入口节点到出口节点的流量路由。因此，互联网流量工程最独特的功能之一是控制和优化路由功能，以最有效的方式引导网络流量。"
    },
    {
      "indent": 3,
      "text": "Ultimately, it is the performance of the network as seen by end users of network services that is truly paramount. This crucial point should be considered throughout the development of traffic engineering mechanisms and policies. The characteristics visible to end users are the emergent properties of the network, which are the characteristics of the network when viewed as a whole. A central goal of the service provider, therefore, is to enhance the emergent properties of the network while taking economic considerations into account.",
      "zh-CHS": "最终，网络服务的最终用户所看到的网络性能才是真正至关重要的。在制定交通工程机制和政策的过程中，应始终考虑这一关键点。最终用户可见的特性是网络的涌现特性，从整体上看是网络的特性。因此，服务提供商的一个中心目标是在考虑经济因素的同时增强网络的紧急属性。"
    },
    {
      "indent": 3,
      "text": "The importance of the above observation regarding the emergent properties of networks is that special care must be taken when choosing network performance measures to optimize. Optimizing the wrong measures may achieve certain local objectives, but may have",
      "zh-CHS": "上述关于网络紧急特性的观察的重要性在于，在选择网络性能指标进行优化时必须特别小心。优化错误的措施可能会实现某些局部目标，但可能会"
    },
    {
      "indent": 3,
      "text": "disastrous consequences on the emergent properties of the network and thereby on the quality of service perceived by end-users of network services.",
      "zh-CHS": "对网络的紧急属性造成灾难性后果，从而对网络服务的最终用户感知的服务质量造成灾难性后果。"
    },
    {
      "indent": 3,
      "text": "A subtle, but practical advantage of the systematic application of traffic engineering concepts to operational networks is that it helps to identify and structure goals and priorities in terms of enhancing the quality of service delivered to end-users of network services. The application of traffic engineering concepts also aids in the measurement and analysis of the achievement of these goals.",
      "zh-CHS": "将流量工程概念系统地应用于运营网络的一个微妙但实际的优势在于，它有助于确定和构建目标和优先事项，以提高向网络服务最终用户提供的服务质量。交通工程概念的应用也有助于测量和分析这些目标的实现情况。"
    },
    {
      "indent": 3,
      "text": "The optimization aspects of traffic engineering can be achieved through capacity management and traffic management. As used in this document, capacity management includes capacity planning, routing control, and resource management. Network resources of particular interest include link bandwidth, buffer space, and computational resources. Likewise, as used in this document, traffic management includes (1) nodal traffic control functions such as traffic conditioning, queue management, scheduling, and (2) other functions that regulate traffic flow through the network or that arbitrate access to network resources between different packets or between different traffic streams.",
      "zh-CHS": "交通工程的优化方面可以通过容量管理和交通管理来实现。如本文档所述，容量管理包括容量规划、路由控制和资源管理。特别感兴趣的网络资源包括链路带宽、缓冲空间和计算资源。同样，如在本文件中所使用的，流量管理包括（1）节点流量控制功能，例如流量调节、队列管理、调度，以及（2）调节网络流量或仲裁不同分组之间或不同流量流之间对网络资源的访问的其他功能。"
    },
    {
      "indent": 3,
      "text": "The optimization objectives of Internet traffic engineering should be viewed as a continual and iterative process of network performance improvement and not simply as a one time goal. Traffic engineering also demands continual development of new technologies and new methodologies for network performance enhancement.",
      "zh-CHS": "互联网流量工程的优化目标应该被视为网络性能改进的一个持续和迭代的过程，而不仅仅是一个一次性目标。流量工程还要求不断开发新技术和新方法来提高网络性能。"
    },
    {
      "indent": 3,
      "text": "The optimization objectives of Internet traffic engineering may change over time as new requirements are imposed, as new technologies emerge, or as new insights are brought to bear on the underlying problems. Moreover, different networks may have different optimization objectives, depending upon their business models, capabilities, and operating constraints. The optimization aspects of traffic engineering are ultimately concerned with network control regardless of the specific optimization goals in any particular environment.",
      "zh-CHS": "互联网流量工程的优化目标可能会随着时间的推移而改变，因为新的需求被强加，新的技术出现，或者对潜在问题产生了新的见解。此外，不同的网络可能有不同的优化目标，这取决于它们的业务模型、能力和操作约束。流量工程的优化方面最终与网络控制有关，而与任何特定环境中的特定优化目标无关。"
    },
    {
      "indent": 3,
      "text": "Thus, the optimization aspects of traffic engineering can be viewed from a control perspective. The aspect of control within the Internet traffic engineering arena can be pro-active and/or reactive. In the pro-active case, the traffic engineering control system takes preventive action to obviate predicted unfavorable future network states. It may also take perfective action to induce a more desirable state in the future. In the reactive case, the control system responds correctively and perhaps adaptively to events that have already transpired in the network.",
      "zh-CHS": "因此，可以从控制的角度来看交通工程的优化方面。互联网流量工程领域内的控制方面可以是主动的和/或被动的。在主动情况下，交通工程控制系统采取预防措施，以避免预测的不利未来网络状态。它也可能采取完善的行动，以诱导未来更理想的状态。在反应性情况下，控制系统对网络中已经发生的事件做出正确的、可能是自适应的响应。"
    },
    {
      "indent": 3,
      "text": "The control dimension of Internet traffic engineering responds at multiple levels of temporal resolution to network events. Certain aspects of capacity management, such as capacity planning, respond at very coarse temporal levels, ranging from days to possibly years. The introduction of automatically switched optical transport networks (e.g., based on the Multi-protocol Lambda Switching concepts) could significantly reduce the lifecycle for capacity planning by expediting provisioning of optical bandwidth. Routing control functions operate at intermediate levels of temporal resolution, ranging from milliseconds to days. Finally, the packet level processing functions (e.g., rate shaping, queue management, and scheduling) operate at very fine levels of temporal resolution, ranging from picoseconds to milliseconds while responding to the real-time statistical behavior of traffic. The subsystems of Internet traffic engineering control include: capacity augmentation, routing control, traffic control, and resource control (including control of service policies at network elements). When capacity is to be augmented for tactical purposes, it may be desirable to devise a deployment plan that expedites bandwidth provisioning while minimizing installation costs.",
      "zh-CHS": "互联网流量工程的控制维度以多个时间分辨率响应网络事件。容量管理的某些方面，例如容量规划，在非常粗略的时间级别上做出响应，从几天到几年不等。引入自动交换光传输网络（例如，基于多协议Lambda交换概念）可以通过加快光带宽的供应，显著缩短容量规划的生命周期。路由控制功能以中等时间分辨率运行，从毫秒到天不等。最后，数据包级处理功能（例如，速率整形、队列管理和调度）以非常精细的时间分辨率运行，时间分辨率从皮秒到毫秒不等，同时响应流量的实时统计行为。Internet流量工程控制的子系统包括：容量扩充、路由控制、流量控制和资源控制（包括网元上的服务策略控制）。当出于战术目的增加容量时，可能需要设计一个部署计划，以加快带宽供应，同时最小化安装成本。"
    },
    {
      "indent": 3,
      "text": "Inputs into the traffic engineering control system include network state variables, policy variables, and decision variables.",
      "zh-CHS": "交通工程控制系统的输入包括网络状态变量、策略变量和决策变量。"
    },
    {
      "indent": 3,
      "text": "One major challenge of Internet traffic engineering is the realization of automated control capabilities that adapt quickly and cost effectively to significant changes in a network's state, while still maintaining stability.",
      "zh-CHS": "互联网流量工程的一个主要挑战是实现自动控制能力，该能力能够快速且经济高效地适应网络状态的重大变化，同时保持稳定性。"
    },
    {
      "indent": 3,
      "text": "Another critical dimension of Internet traffic engineering is network performance evaluation, which is important for assessing the effectiveness of traffic engineering methods, and for monitoring and verifying compliance with network performance goals. Results from performance evaluation can be used to identify existing problems, guide network re-optimization, and aid in the prediction of potential future problems.",
      "zh-CHS": "互联网流量工程的另一个关键维度是网络性能评估，这对于评估流量工程方法的有效性以及监控和验证是否符合网络性能目标非常重要。性能评估的结果可用于识别存在的问题，指导网络重新优化，并有助于预测潜在的未来问题。"
    },
    {
      "indent": 3,
      "text": "Performance evaluation can be achieved in many different ways. The most notable techniques include analytical methods, simulation, and empirical methods based on measurements. When analytical methods or simulation are used, network nodes and links can be modeled to capture relevant operational features such as topology, bandwidth, buffer space, and nodal service policies (link scheduling, packet prioritization, buffer management, etc.). Analytical traffic models can be used to depict dynamic and behavioral traffic characteristics, such as burstiness, statistical distributions, and dependence.",
      "zh-CHS": "绩效评估可以通过许多不同的方式实现。最著名的技术包括分析方法、模拟和基于测量的经验方法。当使用分析方法或模拟时，可以对网络节点和链路进行建模，以捕获相关的操作特征，例如拓扑、带宽、缓冲区空间和节点服务策略（链路调度、数据包优先级、缓冲区管理等）。分析流量模型可用于描述动态和行为流量特性，如突发性、统计分布和相关性。"
    },
    {
      "indent": 3,
      "text": "Performance evaluation can be quite complicated in practical network contexts. A number of techniques can be used to simplify the analysis, such as abstraction, decomposition, and approximation. For example, simplifying concepts such as effective bandwidth and effective buffer [Elwalid] may be used to approximate nodal behaviors at the packet level and simplify the analysis at the connection level. Network analysis techniques using, for example, queuing models and approximation schemes based on asymptotic and decomposition techniques can render the analysis even more tractable. In particular, an emerging set of concepts known as network calculus [CRUZ] based on deterministic bounds may simplify network analysis relative to classical stochastic techniques. When using analytical techniques, care should be taken to ensure that the models faithfully reflect the relevant operational characteristics of the modeled network entities.",
      "zh-CHS": "在实际网络环境中，性能评估可能相当复杂。可以使用许多技术来简化分析，例如抽象、分解和近似。例如，可以使用诸如有效带宽和有效缓冲器[Elwalid]之类的简化概念来近似分组级的节点行为，并简化连接级的分析。例如，使用排队模型和基于渐近和分解技术的近似方案的网络分析技术可以使分析更加容易处理。特别是，一组基于确定性边界的新兴概念称为网络演算[CRUZ]，可以相对于经典随机技术简化网络分析。使用分析技术时，应注意确保模型真实反映建模网络实体的相关操作特征。"
    },
    {
      "indent": 3,
      "text": "Simulation can be used to evaluate network performance or to verify and validate analytical approximations. Simulation can, however, be computationally costly and may not always provide sufficient insights. An appropriate approach to a given network performance evaluation problem may involve a hybrid combination of analytical techniques, simulation, and empirical methods.",
      "zh-CHS": "仿真可用于评估网络性能或验证和验证分析近似值。然而，模拟的计算成本很高，并且可能无法提供足够的洞察力。针对给定网络性能评估问题的适当方法可能涉及分析技术、模拟和经验方法的混合组合。"
    },
    {
      "indent": 3,
      "text": "As a general rule, traffic engineering concepts and mechanisms must be sufficiently specific and well defined to address known requirements, but simultaneously flexible and extensible to accommodate unforeseen future demands.",
      "zh-CHS": "作为一般规则，交通工程概念和机制必须足够具体和明确，以满足已知需求，但同时具有灵活性和可扩展性，以适应不可预见的未来需求。"
    },
    {
      "indent": 0,
      "text": "1.2. Scope",
      "section_title": true,
      "zh-CHS": "1.2. 范围"
    },
    {
      "indent": 3,
      "text": "The scope of this document is intra-domain traffic engineering; that is, traffic engineering within a given autonomous system in the Internet. This document will discuss concepts pertaining to intra-domain traffic control, including such issues as routing control, micro and macro resource allocation, and the control coordination problems that arise consequently.",
      "zh-CHS": "本文档的范围是域内流量工程；也就是说，互联网中给定自治系统内的流量工程。本文档将讨论与域内流量控制相关的概念，包括路由控制、微观和宏观资源分配等问题，以及由此产生的控制协调问题。"
    },
    {
      "indent": 3,
      "text": "This document will describe and characterize techniques already in use or in advanced development for Internet traffic engineering. The way these techniques fit together will be discussed and scenarios in which they are useful will be identified.",
      "zh-CHS": "本文件将描述和描述互联网流量工程中已经使用或正在高级开发的技术。将讨论这些技术的组合方式，并确定它们有用的场景。"
    },
    {
      "indent": 3,
      "text": "While this document considers various intra-domain traffic engineering approaches, it focuses more on traffic engineering with MPLS. Traffic engineering based upon manipulation of IGP metrics is not addressed in detail. This topic may be addressed by other working group document(s).",
      "zh-CHS": "虽然本文档考虑了各种域内流量工程方法，但它更侧重于使用MPLS的流量工程。基于IGP度量操作的流量工程没有详细讨论。本专题可由其他工作组文件处理。"
    },
    {
      "indent": 3,
      "text": "Although the emphasis is on intra-domain traffic engineering, in Section 7.0, an overview of the high level considerations pertaining to inter-domain traffic engineering will be provided. Inter-domain Internet traffic engineering is crucial to the performance enhancement of the global Internet infrastructure.",
      "zh-CHS": "虽然重点是域内流量工程，但在第7.0节中，将概述与域间流量工程相关的高级注意事项。域间互联网流量工程对于提高全球互联网基础设施的性能至关重要。"
    },
    {
      "indent": 3,
      "text": "Whenever possible, relevant requirements from existing IETF documents and other sources will be incorporated by reference.",
      "zh-CHS": "只要有可能，将引用现有IETF文件和其他来源的相关要求。"
    },
    {
      "indent": 0,
      "text": "1.3 Terminology",
      "section_title": true,
      "zh-CHS": "1.3 术语"
    },
    {
      "indent": 3,
      "text": "This subsection provides terminology which is useful for Internet traffic engineering. The definitions presented apply to this document. These terms may have other meanings elsewhere.",
      "zh-CHS": "本小节提供了对Internet流量工程有用的术语。所给出的定义适用于本文件。这些术语在其他地方可能有其他含义。"
    },
    {
      "indent": 6,
      "text": "- Baseline analysis: A study conducted to serve as a baseline for comparison to the actual behavior of the network.",
      "zh-CHS": "- 基线分析：作为与网络实际行为进行比较的基线进行的研究。"
    },
    {
      "indent": 6,
      "text": "- Busy hour: A one hour period within a specified interval of time (typically 24 hours) in which the traffic load in a network or sub-network is greatest.",
      "zh-CHS": "- 繁忙时间：在指定的时间间隔（通常为24小时）内，网络或子网络中的流量负载最大的一个小时周期。"
    },
    {
      "indent": 6,
      "text": "- Bottleneck: A network element whose input traffic rate tends to be greater than its output rate.",
      "zh-CHS": "- 瓶颈：其输入流量率往往大于其输出流量率的网元。"
    },
    {
      "indent": 6,
      "text": "- Congestion: A state of a network resource in which the traffic incident on the resource exceeds its output capacity over an interval of time.",
      "zh-CHS": "- 拥塞：网络资源的一种状态，在此状态下，资源上发生的流量在一段时间间隔内超过其输出容量。"
    },
    {
      "indent": 6,
      "text": "- Congestion avoidance: An approach to congestion management that attempts to obviate the occurrence of congestion.",
      "zh-CHS": "- 拥塞避免：一种试图避免拥塞发生的拥塞管理方法。"
    },
    {
      "indent": 6,
      "text": "- Congestion control: An approach to congestion management that attempts to remedy congestion problems that have already occurred.",
      "zh-CHS": "- 拥塞控制：一种试图补救已经发生的拥塞问题的拥塞管理方法。"
    },
    {
      "indent": 6,
      "text": "- Constraint-based routing: A class of routing protocols that take specified traffic attributes, network constraints, and policy constraints into account when making routing decisions. Constraint-based routing is applicable to traffic aggregates as well as flows. It is a generalization of QoS routing.",
      "zh-CHS": "- 基于约束的路由：一类路由协议，在做出路由决策时考虑指定的流量属性、网络约束和策略约束。基于约束的路由适用于流量聚合和流量。它是QoS路由的推广。"
    },
    {
      "indent": 6,
      "text": "- Demand side congestion management: A congestion management scheme that addresses congestion problems by regulating or conditioning offered load.",
      "zh-CHS": "- 需求侧拥塞管理：一种通过调节或调节提供的负载来解决拥塞问题的拥塞管理方案。"
    },
    {
      "indent": 6,
      "text": "- Effective bandwidth: The minimum amount of bandwidth that can be assigned to a flow or traffic aggregate in order to deliver 'acceptable service quality' to the flow or traffic aggregate.",
      "zh-CHS": "- 有效带宽：为向流或流量聚合提供“可接受的服务质量”，可分配给流或流量聚合的最小带宽量。"
    },
    {
      "indent": 6,
      "text": "- Egress traffic: Traffic exiting a network or network element.",
      "zh-CHS": "- 出口流量：退出网络或网元的流量。"
    },
    {
      "indent": 6,
      "text": "- Hot-spot: A network element or subsystem which is in a state of congestion.",
      "zh-CHS": "- 热点：处于拥塞状态的网元或子系统。"
    },
    {
      "indent": 6,
      "text": "- Ingress traffic: Traffic entering a network or network element.",
      "zh-CHS": "- 入口流量：进入网络或网元的流量。"
    },
    {
      "indent": 6,
      "text": "- Inter-domain traffic: Traffic that originates in one Autonomous system and terminates in another.",
      "zh-CHS": "- 域间通信：起源于一个自治系统并终止于另一个自治系统的通信。"
    },
    {
      "indent": 6,
      "text": "- Loss network: A network that does not provide adequate buffering for traffic, so that traffic entering a busy resource within the network will be dropped rather than queued.",
      "zh-CHS": "- 丢失网络：没有为流量提供足够缓冲的网络，因此进入网络中繁忙资源的流量将被丢弃而不是排队。"
    },
    {
      "indent": 6,
      "text": "- Metric: A parameter defined in terms of standard units of measurement.",
      "zh-CHS": "- 公制：以标准计量单位定义的参数。"
    },
    {
      "indent": 6,
      "text": "- Measurement Methodology: A repeatable measurement technique used to derive one or more metrics of interest.",
      "zh-CHS": "- 测量方法：一种可重复的测量技术，用于导出一个或多个感兴趣的指标。"
    },
    {
      "indent": 6,
      "text": "- Network Survivability: The capability to provide a prescribed level of QoS for existing services after a given number of failures occur within the network.",
      "zh-CHS": "- 网络生存能力：在网络中发生一定数量的故障后，为现有服务提供规定级别的QoS的能力。"
    },
    {
      "indent": 6,
      "text": "- Offline traffic engineering: A traffic engineering system that exists outside of the network.",
      "zh-CHS": "- 离线流量工程：存在于网络之外的流量工程系统。"
    },
    {
      "indent": 6,
      "text": "- Online traffic engineering: A traffic engineering system that exists within the network, typically implemented on or as adjuncts to operational network elements.",
      "zh-CHS": "- 在线流量工程（Online traffic engineering）：存在于网络中的流量工程系统，通常在运行网络元件上或作为其附件实施。"
    },
    {
      "indent": 6,
      "text": "- Performance measures: Metrics that provide quantitative or qualitative measures of the performance of systems or subsystems of interest.",
      "zh-CHS": "- 性能度量：提供感兴趣的系统或子系统性能的定量或定性度量的度量。"
    },
    {
      "indent": 6,
      "text": "- Performance management: A systematic approach to improving effectiveness in the accomplishment of specific networking goals related to performance improvement.",
      "zh-CHS": "- 绩效管理：在实现与绩效改进相关的特定网络目标方面提高效率的系统方法。"
    },
    {
      "indent": 6,
      "text": "- Performance Metric: A performance parameter defined in terms of standard units of measurement.",
      "zh-CHS": "- 性能指标：以标准计量单位定义的性能参数。"
    },
    {
      "indent": 6,
      "text": "- Provisioning: The process of assigning or configuring network resources to meet certain requests.",
      "zh-CHS": "- 资源调配：分配或配置网络资源以满足特定请求的过程。"
    },
    {
      "indent": 6,
      "text": "- QoS routing: Class of routing systems that selects paths to be used by a flow based on the QoS requirements of the flow.",
      "zh-CHS": "- QoS路由：一类路由系统，它根据流的QoS要求选择流要使用的路径。"
    },
    {
      "indent": 6,
      "text": "- Service Level Agreement: A contract between a provider and a customer that guarantees specific levels of performance and reliability at a certain cost.",
      "zh-CHS": "- 服务水平协议：供应商和客户之间的合同，以一定成本保证特定水平的性能和可靠性。"
    },
    {
      "indent": 6,
      "text": "- Stability: An operational state in which a network does not oscillate in a disruptive manner from one mode to another mode.",
      "zh-CHS": "- 稳定性：网络不会以中断方式从一种模式振荡到另一种模式的运行状态。"
    },
    {
      "indent": 6,
      "text": "- Supply side congestion management: A congestion management scheme that provisions additional network resources to address existing and/or anticipated congestion problems.",
      "zh-CHS": "- 供给侧拥塞管理：一种拥塞管理方案，提供额外的网络资源以解决现有和/或预期的拥塞问题。"
    },
    {
      "indent": 6,
      "text": "- Transit traffic: Traffic whose origin and destination are both outside of the network under consideration.",
      "zh-CHS": "- 过境交通：其起点和终点都在考虑中的网络之外的交通。"
    },
    {
      "indent": 6,
      "text": "- Traffic characteristic: A description of the temporal behavior or a description of the attributes of a given traffic flow or traffic aggregate.",
      "zh-CHS": "- 交通特征：对给定交通流或交通总量的时间行为或属性的描述。"
    },
    {
      "indent": 6,
      "text": "- Traffic engineering system: A collection of objects, mechanisms, and protocols that are used conjunctively to accomplish traffic engineering objectives.",
      "zh-CHS": "- 流量工程系统：用于实现流量工程目标的对象、机制和协议的集合。"
    },
    {
      "indent": 6,
      "text": "- Traffic flow: A stream of packets between two end-points that can be characterized in a certain way. A micro-flow has a more specific definition: A micro-flow is a stream of packets with the same source and destination addresses, source and destination ports, and protocol ID.",
      "zh-CHS": "- 交通流：两个端点之间的数据包流，可以用某种方式描述。微流有一个更具体的定义：微流是具有相同源和目标地址、源和目标端口以及协议ID的数据包流。"
    },
    {
      "indent": 6,
      "text": "- Traffic intensity: A measure of traffic loading with respect to a resource capacity over a specified period of time. In classical telephony systems, traffic intensity is measured in units of Erlang.",
      "zh-CHS": "- 交通强度：在指定时间段内，与资源容量相关的交通负荷度量。在传统的电话系统中，业务强度是以Erlang为单位测量的。"
    },
    {
      "indent": 6,
      "text": "- Traffic matrix: A representation of the traffic demand between a set of origin and destination abstract nodes. An abstract node can consist of one or more network elements.",
      "zh-CHS": "- 交通矩阵：一组起点和终点抽象节点之间交通需求的表示。抽象节点可以由一个或多个网络元素组成。"
    },
    {
      "indent": 6,
      "text": "- Traffic monitoring: The process of observing traffic characteristics at a given point in a network and collecting the traffic information for analysis and further action.",
      "zh-CHS": "- 流量监测：观察网络中某一点的流量特征，并收集流量信息以进行分析和采取进一步行动的过程。"
    },
    {
      "indent": 6,
      "text": "- Traffic trunk: An aggregation of traffic flows belonging to the same class which are forwarded through a common path. A traffic trunk may be characterized by an ingress and egress node, and a set of attributes which determine its behavioral characteristics and requirements from the network.",
      "zh-CHS": "- 交通干线：通过公共路径转发的属于同一类别的交通流的集合。业务干线的特征可以是入口和出口节点，以及确定其行为特征和来自网络的需求的一组属性。"
    },
    {
      "indent": 0,
      "text": "2.0 Background",
      "section_title": true,
      "zh-CHS": "2.0 出身背景"
    },
    {
      "indent": 3,
      "text": "The Internet has quickly evolved into a very critical communications infrastructure, supporting significant economic, educational, and social activities. Simultaneously, the delivery of Internet communications services has become very competitive and end-users are demanding very high quality service from their service providers. Consequently, performance optimization of large scale IP networks, especially public Internet backbones, have become an important problem. Network performance requirements are multi-dimensional, complex, and sometimes contradictory; making the traffic engineering problem very challenging.",
      "zh-CHS": "互联网已经迅速发展成为一个非常重要的通信基础设施，支持重要的经济、教育和社会活动。同时，互联网通信服务的提供变得非常有竞争力，最终用户要求其服务提供商提供非常高质量的服务。因此，大规模IP网络，特别是公共互联网主干网的性能优化已成为一个重要问题。网络性能要求是多维的、复杂的，有时甚至是矛盾的；使交通工程问题非常具有挑战性。"
    },
    {
      "indent": 3,
      "text": "The network must convey IP packets from ingress nodes to egress nodes efficiently, expeditiously, and economically. Furthermore, in a multiclass service environment (e.g., Diffserv capable networks), the resource sharing parameters of the network must be appropriately determined and configured according to prevailing policies and service models to resolve resource contention issues arising from mutual interference between packets traversing through the network. Thus, consideration must be given to resolving competition for network resources between traffic streams belonging to the same service class (intra-class contention resolution) and traffic streams belonging to different classes (inter-class contention resolution).",
      "zh-CHS": "网络必须高效、快速且经济地将IP数据包从入口节点传送到出口节点。此外，在多类服务环境中（例如，支持区分服务的网络），网络的资源共享参数必须根据流行的策略和服务模型进行适当的确定和配置，以解决由于通过网络的数据包之间的相互干扰而引起的资源争用问题。因此，必须考虑解决属于相同服务类别的业务流（类内争用解决方案）和属于不同类别的业务流（类间争用解决方案）之间的网络资源竞争。"
    },
    {
      "indent": 0,
      "text": "2.1 Context of Internet Traffic Engineering",
      "section_title": true,
      "zh-CHS": "2.1 Internet流量工程背景"
    },
    {
      "indent": 3,
      "text": "The context of Internet traffic engineering pertains to the scenarios where traffic engineering is used. A traffic engineering methodology establishes appropriate rules to resolve traffic performance issues occurring in a specific context. The context of Internet traffic engineering includes:",
      "zh-CHS": "Internet流量工程的上下文与使用流量工程的场景相关。交通工程方法建立适当的规则，以解决特定环境中出现的交通性能问题。互联网流量工程的背景包括："
    },
    {
      "indent": 6,
      "text": "(1) A network context defining the universe of discourse, and in particular the situations in which the traffic engineering problems occur. The network context includes network structure, network policies, network characteristics, network constraints, network quality attributes, and network optimization criteria.",
      "zh-CHS": "(1) 网络环境定义了话语的范围，尤其是交通工程问题发生的情况。网络环境包括网络结构、网络策略、网络特征、网络约束、网络质量属性和网络优化标准。"
    },
    {
      "indent": 6,
      "text": "(2) A problem context defining the general and concrete issues that traffic engineering addresses. The problem context includes identification, abstraction of relevant features, representation, formulation, specification of the requirements on the solution space, and specification of the desirable features of acceptable solutions.",
      "zh-CHS": "(2) 一个问题上下文，定义了流量工程解决的一般和具体问题。问题背景包括识别、相关特征的抽象、表示、表述、解决方案空间需求的规范以及可接受解决方案的期望特征的规范。"
    },
    {
      "indent": 6,
      "text": "(3) A solution context suggesting how to address the issues identified by the problem context. The solution context includes analysis, evaluation of alternatives, prescription, and resolution.",
      "zh-CHS": "(3) 建议如何解决问题上下文确定的问题的解决方案上下文。解决方案上下文包括分析、备选方案评估、处方和解决方案。"
    },
    {
      "indent": 6,
      "text": "(4) An implementation and operational context in which the solutions are methodologically instantiated. The implementation and operational context includes planning, organization, and execution.",
      "zh-CHS": "(4) 一种实现和操作环境，在这种环境中，解决方案被方法化地实例化。实施和操作环境包括规划、组织和执行。"
    },
    {
      "indent": 3,
      "text": "The context of Internet traffic engineering and the different problem scenarios are discussed in the following subsections.",
      "zh-CHS": "互联网流量工程的背景和不同的问题场景将在以下小节中讨论。"
    },
    {
      "indent": 0,
      "text": "2.2 Network Context",
      "section_title": true,
      "zh-CHS": "2.2 网络上下文"
    },
    {
      "indent": 3,
      "text": "IP networks range in size from small clusters of routers situated within a given location, to thousands of interconnected routers, switches, and other components distributed all over the world.",
      "zh-CHS": "IP网络的规模从位于给定位置的小型路由器集群到分布在世界各地的数千个互连路由器、交换机和其他组件。"
    },
    {
      "indent": 3,
      "text": "Conceptually, at the most basic level of abstraction, an IP network can be represented as a distributed dynamical system consisting of: (1) a set of interconnected resources which provide transport services for IP traffic subject to certain constraints, (2) a demand system representing the offered load to be transported through the network, and (3) a response system consisting of network processes, protocols, and related mechanisms which facilitate the movement of traffic through the network [see also AWD2].",
      "zh-CHS": "从概念上讲，在最基本的抽象层次上，IP网络可以表示为一个分布式动态系统，由以下部分组成：（1）一组相互连接的资源，这些资源在一定的约束条件下为IP流量提供传输服务，（2）一个表示通过网络传输的所提供负载的需求系统，以及（3）一种由网络进程、协议和相关机制组成的响应系统，可促进网络中的流量移动[另见AWD2]。"
    },
    {
      "indent": 3,
      "text": "The network elements and resources may have specific characteristics restricting the manner in which the demand is handled. Additionally, network resources may be equipped with traffic control mechanisms superintending the way in which the demand is serviced. Traffic control mechanisms may, for example, be used to control various packet processing activities within a given resource, arbitrate contention for access to the resource by different packets, and regulate traffic behavior through the resource. A configuration management and provisioning system may allow the settings of the traffic control mechanisms to be manipulated by external or internal entities in order to exercise control over the way in which the network elements respond to internal and external stimuli.",
      "zh-CHS": "网络元件和资源可以具有限制处理需求的方式的特定特征。此外，网络资源可以配备流量控制机制，以监督服务需求的方式。例如，业务控制机制可用于控制给定资源内的各种分组处理活动，仲裁不同分组访问资源的争用，并通过资源调节业务行为。配置管理和供应系统可允许由外部或内部实体操纵业务控制机制的设置，以便对网络元件响应内部和外部刺激的方式进行控制。"
    },
    {
      "indent": 3,
      "text": "The details of how the network provides transport services for packets are specified in the policies of the network administrators and are installed through network configuration management and policy based provisioning systems. Generally, the types of services provided by the network also depends upon the technology and characteristics of the network elements and protocols, the prevailing service and utility models, and the ability of the network administrators to translate policies into network configurations.",
      "zh-CHS": "网络如何为数据包提供传输服务的详细信息在网络管理员的策略中指定，并通过网络配置管理和基于策略的供应系统安装。通常，网络提供的服务类型还取决于网络元件和协议的技术和特征、主流服务和实用新型，以及网络管理员将策略转换为网络配置的能力。"
    },
    {
      "indent": 3,
      "text": "Contemporary Internet networks have three significant characteristics: (1) they provide real-time services, (2) they have become mission critical, and (3) their operating environments are very dynamic. The dynamic characteristics of IP networks can be attributed in part to fluctuations in demand, to the interaction between various network protocols and processes, to the rapid evolution of the infrastructure which demands the constant inclusion of new technologies and new network elements, and to transient and persistent impairments which occur within the system.",
      "zh-CHS": "当代互联网网络有三个显著特征：（1）它们提供实时服务，（2）它们已成为关键任务，（3）它们的运行环境非常动态。IP网络的动态特性可部分归因于需求的波动、各种网络协议和流程之间的交互作用、基础设施的快速发展，这些都要求不断纳入新技术和新网络元素，以及系统内发生的暂时性和持续性损伤。"
    },
    {
      "indent": 3,
      "text": "Packets contend for the use of network resources as they are conveyed through the network. A network resource is considered to be congested if the arrival rate of packets exceed the output capacity of the resource over an interval of time. Congestion may result in some of the arrival packets being delayed or even dropped.",
      "zh-CHS": "当数据包通过网络传输时，它们会争夺网络资源的使用权。如果在一段时间间隔内，数据包的到达率超过资源的输出容量，则认为网络资源拥挤。拥塞可能导致一些到达数据包被延迟甚至丢弃。"
    },
    {
      "indent": 3,
      "text": "Congestion increases transit delays, delay variation, packet loss, and reduces the predictability of network services. Clearly, congestion is a highly undesirable phenomenon.",
      "zh-CHS": "拥塞会增加传输延迟、延迟变化、数据包丢失，并降低网络服务的可预测性。显然，拥挤是一种非常不受欢迎的现象。"
    },
    {
      "indent": 3,
      "text": "Combating congestion at a reasonable cost is a major objective of Internet traffic engineering.",
      "zh-CHS": "以合理的成本对抗拥塞是互联网流量工程的主要目标。"
    },
    {
      "indent": 3,
      "text": "Efficient sharing of network resources by multiple traffic streams is a basic economic premise for packet switched networks in general and for the Internet in particular. A fundamental challenge in network operation, especially in a large scale public IP network, is to increase the efficiency of resource utilization while minimizing the possibility of congestion.",
      "zh-CHS": "通过多个业务流高效地共享网络资源是分组交换网络（尤其是互联网）的基本经济前提。网络运营的一个基本挑战，尤其是在大规模公共IP网络中，是提高资源利用效率，同时最小化拥塞的可能性。"
    },
    {
      "indent": 3,
      "text": "Increasingly, the Internet will have to function in the presence of different classes of traffic with different service requirements. The advent of Differentiated Services [RFC-2475] makes this requirement particularly acute. Thus, packets may be grouped into behavior aggregates such that each behavior aggregate may have a common set of behavioral characteristics or a common set of delivery requirements. In practice, the delivery requirements of a specific set of packets may be specified explicitly or implicitly. Two of the most important traffic delivery requirements are capacity constraints and QoS constraints.",
      "zh-CHS": "互联网将越来越多地在不同服务需求的不同流量类别中运行。差异化服务[RFC-2475]的出现使得这一要求特别尖锐。因此，可以将包分组到行为集合中，使得每个行为集合可以具有一组共同的行为特征或一组共同的传递需求。在实践中，可以显式或隐式地指定特定分组集合的递送要求。两个最重要的流量交付需求是容量约束和QoS约束。"
    },
    {
      "indent": 3,
      "text": "Capacity constraints can be expressed statistically as peak rates, mean rates, burst sizes, or as some deterministic notion of effective bandwidth. QoS requirements can be expressed in terms of (1) integrity constraints such as packet loss and (2) in terms of temporal constraints such as timing restrictions for the delivery of each packet (delay) and timing restrictions for the delivery of consecutive packets belonging to the same traffic stream (delay variation).",
      "zh-CHS": "容量限制可以统计地表示为峰值速率、平均速率、突发大小，或者表示为有效带宽的某些确定性概念。QoS要求可以表示为（1）完整性约束（如分组丢失）和（2）时间约束（如每个分组的交付的定时约束（延迟）和属于相同业务流的连续分组的交付的定时约束（延迟变化）。"
    },
    {
      "indent": 0,
      "text": "2.3 Problem Context",
      "section_title": true,
      "zh-CHS": "2.3 问题背景"
    },
    {
      "indent": 3,
      "text": "Fundamental problems exist in association with the operation of a network described by the simple model of the previous subsection. This subsection reviews the problem context in relation to the traffic engineering function.",
      "zh-CHS": "与上一小节的简单模型描述的网络运行相关的基本问题。本小节回顾了与交通工程功能相关的问题背景。"
    },
    {
      "indent": 3,
      "text": "The identification, abstraction, representation, and measurement of network features relevant to traffic engineering is a significant issue.",
      "zh-CHS": "与流量工程相关的网络特征的识别、抽象、表示和测量是一个重要的问题。"
    },
    {
      "indent": 3,
      "text": "One particularly important class of problems concerns how to explicitly formulate the problems that traffic engineering attempts to solve, how to identify the requirements on the solution space, how to specify the desirable features of good solutions, how to actually solve the problems, and how to measure and characterize the effectiveness of the solutions.",
      "zh-CHS": "一类特别重要的问题涉及如何明确表述交通工程试图解决的问题，如何确定解决方案空间的要求，如何指定好的解决方案的可取特征，如何实际解决问题，以及如何衡量和描述解决方案的有效性。"
    },
    {
      "indent": 3,
      "text": "Another class of problems concerns how to measure and estimate relevant network state parameters. Effective traffic engineering relies on a good estimate of the offered traffic load as well as a view of the underlying topology and associated resource constraints. A network-wide view of the topology is also a must for offline planning.",
      "zh-CHS": "另一类问题涉及如何测量和估计相关的网络状态参数。有效的流量工程依赖于对提供的流量负载的良好估计以及对底层拓扑和相关资源约束的视图。网络范围内的拓扑视图也是离线规划所必需的。"
    },
    {
      "indent": 3,
      "text": "Still another class of problems concerns how to characterize the state of the network and how to evaluate its performance under a variety of scenarios. The performance evaluation problem is two-fold. One aspect of this problem relates to the evaluation of the system level performance of the network. The other aspect relates to the evaluation of the resource level performance, which restricts attention to the performance analysis of individual network resources. In this memo, we refer to the system level characteristics of the network as the \"macro-states\" and the resource level characteristics as the \"micro-states.\" The system level characteristics are also known as the emergent properties of the network as noted earlier. Correspondingly, we shall refer to the traffic engineering schemes dealing with network performance optimization at the systems level as \"macro-TE\" and the schemes that optimize at the individual resource level as \"micro-TE.\" Under certain circumstances, the system level performance can be derived from the resource level performance using appropriate rules of composition, depending upon the particular performance measures of interest.",
      "zh-CHS": "还有一类问题涉及如何描述网络的状态以及如何在各种场景下评估其性能。绩效评估问题是双重的。该问题的一个方面涉及对网络的系统级性能的评估。另一个方面涉及资源级性能的评估，这限制了对单个网络资源的性能分析的关注。在本备忘录中，我们将网络的系统级特征称为“宏观状态”，将资源级特征称为“微观状态”。如前所述，系统级特征也称为网络的紧急属性。相应地，我们将在系统级处理网络性能优化的流量工程方案称为“宏TE”，在单个资源级优化的方案称为“微TE”，系统级性能可以使用适当的组合规则从资源级性能派生，具体取决于感兴趣的特定性能度量。"
    },
    {
      "indent": 3,
      "text": "Another fundamental class of problems concerns how to effectively optimize network performance. Performance optimization may entail translating solutions to specific traffic engineering problems into network configurations. Optimization may also entail some degree of resource management control, routing control, and/or capacity augmentation.",
      "zh-CHS": "另一类基本问题涉及如何有效优化网络性能。性能优化可能需要将特定流量工程问题的解决方案转换为网络配置。优化还可能需要某种程度的资源管理控制、路由控制和/或容量扩充。"
    },
    {
      "indent": 3,
      "text": "As noted previously, congestion is an undesirable phenomena in operational networks. Therefore, the next subsection addresses the issue of congestion and its ramifications within the problem context of Internet traffic engineering.",
      "zh-CHS": "如前所述，拥塞是运营网络中的一种不良现象。因此，下一小节将在互联网流量工程的问题背景下讨论拥塞问题及其影响。"
    },
    {
      "indent": 0,
      "text": "2.3.1 Congestion and its Ramifications",
      "section_title": true,
      "zh-CHS": "2.3.1 拥挤及其后果"
    },
    {
      "indent": 3,
      "text": "Congestion is one of the most significant problems in an operational IP context. A network element is said to be congested if it experiences sustained overload over an interval of time. Congestion almost always results in degradation of service quality to end users. Congestion control schemes can include demand side policies and supply side policies. Demand side policies may restrict access to congested resources and/or dynamically regulate the demand to alleviate the overload situation. Supply side policies may expand or augment network capacity to better accommodate offered traffic. Supply side policies may also re-allocate network resources by redistributing traffic over the infrastructure. Traffic redistribution and resource re-allocation serve to increase the 'effective capacity' seen by the demand.",
      "zh-CHS": "拥塞是运营IP环境中最重要的问题之一。如果网元在一段时间内持续过载，则称其为拥塞。拥塞几乎总是导致最终用户的服务质量下降。拥塞控制方案可以包括需求侧策略和供给侧策略。需求方政策可能会限制对拥挤资源的访问和/或动态调节需求，以缓解过载情况。供应方政策可能会扩大或增加网络容量，以更好地适应提供的流量。供应方策略还可以通过在基础设施上重新分配流量来重新分配网络资源。交通再分配和资源重新分配有助于增加需求所看到的“有效容量”。"
    },
    {
      "indent": 3,
      "text": "The emphasis of this memo is primarily on congestion management schemes falling within the scope of the network, rather than on congestion management systems dependent upon sensitivity and adaptivity from end-systems. That is, the aspects that are considered in this memo with respect to congestion management are those solutions that can be provided by control entities operating on the network and by the actions of network administrators and network operations systems.",
      "zh-CHS": "本备忘录的重点主要是网络范围内的拥塞管理方案，而不是依赖于终端系统的灵敏度和适应性的拥塞管理系统。也就是说，本备忘录中考虑的与拥塞管理相关的方面是可以由网络上运行的控制实体以及网络管理员和网络操作系统提供的解决方案。"
    },
    {
      "indent": 0,
      "text": "2.4 Solution Context",
      "section_title": true,
      "zh-CHS": "2.4 解决方案上下文"
    },
    {
      "indent": 3,
      "text": "The solution context for Internet traffic engineering involves analysis, evaluation of alternatives, and choice between alternative courses of action. Generally the solution context is predicated on making reasonable inferences about the current or future state of the network, and subsequently making appropriate decisions that may involve a preference between alternative sets of action. More specifically, the solution context demands reasonable estimates of traffic workload, characterization of network state, deriving solutions to traffic engineering problems which may be implicitly or explicitly formulated, and possibly instantiating a set of control actions. Control actions may involve the manipulation of parameters associated with routing, control over tactical capacity acquisition, and control over the traffic management functions.",
      "zh-CHS": "互联网流量工程的解决方案环境包括分析、评估备选方案以及在备选行动方案之间进行选择。通常，解决方案上下文是基于对网络的当前或未来状态做出合理推断，然后做出可能涉及备选行动集之间偏好的适当决策。更具体地说，解决方案上下文要求对流量工作负载进行合理的估计，描述网络状态，导出流量工程问题的解决方案，这些解决方案可以隐式或显式地表述，并且可能实例化一组控制动作。控制行动可能涉及操纵与路由相关的参数、控制战术能力获取以及控制交通管理功能。"
    },
    {
      "indent": 3,
      "text": "The following list of instruments may be applicable to the solution context of Internet traffic engineering.",
      "zh-CHS": "以下仪器列表可能适用于互联网流量工程的解决方案环境。"
    },
    {
      "indent": 6,
      "text": "(1) A set of policies, objectives, and requirements (which may be context dependent) for network performance evaluation and performance optimization.",
      "zh-CHS": "(1) 用于网络性能评估和性能优化的一组策略、目标和要求（可能取决于上下文）。"
    },
    {
      "indent": 6,
      "text": "(2) A collection of online and possibly offline tools and mechanisms for measurement, characterization, modeling, and control of Internet traffic and control over the placement and allocation of network resources, as well as control over the mapping or distribution of traffic onto the infrastructure.",
      "zh-CHS": "(2) 一组在线和可能离线的工具和机制，用于测量、表征、建模和控制互联网流量，控制网络资源的放置和分配，以及控制基础设施上流量的映射或分布。"
    },
    {
      "indent": 6,
      "text": "(3) A set of constraints on the operating environment, the network protocols, and the traffic engineering system itself.",
      "zh-CHS": "(3) 对操作环境、网络协议和流量工程系统本身的一组约束。"
    },
    {
      "indent": 6,
      "text": "(4) A set of quantitative and qualitative techniques and methodologies for abstracting, formulating, and solving traffic engineering problems.",
      "zh-CHS": "(4) 一套定量和定性的技术和方法，用于抽象、制定和解决交通工程问题。"
    },
    {
      "indent": 6,
      "text": "(5) A set of administrative control parameters which may be manipulated through a Configuration Management (CM) system. The CM system itself may include a configuration control subsystem, a configuration repository, a configuration accounting subsystem, and a configuration auditing subsystem.",
      "zh-CHS": "(5) 一组管理控制参数，可通过配置管理（CM）系统进行操作。CM系统本身可包括配置控制子系统、配置存储库、配置记帐子系统和配置审计子系统。"
    },
    {
      "indent": 6,
      "text": "(6) A set of guidelines for network performance evaluation, performance optimization, and performance improvement.",
      "zh-CHS": "(6) 一套用于网络性能评估、性能优化和性能改进的指南。"
    },
    {
      "indent": 3,
      "text": "Derivation of traffic characteristics through measurement and/or estimation is very useful within the realm of the solution space for traffic engineering. Traffic estimates can be derived from customer subscription information, traffic projections, traffic models, and from actual empirical measurements. The empirical measurements may be performed at the traffic aggregate level or at the flow level in order to derive traffic statistics at various levels of detail. Measurements at the flow level or on small traffic aggregates may be performed at edge nodes, where traffic enters and leaves the network. Measurements at large traffic aggregate levels may be performed within the core of the network where potentially numerous traffic flows may be in transit concurrently.",
      "zh-CHS": "在交通工程的解决方案空间领域内，通过测量和/或估计推导交通特征非常有用。流量估计可以从客户订阅信息、流量预测、流量模型和实际经验测量中得出。可在交通总量水平或流量水平上进行经验测量，以得出不同细节水平的交通统计数据。可以在流量进入和离开网络的边缘节点上执行流量级别或小流量聚集的测量。可在网络核心内执行大流量聚合级别的测量，其中可能有大量流量同时在传输中。"
    },
    {
      "indent": 3,
      "text": "To conduct performance studies and to support planning of existing and future networks, a routing analysis may be performed to determine the path(s) the routing protocols will choose for various traffic demands, and to ascertain the utilization of network resources as traffic is routed through the network. The routing analysis should capture the selection of paths through the network, the assignment of",
      "zh-CHS": "为了进行性能研究并支持现有和未来网络的规划，可以执行路由分析，以确定路由协议将为各种流量需求选择的路径，并确定流量通过网络路由时网络资源的利用率。路由分析应捕获通过网络的路径选择，以及"
    },
    {
      "indent": 3,
      "text": "traffic across multiple feasible routes, and the multiplexing of IP traffic over traffic trunks (if such constructs exists) and over the underlying network infrastructure. A network topology model is a necessity for routing analysis. A network topology model may be extracted from network architecture documents, from network designs, from information contained in router configuration files, from routing databases, from routing tables, or from automated tools that discover and depict network topology information. Topology information may also be derived from servers that monitor network state, and from servers that perform provisioning functions.",
      "zh-CHS": "跨多条可行路由的流量，以及通过流量中继（如果存在此类结构）和基础网络基础设施的IP流量多路复用。网络拓扑模型是路由分析的必要条件。网络拓扑模型可以从网络架构文档、网络设计、路由器配置文件中包含的信息、路由数据库、路由表或发现和描述网络拓扑信息的自动化工具中提取。拓扑信息还可以从监视网络状态的服务器和执行资源调配功能的服务器中派生。"
    },
    {
      "indent": 3,
      "text": "Routing in operational IP networks can be administratively controlled at various levels of abstraction including the manipulation of BGP attributes and manipulation of IGP metrics. For path oriented technologies such as MPLS, routing can be further controlled by the manipulation of relevant traffic engineering parameters, resource parameters, and administrative policy constraints. Within the context of MPLS, the path of an explicit label switched path (LSP) can be computed and established in various ways including: (1) manually, (2) automatically online using constraint-based routing processes implemented on label switching routers, and (3) automatically offline using constraint-based routing entities implemented on external traffic engineering support systems.",
      "zh-CHS": "可操作IP网络中的路由可以在各种抽象级别上进行管理控制，包括BGP属性的操作和IGP度量的操作。对于MPLS等面向路径的技术，可以通过操纵相关的流量工程参数、资源参数和管理策略约束来进一步控制路由。在MPLS的上下文中，可以通过各种方式计算和建立显式标签交换路径（LSP）的路径，包括：（1）手动，（2）使用标签交换路由器上实现的基于约束的路由过程自动在线，以及（3）使用外部交通工程支持系统上实现的基于约束的路由实体自动脱机。"
    },
    {
      "indent": 0,
      "text": "2.4.1 Combating the Congestion Problem",
      "section_title": true,
      "zh-CHS": "2.4.1 解决交通挤塞问题"
    },
    {
      "indent": 3,
      "text": "Minimizing congestion is a significant aspect of Internet traffic engineering. This subsection gives an overview of the general approaches that have been used or proposed to combat congestion problems.",
      "zh-CHS": "最小化拥塞是互联网流量工程的一个重要方面。本小节概述了已经使用或提议用于解决拥堵问题的一般方法。"
    },
    {
      "indent": 3,
      "text": "Congestion management policies can be categorized based upon the following criteria (see e.g., [YARE95] for a more detailed taxonomy of congestion control schemes): (1) Response time scale which can be characterized as long, medium, or short; (2) reactive versus preventive which relates to congestion control and congestion avoidance; and (3) supply side versus demand side congestion management schemes. These aspects are discussed in the following paragraphs.",
      "zh-CHS": "拥塞管理策略可根据以下标准进行分类（参见[YARE95]了解拥塞控制方案的更详细分类）：（1）响应时间尺度，其特征可为长、中或短；（2） 与拥塞控制和拥塞避免相关的反应性与预防性；（3）供给侧与需求侧拥堵管理方案。以下段落将讨论这些方面。"
    },
    {
      "indent": 3,
      "text": "(1) Congestion Management based on Response Time Scales",
      "zh-CHS": "(1) 基于响应时间尺度的拥塞管理"
    },
    {
      "indent": 3,
      "text": "- Long (weeks to months): Capacity planning works over a relatively long time scale to expand network capacity based on estimates or forecasts of future traffic demand and traffic distribution. Since router and link provisioning take time and are generally expensive, these upgrades are typically carried out in the weeks-to-months or even years time scale.",
      "zh-CHS": "- 长（周到月）：容量规划在相对较长的时间范围内工作，以根据对未来交通需求和交通分布的估计或预测扩大网络容量。由于路由器和链路供应需要时间且通常成本较高，因此这些升级通常在数周到数月甚至数年的时间范围内进行。"
    },
    {
      "indent": 3,
      "text": "- Medium (minutes to days): Several control policies fall within the medium time scale category. Examples include: (1) Adjusting IGP and/or BGP parameters to route traffic away or towards certain segments of the network; (2) Setting up and/or adjusting some explicitly routed label switched paths (ER-LSPs) in MPLS networks to route some traffic trunks away from possibly congested resources or towards possibly more favorable routes; (3) re-configuring the logical topology of the network to make it correlate more closely with the spatial traffic distribution using for example some underlying path-oriented technology such as MPLS LSPs, ATM PVCs, or optical channel trails. Many of these adaptive medium time scale response schemes rely on a measurement system that monitors changes in traffic distribution, traffic shifts, and network resource utilization and subsequently provides feedback to the online and/or offline traffic engineering mechanisms and tools which employ this feedback information to trigger certain control actions to occur within the network. The traffic engineering mechanisms and tools can be implemented in a distributed fashion or in a centralized fashion, and may have a hierarchical structure or a flat structure. The comparative merits of distributed and centralized control structures for networks are well known. A centralized scheme may have global visibility into the network state and may produce potentially more optimal solutions. However, centralized schemes are prone to single points of failure and may not scale as well as distributed schemes. Moreover, the information utilized by a centralized scheme may be stale and may not reflect the actual state of the network. It is not an objective of this memo to make a recommendation between distributed and centralized schemes. This is a choice that network administrators must make based on their specific needs.",
      "zh-CHS": "- 中等（分钟到天）：若干控制策略属于中等时间范围类别。示例包括：（1）调整IGP和/或BGP参数，以将流量路由到网络的某些部分；（2） 在MPLS网络中建立和/或调整一些显式路由标签交换路径（ER-lsp），以将一些业务中继路由到远离可能拥塞的资源或可能更有利的路由；（3） 重新配置网络的逻辑拓扑，使其与空间流量分布更紧密地关联，例如使用一些底层面向路径的技术，如MPLS LSP、ATM PVC或光信道路径。许多自适应中时标响应方案依赖于监测交通分布、交通转移、交通流量变化的测量系统，以及网络资源利用率，并随后向在线和/或离线流量工程机制和工具提供反馈，这些机制和工具利用该反馈信息触发网络内发生的某些控制动作。流量工程机制和工具可以以分布式方式或集中式方式实现，并且可以具有层次结构或平面结构。网络的分布式和集中式控制结构的比较优点是众所周知的。集中式方案可能对网络状态具有全局可见性，并可能产生潜在的更优解决方案。然而，集中式方案容易出现单点故障，并且可能无法像分布式方案那样扩展。此外，由集中式方案使用的信息可能是陈旧的，并且可能不反映网络的实际状态。本备忘录的目的不是在分布式和集中式方案之间提出建议。这是网络管理员必须根据其特定需要做出的选择。"
    },
    {
      "indent": 3,
      "text": "- Short (picoseconds to minutes): This category includes packet level processing functions and events on the order of several round trip times. It includes router mechanisms such as passive and active buffer management. These mechanisms are used to control congestion and/or signal congestion to end systems so that they can adaptively regulate the rate at which traffic is injected into the network. One of the most popular active queue management schemes, especially for TCP traffic, is Random Early Detection (RED) [FLJA93], which supports congestion avoidance by controlling the average queue size. During congestion (but before the queue is filled), the RED scheme chooses arriving packets to \"mark\" according to a probabilistic algorithm which takes into account the average queue size. For a router that does not utilize explicit congestion notification (ECN) see e.g., [FLOY94], the marked packets can simply be dropped to signal the inception of congestion to end systems. On the other hand, if the router supports ECN, then it can set the ECN field in the packet header. Several variations of RED have been proposed to support different drop precedence levels in multi-class environments [RFC-",
      "zh-CHS": "- 短（皮秒到分钟）：该类别包括数据包级别的处理功能和事件，顺序为若干往返时间。它包括路由器机制，如被动和主动缓冲区管理。这些机制用于控制终端系统的拥塞和/或信号拥塞，以便自适应地调节流量注入网络的速率。最流行的主动队列管理方案之一，特别是对于TCP流量，是随机早期检测（RED）[FLJA93]，它通过控制平均队列大小来支持拥塞避免。在拥塞期间（但在队列被填满之前），RED方案根据考虑平均队列大小的概率算法选择要“标记”的到达数据包。对于不使用显式拥塞通知（ECN）的路由器，参见例如[FLOY94]，可以简单地丢弃标记的数据包，以向终端系统发出拥塞开始的信号。另一方面，如果路由器支持ECN，那么它可以在包头中设置ECN字段。已经提出了几种RED变体，以支持多类环境中不同的丢弃优先级[RFC]-"
    },
    {
      "indent": 3,
      "text": "2597], e.g., RED with In and Out (RIO) and Weighted RED. There is general consensus that RED provides congestion avoidance performance which is not worse than traditional Tail-Drop (TD) queue management (drop arriving packets only when the queue is full). Importantly, however, RED reduces the possibility of global synchronization and improves fairness among different TCP sessions. However, RED by itself can not prevent congestion and unfairness caused by sources unresponsive to RED, e.g., UDP traffic and some misbehaved greedy connections. Other schemes have been proposed to improve the performance and fairness in the presence of unresponsive traffic. Some of these schemes were proposed as theoretical frameworks and are typically not available in existing commercial products. Two such schemes are Longest Queue Drop (LQD) and Dynamic Soft Partitioning with Random Drop (RND) [SLDC98].",
      "zh-CHS": "2597]，例如，带有输入和输出（RIO）的红色和加权红色。人们普遍认为，RED提供的拥塞避免性能并不比传统的尾部丢弃（TD）队列管理（仅当队列已满时丢弃到达的数据包）差。然而，重要的是，RED降低了全局同步的可能性，并提高了不同TCP会话之间的公平性。然而，RED本身并不能防止由对RED无响应的源（例如UDP流量和一些行为不当的贪婪连接）造成的拥塞和不公平。已经提出了其他方案来提高在存在无响应流量的情况下的性能和公平性。其中一些方案是作为理论框架提出的，在现有的商业产品中通常不可用。这两种方案是最长队列丢弃（LQD）和随机丢弃动态软划分（RND）[SLDC98]。"
    },
    {
      "indent": 3,
      "text": "(2) Congestion Management: Reactive versus Preventive Schemes",
      "zh-CHS": "(2) 拥塞管理：反应性方案与预防性方案"
    },
    {
      "indent": 3,
      "text": "- Reactive: reactive (recovery) congestion management policies react to existing congestion problems to improve it. All the policies described in the long and medium time scales above can be categorized as being reactive especially if the policies are based on monitoring and identifying existing congestion problems, and on the initiation of relevant actions to ease a situation.",
      "zh-CHS": "- 反应式：反应式（恢复）拥塞管理策略对现有的拥塞问题作出反应，以改善它。上述中长期时间尺度中描述的所有政策都可以归类为反应性政策，特别是如果这些政策是基于监测和识别现有的拥堵问题，以及启动相关行动以缓解情况的话。"
    },
    {
      "indent": 3,
      "text": "- Preventive: preventive (predictive/avoidance) policies take proactive action to prevent congestion based on estimates and predictions of future potential congestion problems. Some of the policies described in the long and medium time scales fall into this category. They do not necessarily respond immediately to existing congestion problems. Instead forecasts of traffic demand and workload distribution are considered and action may be taken to prevent potential congestion problems in the future. The schemes described in the short time scale (e.g., RED and its variations, ECN, LQD, and RND) are also used for congestion avoidance since dropping or marking packets before queues actually overflow would trigger corresponding TCP sources to slow down.",
      "zh-CHS": "- 预防性：预防性（预测性/避免性）策略根据对未来潜在拥堵问题的估计和预测，采取主动行动预防拥堵。中长期时间尺度中描述的一些政策属于这一类。它们不一定会立即对现有的拥堵问题作出反应。相反，我们会考虑交通需求和工作量分布的预测，并可能采取行动防止未来可能出现的拥堵问题。短时间尺度中描述的方案（例如，RED及其变体、ECN、LQD和RND）也用于避免拥塞，因为在队列实际溢出之前丢弃或标记数据包会触发相应的TCP源减速。"
    },
    {
      "indent": 3,
      "text": "(3) Congestion Management: Supply Side versus Demand Side Schemes",
      "zh-CHS": "(3) 拥堵管理：供给侧与需求侧方案"
    },
    {
      "indent": 3,
      "text": "- Supply side: supply side congestion management policies increase the effective capacity available to traffic in order to control or obviate congestion. This can be accomplished by augmenting capacity. Another way to accomplish this is to minimize congestion by having a relatively balanced distribution of traffic over the network. For example, capacity planning should aim to provide a physical topology and associated link bandwidths that match estimated traffic workload and traffic distribution based on forecasting (subject to budgetary and other constraints). However, if actual traffic distribution does",
      "zh-CHS": "- 供给侧：供给侧拥堵管理政策增加交通可用的有效容量，以控制或消除拥堵。这可以通过增加容量来实现。实现这一点的另一种方法是通过在网络上相对均衡地分配流量来最小化拥塞。例如，容量规划应旨在提供物理拓扑和相关链路带宽，以匹配基于预测的估计流量工作量和流量分布（受预算和其他限制）。但是，如果实际的流量分布"
    },
    {
      "indent": 3,
      "text": "not match the topology derived from capacity panning (due to forecasting errors or facility constraints for example), then the traffic can be mapped onto the existing topology using routing control mechanisms, using path oriented technologies (e.g., MPLS LSPs and optical channel trails) to modify the logical topology, or by using some other load redistribution mechanisms.",
      "zh-CHS": "不匹配从容量平移导出的拓扑（例如，由于预测错误或设施限制），则可以使用路由控制机制，使用面向路径的技术（例如，MPLS LSP和光通道路径）将流量映射到现有拓扑，以修改逻辑拓扑，或者使用其他一些负载重新分配机制。"
    },
    {
      "indent": 3,
      "text": "- Demand side: demand side congestion management policies control or regulate the offered traffic to alleviate congestion problems. For example, some of the short time scale mechanisms described earlier (such as RED and its variations, ECN, LQD, and RND) as well as policing and rate shaping mechanisms attempt to regulate the offered load in various ways. Tariffs may also be applied as a demand side instrument. To date, however, tariffs have not been used as a means of demand side congestion management within the Internet.",
      "zh-CHS": "- 需求侧：需求侧拥堵管理策略控制或调节提供的交通，以缓解拥堵问题。例如，前面描述的一些短时间尺度机制（如RED及其变体、ECN、LQD和RND）以及策略和速率成形机制试图以各种方式调节提供的负载。关税也可作为需求方工具使用。然而，到目前为止，关税还没有被用作互联网内需求侧拥塞管理的一种手段。"
    },
    {
      "indent": 3,
      "text": "In summary, a variety of mechanisms can be used to address congestion problems in IP networks. These mechanisms may operate at multiple time-scales.",
      "zh-CHS": "总之，可以使用多种机制来解决IP网络中的拥塞问题。这些机制可以在多个时间尺度上运行。"
    },
    {
      "indent": 0,
      "text": "2.5 Implementation and Operational Context",
      "section_title": true,
      "zh-CHS": "2.5 实施和运作背景"
    },
    {
      "indent": 3,
      "text": "The operational context of Internet traffic engineering is characterized by constant change which occur at multiple levels of abstraction. The implementation context demands effective planning, organization, and execution. The planning aspects may involve determining prior sets of actions to achieve desired objectives. Organizing involves arranging and assigning responsibility to the various components of the traffic engineering system and coordinating the activities to accomplish the desired TE objectives. Execution involves measuring and applying corrective or perfective actions to attain and maintain desired TE goals.",
      "zh-CHS": "互联网流量工程的操作环境的特点是在多个抽象层次上不断发生变化。实施环境需要有效的规划、组织和执行。规划方面可能涉及确定实现预期目标的先前行动集。组织包括安排和分配交通工程系统各组成部分的责任，并协调活动以实现预期的TE目标。执行包括测量和应用纠正或完善措施，以实现和维持预期的TE目标。"
    },
    {
      "indent": 0,
      "text": "3.0 Traffic Engineering Process Model(s)",
      "section_title": true,
      "zh-CHS": "3.0 交通工程过程模型"
    },
    {
      "indent": 3,
      "text": "This section describes a generic process model that captures the high level practical aspects of Internet traffic engineering in an operational context. The process model is described as a sequence of actions that a traffic engineer, or more generally a traffic engineering system, must perform to optimize the performance of an operational network (see also [RFC-2702, AWD2]). The process model described here represents the broad activities common to most traffic engineering methodologies although the details regarding how traffic engineering is executed may differ from network to network. This process model may be enacted explicitly or implicitly, by an automaton and/or by a human.",
      "zh-CHS": "本节描述了一个通用流程模型，该模型在操作环境中捕获了Internet流量工程的高级实践方面。过程模型被描述为一系列行动，交通工程师或更一般地说是交通工程系统必须执行这些行动，以优化运营网络的性能（另见[RFC-2702，AWD2]）。这里描述的过程模型代表了大多数流量工程方法所共有的广泛活动，尽管关于如何执行流量工程的细节可能因网络而异。该过程模型可由自动机和/或人工显式或隐式实施。"
    },
    {
      "indent": 3,
      "text": "The traffic engineering process model is iterative [AWD2]. The four phases of the process model described below are repeated continually.",
      "zh-CHS": "交通工程过程模型是迭代的[AWD2]。下面描述的流程模型的四个阶段将持续重复。"
    },
    {
      "indent": 3,
      "text": "The first phase of the TE process model is to define the relevant control policies that govern the operation of the network. These policies may depend upon many factors including the prevailing business model, the network cost structure, the operating constraints, the utility model, and optimization criteria.",
      "zh-CHS": "TE过程模型的第一阶段是定义控制网络运行的相关控制策略。这些政策可能取决于许多因素，包括主流商业模式、网络成本结构、运营约束、效用模型和优化标准。"
    },
    {
      "indent": 3,
      "text": "The second phase of the process model is a feedback mechanism involving the acquisition of measurement data from the operational network. If empirical data is not readily available from the network, then synthetic workloads may be used instead which reflect either the prevailing or the expected workload of the network. Synthetic workloads may be derived by estimation or extrapolation using prior empirical data. Their derivation may also be obtained using mathematical models of traffic characteristics or other means.",
      "zh-CHS": "过程模型的第二阶段是一种反馈机制，涉及从运行网络获取测量数据。如果无法从网络中获得经验数据，则可以使用反映网络当前或预期工作负载的合成工作负载。合成工作负载可通过使用先前经验数据进行估计或外推得出。也可使用交通特征的数学模型或其他方法获得其推导。"
    },
    {
      "indent": 3,
      "text": "The third phase of the process model is to analyze the network state and to characterize traffic workload. Performance analysis may be proactive and/or reactive. Proactive performance analysis identifies potential problems that do not exist, but could manifest in the future. Reactive performance analysis identifies existing problems, determines their cause through diagnosis, and evaluates alternative approaches to remedy the problem, if necessary. A number of quantitative and qualitative techniques may be used in the analysis process, including modeling based analysis and simulation. The analysis phase of the process model may involve investigating the concentration and distribution of traffic across the network or relevant subsets of the network, identifying the characteristics of the offered traffic workload, identifying existing or potential bottlenecks, and identifying network pathologies such as ineffective link placement, single points of failures, etc. Network pathologies may result from many factors including inferior network architecture, inferior network design, and configuration problems. A traffic matrix may be constructed as part of the analysis process. Network analysis may also be descriptive or prescriptive.",
      "zh-CHS": "流程模型的第三阶段是分析网络状态和描述流量负载。性能分析可以是主动的和/或被动的。主动预防性性能分析可识别不存在但将来可能出现的潜在问题。反应式性能分析可识别存在的问题，通过诊断确定其原因，并在必要时评估补救问题的替代方法。在分析过程中可以使用许多定量和定性技术，包括基于建模的分析和模拟。过程模型的分析阶段可能涉及调查网络或网络相关子集上的流量集中和分布，识别所提供流量工作负载的特征，识别现有或潜在瓶颈，以及识别网络病态，如无效链路布置，单点故障等。网络病态可能由许多因素造成，包括劣质的网络体系结构、劣质的网络设计和配置问题。流量矩阵可作为分析过程的一部分进行构建。网络分析也可以是描述性的或规定性的。"
    },
    {
      "indent": 3,
      "text": "The fourth phase of the TE process model is the performance optimization of the network. The performance optimization phase involves a decision process which selects and implements a set of actions from a set of alternatives. Optimization actions may include the use of appropriate techniques to either control the offered traffic or to control the distribution of traffic across the network. Optimization actions may also involve adding additional links or increasing link capacity, deploying additional hardware such as routers and switches, systematically adjusting parameters associated with routing such as IGP metrics and BGP attributes, and adjusting",
      "zh-CHS": "TE过程模型的第四阶段是网络的性能优化。性能优化阶段涉及一个决策过程，该过程从一组备选方案中选择并实施一组操作。优化操作可以包括使用适当的技术来控制所提供的流量或控制网络上的流量分布。优化操作还可能涉及添加额外链路或增加链路容量、部署额外硬件（如路由器和交换机）、系统地调整与路由相关的参数（如IGP度量和BGP属性），以及调整"
    },
    {
      "indent": 3,
      "text": "traffic management parameters. Network performance optimization may also involve starting a network planning process to improve the network architecture, network design, network capacity, network technology, and the configuration of network elements to accommodate current and future growth.",
      "zh-CHS": "交通管理参数。网络性能优化还可能涉及启动网络规划过程，以改进网络架构、网络设计、网络容量、网络技术和网元配置，以适应当前和未来的增长。"
    },
    {
      "indent": 0,
      "text": "3.1 Components of the Traffic Engineering Process Model",
      "section_title": true,
      "zh-CHS": "3.1 交通工程过程模型的组成部分"
    },
    {
      "indent": 3,
      "text": "The key components of the traffic engineering process model include a measurement subsystem, a modeling and analysis subsystem, and an optimization subsystem. The following subsections examine these components as they apply to the traffic engineering process model.",
      "zh-CHS": "交通工程过程模型的关键组件包括测量子系统、建模与分析子系统和优化子系统。以下小节将研究这些组件，因为它们适用于流量工程过程模型。"
    },
    {
      "indent": 0,
      "text": "3.2 Measurement",
      "section_title": true,
      "zh-CHS": "3.2 测量"
    },
    {
      "indent": 3,
      "text": "Measurement is crucial to the traffic engineering function. The operational state of a network can be conclusively determined only through measurement. Measurement is also critical to the optimization function because it provides feedback data which is used by traffic engineering control subsystems. This data is used to adaptively optimize network performance in response to events and stimuli originating within and outside the network. Measurement is also needed to determine the quality of network services and to evaluate the effectiveness of traffic engineering policies. Experience suggests that measurement is most effective when acquired and applied systematically.",
      "zh-CHS": "测量对于交通工程功能至关重要。只有通过测量才能最终确定网络的运行状态。测量对于优化功能也至关重要，因为它提供了交通工程控制子系统使用的反馈数据。该数据用于自适应优化网络性能，以响应源自网络内外的事件和刺激。还需要测量来确定网络服务的质量和评估流量工程策略的有效性。经验表明，系统地获取和应用测量是最有效的。"
    },
    {
      "indent": 3,
      "text": "When developing a measurement system to support the traffic engineering function in IP networks, the following questions should be carefully considered: Why is measurement needed in this particular context? What parameters are to be measured? How should the measurement be accomplished? Where should the measurement be performed? When should the measurement be performed? How frequently should the monitored variables be measured? What level of measurement accuracy and reliability is desirable? What level of measurement accuracy and reliability is realistically attainable? To what extent can the measurement system permissibly interfere with the monitored network components and variables? What is the acceptable cost of measurement? The answers to these questions will determine the measurement tools and methodologies appropriate in any given traffic engineering context.",
      "zh-CHS": "在开发测量系统以支持IP网络中的流量工程功能时，应仔细考虑以下问题：为什么在这种特殊情况下需要测量？需要测量哪些参数？如何完成测量？应在何处进行测量？什么时候应该进行测量？监测变量应多久测量一次？什么水平的测量精度和可靠性是可取的？实际可达到的测量精度和可靠性水平是多少？测量系统可以在多大程度上允许干扰被监测的网络组件和变量？可接受的测量成本是多少？这些问题的答案将决定适用于任何给定交通工程环境的测量工具和方法。"
    },
    {
      "indent": 3,
      "text": "It should also be noted that there is a distinction between measurement and evaluation. Measurement provides raw data concerning state parameters and variables of monitored network elements. Evaluation utilizes the raw data to make inferences regarding the monitored system.",
      "zh-CHS": "还应注意的是，计量和评价之间存在区别。测量提供有关被监测网络元件的状态参数和变量的原始数据。评估利用原始数据对监控系统进行推断。"
    },
    {
      "indent": 3,
      "text": "Measurement in support of the TE function can occur at different levels of abstraction. For example, measurement can be used to derive packet level characteristics, flow level characteristics, user or customer level characteristics, traffic aggregate characteristics, component level characteristics, and network wide characteristics.",
      "zh-CHS": "支持TE函数的度量可以在不同的抽象级别上进行。例如，测量可用于导出分组级特性、流级特性、用户或客户级特性、业务聚合特性、组件级特性和网络范围特性。"
    },
    {
      "indent": 0,
      "text": "3.3 Modeling, Analysis, and Simulation",
      "section_title": true,
      "zh-CHS": "3.3 建模、分析和仿真"
    },
    {
      "indent": 3,
      "text": "Modeling and analysis are important aspects of Internet traffic engineering. Modeling involves constructing an abstract or physical representation which depicts relevant traffic characteristics and network attributes.",
      "zh-CHS": "建模和分析是互联网流量工程的重要方面。建模涉及构造一个抽象或物理表示，描述相关的流量特征和网络属性。"
    },
    {
      "indent": 3,
      "text": "A network model is an abstract representation of the network which captures relevant network features, attributes, and characteristics, such as link and nodal attributes and constraints. A network model may facilitate analysis and/or simulation which can be used to predict network performance under various conditions as well as to guide network expansion plans.",
      "zh-CHS": "网络模型是网络的抽象表示，它捕获相关的网络特征、属性和特征，例如链路和节点属性和约束。网络模型可促进分析和/或模拟，可用于预测各种条件下的网络性能以及指导网络扩展计划。"
    },
    {
      "indent": 3,
      "text": "In general, Internet traffic engineering models can be classified as either structural or behavioral. Structural models focus on the organization of the network and its components. Behavioral models focus on the dynamics of the network and the traffic workload. Modeling for Internet traffic engineering may also be formal or informal.",
      "zh-CHS": "一般来说，互联网流量工程模型可以分为结构模型和行为模型。结构模型侧重于网络及其组件的组织。行为模型关注网络动态和流量负载。互联网流量工程的建模也可以是正式的或非正式的。"
    },
    {
      "indent": 3,
      "text": "Accurate behavioral models for traffic sources are particularly useful for analysis. Development of behavioral traffic source models that are consistent with empirical data obtained from operational networks is a major research topic in Internet traffic engineering. These source models should also be tractable and amenable to analysis. The topic of source models for IP traffic is a research topic and is therefore outside the scope of this document. Its importance, however, must be emphasized.",
      "zh-CHS": "流量源的精确行为模型对于分析特别有用。开发与从运营网络获得的经验数据一致的行为流量源模型是互联网流量工程的一个主要研究课题。这些源模型也应易于处理和分析。IP流量的源模型主题是一个研究主题，因此不在本文档的范围内。然而，必须强调其重要性。"
    },
    {
      "indent": 3,
      "text": "Network simulation tools are extremely useful for traffic engineering. Because of the complexity of realistic quantitative analysis of network behavior, certain aspects of network performance studies can only be conducted effectively using simulation. A good network simulator can be used to mimic and visualize network characteristics under various conditions in a safe and non-disruptive manner. For example, a network simulator may be used to depict congested resources and hot spots, and to provide hints regarding possible solutions to network performance problems. A good simulator may also be used to validate the effectiveness of planned solutions to network issues without the need to tamper with the operational network, or to commence an expensive network upgrade which may not",
      "zh-CHS": "网络模拟工具对于交通工程非常有用。由于现实网络行为定量分析的复杂性，网络性能研究的某些方面只能通过仿真有效地进行。一个好的网络模拟器可以用于以安全和无中断的方式模拟和可视化各种条件下的网络特性。例如，网络模拟器可用于描述拥挤的资源和热点，并提供关于网络性能问题的可能解决方案的提示。一个好的模拟器也可用于验证网络问题的计划解决方案的有效性，而无需篡改运行网络，或开始昂贵的网络升级，但可能不会"
    },
    {
      "indent": 3,
      "text": "achieve the desired objectives. Furthermore, during the process of network planning, a network simulator may reveal pathologies such as single points of failure which may require additional redundancy, and potential bottlenecks and hot spots which may require additional capacity.",
      "zh-CHS": "达到预期目标。此外，在网络规划过程中，网络模拟器可能会揭示诸如可能需要额外冗余的单点故障以及可能需要额外容量的潜在瓶颈和热点等病态。"
    },
    {
      "indent": 3,
      "text": "Routing simulators are especially useful in large networks. A routing simulator may identify planned links which may not actually be used to route traffic by the existing routing protocols. Simulators can also be used to conduct scenario based and perturbation based analysis, as well as sensitivity studies. Simulation results can be used to initiate appropriate actions in various ways. For example, an important application of network simulation tools is to investigate and identify how best to make the network evolve and grow, in order to accommodate projected future demands.",
      "zh-CHS": "路由模拟器在大型网络中特别有用。路由模拟器可以识别计划的链路，这些链路实际上可能不会被现有路由协议用于路由流量。模拟器也可用于进行基于情景和基于扰动的分析，以及敏感性研究。仿真结果可用于以各种方式启动适当的操作。例如，网络模拟工具的一个重要应用是调查和确定如何最好地使网络进化和增长，以适应预计的未来需求。"
    },
    {
      "indent": 0,
      "text": "3.4 Optimization",
      "section_title": true,
      "zh-CHS": "3.4 优化"
    },
    {
      "indent": 3,
      "text": "Network performance optimization involves resolving network issues by transforming such issues into concepts that enable a solution, identification of a solution, and implementation of the solution. Network performance optimization can be corrective or perfective. In corrective optimization, the goal is to remedy a problem that has occurred or that is incipient. In perfective optimization, the goal is to improve network performance even when explicit problems do not exist and are not anticipated.",
      "zh-CHS": "网络性能优化涉及通过将网络问题转化为支持解决方案、确定解决方案和实施解决方案的概念来解决网络问题。网络性能优化可以是纠正性的，也可以是完善的。在纠正性优化中，目标是纠正已经发生或刚刚出现的问题。在完美优化中，目标是提高网络性能，即使不存在明确的问题，也无法预料。"
    },
    {
      "indent": 3,
      "text": "Network performance optimization is a continual process, as noted previously. Performance optimization iterations may consist of real-time optimization sub-processes and non-real-time network planning sub-processes. The difference between real-time optimization and network planning is primarily in the relative time-scale in which they operate and in the granularity of actions. One of the objectives of a real-time optimization sub-process is to control the mapping and distribution of traffic over the existing network infrastructure to avoid and/or relieve congestion, to assure satisfactory service delivery, and to optimize resource utilization. Real-time optimization is needed because random incidents such as fiber cuts or shifts in traffic demand will occur irrespective of how well a network is designed. These incidents can cause congestion and other problems to manifest in an operational network. Real-time optimization must solve such problems in small to medium time-scales ranging from micro-seconds to minutes or hours. Examples of real-time optimization include queue management, IGP/BGP metric tuning, and using technologies such as MPLS explicit LSPs to change the paths of some traffic trunks [XIAO].",
      "zh-CHS": "如前所述，网络性能优化是一个持续的过程。性能优化迭代可能包括实时优化子过程和非实时网络规划子过程。实时优化和网络规划之间的区别主要在于它们操作的相对时间尺度和操作的粒度。实时优化子流程的目标之一是控制现有网络基础设施上流量的映射和分布，以避免和/或缓解拥塞，确保满意的服务交付，并优化资源利用率。需要进行实时优化，因为无论网络设计的好坏，都会发生随机事件，如光纤中断或交通需求变化。这些事件可能会导致运行网络出现拥塞和其他问题。实时优化必须在从微秒到分钟或小时的中小型时间范围内解决此类问题。实时优化的示例包括队列管理、IGP/BGP度量调整，以及使用MPLS显式LSP等技术来更改某些交通干线的路径[XIAO]。"
    },
    {
      "indent": 3,
      "text": "One of the functions of the network planning sub-process is to initiate actions to systematically evolve the architecture, technology, topology, and capacity of a network. When a problem exists in the network, real-time optimization should provide an immediate remedy. Because a prompt response is necessary, the real-time solution may not be the best possible solution. Network planning may subsequently be needed to refine the solution and improve the situation. Network planning is also required to expand the network to support traffic growth and changes in traffic distribution over time. As previously noted, a change in the topology and/or capacity of the network may be the outcome of network planning.",
      "zh-CHS": "网络规划子流程的功能之一是发起行动，系统地改进网络的架构、技术、拓扑和容量。当网络中存在问题时，实时优化应该是一种即时的补救措施。因为需要快速响应，所以实时解决方案可能不是最好的解决方案。随后可能需要进行网络规划，以完善解决方案并改善情况。网络规划还需要扩展网络，以支持流量增长和随时间变化的流量分布。如前所述，网络拓扑和/或容量的变化可能是网络规划的结果。"
    },
    {
      "indent": 3,
      "text": "Clearly, network planning and real-time performance optimization are mutually complementary activities. A well-planned and designed network makes real-time optimization easier, while a systematic approach to real-time network performance optimization allows network planning to focus on long term issues rather than tactical considerations. Systematic real-time network performance optimization also provides valuable inputs and insights toward network planning.",
      "zh-CHS": "显然，网络规划和实时性能优化是相辅相成的活动。精心规划和设计的网络使实时优化更加容易，而实时网络性能优化的系统方法使网络规划能够关注长期问题，而不是战术考虑。系统的实时网络性能优化也为网络规划提供了有价值的输入和见解。"
    },
    {
      "indent": 3,
      "text": "Stability is an important consideration in real-time network performance optimization. This aspect will be repeatedly addressed throughout this memo.",
      "zh-CHS": "稳定性是实时网络性能优化的重要考虑因素。这方面将在本备忘录中反复提及。"
    },
    {
      "indent": 0,
      "text": "4.0 Historical Review and Recent Developments",
      "section_title": true,
      "zh-CHS": "4.0 历史回顾和最新发展"
    },
    {
      "indent": 3,
      "text": "This section briefly reviews different traffic engineering approaches proposed and implemented in telecommunications and computer networks. The discussion is not intended to be comprehensive. It is primarily intended to illuminate pre-existing perspectives and prior art concerning traffic engineering in the Internet and in legacy telecommunications networks.",
      "zh-CHS": "本节简要回顾了在电信和计算机网络中提出和实施的不同流量工程方法。讨论的目的并不全面。本发明主要旨在阐明关于因特网和传统电信网络中的流量工程的现有观点和现有技术。"
    },
    {
      "indent": 0,
      "text": "4.1 Traffic Engineering in Classical Telephone Networks",
      "section_title": true,
      "zh-CHS": "4.1 经典电话网中的流量工程"
    },
    {
      "indent": 3,
      "text": "This subsection presents a brief overview of traffic engineering in telephone networks which often relates to the way user traffic is steered from an originating node to the terminating node. This subsection presents a brief overview of this topic. A detailed description of the various routing strategies applied in telephone networks is included in the book by G. Ash [ASH2].",
      "zh-CHS": "本小节简要概述电话网络中的流量工程，该工程通常涉及用户流量从始发节点转向终接节点的方式。本小节简要概述了本主题。G.Ash[ASH2]的书中详细描述了电话网络中应用的各种路由策略。"
    },
    {
      "indent": 3,
      "text": "The early telephone network relied on static hierarchical routing, whereby routing patterns remained fixed independent of the state of the network or time of day. The hierarchy was intended to accommodate overflow traffic, improve network reliability via",
      "zh-CHS": "早期的电话网络依赖于静态分层路由，路由模式保持固定，与网络状态或时间无关。该层次结构旨在容纳溢出流量，通过"
    },
    {
      "indent": 3,
      "text": "alternate routes, and prevent call looping by employing strict hierarchical rules. The network was typically over-provisioned since a given fixed route had to be dimensioned so that it could carry user traffic during a busy hour of any busy day. Hierarchical routing in the telephony network was found to be too rigid upon the advent of digital switches and stored program control which were able to manage more complicated traffic engineering rules.",
      "zh-CHS": "交替路由，并通过采用严格的分层规则防止呼叫循环。由于必须确定给定固定路由的尺寸，使其能够在任何繁忙的一天的繁忙时间承载用户流量，因此网络通常被过度配置。随着数字交换机和存储程序控制的出现，人们发现电话网络中的分层路由过于僵化，因为数字交换机和存储程序控制能够管理更复杂的流量工程规则。"
    },
    {
      "indent": 3,
      "text": "Dynamic routing was introduced to alleviate the routing inflexibility in the static hierarchical routing so that the network would operate more efficiently. This resulted in significant economic gains [HUSS87]. Dynamic routing typically reduces the overall loss probability by 10 to 20 percent (compared to static hierarchical routing). Dynamic routing can also improve network resilience by recalculating routes on a per-call basis and periodically updating routes.",
      "zh-CHS": "在静态分层路由中引入动态路由以缓解路由的不灵活性，从而提高网络的运行效率。这导致了显著的经济收益[87]。动态路由通常会将总体丢失概率降低10%到20%（与静态分层路由相比）。动态路由还可以通过在每次呼叫的基础上重新计算路由并定期更新路由来提高网络弹性。"
    },
    {
      "indent": 3,
      "text": "There are three main types of dynamic routing in the telephone network. They are time-dependent routing, state-dependent routing (SDR), and event dependent routing (EDR).",
      "zh-CHS": "电话网络中有三种主要的动态路由。它们是时间相关路由、状态相关路由（SDR）和事件相关路由（EDR）。"
    },
    {
      "indent": 3,
      "text": "In time-dependent routing, regular variations in traffic loads (such as time of day or day of week) are exploited in pre-planned routing tables. In state-dependent routing, routing tables are updated online according to the current state of the network (e.g., traffic demand, utilization, etc.). In event dependent routing, routing changes are incepted by events (such as call setups encountering congested or blocked links) whereupon new paths are searched out using learning models. EDR methods are real-time adaptive, but they do not require global state information as does SDR. Examples of EDR schemes include the dynamic alternate routing (DAR) from BT, the state-and-time dependent routing (STR) from NTT, and the success-to-the-top (STT) routing from AT&T.",
      "zh-CHS": "在依赖时间的路由中，在预先规划的路由表中利用了流量负载的规律变化（如一天中的时间或一周中的某一天）。在依赖于状态的路由中，路由表根据网络的当前状态（例如，流量需求、利用率等）在线更新。在依赖于事件的路由中，路由更改由事件（例如遇到拥塞或阻塞链路的呼叫设置）接收，然后使用学习模型搜索新路径。EDR方法是实时自适应的，但它们不像SDR那样需要全局状态信息。EDR方案的示例包括来自BT的动态备用路由（DAR）、来自NTT的状态和时间相关路由（STR）以及来自AT&T的成功到顶层（STT）路由。"
    },
    {
      "indent": 3,
      "text": "Dynamic non-hierarchical routing (DNHR) is an example of dynamic routing that was introduced in the AT&T toll network in the 1980's to respond to time-dependent information such as regular load variations as a function of time. Time-dependent information in terms of load may be divided into three time scales: hourly, weekly, and yearly. Correspondingly, three algorithms are defined to pre-plan the routing tables. The network design algorithm operates over a year-long interval while the demand servicing algorithm operates on a weekly basis to fine tune link sizes and routing tables to correct forecast errors on the yearly basis. At the smallest time scale, the routing algorithm is used to make limited adjustments based on daily traffic variations. Network design and demand servicing are computed using offline calculations. Typically, the calculations require extensive searches on possible routes. On the other hand, routing may need",
      "zh-CHS": "动态非分层路由（DNHR）是20世纪80年代AT&T收费网络中引入的动态路由的一个示例，用于响应与时间相关的信息，如随时间变化的常规负载变化。负荷方面的时间相关信息可分为三个时间尺度：每小时、每周和每年。相应地，定义了三种算法来预先规划路由表。网络设计算法在一年的时间间隔内运行，而需求服务算法每周运行，以微调链路大小和路由表，以每年纠正预测错误。在最小的时间尺度上，路由算法用于根据每日流量变化进行有限的调整。网络设计和需求服务使用离线计算进行计算。通常，计算需要对可能的路线进行广泛搜索。另一方面，路由可能需要"
    },
    {
      "indent": 3,
      "text": "online calculations to handle crankback. DNHR adopts a \"two-link\" approach whereby a path can consist of two links at most. The routing algorithm presents an ordered list of route choices between an originating switch and a terminating switch. If a call overflows, a via switch (a tandem exchange between the originating switch and the terminating switch) would send a crankback signal to the originating switch. This switch would then select the next route, and so on, until there are no alternative routes available in which the call is blocked.",
      "zh-CHS": "在线计算以处理拖转。DNHR采用“双链路”方法，路径最多由两个链路组成。路由算法提供了始发交换机和终止交换机之间路由选择的有序列表。如果呼叫溢出，via交换机（发起交换机和终止交换机之间的串联交换机）将向发起交换机发送回退信号。然后，该开关将选择下一条路线，依此类推，直到没有其他路线可供选择，呼叫被阻塞。"
    },
    {
      "indent": 0,
      "text": "4.2 Evolution of Traffic Engineering in Packet Networks",
      "section_title": true,
      "zh-CHS": "4.2 分组网络流量工程的发展"
    },
    {
      "indent": 3,
      "text": "This subsection reviews related prior work that was intended to improve the performance of data networks. Indeed, optimization of the performance of data networks started in the early days of the ARPANET. Other early commercial networks such as SNA also recognized the importance of performance optimization and service differentiation.",
      "zh-CHS": "本小节回顾了先前旨在提高数据网络性能的相关工作。事实上，数据网络的性能优化始于ARPANET的早期。其他早期的商业网络如SNA也认识到性能优化和服务差异化的重要性。"
    },
    {
      "indent": 3,
      "text": "In terms of traffic management, the Internet has been a best effort service environment until recently. In particular, very limited traffic management capabilities existed in IP networks to provide differentiated queue management and scheduling services to packets belonging to different classes.",
      "zh-CHS": "就流量管理而言，直到最近，互联网一直是一个尽力而为的服务环境。特别是，IP网络中存在非常有限的流量管理能力，无法为属于不同类别的数据包提供不同的队列管理和调度服务。"
    },
    {
      "indent": 3,
      "text": "In terms of routing control, the Internet has employed distributed protocols for intra-domain routing. These protocols are highly scalable and resilient. However, they are based on simple algorithms for path selection which have very limited functionality to allow flexible control of the path selection process.",
      "zh-CHS": "在路由控制方面，互联网采用分布式协议进行域内路由。这些协议具有高度的可扩展性和弹性。然而，它们基于简单的路径选择算法，这些算法的功能非常有限，无法灵活控制路径选择过程。"
    },
    {
      "indent": 3,
      "text": "In the following subsections, the evolution of practical traffic engineering mechanisms in IP networks and its predecessors are reviewed.",
      "zh-CHS": "在以下小节中，将回顾IP网络中实用流量工程机制及其前身的发展。"
    },
    {
      "indent": 0,
      "text": "4.2.1 Adaptive Routing in the ARPANET",
      "section_title": true,
      "zh-CHS": "4.2.1 ARPANET中的自适应路由"
    },
    {
      "indent": 3,
      "text": "The early ARPANET recognized the importance of adaptive routing where routing decisions were based on the current state of the network [MCQ80]. Early minimum delay routing approaches forwarded each packet to its destination along a path for which the total estimated transit time was the smallest. Each node maintained a table of network delays, representing the estimated delay that a packet would experience along a given path toward its destination. The minimum delay table was periodically transmitted by a node to its neighbors. The shortest path, in terms of hop count, was also propagated to give the connectivity information.",
      "zh-CHS": "早期的ARPANET认识到自适应路由的重要性，其中路由决策基于网络的当前状态[MCQ80]。早期最小延迟路由方法沿着总估计传输时间最小的路径将每个数据包转发到其目的地。每个节点都维护一个网络延迟表，表示数据包沿给定路径到达其目的地所经历的估计延迟。最小延迟表由一个节点周期性地发送给它的邻居。根据跳数，最短路径也被传播以提供连通性信息。"
    },
    {
      "indent": 3,
      "text": "One drawback to this approach is that dynamic link metrics tend to create \"traffic magnets\" causing congestion to be shifted from one location of a network to another location, resulting in oscillation and network instability.",
      "zh-CHS": "这种方法的一个缺点是，动态链路度量往往会产生“流量磁铁”，导致拥塞从网络的一个位置转移到另一个位置，从而导致振荡和网络不稳定。"
    },
    {
      "indent": 0,
      "text": "4.2.2 Dynamic Routing in the Internet",
      "section_title": true,
      "zh-CHS": "4.2.2 Internet中的动态路由"
    },
    {
      "indent": 3,
      "text": "The Internet evolved from the APARNET and adopted dynamic routing algorithms with distributed control to determine the paths that packets should take en-route to their destinations. The routing algorithms are adaptations of shortest path algorithms where costs are based on link metrics. The link metric can be based on static or dynamic quantities. The link metric based on static quantities may be assigned administratively according to local criteria. The link metric based on dynamic quantities may be a function of a network congestion measure such as delay or packet loss.",
      "zh-CHS": "Internet从APARNET发展而来，采用了具有分布式控制的动态路由算法来确定数据包在到达目的地的途中应该走的路径。路由算法是最短路径算法的改进，其中成本基于链路度量。链接度量可以基于静态或动态数量。基于静态量的链路度量可以根据本地标准进行管理分配。基于动态量的链路度量可以是诸如延迟或分组丢失之类的网络拥塞度量的函数。"
    },
    {
      "indent": 3,
      "text": "It was apparent early that static link metric assignment was inadequate because it can easily lead to unfavorable scenarios in which some links become congested while others remain lightly loaded. One of the many reasons for the inadequacy of static link metrics is that link metric assignment was often done without considering the traffic matrix in the network. Also, the routing protocols did not take traffic attributes and capacity constraints into account when making routing decisions. This results in traffic concentration being localized in subsets of the network infrastructure and potentially causing congestion. Even if link metrics are assigned in accordance with the traffic matrix, unbalanced loads in the network can still occur due to a number factors including:",
      "zh-CHS": "很明显，早期的静态链路度量分配是不充分的，因为它很容易导致一些链路变得拥挤而另一些链路保持轻负载的不利情况。静态链路度量不足的一个原因是链路度量分配通常没有考虑网络中的流量矩阵。此外，在做出路由决策时，路由协议没有考虑流量属性和容量限制。这导致流量集中在网络基础设施的子集中，并可能导致拥塞。即使根据流量矩阵分配链路度量，网络中仍可能出现不平衡负载，原因包括："
    },
    {
      "indent": 6,
      "text": "- Resources may not be deployed in the most optimal locations from a routing perspective.",
      "zh-CHS": "- 从路由的角度来看，资源可能不会部署在最佳位置。"
    },
    {
      "indent": 6,
      "text": "- Forecasting errors in traffic volume and/or traffic distribution.",
      "zh-CHS": "- 交通量和/或交通分布的预测误差。"
    },
    {
      "indent": 6,
      "text": "- Dynamics in traffic matrix due to the temporal nature of traffic patterns, BGP policy change from peers, etc.",
      "zh-CHS": "- 由于流量模式的时间性质、来自对等方的BGP策略更改等，流量矩阵中存在动态。"
    },
    {
      "indent": 3,
      "text": "The inadequacy of the legacy Internet interior gateway routing system is one of the factors motivating the interest in path oriented technology with explicit routing and constraint-based routing capability such as MPLS.",
      "zh-CHS": "传统Internet内部网关路由系统的不足是促使人们对具有显式路由和基于约束的路由能力的面向路径技术（如MPLS）感兴趣的因素之一。"
    },
    {
      "indent": 0,
      "text": "4.2.3 ToS Routing",
      "section_title": true,
      "zh-CHS": "4.2.3 ToS路由"
    },
    {
      "indent": 3,
      "text": "Type-of-Service (ToS) routing involves different routes going to the same destination with selection dependent upon the ToS field of an IP packet [RFC-2474]. The ToS classes may be classified as low delay and high throughput. Each link is associated with multiple link costs and each link cost is used to compute routes for a particular ToS. A separate shortest path tree is computed for each ToS. The shortest path algorithm must be run for each ToS resulting in very expensive computation. Classical ToS-based routing is now outdated as the IP header field has been replaced by a Diffserv field. Effective traffic engineering is difficult to perform in classical ToS-based routing because each class still relies exclusively on shortest path routing which results in localization of traffic concentration within the network.",
      "zh-CHS": "服务类型（ToS）路由包括到同一目的地的不同路由，其选择取决于IP数据包的ToS字段[RFC-2474]。ToS类别可分为低延迟和高吞吐量。每个链路与多个链路成本相关联，每个链路成本用于计算特定ToS的路由。为每个ToS计算单独的最短路径树。必须为每个ToS运行最短路径算法，从而导致非常昂贵的计算。传统的基于ToS的路由现在已经过时，因为IP报头字段已被Diffserv字段取代。在传统的基于ToS的路由中很难进行有效的流量工程，因为每一类仍然完全依赖于最短路径路由，这导致网络中的流量集中的局部化。"
    },
    {
      "indent": 0,
      "text": "4.2.4 Equal Cost Multi-Path",
      "section_title": true,
      "zh-CHS": "4.2.4 等成本多路径"
    },
    {
      "indent": 3,
      "text": "Equal Cost Multi-Path (ECMP) is another technique that attempts to address the deficiency in the Shortest Path First (SPF) interior gateway routing systems [RFC-2328]. In the classical SPF algorithm, if two or more shortest paths exist to a given destination, the algorithm will choose one of them. The algorithm is modified slightly in ECMP so that if two or more equal cost shortest paths exist between two nodes, the traffic between the nodes is distributed among the multiple equal-cost paths. Traffic distribution across the equal-cost paths is usually performed in one of two ways: (1) packet-based in a round-robin fashion, or (2) flow-based using hashing on source and destination IP addresses and possibly other fields of the IP header. The first approach can easily cause out-of-order packets while the second approach is dependent upon the number and distribution of flows. Flow-based load sharing may be unpredictable in an enterprise network where the number of flows is relatively small and less heterogeneous (for example, hashing may not be uniform), but it is generally effective in core public networks where the number of flows is large and heterogeneous.",
      "zh-CHS": "等成本多路径（ECMP）是另一种试图解决最短路径优先（SPF）内部网关路由系统的不足的技术[RFC-2328]。在经典的SPF算法中，如果存在到给定目的地的两条或多条最短路径，该算法将选择其中一条。该算法在ECMP中稍作修改，以便在两个节点之间存在两条或多条等成本最短路径时，节点之间的流量分布在多条等成本路径中。在等成本路径上的流量分配通常以两种方式之一执行：（1）以循环方式基于数据包，或（2）使用对源和目标IP地址以及可能的IP报头的其他字段的散列来基于流。第一种方法很容易导致无序数据包，而第二种方法取决于流的数量和分布。基于流的负载共享在企业网络中可能是不可预测的，在企业网络中，流的数量相对较小且异构性较小（例如，散列可能不统一），但它通常在流的数量较大且异构的核心公共网络中有效。"
    },
    {
      "indent": 3,
      "text": "In ECMP, link costs are static and bandwidth constraints are not considered, so ECMP attempts to distribute the traffic as equally as possible among the equal-cost paths independent of the congestion status of each path. As a result, given two equal-cost paths, it is possible that one of the paths will be more congested than the other. Another drawback of ECMP is that load sharing cannot be achieved on multiple paths which have non-identical costs.",
      "zh-CHS": "在ECMP中，链路成本是静态的，并且不考虑带宽约束，因此ECMP尝试在等成本路径之间尽可能平均地分配流量，而不依赖于每条路径的拥塞状态。因此，给定两条成本相等的路径，其中一条路径可能比另一条路径更拥挤。ECMP的另一个缺点是无法在成本不相同的多条路径上实现负载共享。"
    },
    {
      "indent": 0,
      "text": "4.2.5 Nimrod",
      "section_title": true,
      "zh-CHS": "4.2.5 尼姆罗德"
    },
    {
      "indent": 3,
      "text": "Nimrod is a routing system developed to provide heterogeneous service specific routing in the Internet, while taking multiple constraints into account [RFC-1992]. Essentially, Nimrod is a link state routing protocol which supports path oriented packet forwarding. It uses the concept of maps to represent network connectivity and services at multiple levels of abstraction. Mechanisms are provided to allow restriction of the distribution of routing information.",
      "zh-CHS": "Nimrod是一个路由系统，其开发目的是在互联网上提供异构的特定于服务的路由，同时考虑多种约束[RFC-1992]。本质上，Nimrod是一种链路状态路由协议，支持面向路径的数据包转发。它使用地图的概念在多个抽象层次上表示网络连接和服务。提供了允许限制路由信息分布的机制。"
    },
    {
      "indent": 3,
      "text": "Even though Nimrod did not enjoy deployment in the public Internet, a number of key concepts incorporated into the Nimrod architecture, such as explicit routing which allows selection of paths at originating nodes, are beginning to find applications in some recent constraint-based routing initiatives.",
      "zh-CHS": "尽管Nimrod不喜欢在公共互联网上部署，但Nimrod体系结构中的一些关键概念，例如允许在原始节点选择路径的显式路由，开始在一些最近基于约束的路由方案中找到应用。"
    },
    {
      "indent": 0,
      "text": "4.3 Overlay Model",
      "section_title": true,
      "zh-CHS": "4.3 叠加模型"
    },
    {
      "indent": 3,
      "text": "In the overlay model, a virtual-circuit network, such as ATM, frame relay, or WDM, provides virtual-circuit connectivity between routers that are located at the edges of a virtual-circuit cloud. In this mode, two routers that are connected through a virtual circuit see a direct adjacency between themselves independent of the physical route taken by the virtual circuit through the ATM, frame relay, or WDM network. Thus, the overlay model essentially decouples the logical topology that routers see from the physical topology that the ATM, frame relay, or WDM network manages. The overlay model based on ATM or frame relay enables a network administrator or an automaton to employ traffic engineering concepts to perform path optimization by re-configuring or rearranging the virtual circuits so that a virtual circuit on a congested or sub-optimal physical link can be re-routed to a less congested or more optimal one. In the overlay model, traffic engineering is also employed to establish relationships between the traffic management parameters (e.g., PCR, SCR, and MBS for ATM) of the virtual-circuit technology and the actual traffic that traverses each circuit. These relationships can be established based upon known or projected traffic profiles, and some other factors.",
      "zh-CHS": "在覆盖模型中，虚拟电路网络（如ATM、帧中继或WDM）在位于虚拟电路云边缘的路由器之间提供虚拟电路连接。在此模式下，通过虚拟电路连接的两个路由器可以看到它们之间的直接邻接，而与虚拟电路通过ATM、帧中继或WDM网络所采用的物理路由无关。因此，覆盖模型实质上将路由器看到的逻辑拓扑与ATM、帧中继或WDM网络管理的物理拓扑解耦。基于ATM或帧中继的覆盖模型使网络管理员或自动机能够采用流量工程概念，通过重新配置或重新排列虚拟电路来执行路径优化，从而使拥塞或次优物理链路上的虚拟电路可以重新路由到拥塞较少或更优的物理链路。在覆盖模型中，还使用流量工程来建立虚拟电路技术的流量管理参数（例如，PCR、SCR和ATM的MBS）与穿过每个电路的实际流量之间的关系。这些关系可以基于已知或预测的交通状况以及一些其他因素来建立。"
    },
    {
      "indent": 3,
      "text": "The overlay model using IP over ATM requires the management of two separate networks with different technologies (IP and ATM) resulting in increased operational complexity and cost. In the fully-meshed overlay model, each router would peer to every other router in the network, so that the total number of adjacencies is a quadratic function of the number of routers. Some of the issues with the overlay model are discussed in [AWD2].",
      "zh-CHS": "使用IP over ATM的覆盖模型需要使用不同的技术（IP和ATM）管理两个独立的网络，从而增加操作复杂性和成本。在全网格覆盖模型中，每个路由器将与网络中的其他路由器对等，因此邻接的总数是路由器数量的二次函数。[AWD2]中讨论了重叠模型的一些问题。"
    },
    {
      "indent": 0,
      "text": "4.4 Constrained-Based Routing",
      "section_title": true,
      "zh-CHS": "4.4 基于约束的路由"
    },
    {
      "indent": 3,
      "text": "Constraint-based routing refers to a class of routing systems that compute routes through a network subject to the satisfaction of a set of constraints and requirements. In the most general setting, constraint-based routing may also seek to optimize overall network performance while minimizing costs.",
      "zh-CHS": "基于约束的路由是指在满足一组约束和要求的情况下，通过网络计算路由的一类路由系统。在最一般的情况下，基于约束的路由也可能寻求优化整体网络性能，同时最小化成本。"
    },
    {
      "indent": 3,
      "text": "The constraints and requirements may be imposed by the network itself or by administrative policies. Constraints may include bandwidth, hop count, delay, and policy instruments such as resource class attributes. Constraints may also include domain specific attributes of certain network technologies and contexts which impose restrictions on the solution space of the routing function. Path oriented technologies such as MPLS have made constraint-based routing feasible and attractive in public IP networks.",
      "zh-CHS": "约束和要求可能由网络本身或管理政策施加。约束可能包括带宽、跳数、延迟和策略工具，如资源类属性。约束还可能包括某些网络技术和上下文的特定于域的属性，这些属性对路由功能的解决方案空间施加了限制。MPLS等面向路径的技术使得基于约束的路由在公共IP网络中可行且具有吸引力。"
    },
    {
      "indent": 3,
      "text": "The concept of constraint-based routing within the context of MPLS traffic engineering requirements in IP networks was first defined in [RFC-2702].",
      "zh-CHS": "[RFC-2702]首次定义了IP网络中MPLS流量工程要求背景下基于约束的路由概念。"
    },
    {
      "indent": 3,
      "text": "Unlike QoS routing (for example, see [RFC-2386] and [MA]) which generally addresses the issue of routing individual traffic flows to satisfy prescribed flow based QoS requirements subject to network resource availability, constraint-based routing is applicable to traffic aggregates as well as flows and may be subject to a wide variety of constraints which may include policy restrictions.",
      "zh-CHS": "与QoS路由（例如，参见[RFC-2386]和[MA]）不同，QoS路由通常解决路由单个业务流以满足网络资源可用性规定的基于流的QoS要求的问题，基于约束的路由适用于流量聚合和流量，并且可能受到各种约束，包括策略限制。"
    },
    {
      "indent": 0,
      "text": "4.5 Overview of Other IETF Projects Related to Traffic Engineering",
      "section_title": true,
      "zh-CHS": "4.5 与交通工程相关的其他IETF项目概述"
    },
    {
      "indent": 3,
      "text": "This subsection reviews a number of IETF activities pertinent to Internet traffic engineering. These activities are primarily intended to evolve the IP architecture to support new service definitions which allow preferential or differentiated treatment to be accorded to certain types of traffic.",
      "zh-CHS": "本小节回顾了许多与互联网流量工程相关的IETF活动。这些活动的主要目的是发展IP体系结构，以支持新的服务定义，从而允许对某些类型的流量给予优惠或区别对待。"
    },
    {
      "indent": 0,
      "text": "4.5.1 Integrated Services",
      "section_title": true,
      "zh-CHS": "4.5.1 综合服务"
    },
    {
      "indent": 3,
      "text": "The IETF Integrated Services working group developed the integrated services (Intserv) model. This model requires resources, such as bandwidth and buffers, to be reserved a priori for a given traffic flow to ensure that the quality of service requested by the traffic flow is satisfied. The integrated services model includes additional components beyond those used in the best-effort model such as packet classifiers, packet schedulers, and admission control. A packet classifier is used to identify flows that are to receive a certain level of service. A packet scheduler handles the scheduling of",
      "zh-CHS": "IETF综合服务工作组开发了综合服务（Intserv）模型。该模型要求为给定的业务流预先预留带宽和缓冲区等资源，以确保满足业务流所请求的服务质量。集成服务模型包括在尽力而为模型中使用的组件之外的附加组件，例如包分类器、包调度器和准入控制。包分类器用于识别要接收特定服务级别的流。数据包调度器处理数据包的调度"
    },
    {
      "indent": 3,
      "text": "service to different packet flows to ensure that QoS commitments are met. Admission control is used to determine whether a router has the necessary resources to accept a new flow.",
      "zh-CHS": "为不同的数据包流提供服务，以确保满足QoS承诺。接纳控制用于确定路由器是否具有接受新流所需的资源。"
    },
    {
      "indent": 3,
      "text": "Two services have been defined under the Integrated Services model: guaranteed service [RFC-2212] and controlled-load service [RFC-2211].",
      "zh-CHS": "在集成服务模型下定义了两种服务：保证服务[RFC-2212]和控制负载服务[RFC-2211]。"
    },
    {
      "indent": 3,
      "text": "The guaranteed service can be used for applications requiring bounded packet delivery time. For this type of application, data that is delivered to the application after a pre-defined amount of time has elapsed is usually considered worthless. Therefore, guaranteed service was intended to provide a firm quantitative bound on the end-to-end packet delay for a flow. This is accomplished by controlling the queuing delay on network elements along the data flow path. The guaranteed service model does not, however, provide bounds on jitter (inter-arrival times between consecutive packets).",
      "zh-CHS": "保证服务可用于需要有限数据包交付时间的应用程序。对于这种类型的应用程序，在经过预定义的时间后交付给应用程序的数据通常被认为是毫无价值的。因此，保证服务旨在为流的端到端数据包延迟提供一个固定的定量界限。这是通过控制沿数据流路径的网络元件上的排队延迟来实现的。然而，保证服务模型不提供抖动的界限（连续数据包之间的到达时间）。"
    },
    {
      "indent": 3,
      "text": "The controlled-load service can be used for adaptive applications that can tolerate some delay but are sensitive to traffic overload conditions. This type of application typically functions satisfactorily when the network is lightly loaded but its performance degrades significantly when the network is heavily loaded. Controlled-load service, therefore, has been designed to provide approximately the same service as best-effort service in a lightly loaded network regardless of actual network conditions. Controlled-load service is described qualitatively in that no target values of delay or loss are specified.",
      "zh-CHS": "受控负载服务可用于自适应应用程序，这些应用程序可以容忍一些延迟，但对流量过载情况敏感。当网络负载较轻时，这种类型的应用程序通常能令人满意地工作，但当网络负载较重时，其性能会显著下降。因此，受控负载服务被设计为在轻负载网络中提供与尽力而为服务大致相同的服务，而与实际网络条件无关。受控负载服务是定性描述的，没有指定延迟或损失的目标值。"
    },
    {
      "indent": 3,
      "text": "The main issue with the Integrated Services model has been scalability [RFC-2998], especially in large public IP networks which may potentially have millions of active micro-flows in transit concurrently.",
      "zh-CHS": "综合服务模型的主要问题是可伸缩性[RFC-2998]，特别是在大型公共IP网络中，可能有数百万个活动微流同时传输。"
    },
    {
      "indent": 3,
      "text": "A notable feature of the Integrated Services model is that it requires explicit signaling of QoS requirements from end systems to routers [RFC-2753]. The Resource Reservation Protocol (RSVP) performs this signaling function and is a critical component of the Integrated Services model. The RSVP protocol is described next.",
      "zh-CHS": "综合服务模型的一个显著特征是，它需要从终端系统到路由器的QoS需求的显式信令[RFC-2753]。资源预留协议（RSVP）执行此信令功能，是集成服务模型的关键组件。接下来描述RSVP协议。"
    },
    {
      "indent": 0,
      "text": "4.5.2 RSVP",
      "section_title": true,
      "zh-CHS": "4.5.2 冒险类游戏"
    },
    {
      "indent": 3,
      "text": "RSVP is a soft state signaling protocol [RFC-2205]. It supports receiver initiated establishment of resource reservations for both multicast and unicast flows. RSVP was originally developed as a signaling protocol within the integrated services framework for applications to communicate QoS requirements to the network and for the network to reserve relevant resources to satisfy the QoS requirements [RFC-2205].",
      "zh-CHS": "RSVP是一种软状态信令协议[RFC-2205]。它支持由接收方发起的多播和单播流资源预留的建立。RSVP最初是作为综合服务框架内的信令协议开发的，用于应用程序向网络传达QoS要求，并用于网络保留相关资源以满足QoS要求[RFC-2205]。"
    },
    {
      "indent": 3,
      "text": "Under RSVP, the sender or source node sends a PATH message to the receiver with the same source and destination addresses as the traffic which the sender will generate. The PATH message contains: (1) a sender Tspec specifying the characteristics of the traffic, (2) a sender Template specifying the format of the traffic, and (3) an optional Adspec which is used to support the concept of one pass with advertising\" (OPWA) [RFC-2205]. Every intermediate router along the path forwards the PATH Message to the next hop determined by the routing protocol. Upon receiving a PATH Message, the receiver responds with a RESV message which includes a flow descriptor used to request resource reservations. The RESV message travels to the sender or source node in the opposite direction along the path that the PATH message traversed. Every intermediate router along the path can reject or accept the reservation request of the RESV message. If the request is rejected, the rejecting router will send an error message to the receiver and the signaling process will terminate. If the request is accepted, link bandwidth and buffer space are allocated for the flow and the related flow state information is installed in the router.",
      "zh-CHS": "在RSVP下，发送方或源节点向接收方发送一条路径消息，其源地址和目的地址与发送方将生成的通信量相同。PATH消息包含：（1）指定通信量特征的发送方Tspec，（2）指定通信量格式的发送方模板，以及（3）用于支持一次通过广告（OPWA）概念的可选Adspec）[RFC-2205]。路径上的每个中间路由器将路径消息转发到路由协议确定的下一个跃点。在接收到路径消息后，接收器将使用RESV消息进行响应，该消息包括用于请求资源保留的流描述符。RESV消息以相反方向alo发送到发送方或源节点ng路径消息所经过的路径。路径上的每个中间路由器都可以拒绝或接受RESV消息的保留请求。如果请求被拒绝，拒绝的路由器将向接收器发送错误消息，信令过程将终止。如果请求被接受，链路带宽和缓冲区空间将被减少为流分配的和相关的流状态信息安装在路由器中。"
    },
    {
      "indent": 3,
      "text": "One of the issues with the original RSVP specification was Scalability. This is because reservations were required for micro-flows, so that the amount of state maintained by network elements tends to increase linearly with the number of micro-flows. These issues are described in [RFC-2961].",
      "zh-CHS": "原始RSVP规范的一个问题是可伸缩性。这是因为微流需要保留，因此网络元素维护的状态量往往会随着微流的数量线性增加。[RFC-2961]中描述了这些问题。"
    },
    {
      "indent": 3,
      "text": "Recently, RSVP has been modified and extended in several ways to mitigate the scaling problems. As a result, it is becoming a versatile signaling protocol for the Internet. For example, RSVP has been extended to reserve resources for aggregation of flows, to set up MPLS explicit label switched paths, and to perform other signaling functions within the Internet. There are also a number of proposals to reduce the amount of refresh messages required to maintain established RSVP sessions [RFC-2961].",
      "zh-CHS": "最近，RSVP已通过多种方式进行了修改和扩展，以缓解缩放问题。因此，它正在成为一种通用的互联网信令协议。例如，RSVP已被扩展以保留用于流聚合的资源，建立MPLS显式标签交换路径，以及在因特网内执行其他信令功能。还有一些建议可以减少维护已建立的RSVP会话所需的刷新消息量[RFC-2961]。"
    },
    {
      "indent": 3,
      "text": "A number of IETF working groups have been engaged in activities related to the RSVP protocol. These include the original RSVP working group, the MPLS working group, the Resource Allocation Protocol working group, and the Policy Framework working group.",
      "zh-CHS": "一些IETF工作组已经参与了与RSVP协议相关的活动。其中包括最初的RSVP工作组、MPLS工作组、资源分配协议工作组和策略框架工作组。"
    },
    {
      "indent": 0,
      "text": "4.5.3 Differentiated Services",
      "section_title": true,
      "zh-CHS": "4.5.3 差异化服务"
    },
    {
      "indent": 3,
      "text": "The goal of the Differentiated Services (Diffserv) effort within the IETF is to devise scalable mechanisms for categorization of traffic into behavior aggregates, which ultimately allows each behavior aggregate to be treated differently, especially when there is a shortage of resources such as link bandwidth and buffer space [RFC-2475]. One of the primary motivations for the Diffserv effort was to",
      "zh-CHS": "IETF中区分服务（Differentied Services，Diffserv）工作的目标是设计可扩展的机制，将流量分类为行为聚合，最终允许对每个行为聚合进行不同的处理，特别是在链路带宽和缓冲区空间等资源短缺时[RFC-2475]。Diffserv工作的主要动机之一是"
    },
    {
      "indent": 3,
      "text": "devise alternative mechanisms for service differentiation in the Internet that mitigate the scalability issues encountered with the Intserv model.",
      "zh-CHS": "设计Internet中服务差异化的替代机制，以缓解Intserv模型遇到的可伸缩性问题。"
    },
    {
      "indent": 3,
      "text": "The IETF Diffserv working group has defined a Differentiated Services field in the IP header (DS field). The DS field consists of six bits of the part of the IP header formerly known as TOS octet. The DS field is used to indicate the forwarding treatment that a packet should receive at a node [RFC-2474]. The Diffserv working group has also standardized a number of Per-Hop Behavior (PHB) groups. Using the PHBs, several classes of services can be defined using different classification, policing, shaping, and scheduling rules.",
      "zh-CHS": "IETF Diffserv工作组在IP报头（DS字段）中定义了一个区分服务字段。DS字段由以前称为TOS八位字节的IP报头部分的六位组成。DS字段用于指示数据包应在节点处接收的转发处理[RFC-2474]。Diffserv工作组还对一些每跳行为（PHB）组进行了标准化。使用PHB，可以使用不同的分类、管理、成型和调度规则定义多个服务类别。"
    },
    {
      "indent": 3,
      "text": "For an end-user of network services to receive Differentiated Services from its Internet Service Provider (ISP), it may be necessary for the user to have a Service Level Agreement (SLA) with the ISP. An SLA may explicitly or implicitly specify a Traffic Conditioning Agreement (TCA) which defines classifier rules as well as metering, marking, discarding, and shaping rules.",
      "zh-CHS": "为了使网络服务的最终用户从其互联网服务提供商（ISP）处获得差异化服务，用户可能需要与ISP签订服务水平协议（SLA）。SLA可以显式或隐式地指定流量调节协议（TCA），该协议定义了分类器规则以及计量、标记、丢弃和成形规则。"
    },
    {
      "indent": 3,
      "text": "Packets are classified, and possibly policed and shaped at the ingress to a Diffserv network. When a packet traverses the boundary between different Diffserv domains, the DS field of the packet may be re-marked according to existing agreements between the domains.",
      "zh-CHS": "数据包在进入Diffserv网络时被分类，并可能被管理和成形。当分组穿过不同区分服务域之间的边界时，分组的DS字段可以根据域之间的现有协议重新标记。"
    },
    {
      "indent": 3,
      "text": "Differentiated Services allows only a finite number of service classes to be indicated by the DS field. The main advantage of the Diffserv approach relative to the Intserv model is scalability. Resources are allocated on a per-class basis and the amount of state information is proportional to the number of classes rather than to the number of application flows.",
      "zh-CHS": "区分服务只允许DS字段指示有限数量的服务类。与Intserv模型相比，Diffserv方法的主要优点是可伸缩性。资源是按类分配的，状态信息的数量与类的数量成比例，而不是与应用程序流的数量成比例。"
    },
    {
      "indent": 3,
      "text": "It should be obvious from the previous discussion that the Diffserv model essentially deals with traffic management issues on a per hop basis. The Diffserv control model consists of a collection of micro-TE control mechanisms. Other traffic engineering capabilities, such as capacity management (including routing control), are also required in order to deliver acceptable service quality in Diffserv networks. The concept of Per Domain Behaviors has been introduced to better capture the notion of differentiated services across a complete domain [RFC-3086].",
      "zh-CHS": "从前面的讨论中可以明显看出，Diffserv模型基本上是在每跳的基础上处理流量管理问题。Diffserv控制模型由一系列micro TE控制机制组成。为了在区分服务网络中提供可接受的服务质量，还需要其他流量工程能力，例如容量管理（包括路由控制）。引入了每域行为的概念，以更好地捕捉跨完整域的差异化服务的概念[RFC-3086]。"
    },
    {
      "indent": 0,
      "text": "4.5.4 MPLS",
      "section_title": true,
      "zh-CHS": "4.5.4 MPLS"
    },
    {
      "indent": 3,
      "text": "MPLS is an advanced forwarding scheme which also includes extensions to conventional IP control plane protocols. MPLS extends the Internet routing model and enhances packet forwarding and path control [RFC-3031].",
      "zh-CHS": "MPLS是一种先进的转发方案，它还包括对传统IP控制平面协议的扩展。MPLS扩展了Internet路由模型，增强了数据包转发和路径控制[RFC-3031]。"
    },
    {
      "indent": 3,
      "text": "At the ingress to an MPLS domain, label switching routers (LSRs) classify IP packets into forwarding equivalence classes (FECs) based on a variety of factors, including, e.g., a combination of the information carried in the IP header of the packets and the local routing information maintained by the LSRs. An MPLS label is then prepended to each packet according to their forwarding equivalence classes. In a non-ATM/FR environment, the label is 32 bits long and contains a 20-bit label field, a 3-bit experimental field (formerly known as Class-of-Service or CoS field), a 1-bit label stack indicator and an 8-bit TTL field. In an ATM (FR) environment, the label consists of information encoded in the VCI/VPI (DLCI) field. An MPLS capable router (an LSR) examines the label and possibly the experimental field and uses this information to make packet forwarding decisions.",
      "zh-CHS": "在进入MPLS域时，标签交换路由器（lsr）基于多种因素将IP分组分类为转发等价类（fec），包括例如分组的IP报头中携带的信息和由lsr维护的本地路由信息的组合。然后，根据每个数据包的转发等价类，在其前面加上MPLS标签。在非ATM/FR环境中，标签长度为32位，包含20位标签字段、3位实验字段（以前称为服务类别或CoS字段）、1位标签堆栈指示符和8位TTL字段。在ATM（FR）环境中，标签由VCI/VPI（DLCI）字段中编码的信息组成。支持MPLS的路由器（LSR）检查标签，可能还有实验场，并使用这些信息做出数据包转发决策。"
    },
    {
      "indent": 3,
      "text": "An LSR makes forwarding decisions by using the label prepended to packets as the index into a local next hop label forwarding entry (NHLFE). The packet is then processed as specified in the NHLFE. The incoming label may be replaced by an outgoing label, and the packet may be switched to the next LSR. This label-switching process is very similar to the label (VCI/VPI) swapping process in ATM networks. Before a packet leaves an MPLS domain, its MPLS label may be removed. A Label Switched Path (LSP) is the path between an ingress LSRs and an egress LSRs through which a labeled packet traverses. The path of an explicit LSP is defined at the originating (ingress) node of the LSP. MPLS can use a signaling protocol such as RSVP or LDP to set up LSPs.",
      "zh-CHS": "LSR通过使用包前面的标签作为本地下一跳标签转发条目（NHLFE）的索引来做出转发决策。然后按照NHLFE中的规定处理数据包。传入标签可以被传出标签替换，并且分组可以切换到下一个LSR。这种标签交换过程与ATM网络中的标签（VCI/VPI）交换过程非常相似。在数据包离开MPLS域之前，可以移除其MPLS标签。标签交换路径（LSP）是入口LSR和出口LSR之间的路径，标签分组通过该路径进行遍历。显式LSP的路径在LSP的起始（入口）节点处定义。MPLS可以使用诸如RSVP或LDP之类的信令协议来设置LSP。"
    },
    {
      "indent": 3,
      "text": "MPLS is a very powerful technology for Internet traffic engineering because it supports explicit LSPs which allow constraint-based routing to be implemented efficiently in IP networks [AWD2]. The requirements for traffic engineering over MPLS are described in [RFC-2702]. Extensions to RSVP to support instantiation of explicit LSP are discussed in [RFC-3209]. Extensions to LDP, known as CR-LDP, to support explicit LSPs are presented in [JAM].",
      "zh-CHS": "MPLS是一种非常强大的互联网流量工程技术，因为它支持显式LSP，允许在IP网络中高效地实现基于约束的路由[AWD2]。[RFC-2702]中描述了MPLS流量工程的要求。[RFC-3209]中讨论了支持显式LSP实例化的RSVP扩展。[JAM]中介绍了LDP的扩展，称为CR-LDP，以支持显式LSP。"
    },
    {
      "indent": 0,
      "text": "4.5.5 IP Performance Metrics",
      "section_title": true,
      "zh-CHS": "4.5.5 IP性能指标"
    },
    {
      "indent": 3,
      "text": "The IETF IP Performance Metrics (IPPM) working group has been developing a set of standard metrics that can be used to monitor the quality, performance, and reliability of Internet services. These metrics can be applied by network operators, end-users, and independent testing groups to provide users and service providers with a common understanding of the performance and reliability of the Internet component 'clouds' they use/provide [RFC-2330]. The criteria for performance metrics developed by the IPPM WG are described in [RFC-2330]. Examples of performance metrics include one-way packet",
      "zh-CHS": "IETF IP性能度量（IPPM）工作组一直在开发一套标准度量，用于监控互联网服务的质量、性能和可靠性。这些指标可由网络运营商、最终用户和独立测试组应用，以向用户和服务提供商提供对其使用/提供的互联网组件“云”的性能和可靠性的共同理解[RFC-2330]。IPPM工作组制定的性能指标标准见[RFC-2330]。性能指标的示例包括单向数据包"
    },
    {
      "indent": 3,
      "text": "loss [RFC-2680], one-way delay [RFC-2679], and connectivity measures between two nodes [RFC-2678]. Other metrics include second-order measures of packet loss and delay.",
      "zh-CHS": "丢失[RFC-2680]、单向延迟[RFC-2679]和两个节点之间的连接性度量[RFC-2678]。其他指标包括包丢失和延迟的二阶度量。"
    },
    {
      "indent": 3,
      "text": "Some of the performance metrics specified by the IPPM WG are useful for specifying Service Level Agreements (SLAs). SLAs are sets of service level objectives negotiated between users and service providers, wherein each objective is a combination of one or more performance metrics, possibly subject to certain constraints.",
      "zh-CHS": "IPPM工作组指定的一些性能指标对于指定服务级别协议（SLA）非常有用。SLA是用户和服务提供商之间协商的一组服务级别目标，其中每个目标是一个或多个性能指标的组合，可能受到某些约束。"
    },
    {
      "indent": 0,
      "text": "4.5.6 Flow Measurement",
      "section_title": true,
      "zh-CHS": "4.5.6 流量测量"
    },
    {
      "indent": 3,
      "text": "The IETF Real Time Flow Measurement (RTFM) working group has produced an architecture document defining a method to specify traffic flows as well as a number of components for flow measurement (meters, meter readers, manager) [RFC-2722]. A flow measurement system enables network traffic flows to be measured and analyzed at the flow level for a variety of purposes. As noted in RFC 2722, a flow measurement system can be very useful in the following contexts: (1) understanding the behavior of existing networks, (2) planning for network development and expansion, (3) quantification of network performance, (4) verifying the quality of network service, and (5) attribution of network usage to users.",
      "zh-CHS": "IETF实时流量测量（RTFM）工作组编制了一份体系结构文件，该文件定义了指定交通流的方法以及流量测量的许多组件（仪表、仪表读数器、管理器）[RFC-2722]。流量测量系统能够在流量级别测量和分析网络流量，以实现各种目的。如RFC 2722所述，流量测量系统在以下情况下非常有用：（1）了解现有网络的行为；（2）网络开发和扩展的规划；（3）网络性能的量化；（4）验证网络服务的质量；（5）将网络使用归因于用户。"
    },
    {
      "indent": 3,
      "text": "A flow measurement system consists of meters, meter readers, and managers. A meter observes packets passing through a measurement point, classifies them into certain groups, accumulates certain usage data (such as the number of packets and bytes for each group), and stores the usage data in a flow table. A group may represent a user application, a host, a network, a group of networks, etc. A meter reader gathers usage data from various meters so it can be made available for analysis. A manager is responsible for configuring and controlling meters and meter readers. The instructions received by a meter from a manager include flow specification, meter control parameters, and sampling techniques. The instructions received by a meter reader from a manager include the address of the meter whose date is to be collected, the frequency of data collection, and the types of flows to be collected.",
      "zh-CHS": "流量测量系统由仪表、仪表读数器和管理器组成。仪表观察通过测量点的数据包，将其划分为特定的组，积累特定的使用数据（例如每个组的数据包数和字节数），并将使用数据存储在流量表中。一个组可以代表一个用户应用程序、一个主机、一个网络、一组网络等。仪表读取器从各种仪表收集使用数据，以便进行分析。管理人员负责配置和控制仪表和仪表读卡器。仪表从经理处收到的指令包括流量规格、仪表控制参数和取样技术。抄表器从管理人员处接收到的指令包括要采集日期的仪表地址、数据采集频率以及要采集的流量类型。"
    },
    {
      "indent": 0,
      "text": "4.5.7 Endpoint Congestion Management",
      "section_title": true,
      "zh-CHS": "4.5.7 端点拥塞管理"
    },
    {
      "indent": 3,
      "text": "[RFC-3124] is intended to provide a set of congestion control mechanisms that transport protocols can use. It is also intended to develop mechanisms for unifying congestion control across a subset of an endpoint's active unicast connections (called a congestion group). A congestion manager continuously monitors the state of the path for",
      "zh-CHS": "[RFC-3124]旨在提供一组传输协议可以使用的拥塞控制机制。它还旨在开发跨端点的活动单播连接子集（称为拥塞组）统一拥塞控制的机制。拥塞管理器持续监视路径的状态，以便"
    },
    {
      "indent": 3,
      "text": "each congestion group under its control. The manager uses that information to instruct a scheduler on how to partition bandwidth among the connections of that congestion group.",
      "zh-CHS": "每个拥塞组都在其控制下。管理器使用该信息指导调度器如何在该拥塞组的连接之间划分带宽。"
    },
    {
      "indent": 0,
      "text": "4.6 Overview of ITU Activities Related to Traffic Engineering",
      "section_title": true,
      "zh-CHS": "4.6 国际电联与交通工程有关的活动概述"
    },
    {
      "indent": 3,
      "text": "This section provides an overview of prior work within the ITU-T pertaining to traffic engineering in traditional telecommunications networks.",
      "zh-CHS": "本节概述了ITU-T中有关传统电信网络流量工程的先前工作。"
    },
    {
      "indent": 3,
      "text": "ITU-T Recommendations E.600 [ITU-E600], E.701 [ITU-E701], and E.801 [ITU-E801] address traffic engineering issues in traditional telecommunications networks. Recommendation E.600 provides a vocabulary for describing traffic engineering concepts, while E.701 defines reference connections, Grade of Service (GOS), and traffic parameters for ISDN. Recommendation E.701 uses the concept of a reference connection to identify representative cases of different types of connections without describing the specifics of their actual realizations by different physical means. As defined in Recommendation E.600, \"a connection is an association of resources providing means for communication between two or more devices in, or attached to, a telecommunication network.\" Also, E.600 defines \"a resource as any set of physically or conceptually identifiable entities within a telecommunication network, the use of which can be unambiguously determined\" [ITU-E600]. There can be different types of connections as the number and types of resources in a connection may vary.",
      "zh-CHS": "ITU-T建议E.600[ITU-E600]、E.701[ITU-E701]和E.801[ITU-E801]解决了传统电信网络中的流量工程问题。建议E.600提供了描述流量工程概念的词汇表，而E.701定义了ISDN的参考连接、服务等级（GOS）和流量参数。建议E.701使用参考连接的概念来识别不同类型连接的代表性案例，而不描述其通过不同物理手段实际实现的具体情况。如建议E.600所定义，“连接是资源的关联，为电信网络中或连接到电信网络的两个或多个设备之间的通信提供手段。”此外，E.600还定义了“资源是指电信网络中物理或概念上可识别的实体的任何集合，其使用可以明确确定”[ITU-E600]。由于连接中资源的数量和类型可能不同，因此可以有不同类型的连接。"
    },
    {
      "indent": 3,
      "text": "Typically, different network segments are involved in the path of a connection. For example, a connection may be local, national, or international. The purposes of reference connections are to clarify and specify traffic performance issues at various interfaces between different network domains. Each domain may consist of one or more service provider networks.",
      "zh-CHS": "通常，连接路径涉及不同的网段。例如，连接可以是本地、国家或国际连接。参考连接的目的是澄清和指定不同网络域之间各种接口的流量性能问题。每个域可以由一个或多个服务提供商网络组成。"
    },
    {
      "indent": 3,
      "text": "Reference connections provide a basis to define grade of service (GoS) parameters related to traffic engineering within the ITU-T framework. As defined in E.600, \"GoS refers to a number of traffic engineering variables which are used to provide a measure of the adequacy of a group of resources under specified conditions.\" These GoS variables may be probability of loss, dial tone, delay, etc. They are essential for network internal design and operation as well as for component performance specification.",
      "zh-CHS": "参考连接为定义ITU-T框架内与流量工程相关的服务等级（GoS）参数提供了基础。如E.600中所定义，“GoS是指许多交通工程变量，用于在规定条件下提供一组资源充足性的度量。”这些GoS变量可能是丢失概率、拨号音、延迟、，它们对于网络内部设计和操作以及组件性能规范都是必不可少的。"
    },
    {
      "indent": 3,
      "text": "GoS is different from quality of service (QoS) in the ITU framework. QoS is the performance perceivable by a telecommunication service user and expresses the user's degree of satisfaction of the service. QoS parameters focus on performance aspects observable at the service",
      "zh-CHS": "GoS不同于ITU框架中的服务质量（QoS）。QoS是电信服务用户可感知的性能，表示用户对服务的满意度。QoS参数侧重于服务中可观察到的性能方面"
    },
    {
      "indent": 3,
      "text": "access points and network interfaces, rather than their causes within the network. GoS, on the other hand, is a set of network oriented measures which characterize the adequacy of a group of resources under specified conditions. For a network to be effective in serving its users, the values of both GoS and QoS parameters must be related, with GoS parameters typically making a major contribution to the QoS.",
      "zh-CHS": "接入点和网络接口，而不是它们在网络中的原因。另一方面，GoS是一组面向网络的度量，它描述了一组资源在特定条件下的充分性。为了使网络能够有效地为其用户服务，GoS和QoS参数的值必须是相关的，其中GoS参数通常对QoS做出重大贡献。"
    },
    {
      "indent": 3,
      "text": "Recommendation E.600 stipulates that a set of GoS parameters must be selected and defined on an end-to-end basis for each major service category provided by a network to assist the network provider with improving efficiency and effectiveness of the network. Based on a selected set of reference connections, suitable target values are assigned to the selected GoS parameters under normal and high load conditions. These end-to-end GoS target values are then apportioned to individual resource components of the reference connections for dimensioning purposes.",
      "zh-CHS": "建议E.600规定，必须在端到端的基础上为网络提供的每个主要服务类别选择和定义一组GoS参数，以帮助网络供应商提高网络的效率和有效性。根据选定的一组参考连接，在正常和高负载条件下，为选定的GoS参数指定合适的目标值。然后将这些端到端GoS目标值分配给参考连接的各个资源组件，以进行尺寸标注。"
    },
    {
      "indent": 0,
      "text": "4.7 Content Distribution",
      "section_title": true,
      "zh-CHS": "4.7 内容分布"
    },
    {
      "indent": 3,
      "text": "The Internet is dominated by client-server interactions, especially Web traffic (in the future, more sophisticated media servers may become dominant). The location and performance of major information servers has a significant impact on the traffic patterns within the Internet as well as on the perception of service quality by end users.",
      "zh-CHS": "互联网主要由客户机-服务器交互，特别是网络流量（在未来，更复杂的媒体服务器可能成为主导）。主要信息服务器的位置和性能对互联网内的流量模式以及最终用户对服务质量的感知有重大影响。"
    },
    {
      "indent": 3,
      "text": "A number of dynamic load balancing techniques have been devised to improve the performance of replicated information servers. These techniques can cause spatial traffic characteristics to become more dynamic in the Internet because information servers can be dynamically picked based upon the location of the clients, the location of the servers, the relative utilization of the servers, the relative performance of different networks, and the relative performance of different parts of a network. This process of assignment of distributed servers to clients is called Traffic Directing. It functions at the application layer.",
      "zh-CHS": "已经设计了许多动态负载平衡技术来提高复制信息服务器的性能。这些技术可以使互联网中的空间流量特征变得更加动态，因为可以根据客户端的位置、服务器的位置、服务器的相对利用率、不同网络的相对性能动态选择信息服务器，以及网络不同部分的相对性能。这种将分布式服务器分配给客户端的过程称为流量定向。它在应用层起作用。"
    },
    {
      "indent": 3,
      "text": "Traffic Directing schemes that allocate servers in multiple geographically dispersed locations to clients may require empirical network performance statistics to make more effective decisions. In the future, network measurement systems may need to provide this type of information. The exact parameters needed are not yet defined.",
      "zh-CHS": "将位于多个地理位置分散的服务器分配给客户端的流量定向方案可能需要经验网络性能统计数据，以做出更有效的决策。未来，网络测量系统可能需要提供此类信息。所需的确切参数尚未确定。"
    },
    {
      "indent": 3,
      "text": "When congestion exists in the network, Traffic Directing and Traffic Engineering systems should act in a coordinated manner. This topic is for further study.",
      "zh-CHS": "当网络中存在拥塞时，交通指挥和交通工程系统应协调行动。本课题有待进一步研究。"
    },
    {
      "indent": 3,
      "text": "The issues related to location and replication of information servers, particularly web servers, are important for Internet traffic engineering because these servers contribute a substantial proportion of Internet traffic.",
      "zh-CHS": "与信息服务器（尤其是web服务器）的位置和复制相关的问题对于Internet流量工程非常重要，因为这些服务器占Internet流量的很大一部分。"
    },
    {
      "indent": 0,
      "text": "5.0 Taxonomy of Traffic Engineering Systems",
      "section_title": true,
      "zh-CHS": "5.0 交通工程系统分类"
    },
    {
      "indent": 3,
      "text": "This section presents a short taxonomy of traffic engineering systems. A taxonomy of traffic engineering systems can be constructed based on traffic engineering styles and views as listed below:",
      "zh-CHS": "本节介绍交通工程系统的简短分类。交通工程系统的分类可以基于交通工程样式和视图构建，如下所示："
    },
    {
      "indent": 6,
      "text": "- Time-dependent vs State-dependent vs Event-dependent - Offline vs Online - Centralized vs Distributed - Local vs Global Information - Prescriptive vs Descriptive - Open Loop vs Closed Loop - Tactical vs Strategic",
      "zh-CHS": "- 时间相关与状态相关与事件相关-离线与在线-集中与分布式-本地与全局信息-说明性与描述性-开环与闭环-战术与战略"
    },
    {
      "indent": 3,
      "text": "These classification systems are described in greater detail in the following subsections of this document.",
      "zh-CHS": "这些分类系统在本文件的以下小节中有更详细的描述。"
    },
    {
      "indent": 0,
      "text": "5.1 Time-Dependent Versus State-Dependent Versus Event Dependent",
      "section_title": true,
      "zh-CHS": "5.1 时间相关与状态相关与事件相关"
    },
    {
      "indent": 3,
      "text": "Traffic engineering methodologies can be classified as time-dependent, or state-dependent, or event-dependent. All TE schemes are considered to be dynamic in this document. Static TE implies that no traffic engineering methodology or algorithm is being applied.",
      "zh-CHS": "交通工程方法可分为时间相关、状态相关或事件相关。本文件认为所有TE方案都是动态的。静态TE意味着没有应用任何流量工程方法或算法。"
    },
    {
      "indent": 3,
      "text": "In the time-dependent TE, historical information based on periodic variations in traffic, (such as time of day), is used to pre-program routing plans and other TE control mechanisms. Additionally, customer subscription or traffic projection may be used. Pre-programmed routing plans typically change on a relatively long time scale (e.g., diurnal). Time-dependent algorithms do not attempt to adapt to random variations in traffic or changing network conditions. An example of a time-dependent algorithm is a global centralized optimizer where the input to the system is a traffic matrix and multi-class QoS requirements as described [MR99].",
      "zh-CHS": "在与时间相关的TE中，基于流量周期性变化的历史信息（如一天中的时间）用于预编程路由计划和其他TE控制机制。此外，还可以使用客户订阅或流量预测。预先编程的路由计划通常在相对较长的时间尺度上发生变化（例如，昼间）。依赖于时间的算法不会试图适应流量的随机变化或不断变化的网络条件。时间相关算法的一个示例是全局集中式优化器，其中系统的输入是流量矩阵和所述的多类QoS要求[MR99]。"
    },
    {
      "indent": 3,
      "text": "State-dependent TE adapts the routing plans for packets based on the current state of the network. The current state of the network provides additional information on variations in actual traffic (i.e., perturbations from regular variations) that could not be predicted using historical information. Constraint-based routing is",
      "zh-CHS": "状态相关TE根据网络的当前状态调整数据包的路由计划。网络的当前状态提供了无法使用历史信息预测的实际流量变化（即，常规变化引起的扰动）的附加信息。基于约束的路由是"
    },
    {
      "indent": 3,
      "text": "an example of state-dependent TE operating in a relatively long time scale. An example operating in a relatively short time scale is a load-balancing algorithm described in [MATE].",
      "zh-CHS": "状态相关TE在相对较长的时间范围内运行的示例。在相对较短的时间范围内运行的一个示例是[MATE]中描述的负载平衡算法。"
    },
    {
      "indent": 3,
      "text": "The state of the network can be based on parameters such as utilization, packet delay, packet loss, etc. These parameters can be obtained in several ways. For example, each router may flood these parameters periodically or by means of some kind of trigger to other routers. Another approach is for a particular router performing adaptive TE to send probe packets along a path to gather the state of that path. Still another approach is for a management system to gather relevant information from network elements.",
      "zh-CHS": "网络状态可以基于诸如利用率、数据包延迟、数据包丢失等参数。这些参数可以通过多种方式获得。例如，每个路由器可以周期性地或通过某种触发器向其他路由器泛洪这些参数。另一种方法是由执行自适应TE的特定路由器沿路径发送探测包以收集该路径的状态。还有一种方法是管理系统从网络元素收集相关信息。"
    },
    {
      "indent": 3,
      "text": "Expeditious and accurate gathering and distribution of state information is critical for adaptive TE due to the dynamic nature of network conditions. State-dependent algorithms may be applied to increase network efficiency and resilience. Time-dependent algorithms are more suitable for predictable traffic variations. On the other hand, state-dependent algorithms are more suitable for adapting to the prevailing network state.",
      "zh-CHS": "由于网络条件的动态性质，快速准确地收集和分发状态信息对于自适应TE至关重要。状态相关算法可用于提高网络效率和恢复能力。时间相关算法更适用于可预测的流量变化。另一方面，状态相关算法更适合于适应当前的网络状态。"
    },
    {
      "indent": 3,
      "text": "Event-dependent TE methods can also be used for TE path selection. Event-dependent TE methods are distinct from time-dependent and state-dependent TE methods in the manner in which paths are selected. These algorithms are adaptive and distributed in nature and typically use learning models to find good paths for TE in a network. While state-dependent TE models typically use available-link-bandwidth (ALB) flooding for TE path selection, event-dependent TE methods do not require ALB flooding. Rather, event-dependent TE methods typically search out capacity by learning models, as in the success-to-the-top (STT) method. ALB flooding can be resource intensive, since it requires link bandwidth to carry LSAs, processor capacity to process LSAs, and the overhead can limit area/autonomous system (AS) size. Modeling results suggest that event-dependent TE methods could lead to a reduction in ALB flooding overhead without loss of network throughput performance [ASH3].",
      "zh-CHS": "事件相关TE方法也可用于TE路径选择。事件相关TE方法在路径选择方式上不同于时间相关和状态相关TE方法。这些算法本质上是自适应和分布式的，通常使用学习模型为网络中的TE找到良好的路径。虽然状态相关TE模型通常使用可用链路带宽（ALB）泛洪进行TE路径选择，但事件相关TE方法不需要ALB泛洪。相反，事件相关的TE方法通常通过学习模型来搜索容量，如成功到顶部（STT）方法。ALB泛洪可能是资源密集型的，因为它需要链路带宽来承载LSA，处理器容量来处理LSA，并且开销会限制区域/自治系统（AS）的大小。建模结果表明，事件相关TE方法可以在不损失网络吞吐量性能的情况下降低ALB泛洪开销[ASH3]。"
    },
    {
      "indent": 0,
      "text": "5.2 Offline Versus Online",
      "section_title": true,
      "zh-CHS": "5.2 离线与在线"
    },
    {
      "indent": 3,
      "text": "Traffic engineering requires the computation of routing plans. The computation may be performed offline or online. The computation can be done offline for scenarios where routing plans need not be executed in real-time. For example, routing plans computed from forecast information may be computed offline. Typically, offline computation is also used to perform extensive searches on multi-dimensional solution spaces.",
      "zh-CHS": "交通工程要求计算路线计划。计算可以离线或在线执行。对于不需要实时执行路由计划的场景，可以脱机进行计算。例如，根据预测信息计算的路由计划可以离线计算。通常，脱机计算也用于在多维解空间上执行广泛的搜索。"
    },
    {
      "indent": 3,
      "text": "Online computation is required when the routing plans must adapt to changing network conditions as in state-dependent algorithms. Unlike offline computation (which can be computationally demanding), online computation is geared toward relative simple and fast calculations to select routes, fine-tune the allocations of resources, and perform load balancing.",
      "zh-CHS": "与状态相关算法一样，当路由计划必须适应不断变化的网络条件时，需要进行在线计算。与离线计算（可能需要计算）不同，在线计算面向相对简单和快速的计算，以选择路由、微调资源分配和执行负载平衡。"
    },
    {
      "indent": 0,
      "text": "5.3 Centralized Versus Distributed",
      "section_title": true,
      "zh-CHS": "5.3 集中式与分布式"
    },
    {
      "indent": 3,
      "text": "Centralized control has a central authority which determines routing plans and perhaps other TE control parameters on behalf of each router. The central authority collects the network-state information from all routers periodically and returns the routing information to the routers. The routing update cycle is a critical parameter directly impacting the performance of the network being controlled. Centralized control may need high processing power and high bandwidth control channels.",
      "zh-CHS": "集中式控制有一个中央机构，它代表每个路由器确定路由计划和其他TE控制参数。中央机构定期从所有路由器收集网络状态信息，并将路由信息返回给路由器。路由更新周期是直接影响被控制网络性能的关键参数。集中控制可能需要高处理能力和高带宽控制通道。"
    },
    {
      "indent": 3,
      "text": "Distributed control determines route selection by each router autonomously based on the routers view of the state of the network. The network state information may be obtained by the router using a probing method or distributed by other routers on a periodic basis using link state advertisements. Network state information may also be disseminated under exceptional conditions.",
      "zh-CHS": "分布式控制根据路由器对网络状态的查看自主地确定每个路由器的路由选择。网络状态信息可以由路由器使用探测方法获得，或者由其他路由器使用链路状态广告定期分发。在特殊情况下，也可以传播网络状态信息。"
    },
    {
      "indent": 0,
      "text": "5.4 Local Versus Global",
      "section_title": true,
      "zh-CHS": "5.4 本地与全球"
    },
    {
      "indent": 3,
      "text": "Traffic engineering algorithms may require local or global network-state information.",
      "zh-CHS": "流量工程算法可能需要本地或全局网络状态信息。"
    },
    {
      "indent": 3,
      "text": "Local information pertains to the state of a portion of the domain. Examples include the bandwidth and packet loss rate of a particular path. Local state information may be sufficient for certain instances of distributed-controlled TEs.",
      "zh-CHS": "本地信息与域的一部分的状态有关。示例包括特定路径的带宽和分组丢失率。局部状态信息可能足以用于分布式控制TE的某些实例。"
    },
    {
      "indent": 3,
      "text": "Global information pertains to the state of the entire domain undergoing traffic engineering. Examples include a global traffic matrix and loading information on each link throughout the domain of interest. Global state information is typically required with centralized control. Distributed TE systems may also need global information in some cases.",
      "zh-CHS": "全局信息涉及正在进行流量工程的整个域的状态。示例包括全局流量矩阵和在整个感兴趣领域的每个链路上加载信息。集中控制通常需要全局状态信息。分布式TE系统在某些情况下也可能需要全局信息。"
    },
    {
      "indent": 0,
      "text": "5.5 Prescriptive Versus Descriptive",
      "section_title": true,
      "zh-CHS": "5.5 规定性与描述性"
    },
    {
      "indent": 3,
      "text": "TE systems may also be classified as prescriptive or descriptive.",
      "zh-CHS": "TE系统也可分为规定性或描述性。"
    },
    {
      "indent": 3,
      "text": "Prescriptive traffic engineering evaluates alternatives and recommends a course of action. Prescriptive traffic engineering can be further categorized as either corrective or perfective. Corrective TE prescribes a course of action to address an existing or predicted anomaly. Perfective TE prescribes a course of action to evolve and improve network performance even when no anomalies are evident.",
      "zh-CHS": "规定性交通工程评估备选方案并建议行动方案。规定性交通工程可进一步分为纠正性交通工程和完善性交通工程。纠正性TE规定了解决现有或预测异常的行动方案。Perfective TE规定了一个行动过程，以改进网络性能，即使在没有明显异常的情况下。"
    },
    {
      "indent": 3,
      "text": "Descriptive traffic engineering, on the other hand, characterizes the state of the network and assesses the impact of various policies without recommending any particular course of action.",
      "zh-CHS": "另一方面，描述性流量工程描述网络的状态，并评估各种政策的影响，而不建议任何特定的行动方案。"
    },
    {
      "indent": 0,
      "text": "5.6 Open-Loop Versus Closed-Loop",
      "section_title": true,
      "zh-CHS": "5.6 开环与闭环"
    },
    {
      "indent": 3,
      "text": "Open-loop traffic engineering control is where control action does not use feedback information from the current network state. The control action may use its own local information for accounting purposes, however.",
      "zh-CHS": "开环流量工程控制是指控制操作不使用来自当前网络状态的反馈信息。然而，控制行动可将其自身的本地信息用于会计目的。"
    },
    {
      "indent": 3,
      "text": "Closed-loop traffic engineering control is where control action utilizes feedback information from the network state. The feedback information may be in the form of historical information or current measurement.",
      "zh-CHS": "闭环流量工程控制是指控制行动利用来自网络状态的反馈信息。反馈信息可以是历史信息或当前测量的形式。"
    },
    {
      "indent": 0,
      "text": "5.7 Tactical vs Strategic",
      "section_title": true,
      "zh-CHS": "5.7 战术vs战略"
    },
    {
      "indent": 3,
      "text": "Tactical traffic engineering aims to address specific performance problems (such as hot-spots) that occur in the network from a tactical perspective, without consideration of overall strategic imperatives. Without proper planning and insights, tactical TE tends to be ad hoc in nature.",
      "zh-CHS": "战术流量工程旨在从战术角度解决网络中出现的特定性能问题（如热点），而不考虑总体战略需求。如果没有适当的计划和见解，战术TE往往是临时性的。"
    },
    {
      "indent": 3,
      "text": "Strategic traffic engineering approaches the TE problem from a more organized and systematic perspective, taking into consideration the immediate and longer term consequences of specific policies and actions.",
      "zh-CHS": "战略交通工程从更有组织、更有系统的角度处理TE问题，同时考虑到具体政策和行动的直接和长期后果。"
    },
    {
      "indent": 0,
      "text": "6.0 Recommendations for Internet Traffic Engineering",
      "section_title": true,
      "zh-CHS": "6.0 互联网流量工程建议"
    },
    {
      "indent": 3,
      "text": "This section describes high level recommendations for traffic engineering in the Internet. These recommendations are presented in general terms.",
      "zh-CHS": "本节介绍互联网流量工程的高级建议。这些建议是概括提出的。"
    },
    {
      "indent": 3,
      "text": "The recommendations describe the capabilities needed to solve a traffic engineering problem or to achieve a traffic engineering objective. Broadly speaking, these recommendations can be categorized as either functional and non-functional recommendations.",
      "zh-CHS": "这些建议描述了解决交通工程问题或实现交通工程目标所需的能力。广义而言，这些建议可分为功能性建议和非功能性建议。"
    },
    {
      "indent": 3,
      "text": "Functional recommendations for Internet traffic engineering describe the functions that a traffic engineering system should perform. These functions are needed to realize traffic engineering objectives by addressing traffic engineering problems.",
      "zh-CHS": "Internet流量工程的功能建议描述了流量工程系统应执行的功能。这些功能是通过解决交通工程问题来实现交通工程目标所必需的。"
    },
    {
      "indent": 3,
      "text": "Non-functional recommendations for Internet traffic engineering relate to the quality attributes or state characteristics of a traffic engineering system. These recommendations may contain conflicting assertions and may sometimes be difficult to quantify precisely.",
      "zh-CHS": "互联网流量工程的非功能性建议与流量工程系统的质量属性或状态特征有关。这些建议可能包含相互冲突的断言，有时可能难以精确量化。"
    },
    {
      "indent": 0,
      "text": "6.1 Generic Non-functional Recommendations",
      "section_title": true,
      "zh-CHS": "6.1 一般性非功能性建议"
    },
    {
      "indent": 3,
      "text": "The generic non-functional recommendations for Internet traffic engineering include: usability, automation, scalability, stability, visibility, simplicity, efficiency, reliability, correctness, maintainability, extensibility, interoperability, and security. In a given context, some of these recommendations may be critical while others may be optional. Therefore, prioritization may be required during the development phase of a traffic engineering system (or components thereof) to tailor it to a specific operational context.",
      "zh-CHS": "互联网流量工程的通用非功能性建议包括：可用性、自动化、可扩展性、稳定性、可视性、简单性、效率、可靠性、正确性、可维护性、可扩展性、互操作性和安全性。在给定的环境中，其中一些建议可能是关键的，而另一些建议可能是可选的。因此，在交通工程系统（或其组件）的开发阶段，可能需要进行优先级排序，以使其适应特定的运营环境。"
    },
    {
      "indent": 3,
      "text": "In the following paragraphs, some of the aspects of the non-functional recommendations for Internet traffic engineering are summarized.",
      "zh-CHS": "在以下段落中，总结了互联网流量工程非功能性建议的一些方面。"
    },
    {
      "indent": 3,
      "text": "Usability: Usability is a human factor aspect of traffic engineering systems. Usability refers to the ease with which a traffic engineering system can be deployed and operated. In general, it is desirable to have a TE system that can be readily deployed in an existing network. It is also desirable to have a TE system that is easy to operate and maintain.",
      "zh-CHS": "可用性：可用性是交通工程系统的人为因素。可用性是指交通工程系统部署和运行的容易程度。一般来说，希望具有可在现有网络中容易部署的TE系统。还希望具有易于操作和维护的TE系统。"
    },
    {
      "indent": 3,
      "text": "Automation: Whenever feasible, a traffic engineering system should automate as many traffic engineering functions as possible to minimize the amount of human effort needed to control and analyze operational networks. Automation is particularly imperative in large scale public networks because of the high cost of the human aspects of network operations and the high risk of network problems caused by human errors. Automation may entail the incorporation of automatic feedback and intelligence into some components of the traffic engineering system.",
      "zh-CHS": "自动化：只要可行，交通工程系统应尽可能多地自动化交通工程功能，以尽量减少控制和分析运营网络所需的人力。在大规模公共网络中，自动化尤为必要，因为网络运营的人为成本很高，人为错误导致网络问题的风险也很高。自动化可能需要将自动反馈和智能纳入交通工程系统的某些组件中。"
    },
    {
      "indent": 3,
      "text": "Scalability: Contemporary public networks are growing very fast with respect to network size and traffic volume. Therefore, a TE system should be scalable to remain applicable as the network evolves. In particular, a TE system should remain functional as the network expands with regard to the number of routers and links, and with",
      "zh-CHS": "可扩展性：当代公共网络在网络规模和通信量方面发展非常迅速。因此，TE系统应具有可扩展性，以便随着网络的发展保持适用性。特别是，TE系统应在网络扩展到路由器和链路的数量时保持功能，并且"
    },
    {
      "indent": 3,
      "text": "respect to the traffic volume. A TE system should have a scalable architecture, should not adversely impair other functions and processes in a network element, and should not consume too much network resources when collecting and distributing state information or when exerting control.",
      "zh-CHS": "关于交通量。TE系统应具有可扩展的体系结构，不应对网元中的其他功能和进程产生不利影响，并且在收集和分发状态信息或施加控制时不应消耗太多的网络资源。"
    },
    {
      "indent": 3,
      "text": "Stability: Stability is a very important consideration in traffic engineering systems that respond to changes in the state of the network. State-dependent traffic engineering methodologies typically mandate a tradeoff between responsiveness and stability. It is strongly recommended that when tradeoffs are warranted between responsiveness and stability, that the tradeoff should be made in favor of stability (especially in public IP backbone networks).",
      "zh-CHS": "稳定性：在响应网络状态变化的流量工程系统中，稳定性是一个非常重要的考虑因素。依赖于状态的流量工程方法通常要求在响应性和稳定性之间进行权衡。强烈建议在保证响应性和稳定性之间进行权衡时，应做出有利于稳定性的权衡（尤其是在公共IP骨干网络中）。"
    },
    {
      "indent": 3,
      "text": "Flexibility: A TE system should be flexible to allow for changes in optimization policy. In particular, a TE system should provide sufficient configuration options so that a network administrator can tailor the TE system to a particular environment. It may also be desirable to have both online and offline TE subsystems which can be independently enabled and disabled. TE systems that are used in multi-class networks should also have options to support class based performance evaluation and optimization.",
      "zh-CHS": "灵活性：TE系统应具有灵活性，以允许优化策略的更改。特别是，TE系统应提供足够的配置选项，以便网络管理员可以根据特定环境定制TE系统。也可能需要在线和离线TE子系统，它们可以独立启用和禁用。在多类网络中使用的TE系统还应具有支持基于类的性能评估和优化的选项。"
    },
    {
      "indent": 3,
      "text": "Visibility: As part of the TE system, mechanisms should exist to collect statistics from the network and to analyze these statistics to determine how well the network is functioning. Derived statistics such as traffic matrices, link utilization, latency, packet loss, and other performance measures of interest which are determined from network measurements can be used as indicators of prevailing network conditions. Other examples of status information which should be observed include existing functional routing information (additionally, in the context of MPLS existing LSP routes), etc.",
      "zh-CHS": "可见性：作为TE系统的一部分，应该存在从网络收集统计数据并分析这些统计数据以确定网络运行状况的机制。根据网络测量确定的流量矩阵、链路利用率、延迟、数据包丢失和其他感兴趣的性能度量等衍生统计数据可以用作当前网络状况的指标。应观察的状态信息的其他示例包括现有功能路由信息（另外，在MPLS现有LSP路由的上下文中）等。"
    },
    {
      "indent": 3,
      "text": "Simplicity: Generally, a TE system should be as simple as possible. More importantly, the TE system should be relatively easy to use (i.e., clean, convenient, and intuitive user interfaces). Simplicity in user interface does not necessarily imply that the TE system will use naive algorithms. When complex algorithms and internal structures are used, such complexities should be hidden as much as possible from the network administrator through the user interface.",
      "zh-CHS": "简单性：一般来说，TE系统应该尽可能简单。更重要的是，TE系统应该相对易于使用（即干净、方便和直观的用户界面）。用户界面的简单性并不一定意味着TE系统将使用朴素的算法。当使用复杂的算法和内部结构时，应通过用户界面尽可能向网络管理员隐藏此类复杂性。"
    },
    {
      "indent": 3,
      "text": "Interoperability: Whenever feasible, traffic engineering systems and their components should be developed with open standards based interfaces to allow interoperation with other systems and components.",
      "zh-CHS": "互操作性：只要可行，交通工程系统及其组件应使用基于开放标准的接口进行开发，以允许与其他系统和组件进行互操作。"
    },
    {
      "indent": 3,
      "text": "Security: Security is a critical consideration in traffic engineering systems. Such traffic engineering systems typically exert control over certain functional aspects of the network to achieve the desired",
      "zh-CHS": "安全性：安全性是交通工程系统中的一个重要考虑因素。此类流量工程系统通常对网络的某些功能方面施加控制，以实现所需的流量"
    },
    {
      "indent": 3,
      "text": "performance objectives. Therefore, adequate measures must be taken to safeguard the integrity of the traffic engineering system. Adequate measures must also be taken to protect the network from vulnerabilities that originate from security breaches and other impairments within the traffic engineering system.",
      "zh-CHS": "业绩目标。因此，必须采取足够的措施来维护交通工程系统的完整性。还必须采取适当措施，保护网络免受来自安全漏洞和流量工程系统内其他损害的漏洞的影响。"
    },
    {
      "indent": 3,
      "text": "The remainder of this section will focus on some of the high level functional recommendations for traffic engineering.",
      "zh-CHS": "本节剩余部分将重点介绍交通工程的一些高级功能建议。"
    },
    {
      "indent": 0,
      "text": "6.2 Routing Recommendations",
      "section_title": true,
      "zh-CHS": "6.2 路由建议"
    },
    {
      "indent": 3,
      "text": "Routing control is a significant aspect of Internet traffic engineering. Routing impacts many of the key performance measures associated with networks, such as throughput, delay, and utilization. Generally, it is very difficult to provide good service quality in a wide area network without effective routing control. A desirable routing system is one that takes traffic characteristics and network constraints into account during route selection while maintaining stability.",
      "zh-CHS": "路由控制是互联网流量工程的一个重要方面。路由影响许多与网络相关的关键性能指标，如吞吐量、延迟和利用率。通常，如果没有有效的路由控制，很难在广域网中提供良好的服务质量。理想的路由系统是在路由选择过程中考虑流量特性和网络约束，同时保持稳定性的系统。"
    },
    {
      "indent": 3,
      "text": "Traditional shortest path first (SPF) interior gateway protocols are based on shortest path algorithms and have limited control capabilities for traffic engineering [RFC-2702, AWD2]. These limitations include :",
      "zh-CHS": "传统的最短路径优先（SPF）内部网关协议基于最短路径算法，对流量工程的控制能力有限[RFC-2702，AWD2]。这些限制包括："
    },
    {
      "indent": 3,
      "text": "1. The well known issues with pure SPF protocols, which do not take network constraints and traffic characteristics into account during route selection. For example, since IGPs always use the shortest paths (based on administratively assigned link metrics) to forward traffic, load sharing cannot be accomplished among paths of different costs. Using shortest paths to forward traffic conserves network resources, but may cause the following problems: 1) If traffic from a source to a destination exceeds the capacity of a link along the shortest path, the link (hence the shortest path) becomes congested while a longer path between these two nodes may be under-utilized; 2) the shortest paths from different sources can overlap at some links. If the total traffic from the sources exceeds the capacity of any of these links, congestion will occur. Problems can also occur because traffic demand changes over time but network topology and routing configuration cannot be changed as rapidly. This causes the network topology and routing configuration to become sub-optimal over time, which may result in persistent congestion problems.",
      "zh-CHS": "1. 纯SPF协议的众所周知的问题，在路由选择过程中没有考虑网络约束和流量特性。例如，由于IGP始终使用最短路径（基于管理分配的链路度量）转发流量，因此无法在不同成本的路径之间实现负载共享。使用最短路径转发流量可以节省网络资源，但可能会导致以下问题：1）如果从源到目的地的流量超过沿最短路径的链路容量，则链路（因此最短路径）会变得拥挤，而这两个节点之间的较长路径可能未得到充分利用；2） 来自不同来源的最短路径可能在某些链路上重叠。如果来源的总流量超过任何一条链路的容量，就会发生拥塞。问题也可能发生，因为流量需求会随着时间的推移而变化，但网络拓扑和路由配置的变化不能如此迅速。这会导致网络拓扑和路由配置随着时间的推移变得次优，这可能会导致持久的拥塞问题。"
    },
    {
      "indent": 3,
      "text": "2. The Equal-Cost Multi-Path (ECMP) capability of SPF IGPs supports sharing of traffic among equal cost paths between two nodes. However, ECMP attempts to divide the traffic as equally as possible among the equal cost shortest paths. Generally, ECMP",
      "zh-CHS": "2. SPF IGPs的等成本多路径（ECMP）功能支持在两个节点之间的等成本路径之间共享流量。然而，ECMP试图在成本相等的最短路径中尽可能平均地分配流量。一般来说，ECMP"
    },
    {
      "indent": 6,
      "text": "does not support configurable load sharing ratios among equal cost paths. The result is that one of the paths may carry significantly more traffic than other paths because it may also carry traffic from other sources. This situation can result in congestion along the path that carries more traffic.",
      "zh-CHS": "不支持在相同成本路径之间配置负载共享比率。结果是，其中一条路径可能比其他路径承载更多的流量，因为它也可能承载来自其他来源的流量。这种情况可能会导致沿承载更多交通量的路径的拥堵。"
    },
    {
      "indent": 3,
      "text": "3. Modifying IGP metrics to control traffic routing tends to have network-wide effect. Consequently, undesirable and unanticipated traffic shifts can be triggered as a result. Recent work described in Section 8.0 may be capable of better control [FT00, FT01].",
      "zh-CHS": "3. 修改IGP度量来控制流量路由往往会产生网络范围的影响。因此，可能会触发不期望和意外的交通转移。第8.0节中描述的近期工作可能能够更好地控制[FT00，FT01]。"
    },
    {
      "indent": 3,
      "text": "Because of these limitations, new capabilities are needed to enhance the routing function in IP networks. Some of these capabilities have been described elsewhere and are summarized below.",
      "zh-CHS": "由于这些限制，需要新的功能来增强IP网络中的路由功能。其中一些功能已在其他地方进行了描述，总结如下。"
    },
    {
      "indent": 3,
      "text": "Constraint-based routing is desirable to evolve the routing architecture of IP networks, especially public IP backbones with complex topologies [RFC-2702]. Constraint-based routing computes routes to fulfill requirements subject to constraints. Constraints may include bandwidth, hop count, delay, and administrative policy instruments such as resource class attributes [RFC-2702, RFC-2386]. This makes it possible to select routes that satisfy a given set of requirements subject to network and administrative policy constraints. Routes computed through constraint-based routing are not necessarily the shortest paths. Constraint-based routing works best with path oriented technologies that support explicit routing, such as MPLS.",
      "zh-CHS": "基于约束的路由有助于发展IP网络的路由体系结构，特别是具有复杂拓扑结构的公共IP主干网[RFC-2702]。基于约束的路由计算路由以满足受约束的需求。约束可能包括带宽、跳数、延迟和管理策略工具，如资源类属性[RFC-2702、RFC-2386]。这使得选择满足给定需求集的路由成为可能，这些需求受网络和管理策略约束。通过基于约束的路由计算的路由不一定是最短路径。基于约束的路由最适合于支持显式路由的面向路径技术，如MPLS。"
    },
    {
      "indent": 3,
      "text": "Constraint-based routing can also be used as a way to redistribute traffic onto the infrastructure (even for best effort traffic). For example, if the bandwidth requirements for path selection and reservable bandwidth attributes of network links are appropriately defined and configured, then congestion problems caused by uneven traffic distribution may be avoided or reduced. In this way, the performance and efficiency of the network can be improved.",
      "zh-CHS": "基于约束的路由也可以用作将流量重新分配到基础设施上的一种方式（即使对于尽力而为的流量）。例如，如果适当地定义和配置了用于路径选择的带宽要求和网络链路的可保留带宽属性，则可以避免或减少由不均匀业务分布引起的拥塞问题。这样可以提高网络的性能和效率。"
    },
    {
      "indent": 3,
      "text": "A number of enhancements are needed to conventional link state IGPs, such as OSPF and IS-IS, to allow them to distribute additional state information required for constraint-based routing. These extensions to OSPF were described in [KATZ] and to IS-IS in [SMIT]. Essentially, these enhancements require the propagation of additional information in link state advertisements. Specifically, in addition to normal link-state information, an enhanced IGP is required to propagate topology state information needed for constraint-based routing. Some of the additional topology state information include link attributes such as reservable bandwidth and link resource class attribute (an administratively specified property of the link). The",
      "zh-CHS": "需要对传统链路状态IGP（如OSPF和IS-IS）进行许多增强，以允许它们分发基于约束的路由所需的附加状态信息。[KATZ]中描述了OSPF的这些扩展，[SMIT]中描述了IS-IS的这些扩展。本质上，这些增强需要在链接状态广告中传播附加信息。具体而言，除了正常链路状态信息外，还需要增强的IGP来传播基于约束的路由所需的拓扑状态信息。一些附加拓扑状态信息包括链路属性，例如可保留带宽和链路资源类属性（链路的管理指定属性）。这个"
    },
    {
      "indent": 3,
      "text": "resource class attribute concept was defined in [RFC-2702]. The additional topology state information is carried in new TLVs and sub-TLVs in IS-IS, or in the Opaque LSA in OSPF [SMIT, KATZ].",
      "zh-CHS": "[RFC-2702]中定义了资源类属性概念。附加的拓扑状态信息在is-is中的新TLV和子TLV中携带，或在OSPF[SMIT，KATZ]中的不透明LSA中携带。"
    },
    {
      "indent": 3,
      "text": "An enhanced link-state IGP may flood information more frequently than a normal IGP. This is because even without changes in topology, changes in reservable bandwidth or link affinity can trigger the enhanced IGP to initiate flooding. A tradeoff is typically required between the timeliness of the information flooded and the flooding frequency to avoid excessive consumption of link bandwidth and computational resources, and more importantly, to avoid instability.",
      "zh-CHS": "增强链路状态IGP可能比正常IGP更频繁地泛洪信息。这是因为即使拓扑结构没有变化，可保留带宽或链路亲和力的变化也会触发增强型IGP启动泛洪。通常需要在被淹没信息的及时性和淹没频率之间进行权衡，以避免链路带宽和计算资源的过度消耗，更重要的是，避免不稳定。"
    },
    {
      "indent": 3,
      "text": "In a TE system, it is also desirable for the routing subsystem to make the load splitting ratio among multiple paths (with equal cost or different cost) configurable. This capability gives network administrators more flexibility in the control of traffic distribution across the network. It can be very useful for avoiding/relieving congestion in certain situations. Examples can be found in [XIAO].",
      "zh-CHS": "在TE系统中，路由子系统还需要使多条路径（具有相同成本或不同成本）之间的负载分割比率可配置。此功能使网络管理员能够更灵活地控制网络中的流量分布。在某些情况下，它对于避免/缓解拥堵非常有用。例子可以在[XIAO]中找到。"
    },
    {
      "indent": 3,
      "text": "The routing system should also have the capability to control the routes of subsets of traffic without affecting the routes of other traffic if sufficient resources exist for this purpose. This capability allows a more refined control over the distribution of traffic across the network. For example, the ability to move traffic from a source to a destination away from its original path to another path (without affecting other traffic paths) allows traffic to be moved from resource-poor network segments to resource-rich segments. Path oriented technologies such as MPLS inherently support this capability as discussed in [AWD2].",
      "zh-CHS": "如果有足够的资源用于此目的，则路由系统还应能够在不影响其他流量路由的情况下控制流量子集的路由。此功能允许对网络上的流量分布进行更精确的控制。例如，能够将流量从源移动到目的地，使其从原始路径移动到另一路径（而不影响其他流量路径），从而允许将流量从资源贫乏的网段移动到资源丰富的网段。如[AWD2]所述，MPLS等面向路径的技术本质上支持此功能。"
    },
    {
      "indent": 3,
      "text": "Additionally, the routing subsystem should be able to select different paths for different classes of traffic (or for different traffic behavior aggregates) if the network supports multiple classes of service (different behavior aggregates).",
      "zh-CHS": "此外，如果网络支持多个服务类别（不同行为聚合），则路由子系统应能够为不同类别的流量（或不同的流量行为聚合）选择不同的路径。"
    },
    {
      "indent": 0,
      "text": "6.3 Traffic Mapping Recommendations",
      "section_title": true,
      "zh-CHS": "6.3 交通地图建议"
    },
    {
      "indent": 3,
      "text": "Traffic mapping pertains to the assignment of traffic workload onto pre-established paths to meet certain requirements. Thus, while constraint-based routing deals with path selection, traffic mapping deals with the assignment of traffic to established paths which may have been selected by constraint-based routing or by some other means. Traffic mapping can be performed by time-dependent or state-dependent mechanisms, as described in Section 5.1.",
      "zh-CHS": "流量映射是指将流量工作负载分配到预先建立的路径上，以满足某些要求。因此，当基于约束的路由处理路径选择时，流量映射处理将流量分配到可能已通过基于约束的路由或某些其他方式选择的已建立路径。如第5.1节所述，流量映射可通过时间相关或状态相关机制执行。"
    },
    {
      "indent": 3,
      "text": "An important aspect of the traffic mapping function is the ability to establish multiple paths between an originating node and a destination node, and the capability to distribute the traffic between the two nodes across the paths according to some policies. A pre-condition for this scheme is the existence of flexible mechanisms to partition traffic and then assign the traffic partitions onto the parallel paths. This requirement was noted in [RFC-2702]. When traffic is assigned to multiple parallel paths, it is recommended that special care should be taken to ensure proper ordering of packets belonging to the same application (or micro-flow) at the destination node of the parallel paths.",
      "zh-CHS": "流量映射功能的一个重要方面是能够在发起节点和目的节点之间建立多条路径，以及能够根据一些策略在两个节点之间跨路径分配流量。该方案的一个先决条件是存在灵活的机制来划分流量，然后将流量分区分配到并行路径上。该要求在[RFC-2702]中有说明。当将通信量分配给多个并行路径时，建议特别注意确保在并行路径的目的节点处对属于同一应用程序（或微流）的数据包进行正确排序。"
    },
    {
      "indent": 3,
      "text": "As a general rule, mechanisms that perform the traffic mapping functions should aim to map the traffic onto the network infrastructure to minimize congestion. If the total traffic load cannot be accommodated, or if the routing and mapping functions cannot react fast enough to changing traffic conditions, then a traffic mapping system may rely on short time scale congestion control mechanisms (such as queue management, scheduling, etc.) to mitigate congestion. Thus, mechanisms that perform the traffic mapping functions should complement existing congestion control mechanisms. In an operational network, it is generally desirable to map the traffic onto the infrastructure such that intra-class and inter-class resource contention are minimized.",
      "zh-CHS": "作为一般规则，执行流量映射功能的机制应旨在将流量映射到网络基础设施上，以最小化拥塞。如果无法容纳总流量负载，或者如果路由和映射功能不能对不断变化的流量条件作出足够快的反应，则流量映射系统可以依赖短时间尺度的拥塞控制机制（例如队列管理、调度等）来缓解拥塞。因此，执行流量映射功能的机制应该补充现有的拥塞控制机制。在操作网络中，通常希望将通信量映射到基础设施上，以使类内和类间资源争用最小化。"
    },
    {
      "indent": 3,
      "text": "When traffic mapping techniques that depend on dynamic state feedback (e.g., MATE and such like) are used, special care must be taken to guarantee network stability.",
      "zh-CHS": "当使用依赖于动态状态反馈（如MATE等）的流量映射技术时，必须特别注意保证网络的稳定性。"
    },
    {
      "indent": 0,
      "text": "6.4 Measurement Recommendations",
      "section_title": true,
      "zh-CHS": "6.4 计量建议"
    },
    {
      "indent": 3,
      "text": "The importance of measurement in traffic engineering has been discussed throughout this document. Mechanisms should be provided to measure and collect statistics from the network to support the traffic engineering function. Additional capabilities may be needed to help in the analysis of the statistics. The actions of these mechanisms should not adversely affect the accuracy and integrity of the statistics collected. The mechanisms for statistical data acquisition should also be able to scale as the network evolves.",
      "zh-CHS": "本文件中讨论了交通工程中测量的重要性。应提供测量和收集网络统计数据的机制，以支持流量工程功能。可能需要额外的能力来帮助分析统计数据。这些机制的行动不应对所收集统计数据的准确性和完整性产生不利影响。统计数据采集机制也应该能够随着网络的发展而扩展。"
    },
    {
      "indent": 3,
      "text": "Traffic statistics may be classified according to long-term or short-term time scales. Long-term time scale traffic statistics are very useful for traffic engineering. Long-term time scale traffic statistics may capture or reflect periodicity in network workload (such as hourly, daily, and weekly variations in traffic profiles) as well as traffic trends. Aspects of the monitored traffic statistics may also depict class of service characteristics for a network supporting multiple classes of service. Analysis of the long-term",
      "zh-CHS": "交通统计数据可根据长期或短期时间尺度进行分类。长期时间尺度交通统计对于交通工程非常有用。长期时间尺度流量统计数据可以捕获或反映网络工作负载的周期性（如流量分布的每小时、每天和每周变化）以及流量趋势。所监视的业务统计的方面还可以描述支持多个服务类别的网络的服务类别特征。长期风险分析"
    },
    {
      "indent": 3,
      "text": "traffic statistics MAY yield secondary statistics such as busy hour characteristics, traffic growth patterns, persistent congestion problems, hot-spot, and imbalances in link utilization caused by routing anomalies.",
      "zh-CHS": "流量统计可能产生次要统计信息，如繁忙时间特征、流量增长模式、持续拥塞问题、热点以及路由异常导致的链路利用不平衡。"
    },
    {
      "indent": 3,
      "text": "A mechanism for constructing traffic matrices for both long-term and short-term traffic statistics should be in place. In multi-service IP networks, the traffic matrices may be constructed for different service classes. Each element of a traffic matrix represents a statistic of traffic flow between a pair of abstract nodes. An abstract node may represent a router, a collection of routers, or a site in a VPN.",
      "zh-CHS": "应建立一种为长期和短期交通统计数据构建交通矩阵的机制。在多业务IP网络中，可以为不同的业务类别构造业务矩阵。流量矩阵的每个元素表示一对抽象节点之间的流量统计。抽象节点可以表示VPN中的路由器、路由器集合或站点。"
    },
    {
      "indent": 3,
      "text": "Measured traffic statistics should provide reasonable and reliable indicators of the current state of the network on the short-term scale. Some short term traffic statistics may reflect link utilization and link congestion status. Examples of congestion indicators include excessive packet delay, packet loss, and high resource utilization. Examples of mechanisms for distributing this kind of information include SNMP, probing techniques, FTP, IGP link state advertisements, etc.",
      "zh-CHS": "测量的流量统计数据应提供合理可靠的短期网络当前状态指标。一些短期流量统计数据可能反映链路利用率和链路拥塞状态。拥塞指示器的示例包括过度的分组延迟、分组丢失和高资源利用率。分发此类信息的机制示例包括SNMP、探测技术、FTP、IGP链路状态公告等。"
    },
    {
      "indent": 0,
      "text": "6.5 Network Survivability",
      "section_title": true,
      "zh-CHS": "6.5 网络生存性"
    },
    {
      "indent": 3,
      "text": "Network survivability refers to the capability of a network to maintain service continuity in the presence of faults. This can be accomplished by promptly recovering from network impairments and maintaining the required QoS for existing services after recovery. Survivability has become an issue of great concern within the Internet community due to the increasing demands to carry mission critical traffic, real-time traffic, and other high priority traffic over the Internet. Survivability can be addressed at the device level by developing network elements that are more reliable; and at the network level by incorporating redundancy into the architecture, design, and operation of networks. It is recommended that a philosophy of robustness and survivability should be adopted in the architecture, design, and operation of traffic engineering that control IP networks (especially public IP networks). Because different contexts may demand different levels of survivability, the mechanisms developed to support network survivability should be flexible so that they can be tailored to different needs.",
      "zh-CHS": "网络生存能力是指网络在出现故障时保持服务连续性的能力。这可以通过迅速从网络损伤中恢复并在恢复后为现有服务保持所需的QoS来实现。生存性已经成为互联网社区中一个非常关注的问题，因为在互联网上承载任务关键流量、实时流量和其他高优先级流量的需求不断增加。通过开发更可靠的网元，可以在设备级别解决生存能力问题；在网络层面，通过将冗余纳入网络的体系结构、设计和操作。建议在控制IP网络（特别是公共IP网络）的流量工程的架构、设计和运行中采用健壮性和生存性的理念。由于不同的环境可能需要不同级别的生存能力，因此为支持网络生存能力而开发的机制应该是灵活的，以便能够根据不同的需求进行定制。"
    },
    {
      "indent": 3,
      "text": "Failure protection and restoration capabilities have become available from multiple layers as network technologies have continued to improve. At the bottom of the layered stack, optical networks are now capable of providing dynamic ring and mesh restoration functionality at the wavelength level as well as traditional protection functionality. At the SONET/SDH layer survivability",
      "zh-CHS": "随着网络技术的不断改进，故障保护和恢复功能已从多个层面提供。在分层堆栈的底部，光网络现在能够在波长级别提供动态环网恢复功能以及传统保护功能。在SONET/SDH层的生存能力"
    },
    {
      "indent": 3,
      "text": "capability is provided with Automatic Protection Switching (APS) as well as self-healing ring and mesh architectures. Similar functionality is provided by layer 2 technologies such as ATM (generally with slower mean restoration times). Rerouting is traditionally used at the IP layer to restore service following link and node outages. Rerouting at the IP layer occurs after a period of routing convergence which may require seconds to minutes to complete. Some new developments in the MPLS context make it possible to achieve recovery at the IP layer prior to convergence [SHAR].",
      "zh-CHS": "该功能具有自动保护切换（APS）以及自愈环和网状结构。类似的功能由第2层技术（如ATM）提供（通常平均恢复时间较慢）。传统上，IP层使用重路由来恢复链路和节点中断后的服务。IP层的重新路由发生在路由聚合一段时间之后，可能需要几秒钟到几分钟才能完成。MPLS环境中的一些新发展使得在融合之前在IP层实现恢复成为可能[SHAR]。"
    },
    {
      "indent": 3,
      "text": "To support advanced survivability requirements, path-oriented technologies such a MPLS can be used to enhance the survivability of IP networks in a potentially cost effective manner. The advantages of path oriented technologies such as MPLS for IP restoration becomes even more evident when class based protection and restoration capabilities are required.",
      "zh-CHS": "为了支持高级生存能力需求，可以使用面向路径的技术（如MPLS）以潜在的经济高效的方式增强IP网络的生存能力。当需要基于类的保护和恢复功能时，面向路径的技术（如用于IP恢复的MPLS）的优势变得更加明显。"
    },
    {
      "indent": 3,
      "text": "Recently, a common suite of control plane protocols has been proposed for both MPLS and optical transport networks under the acronym Multi-protocol Lambda Switching [AWD1]. This new paradigm of Multi-protocol Lambda Switching will support even more sophisticated mesh restoration capabilities at the optical layer for the emerging IP over WDM network architectures.",
      "zh-CHS": "最近，针对MPLS和光传输网络提出了一套通用的控制平面协议，简称为多协议Lambda交换[AWD1]。这种新的多协议Lambda交换模式将在光层为新兴的IP over WDM网络架构支持更复杂的网格恢复功能。"
    },
    {
      "indent": 3,
      "text": "Another important aspect regarding multi-layer survivability is that technologies at different layers provide protection and restoration capabilities at different temporal granularities (in terms of time scales) and at different bandwidth granularity (from packet-level to wavelength level). Protection and restoration capabilities can also be sensitive to different service classes and different network utility models.",
      "zh-CHS": "关于多层生存能力的另一个重要方面是，不同层的技术在不同的时间粒度（时间尺度）和不同的带宽粒度（从数据包级别到波长级别）下提供保护和恢复能力。保护和恢复功能还可能对不同的服务类别和不同的网络实用新型敏感。"
    },
    {
      "indent": 3,
      "text": "The impact of service outages varies significantly for different service classes depending upon the effective duration of the outage. The duration of an outage can vary from milliseconds (with minor service impact) to seconds (with possible call drops for IP telephony and session time-outs for connection oriented transactions) to minutes and hours (with potentially considerable social and business impact).",
      "zh-CHS": "根据停机的有效持续时间，不同服务类别的服务停机影响差异很大。中断的持续时间可以从毫秒（对服务影响较小）到秒（IP电话可能会掉线，面向连接的事务可能会超时）再到分钟和小时（可能会对社会和业务产生相当大的影响）。"
    },
    {
      "indent": 3,
      "text": "Coordinating different protection and restoration capabilities across multiple layers in a cohesive manner to ensure network survivability is maintained at reasonable cost is a challenging task. Protection and restoration coordination across layers may not always be feasible, because networks at different layers may belong to different administrative domains.",
      "zh-CHS": "以一致的方式跨多个层协调不同的保护和恢复能力，以确保以合理的成本维护网络生存能力，这是一项具有挑战性的任务。跨层的保护和恢复协调可能并不总是可行的，因为不同层的网络可能属于不同的管理域。"
    },
    {
      "indent": 3,
      "text": "The following paragraphs present some of the general recommendations for protection and restoration coordination.",
      "zh-CHS": "以下各段提出了关于保护和恢复协调的一些一般性建议。"
    },
    {
      "indent": 3,
      "text": "- Protection and restoration capabilities from different layers should be coordinated whenever feasible and appropriate to provide network survivability in a flexible and cost effective manner. Minimization of function duplication across layers is one way to achieve the coordination. Escalation of alarms and other fault indicators from lower to higher layers may also be performed in a coordinated manner. A temporal order of restoration trigger timing at different layers is another way to coordinate multi-layer protection/restoration.",
      "zh-CHS": "- 在可行和适当的情况下，应协调不同层的保护和恢复能力，以灵活和经济高效的方式提供网络生存能力。最大限度地减少跨层的功能重复是实现协调的一种方法。警报和其他故障指示器从低层向高层的升级也可以以协调的方式进行。不同层的恢复触发时序的时间顺序是协调多层保护/恢复的另一种方式。"
    },
    {
      "indent": 3,
      "text": "- Spare capacity at higher layers is often regarded as working traffic at lower layers. Placing protection/restoration functions in many layers may increase redundancy and robustness, but it should not result in significant and avoidable inefficiencies in network resource utilization.",
      "zh-CHS": "- 较高层的备用容量通常被视为较低层的工作流量。在许多层中放置保护/恢复功能可能会增加冗余和健壮性，但这不应导致网络资源利用率的显著且可避免的低效。"
    },
    {
      "indent": 3,
      "text": "- It is generally desirable to have protection and restoration schemes that are bandwidth efficient.",
      "zh-CHS": "- 通常希望具有带宽效率高的保护和恢复方案。"
    },
    {
      "indent": 3,
      "text": "- Failure notification throughout the network should be timely and reliable.",
      "zh-CHS": "- 整个网络的故障通知应及时可靠。"
    },
    {
      "indent": 3,
      "text": "- Alarms and other fault monitoring and reporting capabilities should be provided at appropriate layers.",
      "zh-CHS": "- 应在适当层提供警报和其他故障监测和报告功能。"
    },
    {
      "indent": 0,
      "text": "6.5.1 Survivability in MPLS Based Networks",
      "section_title": true,
      "zh-CHS": "6.5.1 MPLS网络的生存性"
    },
    {
      "indent": 3,
      "text": "MPLS is an important emerging technology that enhances IP networks in terms of features, capabilities, and services. Because MPLS is path-oriented, it can potentially provide faster and more predictable protection and restoration capabilities than conventional hop by hop routed IP systems. This subsection describes some of the basic aspects and recommendations for MPLS networks regarding protection and restoration. See [SHAR] for a more comprehensive discussion on MPLS based recovery.",
      "zh-CHS": "MPLS是一项重要的新兴技术，它在功能、能力和服务方面增强了IP网络。由于MPLS是面向路径的，因此它可能比传统的逐跳路由IP系统提供更快、更可预测的保护和恢复能力。本小节介绍了MPLS网络在保护和恢复方面的一些基本方面和建议。有关基于MPLS的恢复的更全面的讨论，请参见[SHAR]。"
    },
    {
      "indent": 3,
      "text": "Protection types for MPLS networks can be categorized as link protection, node protection, path protection, and segment protection.",
      "zh-CHS": "MPLS网络的保护类型可分为链路保护、节点保护、路径保护和段保护。"
    },
    {
      "indent": 3,
      "text": "- Link Protection: The objective for link protection is to protect an LSP from a given link failure. Under link protection, the path of the protection or backup LSP (the secondary LSP) is disjoint from the path of the working or operational LSP at the particular link over which protection is required. When the protected link fails, traffic on the working LSP is switched over to the",
      "zh-CHS": "- 链路保护：链路保护的目标是保护LSP不受给定链路故障的影响。在链路保护下，在需要保护的特定链路上，保护或备用LSP（辅助LSP）的路径与工作或操作LSP的路径不相交。当受保护链路发生故障时，工作LSP上的通信量将切换到"
    },
    {
      "indent": 6,
      "text": "protection LSP at the head-end of the failed link. This is a local repair method which can be fast. It might be more appropriate in situations where some network elements along a given path are less reliable than others.",
      "zh-CHS": "故障链路前端的保护LSP。这是一种快速的局部修复方法。在给定路径上的某些网络元素不如其他网络元素可靠的情况下，这可能更合适。"
    },
    {
      "indent": 3,
      "text": "- Node Protection: The objective of LSP node protection is to protect an LSP from a given node failure. Under node protection, the path of the protection LSP is disjoint from the path of the working LSP at the particular node to be protected. The secondary path is also disjoint from the primary path at all links associated with the node to be protected. When the node fails, traffic on the working LSP is switched over to the protection LSP at the upstream LSR directly connected to the failed node.",
      "zh-CHS": "- 节点保护：LSP节点保护的目标是保护LSP不受给定节点故障的影响。在节点保护下，保护LSP的路径与要保护的特定节点处的工作LSP的路径不相交。在与要保护的节点关联的所有链路上，次路径也与主路径不相交。当节点发生故障时，工作LSP上的流量将切换到直接连接到故障节点的上游LSR处的保护LSP。"
    },
    {
      "indent": 3,
      "text": "- Path Protection: The goal of LSP path protection is to protect an LSP from failure at any point along its routed path. Under path protection, the path of the protection LSP is completely disjoint from the path of the working LSP. The advantage of path protection is that the backup LSP protects the working LSP from all possible link and node failures along the path, except for failures that might occur at the ingress and egress LSRs, or for correlated failures that might impact both working and backup paths simultaneously. Additionally, since the path selection is end-to-end, path protection might be more efficient in terms of resource usage than link or node protection. However, path protection may be slower than link and node protection in general.",
      "zh-CHS": "- 路径保护：LSP路径保护的目标是保护LSP在其路由路径上的任何点上不发生故障。在路径保护下，保护LSP的路径与工作LSP的路径完全不相交。路径保护的优点是，备份LSP保护工作LSP不受路径上所有可能的链路和节点故障的影响，入口和出口LSR处可能发生的故障或可能同时影响工作和备份路径的相关故障除外。此外，由于路径选择是端到端的，因此路径保护在资源使用方面可能比链路或节点保护更有效。但是，路径保护通常可能比链路和节点保护慢。"
    },
    {
      "indent": 3,
      "text": "- Segment Protection: An MPLS domain may be partitioned into multiple protection domains whereby a failure in a protection domain is rectified within that domain. In cases where an LSP traverses multiple protection domains, a protection mechanism within a domain only needs to protect the segment of the LSP that lies within the domain. Segment protection will generally be faster than path protection because recovery generally occurs closer to the fault.",
      "zh-CHS": "- 段保护：可以将MPLS域划分为多个保护域，从而在该域内纠正保护域中的故障。在LSP穿越多个保护域的情况下，域内的保护机制只需要保护位于域内的LSP段。段保护通常比路径保护快，因为恢复通常发生在故障附近。"
    },
    {
      "indent": 0,
      "text": "6.5.2 Protection Option",
      "section_title": true,
      "zh-CHS": "6.5.2 保护选项"
    },
    {
      "indent": 3,
      "text": "Another issue to consider is the concept of protection options. The protection option uses the notation m:n protection, where m is the number of protection LSPs used to protect n working LSPs. Feasible protection options follow.",
      "zh-CHS": "另一个要考虑的问题是保护选项的概念。保护选项使用符号m:n protection，其中m是用于保护n个工作LSP的保护LSP的数量。可行的保护方案如下。"
    },
    {
      "indent": 3,
      "text": "- 1:1: one working LSP is protected/restored by one protection LSP.",
      "zh-CHS": "- 1:1：一个工作LSP由一个保护LSP保护/恢复。"
    },
    {
      "indent": 3,
      "text": "- 1:n: one protection LSP is used to protect/restore n working LSPs.",
      "zh-CHS": "- 1:n:1个保护LSP用于保护/恢复n个工作LSP。"
    },
    {
      "indent": 3,
      "text": "- n:1: one working LSP is protected/restored by n protection LSPs, possibly with configurable load splitting ratio. When more than one protection LSP is used, it may be desirable to share the traffic across the protection LSPs when the working LSP fails to satisfy the bandwidth requirement of the traffic trunk associated with the working LSP. This may be especially useful when it is not feasible to find one path that can satisfy the bandwidth requirement of the primary LSP.",
      "zh-CHS": "- n:1:1个工作LSP由n个保护LSP保护/恢复，可能具有可配置的负载拆分比率。当使用多个保护LSP时，当工作LSP不能满足与工作LSP相关联的业务中继的带宽要求时，可能希望在保护LSP之间共享业务。当无法找到一条能够满足主LSP的带宽要求的路径时，这可能特别有用。"
    },
    {
      "indent": 3,
      "text": "- 1+1: traffic is sent concurrently on both the working LSP and the protection LSP. In this case, the egress LSR selects one of the two LSPs based on a local traffic integrity decision process, which compares the traffic received from both the working and the protection LSP and identifies discrepancies. It is unlikely that this option would be used extensively in IP networks due to its resource utilization inefficiency. However, if bandwidth becomes plentiful and cheap, then this option might become quite viable and attractive in IP networks.",
      "zh-CHS": "- 1+1：在工作LSP和保护LSP上同时发送通信量。在这种情况下，出口LSR基于本地业务完整性决策过程选择两个LSP中的一个，本地业务完整性决策过程比较从工作LSP和保护LSP接收的业务并识别差异。由于其资源利用效率低下，该选项不太可能在IP网络中广泛使用。然而，如果带宽变得充足和廉价，那么这个选项在IP网络中可能变得非常可行和有吸引力。"
    },
    {
      "indent": 0,
      "text": "6.6 Traffic Engineering in Diffserv Environments",
      "section_title": true,
      "zh-CHS": "6.6 区分服务环境中的流量工程"
    },
    {
      "indent": 3,
      "text": "This section provides an overview of the traffic engineering features and recommendations that are specifically pertinent to Differentiated Services (Diffserv) [RFC-2475] capable IP networks.",
      "zh-CHS": "本节概述了与具备区分服务（Diffserv）[RFC-2475]能力的IP网络特别相关的流量工程特性和建议。"
    },
    {
      "indent": 3,
      "text": "Increasing requirements to support multiple classes of traffic, such as best effort and mission critical data, in the Internet calls for IP networks to differentiate traffic according to some criteria, and to accord preferential treatment to certain types of traffic. Large numbers of flows can be aggregated into a few behavior aggregates based on some criteria in terms of common performance requirements in terms of packet loss ratio, delay, and jitter; or in terms of common fields within the IP packet headers.",
      "zh-CHS": "Internet中支持多类流量（如尽力而为和任务关键型数据）的需求不断增加，这要求IP网络根据某些标准区分流量，并对某些类型的流量给予优惠待遇。根据丢包率、延迟和抖动等常见性能要求的一些标准，可以将大量流聚合为几个行为聚合；或者根据IP数据包头中的公共字段。"
    },
    {
      "indent": 3,
      "text": "As Diffserv evolves and becomes deployed in operational networks, traffic engineering will be critical to ensuring that SLAs defined within a given Diffserv service model are met. Classes of service (CoS) can be supported in a Diffserv environment by concatenating per-hop behaviors (PHBs) along the routing path, using service provisioning mechanisms, and by appropriately configuring edge functionality such as traffic classification, marking, policing, and shaping. PHB is the forwarding behavior that a packet receives at a DS node (a Diffserv-compliant node). This is accomplished by means of buffer management and packet scheduling mechanisms. In this context, packets belonging to a class are those that are members of a corresponding ordering aggregate.",
      "zh-CHS": "随着Diffserv的发展和在运营网络中的部署，流量工程对于确保满足给定Diffserv服务模型中定义的SLA至关重要。通过沿路由路径连接每跳行为（PHB），使用服务供应机制，并通过适当配置边缘功能（如流量分类、标记、监管和整形），可以在区分服务环境中支持服务类（CoS）。PHB是数据包在DS节点（兼容区分服务的节点）接收的转发行为。这是通过缓冲区管理和数据包调度机制实现的。在此上下文中，属于类的数据包是作为相应排序聚合的成员的数据包。"
    },
    {
      "indent": 3,
      "text": "Traffic engineering can be used as a compliment to Diffserv mechanisms to improve utilization of network resources, but not as a necessary element in general. When traffic engineering is used, it can be operated on an aggregated basis across all service classes [RFC-3270] or on a per service class basis. The former is used to provide better distribution of the aggregate traffic load over the network resources. (See [RFC-3270] for detailed mechanisms to support aggregate traffic engineering.) The latter case is discussed below since it is specific to the Diffserv environment, with so called Diffserv-aware traffic engineering [DIFF_TE].",
      "zh-CHS": "流量工程可以作为区分服务机制的补充，以提高网络资源的利用率，但通常不能作为必要的元素。当使用流量工程时，它可以在所有服务类别[RFC-3270]的聚合基础上运行，也可以在每个服务类别的基础上运行。前者用于更好地分配网络资源上的总流量负载。（有关支持聚合流量工程的详细机制，请参见[RFC-3270]）后一种情况将在下面讨论，因为它特定于区分服务环境，具有所谓的区分服务感知流量工程[DIFF_TE]。"
    },
    {
      "indent": 3,
      "text": "For some Diffserv networks, it may be desirable to control the performance of some service classes by enforcing certain relationships between the traffic workload contributed by each service class and the amount of network resources allocated or provisioned for that service class. Such relationships between demand and resource allocation can be enforced using a combination of, for example: (1) traffic engineering mechanisms on a per service class basis that enforce the desired relationship between the amount of traffic contributed by a given service class and the resources allocated to that class, and (2) mechanisms that dynamically adjust the resources allocated to a given service class to relate to the amount of traffic contributed by that service class.",
      "zh-CHS": "对于一些区分服务网络，可能希望通过强制每个服务类别贡献的业务负载与为该服务类别分配或供应的网络资源量之间的某些关系来控制某些服务类别的性能。需求和资源分配之间的这种关系可以使用以下组合来实施，例如：（1）基于每个服务类别的流量工程机制，该机制实施给定服务类别贡献的流量和分配给该类别的资源之间的期望关系，以及（2）动态调整分配给给定服务类的资源以与该服务类贡献的流量相关的机制。"
    },
    {
      "indent": 3,
      "text": "It may also be desirable to limit the performance impact of high priority traffic on relatively low priority traffic. This can be achieved by, for example, controlling the percentage of high priority traffic that is routed through a given link. Another way to accomplish this is to increase link capacities appropriately so that lower priority traffic can still enjoy adequate service quality. When the ratio of traffic workload contributed by different service classes vary significantly from router to router, it may not suffice to rely exclusively on conventional IGP routing protocols or on traffic engineering mechanisms that are insensitive to different service classes. Instead, it may be desirable to perform traffic engineering, especially routing control and mapping functions, on a per service class basis. One way to accomplish this in a domain that supports both MPLS and Diffserv is to define class specific LSPs and to map traffic from each class onto one or more LSPs that correspond to that service class. An LSP corresponding to a given service class can then be routed and protected/restored in a class dependent manner, according to specific policies.",
      "zh-CHS": "还可以期望限制高优先级业务对相对低优先级业务的性能影响。这可以通过，例如，控制通过给定链路路由的高优先级流量的百分比来实现。实现这一点的另一种方法是适当增加链路容量，以便较低优先级的业务仍然可以享受足够的服务质量。当不同服务类别所贡献的流量负载比率因路由器而异时，仅依靠传统的IGP路由协议或对不同服务类别不敏感的流量工程机制可能是不够的。相反，可能需要在每个服务类别的基础上执行流量工程，尤其是路由控制和映射功能。在同时支持MPLS和Diffserv的域中实现这一点的一种方法是定义特定于类的LSP，并将每个类的流量映射到对应于该服务类的一个或多个LSP上。然后，可以根据特定策略，以依赖于类的方式路由和保护/恢复与给定服务类相对应的LSP。"
    },
    {
      "indent": 3,
      "text": "Performing traffic engineering on a per class basis may require certain per-class parameters to be distributed. Note that it is common to have some classes share some aggregate constraint (e.g., maximum bandwidth requirement) without enforcing the constraint on each individual class. These classes then can be grouped into a",
      "zh-CHS": "在每类基础上执行流量工程可能需要分配某些每类参数。请注意，一些类共享一些聚合约束（例如，最大带宽要求）而不强制每个类上的约束是很常见的。然后可以将这些类分组为"
    },
    {
      "indent": 3,
      "text": "class-type and per-class-type parameters can be distributed instead to improve scalability. It also allows better bandwidth sharing between classes in the same class-type. A class-type is a set of classes that satisfy the following two conditions:",
      "zh-CHS": "可以分发类类型和每类类型参数，以提高可伸缩性。它还允许在同一类类型的类之间更好地共享带宽。类类型是一组满足以下两个条件的类："
    },
    {
      "indent": 3,
      "text": "1) Classes in the same class-type have common aggregate requirements to satisfy required performance levels.",
      "zh-CHS": "1) 同一类类型中的类具有共同的聚合需求，以满足所需的性能级别。"
    },
    {
      "indent": 3,
      "text": "2) There is no requirement to be enforced at the level of individual class in the class-type. Note that it is still possible, nevertheless, to implement some priority policies for classes in the same class-type to permit preferential access to the class-type bandwidth through the use of preemption priorities.",
      "zh-CHS": "2) 不需要在类类型中的单个类级别强制执行任何要求。请注意，尽管如此，仍然可以为相同类类型的类实施一些优先级策略，以允许通过使用抢占优先级优先访问类类型带宽。"
    },
    {
      "indent": 3,
      "text": "An example of the class-type can be a low-loss class-type that includes both AF1-based and AF2-based Ordering Aggregates. With such a class-type, one may implement some priority policy which assigns higher preemption priority to AF1-based traffic trunks over AF2-based ones, vice versa, or the same priority.",
      "zh-CHS": "类类型的一个示例可以是低损耗类类型，它包括基于AF1和基于AF2的排序聚合。对于这样的类类型，可以实现一些优先级策略，将更高的抢占优先级分配给基于AF1的流量中继，而不是基于AF2的流量中继，反之亦然，或者分配给相同的优先级。"
    },
    {
      "indent": 3,
      "text": "See [DIFF-TE] for detailed requirements on Diffserv-aware traffic engineering.",
      "zh-CHS": "有关区分服务感知流量工程的详细要求，请参见[DIFF-TE]。"
    },
    {
      "indent": 0,
      "text": "6.7 Network Controllability",
      "section_title": true,
      "zh-CHS": "6.7 网络可控性"
    },
    {
      "indent": 3,
      "text": "Off-line (and on-line) traffic engineering considerations would be of limited utility if the network could not be controlled effectively to implement the results of TE decisions and to achieve desired network performance objectives. Capacity augmentation is a coarse grained solution to traffic engineering issues. However, it is simple and may be advantageous if bandwidth is abundant and cheap or if the current or expected network workload demands it. However, bandwidth is not always abundant and cheap, and the workload may not always demand additional capacity. Adjustments of administrative weights and other parameters associated with routing protocols provide finer grained control, but is difficult to use and imprecise because of the routing interactions that occur across the network. In certain network contexts, more flexible, finer grained approaches which provide more precise control over the mapping of traffic to routes and over the selection and placement of routes may be appropriate and useful.",
      "zh-CHS": "如果无法有效控制网络以实现TE决策的结果并实现预期的网络性能目标，则离线（和在线）流量工程考虑的效用将有限。容量增强是解决交通工程问题的粗粒度解决方案。然而，如果带宽充足且便宜，或者如果当前或预期的网络工作负载需要带宽，那么它是简单的并且可能是有利的。然而，带宽并不总是充裕和廉价的，并且工作负载可能并不总是需要额外的容量。与路由协议相关的管理权重和其他参数的调整提供了更细粒度的控制，但由于网络中发生的路由交互，因此难以使用且不精确。在某些网络环境中，更灵活、更细粒度的方法可能是合适和有用的，这些方法可以对流量到路由的映射以及路由的选择和放置提供更精确的控制。"
    },
    {
      "indent": 3,
      "text": "Control mechanisms can be manual (e.g., administrative configuration), partially-automated (e.g., scripts) or fully-automated (e.g., policy based management systems). Automated mechanisms are particularly required in large scale networks. Multi-vendor interoperability can be facilitated by developing and deploying standardized management",
      "zh-CHS": "控制机制可以是手动（例如，管理配置）、部分自动化（例如，脚本）或完全自动化（例如，基于策略的管理系统）。在大规模网络中特别需要自动化机制。通过开发和部署标准化管理，可以促进多供应商的互操作性"
    },
    {
      "indent": 3,
      "text": "systems (e.g., standard MIBs) and policies (PIBs) to support the control functions required to address traffic engineering objectives such as load distribution and protection/restoration.",
      "zh-CHS": "系统（例如，标准MIB）和政策（PIB），以支持满足流量工程目标（如负载分配和保护/恢复）所需的控制功能。"
    },
    {
      "indent": 3,
      "text": "Network control functions should be secure, reliable, and stable as these are often needed to operate correctly in times of network impairments (e.g., during network congestion or security attacks).",
      "zh-CHS": "网络控制功能应该是安全、可靠和稳定的，因为在网络受损时（例如，在网络拥塞或安全攻击期间），通常需要这些功能才能正确运行。"
    },
    {
      "indent": 0,
      "text": "7.0 Inter-Domain Considerations",
      "section_title": true,
      "zh-CHS": "7.0 域间考虑"
    },
    {
      "indent": 3,
      "text": "Inter-domain traffic engineering is concerned with the performance optimization for traffic that originates in one administrative domain and terminates in a different one.",
      "zh-CHS": "域间流量工程关注的是源于一个管理域并终止于另一个管理域的流量的性能优化。"
    },
    {
      "indent": 3,
      "text": "Traffic exchange between autonomous systems in the Internet occurs through exterior gateway protocols. Currently, BGP [BGP4] is the standard exterior gateway protocol for the Internet. BGP provides a number of attributes and capabilities (e.g., route filtering) that can be used for inter-domain traffic engineering. More specifically, BGP permits the control of routing information and traffic exchange between Autonomous Systems (AS's) in the Internet. BGP incorporates a sequential decision process which calculates the degree of preference for various routes to a given destination network. There are two fundamental aspects to inter-domain traffic engineering using BGP:",
      "zh-CHS": "互联网中自治系统之间的流量交换通过外部网关协议进行。目前，BGP[BGP4]是互联网的标准外部网关协议。BGP提供了许多可用于域间流量工程的属性和功能（如路由过滤）。更具体地说，BGP允许控制互联网中自治系统（AS）之间的路由信息和流量交换。BGP包含一个顺序决策过程，该过程计算到给定目的地网络的各种路由的偏好程度。使用BGP进行域间流量工程有两个基本方面："
    },
    {
      "indent": 3,
      "text": "- Route Redistribution: controlling the import and export of routes between AS's, and controlling the redistribution of routes between BGP and other protocols within an AS.",
      "zh-CHS": "- 路由重新分配：控制AS之间路由的导入和导出，以及控制BGP和AS内其他协议之间路由的重新分配。"
    },
    {
      "indent": 3,
      "text": "- Best path selection: selecting the best path when there are multiple candidate paths to a given destination network. Best path selection is performed by the BGP decision process based on a sequential procedure, taking a number of different considerations into account. Ultimately, best path selection under BGP boils down to selecting preferred exit points out of an AS towards specific destination networks. The BGP path selection process can be influenced by manipulating the attributes associated with the BGP decision process. These attributes include: NEXT-HOP, WEIGHT (Cisco proprietary which is also implemented by some other vendors), LOCAL-PREFERENCE, AS-PATH, ROUTE-ORIGIN, MULTI-EXIT-DESCRIMINATOR (MED), IGP METRIC, etc.",
      "zh-CHS": "- 最佳路径选择：当存在多条到给定目标网络的候选路径时，选择最佳路径。最佳路径选择由BGP决策过程基于顺序过程执行，并考虑了许多不同的因素。最终，BGP下的最佳路径选择归结为从AS到特定目的地网络选择首选出口点。BGP路径选择过程可通过操纵与BGP决策过程相关联的属性而受到影响。这些属性包括：下一跳、权重（Cisco专有，也由其他一些供应商实施）、本地偏好、AS路径、路由来源、多出口描述符（MED）、IGP度量等。"
    },
    {
      "indent": 3,
      "text": "Route-maps provide the flexibility to implement complex BGP policies based on pre-configured logical conditions. In particular, Route-maps can be used to control import and export policies for incoming and outgoing routes, control the redistribution of routes between BGP and other protocols, and influence the selection of best paths by",
      "zh-CHS": "路由映射提供了根据预先配置的逻辑条件实施复杂BGP策略的灵活性。特别是，路由映射可用于控制传入和传出路由的导入和导出策略，控制BGP和其他协议之间路由的重新分配，并通过以下方式影响最佳路径的选择："
    },
    {
      "indent": 3,
      "text": "manipulating the attributes associated with the BGP decision process. Very complex logical expressions that implement various types of policies can be implemented using a combination of Route-maps, BGP-attributes, Access-lists, and Community attributes.",
      "zh-CHS": "操纵与BGP决策过程关联的属性。可以使用路由映射、BGP属性、访问列表和社区属性的组合来实现实现各种类型策略的非常复杂的逻辑表达式。"
    },
    {
      "indent": 3,
      "text": "When looking at possible strategies for inter-domain TE with BGP, it must be noted that the outbound traffic exit point is controllable, whereas the interconnection point where inbound traffic is received from an EBGP peer typically is not, unless a special arrangement is made with the peer sending the traffic. Therefore, it is up to each individual network to implement sound TE strategies that deal with the efficient delivery of outbound traffic from one's customers to one's peering points. The vast majority of TE policy is based upon a \"closest exit\" strategy, which offloads interdomain traffic at the nearest outbound peer point towards the destination autonomous system. Most methods of manipulating the point at which inbound traffic enters a network from an EBGP peer (inconsistent route announcements between peering points, AS pre-pending, and sending MEDs) are either ineffective, or not accepted in the peering community.",
      "zh-CHS": "在研究具有BGP的域间TE的可能策略时，必须注意出站流量出口点是可控的，而从EBGP对等方接收入站流量的互连点通常不是可控的，除非与发送流量的对等方进行特殊安排。因此，每个单独的网络都需要实施合理的TE策略，以处理从客户到对等点的出站流量的高效交付。TE策略的绝大多数基于“最近退出”策略，该策略将最近出站对等点的域间流量卸载到目标自治系统。大多数操纵入站流量从EBGP对等方进入网络的点（对等点之间不一致的路由通知，如预挂起和发送MED）的方法要么无效，要么在对等社区中不被接受。"
    },
    {
      "indent": 3,
      "text": "Inter-domain TE with BGP is generally effective, but it is usually applied in a trial-and-error fashion. A systematic approach for inter-domain traffic engineering is yet to be devised.",
      "zh-CHS": "带BGP的域间TE通常是有效的，但它通常以试错的方式应用。域间流量工程的系统方法尚待设计。"
    },
    {
      "indent": 3,
      "text": "Inter-domain TE is inherently more difficult than intra-domain TE under the current Internet architecture. The reasons for this are both technical and administrative. Technically, while topology and link state information are helpful for mapping traffic more effectively, BGP does not propagate such information across domain boundaries for stability and scalability reasons. Administratively, there are differences in operating costs and network capacities between domains. Generally, what may be considered a good solution in one domain may not necessarily be a good solution in another domain. Moreover, it would generally be considered inadvisable for one domain to permit another domain to influence the routing and management of traffic in its network.",
      "zh-CHS": "在当前的互联网架构下，域间TE本质上比域内TE更困难。原因既有技术上的，也有行政上的。从技术上讲，虽然拓扑和链路状态信息有助于更有效地映射流量，但出于稳定性和可伸缩性的原因，BGP不会跨域边界传播此类信息。在管理上，各域之间的运营成本和网络容量存在差异。一般来说，在一个领域被认为是好的解决方案的东西在另一个领域未必是好的解决方案。此外，一般认为一个域允许另一个域影响其网络中流量的路由和管理是不可取的。"
    },
    {
      "indent": 3,
      "text": "MPLS TE-tunnels (explicit LSPs) can potentially add a degree of flexibility in the selection of exit points for inter-domain routing. The concept of relative and absolute metrics can be applied to this purpose. The idea is that if BGP attributes are defined such that the BGP decision process depends on IGP metrics to select exit points for inter-domain traffic, then some inter-domain traffic destined to a given peer network can be made to prefer a specific exit point by establishing a TE-tunnel between the router making the selection to the peering point via a TE-tunnel and assigning the TE-tunnel a metric which is smaller than the IGP cost to all other peering",
      "zh-CHS": "MPLS TE隧道（显式LSP）可以潜在地为域间路由选择出口点增加一定程度的灵活性。相对和绝对度量的概念可用于此目的。其思想是，如果定义了BGP属性，使得BGP决策过程依赖于IGP度量来选择域间流量的出口点，然后，通过在通过TE隧道选择对等点的路由器之间建立TE隧道，并向TE隧道分配小于所有其他对等点的IGP成本的度量，可以使目的地为给定对等网络的一些域间业务偏好特定出口点"
    },
    {
      "indent": 3,
      "text": "points. If a peer accepts and processes MEDs, then a similar MPLS TE-tunnel based scheme can be applied to cause certain entrance points to be preferred by setting MED to be an IGP cost, which has been modified by the tunnel metric.",
      "zh-CHS": "要点。如果对等方接受并处理MED，则可以应用类似的基于MPLS-TE隧道的方案，通过将MED设置为IGP成本（已由隧道度量修改），使某些入口点成为首选。"
    },
    {
      "indent": 3,
      "text": "Similar to intra-domain TE, inter-domain TE is best accomplished when a traffic matrix can be derived to depict the volume of traffic from one autonomous system to another.",
      "zh-CHS": "与域内TE类似，当可以导出业务矩阵来描述从一个自治系统到另一个自治系统的业务量时，域间TE最好实现。"
    },
    {
      "indent": 3,
      "text": "Generally, redistribution of inter-domain traffic requires coordination between peering partners. An export policy in one domain that results in load redistribution across peer points with another domain can significantly affect the local traffic matrix inside the domain of the peering partner. This, in turn, will affect the intra-domain TE due to changes in the spatial distribution of traffic. Therefore, it is mutually beneficial for peering partners to coordinate with each other before attempting any policy changes that may result in significant shifts in inter-domain traffic. In certain contexts, this coordination can be quite challenging due to technical and non- technical reasons.",
      "zh-CHS": "通常，域间流量的重新分配需要对等伙伴之间的协调。一个域中的导出策略会导致负载在另一个域的对等点之间重新分配，这会显著影响对等伙伴域内的本地流量矩阵。这反过来将由于业务的空间分布的变化而影响域内TE。因此，对等伙伴在尝试任何可能导致域间通信量显著变化的策略更改之前相互协调是互利的。在某些情况下，由于技术和非技术原因，这种协调可能是相当具有挑战性的。"
    },
    {
      "indent": 3,
      "text": "It is a matter of speculation as to whether MPLS, or similar technologies, can be extended to allow selection of constrained paths across domain boundaries.",
      "zh-CHS": "关于MPLS或类似技术是否可以扩展以允许跨域边界选择受限路径，这是一个推测问题。"
    },
    {
      "indent": 0,
      "text": "8.0 Overview of Contemporary TE Practices in Operational IP Networks",
      "section_title": true,
      "zh-CHS": "8.0 运营IP网络中的当代TE实践概述"
    },
    {
      "indent": 3,
      "text": "This section provides an overview of some contemporary traffic engineering practices in IP networks. The focus is primarily on the aspects that pertain to the control of the routing function in operational contexts. The intent here is to provide an overview of the commonly used practices. The discussion is not intended to be exhaustive.",
      "zh-CHS": "本节概述了IP网络中的一些当代流量工程实践。重点主要放在与操作环境中的路由功能控制相关的方面。这里的目的是提供常用实践的概述。讨论并非详尽无遗。"
    },
    {
      "indent": 3,
      "text": "Currently, service providers apply many of the traffic engineering mechanisms discussed in this document to optimize the performance of their IP networks. These techniques include capacity planning for long time scales, routing control using IGP metrics and MPLS for medium time scales, the overlay model also for medium time scales, and traffic management mechanisms for short time scale.",
      "zh-CHS": "目前，服务提供商应用本文中讨论的许多流量工程机制来优化其IP网络的性能。这些技术包括针对长时间尺度的容量规划、针对中等时间尺度使用IGP度量和MPLS的路由控制、也针对中等时间尺度的覆盖模型以及针对短时间尺度的流量管理机制。"
    },
    {
      "indent": 3,
      "text": "When a service provider plans to build an IP network, or expand the capacity of an existing network, effective capacity planning should be an important component of the process. Such plans may take the following aspects into account: location of new nodes if any, existing and predicted traffic patterns, costs, link capacity, topology, routing design, and survivability.",
      "zh-CHS": "当服务提供商计划建设IP网络或扩展现有网络的容量时，有效的容量规划应该是该过程的一个重要组成部分。此类计划可考虑以下方面：新节点的位置（如有）、现有和预测的流量模式、成本、链路容量、拓扑、路由设计和生存能力。"
    },
    {
      "indent": 3,
      "text": "Performance optimization of operational networks is usually an ongoing process in which traffic statistics, performance parameters, and fault indicators are continually collected from the network. This empirical data is then analyzed and used to trigger various traffic engineering mechanisms. Tools that perform what-if analysis can also be used to assist the TE process by allowing various scenarios to be reviewed before a new set of configurations are implemented in the operational network.",
      "zh-CHS": "运行网络的性能优化通常是一个持续的过程，其中不断从网络中收集流量统计数据、性能参数和故障指示器。然后对这些经验数据进行分析，并将其用于触发各种交通工程机制。执行假设分析的工具也可用于协助TE流程，允许在操作网络中实施一组新配置之前审查各种场景。"
    },
    {
      "indent": 3,
      "text": "Traditionally, intra-domain real-time TE with IGP is done by increasing the OSPF or IS-IS metric of a congested link until enough traffic has been diverted from that link. This approach has some limitations as discussed in Section 6.2. Recently, some new intra-domain TE approaches/tools have been proposed [RR94][FT00][FT01][WANG]. Such approaches/tools take traffic matrix, network topology, and network performance objective(s) as input, and produce some link metrics and possibly some unequal load-sharing ratios to be set at the head-end routers of some ECMPs as output. These new progresses open new possibility for intra-domain TE with IGP to be done in a more systematic way.",
      "zh-CHS": "传统上，使用IGP的域内实时TE是通过增加拥塞链路的OSPF或is-is度量来完成的，直到有足够的流量从该链路转移。如第6.2节所述，这种方法有一些局限性。最近，提出了一些新的域内TE方法/工具[RR94][FT00][FT01][WANG]。此类方法/工具将流量矩阵、网络拓扑和网络性能目标作为输入，并产生一些链路度量和可能的一些不等负载共享比率，以在一些ECMP的前端路由器处设置作为输出。这些新的进展为以更系统的方式进行带IGP的域内TE开辟了新的可能性。"
    },
    {
      "indent": 3,
      "text": "The overlay model (IP over ATM or IP over Frame relay) is another approach which is commonly used in practice [AWD2]. The IP over ATM technique is no longer viewed favorably due to recent advances in MPLS and router hardware technology.",
      "zh-CHS": "覆盖模型（IP over ATM或IP over Frame relay）是另一种在实践中常用的方法[AWD2]。由于MPLS和路由器硬件技术的最新进展，IP over ATM技术不再受到青睐。"
    },
    {
      "indent": 3,
      "text": "Deployment of MPLS for traffic engineering applications has commenced in some service provider networks. One operational scenario is to deploy MPLS in conjunction with an IGP (IS-IS-TE or OSPF-TE) that supports the traffic engineering extensions, in conjunction with constraint-based routing for explicit route computations, and a signaling protocol (e.g., RSVP-TE or CRLDP) for LSP instantiation.",
      "zh-CHS": "一些服务提供商网络已经开始部署用于流量工程应用的MPLS。一种操作场景是将MPLS与支持流量工程扩展的IGP（is-is-TE或OSPF-TE）一起部署，与用于显式路由计算的基于约束的路由以及用于LSP实例化的信令协议（例如，RSVP-TE或CRLDP）一起部署。"
    },
    {
      "indent": 3,
      "text": "In contemporary MPLS traffic engineering contexts, network administrators specify and configure link attributes and resource constraints such as maximum reservable bandwidth and resource class attributes for links (interfaces) within the MPLS domain. A link state protocol that supports TE extensions (IS-IS-TE or OSPF-TE) is used to propagate information about network topology and link attribute to all routers in the routing area. Network administrators also specify all the LSPs that are to originate each router. For each LSP, the network administrator specifies the destination node and the attributes of the LSP which indicate the requirements that to be satisfied during the path selection process. Each router then uses a local constraint-based routing process to compute explicit paths for all LSPs originating from it. Subsequently, a signaling",
      "zh-CHS": "在当代MPLS流量工程环境中，网络管理员为MPLS域内的链路（接口）指定和配置链路属性和资源约束，例如最大可保留带宽和资源类属性。支持TE扩展的链路状态协议（IS-IS-TE或OSPF-TE）用于将有关网络拓扑和链路属性的信息传播到路由区域中的所有路由器。网络管理员还指定要发起每个路由器的所有LSP。对于每个LSP，网络管理员指定目标节点和LSP的属性，这些属性指示在路径选择过程中要满足的要求。然后，每个路由器使用一个基于本地约束的路由过程来计算来自它的所有LSP的显式路径。随后，一个信令"
    },
    {
      "indent": 3,
      "text": "protocol is used to instantiate the LSPs. By assigning proper bandwidth values to links and LSPs, congestion caused by uneven traffic distribution can generally be avoided or mitigated.",
      "zh-CHS": "协议用于实例化LSP。通过为链路和LSP分配适当的带宽值，通常可以避免或缓解由不均匀流量分布引起的拥塞。"
    },
    {
      "indent": 3,
      "text": "The bandwidth attributes of LSPs used for traffic engineering can be updated periodically. The basic concept is that the bandwidth assigned to an LSP should relate in some manner to the bandwidth requirements of traffic that actually flows through the LSP. The traffic attribute of an LSP can be modified to accommodate traffic growth and persistent traffic shifts. If network congestion occurs due to some unexpected events, existing LSPs can be rerouted to alleviate the situation or network administrator can configure new LSPs to divert some traffic to alternative paths. The reservable bandwidth of the congested links can also be reduced to force some LSPs to be rerouted to other paths.",
      "zh-CHS": "用于流量工程的LSP的带宽属性可以定期更新。基本概念是，分配给LSP的带宽应以某种方式与实际流经LSP的流量的带宽要求相关。LSP的流量属性可以修改，以适应流量增长和持续的流量变化。如果由于某些意外事件导致网络拥塞，则可以重新路由现有LSP以缓解这种情况，或者网络管理员可以配置新LSP以将某些流量转移到备用路径。拥塞链路的可保留带宽也可以减少，以迫使某些LSP重新路由到其他路径。"
    },
    {
      "indent": 3,
      "text": "In an MPLS domain, a traffic matrix can also be estimated by monitoring the traffic on LSPs. Such traffic statistics can be used for a variety of purposes including network planning and network optimization. Current practice suggests that deploying an MPLS network consisting of hundreds of routers and thousands of LSPs is feasible. In summary, recent deployment experience suggests that MPLS approach is very effective for traffic engineering in IP networks [XIAO].",
      "zh-CHS": "在MPLS域中，还可以通过监视lsp上的流量来估计流量矩阵。此类流量统计可用于多种目的，包括网络规划和网络优化。目前的实践表明，部署由数百个路由器和数千个LSP组成的MPLS网络是可行的。总之，最近的部署经验表明，MPLS方法对于IP网络中的流量工程非常有效[XIAO]。"
    },
    {
      "indent": 3,
      "text": "As mentioned previously in Section 7.0, one usually has no direct control over the distribution of inbound traffic. Therefore, the main goal of contemporary inter-domain TE is to optimize the distribution of outbound traffic between multiple inter-domain links. When operating a global network, maintaining the ability to operate the network in a regional fashion where desired, while continuing to take advantage of the benefits of a global network, also becomes an important objective.",
      "zh-CHS": "正如前面第7.0节所述，用户通常无法直接控制入站流量的分布。因此，当代域间TE的主要目标是优化出站流量在多个域间链路之间的分布。在运营全球网络时，在需要时保持以区域方式运营网络的能力，同时继续利用全球网络的优势也成为一个重要目标。"
    },
    {
      "indent": 3,
      "text": "Inter-domain TE with BGP usually begins with the placement of multiple peering interconnection points in locations that have high peer density, are in close proximity to originating/terminating traffic locations on one's own network, and are lowest in cost. There are generally several locations in each region of the world where the vast majority of major networks congregate and interconnect. Some location-decision problems that arise in association with inter-domain routing are discussed in [AWD5].",
      "zh-CHS": "具有BGP的域间TE通常首先将多个对等互连点放置在具有高对等密度、靠近自己网络上的发起/终止流量位置且成本最低的位置。世界上每个地区通常都有几个地方，其中绝大多数主要网络都聚集在那里并相互连接。[AWD5]中讨论了与域间路由相关的一些位置决策问题。"
    },
    {
      "indent": 3,
      "text": "Once the locations of the interconnects are determined, and circuits are implemented, one decides how best to handle the routes heard from the peer, as well as how to propagate the peers' routes within one's own network. One way to engineer outbound traffic flows on a network with many EBGP peers is to create a hierarchy of peers. Generally,",
      "zh-CHS": "一旦确定了互连的位置并实现了电路，就可以决定如何最好地处理从对等方听到的路由，以及如何在自己的网络中传播对等方的路由。在具有多个EBGP对等点的网络上设计出站流量的一种方法是创建对等点的层次结构。通常地"
    },
    {
      "indent": 3,
      "text": "the Local Preferences of all peers are set to the same value so that the shortest AS paths will be chosen to forward traffic. Then, by over-writing the inbound MED metric (Multi-exit-discriminator metric, also referred to as \"BGP metric\". Both terms are used interchangeably in this document) with BGP metrics to routes received at different peers, the hierarchy can be formed. For example, all Local Preferences can be set to 200, preferred private peers can be assigned a BGP metric of 50, the rest of the private peers can be assigned a BGP metric of 100, and public peers can be assigned a BGP metric of 600. \"Preferred\" peers might be defined as those peers with whom the most available capacity exists, whose customer base is larger in comparison to other peers, whose interconnection costs are the lowest, and with whom upgrading existing capacity is the easiest. In a network with low utilization at the edge, this works well. The same concept could be applied to a network with higher edge utilization by creating more levels of BGP metrics between peers, allowing for more granularity in selecting the exit points for traffic bound for a dual homed customer on a peer's network.",
      "zh-CHS": "所有对等方的本地首选项设置为相同的值，以便选择最短AS路径转发流量。然后，通过将入站MED度量（多出口鉴别器度量，也称为“BGP度量”。这两个术语在本文档中互换使用）与BGP度量一起重写到不同对等方接收的路由，可以形成层次结构。例如，所有本地首选项可设置为200，首选私有对等点可分配50的BGP度量，其余私有对等点可分配100的BGP度量，公共对等点可分配600的BGP度量。“首选”对等点可能被定义为存在最多可用容量的对等点，与其他对等点相比，其客户群更大，其互连成本最低，并且升级现有容量最容易。在边缘利用率较低的网络中，这种方法效果很好。通过在对等方之间创建更多级别的BGP度量，相同的概念可以应用于具有更高边缘利用率的网络，从而允许在为对等方网络上的双宿客户绑定的流量选择出口点时具有更大的粒度。"
    },
    {
      "indent": 3,
      "text": "By only replacing inbound MED metrics with BGP metrics, only equal AS-Path length routes' exit points are being changed. (The BGP decision considers Local Preference first, then AS-Path length, and then BGP metric). For example, assume a network has two possible egress points, peer A and peer B. Each peer has 40% of the Internet's routes exclusively on its network, while the remaining 20% of the Internet's routes are from customers who dual home between A and B. Assume that both peers have a Local Preference of 200 and a BGP metric of 100. If the link to peer A is congested, increasing its BGP metric while leaving the Local Preference at 200 will ensure that the 20% of total routes belonging to dual homed customers will prefer peer B as the exit point. The previous example would be used in a situation where all exit points to a given peer were close to congestion levels, and traffic needed to be shifted away from that peer entirely.",
      "zh-CHS": "通过仅将入站MED度量替换为BGP度量，仅更改与路径长度相等的路由的出口点。（BGP决策首先考虑本地偏好，然后考虑路径长度，然后考虑BGP度量）。例如，假设一个网络有两个可能的出口点，对等点a和对等点B。每个对等点有40%的互联网路由专用于其网络，而其余20%的互联网路由来自在a和B之间双宿的客户。假设两个对等点的本地偏好为200，BGP度量为100。如果到对等点A的链路拥塞，增加其BGP度量，同时将本地首选项保留为200，将确保属于双宿客户的总路由的20%将首选对等点B作为出口点。前面的示例将用于这样一种情况，即到给定对等点的所有出口点都接近拥塞水平，并且需要将流量完全从该对等点移开。"
    },
    {
      "indent": 3,
      "text": "When there are multiple exit points to a given peer, and only one of them is congested, it is not necessary to shift traffic away from the peer entirely, but only from the one congested circuit. This can be achieved by using passive IGP-metrics, AS-path filtering, or prefix filtering.",
      "zh-CHS": "当一个给定的对等点有多个出口点，并且其中只有一个拥挤时，不需要将流量完全从对等点转移，而只从一个拥挤的电路转移。这可以通过使用被动IGP度量（如路径过滤或前缀过滤）来实现。"
    },
    {
      "indent": 3,
      "text": "Occasionally, more drastic changes are needed, for example, in dealing with a \"problem peer\" who is difficult to work with on upgrades or is charging high prices for connectivity to their network. In that case, the Local Preference to that peer can be reduced below the level of other peers. This effectively reduces the amount of traffic sent to that peer to only originating traffic",
      "zh-CHS": "有时，需要进行更剧烈的更改，例如，在处理“问题对等者”时，这些人很难与他们一起进行升级，或者对他们的网络连接收取高昂的费用。在这种情况下，对该对等点的本地偏好可以降低到低于其他对等点的水平。这有效地减少了发送到该对等方的流量，而不仅仅是原始流量"
    },
    {
      "indent": 3,
      "text": "(assuming no transit providers are involved). This type of change can affect a large amount of traffic, and is only used after other methods have failed to provide the desired results.",
      "zh-CHS": "（假设不涉及交通服务提供商）。这种类型的更改可能会影响大量通信量，并且只有在其他方法无法提供所需结果后才使用。"
    },
    {
      "indent": 3,
      "text": "Although it is not much of an issue in regional networks, the propagation of a peer's routes back through the network must be considered when a network is peering on a global scale. Sometimes, business considerations can influence the choice of BGP policies in a given context. For example, it may be imprudent, from a business perspective, to operate a global network and provide full access to the global customer base to a small network in a particular country. However, for the purpose of providing one's own customers with quality service in a particular region, good connectivity to that in-country network may still be necessary. This can be achieved by assigning a set of communities at the edge of the network, which have a known behavior when routes tagged with those communities are propagating back through the core. Routes heard from local peers will be prevented from propagating back to the global network, whereas routes learned from larger peers may be allowed to propagate freely throughout the entire global network. By implementing a flexible community strategy, the benefits of using a single global AS Number (ASN) can be realized, while the benefits of operating regional networks can also be taken advantage of. An alternative to doing this is to use different ASNs in different regions, with the consequence that the AS path length for routes announced by that service provider will increase.",
      "zh-CHS": "尽管这在区域网络中不是什么大问题，但当网络在全球范围内对等时，必须考虑对等路由通过网络的传播。有时，业务考虑因素会影响在给定上下文中选择BGP策略。例如，从商业角度来看，运营全球网络并向特定国家的小型网络提供对全球客户群的全面访问可能是不明智的。然而，为了在特定地区为自己的客户提供优质服务，可能仍然需要与国内网络建立良好的连接。这可以通过在网络边缘指定一组社区来实现，当标记有这些社区的路由通过核心传播回来时，这些社区具有已知的行为。从本地对等点听到的路由将被阻止传播回全球网络，而从较大对等点学到的路由可能被允许在整个全球网络中自由传播。通过实施灵活的社区战略，可以实现使用单一全球AS编号（ASN）的好处，同时也可以利用运营区域网络的好处。另一种方法是在不同地区使用不同的ASN，其结果是该服务提供商宣布的路由的AS路径长度将增加。"
    },
    {
      "indent": 0,
      "text": "9.0 Conclusion",
      "section_title": true,
      "zh-CHS": "9.0 结论"
    },
    {
      "indent": 3,
      "text": "This document described principles for traffic engineering in the Internet. It presented an overview of some of the basic issues surrounding traffic engineering in IP networks. The context of TE was described, a TE process models and a taxonomy of TE styles were presented. A brief historical review of pertinent developments related to traffic engineering was provided. A survey of contemporary TE techniques in operational networks was presented. Additionally, the document specified a set of generic requirements, recommendations, and options for Internet traffic engineering.",
      "zh-CHS": "本文件描述了互联网流量工程的原理。它概述了IP网络中围绕流量工程的一些基本问题。描述了TE的上下文，介绍了TE过程模型和TE样式的分类。简要回顾了交通工程相关发展的历史。本文综述了现代TE技术在作战网络中的应用。此外，该文件还规定了一套互联网流量工程的通用要求、建议和选项。"
    },
    {
      "indent": 0,
      "text": "10.0 Security Considerations",
      "section_title": true,
      "zh-CHS": "10.0 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not introduce new security issues.",
      "zh-CHS": "本文档不会引入新的安全问题。"
    },
    {
      "indent": 0,
      "text": "11.0 Acknowledgments",
      "section_title": true,
      "zh-CHS": "11.0 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Jim Boyle for inputs on the recommendations section, Francois Le Faucheur for inputs on Diffserv aspects, Blaine Christian for inputs on measurement, Gerald Ash for",
      "zh-CHS": "作者要感谢Jim Boyle对建议部分的投入，Francois Le Faucheur对Diffserv方面的投入，Blaine Christian对测量方面的投入，Gerald Ash对"
    },
    {
      "indent": 3,
      "text": "inputs on routing in telephone networks and for text on event-dependent TE methods, Steven Wright for inputs on network controllability, and Jonathan Aufderheide for inputs on inter-domain TE with BGP. Special thanks to Randy Bush for proposing the TE taxonomy based on \"tactical vs strategic\" methods. The subsection describing an \"Overview of ITU Activities Related to Traffic Engineering\" was adapted from a contribution by Waisum Lai. Useful feedback and pointers to relevant materials were provided by J. Noel Chiappa. Additional comments were provided by Glenn Grotefeld during the working last call process. Finally, the authors would like to thank Ed Kern, the TEWG co-chair, for his comments and support.",
      "zh-CHS": "电话网络路由输入和事件相关TE方法文本输入，Steven Wright输入网络可控性，Jonathan Aufderheide输入BGP域间TE。特别感谢Randy Bush提出基于“战术vs战略”方法的TE分类法。描述“ITU交通工程相关活动概述”的小节是根据Waissum Lai的贡献改编而成的。J.Noel Chiappa提供了有关材料的有用反馈和指针。Glenn Grotefeld在最后一次通话过程中提供了补充意见。最后，作者要感谢TEWG联合主席Ed Kern的评论和支持。"
    },
    {
      "indent": 0,
      "text": "12.0 References",
      "section_title": true,
      "zh-CHS": "12.0 工具书类"
    },
    {
      "indent": 3,
      "text": "[ASH2] J. Ash, Dynamic Routing in Telecommunications Networks, McGraw Hill, 1998.",
      "zh-CHS": "[ASH2]J.Ash，电信网络中的动态路由，McGraw-Hill，1998。"
    },
    {
      "indent": 3,
      "text": "[ASH3] Ash, J., \"TE & QoS Methods for IP-, ATM-, & TDM-Based Networks\", Work in Progress, March 2001.",
      "zh-CHS": "[ASH3]Ash，J.“基于IP、ATM和TDM网络的TE和QoS方法”，正在进行的工作，2001年3月。"
    },
    {
      "indent": 3,
      "text": "[AWD1] D. Awduche and Y. Rekhter, \"Multiprocotol Lambda Switching: Combining MPLS Traffic Engineering Control with Optical Crossconnects\", IEEE Communications Magazine, March 2001.",
      "zh-CHS": "[AWD1]D.Awduche和Y.Rekhter，“多协议Lambda交换：将MPLS流量工程控制与光交叉连接相结合”，IEEE通信杂志，2001年3月。"
    },
    {
      "indent": 3,
      "text": "[AWD2] D. Awduche, \"MPLS and Traffic Engineering in IP Networks\", IEEE Communications Magazine, Dec. 1999.",
      "zh-CHS": "[AWD2]D.Awduche，“IP网络中的MPLS和流量工程”，IEEE通信杂志，1999年12月。"
    },
    {
      "indent": 3,
      "text": "[AWD5] D. Awduche et al, \"An Approach to Optimal Peering Between Autonomous Systems in the Internet\", International Conference on Computer Communications and Networks (ICCCN'98), Oct. 1998.",
      "zh-CHS": "[AWD5]D.Awduche等人，“互联网中自治系统之间最佳对等的方法”，国际计算机通信与网络会议（ICCCN'98），1998年10月。"
    },
    {
      "indent": 3,
      "text": "[CRUZ] R. L. Cruz, \"A Calculus for Network Delay, Part II: Network Analysis\", IEEE Transactions on Information Theory, vol. 37, pp. 132-141, 1991.",
      "zh-CHS": "[CRUZ]R.L.CRUZ，“网络延迟的演算，第二部分：网络分析”，IEEE信息论交易，第37卷，第132-141页，1991年。"
    },
    {
      "indent": 3,
      "text": "[DIFF-TE] Le Faucheur, F., Nadeau, T., Tatham, M., Telkamp, T., Cooper, D., Boyle, J., Lai, W., Fang, L., Ash, J., Hicks, P., Chui, A., Townsend, W. and D. Skalecki, \"Requirements for support of Diff-Serv-aware MPLS Traffic Engineering\", Work in Progress, May 2001.",
      "zh-CHS": "[DIFF-TE]Le Faucheur，F.，Nadeau，T.，Tatham，M.，Telkamp，T.，Cooper，D.，Boyle，J.，Lai，W.，Fang，L.，Ash，J.，Hicks，P.，Chui，A.，Townsend，W.和D.Skalecki，“支持区分服务的MPLS流量工程的要求”，正在进行的工作，2001年5月。"
    },
    {
      "indent": 3,
      "text": "[ELW95] A. Elwalid, D. Mitra and R.H. Wentworth, \"A New Approach for Allocating Buffers and Bandwidth to Heterogeneous, Regulated Traffic in an ATM Node\", IEEE IEEE Journal on Selected Areas in Communications, 13:6, pp. 1115-1127, Aug. 1995.",
      "zh-CHS": "[ELW95]A.Elwalid，D.Mitra和R.H.Wentworth，“为ATM节点中的异构、受管制的流量分配缓冲区和带宽的新方法”，IEEE通信选定领域杂志，13:6，第1115-1127页，1995年8月。"
    },
    {
      "indent": 3,
      "text": "[FGLR] A. Feldmann, A. Greenberg, C. Lund, N. Reingold, and J. Rexford, \"NetScope: Traffic Engineering for IP Networks\", IEEE Network Magazine, 2000.",
      "zh-CHS": "[FGLR]A.Feldmann，A.Greenberg，C.Lund，N.Reingold和J.Rexford，“NetScope:IP网络流量工程”，IEEE网络杂志，2000年。"
    },
    {
      "indent": 3,
      "text": "[FLJA93] S. Floyd and V. Jacobson, \"Random Early Detection Gateways for Congestion Avoidance\", IEEE/ACM Transactions on Networking, Vol. 1 Nov. 4., p. 387-413, Aug. 1993.",
      "zh-CHS": "[FLJA93]S.Floyd和V.Jacobson，“避免拥塞的随机早期检测网关”，IEEE/ACM网络交易，第1卷，11月4日，第页。1993年8月387-413日。"
    },
    {
      "indent": 3,
      "text": "[FLOY94] S. Floyd, \"TCP and Explicit Congestion Notification\", ACM Computer Communication Review, V. 24, No. 5, p. 10-23, Oct. 1994.",
      "zh-CHS": "[FLOY94]S.Floyd，“TCP和显式拥塞通知”，ACM计算机通信评论，第24卷，第5页。1994年10月10日至23日。"
    },
    {
      "indent": 3,
      "text": "[FT00] B. Fortz and M. Thorup, \"Internet Traffic Engineering by Optimizing OSPF Weights\", IEEE INFOCOM 2000, Mar. 2000.",
      "zh-CHS": "[FT00]B.Fortz和M.Thorup，“通过优化OSPF权重进行互联网流量工程”，IEEE INFOCOM 2000，2000年3月。"
    },
    {
      "indent": 3,
      "text": "[FT01] B. Fortz and M. Thorup, \"Optimizing OSPF/IS-IS Weights in a Changing World\", www.research.att.com/~mthorup/PAPERS/papers.html.",
      "zh-CHS": "[FT01]B.Fortz和M.Thorup，“在不断变化的世界中优化OSPF/IS-IS权重”，www.research.att.com/~mthorup/PAPERS/PAPERS.html。"
    },
    {
      "indent": 3,
      "text": "[HUSS87] B.R. Hurley, C.J.R. Seidl and W.F. Sewel, \"A Survey of Dynamic Routing Methods for Circuit-Switched Traffic\", IEEE Communication Magazine, Sep. 1987.",
      "zh-CHS": "[HUSS87]B.R.Hurley，C.J.R.Seidl和W.F.Sewel，“电路交换业务的动态路由方法调查”，IEEE通信杂志，1987年9月。"
    },
    {
      "indent": 3,
      "text": "[ITU-E600] ITU-T Recommendation E.600, \"Terms and Definitions of Traffic Engineering\", Mar. 1993.",
      "zh-CHS": "[ITU-E600]ITU-T建议E.600，“交通工程的术语和定义”，1993年3月。"
    },
    {
      "indent": 3,
      "text": "[ITU-E701] ITU-T Recommendation E.701, \"Reference Connections for Traffic Engineering\", Oct. 1993.",
      "zh-CHS": "[ITU-E701]ITU-T建议E.701，“交通工程参考连接”，1993年10月。"
    },
    {
      "indent": 3,
      "text": "[ITU-E801] ITU-T Recommendation E.801, \"Framework for Service Quality Agreement\", Oct. 1996.",
      "zh-CHS": "[ITU-E801]ITU-T建议E.801，“服务质量协议框架”，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[JAM] Jamoussi, B., Editior, Andersson, L., Collon, R. and R. Dantu, \"Constraint-Based LSP Setup using LDP\", RFC 3212, January 2002.",
      "zh-CHS": "[JAM]Jamoussi，B.，Editor，Andersson，L.，Collon，R.和R.Dantu，“使用LDP的基于约束的LSP设置”，RFC 3212，2002年1月。"
    },
    {
      "indent": 3,
      "text": "[KATZ] Katz, D., Yeung, D. and K. Kompella, \"Traffic Engineering Extensions to OSPF\", Work in Progress, February 2001.",
      "zh-CHS": "[KATZ]KATZ，D.，Yeung，D.和K.Kompella，“OSPF的交通工程扩展”，在建工程，2001年2月。"
    },
    {
      "indent": 3,
      "text": "[LNO96] T. Lakshman, A. Neidhardt, and T. Ott, \"The Drop from Front Strategy in TCP over ATM and its Interworking with other Control Features\", Proc. INFOCOM'96, p. 1242-1250, 1996.",
      "zh-CHS": "[LNO96]T.Lakshman，A.Neidhardt和T.Ott，“TCP over ATM的前端丢弃策略及其与其他控制功能的交互”，Proc。INFOCOM'96，p。1242-1250, 1996."
    },
    {
      "indent": 3,
      "text": "[MA] Q. Ma, \"Quality of Service Routing in Integrated Services Networks\", PhD Dissertation, CMU-CS-98-138, CMU, 1998.",
      "zh-CHS": "[MA]Q.MA，“综合业务网络中的服务质量路由”，博士论文，CMU-CS-98-138，CMU，1998年。"
    },
    {
      "indent": 3,
      "text": "[MATE] A. Elwalid, C. Jin, S. Low, and I. Widjaja, \"MATE: MPLS Adaptive Traffic Engineering\", Proc. INFOCOM'01, Apr. 2001.",
      "zh-CHS": "[MATE]A.Elwalid，C.Jin，S.Low和I.Widjaja，“MATE:MPLS自适应流量工程”，Proc。INFOCOM'012001年4月。"
    },
    {
      "indent": 3,
      "text": "[MCQ80] J.M. McQuillan, I. Richer, and E.C. Rosen, \"The New Routing Algorithm for the ARPANET\", IEEE. Trans. on Communications, vol. 28, no. 5, pp. 711-719, May 1980.",
      "zh-CHS": "[MCQ80]J.M.McQuillan，I.Richer和E.C.Rosen，“ARPANET的新路由算法”，IEEE。反式。《通信》，第28卷，第5号，第711-719页，1980年5月。"
    },
    {
      "indent": 3,
      "text": "[MR99] D. Mitra and K.G. Ramakrishnan, \"A Case Study of Multiservice, Multipriority Traffic Engineering Design for Data Networks\", Proc. Globecom'99, Dec 1999.",
      "zh-CHS": "[MR99]D.Mitra和K.G.Ramakrishnan，“数据网络多服务、多优先级流量工程设计的案例研究”，Proc。Globecom'991999年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC-1458] Braudes, R. and S. Zabele, \"Requirements for Multicast Protocols\", RFC 1458, May 1993.",
      "zh-CHS": "[RFC-1458]Braudes，R.和S.Zabele，“多播协议的要求”，RFC 1458，1993年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC-1771] Rekhter, Y. and T. Li, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 1771, March 1995.",
      "zh-CHS": "[RFC-1771]Rekhter，Y.和T.Li，“边境网关协议4（BGP-4）”，RFC 17711995年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC-1812] Baker, F., \"Requirements for IP Version 4 Routers\", STD 4, RFC 1812, June 1995.",
      "zh-CHS": "[RFC-1812]Baker，F.，“IP版本4路由器的要求”，STD 4，RFC 1812，1995年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC-1992] Castineyra, I., Chiappa, N. and M. Steenstrup, \"The Nimrod Routing Architecture\", RFC 1992, August 1996.",
      "zh-CHS": "[RFC-1992]伊利诺伊州卡斯蒂内拉、北卡罗来纳州基亚帕和M.斯坦斯特鲁普，“Nimrod路由架构”，RFC 1992，1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC-1997] Chandra, R., Traina, P. and T. Li, \"BGP Community Attributes\", RFC 1997, August 1996.",
      "zh-CHS": "[RFC-1997]Chandra，R.，Traina，P.和T.Li，“BGP社区属性”，RFC 1997，1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC-1998] Chen, E. and T. Bates, \"An Application of the BGP Community Attribute in Multi-home Routing\", RFC 1998, August 1996.",
      "zh-CHS": "[RFC-1998]Chen，E.和T.Bates，“BGP社区属性在多家路由中的应用”，RFC 1998，1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2205] Braden, R., Zhang, L., Berson, S., Herzog, S. and S. Jamin, \"Resource Reservation Protocol (RSVP) - Version 1 Functional Specification\", RFC 2205, September 1997.",
      "zh-CHS": "[RFC-2205]Braden，R.，Zhang，L.，Berson，S.，Herzog，S.和S.Jamin，“资源预留协议（RSVP）-第1版功能规范”，RFC 2205，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2211] Wroclawski, J., \"Specification of the Controlled-Load Network Element Service\", RFC 2211, September 1997.",
      "zh-CHS": "[RFC-2211]Wroclawski，J.“受控负荷网元服务规范”，RFC 2211，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2212] Shenker, S., Partridge, C. and R. Guerin, \"Specification of Guaranteed Quality of Service\", RFC 2212, September 1997.",
      "zh-CHS": "[RFC-2212]Shenker，S.，Partridge，C.和R.Guerin，“保证服务质量规范”，RFC 2212，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2215] Shenker, S. and J. Wroclawski, \"General Characterization Parameters for Integrated Service Network Elements\", RFC 2215, September 1997.",
      "zh-CHS": "[RFC-2215]Shenker，S.和J.Wroclawski，“综合业务网络元件的一般特征参数”，RFC 2215，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2216] Shenker, S. and J. Wroclawski, \"Network Element Service Specification Template\", RFC 2216, September 1997.",
      "zh-CHS": "[RFC-2216]Shenker，S.和J.Wroclawski，“网元服务规范模板”，RFC 2216，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, July 1997.",
      "zh-CHS": "[RFC-2328]莫伊，J.，“OSPF版本2”，标准54，RFC 2328，1997年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2330] Paxson, V., Almes, G., Mahdavi, J. and M. Mathis, \"Framework for IP Performance Metrics\", RFC 2330, May 1998.",
      "zh-CHS": "[RFC-2330]Paxson，V.，Almes，G.，Mahdavi，J.和M.Mathis，“IP性能度量框架”，RFC 2330，1998年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2386] Crawley, E., Nair, R., Rajagopalan, B. and H. Sandick, \"A Framework for QoS-based Routing in the Internet\", RFC 2386, August 1998.",
      "zh-CHS": "[RFC-2386]Crawley，E.，Nair，R.，Rajagopalan，B.和H.Sandick，“互联网中基于QoS的路由框架”，RFC 2386，1998年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2474] Nichols, K., Blake, S., Baker, F. and D. Black, \"Definition of the Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998.",
      "zh-CHS": "[RFC-2474]Nichols，K.，Blake，S.，Baker，F.和D.Black，“IPv4和IPv6标头中区分服务字段（DS字段）的定义”，RFC 2474，1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2475] Blake, S., Black, D., Carlson, M., Davies, E., Wang, Z. and W. Weiss, \"An Architecture for Differentiated Services\", RFC 2475, December 1998.",
      "zh-CHS": "[RFC-2475]Blake，S.，Black，D.，Carlson，M.，Davies，E.，Wang，Z.和W.Weiss，“差异化服务架构”，RFC 24751998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2597] Heinanen, J., Baker, F., Weiss, W. and J. Wroclawski, \"Assured Forwarding PHB Group\", RFC 2597, June 1999.",
      "zh-CHS": "[RFC-2597]Heinanen，J.，Baker，F.，Weiss，W.和J.Wroclawski，“保证货运PHB集团”，RFC 2597，1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2678] Mahdavi, J. and V. Paxson, \"IPPM Metrics for Measuring Connectivity\", RFC 2678, September 1999.",
      "zh-CHS": "[RFC-2678]Mahdavi，J.和V.Paxson，“测量连接性的IPPM度量”，RFC 2678，1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2679] Almes, G., Kalidindi, S. and M. Zekauskas, \"A One-way Delay Metric for IPPM\", RFC 2679, September 1999.",
      "zh-CHS": "[RFC-2679]Almes，G.，Kalidini，S.和M.Zekauskas，“IPPM的单向延迟度量”，RFC 2679，1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2680] Almes, G., Kalidindi, S. and M. Zekauskas, \"A One-way Packet Loss Metric for IPPM\", RFC 2680, September 1999.",
      "zh-CHS": "[RFC-2680]Almes，G.，Kalidini，S.和M.Zekauskas，“IPPM的单向数据包丢失度量”，RFC 2680，1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2702] Awduche, D., Malcolm, J., Agogbua, J., O'Dell, M. and J. McManus, \"Requirements for Traffic Engineering over MPLS\", RFC 2702, September 1999.",
      "zh-CHS": "[RFC-2702]Awduche，D.，Malcolm，J.，Agogbua，J.，O'Dell，M.和J.McManus，“MPLS上的流量工程要求”，RFC 2702，1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2722] Brownlee, N., Mills, C. and G. Ruth, \"Traffic Flow Measurement: Architecture\", RFC 2722, October 1999.",
      "zh-CHS": "[RFC-2722]北布朗利，米尔斯，C.和G.鲁斯，“交通流测量：架构”，RFC 2722，1999年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2753] Yavatkar, R., Pendarakis, D. and R. Guerin, \"A Framework for Policy-based Admission Control\", RFC 2753, January 2000.",
      "zh-CHS": "[RFC-2753]Yavatkar，R.，Pendarakis，D.和R.Guerin，“基于政策的准入控制框架”，RFC 2753，2000年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2961] Berger, L., Gan, D., Swallow, G., Pan, P., Tommasi, F. and S. Molendini, \"RSVP Refresh Overhead Reduction Extensions\", RFC 2961, April 2000.",
      "zh-CHS": "[RFC-2961]Berger，L.，Gan，D.，Swallow，G.，Pan，P.，Tommasi，F.和S.Molendini，“RSVP刷新开销减少扩展”，RFC 2961，2000年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2998] Bernet, Y., Ford, P., Yavatkar, R., Baker, F., Zhang, L., Speer, M., Braden, R., Davie, B., Wroclawski, J. and E. Felstaine, \"A Framework for Integrated Services Operation over Diffserv Networks\", RFC 2998, November 2000.",
      "zh-CHS": "[RFC-2998]Bernet，Y.，Ford，P.，Yavatkar，R.，Baker，F.，Zhang，L.，Speer，M.，Braden，R.，Davie，B.，Wroclawski，J.和E.Felstaine，“区分服务网络上的综合服务运营框架”，RFC 2998，2000年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3031] Rosen, E., Viswanathan, A. and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, January 2001.",
      "zh-CHS": "[RFC-3031]Rosen，E.，Viswanathan，A.和R.Callon，“多协议标签交换体系结构”，RFC 3031，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3086] Nichols, K. and B. Carpenter, \"Definition of Differentiated Services Per Domain Behaviors and Rules for their Specification\", RFC 3086, April 2001.",
      "zh-CHS": "[RFC-3086]Nichols，K.和B.Carpenter，“每域区分服务行为的定义及其规范规则”，RFC 3086，2001年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3124] Balakrishnan, H. and S. Seshan, \"The Congestion Manager\", RFC 3124, June 2001.",
      "zh-CHS": "[RFC-3124]Balakrishnan，H.和S.Seshan，“拥堵管理者”，RFC 31242001年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V. and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "zh-CHS": "[RFC-3209]Awduche，D.，Berger，L.，Gan，D.，Li，T.，Srinivasan，V.和G.Swallow，“RSVP-TE：LSP隧道RSVP的扩展”，RFC 3209，2001年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3210] Awduche, D., Hannan, A. and X. Xiao, \"Applicability Statement for Extensions to RSVP for LSP-Tunnels\", RFC 3210, December 2001.",
      "zh-CHS": "[RFC-3210]Awduche，D.，Hannan，A.和X.Xiao，“LSP隧道RSVP扩展的适用性声明”，RFC 3210，2001年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3213] Ash, J., Girish, M., Gray, E., Jamoussi, B. and G. Wright, \"Applicability Statement for CR-LDP\", RFC 3213, January 2002.",
      "zh-CHS": "[RFC-3213]Ash，J.，Girish，M.，Gray，E.，Jamoussi，B.和G.Wright，“CR-LDP的适用性声明”，RFC 3213，2002年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3270] Le Faucheur, F., Wu, L., Davie, B., Davari, S., Vaahanen, P., Krishnan, R., Cheval, P. and J. Heinanen, \"Multi-Protocol Label Switching (MPLS) Support of Differentiated Services\", RFC 3270, April 2002.",
      "zh-CHS": "[RFC-3270]Le Faucheur，F.，Wu，L.，Davie，B.，Davari，S.，Vaahanen，P.，Krishnan，R.，Cheval，P.和J.Heinanen，“区分服务的多协议标签交换（MPLS）支持”，RFC 3270，2002年4月。"
    },
    {
      "indent": 3,
      "text": "[RR94] M.A. Rodrigues and K.G. Ramakrishnan, \"Optimal Routing in Shortest Path Networks\", ITS'94, Rio de Janeiro, Brazil.",
      "zh-CHS": "[RR94]M.A.Rodrigues和K.G.Ramakrishnan，“最短路径网络中的最佳路由”，ITS'94，巴西里约热内卢。"
    },
    {
      "indent": 3,
      "text": "[SHAR] Sharma, V., Crane, B., Owens, K., Huang, C., Hellstrand, F., Weil, J., Anderson, L., Jamoussi, B., Cain, B., Civanlar, S. and A. Chui, \"Framework for MPLS Based Recovery\", Work in Progress.",
      "zh-CHS": "[SHAR]Sharma，V.，Crane，B.，Owens，K.，Huang，C.，Hellstrand，F.，Weil，J.，Anderson，L.，Jamoussi，B.，Cain，B.，Civanlar，S.和A.Chui，“基于MPLS的恢复框架”，正在进行的工作。"
    },
    {
      "indent": 3,
      "text": "[SLDC98] B. Suter, T. Lakshman, D. Stiliadis, and A. Choudhury, \"Design Considerations for Supporting TCP with Per-flow Queueing\", Proc. INFOCOM'98, p. 299-306, 1998.",
      "zh-CHS": "[SLDC98]B.Suter，T.Lakshman，D.Stiliadis和A.Choudhury，“支持TCP每流排队的设计考虑”，Proc。INFOCOM'98，p。299-306, 1998."
    },
    {
      "indent": 3,
      "text": "[SMIT] Smit, H. and T. Li, \"IS-IS extensions for Traffic Engineering\", Work in Progress.",
      "zh-CHS": "[SMIT]SMIT，H.和T.Li，“交通工程的IS-IS扩展”，正在进行中。"
    },
    {
      "indent": 3,
      "text": "[WANG] Y. Wang, Z. Wang, L. Zhang, \"Internet traffic engineering without full mesh overlaying\", Proceedings of INFOCOM'2001, April 2001.",
      "zh-CHS": "[WANG]Y.WANG，Z.WANG，L.Zhang，“无全网格覆盖的互联网流量工程”，INFOCOM 2001年学报，2001年4月。"
    },
    {
      "indent": 3,
      "text": "[XIAO] X. Xiao, A. Hannan, B. Bailey, L. Ni, \"Traffic Engineering with MPLS in the Internet\", IEEE Network magazine, Mar. 2000.",
      "zh-CHS": "[XIAO]XIAO，A.Hannan，B.Bailey，L.Ni，“互联网中使用MPLS的流量工程”，IEEE网络杂志，2000年3月。"
    },
    {
      "indent": 3,
      "text": "[YARE95] C. Yang and A. Reddy, \"A Taxonomy for Congestion Control Algorithms in Packet Switching Networks\", IEEE Network Magazine, p. 34-45, 1995.",
      "zh-CHS": "[YARE95]C.Yang和A.Reddy，“分组交换网络中拥塞控制算法的分类”，IEEE网络杂志，第页。34-45, 1995."
    },
    {
      "indent": 0,
      "text": "13.0 Authors' Addresses",
      "section_title": true,
      "zh-CHS": "13.0 作者地址"
    },
    {
      "indent": 3,
      "text": "Daniel O. Awduche Movaz Networks 7926 Jones Branch Drive, Suite 615 McLean, VA 22102",
      "zh-CHS": "Daniel O.Awduche Movaz Networks 7926琼斯支路615室弗吉尼亚州麦克莱恩22102"
    },
    {
      "indent": 3,
      "text": "Phone: 703-298-5291 EMail: awduche@movaz.com",
      "zh-CHS": "电话：703-298-5291电子邮件：awduche@movaz.com"
    },
    {
      "indent": 3,
      "text": "Angela Chiu Celion Networks 1 Sheila Dr., Suite 2 Tinton Falls, NJ 07724",
      "zh-CHS": "Angela Chiu Celion Networks 1 Sheila Dr.，新泽西州丁顿瀑布2号套房，邮编：07724"
    },
    {
      "indent": 3,
      "text": "Phone: 732-747-9987 EMail: angela.chiu@celion.com",
      "zh-CHS": "电话：732-747-9987电子邮件：安吉拉。chiu@celion.com"
    },
    {
      "indent": 3,
      "text": "Anwar Elwalid Lucent Technologies Murray Hill, NJ 07974",
      "zh-CHS": "安瓦尔·埃尔瓦利德·朗讯科技公司，新泽西州默里山，邮编：07974"
    },
    {
      "indent": 3,
      "text": "Phone: 908 582-7589 EMail: anwar@lucent.com",
      "zh-CHS": "电话：908582-7589电子邮件：anwar@lucent.com"
    },
    {
      "indent": 3,
      "text": "Indra Widjaja Bell Labs, Lucent Technologies 600 Mountain Avenue Murray Hill, NJ 07974",
      "zh-CHS": "新泽西州默里山山路600号朗讯科技公司Indra Widjaja Bell实验室，邮编：07974"
    },
    {
      "indent": 3,
      "text": "Phone: 908 582-0435 EMail: iwidjaja@research.bell-labs.com",
      "zh-CHS": "电话：908582-0435电子邮件：iwidjaja@research.bell-实验室网站"
    },
    {
      "indent": 3,
      "text": "XiPeng Xiao Redback Networks 300 Holger Way San Jose, CA 95134",
      "zh-CHS": "加利福尼亚州圣何塞市霍尔格路300号西彭肖红背网络公司，邮编95134"
    },
    {
      "indent": 3,
      "text": "Phone: 408-750-5217 EMail: xipeng@redback.com",
      "zh-CHS": "电话：408-750-5217电子邮件：xipeng@redback.com"
    },
    {
      "indent": 0,
      "text": "14.0 Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "14.0 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2002年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}