{
  "title": {
    "text": "RFC 3322:  Signaling Compression (SigComp) Requirements & Assumptions ",
    "zh-CHS": "RFC 3322"
  },
  "number": 3322,
  "created_at": "2021-10-26 18:10:53.879152+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           H. Hannu\nRequest for Comments: 3322                                      Ericsson\nCategory: Informational                                     January 2003",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Signaling Compression (SigComp) Requirements & Assumptions",
      "zh-CHS": "信号压缩（SigComp）要求和假设"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to outline requirements and motivations for the development of a scheme for compression and decompression of messages from signaling protocols. In wireless environments and especially in cellular systems, e.g., GSM (Global System for Mobile communications) and UMTS (Universal Mobile Telecommunications System), there is a need to maximize the transport efficiency for data over the radio interface. With the introduction of SIP/SDP (Session Initiation Protocol/Session Description Protocol) to cellular devices, compression of the signaling messages should be considered in order to improve both service availability and quality, mainly by reducing the user idle time, e.g., at call setup.",
      "zh-CHS": "本文件的目的是概述开发一种用于从信令协议压缩和解压缩消息的方案的要求和动机。在无线环境中，尤其是在蜂窝系统中，例如GSM（全球移动通信系统）和UMTS（通用移动通信系统），需要最大限度地提高无线接口上的数据传输效率。随着SIP/SDP（会话发起协议/会话描述协议）引入蜂窝设备，应考虑信令消息的压缩，以便主要通过减少用户空闲时间（例如，在呼叫建立时）来提高服务可用性和质量。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction....................................................2\n1.1.  Protocol Characteristics......................................2\n1.2.  Cellular System Radio Characteristics.........................3\n2.  Motivation for Signaling Reduction..............................4\n2.1.  Estimation of Call Setup Delay Using SIP/SDP..................4\n3.  Alternatives for Signaling Reduction............................6\n4.  Assumptions.....................................................7\n5.  Requirements....................................................8\n5.1.  General Requirements..........................................8\n5.2.  Performance Requirements......................................9\n6. Security Considerations.........................................11\n7. IANA Considerations.............................................11\n8. References......................................................11\n9. Author's Address................................................12\n10. Full Copyright Statement.......................................13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "In wireless environments, and especially in cellular systems, such as GSM/GPRS, there is a need to maximize the transport efficiency of data over the radio interface. The radio spectrum is rather expensive and must be carefully used. Therefore, the cellular systems must support a sufficient number of users to make them economically feasible. Thus, there is a limitation in the per user bandwidth.",
      "zh-CHS": "在无线环境中，尤其是在蜂窝系统（如GSM/GPRS）中，需要最大限度地提高无线接口上的数据传输效率。无线电频谱相当昂贵，必须小心使用。因此，蜂窝系统必须支持足够数量的用户，使其在经济上可行。因此，在每用户带宽中存在限制。"
    },
    {
      "indent": 3,
      "text": "Compressing the headers of the network and transport protocols used for carrying user data is one way to make more efficient use of the scarce radio resources [ROHC]. However, compression of the messages from signaling protocols, such as SIP/SDP, should also be considered to increase the radio resource usage even further. Compression will also improve the service quality by reducing the user idle time at e.g., call setup. When IP is used end-to-end, new applications, such as streaming, will be brought to tiny end-hosts, such as cellular devices. This will introduce additional traffic in cellular systems. Compression of signaling messages, such as RTSP [RTSP], should also be considered to improve both the service availability and quality.",
      "zh-CHS": "压缩用于承载用户数据的网络和传输协议的报头是更有效利用稀缺无线电资源的一种方法[ROHC]。然而，还应考虑来自信令协议（例如SIP/SDP）的消息的压缩，以进一步增加无线资源的使用。压缩还将通过减少用户空闲时间（例如呼叫设置）来提高服务质量。当IP端到端使用时，新的应用程序（如流媒体）将被带到小型终端主机（如蜂窝设备）。这将在蜂窝系统中引入额外的通信量。还应考虑对信令消息（如RTSP[RTSP]）进行压缩，以提高服务可用性和质量。"
    },
    {
      "indent": 3,
      "text": "New services with their corresponding signaling protocols make it reasonable to consider a scheme that is generic. The scheme should be generic in the meaning that the scheme can efficiently be applied to arbitrary protocols with certain characteristics, such as the ASCII based protocols SIP and RTSP.",
      "zh-CHS": "新的服务及其相应的信令协议使得合理地考虑一个通用的方案是合理的。该方案应该是通用的，这意味着该方案可以有效地应用于具有某些特征的任意协议，例如基于ASCII的协议SIP和RTSP。"
    },
    {
      "indent": 0,
      "text": "1.1. Protocol Characteristics",
      "section_title": true,
      "zh-CHS": "1.1. 协议特征"
    },
    {
      "indent": 3,
      "text": "The following application signaling protocols are examples of protocols that are expected to be commonly used in the future. Some of their characteristics are described below.",
      "zh-CHS": "以下应用信令协议是预期在未来常用的协议的示例。下文介绍了它们的一些特点。"
    },
    {
      "indent": 0,
      "text": "1.1.1 SIP",
      "section_title": true,
      "zh-CHS": "1.1.1 小口喝"
    },
    {
      "indent": 3,
      "text": "The Session Initiation Protocol [SIP] is an application layer protocol for establishing, modifying and terminating multimedia sessions or calls. These sessions include Internet multimedia conferences, Internet telephony and similar applications. SIP can be used over either TCP [TCP] or UDP [UDP]. SIP is a text based protocol, using ISO 10646 in UTF-8 encoding.",
      "zh-CHS": "会话发起协议[SIP]是用于建立、修改和终止多媒体会话或呼叫的应用层协议。这些会议包括互联网多媒体会议、互联网电话和类似的应用程序。SIP可以通过TCP[TCP]或UDP[UDP]使用。SIP是一种基于文本的协议，在UTF-8编码中使用ISO10646。"
    },
    {
      "indent": 0,
      "text": "1.1.2 SDP",
      "section_title": true,
      "zh-CHS": "1.1.2 SDP"
    },
    {
      "indent": 3,
      "text": "The Session Description Protocol [SDP] is used to advertise multimedia conferences and communicate conference addresses and conference tool specific information. It is also used for general real-time multimedia session description purposes. SDP is carried in the message body of SIP and RTSP messages. SDP is text based using the ISO 10646 character set in UTF-8 encoding.",
      "zh-CHS": "会话描述协议[SDP]用于公布多媒体会议，并传达会议地址和会议工具特定信息。它还用于一般的实时多媒体会话描述目的。SDP携带在SIP和RTSP消息的消息体中。SDP是基于文本的，使用UTF-8编码的ISO10646字符集。"
    },
    {
      "indent": 0,
      "text": "1.1.3 RTSP",
      "section_title": true,
      "zh-CHS": "1.1.3 RTSP"
    },
    {
      "indent": 3,
      "text": "The Real Time Streaming Protocol [RTSP] is an application level protocol for controlling the delivery of data with real-time properties, such as audio and video. RTSP may use UDP or TCP (or other) as a transport protocol. RTSP is text based using the ISO 10646 character set in UTF-8 encoding.",
      "zh-CHS": "实时流协议[RTSP]是一种应用级协议，用于控制具有实时属性的数据（如音频和视频）的传输。RTSP可以使用UDP或TCP（或其他）作为传输协议。RTSP是基于文本的，使用UTF-8编码的ISO10646字符集。"
    },
    {
      "indent": 0,
      "text": "1.1.4 Protocol Similarities",
      "section_title": true,
      "zh-CHS": "1.1.4 协议相似性"
    },
    {
      "indent": 3,
      "text": "The above protocols have many similarities. These similarities will have implications on solutions to the problems they create in conjunction with e.g., cellular radio access. The similarities include:",
      "zh-CHS": "上述协议有许多相似之处。这些相似性将对解决它们与蜂窝无线电接入等一起产生的问题产生影响。相似之处包括："
    },
    {
      "indent": 3,
      "text": "- Requests and reply characteristics. When a sender sends a request, it stays idle until it has received a response. Hence, it typically takes a number of round trip times to conclude e.g., a SIP session.",
      "zh-CHS": "- 请求和回复特征。当发送方发送请求时，它将保持空闲状态，直到收到响应为止。因此，通常需要若干往返时间来结束例如SIP会话。"
    },
    {
      "indent": 3,
      "text": "- They are ASCII based.",
      "zh-CHS": "- 它们是基于ASCII的。"
    },
    {
      "indent": 3,
      "text": "- They are generous in size in order to provide the necessary information to the session participants.",
      "zh-CHS": "- 为了向会议参与者提供必要的信息，它们的尺寸非常大。"
    },
    {
      "indent": 3,
      "text": "- SIP and RTSP share many common header field names, methods and status codes. The traffic patterns are also similar. The signaling is carried out primarily under the set up phase. For SIP, this means that the majority of the signaling is carried out to set up a phone call or multimedia session. For RTSP, the majority of the signaling is done before the transmission of application data.",
      "zh-CHS": "- SIP和RTSP共享许多常见的头字段名称、方法和状态代码。交通模式也很相似。信号主要在设置阶段执行。对于SIP，这意味着执行大部分信令以建立电话呼叫或多媒体会话。对于RTSP，大部分信令在传输应用程序数据之前完成。"
    },
    {
      "indent": 0,
      "text": "1.2. Cellular System Radio Characteristics",
      "section_title": true,
      "zh-CHS": "1.2. 蜂窝系统无线电特性"
    },
    {
      "indent": 3,
      "text": "Partly to enable high utilization of cellular systems, and partly due to the unreliable nature of the radio media, cellular links have characteristics that differ somewhat from a typical fixed link, e.g.,",
      "zh-CHS": "部分是为了实现蜂窝系统的高利用率，部分是由于无线媒体的不可靠性质，蜂窝链路具有与典型固定链路有所不同的特性，例如：。，"
    },
    {
      "indent": 3,
      "text": "copper or fiber. The most important characteristics are the lossy behavior of cellular links and the large round trip times.",
      "zh-CHS": "铜或纤维。最重要的特征是蜂窝链路的有损行为和较大的往返时间。"
    },
    {
      "indent": 3,
      "text": "The quality in a radio system typically changes from one radio frame to another due to fading in the radio channel. Due to the nature of the radio media and interference from other radio users, the average bit error rate (BER) can be 10e-3 with a variation roughly between 10e-2 to 10e-4. To be able to use the radio media with its error characteristics, methods such as forward error correction (FEC) and interleaving are used. If these methods were not used, the BER of a cellular radio channel would be around 10 %. Thus, radio links are, by nature, error prone. The final packet loss rate may be further reduced by applying low level retransmissions (ARQ) over the radio channel; however, this trades decreased packet loss rate for a larger delay. By applying methods to decrease BER, the system delay is increased. In some cellular systems, the algorithmic channel round trip delay is in the order of 80 ms. Other sources of delays are DSP-processing, node-internal delay and transmission. A general value for the RTT is difficult to state, but it might be as high as 200 ms.",
      "zh-CHS": "由于无线信道中的衰落，无线系统中的质量通常从一个无线帧改变到另一个无线帧。由于无线电媒体的性质和来自其他无线电用户的干扰，平均误码率（BER）可以是10e-3，其变化大约在10e-2到10e-4之间。为了能够使用具有错误特性的无线电媒体，使用了诸如前向纠错（FEC）和交织等方法。如果不使用这些方法，蜂窝无线信道的误码率将在10%左右。因此，无线电链路本质上容易出错。通过在无线信道上应用低电平重传（ARQ），可以进一步降低最终分组丢失率；然而，这降低了较大延迟的丢包率。通过采用降低误码率的方法，增加了系统延迟。在一些蜂窝系统中，算法信道往返延迟约为80 ms。其他延迟来源为DSP处理、节点内部延迟和传输。很难说明RTT的一般值，但它可能高达200 ms。"
    },
    {
      "indent": 3,
      "text": "For cellular systems it is of vital importance to have a sufficient number of users per cell; otherwise the system cost would prohibit deployment. It is crucial to use the existing bandwidth carefully; hence the average user bit rate is typically relatively low compared to the average user bit rate in wired line systems. This is especially important for mass market services like voice.",
      "zh-CHS": "对于蜂窝系统来说，每个蜂窝具有足够数量的用户是至关重要的；否则，系统成本将禁止部署。谨慎使用现有带宽至关重要；因此，与有线系统中的平均用户比特率相比，平均用户比特率通常相对较低。这对于语音等大众市场服务尤为重要。"
    },
    {
      "indent": 0,
      "text": "2. Motivation for Signaling Reduction",
      "section_title": true,
      "zh-CHS": "2. 信号减少的动机"
    },
    {
      "indent": 3,
      "text": "The need for solving the problems caused by the signaling protocol messages is exemplified in this chapter by looking at a typical SIP/SDP Call Setup sequence over a narrow band channel.",
      "zh-CHS": "本章通过查看窄带信道上的典型SIP/SDP呼叫建立序列来说明解决信令协议消息引起的问题的必要性。"
    },
    {
      "indent": 0,
      "text": "2.1 Estimation of Call Setup Delay Using SIP/SDP",
      "section_title": true,
      "zh-CHS": "2.1 基于SIP/SDP的呼叫建立时延估计"
    },
    {
      "indent": 3,
      "text": "Figure 2.1 shows an example of SIP signaling between two termination points with a wireless link between, and the resulting delay under certain system assumptions.",
      "zh-CHS": "图2.1显示了两个终端点之间的SIP信令示例，两个终端点之间有无线链路，以及在某些系统假设下产生的延迟。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the used figures represent a very narrow band link. E.g., a WCDMA system can provide maximum bit rates up to 2 Mbits/s in ideal conditions, but that means one single user would consume all radio resources in the cell. For a mass market service such as voice, it is always crucial to reduce the bandwidth requirements for each user.",
      "zh-CHS": "应注意，所使用的图表示非常窄的频带链路。例如，在理想条件下，WCDMA系统可以提供高达2 Mbits/s的最大比特率，但这意味着单个用户将消耗小区中的所有无线电资源。对于像语音这样的大众市场服务，降低每个用户的带宽需求总是至关重要的。"
    },
    {
      "indent": 3,
      "text": "Client                  Network-Proxy     Size [bytes]   Time [ms]\n  |                            |\n  |---------- INVITE --------->|               620      517+70=587\n  |                            |\n  |<-- 183 Session progress ---|               500      417+70=487\n  |                            |\n  |---------- PRACK ---------->|               250      208+70=278\n  |                            |\n  |<----- 200 OK (PRACK) ------|               300      250+70=320\n  :                            :\n  |<...... RSVP and SM .......>|\n  :                            :\n  |---------- COMET ---------->|               620      517+70=587\n  |                            |\n  |<----- 200 OK (COMET) ------|               450\n  |                            |                +\n  |<------ 180 Ringing --------|               230      567+70=637\n  |                            |\n  |---------- PRACK ---------->|               250      208+70=278\n  |                            |\n  |<----- 200 OK (PRACK) ------|               300\n  |                            |                +\n  |<--------- 200 OK ----------|               450      625+70=695\n  |                            |\n  |----------- ACK ----------->|               230      192+70=262",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Figure 2.1. SIP signaling delays assuming a link speed of 9600 bits/sec and a RTT of 140 ms.",
      "zh-CHS": "图2.1。SIP信令延迟假定链路速度为9600位/秒，RTT为140毫秒。"
    },
    {
      "indent": 3,
      "text": "The one way delay is calculated according to the following equation:",
      "zh-CHS": "单向延迟根据以下方程式计算："
    },
    {
      "indent": 3,
      "text": "OneWayDelay =\n     MessageSize[bits]/LinkSpeed[bits/sec] + RTT[sec]/2       (eq. 1)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The following values have been used:",
      "zh-CHS": "已使用以下值："
    },
    {
      "indent": 3,
      "text": "RTT/2: 70 ms LinkSpeed 9.6 kbps",
      "zh-CHS": "RTT/2:70毫秒链路速度9.6 kbps"
    },
    {
      "indent": 3,
      "text": "The delay formula is based on an approximation of a WCDMA radio access method for speech services. The approximation is rather crude. For instance, delays caused by possible retransmissions due to errors are ignored. Further, these calculations also assume that there is only one cellular link in the path and take delays in an eventual intermediate IP-network into account. Even if this approximation is crude, it is still sufficient to provide representative numbers and enable comparisons. The message size given in Figure 2.1, is typical for a SIP/SDP call setup sequence.",
      "zh-CHS": "延迟公式基于用于语音服务的WCDMA无线接入方法的近似值。近似值相当粗糙。例如，由于错误可能导致的重新传输所导致的延迟将被忽略。此外，这些计算还假设路径中只有一个蜂窝链路，并考虑最终中间IP网络中的延迟。即使这个近似值是粗略的，它仍然足以提供具有代表性的数字并进行比较。图2.1中给出的消息大小是SIP/SDP呼叫设置序列的典型值。"
    },
    {
      "indent": 0,
      "text": "2.1.1 Delay Results",
      "section_title": true,
      "zh-CHS": "2.1.1 延迟结果"
    },
    {
      "indent": 3,
      "text": "Applying equation 1 to each SIP/SDP message shown in the example of Figure 2.1 gives a total delay of 4131 ms from the first SIP/SDP message to the last. The RSVP and Session Management (Radio Bearer setup), displayed in Figure 2.1, will add approximately 1.5 seconds to the total delay, using equation 1. However, there will also be RSVP and SM signaling prior to the SIP INVITE message to establish the radio bearer, which would add approximately another 1.5 seconds.",
      "zh-CHS": "将等式1应用于图2.1示例中所示的每个SIP/SDP消息，给出了从第一条SIP/SDP消息到最后一条SIP/SDP消息的总延迟4131 ms。图2.1中显示的RSVP和会话管理（无线承载设置）将使用等式1使总延迟增加约1.5秒。然而，在SIP INVITE消息建立无线电承载之前，也将有RSVP和SM信令，这将再增加大约1.5秒。"
    },
    {
      "indent": 3,
      "text": "In [TSG] there is a comparison between GERAN call setup using SIP and ordinary GSM call setup. For a typical GSM call setup, the time is about 3.6 seconds, and for the case when using SIP, the call setup is approximately 7.9 seconds.",
      "zh-CHS": "在[TSG]中，对使用SIP的GERAN呼叫设置和普通GSM呼叫设置进行了比较。对于典型的GSM呼叫设置，时间约为3.6秒，对于使用SIP的情况，呼叫设置约为7.9秒。"
    },
    {
      "indent": 3,
      "text": "Another situation that would benefit from reduced signaling is carrying signaling messages over narrow bandwidth links in mid-call. For GERAN, this will result in frame stealing with degraded speech quality as a result.",
      "zh-CHS": "另一种从减少信令中获益的情况是在通话中通过窄带宽链路传输信令消息。对于GERAN来说，这将导致帧窃取，从而降低语音质量。"
    },
    {
      "indent": 3,
      "text": "Thus, solutions are needed to reduce the signaling delay and the required bandwidth when considering both system bandwidth requirements and service setup delays.",
      "zh-CHS": "因此，在考虑系统带宽需求和服务设置延迟时，需要解决方案来减少信令延迟和所需带宽。"
    },
    {
      "indent": 0,
      "text": "3. Alternatives for Signaling Reduction",
      "section_title": true,
      "zh-CHS": "3. 信号减少的替代方案"
    },
    {
      "indent": 3,
      "text": "More or less attractive solutions to the previously mentioned problems can be outlined:",
      "zh-CHS": "对于前面提到的问题，可以概括出或多或少有吸引力的解决方案："
    },
    {
      "indent": 3,
      "text": "- Increase the user bit rate",
      "zh-CHS": "- 增加用户比特率"
    },
    {
      "indent": 6,
      "text": "An increase of the bit rate per user will decrease the number of users per cell. There exist systems (for example WCDMA) which can provide high bit rates and even variable rates, e.g., at the setup of new sessions. However, there are also systems, e.g., GSM/EDGE, where it is not possible to reach these high bit rates in all situations. At the cell borders, for example, the signal strength to noise ratio will be lower and result in a lower bit rate. In general, an unnecessary increase of the bit rate should be avoided due to the higher system cost introduced and the possibility of denial of service. The latter could, for example, be caused by lack of enough bandwidth to support the sending of the large setup message within a required time period, which is set for QoS reasons.",
      "zh-CHS": "每用户比特率的增加将减少每个小区的用户数。存在可以提供高比特率甚至可变速率的系统（例如WCDMA），例如在设置新会话时。然而，也有一些系统，例如GSM/EDGE，不可能在所有情况下都达到这些高比特率。例如，在小区边界处，信号强度与噪声的比率将较低，并导致较低的比特率。一般来说，由于引入了更高的系统成本和拒绝服务的可能性，应避免不必要的比特率增加。例如，后者可能是由于缺乏足够的带宽来支持在所需的时间段内发送大型设置消息而导致的，该时间段是出于QoS原因而设置的。"
    },
    {
      "indent": 3,
      "text": "- Decrease the RTT of the cellular link",
      "zh-CHS": "- 降低蜂窝链路的RTT"
    },
    {
      "indent": 6,
      "text": "Decreasing the RTT would require substantial system changes and is thus not feasible in the short term. Further, the RTT-delay caused by interleaving and FEC will always have to be present regardless of which system is used. Otherwise the BER will be too high for the received data to be useful, or alternatively trigger retransmissions giving an average total delay of the same or higher magnitude.",
      "zh-CHS": "降低RTT将需要对系统进行重大更改，因此短期内不可行。此外，无论使用哪个系统，由交织和FEC引起的RTT延迟都必须始终存在。否则，误码率将过高，使接收到的数据无法使用，或者触发重发，从而产生相同或更高幅度的平均总延迟。"
    },
    {
      "indent": 3,
      "text": "- Optimize message sequence for the protocols",
      "zh-CHS": "- 优化协议的消息序列"
    },
    {
      "indent": 6,
      "text": "If the request/response pattern could be eased up, then \"keeping the pipe full\" could be a way forward. Thus, instead of following the message sequence described in Figure 4.2, more than one message would be sent in a row, even though no response has been received. However, this would entail protocol changes and may be difficult at the current date.",
      "zh-CHS": "如果请求/响应模式可以放松，那么“保持管道充满”可能是一个前进的方向。因此，与图4.2中描述的消息序列不同，即使没有收到响应，也会在一行中发送多条消息。然而，这将需要对协议进行修改，目前可能很困难。"
    },
    {
      "indent": 3,
      "text": "- Protocol stripping",
      "zh-CHS": "- 协议剥离"
    },
    {
      "indent": 6,
      "text": "Removing fields from a message would decrease the size of the messages to some extent. However, this would cause the loss of transparency and thus violate the End-to-End principle and is thus not desirable.",
      "zh-CHS": "从消息中删除字段将在一定程度上减少消息的大小。然而，这将导致透明度的丧失，从而违反端到端原则，因此是不可取的。"
    },
    {
      "indent": 3,
      "text": "- Compression",
      "zh-CHS": "- 压缩"
    },
    {
      "indent": 6,
      "text": "By compressing messages, the impact of the mentioned problems could be decreased. Compared to the other possible solutions compression can be made, and must be, transparent to the end-user application. Thus, compression seems to be the most attractive way forward.",
      "zh-CHS": "通过压缩消息，可以减少上述问题的影响。与其他可能的解决方案相比，压缩可以并且必须对最终用户应用程序透明。因此，压缩似乎是最有吸引力的前进方向。"
    },
    {
      "indent": 0,
      "text": "4. Assumptions",
      "section_title": true,
      "zh-CHS": "4. 假设"
    },
    {
      "indent": 3,
      "text": "- Negotiation",
      "zh-CHS": "- 谈判"
    },
    {
      "indent": 6,
      "text": "How the usage of compression is negotiated is out of the scope for this compression solution and must be handled by e.g., the protocol the messages of which are to be compressed.",
      "zh-CHS": "如何协商压缩的使用超出了此压缩解决方案的范围，必须由（例如）要压缩其消息的协议来处理。"
    },
    {
      "indent": 3,
      "text": "- Reliable transport",
      "zh-CHS": "- 可靠运输"
    },
    {
      "indent": 6,
      "text": "With reliable transport, it is assumed that a transport recovered from data that is damaged, lost, duplicated, or delivered out of order, e.g., [TCP].",
      "zh-CHS": "使用可靠传输时，假定传输从损坏、丢失、复制或无序交付的数据中恢复，例如[TCP]。"
    },
    {
      "indent": 3,
      "text": "- Unreliable transport",
      "zh-CHS": "- 不可靠运输"
    },
    {
      "indent": 6,
      "text": "With unreliable transport, it is assumed that a transport does not have the capabilities of a reliable transport, e.g., [UDP].",
      "zh-CHS": "对于不可靠传输，假定传输不具备可靠传输的能力，例如[UDP]。"
    },
    {
      "indent": 0,
      "text": "5. Requirements",
      "section_title": true,
      "zh-CHS": "5. 要求"
    },
    {
      "indent": 3,
      "text": "This chapter states requirements for a signaling compression scheme to be developed in the IETF ROHC WG.",
      "zh-CHS": "本章说明了IETF ROHC WG中制定的信令压缩方案的要求。"
    },
    {
      "indent": 3,
      "text": "The requirements are divided into two parts. Section 5.1 sets general requirements concerning the Internet infrastructure, while Section 5.2 sets requirements on the scheme itself.",
      "zh-CHS": "要求分为两部分。第5.1节规定了有关互联网基础设施的一般要求，而第5.2节规定了方案本身的要求。"
    },
    {
      "indent": 0,
      "text": "5.1. General Requirements",
      "section_title": true,
      "zh-CHS": "5.1. 一般要求"
    },
    {
      "indent": 3,
      "text": "1. Transparency: When a message is compressed and then decompressed, the result must be bitwise identical to the original message.",
      "zh-CHS": "1. 透明性：当一条消息被压缩然后解压缩时，结果必须与原始消息按位相同。"
    },
    {
      "indent": 7,
      "text": "Justification: This is to ensure that the compression scheme will not cause problems for any current or future part of the Internet infrastructure.",
      "zh-CHS": "理由：这是为了确保压缩方案不会对互联网基础设施的任何当前或未来部分造成问题。"
    },
    {
      "indent": 7,
      "text": "Note: See also requirement 9.",
      "zh-CHS": "注：另见要求9。"
    },
    {
      "indent": 3,
      "text": "2. Header compression coexistence: The compression scheme must be able to coexist with header compression, especially the ROHC protocol.",
      "zh-CHS": "2. 头压缩共存：压缩方案必须能够与头压缩共存，尤其是ROHC协议。"
    },
    {
      "indent": 7,
      "text": "Justification: Signaling compression is used because there is a need to conserve bandwidth usage. In that case, header compression will likely be needed too.",
      "zh-CHS": "理由：使用信令压缩是因为需要节省带宽使用。在这种情况下，可能也需要进行头压缩。"
    },
    {
      "indent": 3,
      "text": "3a. Compatibility: The compression scheme must be constructed in such a way that it allows the above protocols' mechanisms to negotiate whether the compression scheme is to be applied or not.",
      "zh-CHS": "3a。兼容性：压缩方案的构造方式必须允许上述协议的机制协商是否应用压缩方案。"
    },
    {
      "indent": 7,
      "text": "Justification: Two entities must be able to communicate regardless if the signaling compression scheme is implemented at both entities or not.",
      "zh-CHS": "理由：无论信令压缩方案是否在两个实体上实施，两个实体都必须能够通信。"
    },
    {
      "indent": 3,
      "text": "3b. Ubiquity: Modifications to the protocols generating the messages that are to be compressed, must not be required for the compression scheme to work.",
      "zh-CHS": "3b。普遍性：压缩方案不需要修改生成要压缩的消息的协议。"
    },
    {
      "indent": 7,
      "text": "Justification: This will simplify deployment of the compression scheme.",
      "zh-CHS": "理由：这将简化压缩方案的部署。"
    },
    {
      "indent": 7,
      "text": "Note: This does not preclude making extensions, which are related to the signaling compression scheme, to existing protocols, as long as the extensions are backward compatible.",
      "zh-CHS": "注意：这并不排除对现有协议进行扩展（与信令压缩方案相关），只要扩展是向后兼容的。"
    },
    {
      "indent": 3,
      "text": "4. Generality: Compression of arbitrary message streams must be supported. The signaling compression scheme must not be limited to certain protocols, traffic patterns or sessions. It must not assume any message pattern to be able to perform compression.",
      "zh-CHS": "4. 通用性：必须支持对任意消息流的压缩。信令压缩方案不得限于某些协议、业务模式或会话。它不能假定任何消息模式能够执行压缩。"
    },
    {
      "indent": 7,
      "text": "Justification: There might be a future need for compression of different ASCII based signaling protocols. This requirement will minimize future work.",
      "zh-CHS": "理由：未来可能需要压缩不同的基于ASCII的信令协议。这一要求将尽量减少今后的工作。"
    },
    {
      "indent": 7,
      "text": "Note: This does not preclude optimization for certain streams.",
      "zh-CHS": "注意：这并不排除某些流的优化。"
    },
    {
      "indent": 3,
      "text": "5. Unidirectional routes: The compression scheme must be able to operate on unidirectional routes, i.e., without explicit feedback messages from the decompressor.",
      "zh-CHS": "5. 单向路由：压缩方案必须能够在单向路由上运行，即没有来自解压器的明确反馈消息。"
    },
    {
      "indent": 7,
      "text": "Note: Implementations on unidirectional routes might possibly show a degraded performance compared to implementations on bi-directional routes.",
      "zh-CHS": "注意：与双向路由上的实现相比，单向路由上的实现可能会显示性能下降。"
    },
    {
      "indent": 3,
      "text": "6. Transport: The solution must work for both unreliable and reliable underlying transport protocols, e.g., UDP and TCP.",
      "zh-CHS": "6. 传输：解决方案必须适用于不可靠和可靠的底层传输协议，例如UDP和TCP。"
    },
    {
      "indent": 7,
      "text": "Justification: The protocols, which generate the messages that are to be compressed, may use either an unreliable or a reliable underlying transport.",
      "zh-CHS": "理由：生成要压缩的消息的协议可能使用不可靠或可靠的底层传输。"
    },
    {
      "indent": 7,
      "text": "Note: This should not be taken to mean that the same set of solution mechanisms must be used over both unreliable and reliable transport.",
      "zh-CHS": "注意：这并不意味着必须在不可靠和可靠传输上使用同一组解决方案机制。"
    },
    {
      "indent": 0,
      "text": "5.2. Performance Requirements",
      "section_title": true,
      "zh-CHS": "5.2. 性能要求"
    },
    {
      "indent": 3,
      "text": "The performance requirements in this section and the following subsections are valid for both unreliable and reliable underlying transport.",
      "zh-CHS": "本节和以下小节中的性能要求适用于不可靠和可靠的基础传输。"
    },
    {
      "indent": 3,
      "text": "7. Scalability: The scheme must be flexible to accommodate a range of compressors/decompressors with varying memory and processor capabilities.",
      "zh-CHS": "7. 可伸缩性：该方案必须灵活，以适应一系列具有不同内存和处理器能力的压缩器/解压缩器。"
    },
    {
      "indent": 7,
      "text": "Justification: A primary target for the signaling compression scheme is cellular systems, where the mobile terminals have varying capabilities.",
      "zh-CHS": "理由：信令压缩方案的主要目标是蜂窝系统，其中移动终端具有不同的能力。"
    },
    {
      "indent": 3,
      "text": "8. Delay: The signaling compression must not noticeably add to the delay experienced by the end user.",
      "zh-CHS": "8. 延迟：信令压缩不得明显增加最终用户所经历的延迟。"
    },
    {
      "indent": 7,
      "text": "Justification: Reduction of the user experienced delay is the main purpose of signaling compression.",
      "zh-CHS": "理由：减少用户体验的延迟是信令压缩的主要目的。"
    },
    {
      "indent": 7,
      "text": "Note: This requirement is intended to prevent schemes that achieve compression efficiency at the expense of delay, i.e., queuing of messages to improve the compression efficiency should be avoided.",
      "zh-CHS": "注：此要求旨在防止以延迟为代价实现压缩效率的方案，即应避免消息排队以提高压缩效率。"
    },
    {
      "indent": 3,
      "text": "The following requirements are grouped into two subsections, a robustness section and a compression efficiency section.",
      "zh-CHS": "以下要求分为两个小节，健壮性部分和压缩效率部分。"
    },
    {
      "indent": 0,
      "text": "5.2.1. Robustness",
      "section_title": true,
      "zh-CHS": "5.2.1. 健壮性"
    },
    {
      "indent": 3,
      "text": "The requirements in this section concern the issue of when compressed messages should be correctly decompressed. The transparency requirement (first requirement) covers the issue with faulty decompressed messages.",
      "zh-CHS": "本节中的要求涉及何时正确解压缩压缩消息的问题。透明度要求（第一个要求）涵盖了错误解压缩消息的问题。"
    },
    {
      "indent": 3,
      "text": "9. Residual errors: The compression scheme must be resilient against errors undetected by lower layers, i.e., the probability of incorrect decompression caused by such undetected errors must be low.",
      "zh-CHS": "9. 残余错误：压缩方案必须能够抵抗较低层未检测到的错误，即，此类未检测到的错误导致错误解压缩的概率必须很低。"
    },
    {
      "indent": 7,
      "text": "Justification: A primary target for the signaling compression scheme is cellular systems, where undetected errors might be introduced on the cellular link.",
      "zh-CHS": "理由：信令压缩方案的主要目标是蜂窝系统，在蜂窝链路上可能会引入未检测到的错误。"
    },
    {
      "indent": 3,
      "text": "10. Error propagation: Propagation of errors due to signaling compression should be kept at an absolute minimum. Loss or damage to a single or several messages, between compressor and decompressor should not prevent compression and decompression of later messages.",
      "zh-CHS": "10. 错误传播：由于信号压缩导致的错误传播应保持在绝对最小值。压缩程序和解压缩程序之间单个或多个消息的丢失或损坏不应阻止以后消息的压缩和解压缩。"
    },
    {
      "indent": 7,
      "text": "Justification: Error propagation reduces resource utilization and quality.",
      "zh-CHS": "理由：错误传播降低了资源利用率和质量。"
    },
    {
      "indent": 3,
      "text": "11. Delay: The compression scheme must be able to perform compression and decompression of messages under all expected delay conditions.",
      "zh-CHS": "11. 延迟：压缩方案必须能够在所有预期延迟条件下执行消息的压缩和解压缩。"
    },
    {
      "indent": 0,
      "text": "5.2.2. Compression Efficiency",
      "section_title": true,
      "zh-CHS": "5.2.2. 压缩效率"
    },
    {
      "indent": 3,
      "text": "This section states requirements related to compression efficiency.",
      "zh-CHS": "本节说明了与压缩效率相关的要求。"
    },
    {
      "indent": 3,
      "text": "12. Message loss: Loss or damage to a single or several messages, on the link between compressor and decompressor, should not prevent the usage of later messages in the compression and decompression process.",
      "zh-CHS": "12. 消息丢失：在压缩程序和解压缩程序之间的链路上，单个或多个消息的丢失或损坏不应阻止在压缩和解压缩过程中使用后续消息。"
    },
    {
      "indent": 3,
      "text": "13. Moderate message misordering: The scheme should allow for the correct decompression of messages, that have been moderately misordered (1-2 messages) between compressor and decompressor. The scheme should not prevent the usage of later messages in the compression and decompression process.",
      "zh-CHS": "13. 中度消息错序：该方案应允许正确解压在压缩器和解压器之间已中度错序（1-2条消息）的消息。该方案不应阻止在压缩和解压缩过程中使用后续消息。"
    },
    {
      "indent": 7,
      "text": "Justification: Misordering is frequent on the Internet, and this kind of misordering is common.",
      "zh-CHS": "理由：在互联网上，乱序很常见，这种乱序很常见。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "A protocol specified to meet these requirements must be able to cope with packets that have undergone security measures, such as encryption, without adding any security risks. This document, by itself however, does not add any security risks.",
      "zh-CHS": "为满足这些要求而指定的协议必须能够处理经过安全措施（如加密）的数据包，而不会增加任何安全风险。然而，本文件本身并未增加任何安全风险。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "A protocol which meets these requirements may require the IANA to assign various numbers. This document by itself however, does not require any IANA involvement.",
      "zh-CHS": "满足这些要求的协议可能要求IANA分配各种号码。然而，本文件本身不需要IANA的参与。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 3,
      "text": "[ROHC] Bormann, C., Burmeister, C., Degermark, M., Fukushima, H., Hannu, H., Jonsson, L-E., Hakenberg, R., Koren, T., Le, K., Liu, Z., Martensson, A., Miyazaki, A., Svanbro, K., Wiebke, T., Yoshimura, T. and H. Zheng, \"RObust Header Compression (ROHC): Framework and four profiles: RTP, UDP, ESP, and uncompressed\", RFC 3095, July 2001.",
      "zh-CHS": "[ROHC]Bormann，C.，Burmeister，C.，Degermark，M.，Fukushima，H.，Hannu，H.，Jonsson，L-E.，Hakenberg，R.，Koren，T.，Le，K.，Liu，Z.，Martenson，A.，Miyazaki，A.，Svanbro，K.，Wiebke，T.，Yoshimura，T.和H.Zheng，“鲁棒头压缩（ROHC）：框架和四个配置文件：RTP，UDP，ESP和未压缩”，RFC 3095，2001年7月。"
    },
    {
      "indent": 3,
      "text": "[RTSP] Schulzrinne, H., Rao, A. and R. Lanphier, \"Real Time Streaming Protocol (RTSP)\", RFC 2326, April 1998.",
      "zh-CHS": "[RTSP]Schulzrinne，H.，Rao，A.和R.Lanphier，“实时流协议（RTSP）”，RFC 23261998年4月。"
    },
    {
      "indent": 3,
      "text": "[SDP] Handley, H. and V. Jacobson, \"SDP: Session Description Protocol\", RFC 2327, April 1998.",
      "zh-CHS": "[SDP]Handley，H.和V.Jacobson，“SDP：会话描述协议”，RFC 2327，1998年4月。"
    },
    {
      "indent": 3,
      "text": "[SIP] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M. and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[SIP]Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[UDP] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, August 1980.",
      "zh-CHS": "[UDP]Postel，J.，“用户数据报协议”，STD 6，RFC 768，1980年8月。"
    },
    {
      "indent": 3,
      "text": "[TCP] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "zh-CHS": "[TCP]Postel，J.，“传输控制协议”，STD 7，RFC 793，1981年9月。"
    },
    {
      "indent": 3,
      "text": "[TSG] Nortel Networks, \"A Comparison Between GERAN Packet-Switched Call Setup Using SIP and GSM Circuit-Switched Call Setup Using RIL3-CC, RIL3-MM, RIL3-RR, and DTAP\", 3GPP TSG GERAN #2, GP-000508, 6-10 November 2000.",
      "zh-CHS": "[TSG]北电网络，“使用SIP的GERAN分组交换呼叫设置与使用RIL3-CC、RIL3-MM、RIL3-RR和DTAP的GSM电路交换呼叫设置之间的比较”，3GPP TSG GERAN#2，GP-000508，2000年11月6日至10日。"
    },
    {
      "indent": 0,
      "text": "9. Author's Address",
      "section_title": true,
      "zh-CHS": "9. 作者地址"
    },
    {
      "indent": 3,
      "text": "Hans Hannu Box 920 Ericsson AB SE-971 28 Lulea, Sweden",
      "zh-CHS": "Hans Hannu信箱920爱立信AB SE-971 28瑞典卢利亚"
    },
    {
      "indent": 3,
      "text": "Phone:  +46 920 20 21 84\nEMail: hans.hannu@epl.ericsson.se",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "10. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2003年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}