{
  "title": {
    "text": "RFC 3730:  Extensible Provisioning Protocol (EPP) ",
    "zh-CHS": "RFC 3730"
  },
  "number": 3730,
  "created_at": "2021-11-17 20:47:46.543064+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      S. Hollenbeck\nRequest for Comments: 3730                                VeriSign, Inc.\nCategory: Standards Track                                     March 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Extensible Provisioning Protocol (EPP)",
      "zh-CHS": "可扩展资源调配协议（EPP）"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes an application layer client-server protocol for the provisioning and management of objects stored in a shared central repository. Specified in XML, the protocol defines generic object management operations and an extensible framework that maps protocol operations to objects. This document includes a protocol specification, an object mapping template, and an XML media type registration.",
      "zh-CHS": "本文档描述了一个应用层客户机-服务器协议，用于提供和管理存储在共享中央存储库中的对象。协议以XML形式指定，定义了通用对象管理操作和一个可扩展框架，该框架将协议操作映射到对象。本文档包括协议规范、对象映射模板和XML媒体类型注册。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction. . . . . . . . . . . . . . . . . . . . . . . . .   2\n    1.1.  Conventions Used in This Document . . . . . . . . . . .   3\n2.  Protocol Description. . . . . . . . . . . . . . . . . . . . .   3\n    2.1.  Transport Mapping Considerations. . . . . . . . . . . .   6\n    2.2.  Protocol Identification . . . . . . . . . . . . . . . .   7\n    2.3.  Hello Format. . . . . . . . . . . . . . . . . . . . . .   7\n    2.4.  Greeting Format . . . . . . . . . . . . . . . . . . . .   8\n    2.5.  Command Format. . . . . . . . . . . . . . . . . . . . .  11\n    2.6.  Response Format . . . . . . . . . . . . . . . . . . . .  12\n    2.7.  Protocol Extension Framework. . . . . . . . . . . . . .  16\n          2.7.1.  Protocol Extension. . . . . . . . . . . . . . .  16\n          2.7.2.  Object Extension. . . . . . . . . . . . . . . .  17\n          2.7.3.  Command-Response Extension. . . . . . . . . . .  18\n    2.8.  Object Identification . . . . . . . . . . . . . . . . .  19\n    2.9.  Protocol Commands . . . . . . . . . . . . . . . . . . .  19\n          2.9.1.  Session Management Commands . . . . . . . . . .  20\n                  2.9.1.1.  EPP <login> Command . . . . . . . . .  20",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "                  2.9.1.2.  EPP <logout> Command. . . . . . . . .  22\n          2.9.2.  Query Commands. . . . . . . . . . . . . . . . .  23\n                  2.9.2.1.  EPP <check> Command . . . . . . . . .  24\n                  2.9.2.2.  EPP <info> Command. . . . . . . . . .  26\n                  2.9.2.3.  EPP <poll> Command. . . . . . . . . .  27\n                  2.9.2.4.  EPP <transfer> Query Command. . . . .  32\n          2.9.3.  Object Transform Commands . . . . . . . . . . .  34\n                  2.9.3.1.  EPP <create> Command. . . . . . . . .  34\n                  2.9.3.2.  EPP <delete> Command. . . . . . . . .  35\n                  2.9.3.3.  EPP <renew> Command . . . . . . . . .  37\n                  2.9.3.4.  EPP <transfer> Command. . . . . . . .  38\n                  2.9.3.5.  EPP <update> Command. . . . . . . . .  41\n3.  Result Codes. . . . . . . . . . . . . . . . . . . . . . . . .  42\n4.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . .  48\n    4.1.  Base Schema . . . . . . . . . . . . . . . . . . . . . .  49\n    4.2.  Shared Structure Schema . . . . . . . . . . . . . . . .  58\n5.  Internationalization Considerations . . . . . . . . . . . . .  60\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  61\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .  62\n8.  Acknowledgements. . . . . . . . . . . . . . . . . . . . . . .  62\n9.  References. . . . . . . . . . . . . . . . . . . . . . . . . .  63\n    9.1.  Normative References. . . . . . . . . . . . . . . . . .  63\n    9.2.  Informative References. . . . . . . . . . . . . . . . .  64\nAppendix A: Object Mapping Template . . . . . . . . . . . . . . .  65\nAppendix B: Media Type Registration: application/epp+xml. . . . .  67\nAuthor's Address. . . . . . . . . . . . . . . . . . . . . . . . .  68\nFull Copyright Statement. . . . . . . . . . . . . . . . . . . . .  69",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document describes specifications for the Extensible Provisioning Protocol (EPP) version 1.0, an XML text protocol that permits multiple service providers to perform object provisioning operations using a shared central object repository. EPP is specified using the Extensible Markup Language (XML) 1.0 as described in [XML] and XML Schema notation as described in [XMLS-1] and [XMLS-2]. EPP meets and exceeds the requirements for a generic registry registrar protocol as described in [RFC3375].",
      "zh-CHS": "本文档描述了可扩展资源调配协议（EPP）1.0版的规范，这是一种XML文本协议，允许多个服务提供商使用共享的中心对象存储库执行对象资源调配操作。使用[XML]中描述的可扩展标记语言（XML）1.0和[XMLS-1]和[XMLS-2]中描述的XML模式表示法指定EPP。EPP满足并超过了[RFC3375]中所述的通用注册表注册器协议的要求。"
    },
    {
      "indent": 3,
      "text": "EPP content is identified by MIME media type application/epp+xml. Registration information for this media type is included in an appendix to this document.",
      "zh-CHS": "EPP内容由MIME媒体类型application/EPP+xml标识。此媒体类型的注册信息包含在本文档的附录中。"
    },
    {
      "indent": 3,
      "text": "EPP is intended for use in diverse operating environments where transport and security requirements vary greatly. It is unlikely that a single transport or security specification will meet the needs of all anticipated operators, so EPP was designed for use in a",
      "zh-CHS": "EPP适用于不同的操作环境，在这些环境中，传输和安全要求差异很大。单一的运输或安全规范不太可能满足所有预期运营商的需求，因此EPP设计用于"
    },
    {
      "indent": 3,
      "text": "layered protocol environment. Bindings to specific transport and security protocols are outside the scope of this specification.",
      "zh-CHS": "分层协议环境。特定传输和安全协议的绑定不在本规范的范围内。"
    },
    {
      "indent": 3,
      "text": "This original motivation for this protocol was to provide a standard Internet domain name registration protocol for use between domain name registrars and domain name registries. This protocol provides a means of interaction between a registrar's applications and registry applications. It is expected that this protocol will have additional uses beyond domain name registration.",
      "zh-CHS": "该协议最初的动机是提供一个标准的互联网域名注册协议，供域名注册商和域名注册商之间使用。该协议提供了注册器应用程序和注册应用程序之间的交互方式。预计该协议将在域名注册之外有其他用途。"
    },
    {
      "indent": 3,
      "text": "XML is case sensitive. Unless stated otherwise, XML specifications and examples provided in this document MUST be interpreted in the character case presented to develop a conforming implementation.",
      "zh-CHS": "XML区分大小写。除非另有说明，否则本文档中提供的XML规范和示例必须按照提供的字符大小写进行解释，以开发一致的实现。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used In This Document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "In examples, \"C:\" represents lines sent by a protocol client and \"S:\" represents lines returned by a protocol server. Indentation and white space in examples is provided only to illustrate element relationships and is not a REQUIRED feature of this protocol.",
      "zh-CHS": "在示例中，“C:”表示协议客户端发送的行，“S:”表示协议服务器返回的行。示例中的缩进和空白仅用于说明元素关系，不是本协议的必需功能。"
    },
    {
      "indent": 0,
      "text": "2. Protocol Description",
      "section_title": true,
      "zh-CHS": "2. 协议描述"
    },
    {
      "indent": 3,
      "text": "EPP is a stateful XML protocol that can be layered over multiple transport protocols. Protected using lower-layer security protocols, clients exchange identification, authentication, and option information, and then engage in a series of client-initiated command-response exchanges. All EPP commands are atomic (there is no partial success or partial failure) and designed so that they can be made idempotent (executing a command more than once has the same net effect on system state as successfully executing the command once).",
      "zh-CHS": "EPP是一个有状态的XML协议，可以在多个传输协议上分层。使用较低层安全协议进行保护，客户端交换标识、身份验证和选项信息，然后进行一系列由客户端发起的命令响应交换。所有EPP命令都是原子的（不存在部分成功或部分失败），其设计可以使它们成为幂等的（多次执行命令对系统状态的净影响与一次成功执行命令相同）。"
    },
    {
      "indent": 3,
      "text": "EPP provides four basic service elements: service discovery, commands, responses, and an extension framework that supports definition of managed objects and the relationship of protocol requests and responses to those objects.",
      "zh-CHS": "EPP提供了四个基本服务元素：服务发现、命令、响应和一个扩展框架，该框架支持托管对象的定义以及协议请求和响应与这些对象的关系。"
    },
    {
      "indent": 3,
      "text": "An EPP server MUST respond to client-initiated communication (which can be either a lower-layer connection request or an EPP service discovery message) by returning a greeting to a client. A server MUST promptly respond to each EPP command with a coordinated response that describes the results of processing the command. The following server state machine diagram illustrates the message exchange process in detail:",
      "zh-CHS": "EPP服务器必须通过向客户端返回问候语来响应客户端发起的通信（可以是下层连接请求或EPP服务发现消息）。服务器必须立即响应每个EPP命令，并提供一个描述命令处理结果的协调响应。以下服务器状态机图详细说明了消息交换过程："
    },
    {
      "indent": 3,
      "text": "        |\n        V\n+-----------------+                  +-----------------+\n|   Waiting for   |     Connected    |     Prepare     |\n|      Client     |----------------->|     Greeting    |\n+-----------------+    or <hello>    +-----------------+\n   ^                                           |\n   | Close Connection                     Send |\n   |     or Idle                      Greeting |\n+-----------------+                            V\n|       End       |     Timeout      +-----------------+\n|     Session     |<-----------------|   Waiting for   |\n+-----------------+                  |      Client     |\n   ^    ^    ^        Send +-------->|  Authentication |\n   |    |    |    Response |         +-----------------+\n   |    |    |     +--------------+            |\n   |    |    |     | Prepare Fail |            | <login>\n   |    |    +-----|   Response   |            | Received\n   |    |    Send  +--------------+            V\n   |    |    2501          ^         +-----------------+\n   |    |   Response       |         |   Processing    |\n   |    |                  +---------|     <login>     |\n   |    |                  Auth Fail +-----------------+\n   |    |                                       |\n   |    |                                       | Auth OK\n   |    |                                       V\n   |    |              Timeout       +-----------------+\n   |    +----------------------------|   Waiting for   |\n   |                                 |     Command     |\n   | Send x5xx                       +-----------------+\n   | Response  +-----------------+  Send    ^  |\n   +-----------|     Prepare     | Response |  | Command\n               |     Response    |----------+  | Received\n               +-----------------+             V\n                          ^          +-----------------+\n                  Command |          |   Processing    |\n                Processed +----------|     Command     |\n                                     +-----------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 1: EPP Server State Machine",
      "zh-CHS": "图1:EPP服务器状态机"
    },
    {
      "indent": 3,
      "text": "EPP commands fall into three categories: session management commands, query commands, and data transform commands. Session management commands are used to establish and end persistent sessions with an EPP server. Query commands are used to perform read-only object information retrieval operations. Transform commands are used to perform read-write object management operations.",
      "zh-CHS": "EPP命令分为三类：会话管理命令、查询命令和数据转换命令。会话管理命令用于建立和结束与EPP服务器的持久会话。查询命令用于执行只读对象信息检索操作。转换命令用于执行读写对象管理操作。"
    },
    {
      "indent": 3,
      "text": "Commands are processed by a server in the order they are received from a client. Though an immediate response confirming receipt and processing of the command is produced by the server, the protocol includes features that allow for offline review of transform commands before the requested action is actually completed. In such situations the response from the server MUST clearly note that the command has been received and processed, but the requested action is pending. The state of the corresponding object MUST clearly reflect processing of the pending action. The server MUST also notify the client when offline processing of the action has been completed. Object mappings SHOULD describe standard formats for notices that describe completion of offline processing.",
      "zh-CHS": "服务器按照从客户端接收命令的顺序处理命令。虽然服务器会生成确认接收和处理命令的即时响应，但该协议包含的功能允许在请求的操作实际完成之前脱机检查转换命令。在这种情况下，来自服务器的响应必须清楚地注意到命令已被接收和处理，但请求的操作处于挂起状态。相应对象的状态必须清楚地反映挂起操作的处理。当操作的脱机处理完成时，服务器还必须通知客户端。对象映射应该描述用于描述脱机处理完成情况的通知的标准格式。"
    },
    {
      "indent": 3,
      "text": "EPP uses XML namespaces to provide an extensible object management framework and to identify schemas required for XML instance parsing and validation. These namespaces and schema definitions are used to identify both the base protocol schema and the schemas for managed objects. The specific strings used to associate URIs and namespaces (such as the string \"foo\" in \"xmlns:foo\") in EPP are illustrative and are not needed for interoperability.",
      "zh-CHS": "EPP使用XML名称空间提供可扩展的对象管理框架，并标识XML实例解析和验证所需的模式。这些名称空间和模式定义用于标识基本协议模式和托管对象的模式。EPP中用于关联URI和名称空间的特定字符串（如“xmlns:foo”中的字符串“foo”）是说明性的，互操作性不需要这些字符串。"
    },
    {
      "indent": 3,
      "text": "All XML instances SHOULD begin with an <?xml?> declaration to identify the version of XML that is being used, optionally identify use of the character encoding used, and optionally provide a hint to an XML parser that an external schema file is needed to validate the XML instance. Conformant XML parsers recognize both UTF-8 (defined in RFC 2279 [RFC2279]) and UTF-16 (defined in RFC 2781 [RFC2781]); per RFC 2277 [RFC2277] UTF-8 is the RECOMMENDED character encoding for use with EPP.",
      "zh-CHS": "所有XML实例都应该以<？XML？>声明开始，以标识正在使用的XML版本，可以选择标识所用字符编码的使用，还可以选择向XML解析器提供提示，提示需要外部架构文件来验证XML实例。一致性XML解析器识别UTF-8（在RFC 2279[RFC2279]中定义）和UTF-16（在RFC 2781[RFC2781]中定义）；根据RFC 2277[RFC2277]UTF-8是推荐用于EPP的字符编码。"
    },
    {
      "indent": 3,
      "text": "Character encodings other than UTF-8 and UTF-16 are allowed by XML. UTF-8 is the default encoding assumed by XML in the absence of an \"encoding\" attribute or a byte order mark (BOM), thus the \"encoding\" attribute in the XML declaration is OPTIONAL if UTF-8 encoding is used.",
      "zh-CHS": "XML允许UTF-8和UTF-16以外的字符编码。UTF-8是XML在没有“encoding”属性或字节顺序标记（BOM）的情况下采用的默认编码，因此，如果使用UTF-8编码，则XML声明中的“encoding”属性是可选的。"
    },
    {
      "indent": 3,
      "text": "Normative section 4.3.3 and non-normative appendix F of [XML] describe use of a BOM to identify the character encoding in the absence of an XML declaration or encapsulating headers. Appendix F includes a BOM to represent UTF-8 encoding, though section 4.3.3 notes that a BOM is not needed to identify UTF-8 encoding. Section 4.3.3 was later amended (see [XMLE]) to clarify that a BOM MAY be used to identify UTF-8 encoding. EPP clients and servers MUST accept a UTF-8 BOM if present, though emitting a UTF-8 BOM is NOT RECOMMENDED.",
      "zh-CHS": "[XML]的规范性第4.3.3节和非规范性附录F描述了在没有XML声明或封装标题的情况下，使用BOM标识字符编码。附录F包括一个表示UTF-8编码的BOM表，尽管第4.3.3节指出，标识UTF-8编码不需要BOM表。随后对第4.3.3节进行了修订（见[XMLE]），以澄清BOM可用于识别UTF-8编码。EPP客户端和服务器必须接受UTF-8 BOM（如果存在），但不建议发出UTF-8 BOM。"
    },
    {
      "indent": 3,
      "text": "Example XML declarations:",
      "zh-CHS": "XML声明示例："
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" standalone=\"no\"?>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\"?>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.1. Transport Mapping Considerations",
      "section_title": true,
      "zh-CHS": "2.1. 传输映射注意事项"
    },
    {
      "indent": 3,
      "text": "As described previously, EPP can be layered over multiple transport protocols. There are, however, a common set of considerations that MUST be addressed by any transport mapping defined for EPP. These include:",
      "zh-CHS": "如前所述，EPP可以在多个传输协议上分层。但是，有一组常见的注意事项必须由为EPP定义的任何传输映射来解决。这些措施包括："
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST preserve command order.",
      "zh-CHS": "- 传输映射必须保留命令顺序。"
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST address the relationship between sessions and the client-server connection concept.",
      "zh-CHS": "- 传输映射必须解决会话和客户机-服务器连接概念之间的关系。"
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST preserve the stateful nature of the protocol.",
      "zh-CHS": "- 传输映射必须保持协议的状态性质。"
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST frame data units.",
      "zh-CHS": "- 传输映射必须包含帧数据单元。"
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST be onto a transport such as TCP [RFC793] or SCTP [RFC2960] that provides congestion avoidance that follows RFC 2914 [RFC2914], or if it maps onto a protocol such as SMTP [RFC2821] or BEEP [RFC3080], then the performance issues need to take into account issues of overload, server availability and so forth.",
      "zh-CHS": "- 传输映射必须映射到诸如TCP[RFC793]或SCTP[RFC2960]之类的传输上，该传输提供RFC 2914[RFC2914]之后的拥塞避免，或者如果它映射到诸如SMTP[RFC2821]或BEEP[RFC3080]之类的协议上，则性能问题需要考虑过载、服务器可用性等问题。"
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST ensure reliability.",
      "zh-CHS": "- 传输映射必须确保可靠性。"
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST explicitly allow or prohibit pipelining.",
      "zh-CHS": "- 传输映射必须明确允许或禁止流水线。"
    },
    {
      "indent": 3,
      "text": "Pipelining, also known as command streaming, is when a client sends multiple commands to a server without waiting for each corresponding response. After sending the commands, the client waits for the responses to arrive in the order corresponding to the completed commands. Performance gains can sometimes be realized with pipelining, especially with high latency transports, but there are additional considerations associated with defining a transport mapping that supports pipelining:",
      "zh-CHS": "流水线，也称为命令流，是指客户端向服务器发送多个命令而不等待每个相应的响应。发送命令后，客户机等待响应按照与完成的命令对应的顺序到达。有时可以通过流水线实现性能提升，特别是对于高延迟传输，但定义支持流水线的传输映射时还有其他考虑因素："
    },
    {
      "indent": 3,
      "text": "- Commands MUST be processed independent of each other.",
      "zh-CHS": "- 命令必须相互独立地处理。"
    },
    {
      "indent": 3,
      "text": "- Depending on the transport, pipelining MAY be possible in the form of sending a complete session in a well-defined \"batch\".",
      "zh-CHS": "- 根据传输方式的不同，可以通过在定义良好的“批处理”中发送完整会话的形式进行管道传输。"
    },
    {
      "indent": 3,
      "text": "- The transport mapping MUST describe how an error in processing a command affects continued operation of the session.",
      "zh-CHS": "- 传输映射必须描述处理命令时的错误如何影响会话的继续操作。"
    },
    {
      "indent": 3,
      "text": "A transport mapping MUST explain how all of these requirements are met given the transport protocol being used to exchange data.",
      "zh-CHS": "传输映射必须解释在使用传输协议交换数据的情况下，如何满足所有这些要求。"
    },
    {
      "indent": 0,
      "text": "2.2. Protocol Identification",
      "section_title": true,
      "zh-CHS": "2.2. 协议识别"
    },
    {
      "indent": 3,
      "text": "All EPP XML instances MUST begin with an <epp> element. This element identifies the start of an EPP protocol element, the namespace used within the protocol, and the location of the protocol schema. The <epp> start element and the associated </epp> ending element MUST be applied to all structures sent by both clients and servers.",
      "zh-CHS": "所有EPP XML实例必须以<EPP>元素开头。此元素标识EPP协议元素的开始、协议中使用的名称空间以及协议架构的位置。<epp>开始元素和相关的</epp>结束元素必须应用于客户端和服务器发送的所有结构。"
    },
    {
      "indent": 3,
      "text": "Example \"start\" and \"end\" EPP elements:",
      "zh-CHS": "“开始”和“结束”EPP元素示例："
    },
    {
      "indent": 3,
      "text": "<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\n     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\n     epp-1.0.xsd\">\n</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.3. Hello Format",
      "section_title": true,
      "zh-CHS": "2.3. 你好格式"
    },
    {
      "indent": 3,
      "text": "EPP MAY be carried over both connection-oriented and connection-less transport protocols. An EPP client MAY request a <greeting> from an EPP server at any time by sending a <hello> to a server. Use of this element is essential in a connection-less environment where a server can not return a <greeting> in response to a client-initiated connection. An EPP <hello> MUST be an empty element with no child elements.",
      "zh-CHS": "EPP可以通过面向连接和无连接的传输协议进行传输。EPP客户端可以通过向服务器发送<hello>，随时从EPP服务器请求<greeting>。在无连接的环境中，此元素的使用非常重要，在这种环境中，服务器无法返回<greeting>以响应客户端启动的连接。EPP<hello>必须是没有子元素的空元素。"
    },
    {
      "indent": 3,
      "text": "Example <hello>:",
      "zh-CHS": "示例<hello>："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <hello/>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.4. Greeting Format",
      "section_title": true,
      "zh-CHS": "2.4. 问候语格式"
    },
    {
      "indent": 3,
      "text": "An EPP server responds to a successful connection and <hello> element by returning a <greeting> element to the client. An EPP greeting contains the following elements:",
      "zh-CHS": "EPP服务器通过向客户端返回<greeting>元素来响应成功的连接和<hello>元素。EPP问候语包含以下元素："
    },
    {
      "indent": 3,
      "text": "- An <svID> element that contains the name of the server.",
      "zh-CHS": "- 包含服务器名称的<svID>元素。"
    },
    {
      "indent": 3,
      "text": "- An <svDate> element that contains the server's current date and time in UTC.",
      "zh-CHS": "- 包含服务器当前UTC日期和时间的<svDate>元素。"
    },
    {
      "indent": 3,
      "text": "- An <svcMenu> element that identifies the services supported by the server, including:",
      "zh-CHS": "- 标识服务器支持的服务的<svcMenu>元素，包括："
    },
    {
      "indent": 3,
      "text": "- One or more <version> elements that identify the protocol versions supported by the server.",
      "zh-CHS": "- 标识服务器支持的协议版本的一个或多个<version>元素。"
    },
    {
      "indent": 3,
      "text": "- One or more <lang> elements that contain the identifiers of the text response languages known by the server. Language identifiers MUST be structured as documented in [RFC3066].",
      "zh-CHS": "- 包含服务器已知的文本响应语言标识符的一个或多个<lang>元素。语言标识符的结构必须如[RFC3066]中所述。"
    },
    {
      "indent": 3,
      "text": "- One or more <objURI> elements that contain namespace URIs representing the objects that the server is capable of managing. A server MAY limit object management privileges on a per-client basis.",
      "zh-CHS": "- 一个或多个<objURI>元素，其中包含表示服务器能够管理的对象的命名空间URI。服务器可以基于每个客户端限制对象管理权限。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <svcExtension> element that contains one or more <extURI> elements that contain namespace URIs representing object extensions supported by the server.",
      "zh-CHS": "- 可选的<svctension>元素，包含一个或多个<extURI>元素，这些元素包含表示服务器支持的对象扩展的命名空间URI。"
    },
    {
      "indent": 3,
      "text": "- A <dcp> (data collection policy) element that contains child elements used to describe the server's privacy policy for data collection and management. Policy implications usually extend beyond the client-server relationship. Both clients and servers can have relationships with other entities that need to know the server operator's data collection policy to make informed provisioning decisions. Policy information MUST be disclosed to provisioning entities, though the method of disclosing policy data outside of direct protocol interaction is beyond the scope of this specification. Child elements include the following:",
      "zh-CHS": "- 一个<dcp>（数据收集策略）元素，包含用于描述服务器数据收集和管理隐私策略的子元素。策略含义通常超出了客户机-服务器关系。客户机和服务器都可以与其他实体建立关系，这些实体需要了解服务器运营商的数据收集策略，才能做出明智的资源调配决策。策略信息必须披露给供应实体，尽管在直接协议交互之外披露策略数据的方法超出了本规范的范围。子元素包括以下内容："
    },
    {
      "indent": 3,
      "text": "- An <access> element that describes the access provided by the server to the client on behalf of the originating data source. The <access> element MUST contain one of the following child elements:",
      "zh-CHS": "- 一个<access>元素，描述服务器代表原始数据源向客户端提供的访问。<access>元素必须包含以下子元素之一："
    },
    {
      "indent": 9,
      "text": "<all/>: Access is given to all identified data.",
      "zh-CHS": "<all/>：访问所有已识别的数据。"
    },
    {
      "indent": 9,
      "text": "<none/>: No access is provided to identified data.",
      "zh-CHS": "<none/>：不提供对已识别数据的访问。"
    },
    {
      "indent": 9,
      "text": "<null/>: Data is not persistent, so no access is possible.",
      "zh-CHS": "<null/>：数据不是持久性的，因此无法访问。"
    },
    {
      "indent": 9,
      "text": "<personal/>: Access is given to identified data relating to individuals and organizational entities.",
      "zh-CHS": "<personal/>：允许访问与个人和组织实体相关的已识别数据。"
    },
    {
      "indent": 9,
      "text": "<personalAndOther/>: Access is given to identified data relating to individuals, organizational entities, and other data of a non-personal nature.",
      "zh-CHS": "<personalAndOther/>：允许访问与个人、组织实体和其他非个人性质的数据相关的已识别数据。"
    },
    {
      "indent": 9,
      "text": "<other/>: Access is given to other identified data of a non-personal nature.",
      "zh-CHS": "<other/>：允许访问非个人性质的其他已识别数据。"
    },
    {
      "indent": 3,
      "text": "- One or more <statement> elements that describe data collection purposes, data recipients, and data retention. Each <statement> element MUST contain a <purpose> element, a <recipient> element, and a <retention> element.",
      "zh-CHS": "- 描述数据收集目的、数据接收方和数据保留的一个或多个<statement>元素。每个<statement>元素必须包含<purpose>元素、<recipient>元素和<retention>元素。"
    },
    {
      "indent": 3,
      "text": "The <purpose> element MUST contain one or more of the following child elements that describe the purposes for which data is collected:",
      "zh-CHS": "<purpose>元素必须包含以下一个或多个子元素，这些子元素描述了收集数据的目的："
    },
    {
      "indent": 6,
      "text": "<admin/>: Administrative purposes. Information can be used for administrative and technical support of the provisioning system.",
      "zh-CHS": "<admin/>：管理目的。信息可用于供应系统的管理和技术支持。"
    },
    {
      "indent": 6,
      "text": "<contact/>: Contact for marketing purposes. Information can be used to contact individuals, through a communications channel other than the protocol, for the promotion of a product or service.",
      "zh-CHS": "<contact/>：出于营销目的联系。信息可用于通过协议以外的通信渠道联系个人，以推广产品或服务。"
    },
    {
      "indent": 6,
      "text": "<prov/>: Object provisioning purposes. Information can be used to identify objects and inter-object relationships.",
      "zh-CHS": "<prov/>：对象配置目的。信息可用于标识对象和对象间关系。"
    },
    {
      "indent": 6,
      "text": "<other/>: Other purposes. Information may be used in other ways not captured by the above definitions.",
      "zh-CHS": "<other/>：其他目的。信息可用于上述定义未涵盖的其他方式。"
    },
    {
      "indent": 6,
      "text": "The <recipient> element MUST contain one or more of the following child elements that describes the recipients of collected data:",
      "zh-CHS": "<recipient>元素必须包含以下一个或多个子元素，用于描述所收集数据的收件人："
    },
    {
      "indent": 9,
      "text": "<other/>: Other entities following unknown practices.",
      "zh-CHS": "<other/>：遵循未知实践的其他实体。"
    },
    {
      "indent": 9,
      "text": "<ours>: Server operator and/or entities acting as agents or entities for whom the server operator is acting as an agent. An agent in this instance is defined as a third party that processes data only on behalf of the service provider for the completion of the stated purposes. The <ours> element contains an OPTIONAL <recDesc> element that can be used to describe the recipient.",
      "zh-CHS": "<ours>：服务器运营商和/或作为代理的实体或服务器运营商作为代理的实体。在此实例中，代理被定义为仅代表服务提供商处理数据以完成所述目的的第三方。<ours>元素包含一个可选的<recDesc>元素，可用于描述收件人。"
    },
    {
      "indent": 9,
      "text": "<public/>: Public forums.",
      "zh-CHS": "<public/>：公共论坛。"
    },
    {
      "indent": 9,
      "text": "<same/>: Other entities following server practices.",
      "zh-CHS": "<same/>：遵循服务器实践的其他实体。"
    },
    {
      "indent": 9,
      "text": "<unrelated/>: Unrelated third parties.",
      "zh-CHS": "<unrelated/>：不相关的第三方。"
    },
    {
      "indent": 6,
      "text": "The <retention> element MUST contain one of the following child elements that describes data retention practices:",
      "zh-CHS": "<retention>元素必须包含以下描述数据保留实践的子元素之一："
    },
    {
      "indent": 9,
      "text": "<business/>: Data persists per business practices.",
      "zh-CHS": "<business/>：数据根据业务实践持续存在。"
    },
    {
      "indent": 9,
      "text": "<indefinite/>: Data persists indefinitely.",
      "zh-CHS": "<infinite/>：数据无限期地存在。"
    },
    {
      "indent": 9,
      "text": "<legal/>: Data persists per legal requirements.",
      "zh-CHS": "<legal/>：数据按照法律要求保存。"
    },
    {
      "indent": 9,
      "text": "<none/>: Data is not persistent, and is not retained for more than a brief period of time necessary to make use of it during the course of a single online interaction.",
      "zh-CHS": "<none/>：数据不是持久性的，在单个在线交互过程中，数据的保留时间不会超过使用它所需的短暂时间。"
    },
    {
      "indent": 9,
      "text": "<stated/>: Data persists to meet the stated purpose.",
      "zh-CHS": "<stated/>：数据持续存在以满足所述目的。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <expiry> element that describes the lifetime of the policy. The <expiry> element MUST contain one of the following child elements:",
      "zh-CHS": "- 描述策略生存期的可选<expiry>元素。<expiry>元素必须包含以下子元素之一："
    },
    {
      "indent": 9,
      "text": "<absolute/>: The policy is valid from the current date and time until it expires on the specified date and time.",
      "zh-CHS": "<absolute/>：该策略从当前日期和时间起有效，直到在指定日期和时间过期。"
    },
    {
      "indent": 9,
      "text": "<relative/>: The policy is valid from the current date and time until the end of the specified duration.",
      "zh-CHS": "<relative/>：策略从当前日期和时间起有效，直到指定的持续时间结束。"
    },
    {
      "indent": 3,
      "text": "Data collection policy elements are based on work described in the World Wide Web Consortium's Platform for Privacy Preferences [P3P] specification.",
      "zh-CHS": "数据收集政策要素基于万维网联盟的隐私偏好平台[P3P]规范中描述的工作。"
    },
    {
      "indent": 3,
      "text": "Example greeting:",
      "zh-CHS": "问候语示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <greeting>\nS:    <svID>Example EPP server epp.example.com</svID>\nS:    <svDate>2000-06-08T22:00:00.0Z</svDate>\nS:    <svcMenu>\nS:      <version>1.0</version>\nS:      <lang>en</lang>\nS:      <lang>fr</lang>\nS:      <objURI>urn:ietf:params:xml:ns:obj1</objURI>\nS:      <objURI>urn:ietf:params:xml:ns:obj2</objURI>\nS:      <objURI>urn:ietf:params:xml:ns:obj3</objURI>\nS:      <svcExtension>\nS:        <extURI>http://custom/obj1ext-1.0</extURI>\nS:      </svcExtension>\nS:    </svcMenu>\nS:    <dcp>\nS:      <access><all/></access>\nS:      <statement>\nS:        <purpose><admin/><prov/></purpose>\nS:        <recipient><ours/><public/></recipient>\nS:        <retention><stated/></retention>\nS:      </statement>\nS:    </dcp>\nS:  </greeting>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.5. Command Format",
      "section_title": true,
      "zh-CHS": "2.5. 命令格式"
    },
    {
      "indent": 3,
      "text": "An EPP client interacts with an EPP server by sending a command to the server and receiving a response from the server. In addition to the standard EPP elements, an EPP command contains the following elements:",
      "zh-CHS": "EPP客户端通过向服务器发送命令并从服务器接收响应来与EPP服务器交互。除标准EPP元素外，EPP命令还包含以下元素："
    },
    {
      "indent": 3,
      "text": "- A command element whose tag corresponds to one of the valid EPP commands described in this document. The command element MAY contain either protocol-specified or object-specified child elements.",
      "zh-CHS": "- 一种命令元素，其标记对应于本文档中描述的有效EPP命令之一。command元素可以包含协议指定的子元素或对象指定的子元素。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <extension> element that MAY be used for server-defined command extensions.",
      "zh-CHS": "- 可选的<extension>元素，可用于服务器定义的命令扩展。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <clTRID> (client transaction identifier) element that MAY be used to uniquely identify the command to the client. Clients are responsible for maintaining their own transaction identifier space to ensure uniqueness.",
      "zh-CHS": "- 可选的<clTRID>（客户端事务标识符）元素，可用于唯一地标识客户端的命令。客户机负责维护自己的事务标识符空间，以确保唯一性。"
    },
    {
      "indent": 3,
      "text": "Example command with object-specified child elements:",
      "zh-CHS": "具有指定对象的子元素的命令示例："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <info>\nC:      <obj:info xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <obj:name>example</obj:name>\nC:      </obj:info>\nC:    </info>\nC:    <clTRID>ABC-12345</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.6. Response Format",
      "section_title": true,
      "zh-CHS": "2.6. 响应格式"
    },
    {
      "indent": 3,
      "text": "An EPP server responds to a client command by returning a response to the client. EPP commands are atomic, so a command will either succeed completely or fail completely. Success and failure results MUST NOT be mixed. In addition to the standard EPP elements, an EPP response contains the following elements:",
      "zh-CHS": "EPP服务器通过向客户端返回响应来响应客户端命令。EPP命令是原子的，因此命令要么完全成功，要么完全失败。成功和失败的结果不能混为一谈。除标准EPP元素外，EPP响应还包含以下元素："
    },
    {
      "indent": 3,
      "text": "- One or more <result> elements that document the success or failure of command execution. If the command was processed successfully, only one <result> element MUST be returned. If the command was not processed successfully, multiple <result> elements MAY be returned to document failure conditions. Each <result> element contains the following attribute and child elements:",
      "zh-CHS": "- 记录命令执行成功或失败的一个或多个<result>元素。如果命令处理成功，则只能返回一个<result>元素。如果未成功处理该命令，则可能会将多个<result>元素返回到文档失败条件。每个<result>元素包含以下属性和子元素："
    },
    {
      "indent": 6,
      "text": "- A \"code\" attribute whose value is a four-digit, decimal number that describes the success or failure of the command.",
      "zh-CHS": "- 一种“代码”属性，其值为四位十进制数字，用于描述命令的成功或失败。"
    },
    {
      "indent": 6,
      "text": "- A <msg> element containing a human-readable description of the response code. The language of the response is identified via an OPTIONAL \"lang\" attribute. If not specified, the default attribute value MUST be \"en\" (English).",
      "zh-CHS": "- 包含人类可读的响应代码描述的<msg>元素。响应的语言通过可选的“lang”属性标识。如果未指定，则默认属性值必须为“en”（英语）。"
    },
    {
      "indent": 6,
      "text": "- Zero or more OPTIONAL <value> elements that identify a client-provided element (including XML tag and value) that caused a server error condition.",
      "zh-CHS": "- 零个或多个可选<value>元素，用于标识导致服务器错误情况的客户端提供的元素（包括XML标记和值）。"
    },
    {
      "indent": 6,
      "text": "- Zero or more OPTIONAL <extValue> elements that can be used to provide additional error diagnostic information, including:",
      "zh-CHS": "- 零个或多个可选<extValue>元素，可用于提供额外的错误诊断信息，包括："
    },
    {
      "indent": 9,
      "text": "- A <value> element that identifies a client-provided element (including XML tag and value) that caused a server error condition.",
      "zh-CHS": "- 一个<value>元素，标识导致服务器错误情况的客户端提供的元素（包括XML标记和值）。"
    },
    {
      "indent": 9,
      "text": "- A <reason> element containing a human-readable message that describes the reason for the error. The language of the response is identified via an OPTIONAL \"lang\" attribute. If not specified, the default attribute value MUST be \"en\" (English).",
      "zh-CHS": "- 一个<reason>元素，包含描述错误原因的可读消息。响应的语言通过可选的“lang”属性标识。如果未指定，则默认属性值必须为“en”（英语）。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <msgQ> element that describes messages queued for client retrieval. A <msgQ> element MUST NOT be present if there are no messages queued for client retrieval. A <msgQ> element MAY be present in responses to EPP commands other than the <poll> command if messages are queued for retrieval. A <msgQ> element MUST be present in responses to the EPP <poll> command if messages are queued for retrieval. The <msgQ> element contains the following attributes:",
      "zh-CHS": "- 可选的<msgQ>元素，用于描述排队等待客户端检索的消息。如果没有排队等待客户端检索的消息，<msgQ>元素必须不存在。如果消息排队等待检索，则响应EPP命令时可能会出现<msgQ>元素，而不是<poll>命令。如果消息排队等待检索，则响应EPP<poll>命令时必须存在<msgQ>元素。<msgQ>元素包含以下属性："
    },
    {
      "indent": 3,
      "text": "- A \"count\" attribute that describes the number of messages that exist in the queue.",
      "zh-CHS": "- 描述队列中存在的消息数的“count”属性。"
    },
    {
      "indent": 3,
      "text": "- An \"id\" attribute used to uniquely identify the message at the head of the queue.",
      "zh-CHS": "- “id”属性，用于唯一标识队列头部的消息。"
    },
    {
      "indent": 3,
      "text": "The <msgQ> element contains the following OPTIONAL child elements that MUST be returned in response to a <poll> request command and MUST NOT be returned in response to any other command, including a <poll> acknowledgement:",
      "zh-CHS": "<msgQ>元素包含以下可选子元素，这些子元素必须在响应<poll>请求命令时返回，不得在响应任何其他命令（包括<poll>确认）时返回："
    },
    {
      "indent": 3,
      "text": "- A <qDate> element that contains the date and time that the message was enqueued.",
      "zh-CHS": "- 包含消息排队日期和时间的<qDate>元素。"
    },
    {
      "indent": 3,
      "text": "- A <msg> element containing a human-readable message. The language of the response is identified via an OPTIONAL \"lang\" attribute. If not specified, the default attribute value MUST be \"en\" (English). This element MAY contain XML content for formatting purposes, but the XML content is not specified by the protocol and will thus not be processed for validity.",
      "zh-CHS": "- 包含人类可读消息的<msg>元素。响应的语言通过可选的“lang”属性标识。如果未指定，则默认属性值必须为“en”（英语）。出于格式化目的，此元素可能包含XML内容，但协议未指定XML内容，因此不会对其进行有效性处理。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <resData> (response data) element that contains child elements specific to the command and associated object.",
      "zh-CHS": "- 可选的<resData>（响应数据）元素，包含特定于命令和关联对象的子元素。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <extension> element that MAY be used for server-defined response extensions.",
      "zh-CHS": "- 可选的<extension>元素，可用于服务器定义的响应扩展。"
    },
    {
      "indent": 3,
      "text": "- A <trID> (transaction identifier) element containing the transaction identifier assigned by the server to the command for which the response is being returned. The transaction identifier is formed using the <clTRID> associated with the command if supplied by the client and a <svTRID> (server transaction identifier) that is assigned by and unique to the server.",
      "zh-CHS": "- 一个<trID>（事务标识符）元素，包含由服务器分配给要返回响应的命令的事务标识符。如果由客户端提供，则使用与命令关联的<clTRID>和由服务器分配且唯一的<svTRID>（服务器事务标识符）形成事务标识符。"
    },
    {
      "indent": 6,
      "text": "Transaction identifiers provide command-response synchronization integrity. They SHOULD be logged, retained, and protected to ensure that both the client and the server have consistent temporal and state management records.",
      "zh-CHS": "事务标识符提供命令响应同步完整性。它们应该被记录、保留和保护，以确保客户端和服务器具有一致的时间和状态管理记录。"
    },
    {
      "indent": 3,
      "text": "Example response without <value> or <resData>:",
      "zh-CHS": "没有<value>或<resData>的响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg lang=\"en\">Command completed successfully</msg>\nS:    </result>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example response with <resData>:",
      "zh-CHS": "带有<resData>的响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <resData>\nS:      <obj:creData xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nS:        <obj:name>example</obj:name>\nS:      </obj:creData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example response with error value elements:",
      "zh-CHS": "带有错误值元素的响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"2004\">\nS:      <msg>Parameter value range error</msg>\nS:      <value xmlns:obj=\"urn:ietf:params:xml:ns:obj\">\nS:        <obj:elem1>2525</obj:elem1>\nS:      </value>\nS:    </result>\nS:    <result code=\"2005\">\nS:      <msg>Parameter value syntax error</msg>\nS:      <value xmlns:obj=\"urn:ietf:params:xml:ns:obj\">\nS:        <obj:elem2>ex(ample</obj:elem2>\nS:      </value>\nS:      <extValue>\nS:        <value xmlns:obj=\"urn:ietf:params:xml:ns:obj\">\nS:          <obj:elem3>abc.ex(ample</obj:elem3>\nS:        </value>\nS:        <reason>Invalid character found.</reason>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "S:      </extValue>\nS:    </result>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example response with notice of waiting server messages:",
      "zh-CHS": "带有等待服务器消息通知的响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <msgQ count=\"5\" id=\"12345\"/>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Command success or failure MUST NOT be assumed if no response is returned or if a returned response is malformed. Protocol idempotency ensures the safety of retrying a command in cases of response delivery failure.",
      "zh-CHS": "如果未返回响应或返回的响应格式不正确，则不得假定命令成功或失败。协议幂等性确保在响应传递失败的情况下重试命令的安全性。"
    },
    {
      "indent": 0,
      "text": "2.7. Protocol Extension Framework",
      "section_title": true,
      "zh-CHS": "2.7. 协议扩展框架"
    },
    {
      "indent": 3,
      "text": "EPP provides an extension framework that allows features to be added at the protocol, object, and command-response levels.",
      "zh-CHS": "EPP提供了一个扩展框架，允许在协议、对象和命令响应级别添加功能。"
    },
    {
      "indent": 0,
      "text": "2.7.1. Protocol Extension",
      "section_title": true,
      "zh-CHS": "2.7.1. 协议扩展"
    },
    {
      "indent": 3,
      "text": "The EPP extension framework allows for definition of new protocol elements identified using XML namespace notation with a reference to an XML schema that defines the namespace. The <epp> element that identifies the beginning of a protocol instance includes multiple child element choices, one of which is an <extension> element whose children define the extension. For example, a protocol extension element would be described in generic terms as follows:",
      "zh-CHS": "EPP扩展框架允许定义使用XML名称空间表示法标识的新协议元素，并引用定义名称空间的XML模式。标识协议实例开头的<epp>元素包括多个子元素选择，其中一个是<extension>元素，其子元素定义扩展。例如，协议扩展元素将以通用术语描述如下："
    },
    {
      "indent": 3,
      "text": "C:<epp>\nC:  <extension>\nC:    <!-- One or more extension elements. -->\nC:    <ext:foo xmlns:ext=\"urn:ietf:params:xml:ns:ext\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:ext ext.xsd\">\nC:      <!-- One or more extension child elements. -->\nC:    </ext:foo>\nC:  </extension>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document does not define mappings for specific extensions. Extension specifications MUST be described in separate documents that define the objects and operations subject to the extension.",
      "zh-CHS": "本文档不定义特定扩展的映射。扩展规范必须在定义扩展对象和操作的单独文档中描述。"
    },
    {
      "indent": 0,
      "text": "2.7.2. Object Extension",
      "section_title": true,
      "zh-CHS": "2.7.2. 对象扩展"
    },
    {
      "indent": 3,
      "text": "EPP provides an extensible object management framework that defines the syntax and semantics of protocol operations applied to a managed object. This framework pushes the definition of each protocol operation into the context of a specific object, providing the ability to add mappings for new objects without having to modify the base protocol.",
      "zh-CHS": "EPP提供了一个可扩展的对象管理框架，该框架定义了应用于托管对象的协议操作的语法和语义。该框架将每个协议操作的定义推送到特定对象的上下文中，提供了为新对象添加映射的能力，而无需修改基本协议。"
    },
    {
      "indent": 3,
      "text": "Protocol elements that contain data specific to objects are identified using XML namespace notation with a reference to an XML schema that defines the namespace. The schema for EPP supports use of dynamic object schemas on a per-command and per-response basis. For example, the start of an object-specific command element would be described in generic terms as follows:",
      "zh-CHS": "包含特定于对象的数据的协议元素使用XML名称空间表示法标识，并引用定义名称空间的XML模式。EPP模式支持在每个命令和每个响应的基础上使用动态对象模式。例如，特定于对象的命令元素的开始将以通用术语描述如下："
    },
    {
      "indent": 3,
      "text": "C:<EPPCommandName>\nC:  <object:command xmlns:object=\"urn:ietf:params:xml:ns:object\"\nC:   xsi:schemaLocation=\"urn:ietf:params:xml:ns:object object.xsd\">\nC:    <!-- One or more object-specific command elements. -->\nC:  </object:command>\nC:</EPPCommandName>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "An object-specific response element would be described similarly:",
      "zh-CHS": "特定于对象的响应元素将类似地描述："
    },
    {
      "indent": 3,
      "text": "S:<resData>\nS:  <object:resData xmlns:object=\"urn:ietf:params:xml:ns:object\"\nS:   xsi:schemaLocation=\"urn:ietf:params:xml:ns:object object.xsd\">\nS:    <!-- One or more object-specific response elements. -->\nS:  </object:resData>\nS:</resData>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document does not define mappings for specific objects. The mapping of EPP to an object MUST be described in separate documents that specifically address each command and response in the context of the object. A suggested object mapping outline is included as an appendix to this document.",
      "zh-CHS": "本文档不定义特定对象的映射。EPP到对象的映射必须在单独的文档中描述，这些文档专门针对对象上下文中的每个命令和响应。建议的对象映射大纲包含在本文档的附录中。"
    },
    {
      "indent": 0,
      "text": "2.7.3. Command-Response Extension",
      "section_title": true,
      "zh-CHS": "2.7.3. 命令响应扩展"
    },
    {
      "indent": 3,
      "text": "EPP provides a facility for protocol command and response extensions. Protocol commands and responses MAY be extended by an <extension> element that contains additional elements whose syntax and semantics are not explicitly defined by EPP or an EPP object mapping. This element is OPTIONAL. Extensions are typically defined by agreement between client and server and MAY be used to extend EPP for unique operational needs. A server-extended command element would be described in generic terms as follows:",
      "zh-CHS": "EPP为协议命令和响应扩展提供了便利。协议命令和响应可以通过<extension>元素进行扩展，该元素包含语法和语义未由EPP或EPP对象映射明确定义的其他元素。此元素是可选的。扩展通常由客户机和服务器之间的协议定义，可用于扩展EPP以满足独特的操作需求。服务器扩展命令元素将以通用术语描述如下："
    },
    {
      "indent": 3,
      "text": "C:<command>\nC:  <!-- EPPCommandName can be \"create\", \"update\", etc. -->\nC:  <EPPCommandName>\nC:    <object:command xmlns:object=\"urn:ietf:params:xml:ns:object\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:object object.xsd\">\nC:      <!-- One or more object-specific command elements. -->\nC:    </object:command>\nC:  </EPPCommandName>\nC:  <extension>\nC:    <!-- One or more server-defined elements. -->\nC:  </extension>\nC:</command>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "An server-extended response element would be described similarly:",
      "zh-CHS": "服务器扩展响应元素的描述与此类似："
    },
    {
      "indent": 3,
      "text": "S:<response>\nS:  <result code=\"1000\">\nS:    <msg lang=\"en\">Command completed successfully</msg>\nS:  </result>\nS:  <extension>\nS:    <!-- One or more server-defined elements. -->\nS:  </extension>\nS:  <trID>\nS:    <clTRID>ABC-12345</clTRID>\nS:    <svTRID>54321-XYZ</svTRID>\nS:  </trID>\nS:</response>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document does not define any specific server extensions. The mapping of server extensions to EPP MUST be described in separate documents that specifically address extended commands and responses in the server's operational context.",
      "zh-CHS": "本文档未定义任何特定的服务器扩展。服务器扩展到EPP的映射必须在单独的文档中描述，这些文档专门针对服务器操作上下文中的扩展命令和响应。"
    },
    {
      "indent": 0,
      "text": "2.8. Object Identification",
      "section_title": true,
      "zh-CHS": "2.8. 目标识别"
    },
    {
      "indent": 3,
      "text": "Some objects, such as name servers and contacts, can have utility in multiple repositories. However, maintaining disjoint copies of object information in multiple repositories can lead to inconsistencies that have adverse consequences for the Internet. For example, changing a name server name in one repository, but not in a second repository that refers to the server for domain name delegation, can produce unexpected DNS query results.",
      "zh-CHS": "某些对象（如名称服务器和联系人）可以在多个存储库中使用该实用程序。但是，在多个存储库中维护对象信息的不相交副本可能会导致不一致，从而对Internet产生不利影响。例如，在一个存储库中更改名称服务器名称，而不是在引用域名委派服务器的第二个存储库中更改名称服务器名称，可能会产生意外的DNS查询结果。"
    },
    {
      "indent": 3,
      "text": "Globally unique identifiers can help facilitate object information sharing between repositories. A globally unique identifier MUST be assigned to every object when the object is created; the identifier MUST be returned to the client as part of any request to retrieve the detailed attributes of an object. Specific identifier values are a matter of repository policy, but they SHOULD be constructed according to the following algorithm:",
      "zh-CHS": "全局唯一标识符有助于促进存储库之间的对象信息共享。创建对象时，必须为每个对象分配全局唯一标识符；标识符必须作为检索对象详细属性的任何请求的一部分返回给客户端。特定标识符值是存储库策略的问题，但它们应根据以下算法构造："
    },
    {
      "indent": 3,
      "text": "a) Divide the provisioning repository world into a number of object repository classes.",
      "zh-CHS": "a) 将资源调配存储库划分为多个对象存储库类。"
    },
    {
      "indent": 3,
      "text": "b) Each repository within a class is assigned an identifier that is maintained by IANA.",
      "zh-CHS": "b) 类中的每个存储库都分配了一个由IANA维护的标识符。"
    },
    {
      "indent": 3,
      "text": "c) Each repository is responsible for assigning a unique local identifier for each object within the repository.",
      "zh-CHS": "c) 每个存储库负责为存储库中的每个对象分配唯一的本地标识符。"
    },
    {
      "indent": 3,
      "text": "d) The globally unique identifier is a concatenation of the local identifier, followed by a hyphen (\"-\", ASCII value 0x002D), followed by the repository identifier.",
      "zh-CHS": "d) 全局唯一标识符是本地标识符的串联，后跟连字符（“-”，ASCII值0x002D），后跟存储库标识符。"
    },
    {
      "indent": 0,
      "text": "2.9. Protocol Commands",
      "section_title": true,
      "zh-CHS": "2.9. 协议命令"
    },
    {
      "indent": 3,
      "text": "EPP provides commands to manage sessions, retrieve object information, and perform transformation operations on objects. All EPP commands are atomic and designed so that they can be made idempotent, either succeeding completely or failing completely and producing predictable results in case of repeated execution. This section describes each EPP command, including examples with representative server responses.",
      "zh-CHS": "EPP提供用于管理会话、检索对象信息和对对象执行转换操作的命令。所有的EPP命令都是原子的，设计的目的是使它们能够幂等，要么完全成功，要么完全失败，并在重复执行时产生可预测的结果。本节介绍每个EPP命令，包括具有代表性的服务器响应的示例。"
    },
    {
      "indent": 0,
      "text": "2.9.1. Session Management Commands",
      "section_title": true,
      "zh-CHS": "2.9.1. 会话管理命令"
    },
    {
      "indent": 3,
      "text": "EPP provides two commands for session management: <login> to establish a session with a server, and <logout> to end a session with a server. The <login> command establishes an ongoing server session that preserves client identity and authorization information during the duration of the session.",
      "zh-CHS": "EPP为会话管理提供了两个命令：<login>用于建立与服务器的会话，以及<logout>用于结束与服务器的会话。<login>命令建立正在进行的服务器会话，该会话在会话期间保留客户端标识和授权信息。"
    },
    {
      "indent": 0,
      "text": "2.9.1.1. EPP <login> Command",
      "section_title": true,
      "zh-CHS": "2.9.1.1. EPP<login>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <login> command is used to establish a session with an EPP server in response to a greeting issued by the server. A <login> command MUST be sent to a server before any other EPP command to establish an ongoing session. A server operator MAY limit the number of failed login attempts N, 1 <= N <= infinity, after which a login failure results in the connection to the server (if a connection exists) being closed.",
      "zh-CHS": "EPP<login>命令用于与EPP服务器建立会话，以响应服务器发出的问候语。在任何其他EPP命令建立正在进行的会话之前，必须先向服务器发送<login>命令。服务器操作员可以限制失败的登录尝试次数N，1<=N<=无穷大，之后登录失败导致与服务器的连接（如果存在连接）关闭。"
    },
    {
      "indent": 3,
      "text": "A client identifier and initial password MUST be created on the server before a client can successfully complete a <login> command. The client identifier and initial password MUST be delivered to the client using an out-of-band method that protects the identifier and password from inadvertent disclosure.",
      "zh-CHS": "在客户端成功完成<login>命令之前，必须在服务器上创建客户端标识符和初始密码。必须使用带外方法将客户端标识符和初始密码传递给客户端，以保护标识符和密码不被无意中泄露。"
    },
    {
      "indent": 3,
      "text": "In addition to the standard EPP command elements, the <login> command contains the following child elements:",
      "zh-CHS": "除了标准EPP命令元素外，<login>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- A <clID> element that contains the client identifier assigned to the client by the server.",
      "zh-CHS": "- 包含服务器分配给客户机的客户机标识符的<clID>元素。"
    },
    {
      "indent": 3,
      "text": "- A <pw> element that contains the client's plain text password. The value of this element is case sensitive.",
      "zh-CHS": "- 包含客户端纯文本密码的<pw>元素。此元素的值区分大小写。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <newPW> element that contains a new plain text password to be assigned to the client for use with subsequent <login> commands. The value of this element is case sensitive.",
      "zh-CHS": "- 一个可选的<newPW>元素，其中包含一个新的纯文本密码，该密码将分配给客户端，用于后续的<login>命令。此元素的值区分大小写。"
    },
    {
      "indent": 3,
      "text": "- An <options> element that contains the following child elements:",
      "zh-CHS": "- 包含以下子元素的<options>元素："
    },
    {
      "indent": 6,
      "text": "- A <version> element that contains the protocol version to be used for the command or ongoing server session.",
      "zh-CHS": "- 包含用于命令或正在进行的服务器会话的协议版本的<version>元素。"
    },
    {
      "indent": 6,
      "text": "- A <lang> element that contains the text response language to be used for the command or ongoing server session commands.",
      "zh-CHS": "- 包含用于命令或正在进行的服务器会话命令的文本响应语言的<lang>元素。"
    },
    {
      "indent": 3,
      "text": "The values of the <version> and <lang> elements MUST exactly match one of the values presented in the EPP greeting.",
      "zh-CHS": "<version>和<lang>元素的值必须与EPP问候语中显示的一个值完全匹配。"
    },
    {
      "indent": 3,
      "text": "- A <svcs> element that contains one or more <objURI> elements that contain namespace URIs representing the objects to be managed during the session. The <svcs> element MAY contain an OPTIONAL <svcExtension> element that contains one or more <extURI> elements that identify object extensions to be used during the session.",
      "zh-CHS": "- 一个<svcs>元素，包含一个或多个<objURI>元素，这些元素包含表示会话期间要管理的对象的命名空间URI。<svcs>元素可能包含可选的<svctension>元素，该元素包含一个或多个<extURI>元素，这些元素标识会话期间要使用的对象扩展。"
    },
    {
      "indent": 3,
      "text": "The PLAIN SASL mechanism presented in [RFC2595] describes a format for providing a user identifier, an authorization identifier, and a password as part of a single plain text string. The EPP authentication mechanism is similar, though EPP does not require a session-level authorization identifier and the user identifier and password are separated into distinct XML elements. Additional identification and authorization schemes MUST be provided at other protocol layers to provide more robust security services.",
      "zh-CHS": "[RFC2595]中介绍的纯SASL机制描述了一种格式，用于作为单个纯文本字符串的一部分提供用户标识符、授权标识符和密码。EPP身份验证机制类似，但EPP不需要会话级授权标识符，并且用户标识符和密码被分离为不同的XML元素。必须在其他协议层提供额外的标识和授权方案，以提供更强健的安全服务。"
    },
    {
      "indent": 3,
      "text": "Example <login> command:",
      "zh-CHS": "示例<login>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <login>\nC:      <clID>ClientX</clID>\nC:      <pw>foo-BAR2</pw>\nC:      <newPW>bar-FOO2</newPW>\nC:      <options>\nC:        <version>1.0</version>\nC:        <lang>en</lang>\nC:      </options>\nC:      <svcs>\nC:        <objURI>urn:ietf:params:xml:ns:obj1</objURI>\nC:        <objURI>urn:ietf:params:xml:ns:obj2</objURI>\nC:        <objURI>urn:ietf:params:xml:ns:obj3</objURI>\nC:        <svcExtension>\nC:          <extURI>http://custom/obj1ext-1.0</extURI>\nC:        </svcExtension>\nC:      </svcs>\nC:    </login>\nC:    <clTRID>ABC-12345</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <login> command has been processed successfully, a server MUST respond with an EPP response with no <resData> element. If successful, the server will respond by creating and maintaining a new session that SHOULD be terminated by a future <logout> command.",
      "zh-CHS": "成功处理<login>命令后，服务器必须使用不带<resData>元素的EPP响应进行响应。如果成功，服务器将通过创建和维护一个新的会话来响应，该会话将由将来的<logout>命令终止。"
    },
    {
      "indent": 3,
      "text": "Example <login> response:",
      "zh-CHS": "示例<login>响应："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <login> command is used to establish a session with an EPP server. A <login> command MUST be rejected if received within the bounds of an existing session. This action MUST be open to all authorized clients.",
      "zh-CHS": "EPP<login>命令用于与EPP服务器建立会话。如果在现有会话的范围内接收到<login>命令，则必须拒绝该命令。此操作必须对所有授权客户开放。"
    },
    {
      "indent": 0,
      "text": "2.9.1.2. EPP <logout> Command",
      "section_title": true,
      "zh-CHS": "2.9.1.2. EPP<logout>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <logout> command is used to end a session with an EPP server. The <logout> command MUST be represented as an empty element with no child elements.",
      "zh-CHS": "EPP<logout>命令用于结束与EPP服务器的会话。<logout>命令必须表示为没有子元素的空元素。"
    },
    {
      "indent": 3,
      "text": "A server MAY end a session due to client inactivity or excessive client session longevity. The parameters for determining excessive client inactivity or session longevity are a matter of server policy and are not specified by this protocol.",
      "zh-CHS": "由于客户端不活动或客户端会话持续时间过长，服务器可能会结束会话。用于确定客户端过度不活动或会话寿命的参数是服务器策略的问题，此协议未指定。"
    },
    {
      "indent": 3,
      "text": "Transport mappings MUST explicitly describe any connection-oriented processing that takes place after processing a <logout> command and ending a session.",
      "zh-CHS": "传输映射必须明确描述在处理<logout>命令并结束会话后发生的任何面向连接的处理。"
    },
    {
      "indent": 3,
      "text": "Example <logout> command:",
      "zh-CHS": "示例<logout>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <logout/>\nC:    <clTRID>ABC-12345</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <logout> command has been processed successfully, a server MUST respond with an EPP response with no <resData> element. If successful, the server MUST also end the current session.",
      "zh-CHS": "成功处理<logout>命令后，服务器必须使用不带<resData>元素的EPP响应进行响应。如果成功，服务器还必须结束当前会话。"
    },
    {
      "indent": 3,
      "text": "Example <logout> response:",
      "zh-CHS": "示例<logout>响应："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1500\">\nS:      <msg>Command completed successfully; ending session</msg>\nS:    </result>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <logout> command is used to end a session with an EPP server. A <logout> command MUST be rejected if the command has not been preceded by a successful <login> command. This action MUST be open to all authorized clients.",
      "zh-CHS": "EPP<logout>命令用于结束与EPP服务器的会话。如果命令前面没有成功的<login>命令，则必须拒绝<logout>命令。此操作必须对所有授权客户开放。"
    },
    {
      "indent": 0,
      "text": "2.9.2. Query Commands",
      "section_title": true,
      "zh-CHS": "2.9.2. 查询命令"
    },
    {
      "indent": 3,
      "text": "EPP provides four commands to retrieve object information: <check> to determine if an object can be provisioned within a repository, <info> to retrieve detailed information associated with a known object, <poll> to receive service notifications from the server, and <transfer> to retrieve object transfer status information.",
      "zh-CHS": "EPP提供了四个用于检索对象信息的命令：<check>用于确定是否可以在存储库中配置对象，<info>用于检索与已知对象关联的详细信息，<poll>用于从服务器接收服务通知，以及<transfer>用于检索对象传输状态信息。"
    },
    {
      "indent": 0,
      "text": "2.9.2.1. EPP <check> Command",
      "section_title": true,
      "zh-CHS": "2.9.2.1. EPP<check>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <check> command is used to determine if an object can be provisioned within a repository. It provides a hint that allows a client to anticipate the success or failure of provisioning an object using the <create> command as object provisioning requirements are ultimately a matter of server policy.",
      "zh-CHS": "EPP<check>命令用于确定是否可以在存储库中配置对象。它提供了一个提示，允许客户端预测使用<create>命令设置对象的成功或失败，因为对象设置要求最终取决于服务器策略。"
    },
    {
      "indent": 3,
      "text": "The elements needed to identify an object are object-specific, so the child elements of the <check> command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <check> command contains the following child elements:",
      "zh-CHS": "标识对象所需的元素是特定于对象的，因此<check>命令的子元素是使用EPP扩展框架指定的。除了标准EPP命令元素外，<check>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:check> element that identify the objects to be queried. Multiple objects of the same type MAY be queried within a single <check> command.",
      "zh-CHS": "- 一个特定于对象的<obj:check>元素，用于标识要查询的对象。同一类型的多个对象可以在一个<check>命令中查询。"
    },
    {
      "indent": 3,
      "text": "Example <check> command:",
      "zh-CHS": "示例<check>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <check>\nC:      <obj:check xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <obj:name>example1</obj:name>\nC:        <obj:name>example2</obj:name>\nC:        <obj:name>example3</obj:name>\nC:      </obj:check>\nC:    </check>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <check> command has been processed successfully, a server MUST respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema. The child elements of the <resData> element are object-specific, though the EPP <resData> element MUST contain a child <obj:chkData> element that contains one or more <obj:cd> (check data) elements. Each <obj:cd> elements contains the following child elements:",
      "zh-CHS": "成功处理<check>命令后，服务器必须使用EPP<resData>元素进行响应，该元素必须包含标识对象命名空间和对象架构位置的子元素。<resData>元素的子元素是特定于对象的，尽管EPP<resData>元素必须包含一个子<obj:chkData>元素，该子元素包含一个或多个<obj:cd>（检查数据）元素。每个<obj:cd>元素包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific element that identifies the queried object. This element MUST contain an \"avail\" attribute whose value indicates object availability (can it be provisioned or not) at the moment the <check> command was completed. A value of \"1\" or \"true\" means that the object can be provisioned. A value of \"0\" or \"false\" means that the object can not be provisioned.",
      "zh-CHS": "- 标识查询对象的特定于对象的元素。此元素必须包含一个“avail”属性，该属性的值表示在<check>命令完成时对象的可用性（是否可以设置）。值“1”或“true”表示可以设置对象。值“0”或“false”表示无法设置对象。"
    },
    {
      "indent": 3,
      "text": "- An OPTIONAL <obj:reason> element that MAY be provided when an object can not be provisioned. If present, this element contains server-specific text to help explain why the object can not be provisioned. This text MUST be represented in the response language previously negotiated with the client; an OPTIONAL \"lang\" attribute MAY be present to identify the language if the negotiated value is something other than the default value of \"en\" (English).",
      "zh-CHS": "- 一个可选的<obj:reason>元素，当无法提供对象时可以提供该元素。如果存在，则此元素包含特定于服务器的文本，以帮助解释无法设置对象的原因。该文本必须以之前与客户协商的回复语言表示；如果协商值不是默认值“en”（英语），则可能存在可选的“lang”属性来标识语言。"
    },
    {
      "indent": 3,
      "text": "Example <check> response:",
      "zh-CHS": "示例<check>响应："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <resData>\nS:      <obj:chkData xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nS:        <obj:cd>\nS:          <obj:name avail=\"1\">example1</obj:name>\nS:        </obj:cd>\nS:        <obj:cd>\nS:          <obj:name avail=\"0\">example2</obj:name>\nS:          <obj:reason>In use</obj:reason>\nS:        </obj:cd>\nS:        <obj:cd>\nS:          <obj:name avail=\"1\">example3</obj:name>\nS:        </obj:cd>\nS:      </obj:chkData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <check> command is used to determine if an object can be provisioned within a repository. This action MUST be open to all authorized clients.",
      "zh-CHS": "EPP<check>命令用于确定是否可以在存储库中配置对象。此操作必须对所有授权客户开放。"
    },
    {
      "indent": 0,
      "text": "2.9.2.2. EPP <info> Command",
      "section_title": true,
      "zh-CHS": "2.9.2.2. EPP<info>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <info> command is used to retrieve information associated with an existing object. The elements needed to identify an object and the type of information associated with an object are both object-specific, so the child elements of the <info> command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <info> command contains the following child elements:",
      "zh-CHS": "EPP<info>命令用于检索与现有对象关联的信息。标识对象所需的元素以及与对象关联的信息类型都是特定于对象的，因此<info>命令的子元素是使用EPP扩展框架指定的。除了标准EPP命令元素外，<info>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:info> element that identifies the object to be queried.",
      "zh-CHS": "- 特定于对象的<obj:info>元素，用于标识要查询的对象。"
    },
    {
      "indent": 3,
      "text": "Example <info> command:",
      "zh-CHS": "示例<info>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <info>\nC:      <obj:info xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <!-- Object-specific elements. -->\nC:      </obj:info>\nC:    </info>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When an <info> command has been processed successfully, a server MUST respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema and the Repository Object Identifier (ROID) that was assigned to the object when the object was created. Other child elements of the <resData> element are object-specific.",
      "zh-CHS": "成功处理<info>命令后，服务器必须使用EPP<resData>元素进行响应，该元素必须包含一个子元素，该子元素标识对象命名空间和对象架构的位置，以及创建对象时分配给该对象的存储库对象标识符（ROID）。<resData>元素的其他子元素是特定于对象的。"
    },
    {
      "indent": 3,
      "text": "Example <info> response:",
      "zh-CHS": "示例<info>响应："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <resData>\nS:      <obj:infData xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nS:        <obj:roid>EXAMPLE1-REP</obj:roid>\nS:        <!-- Object-specific elements. -->\nS:      </obj:infData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <info> command is used to retrieve information associated with an existing object. This action SHOULD be limited to authorized clients; restricting this action to the sponsoring client is RECOMMENDED.",
      "zh-CHS": "EPP<info>命令用于检索与现有对象关联的信息。该行动应仅限于授权客户；建议将此操作限制在赞助客户端。"
    },
    {
      "indent": 0,
      "text": "2.9.2.3. EPP <poll> Command",
      "section_title": true,
      "zh-CHS": "2.9.2.3. EPP<poll>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <poll> command is used to discover and retrieve service messages queued by a server for individual clients. If the message queue is not empty, a successful response to a <poll> command MUST return the first message from the message queue. Each response returned from the server includes a server-unique message identifier that MUST be provided to acknowledge receipt of the message, and a counter that indicates the number of messages in the queue. After a message has been received by the client, the client MUST respond to the message with an explicit acknowledgement to confirm that the message has been received. A server MUST dequeue the message and decrement the queue counter after receiving acknowledgement from the client, making the next message in the queue (if any) available for retrieval.",
      "zh-CHS": "EPP<poll>命令用于发现和检索服务器为单个客户端排队的服务消息。如果消息队列不是空的，则对<poll>命令的成功响应必须从消息队列返回第一条消息。从服务器返回的每个响应都包括一个服务器唯一的消息标识符（必须提供该标识符以确认消息的接收），以及一个指示队列中消息数量的计数器。在客户机收到消息后，客户机必须以明确的确认函对消息作出响应，以确认消息已收到。服务器必须在接收到来自客户端的确认后将消息出列并减少队列计数器，从而使队列中的下一条消息（如果有）可供检索。"
    },
    {
      "indent": 3,
      "text": "Servers can occasionally perform actions on objects that are not in direct response to a client request, or an action taken by one client can indirectly involve a second client. Examples of such actions include deletion upon expiration, automatic renewal upon expiration, and transfer coordination; other types of service information MAY be defined as a matter of server policy. Service messages MUST be created for all clients affected by an action on an object. For example, <transfer> actions MUST be reported to both the client that requests an object transfer and the client that has the authority to approve or reject the transfer request.",
      "zh-CHS": "服务器有时可以对不直接响应客户端请求的对象执行操作，或者一个客户端执行的操作可能间接涉及第二个客户端。此类操作的示例包括到期时删除、到期时自动续订和转移协调；其他类型的服务信息可以根据服务器策略进行定义。必须为受对象操作影响的所有客户端创建服务消息。例如，<transfer>操作必须报告给请求对象传输的客户端和有权批准或拒绝传输请求的客户端。"
    },
    {
      "indent": 3,
      "text": "Message queues can consume server resources if clients do not retrieve and acknowledge messages on a regular basis. Servers MAY implement other mechanisms to dequeue and deliver messages if queue maintenance needs exceed server resource consumption limits. Server operators SHOULD consider time-sensitivity and resource management factors when selecting a delivery method for service information because some message types can be reasonably delivered using non-protocol methods that require fewer server resources.",
      "zh-CHS": "如果客户端不定期检索和确认消息，消息队列可能会占用服务器资源。如果队列维护需要超过服务器资源消耗限制，服务器可以实现其他机制来出列和传递消息。服务器操作员在选择服务信息传递方法时应考虑时间敏感度和资源管理因素，因为某些消息类型可以使用需要较少服务器资源的非协议方法合理地传递。"
    },
    {
      "indent": 3,
      "text": "Some of the information returned in response to a <poll> command can be object-specific, so some child elements of the <poll> response MAY be specified using the EPP extension framework. The <poll> command MUST be represented as an empty element with no child elements. An \"op\" attribute with value \"req\" is REQUIRED to retrieve the first message from the server message queue. An \"op\" attribute (with value \"ack\") and a \"msgID\" attribute (whose value corresponds to the value of the \"id\" attribute copied from the <msg> element in the message being acknowledged) are REQUIRED to acknowledge receipt of a message.",
      "zh-CHS": "响应<poll>命令返回的一些信息可能是特定于对象的，因此可以使用EPP扩展框架指定<poll>响应的一些子元素。<poll>命令必须表示为没有子元素的空元素。从服务器消息队列检索第一条消息需要一个值为“req”的“op”属性。确认收到消息需要“op”属性（值为“ack”）和“msgID”属性（其值对应于从被确认消息中的<msg>元素复制的“id”属性的值）。"
    },
    {
      "indent": 3,
      "text": "Example <poll> command:",
      "zh-CHS": "示例<poll>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <poll op=\"req\"/>\nC:    <clTRID>ABC-12345</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The returned result code notes that a message has been dequeued and returned in response to a <poll> command.",
      "zh-CHS": "返回的结果代码注意到消息已退出队列并返回以响应<poll>命令。"
    },
    {
      "indent": 3,
      "text": "Example <poll> response with object-specific information:",
      "zh-CHS": "带有对象特定信息的<poll>响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1301\">\nS:      <msg>Command completed successfully; ack to dequeue</msg>\nS:    </result>\nS:    <msgQ count=\"5\" id=\"12345\">\nS:      <qDate>2000-06-08T22:00:00.0Z</qDate>\nS:      <msg>Transfer requested.</msg>\nS:    </msgQ>\nS:    <resData>\nS:      <obj:trnData\nS:       xmlns:obj=\"urn:ietf:params:xml:ns:obj-1.0\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj-1.0\nS:       obj-1.0.xsd\">\nS:        <obj:name>example.com</obj:name>\nS:        <obj:trStatus>pending</obj:trStatus>\nS:        <obj:reID>ClientX</obj:reID>\nS:        <obj:reDate>2000-06-08T22:00:00.0Z</obj:reDate>\nS:        <obj:acID>ClientY</obj:acID>\nS:        <obj:acDate>2000-06-13T22:00:00.0Z</obj:acDate>\nS:        <obj:exDate>2002-09-08T22:00:00.0Z</obj:exDate>\nS:      </obj:trnData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A client MUST acknowledge each response to dequeue the message and make subsequent messages available for retrieval.",
      "zh-CHS": "客户机必须确认每个响应，以使消息出列，并使后续消息可供检索。"
    },
    {
      "indent": 3,
      "text": "Example <poll> acknowledgement command:",
      "zh-CHS": "示例<poll>确认命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <poll op=\"ack\" msgID=\"12345\"/>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A <poll> acknowledgement response notes the number of messages remaining in the queue and the ID of the next message available for retrieval.",
      "zh-CHS": "<poll>确认响应记录队列中剩余的消息数量以及下一条可供检索的消息的ID。"
    },
    {
      "indent": 3,
      "text": "Example <poll> acknowledgement response:",
      "zh-CHS": "示例<poll>确认响应："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <msgQ count=\"4\" id=\"12346\"/>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Service messages can also be returned without object information.",
      "zh-CHS": "服务消息也可以在没有对象信息的情况下返回。"
    },
    {
      "indent": 3,
      "text": "Example <poll> response with mixed message content and without object-specific information:",
      "zh-CHS": "示例<poll>带有混合消息内容且没有对象特定信息的响应："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1301\">\nS:      <msg>Command completed successfully; ack to dequeue</msg>\nS:    </result>\nS:    <msgQ count=\"4\" id=\"12346\">\nS:      <qDate>2000-06-08T22:10:00.0Z</qDate>\nS:      <msg lang=\"en\">Credit balance low.\nS:        <limit>100</limit><bal>5</bal>\nS:      </msg>\nS:    </msgQ>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The returned result code and message is used to note an empty server message queue.",
      "zh-CHS": "返回的结果代码和消息用于记录空的服务器消息队列。"
    },
    {
      "indent": 3,
      "text": "Example <poll> response to note an empty message queue:",
      "zh-CHS": "注意到空消息队列的<poll>响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1300\">\nS:      <msg>Command completed successfully; no messages</msg>\nS:    </result>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <poll> command is used to discover and retrieve client service messages from a server. This action SHOULD be limited to authorized clients; queuing service messages and limiting queue access on a per-client basis is RECOMMENDED.",
      "zh-CHS": "EPP<poll>命令用于从服务器发现和检索客户端服务消息。该行动应仅限于授权客户；建议对服务消息进行排队，并限制每个客户端的队列访问。"
    },
    {
      "indent": 0,
      "text": "2.9.2.4. EPP <transfer> Query Command",
      "section_title": true,
      "zh-CHS": "2.9.2.4. EPP<transfer>查询命令"
    },
    {
      "indent": 3,
      "text": "The EPP <transfer> command provides a query operation that allows a client to determine real-time status of pending and completed transfer requests. The elements needed to identify an object that is the subject of a transfer request are object-specific, so the child elements of the <transfer> query command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <transfer> command contains an \"op\" attribute with value \"query\", and the following child elements:",
      "zh-CHS": "EPP<transfer>命令提供一个查询操作，允许客户端确定挂起和完成的传输请求的实时状态。标识作为传输请求主题的对象所需的元素是特定于对象的，因此使用EPP扩展框架指定<transfer>查询命令的子元素。除了标准EPP命令元素外，<transfer>命令还包含一个值为“query”的“op”属性以及以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:transfer> element that identifies the object whose transfer status is requested.",
      "zh-CHS": "- 特定于对象的<obj:transfer>元素，用于标识请求传输状态的对象。"
    },
    {
      "indent": 3,
      "text": "Transfer status is typically considered sensitive information by the clients involved in the operation. Object mappings MUST provide features to restrict transfer queries to authorized clients, such as by requiring authorization information as part of the request.",
      "zh-CHS": "传输状态通常被参与操作的客户端视为敏感信息。对象映射必须提供将传输查询限制到授权客户机的功能，例如要求将授权信息作为请求的一部分。"
    },
    {
      "indent": 3,
      "text": "Example <transfer> query command:",
      "zh-CHS": "示例<transfer>查询命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <transfer op=\"query\">\nC:      <obj:transfer xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <!-- Object-specific elements. -->\nC:      </obj:transfer>\nC:    </transfer>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <transfer> query command has been processed successfully, a server MUST respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema. The child elements of the <resData> element are object-specific, but they MUST include elements that identify the object, the status of the transfer, the identifier of the client that",
      "zh-CHS": "成功处理<transfer>查询命令后，服务器必须使用EPP<resData>元素进行响应，该元素必须包含标识对象命名空间和对象架构位置的子元素。<resData>元素的子元素是特定于对象的，但它们必须包括标识对象、传输状态、传输的客户端标识符的元素"
    },
    {
      "indent": 3,
      "text": "requested the transfer, the date and time that the request was made, the identifier of the client that is authorized to act on the request, the date and time by which an action is expected, and an OPTIONAL date and time noting changes in the object's validity period (if applicable) that occur as a result of the transfer.",
      "zh-CHS": "请求转让的日期和时间、提出请求的日期和时间、有权对请求采取行动的客户的标识符、预期采取行动的日期和时间，以及可选日期和时间，注明因转让而发生的对象有效期变化（如适用）。"
    },
    {
      "indent": 3,
      "text": "Example <transfer> query response:",
      "zh-CHS": "示例<transfer>查询响应："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <resData>\nS:      <obj:trnData xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nS:        <obj:name>example</obj:name>\nS:        <obj:trStatus>pending</obj:trStatus>\nS:        <obj:reID>ClientX</obj:reID>\nS:        <obj:reDate>2000-06-08T22:00:00.0Z</obj:reDate>\nS:        <obj:acID>ClientY</obj:acID>\nS:        <obj:acDate>2000-06-13T22:00:00.0Z</obj:acDate>\nS:        <obj:exDate>2002-09-08T22:00:00.0Z</obj:exDate>\nS:      </obj:trnData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <transfer> command provides a query operation that allows a client to determine real-time status of pending and completed transfer requests. This action SHOULD be limited to authorized clients; restricting queries to the requesting and responding clients is RECOMMENDED. Object transfer MAY be unavailable or limited by object-specific policies.",
      "zh-CHS": "EPP<transfer>命令提供一个查询操作，允许客户端确定挂起和完成的传输请求的实时状态。该行动应仅限于授权客户；建议将查询限制到请求和响应的客户端。对象传输可能不可用或受对象特定策略的限制。"
    },
    {
      "indent": 0,
      "text": "2.9.3. Object Transform Commands",
      "section_title": true,
      "zh-CHS": "2.9.3. 对象变换命令"
    },
    {
      "indent": 3,
      "text": "EPP provides five commands to transform objects: <create> to create an instance of an object with a server, <delete> to remove an instance of an object from a server, <renew> to extend the validity period of an object, <update> to change information associated with an object, and <transfer> to manage changes in client sponsorship of an object.",
      "zh-CHS": "EPP提供了五个转换对象的命令：<create>使用服务器创建对象实例，<delete>从服务器删除对象实例，<renew>延长对象的有效期，<update>更改与对象关联的信息，以及<transfer>管理对象的客户端赞助更改。"
    },
    {
      "indent": 0,
      "text": "2.9.3.1. EPP <create> Command",
      "section_title": true,
      "zh-CHS": "2.9.3.1. EPP<create>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <create> command is used to create an instance of an object. An object can be created for an indefinite period of time, or an object can be created for a specific validity period. The EPP mapping for an object MUST describe the status of an object with respect to time, to include expected client and server behavior if a validity period is used.",
      "zh-CHS": "EPP<create>命令用于创建对象的实例。对象可以无限期地创建，也可以在特定的有效期内创建。对象的EPP映射必须描述对象相对于时间的状态，以便在使用有效期时包括预期的客户端和服务器行为。"
    },
    {
      "indent": 3,
      "text": "The elements needed to identify an object and associated attributes are object-specific, so the child elements of the <create> command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <create> command contains the following child elements:",
      "zh-CHS": "标识对象和相关属性所需的元素是特定于对象的，因此<create>命令的子元素是使用EPP扩展框架指定的。除了标准EPP命令元素外，<create>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:create> element that identifies the object to be created and the elements that are required to create the object.",
      "zh-CHS": "- 特定于对象的<obj:create>元素，用于标识要创建的对象以及创建对象所需的元素。"
    },
    {
      "indent": 3,
      "text": "Example <create> command:",
      "zh-CHS": "示例<create>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <create>\nC:      <obj:create xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <!-- Object-specific elements. -->\nC:      </obj:create>\nC:    </create>\nC:    <clTRID>ABC-12345</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <create> command has been processed successfully, a server MAY respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema. The child elements of the <resData> element are object-specific.",
      "zh-CHS": "成功处理<create>命令后，服务器可能会响应EPP<resData>元素，该元素必须包含标识对象命名空间和对象架构位置的子元素。<resData>元素的子元素是特定于对象的。"
    },
    {
      "indent": 3,
      "text": "Example <create> response with <resData>:",
      "zh-CHS": "使用<resData>的<create>响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <resData>\nS:      <obj:creData xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nS:        <!-- Object-specific elements. -->\nS:      </obj:creData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12345</clTRID>\nS:      <svTRID>54321-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <create> command is used to create an instance of an object. This action SHOULD be limited to authorized clients and MAY be restricted on a per-client basis.",
      "zh-CHS": "EPP<create>命令用于创建对象的实例。此操作应仅限于授权客户，并可能以每个客户为基础进行限制。"
    },
    {
      "indent": 0,
      "text": "2.9.3.2. EPP <delete> Command",
      "section_title": true,
      "zh-CHS": "2.9.3.2. EPP<delete>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <delete> command is used to remove an instance of an existing object. The elements needed to identify an object are object-specific, so the child elements of the <delete> command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <delete> command contains the following child elements:",
      "zh-CHS": "EPP<delete>命令用于删除现有对象的实例。标识对象所需的元素是特定于对象的，因此<delete>命令的子元素是使用EPP扩展框架指定的。除了标准EPP命令元素外，<delete>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:delete> element that identifies the object to be deleted.",
      "zh-CHS": "- 特定于对象的<obj:delete>元素，用于标识要删除的对象。"
    },
    {
      "indent": 3,
      "text": "Example <delete> command:",
      "zh-CHS": "示例<delete>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <delete>\nC:      <obj:delete xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <!-- Object-specific elements. -->\nC:      </obj:delete>\nC:    </delete>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <delete> command has been processed successfully, a server MAY respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema. The child elements of the <resData> element are object-specific.",
      "zh-CHS": "成功处理<delete>命令后，服务器可能会响应EPP<resData>元素，该元素必须包含标识对象命名空间和对象架构位置的子元素。<resData>元素的子元素是特定于对象的。"
    },
    {
      "indent": 3,
      "text": "Example <delete> response without <resData>:",
      "zh-CHS": "无<resData>的<delete>响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <delete> command is used to remove an instance of an existing object. This action SHOULD be limited to authorized clients; restricting this action to the sponsoring client is RECOMMENDED.",
      "zh-CHS": "EPP<delete>命令用于删除现有对象的实例。该行动应仅限于授权客户；建议将此操作限制在赞助客户端。"
    },
    {
      "indent": 0,
      "text": "2.9.3.3. EPP <renew> Command",
      "section_title": true,
      "zh-CHS": "2.9.3.3. EPP<renew>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <renew> command is used to extend the validity period of an existing object. The elements needed to identify and extend the validity period of an object are object-specific, so the child elements of the <renew> command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <renew> command contains the following child elements:",
      "zh-CHS": "EPP<renew>命令用于延长现有对象的有效期。标识和延长对象有效期所需的元素是特定于对象的，因此<renew>命令的子元素是使用EPP扩展框架指定的。除了标准EPP命令元素外，<renew>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:renew> element that identifies the object to be renewed and the elements that are required to extend the validity period of the object.",
      "zh-CHS": "- 特定于对象的<obj:renew>元素，用于标识要更新的对象以及延长对象有效期所需的元素。"
    },
    {
      "indent": 3,
      "text": "Example <renew> command:",
      "zh-CHS": "示例<renew>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <renew>\nC:      <obj:renew xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <!-- Object-specific elements. -->\nC:      </obj:renew>\nC:    </renew>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <renew> command has been processed successfully, a server MAY respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema. The child elements of the <resData> element are object-specific.",
      "zh-CHS": "成功处理<renew>命令后，服务器可能会使用EPP<resData>元素进行响应，该元素必须包含标识对象命名空间和对象架构位置的子元素。<resData>元素的子元素是特定于对象的。"
    },
    {
      "indent": 3,
      "text": "Example <renew> response with <resData>:",
      "zh-CHS": "使用<resData>的<renew>响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "S:    <resData>\nS:      <obj:renData xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nS:        <!-- Object-specific elements. -->\nS:      </obj:renData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <renew> command is used to extend the validity period of an existing object. This action SHOULD be limited to authorized clients; restricting this action to the sponsoring client is RECOMMENDED. Object renewal MAY be unavailable or limited by object-specific policies.",
      "zh-CHS": "EPP<renew>命令用于延长现有对象的有效期。该行动应仅限于授权客户；建议将此操作限制在赞助客户端。对象续订可能不可用或受对象特定策略的限制。"
    },
    {
      "indent": 0,
      "text": "2.9.3.4. EPP <transfer> Command",
      "section_title": true,
      "zh-CHS": "2.9.3.4. EPP<transfer>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <transfer> command is used to manage changes in client sponsorship of an existing object. Clients can initiate a transfer request, cancel a transfer request, approve a transfer request, and reject a transfer request using the \"op\" command attribute.",
      "zh-CHS": "EPP<transfer>命令用于管理现有对象的客户端赞助中的更改。客户端可以使用“op”命令属性启动转账请求、取消转账请求、批准转账请求和拒绝转账请求。"
    },
    {
      "indent": 3,
      "text": "A client who wishes to assume sponsorship of a known object from another client uses the <transfer> command with the value of the \"op\" attribute set to \"request\". Once a transfer has been requested, the same client can cancel the request using a <transfer> command with the value of the \"op\" attribute set to \"cancel\". A request to cancel the transfer MUST be sent to the server before the current sponsoring client either approves or rejects the transfer request and before the server automatically processes the request due to responding client inactivity.",
      "zh-CHS": "希望从另一个客户机获得已知对象赞助的客户机使用<transfer>命令，将“op”属性的值设置为“request”。请求传输后，同一客户机可以使用<transfer>命令取消请求，“op”属性的值设置为“cancel”。在当前发起客户端批准或拒绝传输请求之前，以及在服务器因响应客户端不活动而自动处理请求之前，必须将取消传输的请求发送到服务器。"
    },
    {
      "indent": 3,
      "text": "Once a transfer request has been received by the server, the server MUST notify the current sponsoring client of the requested transfer by queuing a service message for retrieval via the <poll> command. The current status of a pending <transfer> command for any object can be found using the <transfer> query command. Transfer service messages MUST include the object-specific elements specified for <transfer> command responses.",
      "zh-CHS": "一旦服务器接收到传输请求，服务器必须通过将服务消息排队以通过<poll>命令检索，将请求的传输通知当前发起客户端。使用<transfer>查询命令可以找到任何对象的挂起<transfer>命令的当前状态。传输服务消息必须包括为<Transfer>命令响应指定的对象特定元素。"
    },
    {
      "indent": 3,
      "text": "The current sponsoring client MAY explicitly approve or reject the transfer request. The client can approve the request using a <transfer> command with the value of the \"op\" attribute set to \"approve\". The client can reject the request using a <transfer> command with the value of the \"op\" attribute set to \"reject\".",
      "zh-CHS": "当前担保客户可以明确批准或拒绝转让请求。客户端可以使用<transfer>命令批准请求，并将“op”属性的值设置为“approve”。客户机可以使用<transfer>命令拒绝请求，“op”属性的值设置为“reject”。"
    },
    {
      "indent": 3,
      "text": "A server MAY automatically approve or reject all transfer requests that are not explicitly approved or rejected by the current sponsoring client within a fixed amount of time. The amount of time to wait for explicit action and the default server behavior are local matters not specified by EPP, but they SHOULD be documented in a server-specific profile document that describes default server behavior for client information.",
      "zh-CHS": "服务器可以在固定时间内自动批准或拒绝当前发起客户端未明确批准或拒绝的所有传输请求。等待显式操作的时间量和默认服务器行为是EPP未指定的本地事项，但它们应记录在特定于服务器的配置文件文档中，该文档描述了客户端信息的默认服务器行为。"
    },
    {
      "indent": 3,
      "text": "Objects eligible for transfer MUST have associated authorization information that MUST be provided to complete a <transfer> command. The type of authorization information required is object-specific; passwords or more complex mechanisms based on public key cryptography are typical.",
      "zh-CHS": "符合传输条件的对象必须具有相关的授权信息，必须提供这些信息才能完成<transfer>命令。所需的授权信息类型是特定于对象的；密码或基于公钥加密的更复杂机制是典型的。"
    },
    {
      "indent": 3,
      "text": "The elements needed to identify and complete the transfer of an object are object-specific, so the child elements of the <transfer> command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <transfer> command contains the following child elements:",
      "zh-CHS": "标识和完成对象传输所需的元素是特定于对象的，因此使用EPP扩展框架指定<transfer>命令的子元素。除了标准EPP命令元素外，<transfer>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:transfer> element that identifies the object to be transferred and the elements that are required to process the transfer command.",
      "zh-CHS": "- 特定于对象的<obj:transfer>元素，用于标识要传输的对象以及处理传输命令所需的元素。"
    },
    {
      "indent": 3,
      "text": "Example <transfer> command:",
      "zh-CHS": "示例<transfer>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <transfer op=\"request\">\nC:      <obj:transfer xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <!-- Object-specific elements. -->\nC:      </obj:transfer>\nC:    </transfer>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When a <transfer> command has been processed successfully, a server MUST respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema. The child elements of the <resData> element are object-specific, but they MUST include elements that identify the object, the status of the transfer, the identifier of the client that requested the transfer, the date and time that the request was made, the identifier of the client that is authorized to act on the request, the date and time by which an action is expected, and an OPTIONAL date and time noting changes in the object's validity period (if applicable) that occur as a result of the transfer.",
      "zh-CHS": "成功处理<transfer>命令后，服务器必须使用EPP<resData>元素进行响应，该元素必须包含标识对象命名空间和对象架构位置的子元素。<resData>元素的子元素是特定于对象的，但它们必须包括标识对象的元素、传输状态、请求传输的客户端标识符、请求发出的日期和时间、授权处理请求的客户端标识符，预期操作的日期和时间，以及一个可选日期和时间，注明因转移而发生的对象有效期变化（如适用）。"
    },
    {
      "indent": 3,
      "text": "Example <transfer> response with <resData>:",
      "zh-CHS": "使用<resData>的<transfer>响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1001\">\nS:      <msg>Command completed successfully; action pending</msg>\nS:    </result>\nS:    <resData>\nS:      <obj:trnData xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nS:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nS:        <obj:name>example</obj:name>\nS:        <obj:trStatus>pending</obj:trStatus>\nS:        <obj:reID>ClientX</obj:reID>\nS:        <obj:reDate>2000-06-08T22:00:00.0Z</obj:reDate>\nS:        <obj:acID>ClientY</obj:acID>\nS:        <obj:acDate>2000-06-13T22:00:00.0Z</obj:acDate>\nS:        <obj:exDate>2002-09-08T22:00:00.0Z</obj:exDate>\nS:      </obj:trnData>\nS:    </resData>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <transfer> command is used to manage changes in client\nsponsorship of an existing object.  This action SHOULD be limited to\nauthorized clients; restricting <transfer> requests to a client other\nthan the current sponsoring client, <transfer> approval requests to",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "the current sponsoring client, and <transfer> cancellation requests to the original requesting client is RECOMMENDED. Object transfer MAY be unavailable or limited by object-specific policies.",
      "zh-CHS": "建议使用当前发起客户，并将<transfer>取消请求发送给原始请求客户。对象传输可能不可用或受对象特定策略的限制。"
    },
    {
      "indent": 0,
      "text": "2.9.3.5. EPP <update> Command",
      "section_title": true,
      "zh-CHS": "2.9.3.5. EPP<update>命令"
    },
    {
      "indent": 3,
      "text": "The EPP <update> command is used to change information associated with an existing object. The elements needed to identify and modify an object are object-specific, so the child elements of the <update> command are specified using the EPP extension framework. In addition to the standard EPP command elements, the <update> command contains the following child elements:",
      "zh-CHS": "EPP<update>命令用于更改与现有对象关联的信息。标识和修改对象所需的元素是特定于对象的，因此<update>命令的子元素是使用EPP扩展框架指定的。除了标准EPP命令元素外，<update>命令还包含以下子元素："
    },
    {
      "indent": 3,
      "text": "- An object-specific <obj:update> element that identifies the object to be updated and the elements that are required to modify the object. Object-specific elements MUST identify values to be added, values to be removed, or values to be changed.",
      "zh-CHS": "- 特定于对象的<obj:update>元素，用于标识要更新的对象以及修改对象所需的元素。特定于对象的元素必须标识要添加的值、要删除的值或要更改的值。"
    },
    {
      "indent": 3,
      "text": "Example <update> command:",
      "zh-CHS": "示例<update>命令："
    },
    {
      "indent": 3,
      "text": "C:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nC:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nC:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nC:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nC:     epp-1.0.xsd\">\nC:  <command>\nC:    <update>\nC:      <obj:update xmlns:obj=\"urn:ietf:params:xml:ns:obj\"\nC:       xsi:schemaLocation=\"urn:ietf:params:xml:ns:obj obj.xsd\">\nC:        <!-- Object-specific elements. -->\nC:      </obj:update>\nC:    </update>\nC:    <clTRID>ABC-12346</clTRID>\nC:  </command>\nC:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When an <update> command has been processed successfully, a server MAY respond with an EPP <resData> element that MUST contain a child element that identifies the object namespace and the location of the object schema. The child elements of the <resData> element are object-specific.",
      "zh-CHS": "成功处理<update>命令后，服务器可能会响应EPP<resData>元素，该元素必须包含标识对象命名空间和对象架构位置的子元素。<resData>元素的子元素是特定于对象的。"
    },
    {
      "indent": 3,
      "text": "Example <update> response without <resData>:",
      "zh-CHS": "无<resData>的<update>响应示例："
    },
    {
      "indent": 3,
      "text": "S:<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\nS:<epp xmlns=\"urn:ietf:params:xml:ns:epp-1.0\"\nS:     xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nS:     xsi:schemaLocation=\"urn:ietf:params:xml:ns:epp-1.0\nS:     epp-1.0.xsd\">\nS:  <response>\nS:    <result code=\"1000\">\nS:      <msg>Command completed successfully</msg>\nS:    </result>\nS:    <trID>\nS:      <clTRID>ABC-12346</clTRID>\nS:      <svTRID>54322-XYZ</svTRID>\nS:    </trID>\nS:  </response>\nS:</epp>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The EPP <update> command is used to change information associated with an existing object. This action SHOULD be limited to authorized clients; restricting this action to the sponsoring client is RECOMMENDED.",
      "zh-CHS": "EPP<update>命令用于更改与现有对象关联的信息。该行动应仅限于授权客户；建议将此操作限制在赞助客户端。"
    },
    {
      "indent": 0,
      "text": "3. Result Codes",
      "section_title": true,
      "zh-CHS": "3. 结果代码"
    },
    {
      "indent": 3,
      "text": "EPP result codes are based on the theory of reply codes described in section 4.2.1 of [RFC2821]. EPP uses four decimal digits to describe the success or failure of each EPP command. Each of the digits of the reply have special significance.",
      "zh-CHS": "EPP结果码基于[RFC2821]第4.2.1节所述的应答码理论。EPP使用四位十进制数字来描述每个EPP命令的成功或失败。回复的每个数字都有特殊的意义。"
    },
    {
      "indent": 3,
      "text": "The first digit denotes command success or failure. The second digit denotes the response category, such as command syntax or security. The third and fourth digits provide explicit response detail within each response category.",
      "zh-CHS": "第一位数字表示命令成功或失败。第二个数字表示响应类别，例如命令语法或安全性。第三位和第四位数字在每个响应类别中提供明确的响应细节。"
    },
    {
      "indent": 3,
      "text": "There are two values for the first digit of the reply code:",
      "zh-CHS": "回复代码的第一个数字有两个值："
    },
    {
      "indent": 3,
      "text": "1yzz Positive completion reply. The command has been accepted and processed by the system without error.",
      "zh-CHS": "1yzz肯定完成回复。该命令已被系统无误地接受和处理。"
    },
    {
      "indent": 3,
      "text": "2yzz Negative completion reply. The command was not accepted and the requested action did not occur.",
      "zh-CHS": "2yzz否定完成回复。命令未被接受，请求的操作未发生。"
    },
    {
      "indent": 3,
      "text": "The second digit groups responses into one of six specific categories:",
      "zh-CHS": "第二个数字将响应分为六个特定类别之一："
    },
    {
      "indent": 3,
      "text": "x0zz Protocol Syntax x1zz Implementation-specific Rules x2zz Security x3zz Data Management x4zz Server System x5zz Connection Management",
      "zh-CHS": "x0zz协议语法x1zz实现特定规则x2zz安全x3zz数据管理x4zz服务器系统x5zz连接管理"
    },
    {
      "indent": 3,
      "text": "The third and fourth digits provide response detail within the categories defined by the first and second digits. Specific result codes are listed in the table below.",
      "zh-CHS": "第三位和第四位数字在第一位和第二位数字定义的类别内提供响应详细信息。下表列出了具体的结果代码。"
    },
    {
      "indent": 3,
      "text": "Every EPP response MUST include a result code and a human-readable description of the result code. The language used to represent the description MAY be identified using an instance of the \"lang\" attribute within the <msg> element. If not specified, the default language is English, identified as \"en\". A description of the structure of valid values for the \"lang\" attribute is described in [RFC3066].",
      "zh-CHS": "每个EPP响应必须包括结果代码和结果代码的可读描述。可以使用<msg>元素中“lang”属性的实例来标识用于表示描述的语言。如果未指定，默认语言为英语，标识为“en”。[RFC3066]中描述了“lang”属性有效值的结构。"
    },
    {
      "indent": 3,
      "text": "Response text MAY be translated into other languages, though the translation MUST preserve the meaning of the code as described here. Response code values MUST NOT be changed when translating text.",
      "zh-CHS": "响应文本可以翻译成其他语言，但翻译必须保留此处所述代码的含义。翻译文本时，不得更改响应代码值。"
    },
    {
      "indent": 3,
      "text": "Response text in the table below is enclosed in quotes to clearly mark the beginning and ending of each response string. Quotes MUST NOT be used to delimit these strings when returning response text via the protocol.",
      "zh-CHS": "下表中的响应文本用引号括起来，以清楚地标记每个响应字符串的开头和结尾。通过协议返回响应文本时，不得使用引号分隔这些字符串。"
    },
    {
      "indent": 3,
      "text": "Successful command completion responses:",
      "zh-CHS": "成功的命令完成响应："
    },
    {
      "indent": 3,
      "text": "Code    Response text in English\n___________________________________",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "1000 \"Command completed successfully\" This is the usual response code for a successfully completed command that is not addressed by any other 1xxx-series response code.",
      "zh-CHS": "1000“命令成功完成”这是成功完成的命令的常见响应代码，任何其他1xxx系列响应代码均未处理该命令。"
    },
    {
      "indent": 3,
      "text": "1001 \"Command completed successfully; action pending\" This response code MUST be returned when responding to a command the requires offline activity before the requested action can be completed. See section 2 for a description of other processing requirements.",
      "zh-CHS": "1001“命令已成功完成；操作挂起”在响应命令时，必须返回此响应代码。请求的操作需要脱机活动才能完成。有关其他处理要求的说明，请参见第2节。"
    },
    {
      "indent": 3,
      "text": "1300 \"Command completed successfully; no messages\" This response code MUST be returned when responding to a <poll> request command and the server message queue is empty.",
      "zh-CHS": "1300“命令成功完成；无消息”响应<poll>请求命令时必须返回此响应代码，并且服务器消息队列为空。"
    },
    {
      "indent": 3,
      "text": "1301 \"Command completed successfully; ack to dequeue\" This response code MUST be returned when responding to a <poll> request command and a message has been retrieved from the server message queue.",
      "zh-CHS": "1301“命令成功完成；确认退出队列”当响应<poll>请求命令且已从服务器消息队列检索到消息时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "1500 \"Command completed successfully; ending session\" This response code MUST be returned when responding to a successful <logout> command.",
      "zh-CHS": "1500“命令成功完成；结束会话”响应成功的<logout>命令时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "Command error responses:",
      "zh-CHS": "命令错误响应："
    },
    {
      "indent": 3,
      "text": "Code    Response text in English\n___________________________________",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "2000 \"Unknown command\" This response code MUST be returned when a server receives a command element that is not defined by EPP.",
      "zh-CHS": "2000“未知命令”当服务器接收到EPP未定义的命令元素时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2001 \"Command syntax error\" This response code MUST be returned when a server receives an improperly formed command element.",
      "zh-CHS": "2001“命令语法错误”当服务器接收到格式不正确的命令元素时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2002 \"Command use error\" This response code MUST be returned when a server receives a properly formed command element, but the command can not be executed due to a sequencing or context error. For example, a <logout> command can not be executed without having first completed a <login> command.",
      "zh-CHS": "2002“命令使用错误”当服务器收到格式正确的命令元素时，必须返回此响应代码，但由于顺序或上下文错误，无法执行该命令。例如，如果未首先完成<login>命令，则无法执行<logout>命令。"
    },
    {
      "indent": 3,
      "text": "2003 \"Required parameter missing\" This response code MUST be returned when a server receives a command for which a required parameter value has not been provided.",
      "zh-CHS": "2003“Required parameter missing”当服务器接收到尚未提供所需参数值的命令时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2004 \"Parameter value range error\" This response code MUST be returned when a server receives a command parameter whose value is outside the range of values specified by the protocol. The error value SHOULD be returned via a <value> element in the EPP response.",
      "zh-CHS": "2004“Parameter value range error”当服务器接收到值超出协议指定的值范围的命令参数时，必须返回此响应代码。错误值应通过EPP响应中的<value>元素返回。"
    },
    {
      "indent": 3,
      "text": "2005 \"Parameter value syntax error\" This response code MUST be returned when a server receives a command containing a parameter whose value is improperly formed. The error value SHOULD be returned via a <value> element in the EPP response.",
      "zh-CHS": "2005“Parameter value syntax error”当服务器接收到包含参数值格式不正确的命令时，必须返回此响应代码。错误值应通过EPP响应中的<value>元素返回。"
    },
    {
      "indent": 3,
      "text": "2100 \"Unimplemented protocol version\" This response code MUST be returned when a server receives a command element specifying a protocol version that is not implemented by the server.",
      "zh-CHS": "2100“Unimplemented protocol version”（未实现的协议版本）当服务器收到指定服务器未实现的协议版本的命令元素时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2101 \"Unimplemented command\" This response code MUST be returned when a server receives a valid EPP command element that is not implemented by the server. For example, a <transfer> command can be unimplemented for certain object types.",
      "zh-CHS": "2101“未实现的命令”当服务器接收到未由服务器实现的有效EPP命令元素时，必须返回此响应代码。例如，对于某些对象类型，<transfer>命令可能无法实现。"
    },
    {
      "indent": 3,
      "text": "2102 \"Unimplemented option\" This response code MUST be returned when a server receives a valid EPP command element that contains a protocol option that is not implemented by the server.",
      "zh-CHS": "2102“未实现选项”当服务器接收到有效的EPP命令元素，该元素包含服务器未实现的协议选项时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2103 \"Unimplemented extension\" This response code MUST be returned when a server receives a valid EPP command element that contains a protocol command extension that is not implemented by the server.",
      "zh-CHS": "2103“未实现的扩展”当服务器接收到有效的EPP命令元素时，必须返回此响应代码，该元素包含服务器未实现的协议命令扩展。"
    },
    {
      "indent": 3,
      "text": "2104 \"Billing failure\" This response code MUST be returned when a server attempts to execute a billable operation and the command can not be completed due to a client billing failure.",
      "zh-CHS": "2104“计费失败”当服务器尝试执行计费操作且由于客户端计费失败而无法完成命令时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2105 \"Object is not eligible for renewal\" This response code MUST be returned when a client attempts to <renew> an object that is not eligible for renewal in accordance with server policy.",
      "zh-CHS": "2105“对象不符合续订条件”当客户端尝试根据服务器策略<续订>不符合续订条件的对象时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2106 \"Object is not eligible for transfer\" This response code MUST be returned when a client attempts to <transfer> an object that is not eligible for transfer in accordance with server policy.",
      "zh-CHS": "2106“对象不符合传输条件”当客户端根据服务器策略尝试<transfer>不符合传输条件的对象时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2200 \"Authentication error\" This response code MUST be returned when a server notes an error when validating client credentials.",
      "zh-CHS": "2200“身份验证错误”当服务器在验证客户端凭据时注意到错误时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2201 \"Authorization error\" This response code MUST be returned when a server notes a client authorization error when executing a command. This error is used to note that a client lacks privileges to execute the requested command.",
      "zh-CHS": "2201“授权错误”当服务器在执行命令时注意到客户端授权错误时，必须返回此响应代码。此错误用于说明客户端缺少执行请求的命令的权限。"
    },
    {
      "indent": 3,
      "text": "2202 \"Invalid authorization information\" This response code MUST be returned when a server receives invalid command authorization information required to confirm authorization to execute a command. This error is used to note that a client has the privileges required to execute the requested command, but the authorization information provided by the client does not match the authorization information archived by the server.",
      "zh-CHS": "2202“无效授权信息”当服务器收到确认授权执行命令所需的无效命令授权信息时，必须返回此响应代码。此错误用于说明客户端具有执行请求的命令所需的权限，但客户端提供的授权信息与服务器存档的授权信息不匹配。"
    },
    {
      "indent": 3,
      "text": "2300 \"Object pending transfer\" This response code MUST be returned when a server receives a command to transfer an object that is pending transfer due to an earlier transfer request.",
      "zh-CHS": "2300“对象挂起传输”当服务器接收到传输由于先前传输请求而挂起传输的对象的命令时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2301 \"Object not pending transfer\" This response code MUST be returned when a server receives a command to confirm, reject, or cancel the transfer an object when no command has been made to transfer the object.",
      "zh-CHS": "2301“对象未挂起传输”当服务器接收到确认、拒绝或取消传输对象的命令时，必须返回此响应代码，但未发出传输对象的命令。"
    },
    {
      "indent": 3,
      "text": "2302 \"Object exists\" This response code MUST be returned when a server receives a command to create an object that already exists in the repository.",
      "zh-CHS": "2302“对象存在”当服务器收到创建存储库中已存在的对象的命令时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2303 \"Object does not exist\" This response code MUST be returned when a server receives a command to query or transform an object that does not exist in the repository.",
      "zh-CHS": "2303“对象不存在”当服务器收到查询或转换存储库中不存在的对象的命令时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2304 \"Object status prohibits operation\" This response code MUST be returned when a server receives a command to transform an object that can not be completed due to server policy or business practices. For example, a server can disallow <transfer> commands under terms and conditions that are matters of local policy, or the server might have received a <delete> command for an object whose status prohibits deletion.",
      "zh-CHS": "2304“对象状态禁止操作”当服务器收到转换由于服务器策略或业务实践而无法完成的对象的命令时，必须返回此响应代码。例如，服务器可以在与本地策略有关的条款和条件下禁止<transfer>命令，或者服务器可能已收到状态禁止删除的对象的<delete>命令。"
    },
    {
      "indent": 3,
      "text": "2305 \"Object association prohibits operation\" This response code MUST be returned when a server receives a command to transform an object that can not be completed due to dependencies on other objects that are associated with the target object. For example, a server can disallow <delete> commands while an object has active associations with other objects.",
      "zh-CHS": "2305“对象关联禁止操作”当服务器收到转换对象的命令时，必须返回此响应代码，该命令由于依赖于与目标对象关联的其他对象而无法完成。例如，当对象与其他对象具有活动关联时，服务器可以禁止<delete>命令。"
    },
    {
      "indent": 3,
      "text": "2306 \"Parameter value policy error\" This response code MUST be returned when a server receives a command containing a parameter value that is syntactically valid, but semantically invalid due to local policy. For example, the server can support a subset of a range of valid protocol parameter values. The error value SHOULD be returned via a <value> element in the EPP response.",
      "zh-CHS": "2306“Parameter value policy error”（参数值策略错误）当服务器接收到包含语法有效但由于本地策略而语义无效的参数值的命令时，必须返回此响应代码。例如，服务器可以支持有效协议参数值范围的子集。错误值应通过EPP响应中的<value>元素返回。"
    },
    {
      "indent": 3,
      "text": "2307 \"Unimplemented object service\" This response code MUST be returned when a server receives a command to operate on an object service that is not supported by the server.",
      "zh-CHS": "2307“未实现的对象服务”当服务器接收到操作服务器不支持的对象服务的命令时，必须返回此响应代码。"
    },
    {
      "indent": 3,
      "text": "2308 \"Data management policy violation\" This response code MUST be returned when a server receives a command whose execution results in a violation of server data management policies. For example, removing all attribute values or object associations from an object might be a violation of a server's data management policies.",
      "zh-CHS": "2308“数据管理策略冲突”当服务器收到其执行导致违反服务器数据管理策略的命令时，必须返回此响应代码。例如，从对象中删除所有属性值或对象关联可能违反服务器的数据管理策略。"
    },
    {
      "indent": 3,
      "text": "2400 \"Command failed\" This response code MUST be returned when a server is unable to execute a command due to an internal server error that is not related to the protocol. The failure can be transient. The server MUST keep any ongoing session active.",
      "zh-CHS": "2400“命令失败”当服务器由于与协议无关的内部服务器错误而无法执行命令时，必须返回此响应代码。故障可能是暂时的。服务器必须保持任何正在进行的会话处于活动状态。"
    },
    {
      "indent": 3,
      "text": "2500 \"Command failed; server closing connection\" This response code MUST be returned when a server receives a command that can not be completed due to an internal server error that is not related to the protocol. The failure is not transient, and will cause other commands to fail as well. The server MUST end the active session and close the existing connection.",
      "zh-CHS": "2500“命令失败；服务器关闭连接”当服务器收到由于与协议无关的内部服务器错误而无法完成的命令时，必须返回此响应代码。该故障不是暂时的，也会导致其他命令失败。服务器必须结束活动会话并关闭现有连接。"
    },
    {
      "indent": 3,
      "text": "2501 \"Authentication error; server closing connection\" This response code MUST be returned when a server notes an error when validating client credentials and a server-defined limit on the number of allowable failures has been exceeded. The server MUST close the existing connection.",
      "zh-CHS": "2501“身份验证错误；服务器关闭连接”当服务器在验证客户端凭据时注意到错误，并且超过了服务器定义的允许失败次数限制时，必须返回此响应代码。服务器必须关闭现有连接。"
    },
    {
      "indent": 3,
      "text": "2502 \"Session limit exceeded; server closing connection\" This response code MUST be returned when a server receives a <login> command, and the command can not be completed because the client has exceeded a system-defined limit on the number of sessions that the client can establish. It might be possible to establish a session by ending existing unused sessions and closing inactive connections.",
      "zh-CHS": "2502“超出会话限制；服务器关闭连接”当服务器接收到<login>命令时，必须返回此响应代码，并且该命令无法完成，因为客户端已超过系统定义的客户端可以建立的会话数限制。可以通过结束现有未使用的会话并关闭非活动连接来建立会话。"
    },
    {
      "indent": 0,
      "text": "4. Formal Syntax",
      "section_title": true,
      "zh-CHS": "4. 形式语法"
    },
    {
      "indent": 3,
      "text": "EPP is specified in XML Schema notation. The formal syntax presented here is a complete schema representation of EPP suitable for automated validation of EPP XML instances.",
      "zh-CHS": "EPP是用XML模式表示法指定的。这里给出的形式语法是一个完整的EPP模式表示，适合于自动验证EPP XML实例。"
    },
    {
      "indent": 3,
      "text": "Two schemas are presented here. The first schema is the base EPP schema. The second schema defines elements and structures that can be used by both the base EPP schema and object mapping schemas. The BEGIN and END tags are not part of the schema; they are used to note the beginning and ending of the schema for URI registration purposes.",
      "zh-CHS": "这里介绍了两种模式。第一个模式是基本EPP模式。第二个模式定义了基本EPP模式和对象映射模式都可以使用的元素和结构。开始和结束标记不是模式的一部分；它们用于记录模式的开始和结束，以便进行URI注册。"
    },
    {
      "indent": 0,
      "text": "4.1. Base Schema",
      "section_title": true,
      "zh-CHS": "4.1. 基本模式"
    },
    {
      "indent": 5,
      "text": "BEGIN\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<schema targetNamespace=\"urn:ietf:params:xml:ns:epp-1.0\"\n        xmlns:epp=\"urn:ietf:params:xml:ns:epp-1.0\"\n        xmlns:eppcom=\"urn:ietf:params:xml:ns:eppcom-1.0\"\n        xmlns=\"http://www.w3.org/2001/XMLSchema\"\n        elementFormDefault=\"qualified\">",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nImport common element types.\n-->\n  <import namespace=\"urn:ietf:params:xml:ns:eppcom-1.0\"\n          schemaLocation=\"eppcom-1.0.xsd\"/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<annotation>\n  <documentation>\n    Extensible Provisioning Protocol v1.0 schema.\n  </documentation>\n</annotation>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nEvery EPP XML instance must begin with this element.\n-->\n  <element name=\"epp\" type=\"epp:eppType\"/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nAn EPP XML instance must contain a greeting, hello, command,\nresponse, or extension.\n-->\n  <complexType name=\"eppType\">\n    <choice>\n      <element name=\"greeting\" type=\"epp:greetingType\"/>\n      <element name=\"hello\"/>\n      <element name=\"command\" type=\"epp:commandType\"/>\n      <element name=\"response\" type=\"epp:responseType\"/>\n      <element name=\"extension\" type=\"epp:extAnyType\"/>\n    </choice>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nA greeting is sent by a server in response to a client connection\nor <hello>.\n-->\n  <complexType name=\"greetingType\">\n    <sequence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "    <element name=\"svID\" type=\"epp:sIDType\"/>\n    <element name=\"svDate\" type=\"dateTime\"/>\n    <element name=\"svcMenu\" type=\"epp:svcMenuType\"/>\n    <element name=\"dcp\" type=\"epp:dcpType\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nServer IDs are strings with minimum and maximum length\nrestrictions.\n-->\n  <simpleType name=\"sIDType\">\n    <restriction base=\"normalizedString\">\n      <minLength value=\"3\"/>\n      <maxLength value=\"64\"/>\n    </restriction>\n  </simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nA server greeting identifies available object services.\n-->\n  <complexType name=\"svcMenuType\">\n    <sequence>\n      <element name=\"version\" type=\"epp:versionType\"\n       maxOccurs=\"unbounded\"/>\n      <element name=\"lang\" type=\"language\"\n       maxOccurs=\"unbounded\"/>\n      <element name=\"objURI\" type=\"anyURI\"\n       maxOccurs=\"unbounded\"/>\n      <element name=\"svcExtension\" type=\"epp:extURIType\"\n       minOccurs=\"0\"/>\n    </sequence>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nData Collection Policy types.\n-->\n  <complexType name=\"dcpType\">\n    <sequence>\n      <element name=\"access\" type=\"epp:dcpAccessType\"/>\n      <element name=\"statement\" type=\"epp:dcpStatementType\"\n       maxOccurs=\"unbounded\"/>\n      <element name=\"expiry\" type=\"epp:dcpExpiryType\"\n       minOccurs=\"0\"/>\n    </sequence>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"dcpAccessType\">",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "  <choice>\n    <element name=\"all\"/>\n    <element name=\"none\"/>\n    <element name=\"null\"/>\n    <element name=\"other\"/>\n    <element name=\"personal\"/>\n    <element name=\"personalAndOther\"/>\n  </choice>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"dcpStatementType\">\n  <sequence>\n    <element name=\"purpose\" type=\"epp:dcpPurposeType\"/>\n    <element name=\"recipient\" type=\"epp:dcpRecipientType\"/>\n    <element name=\"retention\" type=\"epp:dcpRetentionType\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"dcpPurposeType\">\n  <sequence>\n    <element name=\"admin\"\n     minOccurs=\"0\"/>\n    <element name=\"contact\"\n     minOccurs=\"0\"/>\n    <element name=\"other\"\n     minOccurs=\"0\"/>\n    <element name=\"prov\"\n     minOccurs=\"0\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"dcpRecipientType\">\n  <sequence>\n    <element name=\"other\"\n     minOccurs=\"0\"/>\n    <element name=\"ours\" type=\"epp:dcpOursType\"\n     minOccurs=\"0\" maxOccurs=\"unbounded\"/>\n    <element name=\"public\"\n     minOccurs=\"0\"/>\n    <element name=\"same\"\n     minOccurs=\"0\"/>\n    <element name=\"unrelated\"\n     minOccurs=\"0\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"dcpOursType\">\n  <sequence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "    <element name=\"recDesc\" type=\"epp:dcpRecDescType\"\n     minOccurs=\"0\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<simpleType name=\"dcpRecDescType\">\n  <restriction base=\"token\">\n    <minLength value=\"1\"/>\n    <maxLength value=\"255\"/>\n  </restriction>\n</simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"dcpRetentionType\">\n  <choice>\n    <element name=\"business\"/>\n    <element name=\"indefinite\"/>\n    <element name=\"legal\"/>\n    <element name=\"none\"/>\n    <element name=\"stated\"/>\n  </choice>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"dcpExpiryType\">\n  <choice>\n    <element name=\"absolute\" type=\"dateTime\"/>\n    <element name=\"relative\" type=\"duration\"/>\n  </choice>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<!--\nExtension framework types.\n-->\n  <complexType name=\"extAnyType\">\n    <sequence>\n      <any namespace=\"##other\"\n       maxOccurs=\"unbounded\"/>\n    </sequence>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "<complexType name=\"extURIType\">\n  <sequence>\n    <element name=\"extURI\" type=\"anyURI\"\n     maxOccurs=\"unbounded\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": " <!-- An EPP version number is a dotted pair of decimal numbers.",
      "zh-CHS": "<!-- EPP版本号是小数点对。"
    },
    {
      "indent": 3,
      "text": "-->\n  <simpleType name=\"versionType\">\n    <restriction base=\"token\">\n      <pattern value=\"[1-9]+\\.[0-9]+\"/>\n      <enumeration value=\"1.0\"/>\n    </restriction>\n  </simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nCommand types.\n-->\n  <complexType name=\"commandType\">\n    <sequence>\n      <choice>\n        <element name=\"check\" type=\"epp:readWriteType\"/>\n        <element name=\"create\" type=\"epp:readWriteType\"/>\n        <element name=\"delete\" type=\"epp:readWriteType\"/>\n        <element name=\"info\" type=\"epp:readWriteType\"/>\n        <element name=\"login\" type=\"epp:loginType\"/>\n        <element name=\"logout\"/>\n        <element name=\"poll\" type=\"epp:pollType\"/>\n        <element name=\"renew\" type=\"epp:readWriteType\"/>\n        <element name=\"transfer\" type=\"epp:transferType\"/>\n        <element name=\"update\" type=\"epp:readWriteType\"/>\n      </choice>\n      <element name=\"extension\" type=\"epp:extAnyType\"\n       minOccurs=\"0\"/>\n      <element name=\"clTRID\" type=\"epp:trIDStringType\"\n       minOccurs=\"0\"/>\n    </sequence>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nThe <login> command.\n-->\n  <complexType name=\"loginType\">\n    <sequence>\n      <element name=\"clID\" type=\"eppcom:clIDType\"/>\n      <element name=\"pw\" type=\"epp:pwType\"/>\n      <element name=\"newPW\" type=\"epp:pwType\"\n       minOccurs=\"0\"/>\n      <element name=\"options\" type=\"epp:credsOptionsType\"/>\n      <element name=\"svcs\" type=\"epp:loginSvcType\"/>\n    </sequence>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"credsOptionsType\">\n  <sequence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "    <element name=\"version\" type=\"epp:versionType\"/>\n    <element name=\"lang\" type=\"language\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<simpleType name=\"pwType\">\n  <restriction base=\"token\">\n    <minLength value=\"6\"/>\n    <maxLength value=\"16\"/>\n  </restriction>\n</simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"loginSvcType\">\n  <sequence>\n    <element name=\"objURI\" type=\"anyURI\"\n     maxOccurs=\"unbounded\"/>\n    <element name=\"svcExtension\" type=\"epp:extURIType\"\n     minOccurs=\"0\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nThe <poll> command.\n-->\n  <complexType name=\"pollType\">\n    <attribute name=\"op\" type=\"epp:pollOpType\"\n     use=\"required\"/>\n    <attribute name=\"msgID\" type=\"token\"/>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "  <simpleType name=\"pollOpType\">\n    <restriction base=\"token\">\n      <enumeration value=\"ack\"/>\n      <enumeration value=\"req\"/>\n    </restriction>\n  </simpleType>\n<!--\nThe <transfer> command.  This is object-specific, and uses attributes\nto identify the requested operation.\n-->\n  <complexType name=\"transferType\">\n    <sequence>\n      <any namespace=\"##other\"/>\n    </sequence>\n    <attribute name=\"op\" type=\"epp:transferOpType\"\n     use=\"required\"/>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<simpleType name=\"transferOpType\">\n  <restriction base=\"token\">\n    <enumeration value=\"approve\"/>\n    <enumeration value=\"cancel\"/>\n    <enumeration value=\"query\"/>\n    <enumeration value=\"reject\"/>\n    <enumeration value=\"request\"/>\n  </restriction>\n</simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nAll other object-centric commands. EPP doesn't specify the syntax or\nsemantics of object-centric command elements.  The elements MUST be\ndescribed in detail in another schema specific to the object.\n-->\n  <complexType name=\"readWriteType\">\n    <sequence>\n      <any namespace=\"##other\"/>\n    </sequence>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"trIDType\">\n  <sequence>\n    <element name=\"clTRID\" type=\"epp:trIDStringType\"\n     minOccurs=\"0\"/>\n    <element name=\"svTRID\" type=\"epp:trIDStringType\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "  <simpleType name=\"trIDStringType\">\n    <restriction base=\"token\">\n      <minLength value=\"3\"/>\n      <maxLength value=\"64\"/>\n    </restriction>\n  </simpleType>\n<!--\nResponse types.\n-->\n  <complexType name=\"responseType\">\n    <sequence>\n      <element name=\"result\" type=\"epp:resultType\"\n       maxOccurs=\"unbounded\"/>\n      <element name=\"msgQ\" type=\"epp:msgQType\"\n       minOccurs=\"0\"/>\n      <element name=\"resData\" type=\"epp:extAnyType\"\n       minOccurs=\"0\"/>\n      <element name=\"extension\" type=\"epp:extAnyType\"\n       minOccurs=\"0\"/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "    <element name=\"trID\" type=\"epp:trIDType\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"resultType\">\n  <sequence>\n    <element name=\"msg\" type=\"epp:msgType\"/>\n    <choice minOccurs=\"0\" maxOccurs=\"unbounded\">\n      <element name=\"value\" type=\"epp:errValueType\"/>\n      <element name=\"extValue\" type=\"epp:extErrValueType\"/>\n    </choice>\n  </sequence>\n  <attribute name=\"code\" type=\"epp:resultCodeType\"\n   use=\"required\"/>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"errValueType\" mixed=\"true\">\n  <sequence>\n    <any namespace=\"##any\" processContents=\"skip\"/>\n  </sequence>\n  <anyAttribute namespace=\"##any\" processContents=\"skip\"/>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"extErrValueType\">\n  <sequence>\n    <element name=\"value\" type=\"epp:errValueType\"/>\n    <element name=\"reason\" type=\"epp:msgType\"/>\n  </sequence>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"msgQType\">\n  <sequence>\n    <element name=\"qDate\" type=\"dateTime\"\n     minOccurs=\"0\"/>\n    <element name=\"msg\" type=\"epp:mixedMsgType\"\n     minOccurs=\"0\"/>\n  </sequence>\n  <attribute name=\"count\" type=\"unsignedLong\"\n   use=\"required\"/>\n  <attribute name=\"id\" type=\"eppcom:minTokenType\"\n   use=\"required\"/>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"mixedMsgType\" mixed=\"true\">\n  <sequence>\n    <any processContents=\"skip\"\n     minOccurs=\"0\" maxOccurs=\"unbounded\"/>\n  </sequence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "  <attribute name=\"lang\" type=\"language\"\n   default=\"en\"/>\n</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nHuman-readable text may be expressed in languages other than English.\n-->\n  <complexType name=\"msgType\">\n    <simpleContent>\n      <extension base=\"normalizedString\">\n        <attribute name=\"lang\" type=\"language\"\n         default=\"en\"/>\n      </extension>\n    </simpleContent>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nEPP result codes.\n-->\n  <simpleType name=\"resultCodeType\">\n    <restriction base=\"unsignedShort\">\n      <enumeration value=\"1000\"/>\n      <enumeration value=\"1001\"/>\n      <enumeration value=\"1300\"/>\n      <enumeration value=\"1301\"/>\n      <enumeration value=\"1500\"/>\n      <enumeration value=\"2000\"/>\n      <enumeration value=\"2001\"/>\n      <enumeration value=\"2002\"/>\n      <enumeration value=\"2003\"/>\n      <enumeration value=\"2004\"/>\n      <enumeration value=\"2005\"/>\n      <enumeration value=\"2100\"/>\n      <enumeration value=\"2101\"/>\n      <enumeration value=\"2102\"/>\n      <enumeration value=\"2103\"/>\n      <enumeration value=\"2104\"/>\n      <enumeration value=\"2105\"/>\n      <enumeration value=\"2106\"/>\n      <enumeration value=\"2200\"/>\n      <enumeration value=\"2201\"/>\n      <enumeration value=\"2202\"/>\n      <enumeration value=\"2300\"/>\n      <enumeration value=\"2301\"/>\n      <enumeration value=\"2302\"/>\n      <enumeration value=\"2303\"/>\n      <enumeration value=\"2304\"/>\n      <enumeration value=\"2305\"/>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "    <enumeration value=\"2306\"/>\n    <enumeration value=\"2307\"/>\n    <enumeration value=\"2308\"/>\n    <enumeration value=\"2400\"/>\n    <enumeration value=\"2500\"/>\n    <enumeration value=\"2501\"/>\n    <enumeration value=\"2502\"/>\n  </restriction>\n</simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!-- End of schema. --> </schema> END",
      "zh-CHS": "<!-- 架构结束。--></架构>结束"
    },
    {
      "indent": 0,
      "text": "4.2. Shared Structure Schema",
      "section_title": true,
      "zh-CHS": "4.2. 共享结构模式"
    },
    {
      "indent": 5,
      "text": "BEGIN\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<schema targetNamespace=\"urn:ietf:params:xml:ns:eppcom-1.0\"\n        xmlns:eppcom=\"urn:ietf:params:xml:ns:eppcom-1.0\"\n        xmlns=\"http://www.w3.org/2001/XMLSchema\"\n        elementFormDefault=\"qualified\">",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "  <annotation>\n    <documentation>\n    Extensible Provisioning Protocol v1.0\n    shared structures schema.\n  </documentation>\n</annotation>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nObject authorization information types.\n-->\n  <complexType name=\"pwAuthInfoType\">\n    <simpleContent>\n      <extension base=\"normalizedString\">\n        <attribute name=\"roid\" type=\"eppcom:roidType\"/>\n      </extension>\n    </simpleContent>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<complexType name=\"extAuthInfoType\">\n  <sequence>\n    <any namespace=\"##other\"/>\n  </sequence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "</complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\n<check> response types.\n-->\n  <complexType name=\"reasonType\">\n    <simpleContent>\n      <extension base=\"eppcom:reasonBaseType\">\n        <attribute name=\"lang\" type=\"language\"/>\n      </extension>\n    </simpleContent>\n  </complexType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<simpleType name=\"reasonBaseType\">\n  <restriction base=\"token\">\n    <minLength value=\"1\"/>\n    <maxLength value=\"32\"/>\n  </restriction>\n</simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nAbstract client and object identifier type.\n-->\n  <simpleType name=\"clIDType\">\n    <restriction base=\"token\">\n      <minLength value=\"3\"/>\n      <maxLength value=\"16\"/>\n    </restriction>\n  </simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nDNS label type.\n-->\n  <simpleType name=\"labelType\">\n    <restriction base=\"token\">\n      <minLength value=\"1\"/>\n      <maxLength value=\"255\"/>\n    </restriction>\n  </simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nNon-empty token type.\n-->\n  <simpleType name=\"minTokenType\">\n    <restriction base=\"token\">\n      <minLength value=\"1\"/>\n    </restriction>\n  </simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nRepository Object IDentifier type.\n-->\n  <simpleType name=\"roidType\">\n    <restriction base=\"token\">\n      <pattern value=\"(\\w|_){1,80}-\\w{1,8}\"/>\n    </restriction>\n  </simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!--\nTransfer status identifiers.\n-->\n  <simpleType name=\"trStatusType\">\n    <restriction base=\"token\">\n      <enumeration value=\"clientApproved\"/>\n      <enumeration value=\"clientCancelled\"/>\n      <enumeration value=\"clientRejected\"/>\n      <enumeration value=\"pending\"/>\n      <enumeration value=\"serverApproved\"/>\n      <enumeration value=\"serverCancelled\"/>\n    </restriction>\n  </simpleType>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<!-- End of schema. --> </schema> END",
      "zh-CHS": "<!-- 架构结束。--></架构>结束"
    },
    {
      "indent": 0,
      "text": "5. Internationalization Considerations",
      "section_title": true,
      "zh-CHS": "5. 国际化考虑"
    },
    {
      "indent": 3,
      "text": "EPP is represented in XML, which provides native support for encoding information using the Unicode character set and its more compact representations including UTF-8. Conformant XML processors recognize both UTF-8 and UTF-16. Though XML includes provisions to identify and use other character encodings through use of an \"encoding\" attribute in an <?xml?> declaration, use of UTF-8 is RECOMMENDED in environments where parser encoding support incompatibility exists.",
      "zh-CHS": "EPP用XML表示，它为使用Unicode字符集及其更紧凑的表示（包括UTF-8）编码信息提供了本机支持。一致性XML处理器同时识别UTF-8和UTF-16。尽管XML包含通过在<？XML？>声明中使用“encoding”属性来识别和使用其他字符编码的规定，但在解析器编码支持不兼容的环境中，建议使用UTF-8。"
    },
    {
      "indent": 3,
      "text": "EPP includes a provision for returning a human-readable message with every result code. This document describes result codes in English, but the actual text returned with a result MAY be provided in a language negotiated when a session is established. Languages other than English MUST be noted through specification of a \"lang\" attribute for each message. Valid values for the \"lang\" attribute and \"lang\" negotiation elements are described in [RFC3066].",
      "zh-CHS": "EPP包括一个用于返回带有每个结果代码的人类可读消息的规定。本文档以英语描述结果代码，但返回结果的实际文本可以在建立会话时以协商的语言提供。除英语以外的其他语言必须通过为每条消息指定“lang”属性来标注。[RFC3066]中描述了“lang”属性和“lang”协商元素的有效值。"
    },
    {
      "indent": 3,
      "text": "All date-time values presented via EPP MUST be expressed in Universal Coordinated Time using the Gregorian calendar. XML Schema allows use of time zone identifiers to indicate offsets from the zero meridian, but this option MUST NOT be used with EPP. The extended date-time form using upper case \"T\" and \"Z\" characters defined in [RFC3339] MUST be used to represent date-time values as XML Schema does not support truncated date-time forms or lower case \"T\" and \"Z\" characters.",
      "zh-CHS": "通过EPP提供的所有日期时间值必须使用公历以全球协调时间表示。XML模式允许使用时区标识符来指示从零子午线的偏移，但此选项不得与EPP一起使用。使用[RFC3339]中定义的大写“T”和“Z”字符的扩展日期时间表单必须用于表示日期时间值，因为XML模式不支持截断日期时间表单或小写“T”和“Z”字符。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document uses URNs to describe XML namespaces and XML schemas conforming to a registry mechanism described in [RFC3688]. Four URI assignments have been registered by the IANA.",
      "zh-CHS": "本文档使用URN来描述符合[RFC3688]中描述的注册表机制的XML名称空间和XML模式。IANA已经注册了四个URI分配。"
    },
    {
      "indent": 3,
      "text": "Registration request for the EPP namespace:",
      "zh-CHS": "EPP命名空间的注册请求："
    },
    {
      "indent": 6,
      "text": "URI: urn:ietf:params:xml:ns:epp-1.0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Registrant Contact: See the \"Author's Address\" section of this document.",
      "zh-CHS": "注册人联系人：请参阅本文件的“作者地址”部分。"
    },
    {
      "indent": 6,
      "text": "XML: None. Namespace URIs do not represent an XML specification.",
      "zh-CHS": "XML：没有。命名空间URI不表示XML规范。"
    },
    {
      "indent": 3,
      "text": "Registration request for the EPP XML schema:",
      "zh-CHS": "EPP XML架构的注册请求："
    },
    {
      "indent": 6,
      "text": "URI: urn:ietf:params:xml:schema:epp-1.0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Registrant Contact: See the \"Author's Address\" section of this document.",
      "zh-CHS": "注册人联系人：请参阅本文件的“作者地址”部分。"
    },
    {
      "indent": 6,
      "text": "XML: See the \"Base Schema\" section of this document.",
      "zh-CHS": "XML：请参阅本文档的“基本模式”部分。"
    },
    {
      "indent": 3,
      "text": "Registration request for the EPP shared structure namespace:",
      "zh-CHS": "EPP共享结构命名空间的注册请求："
    },
    {
      "indent": 6,
      "text": "URI: urn:ietf:params:xml:ns:eppcom-1.0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Registrant Contact: See the \"Author's Address\" section of this document.",
      "zh-CHS": "注册人联系人：请参阅本文件的“作者地址”部分。"
    },
    {
      "indent": 6,
      "text": "XML: None. Namespace URIs do not represent an XML specification.",
      "zh-CHS": "XML：没有。命名空间URI不表示XML规范。"
    },
    {
      "indent": 3,
      "text": "Registration request for the EPP shared structure XML schema:",
      "zh-CHS": "EPP共享结构XML架构的注册请求："
    },
    {
      "indent": 6,
      "text": "URI: urn:ietf:params:xml:schema:eppcom-1.0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Registrant Contact: See the \"Author's Address\" section of this document.",
      "zh-CHS": "注册人联系人：请参阅本文件的“作者地址”部分。"
    },
    {
      "indent": 6,
      "text": "XML: See the \"Shared Structure Schema\" section of this document.",
      "zh-CHS": "XML：请参阅本文档的“共享结构模式”部分。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "EPP provides only simple client authentication services. A passive attack is sufficient to recover client identifiers and passwords, allowing trivial command forgery. Protection against most common attacks and more robust security services MUST be provided by other protocol layers. Specifically, EPP instances MUST be protected using a transport mechanism or application protocol that provides integrity and confidentiality.",
      "zh-CHS": "EPP只提供简单的客户端身份验证服务。被动攻击足以恢复客户端标识符和密码，从而允许少量命令伪造。其他协议层必须提供针对最常见攻击的保护和更强大的安全服务。具体来说，必须使用提供完整性和机密性的传输机制或应用程序协议来保护EPP实例。"
    },
    {
      "indent": 3,
      "text": "EPP uses a variant of the PLAIN SASL mechanism described in [RFC2595] to provide a simple application-layer authentication service that augments or supplements authentication and identification services that might be available at other protocol layers. Where the PLAIN SASL mechanism specifies provision of an authorization identifier, authentication identifier, and password as a single string separated by ASCII NUL characters, EPP specifies use of a combined authorization and authentication identifier and a password provided as distinct XML elements.",
      "zh-CHS": "EPP使用[RFC2595]中描述的普通SASL机制的变体来提供一个简单的应用层身份验证服务，该服务增强或补充其他协议层可能提供的身份验证和标识服务。当普通SASL机制指定将授权标识符、身份验证标识符和密码作为单个字符串提供（由ASCII NUL字符分隔）时，EPP指定使用组合授权和身份验证标识符以及作为不同XML元素提供的密码。"
    },
    {
      "indent": 3,
      "text": "Repeated password guessing attempts can be discouraged by limiting the number of <login> attempts that can be attempted on an open connection. A server MAY close an open connection if multiple <login> attempts are made with either an invalid client identifier, an invalid password, or both an invalid client identifier and an invalid password.",
      "zh-CHS": "通过限制可在打开的连接上尝试的<login>尝试次数，可以阻止重复的密码猜测尝试。如果多次尝试使用无效的客户端标识符、无效的密码或无效的客户端标识符和无效的密码，服务器可能会关闭打开的连接。"
    },
    {
      "indent": 3,
      "text": "EPP uses authentication information associated with objects to confirm object transfer authority. Authentication information exchanged between EPP clients and third party entities MUST be exchanged using a facility that provides privacy and integrity services to protect against unintended disclosure and modification while in transit.",
      "zh-CHS": "EPP使用与对象关联的身份验证信息来确认对象传输权限。EPP客户端和第三方实体之间交换的身份验证信息必须使用提供隐私和完整性服务的设施进行交换，以防止传输过程中的意外披露和修改。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "This document was originally written as an individual submission Internet-Draft. The provreg working group later adopted it as a working group document and provided many invaluable comments and suggested improvements. The author wishes to acknowledge the efforts of WG chairs Edward Lewis and Jaap Akkerhuis for their process and editorial contributions.",
      "zh-CHS": "本文件最初是作为个人提交的互联网草案编写的。provreg工作组后来将其作为工作组文件通过，并提出了许多宝贵的意见和改进建议。作者希望感谢工作组主席Edward Lewis和Jaap Akkerhuis的工作过程和编辑贡献。"
    },
    {
      "indent": 3,
      "text": "Specific suggestions that have been incorporated into this document were provided by Chris Bason, Eric Brunner-Williams, Jordyn Buchanan, Roger Castillo Cortazar, Dave Crocker, Ayesha Damaraju, Sheer El-Showk, Patrik Faltstrom, James Gould, John Immordino, Dan Kohn, Hong Liu, Klaus Malorny, Dan Manley, Michael Mealling, Patrick Mevzek, Andrew Newton, Budi Rahardjo, Asbjorn Steira, Rick Wesson, and Jay Westerdal.",
      "zh-CHS": "已纳入本文件的具体建议由Chris Bason、Eric Brunner Williams、Jordyn Buchanan、Roger Castillo Cortazar、Dave Crocker、Ayesa Damaraju、Sheer El Showk、Patrik Faltstrom、James Gould、John Immordino、Dan Kohn、Hong Liu、Klaus Malorny、Dan Manley、Michael Melling、Patrick Mevzek提供，安德鲁·牛顿、布迪·拉哈德乔、阿斯比约恩·施泰拉、里克·韦斯森和杰伊·韦斯特达尔。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key Words for Use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2277] Alvestrand, H., \"IETF Policy on Character Sets and Languages\", BCP 18, RFC 2277, January 1998.",
      "zh-CHS": "[RFC2277]Alvestrand，H.，“IETF字符集和语言政策”，BCP 18，RFC 2277，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2279] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", RFC 2279, January 1998.",
      "zh-CHS": "[RFC2279]Yergeau，F.，“UTF-8，ISO 10646的转换格式”，RFC 2279，1998年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2781] Hoffman, P. and F. Yergeau, \"UTF-16, an encoding of ISO 10646\", RFC 2781, February 2000.",
      "zh-CHS": "[RFC2781]Hoffman，P.和F.Yergeau，“UTF-16，ISO 10646编码”，RFC 2781，2000年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2914] Floyd, S., \"Congestion Control Principles\", BCP 41, RFC 2914, September 2000.",
      "zh-CHS": "[RFC2914]Floyd，S.，“拥塞控制原则”，BCP 41，RFC 2914，2000年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3023] Murata, M., St.Laurent, S. and D. Kohn, \"XML Media Types\", RFC 3023, January 2001.",
      "zh-CHS": "[RFC3023]Murata，M.，St.Laurent，S.和D.Kohn，“XML媒体类型”，RFC 3023，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3066] Alvestrand, H., \"Tags for the Identification of Languages\", BCP 47, RFC 3066, January 2001.",
      "zh-CHS": "[RFC3066]Alvestrand，H.，“语言识别标签”，BCP 47，RFC 3066，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3339] Klyne, G. and C. Newman, \"Date and Time on the Internet: Timestamps\", RFC 3339, July 2002.",
      "zh-CHS": "[RFC3339]Klyne，G.和C.Newman，“互联网上的日期和时间：时间戳”，RFC 3339，2002年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3375] Hollenbeck, S., \"Generic Registry-Registrar Protocol Requirements\", RFC 3375, September 2002.",
      "zh-CHS": "[RFC3375]Hollenbeck，S.，“通用注册登记协议要求”，RFC 3375，2002年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3688] Mealling, M., \"The IETF XML Registry\", BCP 81, RFC 3688, January 2004.",
      "zh-CHS": "[RFC3688]Mealling，M.“IETF XML注册表”，BCP 81，RFC 3688，2004年1月。"
    },
    {
      "indent": 3,
      "text": "[XML] Editor T. Bray et al.: \"Extensible Markup Language (XML) 1.0 (Second Edition)\", W3C Recommendation 6 October 2000.",
      "zh-CHS": "[XML]编辑T.Bray等人：“可扩展标记语言（XML）1.0（第二版）”，W3C建议，2000年10月6日。"
    },
    {
      "indent": 3,
      "text": "[XMLE] \"XML 1.0 Second Edition Specification Errata\", E22, 25 July 2001, http://www.w3.org/XML/xml-V10-2e-errata#E22.",
      "zh-CHS": "[XMLE]“XML 1.0第二版规范勘误表”，E222001年7月25日，http://www.w3.org/XML/xml-V10-2e-errata#E22."
    },
    {
      "indent": 3,
      "text": "[XMLS-1] Editors H. Thompson et al.: \"XML Schema Part 1: Structures\", W3C Recommendation 2 May 2001.",
      "zh-CHS": "[XMLS-1]编辑H.Thompson等人：“XML模式第1部分：结构”，W3C建议2，2001年5月。"
    },
    {
      "indent": 3,
      "text": "[XMLS-2] Editors P. Biron, A. Malhotra: \"XML Schema Part 2: Datatypes\", W3C Recommendation 2 May 2001.",
      "zh-CHS": "[XMLS-2]编辑P.Biron，A.Malhotra：“XML模式第2部分：数据类型”，W3C建议2，2001年5月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[P3P] Editor M. Marchiori: \"The Platform for Privacy Preferences 1.0 (P3P1.0) Specification\", W3C Recommendation 16 April 2002.",
      "zh-CHS": "[P3P]编辑M.Marchiori：“隐私偏好平台1.0（P3P1.0）规范”，W3C建议2002年4月16日。"
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "zh-CHS": "[RFC793]Postel，J.，“传输控制协议”，标准7，RFC 793，1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2595] Newman, C., \"Using TLS with IMAP, POP3 and ACAP\", RFC 2595, June 1999.",
      "zh-CHS": "[RFC2595]Newman，C.，“将TLS与IMAP、POP3和ACAP一起使用”，RFC2595，1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2821] Klensin, J., Ed., \"Simple Mail Transfer Protocol\", RFC 2821, April 2001.",
      "zh-CHS": "[RFC2821]Klensin，J.，Ed.，“简单邮件传输协议”，RFC 28212001年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2960] Stewart, R., Xie, Q., Morneault, K., Sharp, C., Schwarzbauer, H., Taylor, T., Rytina, I., Kalla, M., Zhang, L. and V. Paxson, \"Stream Control Transmission Protocol\", RFC 2960, October 2000.",
      "zh-CHS": "[RFC2960]Stewart，R.，Xie，Q.，Morneault，K.，Sharp，C.，Schwarzbauer，H.，Taylor，T.，Rytina，I.，Kalla，M.，Zhang，L.和V.Paxson，“流控制传输协议”，RFC 29602000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3080] Rose, M., \"The Blocks Extensible Exchange Protocol Core\", RFC 3080, March 2001.",
      "zh-CHS": "[RFC3080]Rose，M.，“块可扩展交换协议核心”，RFC 30802001年3月。"
    },
    {
      "indent": 0,
      "text": "Appendix A: Object Mapping Template",
      "zh-CHS": "附录A：对象映射模板"
    },
    {
      "indent": 3,
      "text": "This appendix describes a recommended outline for documenting the EPP mapping of an object. Documents that describe EPP object mappings SHOULD describe the mapping in a format similar to the one used here. Additional sections are required if the object mapping is written in Internet-Draft or RFC format.",
      "zh-CHS": "本附录描述了记录对象EPP映射的推荐大纲。描述EPP对象映射的文档应该以类似于此处使用的格式描述映射。如果对象映射是以Internet草稿或RFC格式编写的，则需要附加部分。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Provide an introduction that describes the object and an overview of the mapping to EPP.",
      "zh-CHS": "提供一个描述对象的介绍，并概述到EPP的映射。"
    },
    {
      "indent": 0,
      "text": "2. Object Attributes",
      "section_title": true,
      "zh-CHS": "2. 对象属性"
    },
    {
      "indent": 3,
      "text": "Describe the attributes associated with the object, including references to syntax specifications as appropriate. Examples of object attributes include a name or identifier and dates associated with modification events.",
      "zh-CHS": "描述与对象关联的属性，包括适当的语法规范引用。对象属性的示例包括名称或标识符以及与修改事件关联的日期。"
    },
    {
      "indent": 0,
      "text": "3. EPP Command Mapping",
      "section_title": true,
      "zh-CHS": "3. EPP命令映射"
    },
    {
      "indent": 0,
      "text": "3.1. EPP Query Commands",
      "section_title": true,
      "zh-CHS": "3.1. EPP查询命令"
    },
    {
      "indent": 0,
      "text": "3.1.1. EPP <check> Command",
      "section_title": true,
      "zh-CHS": "3.1.1. EPP<check>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <check> command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<check>命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "3.1.2. EPP <info> Command",
      "section_title": true,
      "zh-CHS": "3.1.2. EPP<info>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <info> command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<info>命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "3.1.3. EPP <poll> Command",
      "section_title": true,
      "zh-CHS": "3.1.3. EPP<poll>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <poll> command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<poll>命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "3.1.4. EPP <transfer> Command",
      "section_title": true,
      "zh-CHS": "3.1.4. EPP<transfer>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <transfer> query command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<transfer>query命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "3.2. EPP Transform Commands",
      "section_title": true,
      "zh-CHS": "3.2. EPP转换命令"
    },
    {
      "indent": 0,
      "text": "3.2.1. EPP <create> Command",
      "section_title": true,
      "zh-CHS": "3.2.1. EPP<create>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <create> command. Include both sample commands and sample responses. Describe the status of the object with respect to time, including expected client and server behavior if a validity period is used.",
      "zh-CHS": "描述实现EPP<create>命令所需的特定于对象的映射。包括示例命令和示例响应。描述对象相对于时间的状态，包括使用有效期时预期的客户端和服务器行为。"
    },
    {
      "indent": 0,
      "text": "3.2.2. EPP <delete> Command",
      "section_title": true,
      "zh-CHS": "3.2.2. EPP<delete>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <delete> command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<delete>命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "3.2.3. EPP <renew> Command",
      "section_title": true,
      "zh-CHS": "3.2.3. EPP<renew>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <renew> command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<renew>命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "3.2.4. EPP <transfer> Command",
      "section_title": true,
      "zh-CHS": "3.2.4. EPP<transfer>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <transfer> command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<transfer>命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "3.2.5. EPP <update> Command",
      "section_title": true,
      "zh-CHS": "3.2.5. EPP<update>命令"
    },
    {
      "indent": 3,
      "text": "Describe the object-specific mappings required to implement the EPP <update> command. Include both sample commands and sample responses.",
      "zh-CHS": "描述实现EPP<update>命令所需的特定于对象的映射。包括示例命令和示例响应。"
    },
    {
      "indent": 0,
      "text": "4. Formal Syntax",
      "section_title": true,
      "zh-CHS": "4. 形式语法"
    },
    {
      "indent": 3,
      "text": "Provide the XML schema for the object mapping. An XML DTD MUST NOT be used as DTDs do not provide sufficient support for XML namespaces and strong data typing.",
      "zh-CHS": "为对象映射提供XML模式。不能使用XML DTD，因为DTD不能为XML名称空间和强数据类型提供足够的支持。"
    },
    {
      "indent": 0,
      "text": "Appendix B:  Media Type Registration: application/epp+xml",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MIME media type name: application",
      "zh-CHS": "MIME媒体类型名称：应用程序"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: epp+xml",
      "zh-CHS": "MIME子类型名称：epp+xml"
    },
    {
      "indent": 3,
      "text": "Mandatory parameters: none",
      "zh-CHS": "强制参数：无"
    },
    {
      "indent": 3,
      "text": "Optional parameters: Same as the charset parameter of application/xml as specified in [RFC3023].",
      "zh-CHS": "可选参数：与[RFC3023]中指定的application/xml的charset参数相同。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: Same as the encoding considerations of application/xml as specified in [RFC3023].",
      "zh-CHS": "编码注意事项：与[RFC3023]中指定的application/xml的编码注意事项相同。"
    },
    {
      "indent": 3,
      "text": "Security considerations: This type has all of the security considerations described in [RFC3023] plus the considerations specified in the Security Considerations section of this document.",
      "zh-CHS": "安全注意事项：此类型具有[RFC3023]中描述的所有安全注意事项，以及本文档安全注意事项部分中指定的注意事项。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: XML has proven to be interoperable across WebDAV clients and servers, and for import and export from multiple XML authoring tools. For maximum interoperability, validating processors are recommended. Although non-validating processors can be more efficient, they are not required to handle all features of XML. For further information, see sub-section 2.9 \"Standalone Document Declaration\" and section 5 \"Conformance\" of [XML].",
      "zh-CHS": "互操作性注意事项：XML已被证明可跨WebDAV客户端和服务器进行互操作，并可从多个XML创作工具导入和导出。为了实现最大的互操作性，建议验证处理器。尽管非验证处理器可能更高效，但它们并不需要处理XML的所有特性。有关更多信息，请参见[XML]第2.9小节“独立文档声明”和第5节“一致性”。"
    },
    {
      "indent": 3,
      "text": "Published specification: This document.",
      "zh-CHS": "已发布规范：本文件。"
    },
    {
      "indent": 3,
      "text": "Applications which use this media type: EPP is device-, platform-, and vendor-neutral and is supported by multiple service providers.",
      "zh-CHS": "使用此媒体类型的应用程序：EPP是设备、平台和供应商中立的，由多个服务提供商支持。"
    },
    {
      "indent": 3,
      "text": "Additional information: If used, magic numbers, fragment identifiers, base URIs, and use of the BOM should be as specified in [RFC3023].",
      "zh-CHS": "附加信息：如果使用，幻数、片段标识符、基本URI和BOM的使用应符合[RFC3023]中的规定。"
    },
    {
      "indent": 3,
      "text": "Magic number(s): None.  File extension(s): .xml Macintosh File  Type\nCode(s): \"TEXT\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Person and email address for further information: See the \"Author's Address\" section of this document.",
      "zh-CHS": "人员和电子邮件地址了解更多信息：请参阅本文档的“作者地址”部分。"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Author/Change controller: IETF",
      "zh-CHS": "作者/变更控制员：IETF"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Scott Hollenbeck VeriSign Global Registry Services 21345 Ridgetop Circle Dulles, VA 20166-6503 USA",
      "zh-CHS": "Scott Hollenbeck VeriSign全球注册服务21345 Ridgetop Circle Dulles，弗吉尼亚州20166-6503美国"
    },
    {
      "indent": 3,
      "text": "EMail: shollenbeck@verisign.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78 and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}