{
  "title": {
    "text": "RFC 3137:  OSPF Stub Router Advertisement ",
    "zh-CHS": "RFC 3137"
  },
  "number": 3137,
  "created_at": "2021-10-26 02:28:38.095104+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          A. Retana\nRequest for Comments: 3137                                     L. Nguyen\nCategory: Informational                                         R. White\n                                                           Cisco Systems\n                                                                A. Zinin\n                                                           Nexsi Systems\n                                                            D. McPherson\n                                                          Amber Networks\n                                                               June 2001",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "OSPF Stub Router Advertisement",
      "zh-CHS": "OSPF存根路由器广告"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo describes a backward-compatible technique that may be used by OSPF (Open Shortest Path First) implementations to advertise unavailability to forward transit traffic or to lower the preference level for the paths through such a router. In some cases, it is desirable not to route transit traffic via a specific OSPF router. However, OSPF does not specify a standard way to accomplish this.",
      "zh-CHS": "本备忘录描述了一种向后兼容的技术，OSPF（开放最短路径优先）实现可使用该技术来通告转发传输流量的不可用性，或降低通过此类路由器的路径的首选级别。在某些情况下，不希望通过特定的OSPF路由器路由中转流量。然而，OSPF并没有指定实现这一点的标准方法。"
    },
    {
      "indent": 0,
      "text": "1. Motivation",
      "section_title": true,
      "zh-CHS": "1. 动机"
    },
    {
      "indent": 3,
      "text": "In some situations, it may be advantageous to inform routers in a network not to use a specific router as a transit point, but still route to it. Possible situations include the following.",
      "zh-CHS": "在某些情况下，通知网络中的路由器不使用特定路由器作为中转点，但仍然路由到它可能是有利的。可能的情况包括：。"
    },
    {
      "indent": 6,
      "text": "o The router is in a critical condition (for example, has very high CPU load or does not have enough memory to store all LSAs or build the routing table).",
      "zh-CHS": "o 路由器处于关键状态（例如，CPU负载非常高，或者没有足够的内存来存储所有LSA或构建路由表）。"
    },
    {
      "indent": 6,
      "text": "o Graceful introduction and removal of the router to/from the network.",
      "zh-CHS": "o 在网络中优雅地引入和移除路由器。"
    },
    {
      "indent": 6,
      "text": "o Other (administrative or traffic engineering) reasons.",
      "zh-CHS": "o 其他（行政或交通工程）原因。"
    },
    {
      "indent": 3,
      "text": "Note that the proposed solution does not remove the router from the topology view of the network (as could be done by just flushing that router's router-LSA), but prevents other routers from using it for transit routing, while still routing packets to router's own IP addresses, i.e., the router is announced as stub.",
      "zh-CHS": "请注意，建议的解决方案不会将路由器从网络拓扑视图中移除（只需刷新该路由器的路由器LSA即可），但会阻止其他路由器将其用于传输路由，同时仍然将数据包路由到路由器自己的IP地址，即，路由器被宣布为存根。"
    },
    {
      "indent": 3,
      "text": "It must be emphasized that the proposed solution provides real benefits in networks designed with at least some level of redundancy so that traffic can be routed around the stub router. Otherwise, traffic destined for the networks reachable through such a stub router will be still routed through it.",
      "zh-CHS": "必须强调的是，所提出的解决方案在设计有至少某种程度冗余的网络中提供了真正的好处，从而可以在存根路由器周围路由流量。否则，发往通过这种存根路由器可到达的网络的流量仍将通过它路由。"
    },
    {
      "indent": 0,
      "text": "2. Proposed Solution",
      "section_title": true,
      "zh-CHS": "2. 提议的解决办法"
    },
    {
      "indent": 3,
      "text": "The solution described in this document solves two challenges associated with the outlined problem. In the description below, router X is the router announcing itself as a stub.",
      "zh-CHS": "本文档中描述的解决方案解决了与概述的问题相关的两个难题。在下面的描述中，路由器X是宣布自己为存根的路由器。"
    },
    {
      "indent": 6,
      "text": "1) Making other routers prefer routes around router X while performing the Dijkstra calculation.",
      "zh-CHS": "1) 在执行Dijkstra计算时，使其他路由器优先选择路由器X周围的路由。"
    },
    {
      "indent": 6,
      "text": "2) Allowing other routers to reach IP prefixes directly connected to router X.",
      "zh-CHS": "2) 允许其他路由器访问直接连接到路由器X的IP前缀。"
    },
    {
      "indent": 3,
      "text": "Note that it would be easy to address issue 1) alone by just flushing router X's router-LSA from the domain. However, it does not solve problem 2), since other routers will not be able to use links to router X in Dijkstra (no back link), and because router X will not have links to its neighbors.",
      "zh-CHS": "请注意，只需从域中刷新路由器X的路由器LSA，就可以轻松解决问题1）。然而，这并不能解决问题2），因为其他路由器将无法使用到Dijkstra中路由器X的链路（无反向链路），并且因为路由器X将没有到其邻居的链路。"
    },
    {
      "indent": 3,
      "text": "To address both problems, router X announces its router-LSA to the neighbors as follows.",
      "zh-CHS": "为了解决这两个问题，路由器X向邻居宣布其路由器LSA，如下所示。"
    },
    {
      "indent": 6,
      "text": "o costs of all non-stub links (links of the types other than 3) are set to LSInfinity (16-bit value 0xFFFF, rather than 24-bit value 0xFFFFFF used in summary and AS-external LSAs).",
      "zh-CHS": "o 所有非存根链路（3以外类型的链路）的成本都设置为LSInfinity（16位值0xFFFF，而不是汇总中使用的24位值0xFFFF和作为外部LSA）。"
    },
    {
      "indent": 6,
      "text": "o costs of stub links (type 3) are set to the interface output cost.",
      "zh-CHS": "o 存根链接（类型3）的成本设置为接口输出成本。"
    },
    {
      "indent": 3,
      "text": "This addresses issues 1) and 2).",
      "zh-CHS": "这解决了问题1）和2）。"
    },
    {
      "indent": 0,
      "text": "3. Compatibility issues",
      "section_title": true,
      "zh-CHS": "3. 兼容性问题"
    },
    {
      "indent": 3,
      "text": "Some inconsistency may be seen when the network is constructed of the routers that perform intra-area Dijkstra calculation as specified in [RFC1247] (discarding link records in router-LSAs that have LSInfinity cost value) and routers that perform it as specified in [RFC1583] and higher (do not treat links with LSInfinity cost as unreachable). Note that this inconsistency will not lead to routing loops, because if there are some alternate paths in the network, both types of routers will agree on using them rather than the path through the stub router. If the path through the stub router is the only one, the routers of the first type will not use the stub router for transit (which is the desired behavior), while the routers of the second type will still use this path.",
      "zh-CHS": "当网络由执行[RFC1247]中规定的区域内Dijkstra计算的路由器（丢弃路由器LSA中具有LSInfinity成本值的链路记录）和执行[RFC1583]中规定的以及更高的路由器（不将具有LSInfinity成本的链路视为不可访问）构成时，可能会看到一些不一致性。请注意，这种不一致性不会导致路由循环，因为如果网络中存在一些备用路径，则两种类型的路由器将同意使用它们，而不是通过存根路由器的路径。如果通过存根路由器的路径是唯一的路径，则第一种类型的路由器将不使用存根路由器进行传输（这是所需的行为），而第二种类型的路由器仍将使用此路径。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "zh-CHS": "4. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors of this document do not make any claims on the originality of the ideas described. Among other people, we would like to acknowledge Henk Smit for being part of one of the initial discussions around this topic.",
      "zh-CHS": "本文件的作者不对所述想法的独创性提出任何主张。在其他人中，我们要感谢Henk Smit参与了围绕这一主题的初步讨论。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The technique described in this document does not introduce any new security issues into OSPF protocol.",
      "zh-CHS": "本文档中描述的技术不会在OSPF协议中引入任何新的安全问题。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 3,
      "text": "[RFC2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "zh-CHS": "[RFC2328]Moy，J.，“OSPF版本2”，STD 54，RFC 2328，1998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1247] Moy, J., \"OSPF Version 2\", RFC 1247, July 1991.",
      "zh-CHS": "[RFC1247]莫伊，J.，“OSPF版本2”，RFC1247，1991年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1583] Moy, J., \"OSPF Version 2\", RFC 1583, March 1994.",
      "zh-CHS": "[RFC1583]莫伊，J.，“OSPF版本2”，RFC1583，1994年3月。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "7. 作者地址"
    },
    {
      "indent": 3,
      "text": "Alvaro Retana 7025 Kit Creek Rd. Research Triangle Park, NC 27709 USA",
      "zh-CHS": "美国北卡罗来纳州三角研究公园基特克里克路7025号阿尔瓦罗·雷塔纳27709"
    },
    {
      "indent": 3,
      "text": "EMail: aretana@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Liem Nguyen 7025 Kit Creek Rd. Research Triangle Park, NC 27709 USA",
      "zh-CHS": "Liem Nguyen美国北卡罗来纳州三角研究公园Kit Creek路7025号，邮编27709"
    },
    {
      "indent": 3,
      "text": "EMail: lhnguyen@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Russ White Cisco Systems, Inc. 7025 Kit Creek Rd. Research Triangle Park, NC 27709",
      "zh-CHS": "Russ White Cisco Systems，Inc.地址：北卡罗来纳州三角研究公园Kit Creek路7025号，邮编：27709"
    },
    {
      "indent": 3,
      "text": "EMail: riw@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Alex Zinin Nexsi Systems 1959 Concourse Drive San Jose,CA 95131",
      "zh-CHS": "Alex Zinin Nexsi Systems 1959加利福尼亚州圣何塞市广场大道95131"
    },
    {
      "indent": 3,
      "text": "EMail: azinin@nexsi.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Danny McPherson Amber Networks 48664 Milmont Drive Fremont, CA 94538",
      "zh-CHS": "Danny McPherson Amber Networks 48664加利福尼亚州弗里蒙特米尔蒙特大道94538号"
    },
    {
      "indent": 3,
      "text": "EMail: danny@ambernetworks.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "8. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "zh-CHS": "版权所有（C）互联网协会（2001年）。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "zh-CHS": "本文件及其译本可复制并提供给他人，对其进行评论或解释或协助其实施的衍生作品可全部或部分编制、复制、出版和分发，不受任何限制，前提是上述版权声明和本段包含在所有此类副本和衍生作品中。但是，不得以任何方式修改本文件本身，例如删除版权通知或对互联网协会或其他互联网组织的引用，除非出于制定互联网标准的需要，在这种情况下，必须遵循互联网标准过程中定义的版权程序，或根据需要将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "zh-CHS": "上述授予的有限许可是永久性的，互联网协会或其继承人或受让人不会撤销。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件和其中包含的信息是按“原样”提供的，互联网协会和互联网工程任务组否认所有明示或暗示的保证，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}