{
  "title": {
    "text": "RFC 3905:  A Template for IETF Patent Disclosures and Licensing Declarations ",
    "zh-CHS": "RFC 3905"
  },
  "number": 3905,
  "created_at": "2021-11-18 11:13:36.935497+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        V. See, Ed.\nRequest for Comments: 3905                                     Microsoft\nCategory: Informational                                   September 2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A Template for IETF Patent Disclosures and Licensing Declarations",
      "zh-CHS": "IETF专利披露和许可声明模板"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "zh-CHS": "本备忘录的状况"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a proposal for one form of a template for IETF patent disclosures and licensing declarations. The optional use of this template is meant to simplify the process of such disclosures and licensing declarations and to assist disclosers in providing the necessary information to meet the obligations documented in RFC 3668.",
      "zh-CHS": "本文件描述了IETF专利披露和许可声明模板的一种形式。本模板的可选使用旨在简化此类披露和许可声明的流程，并协助披露方提供必要的信息，以履行RFC 3668中记录的义务。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction...................................................  1\n2. The Patent Disclosure and Licensing Declaration Template.......  2\n3. Commentary on Terms Used in the Template.......................  5\n4. Security Considerations........................................  7\n5. Normative References...........................................  7\n6. Acknowledgments................................................  7\n7  Editor's Address...............................................  8\n8. Authors' Addresses.............................................  8\n9. Full Copyright Statement.......................................  9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "RFC 3668 [RFC3668] documents the current IETF policies and obligations with respect to disclosure of patents and patent applications. It also documents the information requested in licensing declarations for IETF specifications. In the interest of making these patent disclosure and licensing declaration processes simpler, this document proposes a patent disclosure and licensing declaration template that may be optionally used as one method for IETF participants and patent holders to comply with patent disclosure requirements and licensing declaration provisions under RFC 3668.",
      "zh-CHS": "RFC 3668[RFC3668]记录了当前IETF关于专利和专利申请披露的政策和义务。它还记录了IETF规范许可声明中要求的信息。为了简化这些专利披露和许可声明过程，本文件提出了一种专利披露和许可声明模板，可作为IETF参与者和专利持有人遵守RFC 3668下专利披露要求和许可声明规定的一种方法。"
    },
    {
      "indent": 3,
      "text": "This proposal also may be optionally used as a model by the IETF Secretariat for Web-based disclosure and licensing declaration tools; however, the intent of this document is informational and is not meant to suggest that this is the only method that could be used by IETF participants for disclosure of patents or for licensing declarations. For the latest information on how to submit a patent disclosure or licensing declaration, please see http://www.ietf.org/ipr-instructions.",
      "zh-CHS": "IETF秘书处也可以选择将本提案用作基于Web的披露和许可声明工具的模型；然而，本文件的目的是提供信息，并不意味着这是IETF参与者可用于专利披露或许可声明的唯一方法。有关如何提交专利披露或许可声明的最新信息，请参见http://www.ietf.org/ipr-instructions."
    },
    {
      "indent": 3,
      "text": "IPR disclosures should be submitted in English, since this is the working language of the IETF. Names of persons and companies should be presented in the way they are usually presented in an English-speaking context.",
      "zh-CHS": "知识产权披露应以英语提交，因为英语是IETF的工作语言。个人和公司的名称应以通常在英语环境中呈现的方式呈现。"
    },
    {
      "indent": 0,
      "text": "2. The Patent Disclosure and Licensing Declaration Template",
      "section_title": true,
      "zh-CHS": "2. 专利披露和许可声明模板"
    },
    {
      "indent": 3,
      "text": "START OF TEMPLATE",
      "zh-CHS": "模板的开始"
    },
    {
      "indent": 3,
      "text": "This document is an IETF Patent Disclosure and Licensing Declaration Template and is submitted to inform the IETF of a) patent information regarding the IETF document or contribution listed in Section IV, and b) a Patent Holder's intention with respect to the licensing of its necessary patent claims. No actual license is implied by submission of this template. Please complete and submit a separate template for each IETF document or contribution to which the disclosed patent information relates.",
      "zh-CHS": "本文件是IETF专利披露和许可声明模板，提交本文件是为了通知IETF a）关于第四节所列IETF文件或贡献的专利信息，以及b）专利持有人关于其必要专利权利要求的许可的意图。提交此模板并不意味着实际许可证。请为披露的专利信息相关的每个IETF文件或贡献填写并提交单独的模板。"
    },
    {
      "indent": 3,
      "text": "I. Patent Holder/Applicant (\"Patent Holder\")",
      "zh-CHS": "一、专利权人/申请人（“专利权人”）"
    },
    {
      "indent": 3,
      "text": "Legal Name:",
      "zh-CHS": "法定名称："
    },
    {
      "indent": 3,
      "text": "II. Patent Holder's Contact for License Application",
      "zh-CHS": "二、专利持有人申请许可证的联系人"
    },
    {
      "indent": 3,
      "text": "Name:",
      "zh-CHS": "姓名："
    },
    {
      "indent": 3,
      "text": "Title:",
      "zh-CHS": "标题："
    },
    {
      "indent": 3,
      "text": "Department:",
      "zh-CHS": "部门："
    },
    {
      "indent": 3,
      "text": "Address:",
      "zh-CHS": "地址:"
    },
    {
      "indent": 3,
      "text": "Telephone:",
      "zh-CHS": "电话："
    },
    {
      "indent": 3,
      "text": "Fax:",
      "zh-CHS": "传真："
    },
    {
      "indent": 3,
      "text": "Email:",
      "zh-CHS": "电邮："
    },
    {
      "indent": 3,
      "text": "III. Contact Information for the IETF Participant Whose Personal Belief Triggered the Disclosure in this Template (Optional)",
      "zh-CHS": "三、 IETF参与者的联系信息，其个人信仰触发了本模板中的披露（可选）"
    },
    {
      "indent": 3,
      "text": "Name:",
      "zh-CHS": "姓名："
    },
    {
      "indent": 3,
      "text": "Title:",
      "zh-CHS": "标题："
    },
    {
      "indent": 3,
      "text": "Department:",
      "zh-CHS": "部门："
    },
    {
      "indent": 3,
      "text": "Address:",
      "zh-CHS": "地址:"
    },
    {
      "indent": 3,
      "text": "Telephone:",
      "zh-CHS": "电话："
    },
    {
      "indent": 3,
      "text": "Fax:",
      "zh-CHS": "传真："
    },
    {
      "indent": 3,
      "text": "Email:",
      "zh-CHS": "电邮："
    },
    {
      "indent": 3,
      "text": "IV. IETF Document or Contribution to Which Patent Disclosure Relates",
      "zh-CHS": "四、 与专利披露相关的IETF文件或贡献"
    },
    {
      "indent": 3,
      "text": "Title:",
      "zh-CHS": "标题："
    },
    {
      "indent": 3,
      "text": "RFC Number or I-D Tag:",
      "zh-CHS": "RFC编号或I-D标签："
    },
    {
      "indent": 3,
      "text": "Other Designations:",
      "zh-CHS": "其他名称："
    },
    {
      "indent": 3,
      "text": "V. Disclosure of Patent Information (i.e., patents or patent applications required to be disclosed by Section 6 of RFC 3668)",
      "zh-CHS": "V.专利信息的披露（即RFC 3668第6节要求披露的专利或专利申请）"
    },
    {
      "indent": 3,
      "text": "A. For granted patents or published pending patent applications, please provide the following information:",
      "zh-CHS": "A.对于授予的专利或已发布的未决专利申请，请提供以下信息："
    },
    {
      "indent": 3,
      "text": "Patent, Serial, Publication, Registration, or Application/File number(s):",
      "zh-CHS": "专利、序列号、出版物、注册号或申请/文件号："
    },
    {
      "indent": 3,
      "text": "Date(s) granted or applied for (YYYY-MM-DD):",
      "zh-CHS": "批准或申请日期（YYYY-MM-DD）："
    },
    {
      "indent": 3,
      "text": "Country(ies):",
      "zh-CHS": "国家："
    },
    {
      "indent": 3,
      "text": "B. Does your disclosure relate to an unpublished pending patent application?",
      "zh-CHS": "B.您的披露是否与未公开的未决专利申请有关？"
    },
    {
      "indent": 3,
      "text": "Select one:  Yes  ______  No ______",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "C. If an Internet-Draft or RFC includes multiple parts and it is not reasonably apparent which part of such an Internet-Draft or RFC is alleged to be covered by the patent information disclosed in Section V(A) or V(B), it is helpful if the discloser identifies here the sections of the Internet-Draft or RFC that are alleged to be so covered.",
      "zh-CHS": "C.如果互联网草案或RFC包含多个部分，并且无法合理地确定第五节（A）或第五节（B）中披露的专利信息涵盖了互联网草案或RFC的哪一部分，那么披露方在此处确定据称涵盖的互联网草案或RFC部分是有帮助的。"
    },
    {
      "indent": 3,
      "text": "VI. Licensing Declaration",
      "zh-CHS": "六、 许可证声明"
    },
    {
      "indent": 3,
      "text": "The Patent Holder states that its position with respect to licensing any patent claims contained in the patent(s) or patent application(s) disclosed above that would necessarily be infringed by implementation of the technology required by the relevant IETF specification (\"Necessary Patent Claims\"), for the purpose of implementing such a specification, is as follows (select one licensing declaration option only):",
      "zh-CHS": "专利持有人声明，其关于许可上述专利或专利申请中包含的任何专利权利要求的立场，这些专利权利要求可能因实施相关IETF规范所要求的技术而受到侵犯（“必要的专利权利要求”），为了实施此类规范，如下所示（仅选择一个许可声明选项）："
    },
    {
      "indent": 3,
      "text": "a) ___   No License Required for Implementers\n           Check here if commitment to forgo a license is limited\n           solely to standards-track RFCs ___",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "b) ___   Royalty-Free, Reasonable, and Non-Discriminatory License to\n         All Implementers\n           Check here if this commitment to license is limited solely\n           to standards-track RFCs ___",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "c) ___   Reasonable and Non-Discriminatory License to All\n         Implementers with Possible Royalty/Fee\n           Check here if this commitment to license is limited solely\n           to standards-track RFCs ___",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "d) ___   Licensing Declaration to be Provided Later (implies a\n         willingness to commit to the provisions of a), b), or c)\n         above; otherwise, the next option - \"Unwilling to Commit to\n         the Provisions of a), b), or c) Above\" - must be selected)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "e) ___   Unwilling to Commit to the Provisions of a), b), or c)\n         Above",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "NOTE: The individual submitting this template represents and warrants that he or she is authorized by the Patent Holder to agree to the above-selected licensing declaration.",
      "zh-CHS": "注：提交此模板的个人表示并保证其已获得专利持有人的授权，同意上述选定的许可声明。"
    },
    {
      "indent": 3,
      "text": "VII. Contact Information of Submitter of this Form (if different from IETF Participant in Section III above)",
      "zh-CHS": "七、本表格提交人的联系信息（如果与上述第三节中的IETF参与者不同）"
    },
    {
      "indent": 3,
      "text": "Name:",
      "zh-CHS": "姓名："
    },
    {
      "indent": 3,
      "text": "Title:",
      "zh-CHS": "标题："
    },
    {
      "indent": 3,
      "text": "Department:",
      "zh-CHS": "部门："
    },
    {
      "indent": 3,
      "text": "Address:",
      "zh-CHS": "地址:"
    },
    {
      "indent": 3,
      "text": "Telephone:",
      "zh-CHS": "电话："
    },
    {
      "indent": 3,
      "text": "Fax:",
      "zh-CHS": "传真："
    },
    {
      "indent": 3,
      "text": "Email:",
      "zh-CHS": "电邮："
    },
    {
      "indent": 3,
      "text": "VIII. Other Notes:",
      "zh-CHS": "八、其他说明："
    },
    {
      "indent": 3,
      "text": "END OF TEMPLATE",
      "zh-CHS": "模板末尾"
    },
    {
      "indent": 0,
      "text": "3. Commentary on Terms Used in the Template",
      "section_title": true,
      "zh-CHS": "3. 模板中所用术语的评注"
    },
    {
      "indent": 3,
      "text": "Section III requests contact information for the Patent Holder's IETF participant whose personal belief that necessary patent claims are implicated by an IETF document or contribution caused this template to be filed. This is an optional section. However, if Section III is not completed, then Section VII must be completed. Even if Section III is completed, Section VII must still be completed if the submitter of this template is different from the IETF participant identified in Section III.",
      "zh-CHS": "第三节要求提供专利持有人的IETF参与者的联系信息，其个人认为IETF文件或贡献涉及必要的专利权利要求，因此提交了该模板。这是一个可选部分。但是，如果第三节未完成，则必须完成第七节。即使第三节已完成，但如果本模板的提交人与第三节中确定的IETF参与者不同，则第七节仍必须完成。"
    },
    {
      "indent": 3,
      "text": "The \"Other Designations\" field in Section IV may be used to identify an IETF contribution (oral or written) other than an Internet-Draft or RFC to which a disclosure is related.",
      "zh-CHS": "第四节中的“其他名称”字段可用于识别IETF贡献（口头或书面），而非与披露相关的互联网草案或RFC。"
    },
    {
      "indent": 3,
      "text": "Here is an explanation of the licensing declaration options in Section VI of the template:",
      "zh-CHS": "以下是模板第六节中许可声明选项的说明："
    },
    {
      "indent": 3,
      "text": "a) No License Required for Implementers: The Patent Holder does not require parties to acquire any license to its Necessary Patent Claims in order to make, have made, use, import, offer to sell, sell, or distribute technology that implements such an IETF specification.",
      "zh-CHS": "a) 实施者无需许可：专利持有人不要求各方获得其必要专利权利要求的任何许可，以便制造、已经制造、使用、进口、提议出售、出售或分发实施该IETF规范的技术。"
    },
    {
      "indent": 3,
      "text": "b) Royalty-Free, Reasonable, and Non-Discriminatory License to All Implementers: The Patent Holder is willing, upon request, to grant a license to its Necessary Patent Claims to all persons on a royalty-free basis (i.e., no royalty or other fee) and under other reasonable and non-discriminatory terms and conditions, to make,",
      "zh-CHS": "b) 向所有实施者提供免版税、合理和非歧视性许可：根据要求，专利持有人愿意在免版税（即无版税或其他费用）的基础上，根据其他合理和非歧视性条款和条件，向所有人授予其必要的专利权利要求的许可，"
    },
    {
      "indent": 6,
      "text": "have made, use, import, offer to sell, sell, and distribute technology that implements such an IETF specification.",
      "zh-CHS": "制造、使用、导入、提供、销售和分发实现此类IETF规范的技术。"
    },
    {
      "indent": 3,
      "text": "c) Reasonable and Non-Discriminatory License to All Implementers with Possible Royalty/Fee: The Patent Holder is willing, upon request, to grant a license to its Necessary Patent Claims to all persons under reasonable and non-discriminatory terms and conditions (which may include a royalty/fee), to make, have made, use, import, offer to sell, sell, and distribute technology that implements such an IETF specification.",
      "zh-CHS": "c) 向所有实施者提供合理且非歧视性的许可，并收取可能的特许权使用费/费用：根据要求，专利持有人愿意根据合理且非歧视性的条款和条件（可能包括特许权使用费/费用）向所有人授予其必要的专利权利要求的许可，以制造、已经制造、使用、进口、提议出售、出售，并分发实现这种IETF规范的技术。"
    },
    {
      "indent": 3,
      "text": "d) Licensing Declaration to be Provided Later: The Patent Holder is willing to commit to the provisions of a), b), or c) above, but wants to defer its specific selection of one of these licensing declaration options until a later point in time (or when asked for this information by the IESG). This option may not be selected if the Patent Holder is unwilling to commit to the provisions of a), b), or c) above. In that case, the Patent Holder must select licensing declaration option e) - \"Unwilling to Commit to the Provisions of a), b), or c) Above.\"",
      "zh-CHS": "d) 稍后提供的许可声明：专利持有人愿意遵守上述a）、b）或c）的规定，但希望将其对这些许可声明选项之一的具体选择推迟到稍后的时间点（或当IESG要求提供此信息时）。如果专利持有人不愿意遵守上述a）、b）或c）的规定，则不得选择此选项。在这种情况下，专利持有人必须选择许可声明选项e）-“不愿意遵守上述a）、b）或c）的规定。”"
    },
    {
      "indent": 3,
      "text": "e) Unwilling to Commit to the Provisions of a), b), or c) Above: The Patent Holder indicates an unwillingness to commit to the provisions of any of options a), b), or c) described above.",
      "zh-CHS": "e) 不愿意遵守上述a）、b）或c）的规定：专利持有人表示不愿意遵守上述任何选项a）、b）或c）的规定。"
    },
    {
      "indent": 3,
      "text": "Options a), b), and c) above also allow the Patent Holder to indicate (with a check) whether its licensing declaration is limited solely to standards-track RFCs. If left unchecked, the Patent Holder's licensing declaration will be deemed to apply to any implementation of the relevant IETF specification, including non-standards-track documents and Internet-Drafts. However, the Patent Holder may list other conditions or restrictions on its commitment to forego a license (option a)) or on its commitment to license (options b) and c)) in Section VIII - \"Other Notes.\" This standards-track qualifier is not relevant to licensing declaration options d) and e), because under d) the Patent Holder has not yet indicated its specific licensing intention and under e) the Patent Holder has indicated a general refusal to commit to the provisions of any of options a), b), or c) above.",
      "zh-CHS": "上述选项a）、b）和c）也允许专利持有人（通过检查）表明其许可声明是否仅限于标准跟踪RFC。如果不检查，专利持有人的许可声明将被视为适用于相关IETF规范的任何实施，包括非标准跟踪文件和互联网草案。但是，专利持有人可在第八节“其他注释”中列出其放弃许可承诺（选项a）或许可承诺（选项b和c）的其他条件或限制。本标准跟踪限定词与许可声明选项d）和e）无关，因为在d）项下，专利权人尚未表明其具体的许可意图，在e）项下，专利权人已表示普遍拒绝遵守上述任何选项a）、b）或c）的规定。"
    },
    {
      "indent": 3,
      "text": "Section VIII in the template, \"Other Notes,\" may be used for any additional information a discloser or Patent Holder wishes to provide. For example, a Patent Holder may use the \"Other Notes\" Section to indicate any other conditions or restrictions on the licensing declaration option selected in Section VI (e.g., 1) reciprocity, or 2) that a license will only be made available for implementations of any RFC (standards-track or non-standards-track), but not for implementations of Internet-Drafts or other documents).",
      "zh-CHS": "模板第八节“其他注释”可用于披露方或专利持有人希望提供的任何其他信息。例如，专利权人可以使用“其他注释”部分来说明第六节中选择的许可声明选项的任何其他条件或限制（例如，1）互惠，或2）许可仅可用于任何RFC（标准轨道或非标准轨道）的实施，但不适用于Internet草稿或其他文档的实现）。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document relates to the IETF process, not any particular technology. There are security considerations when adopting any particular technology, regardless of whether patent or patent application disclosures or licensing declarations are implicated by such technology. A working group should take those security considerations into account as one part of evaluating the technology, but there are no security considerations per se with these IETF processes.",
      "zh-CHS": "本文件涉及IETF过程，而非任何特定技术。在采用任何特定技术时，都要考虑安全性，无论该技术是否涉及专利或专利申请披露或许可声明。工作组应将这些安全考虑因素作为评估技术的一部分加以考虑，但这些IETF过程本身没有安全考虑因素。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "zh-CHS": "5. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3668] Bradner, S., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3668, February 2004.",
      "zh-CHS": "[RFC3668]Bradner，S.，“IETF技术中的知识产权”，BCP 79，RFC 3668，2004年2月。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors acknowledge the thoughtful contributions of Harald Alvestrand and Scott Bradner to this document.",
      "zh-CHS": "作者感谢Harald Alvestrand和Scott Bradner对本文件所作的深思熟虑的贡献。"
    },
    {
      "indent": 0,
      "text": "7. Editor's Address",
      "section_title": true,
      "zh-CHS": "7. 编辑地址"
    },
    {
      "indent": 3,
      "text": "Valerie See Microsoft Corporation One Microsoft Way Redmond, WA 98052 USA",
      "zh-CHS": "Valerie See Microsoft Corporation One Microsoft Way Redmond，WA 98052美国"
    },
    {
      "indent": 3,
      "text": "EMail: vsee@microsoft.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "zh-CHS": "8. 作者地址"
    },
    {
      "indent": 3,
      "text": "Robert Barr Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "zh-CHS": "罗伯特·巴尔·思科系统公司，美国加利福尼亚州圣何塞西塔斯曼大道170号，邮编95134"
    },
    {
      "indent": 3,
      "text": "EMail: rbarr@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Scott Brim Cisco Systems, Inc. 146 Honess Lane Ithaca, NY 14850 USA",
      "zh-CHS": "斯科特·布里姆思科系统公司，美国纽约州伊萨卡Honess Lane 146号，邮编14850"
    },
    {
      "indent": 3,
      "text": "EMail: sbrim@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Paul Gleichauf Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "zh-CHS": "Paul Gleichauf Cisco Systems，Inc.美国加利福尼亚州圣何塞西塔斯曼大道170号，邮编95134"
    },
    {
      "indent": 3,
      "text": "EMail: phg@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Allen Lo Juniper Networks 1194 North Mathilda Ave. Sunnyvale, CA 94089 USA",
      "zh-CHS": "Allen Lo Juniper Networks美国加利福尼亚州桑尼维尔北马蒂尔达大道1194号，邮编94089"
    },
    {
      "indent": 3,
      "text": "EMail: alo@juniper.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "zh-CHS": "9. 完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "zh-CHS": "版权所有（C）互联网协会（2004年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/S HE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、其代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the IETF's procedures with respect to rights in IETF Documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关IETF文件中权利的IETF程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}