{
  "title": {
    "text": "RFC 8150: MPLS Transport Profile Linear Protection MIB",
    "zh-CHS": "RFC 8150"
  },
  "number": 8150,
  "created_at": "2021-10-28 21:37:53.444132+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                S. Kingston Smiler\nRequest for Comments: 8150                                   IP Infusion\nCategory: Standards Track                                  M. Venkatesan\nISSN: 2070-1721                                        Dell Technologies\n                                                                 D. King\n                                                      Old Dog Consulting\n                                                               S. Aldrin\n                                                            Google, Inc.\n                                                                 J. Ryoo\n                                                                    ETRI\n                                                              April 2017",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "MPLS Transport Profile Linear Protection MIB",
      "zh-CHS": "MPLS传输配置文件线性保护MIB"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols. In particular, it defines objects for managing Multiprotocol Label Switching - Transport Profile (MPLS-TP) linear protection.",
      "zh-CHS": "此备忘录定义了用于网络管理协议的管理信息库（MIB）的一部分。特别是，它定义了用于管理多协议标签交换传输配置文件（MPLS-TP）线性保护的对象。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8150.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8150."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. The Internet-Standard Management Framework ......................3\n3. Conventions .....................................................3\n4. Overview ........................................................4\n5. Structure of the MIB Module .....................................4\n   5.1. Textual Conventions ........................................4\n   5.2. The MPLS-TP Linear Protection Switching Subtree ............4\n   5.3. The Notifications Subtree ..................................5\n   5.4. The Table Structures .......................................5\n6. Relationship to Other MIB Modules ...............................7\n   6.1. Relationship to the MPLS OAM Identifiers MIB Module ........7\n7. Example of Protection Switching Configuration ...................7\n8. Definitions .....................................................9\n9. Security Considerations ........................................43\n10. IANA Considerations ...........................................44\n11. References ....................................................45\n   11.1. Normative References .....................................45\n   11.2. Informative References ...................................47\nAcknowledgments ...................................................47\nContributors ......................................................47\nAuthors' Addresses ................................................48",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols. In particular, it defines objects for managing Multiprotocol Label Switching - Transport Profile (MPLS-TP) linear protection.",
      "zh-CHS": "此备忘录定义了用于网络管理协议的管理信息库（MIB）的一部分。特别是，它定义了用于管理多协议标签交换传输配置文件（MPLS-TP）线性保护的对象。"
    },
    {
      "indent": 3,
      "text": "This MIB module should be used for configuring and managing MPLS-TP linear protection for MPLS-TP Label Switched Paths (LSPs).",
      "zh-CHS": "此MIB模块应用于配置和管理MPLS-TP标签交换路径（LSP）的MPLS-TP线性保护。"
    },
    {
      "indent": 3,
      "text": "At the time of this writing, Simple Network Management Protocol (SNMP) SET is no longer recommended as a way to configure MPLS networks as described in RFC 3812 [RFC3812]. However, since the MIB module specified in this document is intended to work in parallel with the MIB module for MPLS specified in [RFC3812] and the MIB module for MPLS-TP Operations, Administration, and Maintenance (OAM) identifiers in RFC 7697 [RFC7697], certain objects defined here are specified with a MAX-ACCESS clause of read-write or read-create so that specifications of the base tables in [RFC3812] and [RFC7697] and the new MIB module in this document are consistent.",
      "zh-CHS": "在撰写本文时，不再建议将简单网络管理协议（SNMP）集作为RFC 3812[RFC3812]中所述的配置MPLS网络的方法。然而，由于本文件中规定的MIB模块旨在与[RFC3812]中规定的MPLS MIB模块和RFC 7697[RFC7697]中规定的MPLS-TP操作、管理和维护（OAM）标识符MIB模块并行工作，此处定义的某些对象使用读写或读创建的MAX-ACCESS子句指定，以便[RFC3812]和[RFC7697]中的基表规范与本文档中的新MIB模块一致。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "2. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了符合SMIv2的MIB模块，如STD 58、RFC 2578[RFC2578]、STD 58、RFC 2579[RFC2579]和STD 58、RFC 2580[RFC2580]所述。"
    },
    {
      "indent": 0,
      "text": "3. Conventions",
      "section_title": true,
      "zh-CHS": "3. 习俗"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”应按照BCP 14、RFC 2119[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "zh-CHS": "4. 概述"
    },
    {
      "indent": 3,
      "text": "RFC 6378 [RFC6378] defines the protocol to provide a linear protection switching mechanism for MPLS-TP for a point-to-point LSP within the protection domain bounded by the endpoints of the LSP. RFC 7271 [RFC7271] describes alternative mechanisms to perform some of the functions defined in [RFC6378] and also defines additional mechanisms to provide operator control and experience that more closely model the behavior of linear protection seen in other transport networks. Two modes are defined for MPLS-TP linear protection switching: the Protection State Coordination (PSC) mode and the Automatic Protection Switching (APS) mode, as specified in [RFC6378] and [RFC7271], respectively. The detailed protocol specification of MPLS-TP linear protection is described in [RFC6378] and [RFC7271].",
      "zh-CHS": "RFC 6378[RFC6378]定义了一种协议，该协议为由LSP端点限定的保护域内的点到点LSP的MPLS-TP提供线性保护切换机制。RFC 7271[RFC7271]描述了执行[RFC6378]中定义的某些功能的替代机制，还定义了其他机制，以提供操作员控制和经验，更紧密地模拟其他运输网络中的线性保护行为。MPLS-TP线性保护切换定义了两种模式：保护状态协调（PSC）模式和自动保护切换（APS）模式，分别如[RFC6378]和[RFC7271]所述。[RFC6378]和[RFC7271]中描述了MPLS-TP线性保护的详细协议规范。"
    },
    {
      "indent": 3,
      "text": "This document specifies a MIB module for Label Edge Routers (LERs) that support MPLS-TP linear protection as described in [RFC6378] and [RFC7271]. Objects defined in this document are generally applied to both the PSC mode and the APS mode. If an object is valid for a particular mode only, it is noted in the description for the object.",
      "zh-CHS": "本文件规定了用于支持MPLS-TP线性保护的标签边缘路由器（LER）的MIB模块，如[RFC6378]和[RFC7271]所述。本文档中定义的对象通常适用于PSC模式和APS模式。如果对象仅对特定模式有效，则会在对象的说明中注明。"
    },
    {
      "indent": 0,
      "text": "5. Structure of the MIB Module",
      "section_title": true,
      "zh-CHS": "5. MIB模块的结构"
    },
    {
      "indent": 0,
      "text": "5.1. Textual Conventions",
      "section_title": true,
      "zh-CHS": "5.1. 文字约定"
    },
    {
      "indent": 3,
      "text": "The following new textual conventions are defined in this document:",
      "zh-CHS": "本文件中定义了以下新的文本约定："
    },
    {
      "indent": 3,
      "text": "o MplsLpsReq: This textual convention describes an object that stores the PSC Request field of the PSC control packet.",
      "zh-CHS": "o MplsLpsReq：这个文本约定描述了一个存储PSC控制数据包的PSC请求字段的对象。"
    },
    {
      "indent": 3,
      "text": "o MplsLpsFpathPath: This textual convention describes an object that stores the Fault Path (FPath) field and Data Path (Path) field of the PSC control packet.",
      "zh-CHS": "o MplsLpsFpathPath：这个文本约定描述了一个存储PSC控制包的故障路径（FPath）字段和数据路径（Path）字段的对象。"
    },
    {
      "indent": 3,
      "text": "o MplsLpsCommand: This textual convention describes an object that allows a user to perform any action over a protection domain.",
      "zh-CHS": "o MplsLpsCommand：此文本约定描述了允许用户在保护域上执行任何操作的对象。"
    },
    {
      "indent": 3,
      "text": "o MplsLpsState: This textual convention describes an object that stores the current state of the PSC state machine.",
      "zh-CHS": "o MPLSLPSTATE：此文本约定描述存储PSC状态机当前状态的对象。"
    },
    {
      "indent": 0,
      "text": "5.2. The MPLS-TP Linear Protection Switching Subtree",
      "section_title": true,
      "zh-CHS": "5.2. MPLS-TP线性保护切换子树"
    },
    {
      "indent": 3,
      "text": "MPLS-LPS-MIB is the MIB module defined in this document. It is rooted under the mplsStdMIB subtree per [RFC3811]. \"LPS\" as used in this document means \"Linear Protection Switching\".",
      "zh-CHS": "MPLS-LPS-MIB是本文档中定义的MIB模块。根据[RFC3811]，它根在MPLSTDMIB子树下。本文件中使用的“LPS”是指“线性保护开关”。"
    },
    {
      "indent": 0,
      "text": "5.3. The Notifications Subtree",
      "section_title": true,
      "zh-CHS": "5.3. 通知子树"
    },
    {
      "indent": 3,
      "text": "Notifications are defined to inform the management station about switchovers, provisioning mismatches, and protocol failures of the linear protection domain. The following notifications are defined for this purpose:",
      "zh-CHS": "通知被定义为通知管理站线性保护域的切换、供应不匹配和协议故障。为此，定义了以下通知："
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventSwitchover informs the management station about the switchover of the active path.",
      "zh-CHS": "o 通知MPLSLPEventSwitchover通知管理站活动路径的切换。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventRevertiveMismatch informs the management station about a provisioning mismatch in the revertive mode across the endpoint of the protection domain.",
      "zh-CHS": "o 通知MPLSLPEventRevertiveMismatch将在保护域的端点之间以还原模式通知管理站配置不匹配。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventProtecTypeMismatch informs the management station about a provisioning mismatch in the protection type, representing both the bridge type and the switching type, across the endpoint of the protection domain.",
      "zh-CHS": "o 通知MPLSLPEventProtectTypeMismatch通知管理站跨保护域的端点的保护类型（表示网桥类型和交换类型）中的配置不匹配。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventCapabilitiesMismatch informs the management station about a provisioning mismatch in Capabilities TLVs across the endpoint of the protection domain.",
      "zh-CHS": "o 通知MPLSLPEventCapabilitiesMismatch通知管理站跨保护域端点的功能TLV的配置不匹配。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventPathConfigMismatch informs the management station about a provisioning mismatch in the protection path configuration for PSC communication.",
      "zh-CHS": "o 通知MPLSLPEventPathConfigMismatch将通知管理站PSC通信的保护路径配置中的配置不匹配。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventFopNoResponse informs the management station that protocol failure has occurred due to a lack of response to a traffic switchover request in 50 ms.",
      "zh-CHS": "o 通知mplsLpsEventFopNoResponse通知管理站由于在50毫秒内没有对流量切换请求做出响应而导致协议失败。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventFopTimeout informs the management station that protocol failure has occurred because no protocol message was received during at least 3.5 times the long PSC message interval [RFC7271].",
      "zh-CHS": "o 通知mplsLpsEventFopTimeout通知管理站发生协议故障，因为在长PSC消息间隔[RFC7271]的至少3.5倍期间未收到任何协议消息。"
    },
    {
      "indent": 0,
      "text": "5.4. The Table Structures",
      "section_title": true,
      "zh-CHS": "5.4. 表格结构"
    },
    {
      "indent": 3,
      "text": "The MPLS-TP linear protection MIB module has four tables. The tables are as follows:",
      "zh-CHS": "MPLS-TP线性保护MIB模块有四个表。各表如下："
    },
    {
      "indent": 3,
      "text": "o mplsLpsConfigTable",
      "zh-CHS": "o MPLSLPConfigTable"
    },
    {
      "indent": 6,
      "text": "This table is used to configure MPLS-TP linear protection domains. An MPLS-TP linear protection domain (or a protection domain) is identified by mplsLpsConfigDomainIndex. A protection domain consists of two LERs, as well as the working path and protection path that connect the two LERs. The objects in this table are",
      "zh-CHS": "此表用于配置MPLS-TP线性保护域。MPLS-TP线性保护域（或保护域）由MPLSLPConfigDomainIndex标识。保护域包括两个LER，以及连接两个LER的工作路径和保护路径。此表中的对象是"
    },
    {
      "indent": 6,
      "text": "used to configure properties that are specific to the protection domain. Two Maintenance Entities (MEs) MUST be defined for each protection domain: one for the working path and the other for the protection path. Therefore, two entries in the mplsLpsMeConfigTable, which is for configuring the MEs used in protection switching, are associated to one entry in this table.",
      "zh-CHS": "用于配置特定于保护域的属性。必须为每个保护域定义两个维护实体（MEs）：一个用于工作路径，另一个用于保护路径。因此，用于配置保护切换中使用的MEs的mplsLpsMeConfigTable中的两个条目与该表中的一个条目相关联。"
    },
    {
      "indent": 3,
      "text": "o mplsLpsStatusTable",
      "zh-CHS": "o MPLSLPSTATUSTABLE"
    },
    {
      "indent": 6,
      "text": "This table provides the current status information of MPLS-TP linear protection domains that have been configured on the system. The entries in the mplsLpsStatusTable have an AUGMENTS relationship with the entries in the mplsLpsConfigTable. When a protection domain is configured or deleted in the mplsLpsConfigTable, then the corresponding row of that session in the mplsLpsStatusTable is automatically created or deleted, respectively.",
      "zh-CHS": "此表提供了系统上已配置的MPLS-TP线性保护域的当前状态信息。MPLSLPStatustable中的条目与MPLSLPConfigTable中的条目具有增强关系。在MPLSPSConfigTable中配置或删除保护域时，将分别自动创建或删除MPLSPSStatutable中该会话的对应行。"
    },
    {
      "indent": 3,
      "text": "o mplsLpsMeConfigTable",
      "zh-CHS": "o MPLSLPMEConfigTable"
    },
    {
      "indent": 6,
      "text": "This table is used to associate MEs to the protection domain. Each protection domain requires two MEs. One entry in the mplsLpsConfigTable is associated with two entries in this table: one for the working path and the other for the protection path of the protection domain. The mplsLpsMeConfigPath object in this table indicates that the path is either the working path or the protection path. The ME is identified by mplsOamIdMegIndex, mplsOamIdMeIndex, and mplsOamIdMeMpIndex, which are the same index values as the entry in the mplsOamIdMeTable defined in [RFC7697]. The relationship to the mplsOamIdMeTable is described in Section 6.1.",
      "zh-CHS": "此表用于将MEs与保护域关联。每个保护域需要两个MEs。MPLSLPConfigTable中的一个条目与该表中的两个条目相关联：一个用于工作路径，另一个用于保护域的保护路径。此表中的MPLSLPMEConfigPath对象表示该路径为工作路径或保护路径。ME由mplsOamIdMegIndex、mplsOamIdMeIndex和MPLSOAMIDEMPINDEX标识，它们的索引值与[RFC7697]中定义的mplsOamIdMeTable中的条目相同。第6.1节描述了与MPLSOAMIDETABLE的关系。"
    },
    {
      "indent": 3,
      "text": "o mplsLpsMeStatusTable",
      "zh-CHS": "o MPLSLPMESTATUSTABLE"
    },
    {
      "indent": 6,
      "text": "This table provides current information about the protection status of MEs that have been configured on the system. When an ME is configured or deleted in the mplsLpsMeConfigTable, then the corresponding row of that session in the mplsLpsMeStatusTable is automatically created or deleted, respectively.",
      "zh-CHS": "此表提供了有关系统上已配置的MEs保护状态的当前信息。当在mplsLpsMeConfigTable中配置或删除ME时，将分别自动创建或删除mplsLpsMeStatusTable中该会话的对应行。"
    },
    {
      "indent": 0,
      "text": "6. Relationship to Other MIB Modules",
      "section_title": true,
      "zh-CHS": "6. 与其他MIB模块的关系"
    },
    {
      "indent": 0,
      "text": "6.1. Relationship to the MPLS OAM Identifiers MIB Module",
      "section_title": true,
      "zh-CHS": "6.1. 与MPLS OAM标识符MIB模块的关系"
    },
    {
      "indent": 3,
      "text": "Entries in the mplsOamIdMeTable [RFC7697] are extended by entries in the mplsLpsMeConfigTable. Note that the nature of the \"extends\" relationship is a sparse augmentation so that the entry in the mplsLpsMeConfigTable has the same index values as the entry in the mplsOamIdMeTable. Each time that an entry is created in the mplsOamIdMeTable for which the LER supports MPLS-TP linear protection, a row is created automatically in the mplsLpsMeConfigTable.",
      "zh-CHS": "mplsLpsMeConfigTable中的条目扩展了MPLSOMIDMetable[RFC7697]中的条目。请注意，“extends”关系的本质是稀疏扩充，因此MPLSLPMEConfigTable中的条目具有与MPLSOMIDMetable中的条目相同的索引值。每次在LER支持MPLS-TP线性保护的MPLSOIMIDETABLE中创建条目时，都会在MPLSLPMEConfigTable中自动创建一行。"
    },
    {
      "indent": 3,
      "text": "When a point-to-point transport path needs to be monitored, one ME is needed for the path and one entry in the mplsOamIdMeTable will be created. But the ME entry in the mplsOamIdMeTable may or may not participate in protection switching. If an ME participates in protection switching, an entry in the mplsLpsMeConfigTable MUST be created, and the objects in the entry indicate which protection domain this ME belongs to and whether this ME is for the working path or the protection path. If the ME does not participate in protection switching, an entry in the mplsLpsMeConfigTable does not need to be created.",
      "zh-CHS": "当需要监控点到点传输路径时，该路径需要一个ME，并且将在mplsOamIdMeTable中创建一个条目。但是MPLSOAMIDETABLE中的ME条目可能参与也可能不参与保护切换。如果ME参与保护切换，则必须在mplsLpsMeConfigTable中创建一个条目，该条目中的对象指示该ME属于哪个保护域，以及该ME是用于工作路径还是用于保护路径。如果ME不参与保护切换，则无需在MPLSLPMEConfigTable中创建条目。"
    },
    {
      "indent": 0,
      "text": "7. Example of Protection Switching Configuration",
      "section_title": true,
      "zh-CHS": "7. 保护切换配置示例"
    },
    {
      "indent": 3,
      "text": "This example considers the protection domain configuration on an LER to provide protection for a co-routed bidirectional MPLS tunnel. For the working path and protection path of the protection domain, two Maintenance Entity Groups (MEGs) need to be configured, and each MEG contains one ME for a point-to-point transport path. For more information on the mplsOamIdMegTable and the mplsOamIdMeTable, see [RFC7697].",
      "zh-CHS": "此示例考虑LER上的保护域配置，以为共路由双向MPLS隧道提供保护。对于保护域的工作路径和保护路径，需要配置两个维护实体组（MEG），每个MEG包含一个用于点到点传输路径的ME。有关mplsOamIdMeTable和mplsOamIdMeTable的更多信息，请参阅[RFC7697]。"
    },
    {
      "indent": 3,
      "text": "Although the example described in this section shows a way to configure linear protection for MPLS-TP tunnels, this also indicates how the MIB values would be returned if they had been configured by alternative means.",
      "zh-CHS": "尽管本节中描述的示例显示了为MPLS-TP隧道配置线性保护的方法，但这也表明了如果通过其他方式配置MIB值，将如何返回MIB值。"
    },
    {
      "indent": 3,
      "text": "The following table configures a protection domain.",
      "zh-CHS": "下表配置了保护域。"
    },
    {
      "indent": 3,
      "text": "In the mplsLpsConfigTable:\nmplsLpsConfigEntry ::= SEQUENCE\n{\n   -- Protection domain index (index to the table)\n   mplsLpsConfigDomainIndex  = 3,\n   -- Protection domain name\n   mplsLpsConfigDomainName   = \"LPDomain3\",\n   mplsLpsConfigMode         = psc(1),\n   mplsLpsConfigProtectionType = oneColonOneBidirectional(2),\n   -- Mandatory parameters needed to activate the row go here\n   mplsLpsConfigRowStatus    = createAndGo(4)\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The following table associates the MEs with the protection domain.",
      "zh-CHS": "下表将MEs与保护域关联。"
    },
    {
      "indent": 3,
      "text": "In the mplsLpsMeConfigTable:\nMplsLpsMeConfigEntry ::= SEQUENCE\n{\n   -- MEG index (index to the table)\n   mplsOamIdMegIndex                 = 1,\n   -- ME index (index to the table)\n   mplsOamIdMeIndex                  = 1,\n   -- Maintenance Point (MP) index (index to the table)\n   mplsOamIdMeMpIndex                = 1,\n   -- Protection domain this ME belongs to\n   mplsLpsMeConfigDomain             = 3,\n   -- Configuration state\n   mplsLpsMeConfigPath               = working(1)\n}\n{\n   -- MEG index (index to the table)\n   mplsOamIdMegIndex                 = 2,\n   -- ME index (index to the table)\n   mplsOamIdMeIndex                  = 2,\n   -- MP index (index to the table)\n   mplsOamIdMeMpIndex                = 2,\n   -- Protection domain this ME belongs to\n   mplsLpsMeConfigDomain             = 3,\n   -- Configuration state\n   mplsLpsMeConfigPath               = protection(2)\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. Definitions",
      "section_title": true,
      "zh-CHS": "8. 定义"
    },
    {
      "indent": 3,
      "text": "This MIB module makes reference to the following documents: [RFC2578], [RFC2579], [RFC2580], [RFC3289], [RFC3411], [RFC3811], [RFC6378], [RFC7271], [RFC7697], [G8121], and [G8151].",
      "zh-CHS": "此MIB模块参考以下文档：[RFC2578]、[RFC2579]、[RFC2580]、[RFC3289]、[RFC3411]、[RFC3811]、[RFC6378]、[RFC7271]、[RFC7697]、[G8121]和[G8151]。"
    },
    {
      "indent": 3,
      "text": "MPLS-LPS-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, NOTIFICATION-TYPE, OBJECT-TYPE, Counter32, Unsigned32 FROM SNMPv2-SMI -- RFC 2578",
      "zh-CHS": "从SNMPv2 SMI--RFC 2578导入模块标识、通知类型、对象类型、计数器32、未签名32"
    },
    {
      "indent": 6,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF -- RFC 2580",
      "zh-CHS": "来自SNMPv2 CONF的MODULE-COMPLIANCE、OBJECT-GROUP、NOTIFICATION-GROUP——RFC2580"
    },
    {
      "indent": 6,
      "text": "TEXTUAL-CONVENTION, RowStatus, TimeStamp, StorageType, TruthValue FROM SNMPv2-TC -- RFC 2579",
      "zh-CHS": "SNMPv2 TC中的文本约定、行状态、时间戳、存储类型、TruthValue——RFC2579"
    },
    {
      "indent": 6,
      "text": "SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC 3411",
      "zh-CHS": "SNMP-FRAMEWORK-MIB中的snmpadmin安装——RFC 3411"
    },
    {
      "indent": 6,
      "text": "IndexIntegerNextFree FROM DIFFSERV-MIB -- RFC 3289",
      "zh-CHS": "IndexIntegraterExtFree FROM DIFFSERV-MIB--RFC 3289"
    },
    {
      "indent": 6,
      "text": "mplsStdMIB FROM MPLS-TC-STD-MIB -- RFC 3811",
      "zh-CHS": "来自MPLS-TC-STD-MIB的mplsStdMIB——RFC 3811"
    },
    {
      "indent": 6,
      "text": "mplsOamIdMegIndex, mplsOamIdMeIndex, mplsOamIdMeMpIndex FROM MPLS-OAM-ID-STD-MIB; -- RFC 7697",
      "zh-CHS": "MPLS-OAM-ID-STD-MIB中的MPLSOAMIDEMEDIX、mplsOamIdMeIndex、MPLSOAMIDEMPINDEX和MPLSOAMIDEMPINDEX；——RFC 7697"
    },
    {
      "indent": 3,
      "text": "mplsLpsMIB MODULE-IDENTITY LAST-UPDATED \"201704040000Z\" -- April 4, 2017 ORGANIZATION \"Multiprotocol Label Switching (MPLS) Working Group\" CONTACT-INFO \" Kingston Smiler Selvaraj IP Infusion RMZ Centennial Mahadevapura Post Bangalore 560048 India Email: kingstonsmiler@gmail.com",
      "zh-CHS": "mplsLpsMIB MODULE-IDENTITY最后更新的“201704040000Z”-2017年4月4日组织“多协议标签交换（MPLS）工作组”联系方式“Kingston Smiler Selvaraj IP输液RMZ Mahadevapura Post Bangalore 560048 India电子邮件：kingstonsmiler@gmail.com"
    },
    {
      "indent": 9,
      "text": "Venkatesan Mahalingam Dell Technologies 5450 Great America Parkway Santa Clara, CA 95054 United States of America Email: venkat.mahalingams@gmail.com",
      "zh-CHS": "Venkatesan Mahalingam Dell Technologies 5450 Great America Parkway Santa Clara，CA 95054美利坚合众国电子邮件：venkat。mahalingams@gmail.com"
    },
    {
      "indent": 9,
      "text": "Daniel King Old Dog Consulting United Kingdom Email: daniel@olddog.co.uk",
      "zh-CHS": "Daniel King Old Dog Consulting英国电子邮件：daniel@olddog.co.uk"
    },
    {
      "indent": 9,
      "text": "Sam Aldrin Google, Inc. 1600 Amphitheatre Parkway Mountain View, CA 94043 United States of America Email: aldrin.ietf@gmail.com",
      "zh-CHS": "Sam Aldrin Google，Inc.美国加利福尼亚州山景公园大道1600圆形剧场94043电子邮件：Aldrin。ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": " Jeong-dong Ryoo ETRI 218 Gajeong-ro Yuseong-gu, Daejeon 34129 South Korea Email: ryoo@etri.re.kr \" DESCRIPTION \"This MIB module supports the configuration and management of MPLS-TP linear protection domains.",
      "zh-CHS": "Jeong dong Ryoo ETRI 218 Gajeong ro Yuseong gu，韩国大田34129电子邮件：ryoo@etri.re.kr“说明”此MIB模块支持MPLS-TP线性保护域的配置和管理。"
    },
    {
      "indent": 7,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as authors of the code. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和被确定为代码作者的人员。版权所有。"
    },
    {
      "indent": 7,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info).\"",
      "zh-CHS": "根据IETF信托有关IETF文件的法律规定第4.c节规定的简化BSD许可证中包含的许可条款，允许以源代码和二进制格式重新分发和使用，无论是否修改(http://trustee.ietf.org/license-info).\""
    },
    {
      "indent": 3,
      "text": "REVISION \"201704040000Z\" -- April 4, 2017 DESCRIPTION \"MPLS-TP protection domain objects for LSP MEG End Points (MEPs).\"",
      "zh-CHS": "修订版“201704040000Z”-2017年4月4日描述“LSP MEG端点（MEP）的MPLS-TP保护域对象”"
    },
    {
      "indent": 6,
      "text": "::= { mplsStdMIB 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "-- Top-level components of this MIB module.\n-- Notifications\nmplsLpsNotifications\n   OBJECT IDENTIFIER ::= { mplsLpsMIB 0 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "-- Tables, scalars\nmplsLpsObjects\n   OBJECT IDENTIFIER ::= { mplsLpsMIB 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "-- Conformance\nmplsLpsConformance\n   OBJECT IDENTIFIER ::= { mplsLpsMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MplsLpsReq ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"This textual convention describes an object that stores\n       the PSC Request field of the PSC control packet.  The values\n       are as follows:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "noRequest No Request",
      "zh-CHS": "不请自来"
    },
    {
      "indent": 10,
      "text": "doNotRevert Do-not-Revert",
      "zh-CHS": "doNotRevert不恢复"
    },
    {
      "indent": 10,
      "text": "reverseRequest Reverse Request",
      "zh-CHS": "反向请求反向请求"
    },
    {
      "indent": 10,
      "text": "exercise Exercise",
      "zh-CHS": "运动"
    },
    {
      "indent": 10,
      "text": "waitToRestore Wait-to-Restore",
      "zh-CHS": "等待存储等待恢复"
    },
    {
      "indent": 10,
      "text": "manualSwitch Manual Switch",
      "zh-CHS": "手动开关手动开关"
    },
    {
      "indent": 10,
      "text": "signalDegrade Signal Degrade (SD)",
      "zh-CHS": "信号降级信号降级（SD）"
    },
    {
      "indent": 10,
      "text": "signalFail Signal Fail (SF)",
      "zh-CHS": "信号失效信号失效（SF）"
    },
    {
      "indent": 10,
      "text": "forcedSwitch Forced Switch",
      "zh-CHS": "强制开关强制开关"
    },
    {
      "indent": 6,
      "text": "    lockoutOfProtection\n    Lockout of Protection.\"\nREFERENCE\n   \"Section 4.2.2 of RFC 6378 and Section 8 of RFC 7271\"\nSYNTAX  INTEGER {\n           noRequest(0),\n           doNotRevert(1),\n           reverseRequest(2),\n           exercise(3),\n           waitToRestore(4),\n           manualSwitch(5),\n           signalDegrade(7),\n           signalFail(10),\n           forcedSwitch(12),\n           lockoutOfProtection(14)\n           }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MplsLpsFpathPath ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"1x:\"\n   STATUS      current\n   DESCRIPTION\n      \"This textual convention describes an object that stores\n       the Fault Path (FPath) field and Data Path (Path) field of\n       the PSC control packet.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "FPath is located in the first octet, and Path is located in the second octet.",
      "zh-CHS": "FPath位于第一个八位组中，Path位于第二个八位组中。"
    },
    {
      "indent": 10,
      "text": "The value and the interpretation of the FPath field are as follows:",
      "zh-CHS": "FPath字段的值和解释如下："
    },
    {
      "indent": 10,
      "text": "2-255 for future extensions",
      "zh-CHS": "2-255用于将来的扩展"
    },
    {
      "indent": 10,
      "text": "1 the anomaly condition is on the working path",
      "zh-CHS": "1异常情况在工作路径上"
    },
    {
      "indent": 10,
      "text": "0 the anomaly condition is on the protection path",
      "zh-CHS": "0异常情况在保护路径上"
    },
    {
      "indent": 10,
      "text": "The value and the interpretation of the Path field are as follows:",
      "zh-CHS": "路径字段的值和解释如下所示："
    },
    {
      "indent": 10,
      "text": "2-255 for future extensions",
      "zh-CHS": "2-255用于将来的扩展"
    },
    {
      "indent": 10,
      "text": "1 protection path is transporting user data traffic",
      "zh-CHS": "1保护路径正在传输用户数据流量"
    },
    {
      "indent": 6,
      "text": " 0 protection path is not transporting user data traffic.\" REFERENCE \"Sections 4.2.5 and 4.2.6 of RFC 6378\" SYNTAX OCTET STRING (SIZE (2))",
      "zh-CHS": "0保护路径未传输用户数据通信。“参考”RFC 6378第4.2.5节和第4.2.6节“语法八位字节字符串（大小（2））"
    },
    {
      "indent": 3,
      "text": "MplsLpsCommand ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"This command allows a user to perform any action over a\n       protection domain.  If the protection command cannot be\n       executed because a request of equal or higher priority is\n       in effect, an inconsistentValue error is returned.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "The command values are as follows:",
      "zh-CHS": "命令值如下所示："
    },
    {
      "indent": 10,
      "text": "noCmd This value should be returned by a read request when no command has been written to the object in question since initialization. This value may not be used in a write operation. If noCmd is used in a write operation, a wrongValue error is returned.",
      "zh-CHS": "noCmd当自初始化以来未向相关对象写入任何命令时，读取请求应返回此值。此值不能用于写入操作。如果在写入操作中使用noCmd，则返回错误值错误。"
    },
    {
      "indent": 10,
      "text": "clear Clears all of the commands listed below for the protection domain.",
      "zh-CHS": "清除清除下面列出的保护域的所有命令。"
    },
    {
      "indent": 10,
      "text": "lockoutOfProtection Prevents switching traffic to the protection path.",
      "zh-CHS": "锁定保护可防止将通信量切换到保护路径。"
    },
    {
      "indent": 10,
      "text": "forcedSwitch Switches traffic from the working path to the protection path.",
      "zh-CHS": "forcedSwitch将流量从工作路径切换到保护路径。"
    },
    {
      "indent": 10,
      "text": "manualSwitchToWork Switches traffic from the protection path to the working path.",
      "zh-CHS": "手动切换工作将通信量从保护路径切换到工作路径。"
    },
    {
      "indent": 10,
      "text": "manualSwitchToProtect Switches traffic from the working path to the protection path.",
      "zh-CHS": "ManualSwitchTopProtect将流量从工作路径切换到保护路径。"
    },
    {
      "indent": 10,
      "text": "exercise Used to verify the correct operation of the PSC communication and the integrity of the protection path. This command is not applicable to the PSC mode.",
      "zh-CHS": "用于验证PSC通信正确运行和保护路径完整性的练习。此命令不适用于PSC模式。"
    },
    {
      "indent": 10,
      "text": "freeze This command freezes the protection state and is a local command that is not signaled to the remote node. This command is not applicable to the PSC mode.",
      "zh-CHS": "冻结此命令冻结保护状态，是一个本地命令，不向远程节点发送信号。此命令不适用于PSC模式。"
    },
    {
      "indent": 6,
      "text": "    clearfreeze\n    Clears the local freeze.  This command is not applicable to\n    the PSC mode.\"\nREFERENCE\n   \"Sections 3.1 and 3.2 of RFC 6378 and Sections 4.3 and 6 of\n    RFC 7271\"\nSYNTAX   INTEGER {\n            noCmd(1),\n            clear(2),\n            lockoutOfProtection(3),\n            forcedSwitch(4),\n            manualSwitchToWork(5),\n            manualSwitchToProtect(6),\n            exercise(7),\n            freeze(8),\n            clearfreeze(9)\n            }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MplsLpsState ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"This textual convention describes an object that stores\n       the current state of the PSC state machine.  The values\n       are as follows:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "normal Normal state.",
      "zh-CHS": "正常状态。"
    },
    {
      "indent": 10,
      "text": "unavLOlocal Unavailable state due to local LO command.",
      "zh-CHS": "由于本地LO命令，不可用本地不可用状态。"
    },
    {
      "indent": 10,
      "text": "unavSFPlocal Unavailable state due to local SF-P.",
      "zh-CHS": "由于本地SF-P而处于不可用状态。"
    },
    {
      "indent": 10,
      "text": "unavSDPlocal Unavailable state due to local SD-P.",
      "zh-CHS": "由于本地SD-P而处于不可用状态。"
    },
    {
      "indent": 10,
      "text": "unavLOremote Unavailable state due to remote LO message.",
      "zh-CHS": "由于远程LO消息，unavLOremote处于不可用状态。"
    },
    {
      "indent": 10,
      "text": "unavSFPremote Unavailable state due to remote SF-P message.",
      "zh-CHS": "由于远程SF-P消息，UNASSFPREMOTE处于不可用状态。"
    },
    {
      "indent": 10,
      "text": "unavSDPremote Unavailable state due to remote SD-P message.",
      "zh-CHS": "由于远程SD-P消息，UNVANSDPREMOTE不可用状态。"
    },
    {
      "indent": 10,
      "text": "protfailSFWlocal Protecting Failure state due to local SF-W.",
      "zh-CHS": "ProtFails本地SF-W导致的本地保护故障状态。"
    },
    {
      "indent": 10,
      "text": "protfailSDWlocal Protecting Failure state due to local SD-W.",
      "zh-CHS": "ProtFails由于本地SD-W导致的本地保护故障状态。"
    },
    {
      "indent": 10,
      "text": "protfailSFWremote Protecting Failure state due to remote SF-W message.",
      "zh-CHS": "ProtFailsFremote由于远程SF-W消息而保护故障状态。"
    },
    {
      "indent": 10,
      "text": "protfailSDWremote Protecting Failure state due to remote SD-W message.",
      "zh-CHS": "ProtFailsDremote由于远程SD-W消息而保护故障状态。"
    },
    {
      "indent": 10,
      "text": "switadmFSlocal Switching Administrative state due to local FS command. Same as Protecting Administrative state due to local FS command in the PSC mode.",
      "zh-CHS": "由于本地FS命令，switadmFSlocal正在切换管理状态。与在PSC模式下由于本地FS命令而保护管理状态相同。"
    },
    {
      "indent": 10,
      "text": "switadmMSWlocal Switching Administrative state due to local MS-W command.",
      "zh-CHS": "由于本地MS-W命令，SwitAdminsmsWLOCAL正在切换管理状态。"
    },
    {
      "indent": 10,
      "text": "switadmMSPlocal Switching Administrative state due to local MS-P command. Same as Protecting Administrative state due to local MS command in the PSC mode.",
      "zh-CHS": "由于本地MS-P命令，SwitAdminspLocal正在切换管理状态。与在PSC模式下由于本地MS命令而保护管理状态相同。"
    },
    {
      "indent": 10,
      "text": "switadmFSremote Switching Administrative state due to remote FS message. Same as Protecting Administrative state due to remote FS message in the PSC mode.",
      "zh-CHS": "由于远程FS消息，switadmFSremote正在切换管理状态。与在PSC模式下由于远程FS消息而保护管理状态相同。"
    },
    {
      "indent": 10,
      "text": "switadmMSWremote Switching Administrative state due to remote MS-W message.",
      "zh-CHS": "由于远程MS-W消息，SwitAdminSwremote正在切换管理状态。"
    },
    {
      "indent": 10,
      "text": "switadmMSPremote Switching Administrative state due to remote MS-P message. Same as Protecting Administrative state due to remote MS message in the PSC mode.",
      "zh-CHS": "SwitAdminsPremote由于远程MS-P消息而切换管理状态。与在PSC模式下由于远程MS消息而保护管理状态相同。"
    },
    {
      "indent": 10,
      "text": "wtr Wait-to-Restore state.",
      "zh-CHS": "wtr等待恢复状态。"
    },
    {
      "indent": 10,
      "text": "dnr Do-not-Revert state.",
      "zh-CHS": "dnr不还原状态。"
    },
    {
      "indent": 10,
      "text": "exerLocal Exercise state due to local EXER command.",
      "zh-CHS": "由于本地EXER命令，EXER处于本地演习状态。"
    },
    {
      "indent": 6,
      "text": " exerRemote Exercise state due to remote EXER message.\" REFERENCE \"Sections 3 and 11 of RFC 7271\"",
      "zh-CHS": "远程EXER消息导致的EXER远程演习状态。“参考”RFC 7271第3节和第11节"
    },
    {
      "indent": 6,
      "text": "SYNTAX   INTEGER {\n            normal(1),\n            unavLOlocal(2),\n            unavSFPlocal(3),\n            unavSDPlocal(4),\n            unavLOremote(5),\n            unavSFPremote(6),\n            unavSDPremote(7),\n            protfailSFWlocal(8),\n            protfailSDWlocal(9),\n            protfailSFWremote(10),\n            protfailSDWremote(11),\n            switadmFSlocal(12),\n            switadmMSWlocal(13),\n            switadmMSPlocal(14),\n            switadmFSremote(15),\n            switadmMSWremote(16),\n            switadmMSPremote(17),\n            wtr(18),\n            dnr(19),\n            exerLocal(20),\n            exerRemote(21)\n            }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- Start of\n-- MPLS-TP Linear Protection Switching Configuration Table.\n-- This table supports the addition, configuration, and deletion\n-- of MPLS-TP linear protection domains.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigDomainIndexNext OBJECT-TYPE\n   SYNTAX      IndexIntegerNextFree (0..4294967295)\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"This object contains an unused value for\n       mplsLpsConfigDomainIndex, or a zero to indicate that\n       the number of unassigned entries has been exhausted.\n       Negative values are not allowed, as they do not correspond\n       to valid values of mplsLpsConfigDomainIndex.\"\n   ::= { mplsLpsObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsConfigEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table lists the MPLS-TP linear protection domains that\n       have been configured on the system.\n       An entry is created by a network operator who wants to run\n       the MPLS-TP linear protection protocol for the protection\n       domain.\"\n   ::= { mplsLpsObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigEntry OBJECT-TYPE\n   SYNTAX      MplsLpsConfigEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"A conceptual row in the mplsLpsConfigTable.\"\n   INDEX { mplsLpsConfigDomainIndex }\n   ::= { mplsLpsConfigTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MplsLpsConfigEntry ::= SEQUENCE {\n   mplsLpsConfigDomainIndex         Unsigned32,\n   mplsLpsConfigDomainName          SnmpAdminString,\n   mplsLpsConfigMode                INTEGER,\n   mplsLpsConfigProtectionType      INTEGER,\n   mplsLpsConfigRevertive           INTEGER,\n   mplsLpsConfigSdThreshold         Unsigned32,\n   mplsLpsConfigSdBadSeconds        Unsigned32,\n   mplsLpsConfigSdGoodSeconds       Unsigned32,\n   mplsLpsConfigWaitToRestore       Unsigned32,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": " mplsLpsConfigHoldOff Unsigned32, mplsLpsConfigContinualTxInterval Unsigned32, mplsLpsConfigRapidTxInterval Unsigned32, mplsLpsConfigCommand MplsLpsCommand, mplsLpsConfigCreationTime TimeStamp, mplsLpsConfigRowStatus RowStatus, mplsLpsConfigStorageType StorageType }",
      "zh-CHS": "MPLSLPConfigHoldoff Unsigned32、MPLSLPConfigContinualTxinterval Unsigned32、MPLSPSConfigRapidTxinterval Unsigned32、MPLSPSConfigCommand、MPLSPSConfigCreationTime时间戳、MPLSPSConfigRowStatus行状态、MPLSPSConfigStorageType存储类型}"
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigDomainIndex OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Index for the conceptual row identifying a protection domain. Operators should obtain new values for row creation in this table by reading mplsLpsConfigDomainIndexNext.",
      "zh-CHS": "MPLSLPConfigDomainIndex对象类型语法Unsigned32（1..4294967295）MAX-ACCESS不可访问状态当前描述“标识保护域的概念行的索引。操作员应通过读取MPLSPSConfigDomainIndexNext获取此表中行创建的新值。"
    },
    {
      "indent": 6,
      "text": "    When the value of this object is the same as the value of\n    mplsLpsMeConfigDomain, the mplsLpsMeConfigDomain is defined\n    as either the working path or the protection path for this\n    protection domain.\"\n::= { mplsLpsConfigEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigDomainName OBJECT-TYPE\n   SYNTAX      SnmpAdminString (SIZE (0..32))\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"Textual name that represents the MPLS-TP linear protection\n       domain.  It facilitates easy administrative identification of\n       each protection domain.\"\n   DEFVAL {\"\"}\n   ::= { mplsLpsConfigEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigMode OBJECT-TYPE\n   SYNTAX INTEGER {\n             psc(1),\n             aps(2)\n             }\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"The mode of the MPLS-TP linear protection mechanism.  This can\n       be either PSC or APS, as follows:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "PSC The Protection State Coordination mode as described in RFC 6378.",
      "zh-CHS": "PSC——RFC 6378中所述的保护状态协调模式。"
    },
    {
      "indent": 10,
      "text": "APS The Automatic Protection Switching mode as described in RFC 7271.",
      "zh-CHS": "APS自动保护切换模式如RFC 7271所述。"
    },
    {
      "indent": 10,
      "text": "This object may not be modified if the associated mplsLpsConfigRowStatus object is equal to active(1).",
      "zh-CHS": "如果关联的MPLSLPConfigRowStatus对象等于active（1），则不能修改此对象。"
    },
    {
      "indent": 10,
      "text": "The value of this object is not supposed to be changed during operation. When the value should be changed, the protection processes in both LERs MUST be restarted with the same new value.",
      "zh-CHS": "在操作过程中不应更改此对象的值。当需要更改该值时，必须使用相同的新值重新启动两个LER中的保护过程。"
    },
    {
      "indent": 6,
      "text": "    If this value is changed at one LER during operation,\n    the LER will generate PSC packets with a new\n    Capabilities TLV value.  This will result in\n    mplsLpsEventCapabilitiesMismatch notifications at both LERs.\"\nREFERENCE\n   \"Sections 9.2 and 10 of RFC 7271\"\nDEFVAL {psc}\n::= { mplsLpsConfigEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigProtectionType OBJECT-TYPE\n   SYNTAX INTEGER {\n             onePlusOneUnidirectional(1),\n             oneColonOneBidirectional(2),\n             onePlusOneBidirectional(3)\n             }\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"The protection architecture type of the protection domain.\n       This object represents both the bridge type, which can be\n       either a permanent bridge (1+1) or a selector bridge (1:1);\n       and the switching scheme, which can be either unidirectional\n       or bidirectional.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "1+1 In the 1+1 protection scheme, a fully dedicated protection path is allocated. Data traffic is copied and fed at the source to both the working path and the protection path. The traffic on the working path and protection path is transmitted simultaneously to the sink of the protection domain, where selection between the working path and the protection path is performed.",
      "zh-CHS": "1+1在1+1保护方案中，分配了一条完全专用的保护路径。数据通信量在源位置复制并馈送到工作路径和保护路径。工作路径和保护路径上的业务被同时传输到保护域的接收器，其中在工作路径和保护路径之间执行选择。"
    },
    {
      "indent": 10,
      "text": "1:1 In the 1:1 protection scheme, a protection path is allocated to protect against a defect, failure, or degradation on the working path. In normal conditions, data traffic is transmitted over the working path, while the protection path functions in the idle state. If there is a defect on the working path or a specific administrative request, traffic is switched to the protection path.",
      "zh-CHS": "1:1在1:1保护方案中，分配保护路径以防止工作路径上出现缺陷、故障或降级。在正常情况下，数据流量通过工作路径传输，而保护路径在空闲状态下工作。如果工作路径上存在缺陷或特定的管理请求，则通信量将切换到保护路径。"
    },
    {
      "indent": 10,
      "text": "bidirectional In the bidirectional protection scheme, both directions will be switched simultaneously even if the fault applies to only one direction of the path.",
      "zh-CHS": "双向在双向保护方案中，即使故障仅适用于路径的一个方向，两个方向也将同时切换。"
    },
    {
      "indent": 10,
      "text": "unidirectional In the unidirectional protection scheme, protection switching will be performed independently for each direction of a bidirectional transport path.",
      "zh-CHS": "单向在单向保护方案中，将为双向传输路径的每个方向独立执行保护切换。"
    },
    {
      "indent": 10,
      "text": "This object may not be modified if the associated mplsLpsConfigRowStatus object is equal to active(1).\"",
      "zh-CHS": "如果关联的MPLSLPConfigRowStatus对象等于active（1），则不能修改此对象。”"
    },
    {
      "indent": 6,
      "text": "REFERENCE\n   \"Section 4.2.3 of RFC 6378\"\nDEFVAL {oneColonOneBidirectional}\n::= { mplsLpsConfigEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigRevertive OBJECT-TYPE SYNTAX INTEGER { nonrevertive(1), revertive(2) } MAX-ACCESS read-create STATUS current DESCRIPTION \"This object represents the reversion mode of the linear protection domain. The reversion mode of the protection mechanism may be either revertive or non-revertive.",
      "zh-CHS": "MPLSLPConfigRevertive对象类型语法整数{nonrevertive（1），revertive（2）}MAX-ACCESS read create STATUS current DESCRIPTION“此对象表示线性保护域的还原模式。保护机制的还原模式可以是还原或非还原。"
    },
    {
      "indent": 10,
      "text": "nonrevertive In the non-revertive mode, after a service has been recovered, traffic will be forwarded on the protection path.",
      "zh-CHS": "非还原在非还原模式下，恢复服务后，流量将在保护路径上转发。"
    },
    {
      "indent": 10,
      "text": "revertive In the revertive mode, after a service has been recovered, traffic will be redirected back onto the original working path.",
      "zh-CHS": "恢复在恢复模式下，恢复服务后，流量将重定向回原始工作路径。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 4.2.4 of RFC 6378\"\nDEFVAL { revertive }\n::= { mplsLpsConfigEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigSdThreshold OBJECT-TYPE SYNTAX Unsigned32 (0..100) MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the threshold value of the Signal Degrade (SD) defect in percent. In order to detect the SD defect, the MPLS-TP packet loss measurement (LM) is performed every second.",
      "zh-CHS": "MPLSLPConfigSDThreshold对象类型语法Unsigned32（0..100）MAX-ACCESS read create STATUS current DESCRIPTION“此对象以百分比为单位保存信号降级（SD）缺陷的阈值。为了检测SD缺陷，每秒执行一次MPLS-TP丢包测量（LM）。"
    },
    {
      "indent": 10,
      "text": "If either the packet loss is negative (i.e., there are more packets received than transmitted) or the packet loss ratio (lost packets/transmitted packets) in percent is greater than this threshold value, a Bad Second is declared. Otherwise, a Good Second is declared.",
      "zh-CHS": "如果数据包丢失为负值（即，接收的数据包多于发送的数据包），或者数据包丢失率（丢失的数据包/发送的数据包百分比）大于该阈值，则宣布为坏秒。否则，将声明一个良好的秒。"
    },
    {
      "indent": 10,
      "text": "The SD defect is detected if there are mplsLpsConfigSdBadSeconds consecutive Bad Seconds and cleared if there are mplsLpsConfigSdGoodSeconds consecutive Good Seconds.",
      "zh-CHS": "如果存在MPLSLPConfigSDBadSeconds连续坏秒，则检测SD缺陷；如果存在MPLSLPConfigSDGoodSeconds连续好秒，则清除SD缺陷。"
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Clause 6.1.3.3 of ITU-T Recommendation G.8121/Y.1381 and\n    Table 8-1 of ITU-T Recommendation G.8151/Y.1374\"\nDEFVAL { 30 }\n::= { mplsLpsConfigEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigSdBadSeconds OBJECT-TYPE SYNTAX Unsigned32 (2..10) UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the number of Bad Seconds to detect the SD.",
      "zh-CHS": "MPLSLPConfigSDBadSeconds对象类型语法Unsigned32（2..10）单位“秒”最大访问读取创建状态当前描述“此对象保留检测SD的坏秒数。"
    },
    {
      "indent": 10,
      "text": "If the number of consecutive Bad Seconds reaches this value, the SD defect is detected and used as an input to the protection switching process.",
      "zh-CHS": "如果连续不良秒数达到该值，则检测SD缺陷并将其用作保护切换过程的输入。"
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Clause 6.1.3.3 of ITU-T Recommendation G.8121/Y.1381 and\n    Table 8-1 of ITU-T Recommendation G.8151/Y.1374\"\nDEFVAL { 10 }\n::= { mplsLpsConfigEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigSdGoodSeconds OBJECT-TYPE SYNTAX Unsigned32 (2..10) UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the number of Good Seconds to declare the clearance of an SD defect.",
      "zh-CHS": "MPLSLPConfigsGoodSeconds对象类型语法Unsigned32（2..10）个单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“此对象包含声明SD缺陷清除的有效秒数。"
    },
    {
      "indent": 10,
      "text": "After an SD defect occurs on a path, if the number of consecutive Good Seconds reaches this value for the degraded path, the clearance of the SD defect is declared and used as an input to the protection switching process.",
      "zh-CHS": "在路径上发生SD缺陷后，如果连续良好秒数达到降级路径的该值，则宣布SD缺陷的清除，并将其用作保护切换过程的输入。"
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Clause 6.1.3.3 of ITU-T Recommendation G.8121/Y.1381 and\n    Table 8-1 of ITU-T Recommendation G.8151/Y.1374\"\nDEFVAL { 10 }\n::= { mplsLpsConfigEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigWaitToRestore OBJECT-TYPE SYNTAX Unsigned32 (5..12) UNITS \"minutes\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the Wait-to-Restore timer value in minutes and can be configured in 1-minute intervals between 5 and 12 minutes.",
      "zh-CHS": "MPLSLPConfigWaitToRestore对象类型语法Unsigned32（5..12）单位“分钟”MAX-ACCESS read create STATUS current DESCRIPTION“此对象以分钟为单位保存等待还原计时器值，可以在5到12分钟之间的1分钟间隔内进行配置。"
    },
    {
      "indent": 10,
      "text": "The WTR timer is used to delay the reversion of the PSC state to the Normal state when recovering from a failure condition on the working path when the protection domain is configured for revertive behavior.",
      "zh-CHS": "当保护域配置为恢复行为时，WTR定时器用于在工作路径上从故障状态恢复时，延迟PSC状态恢复到正常状态。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 3.5 of RFC 6378\"\nDEFVAL { 5 }\n::= { mplsLpsConfigEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigHoldOff OBJECT-TYPE SYNTAX Unsigned32 (0..100) UNITS \"deciseconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The hold-off time in deciseconds. Represents the time between SF/SD condition detection and declaration of an SF/SD request to the protection switching logic. It is intended to avoid unnecessary switching when a lower-layer protection mechanism is in place. Can be configured in intervals of 100 milliseconds.",
      "zh-CHS": "MPLSLPConfigHoldoff对象类型语法无符号32（0..100）单位“分秒”最大读取创建状态当前说明“延迟时间以分秒为单位。表示SF/SD条件检测和向保护切换逻辑声明SF/SD请求之间的时间。其目的是在较低层保护机制到位时避免不必要的切换。可以以100毫秒的间隔进行配置。"
    },
    {
      "indent": 10,
      "text": "When a new defect or a more severe defect occurs on the active path (the path from which the selector selects the user data traffic) and this value is non-zero, the hold-off timer will be started. A defect on the standby",
      "zh-CHS": "当活动路径（选择器从中选择用户数据流量的路径）上出现新缺陷或更严重的缺陷且该值非零时，将启动暂停计时器。备用的缺陷"
    },
    {
      "indent": 10,
      "text": "path (the path from which the selector does not select the user data traffic) does not trigger the start of the hold-off timer, as there is no need for a traffic switchover.",
      "zh-CHS": "路径（选择器不选择用户数据流量的路径）不会触发暂停计时器的启动，因为不需要流量切换。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 3.1 of RFC 6378\"\nDEFVAL { 0 }\n::= { mplsLpsConfigEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigContinualTxInterval OBJECT-TYPE SYNTAX Unsigned32 (1..20) UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The Continual Tx Time in seconds. Represents the time interval to send the continual PSC packet to the other end, based on the current state.",
      "zh-CHS": "MPLSLPConfigContinuelTxinterval对象类型语法Unsigned32（1..20）单位“秒”最大访问读取创建状态当前描述“以秒为单位的连续发送时间。表示基于当前状态将连续PSC数据包发送到另一端的时间间隔。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 4.1 of RFC 6378\"\nDEFVAL { 5 }\n::= { mplsLpsConfigEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigRapidTxInterval OBJECT-TYPE SYNTAX Unsigned32 (1000..20000) UNITS \"microseconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The Rapid Tx interval in microseconds. Represents the time interval to send the PSC packet to the other end, when there is a change in the state of the linear protection domain due to local input. The default value is 3.3 milliseconds (3300 microseconds).",
      "zh-CHS": "MPLSLPConfigRapidTxinterval对象类型语法无符号32（1000..20000）单位“微秒”最大读取创建状态当前描述“以微秒为单位的快速发送间隔。表示当线性保护域的状态因本地输入而发生变化时，将PSC数据包发送到另一端的时间间隔。默认值为3.3毫秒（3300微秒）。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 4.1 of RFC 6378\"\nDEFVAL { 3300 }\n::= { mplsLpsConfigEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigCommand OBJECT-TYPE SYNTAX MplsLpsCommand MAX-ACCESS read-create STATUS current DESCRIPTION \"Allows the initiation of an operator command on the protection domain.",
      "zh-CHS": "MPLSLPConfigCommand对象类型语法MPLSPSCommand MAX-ACCESS read create STATUS current DESCRIPTION“允许在保护域上启动操作员命令。"
    },
    {
      "indent": 10,
      "text": "When read, this object returns the last command written or noCmd if no command has been written since initialization. The return of the last command written does not imply that this command is currently in effect. This request may have been preempted by a higher-priority local or remote request.",
      "zh-CHS": "读取时，此对象返回上次写入的命令，如果初始化后未写入任何命令，则返回noCmd。返回最后写入的命令并不意味着此命令当前有效。此请求可能已被更高优先级的本地或远程请求抢占。"
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Sections 3.1 and 3.2 of RFC 6378 and Sections 4.3 and 6 of\n    RFC 7271\"\nDEFVAL { noCmd }\n::= { mplsLpsConfigEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigCreationTime OBJECT-TYPE\n   SYNTAX      TimeStamp\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The value of sysUpTime at the time the row was created.\"\n   ::= { mplsLpsConfigEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigRowStatus OBJECT-TYPE\n   SYNTAX      RowStatus\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"This object represents the status of the MPLS-TP linear\n       protection domain entry.  This variable is used to\n       create, modify, and/or delete a row in this table.\"\n   ::= { mplsLpsConfigEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigStorageType OBJECT-TYPE\n   SYNTAX      StorageType\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"The storage type for this conceptual row.\n       Conceptual rows having the value 'permanent' need not\n       allow write access to any columnar objects in the row.\"\n   DEFVAL      { nonVolatile }\n   ::= { mplsLpsConfigEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "--\n-- MPLS-TP Linear Protection Switching Status Table.\n-- This table provides protection domain statistics.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table provides status information about MPLS-TP\n       linear protection domains that have been configured\n       on the system.\"\n   ::= { mplsLpsObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusEntry OBJECT-TYPE\n   SYNTAX      MplsLpsStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"A conceptual row in the mplsLpsStatusTable.\"\n   AUGMENTS { mplsLpsConfigEntry }\n   ::= { mplsLpsStatusTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MplsLpsStatusEntry ::= SEQUENCE {\n   mplsLpsStatusState                 MplsLpsState,\n   mplsLpsStatusReqRcv                MplsLpsReq,\n   mplsLpsStatusReqSent               MplsLpsReq,\n   mplsLpsStatusFpathPathRcv          MplsLpsFpathPath,\n   mplsLpsStatusFpathPathSent         MplsLpsFpathPath,\n   mplsLpsStatusRevertiveMismatch     TruthValue,\n   mplsLpsStatusProtecTypeMismatch    TruthValue,\n   mplsLpsStatusCapabilitiesMismatch  TruthValue,\n   mplsLpsStatusPathConfigMismatch    TruthValue,\n   mplsLpsStatusFopNoResponses        Counter32,\n   mplsLpsStatusFopTimeouts           Counter32\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusState OBJECT-TYPE\n   SYNTAX      MplsLpsState\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current state of the PSC state machine.\"\n   REFERENCE\n      \"Section 11 of RFC 7271\"\n   ::= { mplsLpsStatusEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusReqRcv OBJECT-TYPE\n   SYNTAX      MplsLpsReq\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the PSC Request field received on\n       the most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusReqSent OBJECT-TYPE\n   SYNTAX      MplsLpsReq\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the PSC Request field sent on the\n       most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFpathPathRcv OBJECT-TYPE\n   SYNTAX      MplsLpsFpathPath\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the FPath and Path fields received\n       on the most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFpathPathSent OBJECT-TYPE\n   SYNTAX      MplsLpsFpathPath\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the FPath and Path fields sent\n       on the most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusRevertiveMismatch OBJECT-TYPE\n   SYNTAX      TruthValue\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"This object indicates a provisioning mismatch in the\n       revertive mode across the protection domain endpoints.\n       The value of this object becomes true when a PSC message with\n       an incompatible Revertive field is received or false when a\n       PSC message with a compatible Revertive field is received.\"\n   REFERENCE\n      \"Section 12 of RFC 7271\"\n   ::= { mplsLpsStatusEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusProtecTypeMismatch OBJECT-TYPE\n   SYNTAX      TruthValue\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"This object indicates a provisioning mismatch in the\n       protection type, representing both the bridge type and the\n       switching type, across the protection domain endpoints.\n       The value of this object becomes true when a PSC message with\n       an incompatible Protection Type (PT) field is received or\n       false when a PSC message with a compatible PT field is\n       received.\"\n   REFERENCE\n      \"Section 12 of RFC 7271\"\n   ::= { mplsLpsStatusEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusCapabilitiesMismatch OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates a provisioning mismatch in Capabilities TLVs across the protection domain endpoints. The value of this object becomes true when a PSC message with an incompatible Capabilities TLV field is received or false when a PSC message with a compatible Capabilities TLV field is received.",
      "zh-CHS": "MPLSLPStatusCapabilities不匹配对象类型语法TruthValue MAX-ACCESS只读状态当前说明“此对象表示跨保护域终结点的TLV功能配置不匹配。当接收到具有不兼容能力TLV字段的PSC消息时，此对象的值变为true；当接收到具有兼容能力TLV字段的PSC消息时，此对象的值变为false。"
    },
    {
      "indent": 6,
      "text": "    The Capabilities TLV with 0xF8000000 indicates that the APS\n    mode is used for the MPLS-TP linear protection mechanism,\n    whereas the PSC mode either (1) uses the Capabilities TLV\n    with a value of 0x0 or (2) does not use the Capabilities TLV\n    because the TLV does not exist.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusPathConfigMismatch OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates a provisioning mismatch in the protection path configuration for PSC communication across the protection domain endpoints.",
      "zh-CHS": "MPLSLPStatusPathConfigMissing对象类型语法TruthValue MAX-ACCESS只读状态当前描述“此对象表示保护域端点之间PSC通信的保护路径配置中的配置不匹配。"
    },
    {
      "indent": 6,
      "text": "    The value of this object becomes true when a PSC message is\n    received from the working path or false when a PSC message\n    is received from the protection path.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFopNoResponses OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object holds the number of occurrences of protocol failure due to a lack of response to a traffic switchover request within 50 ms.",
      "zh-CHS": "MPLSLPSTATUSFOPNORESPONSES对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象保留由于在50毫秒内对流量切换请求没有响应而导致协议失败的发生次数。"
    },
    {
      "indent": 6,
      "text": "    When there is a traffic switchover due to a local request,\n    a 50 ms timer is started to detect protocol failure due to\n    no response.  If there is no PSC message received with the\n    same Path value as the Path value in the transmitted\n    PSC message until the 50 ms timer expires, protocol failure\n    due to no response occurs.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFopTimeouts OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object holds the number of occurrences of protocol failure due to no PSC message being received during at least 3.5 times the long PSC message interval.",
      "zh-CHS": "MPLSLPSTATUSFOPTIMEOUTS对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含由于在至少3.5倍的长PSC消息间隔内未接收到PSC消息而导致协议失败的发生次数。"
    },
    {
      "indent": 6,
      "text": "    When no PSC message is received on the protection path during\n    at least 3.5 times the long PSC message interval and there\n    is no defect on the protection path, protocol failure due to\n    no PSC message occurs.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- MPLS-TP Linear Protection ME Association Configuration Table.\n-- This table supports the addition, configuration, and deletion\n-- of MPLS-TP linear protection MEs in protection domains.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeConfigTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsMeConfigEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table lists ME associations that have been configured\n       in protection domains.\"\n   ::= { mplsLpsObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeConfigEntry OBJECT-TYPE SYNTAX MplsLpsMeConfigEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A conceptual row in the mplsLpsMeConfigTable. There is a sparse relationship between the conceptual rows of this table and the mplsOamIdMeTable.",
      "zh-CHS": "MPLSLPMEConfigEntry对象类型语法MPLSLPMEConfigEntry MAX-ACCESS不可访问状态当前描述“MPLSLPMEConfigTable中的概念行。此表的概念行与MPLSOMIDMetable之间存在稀疏关系。"
    },
    {
      "indent": 10,
      "text": "Each time that an entry is created in the mplsOamIdMeTable for which the LER supports MPLS-TP linear protection, a row is created automatically in the mplsLpsMeConfigTable.",
      "zh-CHS": "每次在LER支持MPLS-TP线性保护的MPLSOIMIDETABLE中创建条目时，都会在MPLSLPMEConfigTable中自动创建一行。"
    },
    {
      "indent": 10,
      "text": "An entry in this table is related to a single entry in the mplsOamIdMeTable. When a point-to-point transport path needs to be monitored, one ME is needed for the path, and one entry in the mplsOamIdMeTable will be created. But the ME entry in the mplsOamIdMeTable may or may not participate in protection switching.",
      "zh-CHS": "此表中的一个条目与MPLSOAMIDETABLE中的单个条目相关。当需要监控点到点传输路径时，该路径需要一个ME，并且将在mplsOamIdMeTable中创建一个条目。但是MPLSOAMIDETABLE中的ME条目可能参与也可能不参与保护切换。"
    },
    {
      "indent": 10,
      "text": "If an ME participates in protection switching, an entry in the mplsLpsMeConfigTable MUST be created, and the objects in the entry indicate which protection domain this ME belongs to and whether this ME is for the working path or the protection path.",
      "zh-CHS": "如果ME参与保护切换，则必须在mplsLpsMeConfigTable中创建一个条目，该条目中的对象指示该ME属于哪个保护域，以及该ME是用于工作路径还是用于保护路径。"
    },
    {
      "indent": 6,
      "text": "    If the ME does not participate in protection switching,\n    an entry in the mplsLpsMeConfigTable does not need\n    to be created.\"\nINDEX {mplsOamIdMegIndex, mplsOamIdMeIndex, mplsOamIdMeMpIndex}\n::= { mplsLpsMeConfigTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MplsLpsMeConfigEntry ::= SEQUENCE {\n   mplsLpsMeConfigDomain                Unsigned32,\n   mplsLpsMeConfigPath                  INTEGER\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeConfigDomain OBJECT-TYPE SYNTAX Unsigned32 (0..4294967295) MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the mplsLpsConfigDomainIndex value for the protection domain in which this ME is included. If this ME is not part of any protection domain, then this object contains the value 0.",
      "zh-CHS": "mplsLpsMeConfigDomain对象类型语法Unsigned32（0..4294967295）MAX-ACCESS read create STATUS current DESCRIPTION“此对象持有包含此ME的保护域的MPLSPSConfigDomainIndex值。如果此ME不是任何保护域的一部分，则此对象包含值0。"
    },
    {
      "indent": 6,
      "text": "    When the value of this object is the same as the value of\n    mplsLpsConfigDomainIndex, the object is defined as either\n    the working path or the protection path of the\n    protection domain corresponding to mplsLpsConfigDomainIndex.\"\nDEFVAL { 0 }\n::= { mplsLpsMeConfigEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeConfigPath OBJECT-TYPE\n   SYNTAX      INTEGER { working(1), protection(2) }\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"This object represents whether the ME is configured\n       as the working path or the protection path.\"\n   REFERENCE\n      \"Section 4.3 of RFC 6378\"\n   ::= { mplsLpsMeConfigEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "--\n-- MPLS Linear Protection ME Status Table.\n-- This table provides protection switching ME statistics.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsMeStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table contains status information of all the MEs\n       that are included in MPLS-TP linear protection domains.\"\n   ::= { mplsLpsObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusEntry OBJECT-TYPE\n   SYNTAX      MplsLpsMeStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"A conceptual row in the mplsLpsMeStatusTable.\"\n   AUGMENTS { mplsLpsMeConfigEntry }\n   ::= { mplsLpsMeStatusTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "MplsLpsMeStatusEntry ::= SEQUENCE {\n   mplsLpsMeStatusCurrent               BITS,\n   mplsLpsMeStatusSignalDegrades        Counter32,\n   mplsLpsMeStatusSignalFailures        Counter32,\n   mplsLpsMeStatusSwitchovers           Counter32,\n   mplsLpsMeStatusLastSwitchover        TimeStamp,\n   mplsLpsMeStatusSwitchoverSeconds     Counter32\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusCurrent OBJECT-TYPE\n   SYNTAX      BITS {\n               localSelectTraffic(0),\n               localSD(1),\n               localSF(2)\n               }\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"Indicates the current state of the ME.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "localSelectTraffic This bit indicates that traffic is being selected from this ME.",
      "zh-CHS": "localSelectTraffic此位表示正在从此ME中选择流量。"
    },
    {
      "indent": 10,
      "text": "localSD This bit implies that a local Signal Degrade condition is in effect on this ME/path.",
      "zh-CHS": "localSD此位表示本地信号降级条件在此ME/路径上生效。"
    },
    {
      "indent": 6,
      "text": "    localSF\n    This bit implies that a local Signal Fail condition is\n    in effect on this ME/path.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378 and Section 7 of RFC 7271\"\n::= { mplsLpsMeStatusEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSignalDegrades OBJECT-TYPE\n   SYNTAX      Counter32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"Represents the count of Signal Degrade conditions.\n       For the detection and clearance of Signal Degrade,\n       see the description of mplsLpsConfigSdThreshold.\"\n   REFERENCE\n      \"Section 7 of RFC 7271\"\n   ::= { mplsLpsMeStatusEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSignalFailures OBJECT-TYPE\n   SYNTAX      Counter32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"Represents the count of Signal Fail conditions.\n       This condition occurs when the OAM running on this ME\n       detects the Signal Fail event.\"\n   REFERENCE\n      \"Section 4.3 of RFC 6378\"\n   ::= { mplsLpsMeStatusEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSwitchovers OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"Represents the count of switchovers that happened in this ME.",
      "zh-CHS": "MPLSLPMESTATUSSWITCOVERS对象类型语法计数器32 MAX-ACCESS只读状态当前描述”表示在此ME中发生的切换计数。"
    },
    {
      "indent": 10,
      "text": "When the mplsLpsMeConfigPath value is 'working', this object will return the number of times that traffic has been switched from this working path to the protection path.",
      "zh-CHS": "当mplsLpsMeConfigPath值为“工作”时，此对象将返回流量从此工作路径切换到保护路径的次数。"
    },
    {
      "indent": 6,
      "text": "    When the mplsLpsMeConfigPath value is 'protection', this\n    object will return the number of times that traffic has been\n    switched back to the working path from this protection path.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378\"\n::= { mplsLpsMeStatusEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusLastSwitchover OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"This object holds the value of sysUpTime at the time that the last switchover happened.",
      "zh-CHS": "MPLSLPMESTATUSLASTSWITCHOVER对象类型语法时间戳MAX-ACCESS只读状态当前描述“此对象保存上次切换发生时的sysUpTime值。"
    },
    {
      "indent": 10,
      "text": "When the mplsLpsMeConfigPath value is 'working', this object will return the value of sysUpTime when traffic was switched from this path to the protection path.",
      "zh-CHS": "当mplsLpsMeConfigPath值为“工作”时，当通信量从此路径切换到保护路径时，此对象将返回sysUpTime值。"
    },
    {
      "indent": 10,
      "text": "If traffic has never switched to the protection path, the value 0 will be returned.",
      "zh-CHS": "如果流量从未切换到保护路径，则返回值0。"
    },
    {
      "indent": 6,
      "text": "    When the mplsLpsMeConfigPath value is 'protection', this\n    object will return the value of sysUpTime the last time that\n    traffic was switched back to the working path from this path.\n    If no traffic has ever switched back to the working path from\n    this protection path, the value 0 will be returned.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378\"\n::= { mplsLpsMeStatusEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSwitchoverSeconds OBJECT-TYPE SYNTAX Counter32 UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative Protection Switching Duration (PSD) time in seconds.",
      "zh-CHS": "MPLSLPMestatusSwitchoverSeconds对象类型语法计数器32个单位“秒”最大访问只读状态当前描述“累计保护切换持续时间（PSD）时间（秒）。"
    },
    {
      "indent": 10,
      "text": "For the working path, this is the cumulative number of seconds that traffic was selected from the protection path.",
      "zh-CHS": "对于工作路径，这是从保护路径选择流量的累计秒数。"
    },
    {
      "indent": 6,
      "text": "    For the protection path, this is the cumulative number\n    of seconds that the working path has been used to\n    select traffic.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378\"\n::= { mplsLpsMeStatusEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsNotificationEnable OBJECT-TYPE\n   SYNTAX      BITS {\n               switchover(0),\n               revertiveMismatch(1),\n               protecTypeMismatch(2),\n               capabilitiesMismatch(3),\n               pathConfigMismatch(4),\n               fopNoResponse(5),\n               fopTimeout(6)\n               }\n   MAX-ACCESS  read-write\n   STATUS      current\n   DESCRIPTION\n      \"Provides the ability to enable and disable notifications\n       defined in this MIB module.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "switchover Indicates that mplsLpsEventSwitchover notifications should be generated.",
      "zh-CHS": "切换指示应生成MPLSPSEventSwitchover通知。"
    },
    {
      "indent": 10,
      "text": "revertiveMismatch Indicates that mplsLpsEventRevertiveMismatch notifications should be generated.",
      "zh-CHS": "RevertIVeMatch表示应生成MPLSPSEventRevertIVeMatch通知。"
    },
    {
      "indent": 10,
      "text": "protecTypeMismatch Indicates that mplsLpsEventProtecTypeMismatch notifications should be generated.",
      "zh-CHS": "ProtectTypeMismatch表示应生成MPLSPSEventProtectTypeMismatch通知。"
    },
    {
      "indent": 10,
      "text": "capabilitiesMismatch Indicates that mplsLpsEventCapabilitiesMismatch notifications should be generated.",
      "zh-CHS": "Capabilitiesmatch表示应生成MPLSLPEventCapabilitiesmatch通知。"
    },
    {
      "indent": 10,
      "text": "pathConfigMismatch Indicates that mplsLpsEventPathConfigMismatch notifications should be generated.",
      "zh-CHS": "pathConfigMismatch表示应生成MPLSPSEventPathConfigMismatch通知。"
    },
    {
      "indent": 10,
      "text": "fopNoResponse Indicates that mplsLpsEventFopNoResponse notifications should be generated.",
      "zh-CHS": "FopnoreResponse表示应生成MPLSLPEventFopnoreResponse通知。"
    },
    {
      "indent": 6,
      "text": "    fopTimeout\n    Indicates that mplsLpsEventFopTimeout notifications should be\n    generated.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\nDEFVAL { { } }\n::= { mplsLpsObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- MPLS Linear Protection EVENTS.",
      "zh-CHS": "--MPLS线性保护事件。"
    },
    {
      "indent": 3,
      "text": "mplsLpsEventSwitchover NOTIFICATION-TYPE\n   OBJECTS { mplsLpsMeStatusSwitchovers, mplsLpsMeStatusCurrent }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventSwitchover notification is sent when the\n       value of an instance of mplsLpsMeStatusSwitchovers\n       increments.\"\n   ::= { mplsLpsNotifications 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsEventRevertiveMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusRevertiveMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventRevertiveMismatch notification is sent when\n       the value of mplsLpsStatusRevertiveMismatch changes.\"\n   ::= { mplsLpsNotifications 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsEventProtecTypeMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusProtecTypeMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventProtecTypeMismatch notification is sent\n       when the value of mplsLpsStatusProtecTypeMismatch changes.\"\n   ::= { mplsLpsNotifications 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsEventCapabilitiesMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusCapabilitiesMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventCapabilitiesMismatch notification is sent\n       when the value of mplsLpsStatusCapabilitiesMismatch changes.\"\n   ::= { mplsLpsNotifications 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsEventPathConfigMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusPathConfigMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventPathConfigMismatch notification is sent\n       when the value of mplsLpsStatusPathConfigMismatch changes.\"\n   ::= { mplsLpsNotifications 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsEventFopNoResponse NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusFopNoResponses }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventFopNoResponse notification is sent when the\n       value of mplsLpsStatusFopNoResponses increments.\"\n   ::= { mplsLpsNotifications 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsEventFopTimeout NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusFopTimeouts }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventFopTimeout notification is sent when the\n       value of mplsLpsStatusFopTimeouts increments.\"\n   ::= { mplsLpsNotifications 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- End of Notifications.",
      "zh-CHS": "--通知结束。"
    },
    {
      "indent": 3,
      "text": "-- Module Compliance.",
      "zh-CHS": "--模块合规性。"
    },
    {
      "indent": 3,
      "text": "mplsLpsCompliances\n   OBJECT IDENTIFIER ::= { mplsLpsConformance 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsGroups\n   OBJECT IDENTIFIER ::= { mplsLpsConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- Compliance requirement for fully compliant implementations.",
      "zh-CHS": "--完全合规实施的合规性要求。"
    },
    {
      "indent": 3,
      "text": "mplsLpsModuleFullCompliance MODULE-COMPLIANCE\n   STATUS      current\n   DESCRIPTION\n      \"Compliance statement for agents that provide full support for\n       the MPLS-LPS-MIB module.  Such devices can provide linear\n       protection and also be configured using this MIB module.\"\n   MODULE -- this module\n   MANDATORY-GROUPS {\n      mplsLpsScalarGroup,\n      mplsLpsTableGroup,\n      mplsLpsMeTableGroup\n   }\n   GROUP        mplsLpsNotificationGroup\n   DESCRIPTION\n      \"This group is only mandatory for those\n       implementations that can efficiently implement\n       the notifications contained in this group.\"\n   ::= { mplsLpsCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- Compliance requirement for read-only implementations.",
      "zh-CHS": "--只读实现的法规遵从性要求。"
    },
    {
      "indent": 3,
      "text": "mplsLpsModuleReadOnlyCompliance MODULE-COMPLIANCE\n   STATUS      current\n   DESCRIPTION\n      \"Compliance statement for agents that only provide\n       read-only support for the MPLS-LPS-MIB module.\"\n   MODULE -- this module\n   MANDATORY-GROUPS {\n      mplsLpsScalarGroup,\n      mplsLpsTableGroup,\n      mplsLpsMeTableGroup\n   }\n   GROUP        mplsLpsNotificationGroup\n   DESCRIPTION\n      \"This group is only mandatory for those\n       implementations that can efficiently implement\n       the notifications contained in this group.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "-- mplsLpsConfigTable",
      "zh-CHS": "--MPLSLPConfigTable"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigMode MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigMode最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigProtectionType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigProtectionType最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigRevertive MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigRevertive最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigSdThreshold MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigSDThreshold最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigSdBadSeconds MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigSDBadSeconds最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigSdGoodSeconds MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigsDgoodSeconds最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigWaitToRestore MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigWaitToRestore最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigContinualTxInterval MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigContinuelTxinterval最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigRapidTxInterval MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigRapidTxinterval MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigCommand MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigCommand MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigRowStatus SYNTAX RowStatus { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigRowStatus语法RowStatus{active（1）}MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPConfigStorageType最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "-- mplsLpsMeConfigTable",
      "zh-CHS": "--MPLSLPMEConfigTable"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsMeConfigDomain MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPMEConfigDomain最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsMeConfigPath MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象MPLSLPMEConfigPath最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "::= { mplsLpsCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- Units of conformance.",
      "zh-CHS": "--一致性单位。"
    },
    {
      "indent": 3,
      "text": "mplsLpsScalarGroup OBJECT-GROUP\n   OBJECTS {\n           mplsLpsConfigDomainIndexNext,\n           mplsLpsNotificationEnable\n           }\n   STATUS  current\n   DESCRIPTION\n      \"Collection of objects needed for MPLS linear protection.\"\n   ::= { mplsLpsGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsTableGroup OBJECT-GROUP OBJECTS { mplsLpsConfigDomainName, mplsLpsConfigRowStatus, mplsLpsConfigMode, mplsLpsConfigProtectionType, mplsLpsConfigRevertive, mplsLpsConfigSdThreshold, mplsLpsConfigSdBadSeconds, mplsLpsConfigSdGoodSeconds, mplsLpsConfigWaitToRestore, mplsLpsConfigHoldOff, mplsLpsConfigContinualTxInterval, mplsLpsConfigRapidTxInterval, mplsLpsConfigCommand, mplsLpsConfigCreationTime, mplsLpsConfigStorageType, mplsLpsStatusState, mplsLpsStatusReqRcv, mplsLpsStatusReqSent, mplsLpsStatusFpathPathRcv, mplsLpsStatusFpathPathSent,",
      "zh-CHS": "MPLSLPTableGroup对象组对象{MPLSPSConfigDomainName、MPLSPSConfigRowStatus、MPLSPSConfigMode、MPLSPSConfigProtectionType、MPLSPSConfigRetentive、MPLSPSConfigsDthreshold、MPLSPSConfigsDbadSeconds、MPLSPSConfigWaitToRestore、MPLSPSConfigHoldoff、MPLSPSConfigContinuelTxinterval、MPLSPSConfigRapidTxinterval、MPLSPSConfigCommand、mplsLpsConfigCreationTime、MPLSPSConfigStorageType、MPLSPSStatusState、MPLSPSStatusReqrcv、MPLSPSStatusReqSent、MPLSPSStatusFPathPathRCv、MPLSPSStatusFPathPathSent、，"
    },
    {
      "indent": 6,
      "text": "   mplsLpsStatusRevertiveMismatch,\n   mplsLpsStatusProtecTypeMismatch,\n   mplsLpsStatusCapabilitiesMismatch,\n   mplsLpsStatusPathConfigMismatch,\n   mplsLpsStatusFopNoResponses,\n   mplsLpsStatusFopTimeouts\n   }\nSTATUS  current\nDESCRIPTION\n   \"Collection of objects needed for MPLS linear protection\n    configuration and statistics.\"\n::= { mplsLpsGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeTableGroup OBJECT-GROUP\n   OBJECTS {\n      mplsLpsMeConfigDomain,\n      mplsLpsMeConfigPath,\n      mplsLpsMeStatusCurrent,\n      mplsLpsMeStatusSignalDegrades,\n      mplsLpsMeStatusSignalFailures,\n      mplsLpsMeStatusSwitchovers,\n      mplsLpsMeStatusLastSwitchover,\n      mplsLpsMeStatusSwitchoverSeconds\n      }\n   STATUS  current\n   DESCRIPTION\n      \"Collection of objects needed for MPLS linear protection\n       ME configuration and statistics.\"\n   ::= { mplsLpsGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "mplsLpsNotificationGroup NOTIFICATION-GROUP\n   NOTIFICATIONS {\n      mplsLpsEventSwitchover,\n      mplsLpsEventRevertiveMismatch,\n      mplsLpsEventProtecTypeMismatch,\n      mplsLpsEventCapabilitiesMismatch,\n      mplsLpsEventPathConfigMismatch,\n      mplsLpsEventFopNoResponse,\n      mplsLpsEventFopTimeout\n      }\n   STATUS  current\n   DESCRIPTION\n      \"Collection of objects needed to implement notifications.\"\n   ::= { mplsLpsGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- MPLS-LPS-MIB module ends END",
      "zh-CHS": "--MPLS-LPS-MIB模块结束"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "zh-CHS": "9. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection opens devices to attack. These are the tables and objects and their sensitivity/vulnerability:",
      "zh-CHS": "此MIB模块中定义了许多管理对象，其MAX-ACCESS子句为read-write和/或read-create。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作会使设备受到攻击。以下是表和对象及其敏感度/漏洞："
    },
    {
      "indent": 3,
      "text": "o The mplsLpsConfigTable is used to configure MPLS-TP linear protection domains. Improper manipulation of the objects in this table may result in different behaviors than what network operators originally intended, such as delaying traffic switching or causing a race condition with server-layer protection after network failure (mplsLpsConfigHoldOff), delaying or speeding up reversion after recovering from network failure (mplsLpsConfigWaitToRestore), unexpected traffic switching (mplsLpsConfigCommand), or the discontinuance of the operation of a protection switching control process (mplsLpsConfigMode, mplsLpsConfigProtectionType).",
      "zh-CHS": "o MPLSLPConfigTable用于配置MPLS-TP线性保护域。此表中对象的不当操作可能会导致不同于网络运营商最初预期的行为，例如延迟流量切换或在网络故障（MPLSLPConfigHoldoff）后造成服务器层保护的竞争条件，在从网络故障恢复后延迟或加速恢复（MPLSLPConfigWaitToRestore）、意外流量切换（MPLSLPConfigCommand）或保护切换控制进程（MPLSLPConfigMode、MPLSLPConfigProtectionType）操作的中断。"
    },
    {
      "indent": 3,
      "text": "o The mplsLpsMeConfigTable is used to assign each ME to either the working path or the protection path. Improper manipulation of this object may result in the discontinuance of the operation of a protection switching control process.",
      "zh-CHS": "o MPLSLPMEConfigTable用于将每个ME分配给工作路径或保护路径。对该对象的不当操作可能导致保护开关控制过程的操作中断。"
    },
    {
      "indent": 3,
      "text": "o The notification is controlled by the mplsLpsNotificationEnable object. In the case of the discontinuance of a protection switching control process, network operators may not be notified if the mplsLpsNotificationEnable object is compromised.",
      "zh-CHS": "o 通知由MPLSLPNotificationEnable对象控制。在保护切换控制过程中断的情况下，如果MPLSLPNotificationEnable对象受损，则可能不会通知网络运营商。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. These are the tables and objects and their sensitivity/vulnerability:",
      "zh-CHS": "在某些网络环境中，此MIB模块中的某些可读对象（即具有MAX-ACCESS而非not ACCESS的对象）可能被视为敏感或易受攻击。因此，在通过SNMP通过网络发送这些对象时，控制甚至获取和/或通知对这些对象的访问，甚至可能加密这些对象的值，这一点非常重要。以下是表和对象及其敏感度/漏洞："
    },
    {
      "indent": 3,
      "text": "o The mplsLpsStatusTable and the mplsLpsMeStatusTable collectively show the history and current status of the MPLS-TP linear protection domains. They can be used to estimate the performance and qualities of networks configured to use MPLS-TP linear protection. If an administrator does not want to reveal this information, then these tables should be considered sensitive/vulnerable.",
      "zh-CHS": "o MPLSLPSTATUSTABLE和MPLSLPMESTATUSTABLE共同显示MPLS-TP线性保护域的历史和当前状态。它们可用于评估配置为使用MPLS-TP线性保护的网络的性能和质量。如果管理员不想透露此信息，则应将这些表视为敏感/易受攻击。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "zh-CHS": "SNMPv3之前的SNMP版本未包含足够的安全性。即使网络本身是安全的（例如通过使用IPsec），也无法控制安全网络上的谁可以访问和获取/设置（读取/更改/创建/删除）此MIB模块中的对象。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD provide the security features described by the\nSNMPv3 framework (see [RFC3410]), and implementations claiming\ncompliance to the SNMPv3 standard MUST include full support for\nauthentication and privacy via the User-based Security Model (USM)\n[RFC3414] with the AES cipher algorithm [RFC3826].  Implementations\nMAY also provide support for the Transport Security Model (TSM)\n[RFC5591] in combination with a secure transport such as SSH\n[RFC5592] or TLS/DTLS [RFC6353].",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "此外，不建议部署SNMPv3之前的SNMP版本。相反，建议部署SNMPv3并启用加密安全性。然后，客户/运营商应负责确保授予访问此MIB模块实例权限的SNMP实体已正确配置为仅授予那些拥有确实获取或设置（更改/创建/删除）对象的合法权限的主体（用户）访问对象。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "zh-CHS": "10. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has assigned an OID of decimal 22 for the MPLS Linear Protection MIB module (MPLS-LPS-MIB) specified in this document in the \"MIB Transmission Group - MPLS STD MIB\" subregistry of the \"Internet-standard MIB - Transmission Group\" registry.",
      "zh-CHS": "IANA已在“互联网标准MIB-传输组”注册表的“MIB传输组-MPLS STD MIB”子区为本文件中指定的MPLS线性保护MIB模块（MPLS-LPS-MIB）分配了十进制22的OID。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "zh-CHS": "11. 工具书类"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "zh-CHS": "11.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, DOI 10.17487/RFC2578, April 1999, <http://www.rfc-editor.org/info/rfc2578>.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Ed.，Perkins，D.，Ed.，和J.Schoenwaeld，Ed.“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，DOI 10.17487/RFC2578，1999年4月<http://www.rfc-editor.org/info/rfc2578>."
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Textual Conventions for SMIv2\", STD 58, RFC 2579, DOI 10.17487/RFC2579, April 1999, <http://www.rfc-editor.org/info/rfc2579>.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Ed.，Perkins，D.，Ed.，和J.Schoenwaeld，Ed.“SMIv2的文本约定”，STD 58，RFC 2579，DOI 10.17487/RFC2579，1999年4月<http://www.rfc-editor.org/info/rfc2579>."
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Conformance Statements for SMIv2\", STD 58, RFC 2580, DOI 10.17487/RFC2580, April 1999, <http://www.rfc-editor.org/info/rfc2580>.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Ed.，Perkins，D.，Ed.，和J.Schoenwaeld，Ed.“SMIv2的一致性声明”，STD 58，RFC 2580，DOI 10.17487/RFC2580，1999年4月<http://www.rfc-editor.org/info/rfc2580>."
    },
    {
      "indent": 3,
      "text": "[RFC3289] Baker, F., Chan, K., and A. Smith, \"Management Information Base for the Differentiated Services Architecture\", RFC 3289, DOI 10.17487/RFC3289, May 2002, <http://www.rfc-editor.org/info/rfc3289>.",
      "zh-CHS": "[RFC3289]Baker，F.，Chan，K.和A.Smith，“差异化服务体系结构的管理信息库”，RFC 3289，DOI 10.17487/RFC3289，2002年5月<http://www.rfc-editor.org/info/rfc3289>."
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, DOI 10.17487/RFC3411, December 2002, <http://www.rfc-editor.org/info/rfc3411>.",
      "zh-CHS": "[RFC3411]Harrington，D.，Presohn，R.，和B.Wijnen，“描述简单网络管理协议（SNMP）管理框架的体系结构”，STD 62，RFC 3411，DOI 10.17487/RFC34112002年12月<http://www.rfc-editor.org/info/rfc3411>."
    },
    {
      "indent": 3,
      "text": "[RFC3414] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", STD 62, RFC 3414, DOI 10.17487/RFC3414, December 2002, <http://www.rfc-editor.org/info/rfc3414>.",
      "zh-CHS": "[RFC3414]Blumenthal，U.和B.Wijnen，“简单网络管理协议（SNMPv3）版本3的基于用户的安全模型（USM）”，STD 62，RFC 3414，DOI 10.17487/RFC3414，2002年12月<http://www.rfc-editor.org/info/rfc3414>."
    },
    {
      "indent": 3,
      "text": "[RFC3811] Nadeau, T., Ed., and J. Cucchiara, Ed., \"Definitions of Textual Conventions (TCs) for Multiprotocol Label Switching (MPLS) Management\", RFC 3811, DOI 10.17487/RFC3811, June 2004, <http://www.rfc-editor.org/info/rfc3811>.",
      "zh-CHS": "[RFC3811]Nadeau，T.，Ed.，和J.Cucchiara，Ed.，“多协议标签交换（MPLS）管理的文本约定（TC）定义”，RFC 3811，DOI 10.17487/RFC3811，2004年6月<http://www.rfc-editor.org/info/rfc3811>."
    },
    {
      "indent": 3,
      "text": "[RFC3826] Blumenthal, U., Maino, F., and K. McCloghrie, \"The Advanced Encryption Standard (AES) Cipher Algorithm in the SNMP User-based Security Model\", RFC 3826, DOI 10.17487/RFC3826, June 2004, <http://www.rfc-editor.org/info/rfc3826>.",
      "zh-CHS": "[RFC3826]Blumenthal，U.，Maino，F.，和K.McCloghrie，“基于SNMP用户的安全模型中的高级加密标准（AES）密码算法”，RFC 3826，DOI 10.17487/RFC3826，2004年6月<http://www.rfc-editor.org/info/rfc3826>."
    },
    {
      "indent": 3,
      "text": "[RFC5591] Harrington, D. and W. Hardaker, \"Transport Security Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 5591, DOI 10.17487/RFC5591, June 2009, <http://www.rfc-editor.org/info/rfc5591>.",
      "zh-CHS": "[RFC5591]Harrington，D.和W.Hardaker，“简单网络管理协议（SNMP）的传输安全模型”，STD 78，RFC 5591，DOI 10.17487/RFC55912009年6月<http://www.rfc-editor.org/info/rfc5591>."
    },
    {
      "indent": 3,
      "text": "[RFC5592] Harrington, D., Salowey, J., and W. Hardaker, \"Secure Shell Transport Model for the Simple Network Management Protocol (SNMP)\", RFC 5592, DOI 10.17487/RFC5592, June 2009, <http://www.rfc-editor.org/info/rfc5592>.",
      "zh-CHS": "[RFC5592]Harrington，D.，Salowey，J.，和W.Hardaker，“简单网络管理协议（SNMP）的安全外壳传输模型”，RFC 5592，DOI 10.17487/RFC5592，2009年6月<http://www.rfc-editor.org/info/rfc5592>."
    },
    {
      "indent": 3,
      "text": "[RFC6353] Hardaker, W., \"Transport Layer Security (TLS) Transport Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 6353, DOI 10.17487/RFC6353, July 2011, <http://www.rfc-editor.org/info/rfc6353>.",
      "zh-CHS": "[RFC6353]Hardaker，W.“简单网络管理协议（SNMP）的传输层安全（TLS）传输模型”，STD 78，RFC 6353，DOI 10.17487/RFC6353，2011年7月<http://www.rfc-editor.org/info/rfc6353>."
    },
    {
      "indent": 3,
      "text": "[RFC6378] Weingarten, Y., Ed., Bryant, S., Osborne, E., Sprecher, N., and A. Fulignoli, Ed., \"MPLS Transport Profile (MPLS-TP) Linear Protection\", RFC 6378, DOI 10.17487/RFC6378, October 2011, <http://www.rfc-editor.org/info/rfc6378>.",
      "zh-CHS": "[RFC6378]Y.Weingarten，Ed.，Bryant，S.，Osborne，E.，Sprecher，N.，和A.Fulignoli，Ed.，“MPLS传输模式（MPLS-TP）线性保护”，RFC 6378，DOI 10.17487/RFC6378，2011年10月<http://www.rfc-editor.org/info/rfc6378>."
    },
    {
      "indent": 3,
      "text": "[RFC7271] Ryoo, J., Ed., Gray, E., Ed., van Helvoort, H., D'Alessandro, A., Cheung, T., and E. Osborne, \"MPLS Transport Profile (MPLS-TP) Linear Protection to Match the Operational Expectations of Synchronous Digital Hierarchy, Optical Transport Network, and Ethernet Transport Network Operators\", RFC 7271, DOI 10.17487/RFC7271, June 2014, <http://www.rfc-editor.org/info/rfc7271>.",
      "zh-CHS": "[RFC7271]Ryoo，J.，Ed.，Gray，E.，Ed.，van Helvoort，H.，D'Alessandro，A.，Cheung，T.，和E.Osborne，“MPLS传输配置文件（MPLS-TP）线性保护，以满足同步数字体系、光传输网络和以太网传输网络运营商的运营期望”，RFC 7271，DOI 10.17487/RFC72712014年6月， <http://www.rfc-editor.org/info/rfc7271>."
    },
    {
      "indent": 3,
      "text": "[RFC7697] Pan, P., Aldrin, S., Venkatesan, M., Sampath, K., Nadeau, T., and S. Boutros, \"MPLS Transport Profile (MPLS-TP) Operations, Administration, and Maintenance (OAM) Identifiers Management Information Base (MIB)\", RFC 7697, DOI 10.17487/RFC7697, January 2016, <http://www.rfc-editor.org/info/rfc7697>.",
      "zh-CHS": "[RFC7697]Pan，P.，Aldrin，S.，Venkatesan，M.，Sampath，K.，Nadeau，T.，和S.Boutros，“MPLS传输配置文件（MPLS-TP）操作、管理和维护（OAM）标识符管理信息库（MIB）”，RFC 7697，DOI 10.17487/RFC7697，2016年1月<http://www.rfc-editor.org/info/rfc7697>."
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "zh-CHS": "11.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, DOI 10.17487/RFC3410, December 2002, <http://www.rfc-editor.org/info/rfc3410>.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.，和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 3410，DOI 10.17487/RFC3410，2002年12月<http://www.rfc-editor.org/info/rfc3410>."
    },
    {
      "indent": 3,
      "text": "[RFC3812] Srinivasan, C., Viswanathan, A., and T. Nadeau, \"Multiprotocol Label Switching (MPLS) Traffic Engineering (TE) Management Information Base (MIB)\", RFC 3812, DOI 10.17487/RFC3812, June 2004, <http://www.rfc-editor.org/info/rfc3812>.",
      "zh-CHS": "[RFC3812]Srinivasan，C.，Viswanathan，A.，和T.Nadeau，“多协议标签交换（MPLS）流量工程（TE）管理信息库（MIB）”，RFC 3812，DOI 10.17487/RFC3812，2004年6月<http://www.rfc-editor.org/info/rfc3812>."
    },
    {
      "indent": 3,
      "text": "[G8121] International Telecommunication Union, \"Characteristics of MPLS-TP equipment functional blocks\", ITU-T Recommendation G.8121/Y.1381, April 2016, <https://www.itu.int/rec/T-REC-G.8121/en>.",
      "zh-CHS": "[G8121]国际电信联盟，“MPLS-TP设备功能块的特性”，ITU-T建议G.8121/Y.1381，2016年4月<https://www.itu.int/rec/T-REC-G.8121/en>."
    },
    {
      "indent": 3,
      "text": "[G8151] International Telecommunication Union, \"Management aspects of the MPLS-TP network element\", ITU-T Recommendation G.8151/Y.1374, January 2015, <https://www.itu.int/rec/T-REC-G.8151/en>.",
      "zh-CHS": "[G8151]国际电信联盟，“MPLS-TP网元的管理方面”，ITU-T建议G.8151/Y.1374，2015年1月<https://www.itu.int/rec/T-REC-G.8151/en>."
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Joan Cucchiara for her review as MIB Doctor. Joan's detailed comments were of great help for improving the quality of this document.",
      "zh-CHS": "作者希望感谢Joan Cucchiara作为MIB医生的评论。琼的详细评论对提高这份文件的质量大有帮助。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank Loa Andersson and Adrian Farrel for their valuable comments and suggestions on this document.",
      "zh-CHS": "作者还要感谢Loa Andersson和Adrian Farrel对本文件提出的宝贵意见和建议。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "zh-CHS": "贡献者"
    },
    {
      "indent": 3,
      "text": "Vishwas Manral Nano Sec 599 Fairchild Drive Mountain View, CA United States of America",
      "zh-CHS": "Vishwas Manral Nano Sec 599飞兆半导体山景大道，美国加利福尼亚州"
    },
    {
      "indent": 3,
      "text": "Email: vishwas@nanosec.io",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Kingston Selvaraj IP Infusion RMZ Centennial Mahadevapura Post Bangalore 560048 India",
      "zh-CHS": "金斯敦Selvaraj IP输液RMZ印度班加罗尔马哈德瓦普拉邮政百周年纪念560048"
    },
    {
      "indent": 3,
      "text": "Email: kingstonsmiler@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Venkatesan Mahalingam Dell Technologies 5450 Great America Parkway Santa Clara, CA 95054 United States of America",
      "zh-CHS": "Venkatesan Mahalingam Dell Technologies 5450大美洲大道圣克拉拉，加利福尼亚州95054美利坚合众国"
    },
    {
      "indent": 3,
      "text": "Email: venkat.mahalingams@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Daniel King Old Dog Consulting United Kingdom",
      "zh-CHS": "丹尼尔·金英国老狗咨询公司"
    },
    {
      "indent": 3,
      "text": "Email: daniel@olddog.co.uk",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Sam Aldrin Google, Inc. 1600 Amphitheatre Parkway Mountain View, CA 94043 United States of America",
      "zh-CHS": "Sam Aldrin Google，Inc.美国加利福尼亚州山景大道1600号圆形剧场，邮编94043"
    },
    {
      "indent": 3,
      "text": "Email: aldrin.ietf@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jeong-dong Ryoo ETRI 218 Gajeong-ro Yuseong-gu, Daejeon 34129 South Korea",
      "zh-CHS": "韩国大田市正东良ETRI 218 Gajeong ro Yuseong gu，邮编：34129"
    },
    {
      "indent": 3,
      "text": "Email: ryoo@etri.re.kr",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}