{
  "title": {
    "text": "RFC 8328: Policy-Based Management Framework for the Simplified Use of Policy Abstractions (SUPA)",
    "zh-CHS": "RFC 8328"
  },
  "number": 8328,
  "created_at": "2021-10-29 11:19:01.383722+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                            W. Liu\nRequest for Comments: 8328                           Huawei Technologies\nCategory: Informational                                           C. Xie\nISSN: 2070-1721                                            China Telecom\n                                                            J. Strassner\n                                                          G. Karagiannis\n                                                     Huawei Technologies\n                                                                M. Klyus",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 53,
      "text": " J. Bi Tsinghua University Y. Cheng China Unicom D. Zhang Huawei Technologies March 2018",
      "zh-CHS": "J.毕清华大学Y.程中国联通D.张华为技术2018年3月"
    },
    {
      "indent": 12,
      "text": " Policy-Based Management Framework for the Simplified Use of Policy Abstractions (SUPA)",
      "zh-CHS": "简化策略抽象使用的基于策略的管理框架（SUPA）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Simplified Use of Policy Abstractions (SUPA) policy-based management framework defines base YANG data models to encode policy. These models point to device-, technology-, and service-specific YANG data models developed elsewhere. Policy rules within an operator's environment can be used to express high-level, possibly network-wide, policies to a network management function (within a controller, an orchestrator, or a network element). The network management function can then control the configuration and/or monitoring of network elements and services. This document describes the SUPA basic framework, its elements, and interfaces.",
      "zh-CHS": "策略抽象的简化使用（SUPA）基于策略的管理框架定义了用于编码策略的基本数据模型。这些模型指向其他地方开发的特定于设备、技术和服务的数据模型。运营商环境中的策略规则可用于向网络管理功能（在控制器、协调器或网元内）表示高级别（可能是网络范围）策略。然后，网络管理功能可以控制网络元件和服务的配置和/或监控。本文档描述了SUPA基本框架、其元素和接口。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "zh-CHS": "这是对RFC系列的贡献，独立于任何其他RFC流。RFC编辑器已选择自行发布此文档，并且未声明其对实现或部署的价值。RFC编辑批准发布的文件不适用于任何级别的互联网标准；见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8328.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问https://www.rfc-editor.org/info/rfc8328."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2018 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(https://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   4\n  2.1.  Requirements Language . . . . . . . . . . . . . . . . . .   4\n  2.2.  Abbreviations and Definitions . . . . . . . . . . . . . .   4\n3.  Framework for Generic Policy-Based Management . . . . . . . .   5\n  3.1.  Overview  . . . . . . . . . . . . . . . . . . . . . . . .   5\n  3.2.  Operation . . . . . . . . . . . . . . . . . . . . . . . .  10\n  3.3.  The GPIM and the EPRIM  . . . . . . . . . . . . . . . . .  10\n  3.4.  Creation of Generic YANG Modules  . . . . . . . . . . . .  10\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .  12\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  12\n6.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  12\n  6.1.  Normative References  . . . . . . . . . . . . . . . . . .  12\n  6.2.  Informative References  . . . . . . . . . . . . . . . . .  12\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  14\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  14\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  14",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Traffic flows over increasingly complex enterprise and service provider networks are becoming more and more important. Meanwhile, the rapid growth of this variety makes the task of network operations and management applications deploying new services much more difficult. Moreover, network operators want to deploy new services quickly and efficiently. Two possible mechanisms for dealing with this growing difficulty are 1) the use of software abstractions to simplify the design and configuration of monitoring and control operations and 2) the use of programmatic control over the configuration and operation of such networks. Policy-based management can be used to combine these two mechanisms into an extensible framework.",
      "zh-CHS": "通过日益复杂的企业和服务提供商网络的流量变得越来越重要。与此同时，这一种类的快速增长使得部署新服务的网络运营和管理应用程序的任务变得更加困难。此外，网络运营商希望快速高效地部署新服务。处理这一日益增长的困难的两种可能机制是：1）使用软件抽象来简化监控操作的设计和配置；2）对此类网络的配置和操作使用编程控制。基于策略的管理可用于将这两种机制组合成一个可扩展的框架。"
    },
    {
      "indent": 3,
      "text": "There is a set of policy rules within an operator's environment that defines how services are designed, delivered, and operated.",
      "zh-CHS": "运营商环境中有一组策略规则，定义了服务的设计、交付和运营方式。"
    },
    {
      "indent": 3,
      "text": "The SUPA (Simplified Use of Policy Abstractions) data model represents a high-level, possibly network-wide policy, which can be input to a network management function (within a controller, an orchestrator, or a network element). The network management function can then control the configuration and/or monitoring of network elements and services according to such policies.",
      "zh-CHS": "SUPA（策略抽象的简化使用）数据模型表示一个高级的，可能是网络范围的策略，可以输入到网络管理功能（在控制器、协调器或网元内）。然后，网络管理功能可以根据这些策略控制网络元件和服务的配置和/或监控。"
    },
    {
      "indent": 3,
      "text": "SUPA defines a Generic Policy Information Model (GPIM) [SUPA-INFO] for use in network operations and management applications. The GPIM defines concepts and terminology needed by policy management independent of the form and content of the policy rule. The Event-Condition-Action (ECA) Policy Rule Information Model (EPRIM) [SUPA-INFO] extends the GPIM by defining how to build policy rules according to the ECA paradigm.",
      "zh-CHS": "SUPA定义了一个通用策略信息模型（GPIM）[SUPA-INFO]，用于网络操作和管理应用程序。GPIM定义了独立于策略规则的形式和内容的策略管理所需的概念和术语。事件条件动作（ECA）策略规则信息模型（EPRIM）[SUPA-INFO]通过定义如何根据ECA范式构建策略规则来扩展GPIM。"
    },
    {
      "indent": 3,
      "text": "Both the GPIM and the EPRIM are targeted at controlling the configuration and monitoring of network elements throughout the service development and deployment life cycle. The GPIM and the EPRIM can both be translated into corresponding YANG [RFC6020] [RFC7950] modules that define policy concepts, terminology, and rules in a generic and interoperable manner; additional YANG modules may also be derived from the GPIM and/or EPRIM to manage specific functions.",
      "zh-CHS": "GPIM和EPRIM的目标都是在整个服务开发和部署生命周期中控制网络元素的配置和监视。GPIM和EPRIM都可以翻译成相应的[RFC6020][RFC7950]模块，这些模块以通用和互操作的方式定义策略概念、术语和规则；还可以从GPIM和/或EPRIM派生其他模块来管理特定功能。"
    },
    {
      "indent": 3,
      "text": "The key benefit of policy management is that it enables different network elements and services to be instructed to behave the same way, even if they are programmed differently. Management applications will benefit from using policy rules that enable scalable and consistent programmatic control over the configuration and monitoring of network elements and services.",
      "zh-CHS": "策略管理的主要好处是，它可以指示不同的网络元素和服务以相同的方式运行，即使它们的编程方式不同。管理应用程序将受益于使用策略规则，这些规则支持对网络元素和服务的配置和监控进行可扩展和一致的编程控制。"
    },
    {
      "indent": 3,
      "text": "Some typical and useful instances for authors to understand the applicability of SUPA, such as SNMP blocking upon load of link reaching a threshold and virtual matching migration upon the changing of user location, are described in [SUPA-APP].",
      "zh-CHS": "[SUPA-APP]中描述了一些典型和有用的实例，供作者理解SUPA的适用性，如链路负载达到阈值时的SNMP阻塞和用户位置变化时的虚拟匹配迁移。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "2.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”在所有大写字母出现时（如图所示）应按照BCP 14[RFC2119][RFC8174]所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2.2. Abbreviations and Definitions",
      "section_title": true,
      "zh-CHS": "2.2. 缩略语和定义"
    },
    {
      "indent": 3,
      "text": "SUPA: The Simplified Use of Policy Abstractions is a policy-based management framework that defines a data model to be used to represent high-level, possibly network-wide policies. This data model can be input to a network management function (within a controller, an orchestrator, or a network element).",
      "zh-CHS": "SUPA：策略抽象的简化使用是一个基于策略的管理框架，它定义了一个数据模型，用于表示高级的，可能是网络范围的策略。此数据模型可以输入到网络管理功能（在控制器、协调器或网元内）。"
    },
    {
      "indent": 3,
      "text": "YANG: An acronym for \"Yet Another Next Generation\". YANG is a data modeling language used to model configuration and state data manipulated by the Network Configuration Protocol (NETCONF), NETCONF remote procedure calls, and NETCONF notifications [RFC6020]",
      "zh-CHS": "杨：“下一代”的缩写。YANG是一种数据建模语言，用于对网络配置协议（NETCONF）、NETCONF远程过程调用和NETCONF通知[RFC6020]操作的配置和状态数据进行建模"
    },
    {
      "indent": 3,
      "text": "ECA: Event-Condition-Action is a shortcut for referring to the structure of active rules in event-driven architecture and active database systems.",
      "zh-CHS": "ECA：事件条件操作是引用事件驱动体系结构和活动数据库系统中活动规则结构的快捷方式。"
    },
    {
      "indent": 3,
      "text": "EMS: An Element Management System is software used to monitor and control network elements (devices) in telecommunications.",
      "zh-CHS": "EMS：网元管理系统是用于监控电信网络中的网元（设备）的软件。"
    },
    {
      "indent": 3,
      "text": "NMS: A Network Management System is a set of hardware and/or software tools that allow an IT professional to supervise the individual components of a network within a larger network management framework.",
      "zh-CHS": "NMS：网络管理系统是一组硬件和/或软件工具，允许IT专业人员在更大的网络管理框架内监控网络的各个组件。"
    },
    {
      "indent": 3,
      "text": "OSS: An Operations/Operational Support System is a computer system used by telecommunications service providers to manage their networks (e.g., telephone networks).",
      "zh-CHS": "OSS：运营/运营支持系统是电信服务提供商用来管理其网络（如电话网络）的计算机系统。"
    },
    {
      "indent": 3,
      "text": "BSS: A Business Support System is used to support various end-to-end telecommunication services.",
      "zh-CHS": "BSS：业务支持系统用于支持各种端到端电信服务。"
    },
    {
      "indent": 3,
      "text": "GPIM: A Generic Policy Information Model defines concepts and terminology needed by policy management independent of the form and content of the policy rule.",
      "zh-CHS": "GPIM：通用策略信息模型定义了策略管理所需的概念和术语，与策略规则的形式和内容无关。"
    },
    {
      "indent": 3,
      "text": "EPRIM: An ECA Policy Rule Information Model extends the GPIM by defining how to build policy rules according to the ECA paradigm.",
      "zh-CHS": "EPRIM：ECA策略规则信息模型通过定义如何根据ECA范式构建策略规则来扩展GPIM。"
    },
    {
      "indent": 3,
      "text": "GPDM: Generic Policy Data Models [SUPA-DATA] are created from the GPIM. These YANG data model policies are used to control the configuration of network elements that model the service(s) to be managed. The relationship between the information model (IM) and data model (DM) can be founded in [RFC3444].",
      "zh-CHS": "GPDM：通用策略数据模型[SUPA-Data]是从GPIM创建的。这些数据模型策略用于控制对要管理的服务建模的网络元素的配置。信息模型（IM）和数据模型（DM）之间的关系可在[RFC3444]中找到。"
    },
    {
      "indent": 3,
      "text": "Declarative Policy: Policies that specify the goals to be achieved but not how to achieve those goals (also called \"intent-based\" policies). Please note that declarative policies are out of scope for the initial phase of SUPA.",
      "zh-CHS": "声明性策略：指定要实现的目标但不指定如何实现这些目标的策略（也称为“基于意图的”策略）。请注意，声明性策略超出了SUPA初始阶段的范围。"
    },
    {
      "indent": 0,
      "text": "3. Framework for Generic Policy-Based Management",
      "section_title": true,
      "zh-CHS": "3. 基于策略的通用管理框架"
    },
    {
      "indent": 3,
      "text": "This section briefly describes the design and operation of the SUPA policy-based management framework.",
      "zh-CHS": "本节简要介绍SUPA基于策略的管理框架的设计和操作。"
    },
    {
      "indent": 0,
      "text": "3.1. Overview",
      "section_title": true,
      "zh-CHS": "3.1. 概述"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows a simplified functional architecture of how SUPA is used to define policies for creating snippets of network element configurations. SUPA uses the GPIM to define a consensual vocabulary that different actors can use to interact with network elements and services. The EPRIM defines a generic structure for imperative policies. The GPIM, and/or the combination of the GPIM and the EPRIM, is converted to generic YANG modules.",
      "zh-CHS": "图1显示了一个简化的功能体系结构，说明了如何使用SUPA定义用于创建网元配置片段的策略。SUPA使用GPIM定义了一个共识词汇表，不同的参与者可以使用该词汇表与网络元素和服务进行交互。EPRIM为强制策略定义了通用结构。GPIM和/或GPIM和EPRIM的组合转换为通用模块。"
    },
    {
      "indent": 3,
      "text": "In one possible approach (shown with asterisks in Figure 1), SUPA Generic Policy and SUPA ECA Policy YANG modules together with the Resource and Service YANG data models specified in the IETF (which define the specific elements that will be controlled by policies) are used by the Service Interface Logic. This Service Interface Logic creates appropriate input mechanisms for the operator to define policies (e.g., a web form or a script) for creating and managing the network configuration. The operator interacts with the interface, and the policies input by operators are then translated into configuration snippets.",
      "zh-CHS": "在一种可能的方法中（如图1中的星号所示），服务接口逻辑使用SUPA通用策略和SUPA ECA策略YANG模块以及IETF中指定的资源和服务YANG数据模型（定义将由策略控制的特定元素）。此服务接口逻辑为操作员创建适当的输入机制，以定义用于创建和管理网络配置的策略（例如，web表单或脚本）。操作员与接口交互，然后将操作员输入的策略转换为配置片段。"
    },
    {
      "indent": 3,
      "text": "Note that the Resource and Service YANG data models may not exist. In this case, the SUPA generic policy YANG modules serve as an extensible basis to develop new YANG data models for the Service Interface Logic. This transfers the work specified by the Resource",
      "zh-CHS": "请注意，资源和服务数据模型可能不存在。在这种情况下，SUPA通用策略模块作为可扩展的基础，为服务接口逻辑开发新的YANG数据模型。这将传输资源指定的工作"
    },
    {
      "indent": 3,
      "text": "and Service YANG data models specified in the IETF into the Service Interface Logic.",
      "zh-CHS": "并将IETF中指定的服务数据模型转换为服务接口逻辑。"
    },
    {
      "indent": 4,
      "text": "                    +---------------------+\n+----------+       \\|        SUPA         |\n|   IETF   |---+----+  Information Models |\n+----------+   |   /|    GPIM and EPRIM   |\n               |    +---------+-----------+\n   Assignments |              | Defines Policy Concepts\n   and Managed |             \\|/\n     Content   |    +---------+-----------+\n               |   \\|    SUPA Generic     |\n               +----+    & ECA Policy     |\n                   /|    YANG modules     |\n                    +---------+-----------+\n                              *  Possible Approach\n+-----------------------------*-----------------------------+\n|  Management System          *                             |\n|                            \\*/                            |\n|            Fills  +---------+---------+  +-------------+  |\n| +--------+ Forms \\| Service Interface |/ |Resource and |/ | +----+\n| |Operator|--------+       Logic       +--|Service YANG |----|IETF|\n| +--------+ Runs  /| (locally defined  |\\ | data models |\\ | +----+\n|           scripts |forms, scripts,...)|  +-------------+  |\n|                   +---------+---------+                   |\n|                            \\|/                            |\n|                     +-------+--------+                    |\n|                     |  Local Devices |                    |\n|                     | and Management |                    |\n|                     |     Systems    |                    |\n|                     +----------------+                    |\n+-----------------------------------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Figure 1: SUPA Framework",
      "zh-CHS": "图1:SUPA框架"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the SUPA Framework at a high level of abstraction. The operator actor can interact with SUPA in other ways not shown in Figure 1. In addition, other actors (e.g., an application developer) that can interact with SUPA are not shown for simplicity.",
      "zh-CHS": "图1显示了高级抽象的SUPA框架。operator-actor可以以图1中未显示的其他方式与SUPA交互。此外，为了简单起见，没有显示可以与SUPA交互的其他参与者（例如，应用程序开发人员）。"
    },
    {
      "indent": 3,
      "text": "The EPRIM defines an ECA policy as an example of imperative policies. An ECA policy rule is activated when its event clause is true; the condition clause is then evaluated and, if true, signals the execution of one or more actions in the action clause. This type of policy explicitly defines the current and desired states of the system being managed. Imperative policy rules require additional management functions, which are explained in Section 3.2.",
      "zh-CHS": "EPRIM将ECA政策定义为强制性政策的示例。ECA策略规则在其事件子句为true时激活；然后计算condition子句，如果为true，则表示action子句中一个或多个操作的执行。这种类型的策略明确定义所管理系统的当前和所需状态。强制性政策规则需要额外的管理职能，如第3.2节所述。"
    },
    {
      "indent": 3,
      "text": "Figure 2 shows how the SUPA Policy Model is used to create policy data models step-by-step and how the policy rules are used to communicate among various network management functions located on different layers.",
      "zh-CHS": "图2显示了如何使用SUPA策略模型逐步创建策略数据模型，以及如何使用策略规则在位于不同层的各种网络管理功能之间进行通信。"
    },
    {
      "indent": 3,
      "text": "The GPIM is used to construct policies. The GPIM defines generic policy concepts as well as two types of policies: ECA policy rules and declarative policy statements.",
      "zh-CHS": "GPIM用于构造策略。GPIM定义了通用策略概念以及两种类型的策略：ECA策略规则和声明性策略语句。"
    },
    {
      "indent": 3,
      "text": "A set of Generic Policy Data Models (GPDM) are then created from the GPIM. These YANG data model policies are then used to control the configuration of network elements that model the service(s) to be managed.",
      "zh-CHS": "然后从GPIM创建一组通用策略数据模型（GPDM）。然后，这些数据模型策略用于控制对要管理的服务建模的网络元素的配置。"
    },
    {
      "indent": 3,
      "text": "Resource and Service YANG Data Models: Models of the service as well as physical and virtual network topology including the resource attributes (e.g., data rate or latency of links) and operational parameters needed to support service deployment over the network topology.",
      "zh-CHS": "资源和服务数据模型：服务以及物理和虚拟网络拓扑的模型，包括支持在网络拓扑上部署服务所需的资源属性（例如，链路的数据速率或延迟）和操作参数。"
    },
    {
      "indent": 0,
      "text": "                              |  SUPA Policy Model\n                              |\n                              |  +----------------------------------+\n                              |  | Generic Policy Information Model |\n                              |  +----------------------------------+\n                              |        D                 D\n                              |        D   +-------------v-------------+\n +----------------------+     |        D   |   ECA Policy Rule         |\n | OSS/BSS/Orchestrator <--+  |        D   |   Information Model       |\n +----------^-----------+  |  |        D   +---------------------------+\n            C              |  |        D                          D\n            C              |  |  +----+D+------------------------+D+---+\n            C              +-----+     D  SUPA Policy Data Model  D    |\n +----------v-----------+     |  | ----v-----------------------+  D    |\n |  EMS/NMS/Controller  <--------+ | Generic Policy Data Model |  D    |\n +----------^-----------+     |  | ----------------------------+  D    |\n            C              +-----+              D                 D    |\n            C              |  |  |    +---------v-----------------v--+ |\n +----------v-----------+  |  |  |    |  ECA Policy Rule Data Model  | |\n |  Network Element     <--+  |  |    +------------------------------+ |\n +----------------------+     |  +-------------------------------------+\n                              |\n                              |\nLegend:\nThe double-headed arrow with Cs = \"communication\"\nThe arrow with Ds = \"derived from\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Figure 2: SUPA Policy Model Framework",
      "zh-CHS": "图2:SUPA策略模型框架"
    },
    {
      "indent": 3,
      "text": "SUPA Policy Model: This model represents one or more policy modules that contain the following entities:",
      "zh-CHS": "SUPA策略模型：此模型表示包含以下实体的一个或多个策略模块："
    },
    {
      "indent": 6,
      "text": "Generic Policy Information Model: A model for defining policy rules that are independent of data repository, data definition, query, implementation language, and protocol. This model is abstract and is used for design; it MUST be turned into a data model for implementation.",
      "zh-CHS": "通用策略信息模型：用于定义独立于数据存储库、数据定义、查询、实现语言和协议的策略规则的模型。该模型是抽象的，用于设计；它必须转化为一个数据模型来实现。"
    },
    {
      "indent": 6,
      "text": "Generic Policy Data Model: A model of policy rules that are dependent on data repository, data definition, query, implementation language, and protocol.",
      "zh-CHS": "通用策略数据模型：依赖于数据存储库、数据定义、查询、实现语言和协议的策略规则模型。"
    },
    {
      "indent": 6,
      "text": "ECA Policy Rule Information Model (EPRIM): This model represents a policy rule as a statement that consists of an event clause, a condition clause, and an action clause. This type of policy rule explicitly defines the current and desired states of the system being managed. This model is abstract and is used for design; it MUST be turned into a data model for implementation.",
      "zh-CHS": "ECA策略规则信息模型（EPRIM）：该模型将策略规则表示为一条语句，该语句由事件子句、条件子句和动作子句组成。这种类型的策略规则明确定义所管理系统的当前和所需状态。该模型是抽象的，用于设计；它必须转化为一个数据模型来实现。"
    },
    {
      "indent": 6,
      "text": "ECA Policy Rule Data Model: A model of policy rules, derived from EPRIM, where each policy rule consists of an event clause, a condition clause, and an action clause.",
      "zh-CHS": "ECA策略规则数据模型：从EPRIM派生的策略规则模型，其中每个策略规则由一个事件子句、一个条件子句和一个动作子句组成。"
    },
    {
      "indent": 6,
      "text": "EMS/NMS/Controller: This represents one or more entities that are able to control the operation and management of a network infrastructure (e.g., a network topology that consists of network elements).",
      "zh-CHS": "EMS/NMS/控制器：表示一个或多个能够控制网络基础设施（例如，由网元组成的网络拓扑）的操作和管理的实体。"
    },
    {
      "indent": 6,
      "text": "Network Element (NE): An element that can interact with the local or remote EMS/NMS/Controller in order to exchange information, such as configuration information, policy-enforcement capabilities, and network status.",
      "zh-CHS": "网元（NE）：可以与本地或远程EMS/NMS/控制器交互以交换信息（如配置信息、策略实施能力和网络状态）的元素。"
    },
    {
      "indent": 3,
      "text": "Relationships among Policy, Service, and Resource models are illustrated in Figure 3.",
      "zh-CHS": "策略、服务和资源模型之间的关系如图3所示。"
    },
    {
      "indent": 9,
      "text": "+---------------+                   +----------------+\n|    Policy     |         (1)       |    Service     |\n|               |*******************|                |\n|   ( SUPA )    |*******************| ( L3SM, ... )  |\n+---------------+                   +----------------+\n       **                                  /*\\\n         **                                *\n           **                            *\n        (2)  **                        *   (3)\n               **                    *\n                 **                *\n                   **            *\n               +-------------------+\n               |    Resource       |\n               |                   |\n               | (Inventory, ... ) |\n               +-------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Figure 3: Relationship among Policy, Service, and Resource Models",
      "zh-CHS": "图3：策略、服务和资源模型之间的关系"
    },
    {
      "indent": 3,
      "text": "In Figure 3:",
      "zh-CHS": "在图3中："
    },
    {
      "indent": 3,
      "text": "(1) The policy manages and can adjust service behavior as necessary (1:1..n). In addition, data from resources and services are used to select and/or modify policies during runtime.",
      "zh-CHS": "(1) 该策略管理并可以根据需要调整服务行为（1:1..n）。此外，来自资源和服务的数据用于在运行时选择和/或修改策略。"
    },
    {
      "indent": 3,
      "text": "(2) The policy manages and can adjust resource behavior as necessary (1:1..n).",
      "zh-CHS": "(2) 策略管理资源行为，并可根据需要调整资源行为（1:1..n）。"
    },
    {
      "indent": 3,
      "text": "(3) Resource hosts service; changing resources may change service behavior as necessary.",
      "zh-CHS": "(3) 资源主机服务；更改资源可能会根据需要更改服务行为。"
    },
    {
      "indent": 3,
      "text": "Policies are used to control the management of resources and services, while data from resources and services are used to select and/or modify policies during runtime. More importantly, policies can be used to manage how resources are allocated and assigned to services. This enables a single policy to manage one or multiple services and resources as well as their dependencies. The use of (1:1..n) in point (1) and (2) above show that one policy rule is able to manage and can adjust one or multiple services/resources. Lines (1) and (2) (connecting policy to resource and policy to service) are the same, and line (3) (connecting resource to service) is different as it's navigable only from resource to service.",
      "zh-CHS": "策略用于控制资源和服务的管理，而来自资源和服务的数据用于在运行时选择和/或修改策略。更重要的是，可以使用策略来管理资源如何分配和分配给服务。这使单个策略能够管理一个或多个服务和资源及其依赖关系。上面第（1）点和第（2）点中（1:1..n）的使用表明一个策略规则能够管理并调整一个或多个服务/资源。第（1）行和第（2）行（将策略连接到资源和策略连接到服务）是相同的，第（3）行（将资源连接到服务）是不同的，因为它只能在资源和服务之间导航。"
    },
    {
      "indent": 0,
      "text": "3.2. Operation",
      "section_title": true,
      "zh-CHS": "3.2. 活动"
    },
    {
      "indent": 3,
      "text": "SUPA can be used to define various types of policies, including policies that affect services and/or the configuration of individual network elements or groups of network elements. SUPA can be used by a centralized and/or distributed set of entities for creating, managing, interacting with, and retiring policy rules.",
      "zh-CHS": "SUPA可用于定义各种类型的策略，包括影响服务和/或单个网元或网元组配置的策略。SUPA可由一组集中和/或分布式的实体用于创建、管理、与策略规则交互和停用策略规则。"
    },
    {
      "indent": 3,
      "text": "The SUPA scope is limited to policy information and data models. SUPA does not define network resource data models or network service data models; both are out of scope. Instead, SUPA makes use of network resource data models defined by other working groups or Standards Development Organizations (SDOs).",
      "zh-CHS": "SUPA范围仅限于策略信息和数据模型。SUPA未定义网络资源数据模型或网络服务数据模型；两者都超出了范围。相反，SUPA使用由其他工作组或标准开发组织（SDO）定义的网络资源数据模型。"
    },
    {
      "indent": 3,
      "text": "Declarative policies are out of scope for the initial phase of SUPA.",
      "zh-CHS": "声明性策略超出了SUPA初始阶段的范围。"
    },
    {
      "indent": 0,
      "text": "3.3. The GPIM and the EPRIM",
      "section_title": true,
      "zh-CHS": "3.3. GPIM和EPRIM"
    },
    {
      "indent": 3,
      "text": "The GPIM provides a shared vocabulary for representing concepts that are common to different types of policies, but which are independent of language, protocol, repository, and level of abstraction. Hence, the GPIM defines concepts and vocabulary needed by policy management systems independent of the form and content of the policy. The EPRIM is a more specific model that refines the GPIM to specify policy rules in an ECA form.",
      "zh-CHS": "GPIM提供了一个共享词汇表，用于表示不同类型的策略所共有的概念，但这些概念独立于语言、协议、存储库和抽象级别。因此，GPIM定义了与策略的形式和内容无关的策略管理系统所需的概念和词汇表。EPRIM是一个更具体的模型，它细化了GPIM，以ECA形式指定策略规则。"
    },
    {
      "indent": 3,
      "text": "This enables different policies at different levels of abstraction to form a continuum, where more abstract policies can be translated into more concrete policies and vice versa. For example, the information model can be extended by generalizing concepts from an existing data model into the GPIM; the GPIM extensions can then be used by other data models.",
      "zh-CHS": "这使得不同抽象级别的不同策略能够形成一个连续统一体，在这个连续统一体中，更多抽象的策略可以转化为更具体的策略，反之亦然。例如，可以通过将现有数据模型中的概念概括到GPIM中来扩展信息模型；GPIM扩展可以被其他数据模型使用。"
    },
    {
      "indent": 0,
      "text": "3.4. Creation of Generic YANG Modules",
      "section_title": true,
      "zh-CHS": "3.4. 泛型模块的创建"
    },
    {
      "indent": 3,
      "text": "An information model is abstract. As such, it cannot be directly instantiated (i.e., objects cannot be created directly from it). Therefore, both the GPIM and the combination of the GPIM and the EPRIM are translated into generic YANG modules.",
      "zh-CHS": "信息模型是抽象的。因此，它不能直接实例化（即，不能直接从中创建对象）。因此，GPIM以及GPIM和EPRIM的组合都被转换为通用模块。"
    },
    {
      "indent": 3,
      "text": "SUPA will provide guidelines for translating the GPIM (or the combination of the GPIM and the EPRIM) into concrete YANG data models that define how to manage and communicate policies between systems. Multiple imperative policy YANG data models may be instantiated from the GPIM (or the combination of the GPIM and the EPRIM). In particular, SUPA will specify a set of YANG data models that will consist of a base policy model for representing policy management concepts independent of the type or structure of a policy; it will",
      "zh-CHS": "SUPA将提供将GPIM（或GPIM和EPRIM的组合）转换为具体数据模型的指南，这些数据模型定义了如何在系统之间管理和沟通策略。可以从GPIM（或GPIM和EPRIM的组合）实例化多个强制策略数据模型。特别是，SUPA将指定一组数据模型，其中包括一个基本策略模型，用于表示独立于策略类型或结构的策略管理概念；会的"
    },
    {
      "indent": 3,
      "text": "also specify an extension for defining policy rules according to the ECA paradigm. (Note: This means that policies can be defined using the GPIM directly, or using the combination of the GPIM and the EPRIM. If you use only the GPIM, you get a technology- and vendor-independent information model that you are free to map to the data model of your choice; note that the structure of a policy is NOT defined. If you use the GPIM and the EPRIM, you get a technology-and vendor-independent information model that defines policies as an ECA policy rule (i.e., imperative).)",
      "zh-CHS": "还指定一个扩展，用于根据ECA范例定义策略规则。（注意：这意味着可以直接使用GPIM来定义策略，或者使用GPIM和EPRIM的组合来定义策略。如果仅使用GPIM，您将获得一个独立于技术和供应商的信息模型，您可以自由地映射到您选择的数据模型；请注意，策略的结构没有定义。如果您使用GPIM和EPRIMEPRIM提供了一个独立于技术和供应商的信息模型，该模型将策略定义为ECA策略规则（即命令式）"
    },
    {
      "indent": 3,
      "text": "The process of developing the GPIM, the EPRIM, and the derived/ translated YANG data models is realized following the sequence shown below. After completing this process and, if the implementation of the YANG data models requires it, the GPIM and EPRIM and the derived/ translated YANG data models are updated and synchronized.",
      "zh-CHS": "开发GPIM、EPRIM和导出/转换的YANG数据模型的过程如下所示。完成此过程后，如果YANG数据模型的实现需要，GPIM和EPRIM以及派生/转换的YANG数据模型将更新和同步。"
    },
    {
      "indent": 6,
      "text": "(1)=>(2)=>(3)=>(4)=>(3')=>(2')=>(1')",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Where:\n(1)=GPIM\n(2)=EPRIM\n(3)=YANG data models\n(4)=Implementation\n(3')=update of YANG data models\n(2')=update of EPRIM\n(1')=update of GPIM",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The YANG module derived from the GPIM contains concepts and terminology for the common operation and administration of policy-based systems as well as an extensible structure for policy rules of different paradigms. The YANG module derived from the EPRIM extends the generic nature of the GPIM by representing policies using an ECA structure.",
      "zh-CHS": "源于GPIM的YANG模块包含基于策略的系统的通用操作和管理的概念和术语，以及不同范例的策略规则的可扩展结构。源自EPRIM的YANG模块通过使用ECA结构表示策略，扩展了GPIM的通用性。"
    },
    {
      "indent": 3,
      "text": "The above sequence allows for the addition of new model elements, as well as the editing of existing ones, in the GPIM and EPRIM. In practice, the implementation sequence may be much simpler. Specifically, it is unlikely that the GPIM will need to be changed. In addition, changes to the EPRIM will likely be focused on fine-tuning the behavior offered by a specific set of model elements.",
      "zh-CHS": "上述顺序允许在GPIM和EPRIM中添加新的模型元素，以及编辑现有的元素。实际上，实现顺序可能要简单得多。具体而言，不太可能需要更改GPIM。此外，对EPRIM的更改可能集中于微调一组特定模型元素提供的行为。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This informational document presents the framework and workflow of SUPA as well as an explanation on the relationship of policy, service and resources. This document does not introduce any new security issues, and the framework has no security impact on the Internet. The same considerations are relevant as those for the base NETCONF protocol (see Section 9 in [RFC6241]).",
      "zh-CHS": "本信息性文档介绍了SUPA的框架和工作流程，并解释了政策、服务和资源之间的关系。本文档没有引入任何新的安全问题，并且该框架对Internet没有安全影响。与基本NETCONF协议相关的注意事项相同（参见[RFC6241]中的第9节）。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "zh-CHS": "本文档没有IANA操作。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<https://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "zh-CHS": "[RFC8174]Leiba，B.，“RFC 2119关键词中大写与小写的歧义”，BCP 14，RFC 8174，DOI 10.17487/RFC8174，2017年5月<https://www.rfc-editor.org/info/rfc8174>."
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3444] Pras, A. and J. Schoenwaelder, \"On the Difference between Information Models and Data Models\", RFC 3444, DOI 10.17487/RFC3444, January 2003, <https://www.rfc-editor.org/info/rfc3444>.",
      "zh-CHS": "[RFC3444]Pras，A.和J.Schoenwaeld，“关于信息模型和数据模型之间的差异”，RFC 3444，DOI 10.17487/RFC3444，2003年1月<https://www.rfc-editor.org/info/rfc3444>."
    },
    {
      "indent": 3,
      "text": "[RFC6020] Bjorklund, M., Ed., \"YANG - A Data Modeling Language for the Network Configuration Protocol (NETCONF)\", RFC 6020, DOI 10.17487/RFC6020, October 2010, <https://www.rfc-editor.org/info/rfc6020>.",
      "zh-CHS": "[RFC6020]Bjorklund，M.，Ed.“YANG-网络配置协议的数据建模语言（NETCONF）”，RFC 6020，DOI 10.17487/RFC6020，2010年10月<https://www.rfc-editor.org/info/rfc6020>."
    },
    {
      "indent": 3,
      "text": "[RFC6241] Enns, R., Ed., Bjorklund, M., Ed., Schoenwaelder, J., Ed., and A. Bierman, Ed., \"Network Configuration Protocol (NETCONF)\", RFC 6241, DOI 10.17487/RFC6241, June 2011, <https://www.rfc-editor.org/info/rfc6241>.",
      "zh-CHS": "[RFC6241]Enns，R.，Ed.，Bjorklund，M.，Ed.，Schoenwaeld，J.，Ed.，和A.Bierman，Ed.，“网络配置协议（NETCONF）”，RFC 6241，DOI 10.17487/RFC6241，2011年6月<https://www.rfc-editor.org/info/rfc6241>."
    },
    {
      "indent": 3,
      "text": "[RFC7950] Bjorklund, M., Ed., \"The YANG 1.1 Data Modeling Language\", RFC 7950, DOI 10.17487/RFC7950, August 2016, <https://www.rfc-editor.org/info/rfc7950>.",
      "zh-CHS": "[RFC7950]Bjorklund，M.，Ed.“YANG 1.1数据建模语言”，RFC 7950，DOI 10.17487/RFC7950，2016年8月<https://www.rfc-editor.org/info/rfc7950>."
    },
    {
      "indent": 3,
      "text": "[SUPA-APP] Cheng, Y., Liu, D., Fu, B., Zhang, D., and N. Vadrevu, \"Applicability of SUPA\", Work in Progress, draft-cheng-supa-applicability-01, March 2017.",
      "zh-CHS": "[SUPA-APP]Cheng，Y.，Liu，D.，Fu，B.，Zhang，D.，和N.Vadrevu，“SUPA的适用性”，正在进行的工作，草稿-Cheng-SUPA-Applicability-01，2017年3月。"
    },
    {
      "indent": 3,
      "text": "[SUPA-DATA] Halpern, J., Strassner, J., and S. Van der Meer, \"Generic Policy Data Model for Simplified Use of Policy Abstractions (SUPA)\", Work in Progress, draft-ietf-supa-generic-policy-data-model-04, June 2017.",
      "zh-CHS": "[SUPA-DATA]Halpern，J.，Strassner，J.，和S.Van der Meer，“简化政策摘要使用的通用政策数据模型（SUPA）”，正在进行的工作，草案-ietf-SUPA-Generic-Policy-DATA-Model-042017年6月。"
    },
    {
      "indent": 3,
      "text": "[SUPA-FRAME] Zhou, C., Contreras, L., Sun, Q., and P. Yegani, \"The Framework of Simplified Use of Policy Abstractions (SUPA)\", Work in Progress, draft-zhou-supa-framework-02, May 2015.",
      "zh-CHS": "[SUPA-FRAME]Zhou，C.，Contreras，L.，Sun，Q.，和P.Yegani，“简化政策摘要使用框架（SUPA）”，正在进行的工作，草案Zhou-SUPA-FRAME-02，2015年5月。"
    },
    {
      "indent": 3,
      "text": "[SUPA-INFO] Strassner, J., Halpern, J., and S. Meer, \"Generic Policy Information Model for Simplified Use of Policy Abstractions (SUPA)\", Work in Progress, draft-ietf-supa-generic-policy-info-model-03, May 2017.",
      "zh-CHS": "[SUPA-INFO]Strassner，J.，Halpern，J.，和S.Meer，“简化政策摘要使用的通用政策信息模型（SUPA）”，正在进行的工作，草稿-ietf-SUPA-Generic-Policy-INFO-Model-03，2017年5月。"
    },
    {
      "indent": 3,
      "text": "[SUPA-STATE] Karagiannis, G., Strassner, J., Sun, Q., Contreras, L., Yegani, P., and J. Bi, \"Problem Statement for Simplified Use of Policy Abstractions (SUPA)\", Work in Progress, draft-karagiannis-supa-problem-statement-07, June 2015.",
      "zh-CHS": "[SUPA-STATE]Karagiannis，G.，Strassner，J.，Sun，Q.，Contreras，L.，Yegani，P.，和J.Bi，“简化政策摘要使用的问题陈述（SUPA）”，正在进行的工作，草稿-Karagiannis-SUPA-Problem-Statement-072015年6月。"
    },
    {
      "indent": 3,
      "text": "[SUPA-VALUE] Klyus, M., Strassner, J., Liu, W., Karagiannis, G., and J. Bi, \"SUPA Value Proposition\", Work in Progress, draft-klyus-supa-value-proposition-00, March 2016.",
      "zh-CHS": "[SUPA-VALUE]Klyus，M.，Strassner，J.，Liu，W.，Karagiannis，G.，和J.Bi，“SUPA价值主张”，在建工程，草稿-Klyus-SUPA-VALUE-POLITION-00，2016年3月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "This document has benefited from reviews, suggestions, comments, and proposed text provided by the following members, listed in alphabetical order: Andy Bierman, Marc Blanchet, Mohamed Boucadair, Scott O. Bradner, Scott Cadzow, Zhen Cao, Vikram Choudhary, Benoit Claise, Spencer Dawkins, Mehmet Ersue, Ian Farrer, Fernando Gont, Joel Halpern, Jonathan Hansford, Jing Huang, Xing Li, Marco Liebsch, Diego R. Lopez, Johannes Merkle, Marie-Jose Montpetit, Kostas Pentikousis, Simon Perreault, Hosnieh Rafiee, Raghav Rao, Jose Saldana, Jon Saperia, Tom Taylor, Jean Francois Tremblay, Tina Tsou, Eric Voit, Gunter Wang, Yangyang Wang, Bert Wijnen, and Tianran Zhou.",
      "zh-CHS": "本文件受益于以下成员提供的审查、建议、评论和拟议文本，按字母顺序排列：安迪·比尔曼、马克·布兰切特、穆罕默德·布卡代尔、斯科特·O·布拉德纳、斯科特·卡佐夫、曹真、维克拉姆·乔杜里、贝诺特·克莱斯、斯宾塞·道金斯、迈赫迈特·厄苏、伊恩·法勒、费尔南多·冈特、约尔·哈尔伯恩、，乔纳森·汉斯福德、黄静、邢莉、马可·利伯什、迭戈·R·洛佩兹、约翰内斯·梅克尔、玛丽·何塞·蒙佩蒂、科斯塔斯·彭蒂库斯、西蒙·佩雷尔特、霍斯尼·拉菲、拉加夫·拉奥、何塞·萨尔达纳、乔恩·萨佩里亚、汤姆·泰勒、让·弗朗索瓦·特雷布雷、蒂娜·邹、埃里克·沃伊特、王冈特、王阳阳、伯特·维恩和周天然。"
    },
    {
      "indent": 3,
      "text": "Part of the initial draft of this document was picked up from previous documents: [SUPA-VALUE], [SUPA-STATE], and [SUPA-FRAME]. We appreciatively acknowledge the authors, contributors, and acknowledged parties of those documents.",
      "zh-CHS": "本文件初稿的一部分取自以前的文件：[SUPA-VALUE]、[SUPA-STATE]和[SUPA-FRAME]。我们感谢这些文件的作者、撰稿人和各方。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "zh-CHS": "贡献者"
    },
    {
      "indent": 3,
      "text": "The following people contributed to the creation of this document, listed in alphabetical order:",
      "zh-CHS": "以下人员参与了本文件的创建，按字母顺序列出："
    },
    {
      "indent": 6,
      "text": "Luis M. Contreras, Telefonica I+D Dan Romascanu, Avaya Juergen Schoenwaelder, Jacobs University, Germany Qiong Sun, China Telecom Parviz Yegani, Huawei Technologies Cathy Zhou, Huawei Technologies",
      "zh-CHS": "Luis M.Contreras、Telefonica I+D Dan Romascanu、Avaya Juergen Schoenwaeld、雅各布斯大学、德国琼森、中国电信帕维兹·耶加尼、华为技术有限公司、华为技术有限公司"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Will (Shucheng) Liu Huawei Technologies Bantian, Longgang District Shenzhen 518129 China",
      "zh-CHS": "威尔（舒城）刘华威科技有限公司深圳市龙岗区坂田518129"
    },
    {
      "indent": 3,
      "text": "Email: liushucheng@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Chongfeng Xie China Telecom China Telecom Information Technology Innovation Park Beijing 102209 China",
      "zh-CHS": "中国电信中国电信信息技术创新园中国北京102209"
    },
    {
      "indent": 3,
      "text": "Email: xiechf.bri@chinatelecom.cn",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "John Strassner Huawei Technologies 2330 Central Expressway Santa Clara, CA 95138 United States of America",
      "zh-CHS": "美国加利福尼亚州圣克拉拉市中心高速公路2330号华为技术公司，邮编95138"
    },
    {
      "indent": 3,
      "text": "Email: john.sc.strassner@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Georgios Karagiannis Huawei Technologies Hansaallee 205 Dusseldorf 40549 Germany",
      "zh-CHS": "Georgios Karagiannis Huawei Technologies Hansaallee 205杜塞尔多夫40549德国"
    },
    {
      "indent": 3,
      "text": "Email: Georgios.Karagiannis@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Maxim Klyus",
      "zh-CHS": "马克西姆·克鲁斯"
    },
    {
      "indent": 3,
      "text": "Email: xmaruto@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jun Bi Tsinghua University Network Research Center, Tsinghua University Beijing 100084 China",
      "zh-CHS": "清华大学网络研究中心，北京100084"
    },
    {
      "indent": 3,
      "text": "Email: junbi@tsinghua.edu.cn",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Ying Cheng China Unicom No.21 Financial Street, XiCheng District Beijing 100033 China",
      "zh-CHS": "中国联通北京市西城区金融街21号盈城100033"
    },
    {
      "indent": 3,
      "text": "Email: chengying10@chinaunicom.cn",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dacheng Zhang Huawei Technologies Beijing China",
      "zh-CHS": "中国北京华为技术有限公司张大成"
    },
    {
      "indent": 3,
      "text": "Email: dacheng.zhang@huawei.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}