{
  "title": {
    "text": "RFC 8354: Use Cases for IPv6 Source Packet Routing in Networking (SPRING)",
    "zh-CHS": "RFC 8354"
  },
  "number": 8354,
  "created_at": "2021-10-29 13:27:49.516273+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     J. Brzozowski\nRequest for Comments: 8354                                      J. Leddy\nCategory: Informational                                          Comcast\nISSN: 2070-1721                                              C. Filsfils\n                                                        R. Maglione, Ed.\n                                                             M. Townsley\n                                                           Cisco Systems\n                                                              March 2018",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "Use Cases for IPv6 Source Packet Routing in Networking (SPRING)",
      "zh-CHS": "网络中IPv6源数据包路由的用例（SPRING）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Source Packet Routing in Networking (SPRING) architecture describes how Segment Routing can be used to steer packets through an IPv6 or MPLS network using the source routing paradigm. This document illustrates some use cases for Segment Routing in an IPv6-only environment.",
      "zh-CHS": "网络中的源数据包路由（SPRING）体系结构描述了如何使用段路由使用源路由范式引导数据包通过IPv6或MPLS网络。本文档说明了在仅IPv6环境中进行段路由的一些用例。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8354.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问https://www.rfc-editor.org/info/rfc8354."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2018 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(https://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  IPv6 SPRING Use Cases . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  SPRING in the Small Office  . . . . . . . . . . . . . . .   3\n  2.2.  SPRING in the Access Network  . . . . . . . . . . . . . .   4\n  2.3.  SPRING in Data Center . . . . . . . . . . . . . . . . . .   5\n  2.4.  SPRING in Content Delivery Networks . . . . . . . . . . .   5\n  2.5.  SPRING in Core Networks . . . . . . . . . . . . . . . . .   6\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   7\n5.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7\n  5.1.  Normative References  . . . . . . . . . . . . . . . . . .   7\n  5.2.  Informative References  . . . . . . . . . . . . . . . . .   7\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   8\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .   8\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Source Packet Routing in Networking (SPRING) architecture leverages the source routing paradigm. An ingress node steers a packet by including a controlled set of instructions, called segments, in the SPRING header. The SPRING architecture is described in [SEGMENT-ROUTING]. This document illustrates some use cases for SPRING / Segment Routing in an IPv6-only environment.",
      "zh-CHS": "网络（SPRING）体系结构中的源数据包路由利用了源路由范例。入口节点通过在SPRING报头中包含一组受控指令（称为段）来控制数据包。SPRING架构在[SEGMENT-ROUTING]中描述。本文档说明了纯IPv6环境中SPRING/Segment路由的一些用例。"
    },
    {
      "indent": 0,
      "text": "2. IPv6 SPRING Use Cases",
      "section_title": true,
      "zh-CHS": "2. IPv6-SPRING用例"
    },
    {
      "indent": 3,
      "text": "The use cases described in this section do not constitute an exhaustive list of all the possible scenarios: this section only includes some of the most common envisioned deployment models for Segment Routing over IPv6 (SRv6).",
      "zh-CHS": "本节中描述的用例并不构成所有可能场景的详尽列表：本节仅包括IPv6（SRv6）上分段路由的一些最常见的预期部署模型。"
    },
    {
      "indent": 3,
      "text": "In addition to the use cases described in this document, all the SPRING use cases [RFC7855] are also applicable to the SRv6 data plane.",
      "zh-CHS": "除了本文档中描述的用例外，所有SPRING用例[RFC7855]也适用于SRv6数据平面。"
    },
    {
      "indent": 0,
      "text": "2.1. SPRING in the Small Office",
      "section_title": true,
      "zh-CHS": "2.1. 小办公室里的春天"
    },
    {
      "indent": 3,
      "text": "An IPv6-enabled Small Office, Home Office (SOHO) provides ample globally routed IP addresses for all devices in the SOHO. An IPv6 small office with multiple egress points and associated provider-assigned prefixes will, in turn, provide multiple IPv6 addresses to hosts. A small office performing source and destination routing [PA-MULTIHOMING] will ensure that packets exit the SOHO at the appropriate egress based on the associated delegated prefix for that link.",
      "zh-CHS": "支持IPv6的小型办公室、家庭办公室（SOHO）为SOHO中的所有设备提供充足的全球路由IP地址。具有多个出口点和相关提供商分配前缀的IPv6小型办公室将反过来为主机提供多个IPv6地址。执行源和目的地路由[PA-MULTIHOMING]的小型办公室将确保数据包基于该链路的相关委派前缀在适当出口处离开SOHO。"
    },
    {
      "indent": 3,
      "text": "A SPRING-enabled SOHO provides the ability to steer traffic into a specific path from end hosts in the SOHO or from a customer edge router in the SOHO. If the selection of the source-routed path is enabled at the customer edge router, that router is responsible for classifying traffic and steering it into the correct path. If hosts in the SOHO have explicit source selection rules, classification can be based on the source address or associated network egress point, thus avoiding the need for implicit classification techniques based on Deep Packet Inspection (DPI). If the traffic is steered into a specific path by the host itself, it is important to know which networks can interpret the SPRING header. This information can be provided as part of the host configuration as a property of the configured IP address.",
      "zh-CHS": "支持SPRING的SOHO提供了将流量从SOHO中的终端主机或SOHO中的客户边缘路由器引导到特定路径的能力。如果在客户边缘路由器上启用了源路由路径的选择，则该路由器负责对流量进行分类并将其引导到正确的路径。如果SOHO中的主机具有明确的源选择规则，则分类可以基于源地址或相关联的网络出口点，从而避免了基于深度分组检查（DPI）的隐式分类技术的需要。如果流量由主机本身引导到特定路径，那么了解哪些网络可以解释SPRING报头是很重要的。此信息可以作为主机配置的一部分作为已配置IP地址的属性提供。"
    },
    {
      "indent": 3,
      "text": "The ability to steer traffic to an appropriate egress or utilize a specific type of media (e.g., low power, Wi-Fi, wired, femtocell, Bluetooth, Multimedia over Coax Alliance (MoCA), HomePlug, etc.) within the home itself are obvious cases that may be of interest to an application running within a SOHO.",
      "zh-CHS": "在家庭内部将流量引导到适当出口或利用特定类型媒体（例如，低功耗、Wi-Fi、有线、毫微微蜂窝、蓝牙、同轴电缆多媒体联盟（MoCA）、HomePlug等）的能力是SOHO内运行的应用程序可能感兴趣的明显情况。"
    },
    {
      "indent": 3,
      "text": "Steering to a specific egress point may be useful for a number of scenarios, including:",
      "zh-CHS": "转向特定出口点可能对许多情况有用，包括："
    },
    {
      "indent": 3,
      "text": "o regulatory compliance;",
      "zh-CHS": "o 法规遵从性；"
    },
    {
      "indent": 3,
      "text": "o performance of a particular service associated with a particular link;",
      "zh-CHS": "o 与特定链路相关联的特定服务的性能；"
    },
    {
      "indent": 3,
      "text": "o cost imposed due to data caps or per-byte charges;",
      "zh-CHS": "o 由于数据上限或每字节费用而产生的成本；"
    },
    {
      "indent": 3,
      "text": "o distinguishing between personal vs. work traffic in homes with one or more teleworkers; and",
      "zh-CHS": "o 在有一个或多个远程工作者的家庭中区分个人交通和工作交通；和"
    },
    {
      "indent": 3,
      "text": "o provision of specific services by one ISP vs. another.",
      "zh-CHS": "o 由一个ISP与另一个ISP提供特定服务。"
    },
    {
      "indent": 3,
      "text": "Information included in the SPRING header, whether imposed by the end host itself, a customer edge router, or within the access network of the ISP, may be of use at the far ends of the data communication as well. For example, an application running on an end host with application support in a data center can utilize the SPRING header as a channel to include information that affects its treatment within the data center itself, which allows for application-level steering and load balancing without relying upon implicit application-classification techniques at the edge of the data center. Further, as more and more application traffic is encrypted, the ability to extract (and include in the SPRING header) just enough information to enable the network and data center to load balance and steer traffic appropriately becomes more and more important.",
      "zh-CHS": "包括在SPRING报头中的信息，无论是由终端主机本身、客户边缘路由器还是在ISP的接入网络中强加的，也可能在数据通信的远端使用。例如，在数据中心中具有应用程序支持的终端主机上运行的应用程序可以利用SPRING标头作为通道，以包含影响其在数据中心内处理的信息，它允许应用程序级指导和负载平衡，而不依赖数据中心边缘的隐式应用程序分类技术。此外，随着越来越多的应用程序流量被加密，提取（并包含在SPRING报头中）刚好足够的信息以使网络和数据中心能够适当地进行负载平衡和控制流量的能力变得越来越重要。"
    },
    {
      "indent": 0,
      "text": "2.2. SPRING in the Access Network",
      "section_title": true,
      "zh-CHS": "2.2. 接入网中的SPRING"
    },
    {
      "indent": 3,
      "text": "Access networks deliver a variety of types of traffic from the service provider's network to the home environment and from the home towards the service provider's network.",
      "zh-CHS": "接入网络从服务提供商的网络向家庭环境以及从家庭向服务提供商的网络提供各种类型的流量。"
    },
    {
      "indent": 3,
      "text": "For bandwidth management or related purposes, the service provider may want to associate certain types of traffic to specific physical or logical downstream capacity pipes.",
      "zh-CHS": "出于带宽管理或相关目的，服务提供商可能希望将某些类型的流量与特定的物理或逻辑下游容量管道相关联。"
    },
    {
      "indent": 3,
      "text": "This mapping is not the same thing as classification and scheduling. In the cable access network, these pipes are represented at the Data-Over-Cable Service Interface Specification [DOCSIS] layer as",
      "zh-CHS": "这种映射与分类和调度不同。在电缆接入网络中，这些管道在电缆数据服务接口规范[DOCSIS]层表示为"
    },
    {
      "indent": 3,
      "text": "different service flows, which are better identified as distinct data links. As such, creating this separation allows an operator to differentiate between different types of content and perform a variety of differing functions on these pipes, such as byte capping, regulatory compliance functions, and billing.",
      "zh-CHS": "不同的服务流，可以更好地识别为不同的数据链路。因此，创建这种分离允许运营商区分不同类型的内容，并在这些管道上执行各种不同的功能，例如字节封顶、法规遵从性功能和计费。"
    },
    {
      "indent": 3,
      "text": "In a cable operator's environment, these downstream pipes could be a DOCSIS [DOCSIS] service flow, a service group, or a specific Quadrature Amplitude Modulation (QAM) as in Annex B of [ITU.J83].",
      "zh-CHS": "在电缆运营商的环境中，这些下游管道可以是DOCSIS[DOCSIS]服务流、服务组或[ITU.J83]附录B中规定的特定正交幅度调制（QAM）。"
    },
    {
      "indent": 3,
      "text": "Similarly, the operator may want to map traffic from the home sent towards the service provider's network to specific upstream capacity pipes. Information carried in a packet's SPRING header could provide the target pipe for this specific packet. The access device would not need to know specific details about the packet to perform this mapping; instead, the access device would only need to know the interpretation of the SPRING header and how to map it to the target pipe.",
      "zh-CHS": "类似地，运营商可能希望将从家乡发送到服务提供商网络的流量映射到特定的上游容量管道。数据包的SPRING报头中携带的信息可以为该特定数据包提供目标管道。接入设备将不需要知道关于分组的特定细节来执行该映射；相反，访问设备只需要知道SPRING标头的解释以及如何将其映射到目标管道。"
    },
    {
      "indent": 0,
      "text": "2.3. SPRING in Data Center",
      "section_title": true,
      "zh-CHS": "2.3. 数据中心中的SPRING"
    },
    {
      "indent": 3,
      "text": "Some data center operators are transitioning their data center infrastructure from IPv4 to native IPv6 only, in order to cope with IPv4 address depletion and to achieve larger scale. In such an environment, source routing (as enabled by SRv6) can be used to steer traffic across specific paths through the network. The specific path may also include a given function that one or more nodes in the path are requested to perform.",
      "zh-CHS": "一些数据中心运营商正在将其数据中心基础设施从IPv4过渡到仅限本机IPv6，以应对IPv4地址耗尽并实现更大的规模。在这样的环境中，源路由（由SRv6启用）可用于在网络的特定路径上引导流量。特定路径还可以包括路径中的一个或多个节点被请求执行的给定功能。"
    },
    {
      "indent": 3,
      "text": "Additionally, one of the fundamental requirements for data center architecture is to provide scalable, isolated tenant networks. In such scenarios, Segment Routing can be used to build a construct to steer the traffic across that specific path and to identify specific nodes, tenants, and functions.",
      "zh-CHS": "此外，数据中心体系结构的基本要求之一是提供可扩展、隔离的租户网络。在这种情况下，段路由可用于构建一个结构，以引导该特定路径上的流量，并识别特定节点、租户和功能。"
    },
    {
      "indent": 0,
      "text": "2.4. SPRING in Content Delivery Networks",
      "section_title": true,
      "zh-CHS": "2.4. 内容交付网络中的SPRING"
    },
    {
      "indent": 3,
      "text": "The rise of online video applications and new, video-capable IP devices has led to an explosion of video traffic traversing network operator infrastructures. In the drive to reduce the capital and operational impact of the massive influx of online video traffic, as well as to extend traditional TV services to new devices and screens, network operators are increasingly turning to Content Delivery Networks (CDNs).",
      "zh-CHS": "在线视频应用程序和新的支持视频的IP设备的兴起，导致穿越网络运营商基础设施的视频流量激增。为了减少在线视频流量的大量涌入对资本和运营的影响，以及将传统电视服务扩展到新设备和屏幕，网络运营商越来越多地转向内容交付网络（CDN）。"
    },
    {
      "indent": 3,
      "text": "Several studies showed the benefits of connecting caches in a hierarchical structure following the hierarchical nature of the Internet. In a cache hierarchy, one cache establishes peering",
      "zh-CHS": "几项研究表明，按照互联网的分层性质，以分层结构连接缓存的好处。在缓存层次结构中，一个缓存建立对等"
    },
    {
      "indent": 3,
      "text": "relationships with its neighbor caches. There are two types of relationships: parent and sibling. A parent cache is essentially one level up in a cache hierarchy. A sibling cache is on the same level. Multiple levels of hierarchy are commonly used in order to build an efficient cache architecture.",
      "zh-CHS": "与相邻缓存的关系。有两种类型的关系：父关系和兄弟关系。父缓存本质上是缓存层次结构中的上一级。同级缓存位于同一级别。为了构建高效的缓存体系结构，通常使用多级层次结构。"
    },
    {
      "indent": 3,
      "text": "In an environment where each single cache system can be uniquely identified by its own IPv6 address, a list containing a sequence of the caches in a hierarchy can be built. At each node (cache) in the list, the presence of the requested content is checked. If the requested content is found at the cache (a cache hits scenario), the sequence ends even if there are more nodes in the list; otherwise, the next element in the list (the next node/cache) is examined.",
      "zh-CHS": "在一个环境中，每个单缓存系统都可以由其自己的IPv6地址唯一标识，可以构建一个包含层次结构中缓存序列的列表。在列表中的每个节点（缓存）上，检查请求内容的存在。如果在缓存中找到请求的内容（缓存命中场景），则即使列表中有更多节点，序列也会结束；否则，将检查列表中的下一个元素（下一个节点/缓存）。"
    },
    {
      "indent": 0,
      "text": "2.5. SPRING in Core Networks",
      "section_title": true,
      "zh-CHS": "2.5. 核心网络中的SPRING"
    },
    {
      "indent": 3,
      "text": "While the overall amount of traffic offered to the network continues to grow, and considering that multiple types of traffic with different characteristics and requirements are quickly converging over a single network architecture, the network operators are starting to face new challenges.",
      "zh-CHS": "虽然提供给网络的总流量继续增长，并且考虑到具有不同特征和要求的多种类型的流量正在通过单一网络架构快速汇聚，网络运营商开始面临新的挑战。"
    },
    {
      "indent": 3,
      "text": "Some operators are currently building, or plan to build in the near future, an IPv6-only native infrastructure for their core network. These operators are also looking at the possibility to set up an explicit path based on the IPv6 source address for specific types of traffic in order to efficiently use their network infrastructure. In the case of IPv6, some operators are currently assigning or plan to assign IPv6 prefix(es) to their IPv6 customers based on regions/ geography, thus the subscriber's IPv6 prefix could be used to identify the region where the customer is located. In such an environment, the IPv6 source address could be used by the edge nodes of the network to steer traffic and forward it through a specific path other than the optimal path.",
      "zh-CHS": "一些运营商目前正在或计划在不久的将来为其核心网络构建一个仅限IPv6的本机基础设施。这些运营商也在考虑根据IPv6源地址为特定类型的流量设置显式路径的可能性，以便有效利用其网络基础设施。在IPv6的情况下，一些运营商目前正在或计划根据地区/地理向其IPv6客户分配IPv6前缀，因此订户的IPv6前缀可用于识别客户所在的地区。在这样的环境中，网络的边缘节点可以使用IPv6源地址来控制流量，并通过特定路径（而不是最佳路径）转发流量。"
    },
    {
      "indent": 3,
      "text": "The need to set up a source-based path that goes through some specific middle/intermediate points in the network may be related to different requirements:",
      "zh-CHS": "需要设置一条经过网络中某些特定中间点/中间点的源路径，这可能与不同的要求有关："
    },
    {
      "indent": 3,
      "text": "o The operator may want to be able to use some high-bandwidth links for a specific type of traffic (like video) and thus avoid the need for overdimensioning all the links of the network;",
      "zh-CHS": "o 运营商可能希望能够为特定类型的流量（如视频）使用一些高带宽链路，从而避免网络的所有链路尺寸过大的需要；"
    },
    {
      "indent": 3,
      "text": "o The operator may want to be able to set up a specific path for delay-sensitive applications;",
      "zh-CHS": "o 操作员可能希望能够为延迟敏感应用程序设置特定路径；"
    },
    {
      "indent": 3,
      "text": "o The operator may have the need to be able to select one (or multiple) specific exit point(s) at peering points when different peering points are available;",
      "zh-CHS": "o 当不同的对等点可用时，操作员可能需要能够在对等点选择一个（或多个）特定出口点；"
    },
    {
      "indent": 3,
      "text": "o The operator may have the need to be able to set up a source-based path for specific services in order to be able to reach some servers hosted in some facilities that are not always reachable through the optimal path; or",
      "zh-CHS": "o 运营商可能需要能够为特定服务设置基于源的路径，以便能够到达某些设施中托管的某些服务器，而这些服务器并不总是能够通过最佳路径到达；或"
    },
    {
      "indent": 3,
      "text": "o The operator may need to be able to provision guaranteed disjoint paths (a so-called \"dual-plane network\") for diversity purposes.",
      "zh-CHS": "o 运营商可能需要能够为分集目的提供保证不相交的路径（所谓的“双平面网络”）。"
    },
    {
      "indent": 3,
      "text": "All these scenarios would require a form of traffic engineering capabilities in an IPv6-only network environment.",
      "zh-CHS": "所有这些场景都需要在纯IPv6网络环境中具有某种形式的流量工程功能。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "zh-CHS": "本文档没有IANA操作。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document presents use cases to be considered by the SPRING architecture and potential IPv6 extensions. As such, it does not introduce any security considerations. However, there are a number of security concerns with source routing at the IP layer [RFC5095]. It is expected that any solution that addresses these use cases also addresses any security concerns.",
      "zh-CHS": "本文档介绍了SPRING体系结构要考虑的用例和潜在的IPv6扩展。因此，它没有引入任何安全考虑。然而，IP层的源路由存在许多安全问题[RFC5095]。可以预期，解决这些用例的任何解决方案也会解决任何安全问题。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "zh-CHS": "5.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC7855] Previdi, S., Ed., Filsfils, C., Ed., Decraene, B., Litkowski, S., Horneffer, M., and R. Shakir, \"Source Packet Routing in Networking (SPRING) Problem Statement and Requirements\", RFC 7855, DOI 10.17487/RFC7855, May 2016, <https://www.rfc-editor.org/info/rfc7855>.",
      "zh-CHS": "[RFC7855]Previdi，S.，Ed.，Filsfils，C.，Ed.，DeClaene，B.，Litkowski，S.，Horneffer，M.，和R.Shakir，“网络中的源数据包路由（SPRING）问题声明和要求”，RFC 7855，DOI 10.17487/RFC7855，2016年5月<https://www.rfc-editor.org/info/rfc7855>."
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "zh-CHS": "5.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[DOCSIS] CableLabs, \"New Generation of DOCSIS Technology\", October 2013, <http://www.cablelabs.com/news/ new-generation-of-docsis-technology/>.",
      "zh-CHS": "[DOCSIS]CableLabs，“新一代DOCSIS技术”，2013年10月<http://www.cablelabs.com/news/ 新一代docsis技术/>。"
    },
    {
      "indent": 3,
      "text": "[ITU.J83] ITU-T, \"Digital multi-programme systems for television, sound and data services or cable distribution\", ITU-T Recommendation J.83, December 2007, <https://www.itu.int/rec/T-REC-J.83/en>.",
      "zh-CHS": "[ITU.J83]ITU-T，“用于电视、声音和数据服务或电缆分配的数字多节目系统”，ITU-T建议J.83，2007年12月<https://www.itu.int/rec/T-REC-J.83/en>."
    },
    {
      "indent": 3,
      "text": "[PA-MULTIHOMING] Baker, F., Bowers, C., and J. Linkova, \"Enterprise Multihoming using Provider-Assigned Addresses without Network Prefix Translation: Requirements and Solution\", Work in Progress, draft-ietf-rtgwg-enterprise-pa-multihoming-03, February 2018.",
      "zh-CHS": "[PA-MULTIHOMING]Baker，F.，Bowers，C.，和J.Linkova，“使用供应商分配的地址而不进行网络前缀转换的企业MULTIHOMING：要求和解决方案”，正在进行的工作，草稿-ietf-rtgwg-Enterprise-PA-MULTIHOMING-032018年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5095] Abley, J., Savola, P., and G. Neville-Neil, \"Deprecation of Type 0 Routing Headers in IPv6\", RFC 5095, DOI 10.17487/RFC5095, December 2007, <https://www.rfc-editor.org/info/rfc5095>.",
      "zh-CHS": "[RFC5095]Abley，J.，Savola，P.，和G.Neville Neil，“IPv6中0型路由头的弃用”，RFC 5095，DOI 10.17487/RFC5095，2007年12月<https://www.rfc-editor.org/info/rfc5095>."
    },
    {
      "indent": 3,
      "text": "[SEGMENT-ROUTING] Filsfils, C., Previdi, S., Ginsberg, L., Decraene, B., Litkowski, S., and R. Shakir, \"Segment Routing Architecture\", Work in Progress, draft-ietf-spring-segment-routing-15, January 2018.",
      "zh-CHS": "[段路由]Filsfils，C.，Previdi，S.，Ginsberg，L.，DeClaene，B.，Litkowski，S.，和R.Shakir，“段路由架构”，正在进行的工作，草案-ietf-spring-SEGMENT-ROUTING-15，2018年1月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Brian Field, Robert Raszuk, Wes George, Eric Vyncke, Fred Baker, John G. Scudder, Adrian Farrel, Alvaro Retana, Bruno Decraene, and Yakov Rekhter for their valuable comments and inputs to this document.",
      "zh-CHS": "作者感谢Brian Field、Robert Raszuk、Wes George、Eric Vyncke、Fred Baker、John G.Scudder、Adrian Farrel、Alvaro Retana、Bruno Decaene和Yakov Rekhter对本文件的宝贵意见和投入。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "zh-CHS": "贡献者"
    },
    {
      "indent": 3,
      "text": "Many people contributed to this document. The authors of this document would like to thank and recognize them and their contributions. These contributors provided invaluable concepts and content for this document's creation.",
      "zh-CHS": "许多人对这份文件作出了贡献。本文件的作者谨感谢并承认他们及其贡献。这些贡献者为本文档的创建提供了宝贵的概念和内容。"
    },
    {
      "indent": 3,
      "text": "Ida Leung Independent Email: ida@brumund.ca",
      "zh-CHS": "梁爱达独立电邮：ida@brumund.ca"
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems Via Del Serafico, 200 Rome 00142 Italy Email: stefano@previdi.net",
      "zh-CHS": "Stefano Previdi Cisco Systems通过Del Serafico，200罗马00142意大利电子邮件：stefano@previdi.net"
    },
    {
      "indent": 3,
      "text": "Christian Martin Arista Networks Email: cmartin@arista.com",
      "zh-CHS": "Christian Martin Arista Networks电子邮件：cmartin@arista.com"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "John Brzozowski Comcast",
      "zh-CHS": "约翰·布佐夫斯基·康卡斯特"
    },
    {
      "indent": 3,
      "text": "Email: john_brzozowski@cable.comcast.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "John Leddy Comcast",
      "zh-CHS": "约翰·莱迪·康卡斯特"
    },
    {
      "indent": 3,
      "text": "Email: John_Leddy@cable.comcast.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Clarence Filsfils Cisco Systems Brussels Belgium",
      "zh-CHS": "Clarence Filsfils思科系统比利时布鲁塞尔"
    },
    {
      "indent": 3,
      "text": "Email: cfilsfil@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Roberta Maglione (editor) Cisco Systems Via Torri Bianche 8 Vimercate 20871 Italy",
      "zh-CHS": "Roberta Maglione（编辑）Cisco Systems Via Torri Bianche 8 Vimercate 20871意大利"
    },
    {
      "indent": 3,
      "text": "Email: robmgl@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mark Townsley Cisco Systems",
      "zh-CHS": "马克汤斯利思科系统公司"
    },
    {
      "indent": 3,
      "text": "Email: townsley@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}