{
  "title": {
    "text": "RFC 8632: A YANG Data Model for Alarm Management",
    "zh-CHS": "RFC 8632"
  },
  "number": 8632,
  "created_at": "2021-10-28 01:15:01.326390+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         S. Vallin\nRequest for Comments: 8632                              Stefan Vallin AB\nCategory: Standards Track                                   M. Bjorklund\nISSN: 2070-1721                                                    Cisco\n                                                          September 2019",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "A YANG Data Model for Alarm Management",
      "zh-CHS": "一种报警管理的YANG数据模型"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a YANG module for alarm management. It includes functions for alarm-list management, alarm shelving, and notifications to inform management systems. There are also operations to manage the operator state of an alarm and administrative alarm procedures. The module carefully maps to relevant alarm standards.",
      "zh-CHS": "本文件定义了报警管理模块。它包括报警列表管理、报警搁置和通知管理系统的功能。还有用于管理报警和管理报警程序的操作员状态的操作。该模块仔细地映射到相关报警标准。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8632.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问https://www.rfc-editor.org/info/rfc8632."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权（c）2019 IETF信托基金和被确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(https://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Terminology and Notation  . . . . . . . . . . . . . . . .   3\n2.  Objectives  . . . . . . . . . . . . . . . . . . . . . . . . .   5\n3.  Alarm Data Model Concepts . . . . . . . . . . . . . . . . . .   5\n  3.1.  Alarm Definition  . . . . . . . . . . . . . . . . . . . .   5\n  3.2.  Alarm Type  . . . . . . . . . . . . . . . . . . . . . . .   6\n  3.3.  Identifying the Alarming Resource . . . . . . . . . . . .   8\n  3.4.  Identifying Alarm Instances . . . . . . . . . . . . . . .   9\n  3.5.  Alarm Lifecycle . . . . . . . . . . . . . . . . . . . . .   9\n    3.5.1.  Resource Alarm Lifecycle  . . . . . . . . . . . . . .  10\n    3.5.2.  Operator Alarm Lifecycle  . . . . . . . . . . . . . .  11\n    3.5.3.  Administrative Alarm Lifecycle  . . . . . . . . . . .  11\n  3.6.  Root Cause, Impacted Resources, and Related Alarms  . . .  11\n  3.7.  Alarm Shelving  . . . . . . . . . . . . . . . . . . . . .  13\n  3.8.  Alarm Profiles  . . . . . . . . . . . . . . . . . . . . .  13\n4.  Alarm Data Model  . . . . . . . . . . . . . . . . . . . . . .  13\n  4.1.  Alarm Control . . . . . . . . . . . . . . . . . . . . . .  15\n    4.1.1.  Alarm Shelving  . . . . . . . . . . . . . . . . . . .  15\n  4.2.  Alarm Inventory . . . . . . . . . . . . . . . . . . . . .  16\n  4.3.  Alarm Summary . . . . . . . . . . . . . . . . . . . . . .  16\n  4.4.  The Alarm List  . . . . . . . . . . . . . . . . . . . . .  17\n  4.5.  The Shelved-Alarm List  . . . . . . . . . . . . . . . . .  19\n  4.6.  Alarm Profiles  . . . . . . . . . . . . . . . . . . . . .  19\n  4.7.  Operations  . . . . . . . . . . . . . . . . . . . . . . .  20\n  4.8.  Notifications . . . . . . . . . . . . . . . . . . . . . .  20\n5.  Relationship to the ietf-hardware YANG Module . . . . . . . .  20\n6.  Alarm YANG Module . . . . . . . . . . . . . . . . . . . . . .  21\n7.  The X.733 Mapping Module  . . . . . . . . . . . . . . . . . .  53\n8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  65\n9.  Security Considerations . . . . . . . . . . . . . . . . . . .  65\n10. References  . . . . . . . . . . . . . . . . . . . . . . . . .  67\n  10.1.  Normative References . . . . . . . . . . . . . . . . . .  67\n  10.2.  Informative References . . . . . . . . . . . . . . . . .  68\nAppendix A.  Vendor-Specific Alarm Types Example  . . . . . . . .  70\nAppendix B.  Alarm Inventory Example  . . . . . . . . . . . . . .  71\nAppendix C.  Alarm List Example . . . . . . . . . . . . . . . . .  71\nAppendix D.  Alarm Shelving Example . . . . . . . . . . . . . . .  73\nAppendix E.  X.733 Mapping Example  . . . . . . . . . . . . . . .  74\nAppendix F.  Relationship to Other Alarm Standards  . . . . . . .  74\n  F.1.  Definition of \"Alarm\" . . . . . . . . . . . . . . . . . .  74\n  F.2.  Data Model  . . . . . . . . . . . . . . . . . . . . . . .  76\n    F.2.1.  X.733 . . . . . . . . . . . . . . . . . . . . . . . .  76\n    F.2.2.  The Alarm MIB (RFC 3877)  . . . . . . . . . . . . . .  77\n    F.2.3.  3GPP Alarm IRP  . . . . . . . . . . . . . . . . . . .  77\n    F.2.4.  G.7710  . . . . . . . . . . . . . . . . . . . . . . .  78",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Appendix G.  Alarm-Usability Requirements . . . . . . . . . . . .  78\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  82\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  82",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document defines a YANG module [RFC7950] for alarm management. The purpose is to define a standardized alarm interface for network devices that can be easily integrated into management applications. The model is also applicable as a northbound alarm interface in the management applications.",
      "zh-CHS": "本文件定义了报警管理模块[RFC7950]。其目的是为网络设备定义一个标准化的报警接口，该接口可轻松集成到管理应用程序中。该模型也适用于管理应用程序中的北向报警接口。"
    },
    {
      "indent": 3,
      "text": "Alarm monitoring is a fundamental part of monitoring the network. Raw alarms from devices do not always tell the status of the network services or necessarily point to the root cause. However, being able to feed alarms to the alarm-management application in a standardized format is a starting point for performing higher-level network assurance tasks.",
      "zh-CHS": "报警监控是网络监控的基本组成部分。来自设备的原始警报并不总是告知网络服务的状态，也不一定指向根本原因。但是，能够以标准格式向报警管理应用程序提供报警是执行更高级别网络保障任务的起点。"
    },
    {
      "indent": 3,
      "text": "The design of the module is based on experience from using and implementing available alarm standards from ITU [X.733], 3GPP [ALARMIRP], and ANSI [ISA182].",
      "zh-CHS": "该模块的设计基于使用和实施来自ITU[X.733]、3GPP[ALARMIRP]和ANSI[ISA182]的可用报警标准的经验。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology and Notation",
      "section_title": true,
      "zh-CHS": "1.1. 术语和符号"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”在所有大写字母出现时（如图所示）应按照BCP 14[RFC2119][RFC8174]所述进行解释。"
    },
    {
      "indent": 3,
      "text": "The following terms are defined in [RFC7950]:",
      "zh-CHS": "[RFC7950]中定义了以下术语："
    },
    {
      "indent": 3,
      "text": "o action",
      "zh-CHS": "o 行动"
    },
    {
      "indent": 3,
      "text": "o client",
      "zh-CHS": "o 客户"
    },
    {
      "indent": 3,
      "text": "o data tree",
      "zh-CHS": "o 数据树"
    },
    {
      "indent": 3,
      "text": "o server",
      "zh-CHS": "o 服务器"
    },
    {
      "indent": 3,
      "text": "The following terms are used within this document:",
      "zh-CHS": "本文件中使用了以下术语："
    },
    {
      "indent": 3,
      "text": "Alarm (the general concept): An alarm signifies an undesirable state in a resource that requires corrective action.",
      "zh-CHS": "报警（一般概念）：报警表示资源中需要采取纠正措施的不良状态。"
    },
    {
      "indent": 3,
      "text": "Fault: A fault is the underlying cause of an undesired behavior. There is no trivial one-to-one mapping between faults and alarms. One fault may result in several alarms in case the system lacks root-cause and correlation capabilities. An alarm might not have an underlying fault as a cause. For example, imagine a bad Mean Opinion Score (MOS) alarm from a Voice over IP (VOIP) probe and the cause being non-optimal QoS configuration.",
      "zh-CHS": "故障：故障是导致意外行为的根本原因。故障和报警之间没有简单的一对一映射。如果系统缺乏根本原因和关联能力，一个故障可能会导致多个警报。警报可能没有潜在故障作为原因。例如，假设来自IP语音（VOIP）探测器的错误平均意见分数（MOS）警报，其原因是非最佳QoS配置。"
    },
    {
      "indent": 3,
      "text": "Alarm Type: An alarm type identifies a possible unique alarm state for a resource. Alarm types are names to identify the state like \"link-alarm\", \"jitter-violation\", and \"high-disk-utilization\".",
      "zh-CHS": "报警类型：报警类型标识资源可能的唯一报警状态。报警类型是标识状态的名称，如“链路报警”、“抖动冲突”和“高磁盘利用率”。"
    },
    {
      "indent": 3,
      "text": "Resource: A fine-grained identification of the alarming resource, for example, an interface and a process.",
      "zh-CHS": "资源：报警资源的细粒度标识，例如接口和进程。"
    },
    {
      "indent": 3,
      "text": "Alarm Instance: The alarm state for a specific resource and alarm type, for example, (\"GigabitEthernet0/15\", \"link-alarm\"). An entry in the alarm list.",
      "zh-CHS": "报警实例：特定资源和报警类型的报警状态，例如（“千兆以太网0/15”，“链路报警”）。报警列表中的条目。"
    },
    {
      "indent": 3,
      "text": "Cleared Alarm: A cleared alarm is an alarm where the system considers the undesired state to be cleared. Operators cannot clear alarms; clearance is managed by the system. For example, a \"linkUp\" notification can be considered a clear condition for a \"linkDown\" state.",
      "zh-CHS": "清除的报警：清除的报警是指系统认为非期望状态被清除的报警。操作员无法清除警报；清除由系统管理。例如，“linkUp”通知可被视为“linkDown”状态的明确条件。"
    },
    {
      "indent": 3,
      "text": "Closed Alarm: Operators can close alarms irrespective of the alarm being cleared or not. A closed alarm indicates that the alarm does not need attention because either the corrective action has been taken or it can be ignored for other reasons.",
      "zh-CHS": "关闭报警：无论报警是否被清除，操作员都可以关闭报警。关闭的报警表示报警不需要注意，因为已采取纠正措施，或者由于其他原因可以忽略该报警。"
    },
    {
      "indent": 3,
      "text": "Alarm Inventory: A list of all possible alarm types on a system.",
      "zh-CHS": "报警清单：系统上所有可能报警类型的列表。"
    },
    {
      "indent": 3,
      "text": "Alarm Shelving: Blocking alarms according to specific criteria.",
      "zh-CHS": "报警搁置：根据特定标准阻止报警。"
    },
    {
      "indent": 3,
      "text": "Corrective Action: An action taken by an operator or automation routine in order to minimize the impact of the alarm or resolve the root cause.",
      "zh-CHS": "纠正措施：操作员或自动化例行程序采取的措施，以尽量减少警报的影响或解决根本原因。"
    },
    {
      "indent": 3,
      "text": "Management System: The alarm-management application that consumes the alarms, i.e., acts as a client.",
      "zh-CHS": "管理系统：使用报警的报警管理应用程序，即充当客户端。"
    },
    {
      "indent": 3,
      "text": "System: The system that implements this YANG module, i.e., acts as a server. This corresponds to a network device or a management application that provides a northbound alarm interface.",
      "zh-CHS": "系统：实现此模块的系统，即充当服务器。这对应于提供北向报警接口的网络设备或管理应用程序。"
    },
    {
      "indent": 3,
      "text": "Tree diagrams used in this document follow the notation defined in [RFC8340].",
      "zh-CHS": "本文档中使用的树形图遵循[RFC8340]中定义的符号。"
    },
    {
      "indent": 0,
      "text": "2. Objectives",
      "section_title": true,
      "zh-CHS": "2. 目标"
    },
    {
      "indent": 3,
      "text": "The objectives for the design of the alarm data model are:",
      "zh-CHS": "报警数据模型的设计目标是："
    },
    {
      "indent": 3,
      "text": "o Users find it simple to use. If a system supports this module, it shall be straightforward to integrate it into a YANG-based alarm manager.",
      "zh-CHS": "o 用户发现它使用起来很简单。如果系统支持该模块，则可以直接将其集成到基于YANG的报警管理器中。"
    },
    {
      "indent": 3,
      "text": "o Alarms are viewed as states on resources and not as discrete notifications.",
      "zh-CHS": "o 报警被视为资源上的状态，而不是离散的通知。"
    },
    {
      "indent": 3,
      "text": "o A precise definition of \"alarm\" is provided in order to exclude general events that should not be forwarded as alarm notifications.",
      "zh-CHS": "o 提供了“报警”的精确定义，以排除不应作为报警通知转发的一般事件。"
    },
    {
      "indent": 3,
      "text": "o Precise identification of alarm types and alarm instances is provided.",
      "zh-CHS": "o 提供报警类型和报警实例的精确标识。"
    },
    {
      "indent": 3,
      "text": "o A management system should be able to pull all available alarm types from a system, i.e., read the alarm inventory from a system. This makes it possible to prepare alarm operators with corresponding alarm instructions.",
      "zh-CHS": "o 管理系统应能够从系统中提取所有可用的报警类型，即从系统中读取报警清单。这使得警报操作员可以准备相应的警报说明。"
    },
    {
      "indent": 3,
      "text": "o Alarm-usability requirements are addressed; see Appendix G. While IETF and telecom standards have addressed alarms mostly from a protocol perspective, the process industry has published several relevant standards addressing requirements for a useful alarm interface; see [EEMUA] and [ISA182]. This document defines usability requirements as well as a YANG data model.",
      "zh-CHS": "o 提出了警报可用性要求；参见附录G。虽然IETF和电信标准主要从协议角度解决了报警问题，但流程工业已发布了若干相关标准，解决了有用报警接口的要求；见[EEMUA]和[ISA182]。本文档定义了可用性需求以及数据模型。"
    },
    {
      "indent": 3,
      "text": "o Mapping to [X.733], which is a requirement for some alarm systems, is achievable. Still, keep some of the X.733 concepts out of the core model in order to make the model small and easy to understand.",
      "zh-CHS": "o 映射到[X.733]，这是某些报警系统的要求，是可以实现的。尽管如此，还是要将一些X.733概念保留在核心模型之外，以使模型更小、更易于理解。"
    },
    {
      "indent": 0,
      "text": "3. Alarm Data Model Concepts",
      "section_title": true,
      "zh-CHS": "3. 报警数据模型概念"
    },
    {
      "indent": 3,
      "text": "This section defines the fundamental concepts behind the data model. This section is rooted in the works of Vallin et. al [ALARMSEM].",
      "zh-CHS": "本节定义了数据模型背后的基本概念。本节以Vallin等人[ALARMSEM]的作品为基础。"
    },
    {
      "indent": 0,
      "text": "3.1. Alarm Definition",
      "section_title": true,
      "zh-CHS": "3.1. 报警定义"
    },
    {
      "indent": 3,
      "text": "An alarm signifies an undesirable state in a resource that requires corrective action.",
      "zh-CHS": "报警表示需要采取纠正措施的资源中的不良状态。"
    },
    {
      "indent": 3,
      "text": "There are two main things to remember from this definition:",
      "zh-CHS": "从这个定义中，有两件事需要记住："
    },
    {
      "indent": 3,
      "text": "1. It focuses on leaving out events and logging information in general. Alarms should only be used for undesired states that require action.",
      "zh-CHS": "1. 它通常侧重于省略事件和记录信息。警报应仅用于需要采取行动的意外状态。"
    },
    {
      "indent": 3,
      "text": "2. It also focuses on alarms as a state on a resource, not the notifications that report the state changes.",
      "zh-CHS": "2. 它还将报警作为资源的状态，而不是报告状态更改的通知。"
    },
    {
      "indent": 3,
      "text": "See Appendix F for information on how this definition relates to other alarm standards.",
      "zh-CHS": "有关此定义如何与其他报警标准相关的信息，请参见附录F。"
    },
    {
      "indent": 0,
      "text": "3.2. Alarm Type",
      "section_title": true,
      "zh-CHS": "3.2. 报警类型"
    },
    {
      "indent": 3,
      "text": "This document defines an alarm type with an alarm-type id and an alarm-type qualifier.",
      "zh-CHS": "本文档使用报警类型id和报警类型限定符定义报警类型。"
    },
    {
      "indent": 3,
      "text": "The alarm-type id is modeled as a YANG identity. With YANG identities, new alarm types can be defined in a distributed fashion. YANG identities are hierarchical, which means that a hierarchy of alarm types can be defined.",
      "zh-CHS": "报警类型id被建模为一个标识。使用YANG标识，可以以分布式方式定义新的报警类型。YANG标识是分层的，这意味着可以定义报警类型的层次。"
    },
    {
      "indent": 3,
      "text": "Standards and vendors should define their own alarm-type identities based on this definition.",
      "zh-CHS": "标准和供应商应根据此定义定义自己的报警类型标识。"
    },
    {
      "indent": 3,
      "text": "The use of YANG identities means that all possible alarms are identified at design time. This explicit declaration of alarm types makes it easier to allow for alarm qualification reviews and preparation of alarm actions and documentation.",
      "zh-CHS": "使用YANG标识意味着在设计时识别所有可能的报警。报警类型的明确声明使报警资格审查和报警操作和文件准备变得更容易。"
    },
    {
      "indent": 3,
      "text": "There are occasions where the alarm types are not known at design time. An example is a system with digital inputs that allows users to connect detectors, such as smoke detectors, to the inputs. In this case, it is a configuration action that says certain connectors are fire alarms, for example.",
      "zh-CHS": "有些情况下，设计时不知道报警类型。例如，具有数字输入的系统允许用户将探测器（如烟雾探测器）连接到输入。在这种情况下，它是一个配置动作，表示某些连接器是火灾报警器，例如。"
    },
    {
      "indent": 3,
      "text": "In order to allow for dynamic addition of alarm types, the alarm data model permits further qualification of the identity-based alarm type using a string. A potential drawback of this is that there is a significant risk that alarm operators will receive alarm types as a surprise. They do not know how to resolve the problem since a defined alarm procedure does not necessarily exist. To avoid this risk, the system MUST publish all possible alarm types in the alarm inventory; see Section 4.2.",
      "zh-CHS": "为了允许动态添加报警类型，报警数据模型允许使用字符串进一步限定基于身份的报警类型。这样做的一个潜在缺点是，警报操作员可能会意外收到警报类型。他们不知道如何解决问题，因为定义的报警程序不一定存在。为避免此风险，系统必须在报警清单中发布所有可能的报警类型；见第4.2节。"
    },
    {
      "indent": 3,
      "text": "A vendor or standards organization can define their own alarm-type hierarchy. The example below shows a hierarchy based on X.733 event types:",
      "zh-CHS": "供应商或标准组织可以定义自己的报警类型层次结构。以下示例显示了基于X.733事件类型的层次结构："
    },
    {
      "indent": 5,
      "text": "import ietf-alarms {\n  prefix al;\n}\nidentity vendor-alarms {\n  base al:alarm-type;\n}\nidentity communications-alarm {\n  base vendor-alarms;\n}\nidentity link-alarm {\n  base communications-alarm;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Alarm types can be abstract. An abstract alarm type is used as a base for defining hierarchical alarm types. Concrete alarm types are used for alarm states and appear in the alarm inventory. There are two kinds of concrete alarm types:",
      "zh-CHS": "报警类型可以是抽象的。抽象报警类型用作定义分层报警类型的基础。具体报警类型用于报警状态，并显示在报警清单中。具体的报警类型有两种："
    },
    {
      "indent": 3,
      "text": "1. The last subordinate identity in the \"alarm-type-id\" hierarchy is concrete, for example, \"alarm-identity.environmental-alarm.smoke\". In this example, \"alarm-identity\" and \"environmental-alarm\" are abstract YANG identities, whereas \"smoke\" is a concrete YANG identity.",
      "zh-CHS": "1. “报警类型id”层次结构中的最后一个下级标识是具体的，例如，“报警标识.环境报警.烟雾”。在本例中，“报警标识”和“环境报警”是抽象的阳标识，“烟雾”是具体的阳标识。"
    },
    {
      "indent": 3,
      "text": "2. The YANG identity hierarchy is abstract, and the concrete alarm type is defined by the dynamic alarm-qualifier string, for example, \"alarm-identity.environmental-alarm.external-detector\" with alarm-type-qualifier \"smoke\".",
      "zh-CHS": "2. YANG标识层次结构是抽象的，具体的报警类型由动态报警限定符字符串定义，例如带有报警类型限定符“smoke”的“alarm identity.Environment alarm.external detector”。"
    },
    {
      "indent": 3,
      "text": "For example:",
      "zh-CHS": "例如："
    },
    {
      "indent": 5,
      "text": "// Alternative 1: concrete alarm type identity\nimport ietf-alarms {\n  prefix al;\n}\nidentity environmental-alarm {\n  base al:alarm-type;\n  description \"Abstract alarm type\";\n}\nidentity smoke {\n  base environmental-alarm;\n  description \"Concrete alarm type\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "// Alternative 2: concrete alarm type qualifier\nimport ietf-alarms {\n  prefix al;\n}\nidentity environmental-alarm {\n  base al:alarm-type;\n  description \"Abstract alarm type\";\n}\nidentity external-detector {\n  base environmental-alarm;\n  description\n    \"Abstract alarm type; a runtime configuration\n     procedure sets the type of alarm detected.  This will\n     be reported in the alarm-type-qualifier.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A server SHOULD strive to minimize the number of dynamically defined alarm types.",
      "zh-CHS": "服务器应尽量减少动态定义的报警类型的数量。"
    },
    {
      "indent": 0,
      "text": "3.3. Identifying the Alarming Resource",
      "section_title": true,
      "zh-CHS": "3.3. 识别报警资源"
    },
    {
      "indent": 3,
      "text": "It is of vital importance to be able to refer to the alarming resource. This reference must be as fine-grained as possible. If the alarming resource exists in the data tree, an instance-identifier MUST be used with the full path to the object.",
      "zh-CHS": "能够参考报警资源是至关重要的。此引用必须尽可能细粒度。如果报警资源存在于数据树中，则实例标识符必须与对象的完整路径一起使用。"
    },
    {
      "indent": 3,
      "text": "When the module is used in a controller/orchestrator/manager, the original device resource identification can be modified to include the device in the path. The details depend on how devices are identified and are out of scope for this specification.",
      "zh-CHS": "在控制器/编排器/管理器中使用模块时，可以修改原始设备资源标识，以将设备包括在路径中。详细信息取决于如何识别设备，不在本规范的范围内。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "zh-CHS": "例子："
    },
    {
      "indent": 6,
      "text": "The original device alarm might identify the resource as \"/dev:interfaces/dev:interface[dev:name='FastEthernet1/0']\".",
      "zh-CHS": "原始设备警报可能将资源标识为“/dev:interfaces/dev:interface[dev:name='FastEthernet1/0']”。"
    },
    {
      "indent": 6,
      "text": "The resource identification in the manager could look something\nlike: \"/mgr:devices/mgr:device[mgr:name='xyz123']/dev:interfaces/\ndev:interface[dev:name='FastEthernet1/0']\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This module also allows for alternate naming of the alarming resource if it is not available in the data tree.",
      "zh-CHS": "如果报警资源在数据树中不可用，此模块还允许对其进行交替命名。"
    },
    {
      "indent": 0,
      "text": "3.4. Identifying Alarm Instances",
      "section_title": true,
      "zh-CHS": "3.4. 识别报警实例"
    },
    {
      "indent": 3,
      "text": "A primary goal of the alarm data model is to remove any ambiguity in how alarm notifications are mapped to an update of an alarm instance. The X.733 [X.733] and 3GPP [ALARMIRP] documents were not clear on this point. This alarm data model states that the tuple (resource, alarm-type identifier, and alarm-type qualifier) corresponds to a single alarm instance. This means that alarm notifications for the same resource and same alarm type are matched to update the same alarm instance. These three leafs are therefore used as the key in the alarm list:",
      "zh-CHS": "报警数据模型的主要目标是消除报警通知如何映射到报警实例更新的任何模糊性。X.733[X.733]和3GPP[ALARMIRP]文档在这一点上并不清楚。此报警数据模型表示元组（资源、报警类型标识符和报警类型限定符）对应于单个报警实例。这意味着相同资源和相同报警类型的报警通知将匹配以更新相同的报警实例。因此，这三个叶用作报警列表中的键："
    },
    {
      "indent": 5,
      "text": "list alarm {\n  key \"resource alarm-type-id alarm-type-qualifier\";\n  ...\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "3.5. Alarm Lifecycle",
      "section_title": true,
      "zh-CHS": "3.5. 报警生命周期"
    },
    {
      "indent": 3,
      "text": "The alarm model clearly separates the resource alarm lifecycle from the operator and administrative lifecycles of an alarm.",
      "zh-CHS": "警报模型将资源警报生命周期与警报的操作员和管理生命周期明确分开。"
    },
    {
      "indent": 3,
      "text": "o resource alarm lifecycle: the alarm instrumentation that controls alarm raise, clearance, and severity changes.",
      "zh-CHS": "o 资源报警生命周期：控制报警升高、清除和严重性更改的报警仪表。"
    },
    {
      "indent": 3,
      "text": "o operator alarm lifecycle: operators acting upon alarms with actions like acknowledging and closing. Closing an alarm implies that the operator considers the corrective action performed. Operators can also shelve (block/filter) alarms in order to avoid nuisance alarms.",
      "zh-CHS": "o 操作员报警生命周期：操作员对报警采取确认和关闭等行动。关闭警报意味着操作员考虑已执行的纠正措施。操作员还可以搁置（阻塞/过滤）警报，以避免干扰警报。"
    },
    {
      "indent": 3,
      "text": "o administrative alarm lifecycle: purging (deleting) unwanted alarms and compressing the alarm status-change list. This module exposes operations to manage the administrative lifecycle. The server may also perform these operations based on other policies, but how that is done is out of scope for this document.",
      "zh-CHS": "o 管理报警生命周期：清除（删除）不需要的报警并压缩报警状态更改列表。此模块公开管理管理生命周期的操作。服务器也可以基于其他策略执行这些操作，但是如何执行这些操作超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "A server SHOULD describe how long it retains cleared/closed alarms until they are manually purged or if it has an automatic removal policy. How this is done is outside the scope of this document.",
      "zh-CHS": "服务器应说明在手动清除/关闭报警之前，它保留清除/关闭报警的时间，或者它是否具有自动删除策略。如何做到这一点超出了本文件的范围。"
    },
    {
      "indent": 0,
      "text": "3.5.1. Resource Alarm Lifecycle",
      "section_title": true,
      "zh-CHS": "3.5.1. 资源警报生命周期"
    },
    {
      "indent": 3,
      "text": "From a resource perspective, an alarm can, for example, have the following lifecycle: raise, change severity, change severity, clear, being raised again, etc. All of these status changes can have different alarm texts generated by the instrumentation. Two important things to note:",
      "zh-CHS": "例如，从资源的角度来看，警报可以具有以下生命周期：升高、更改严重性、更改严重性、清除、再次升高等。所有这些状态更改都可以由检测生成不同的警报文本。需要注意的两件重要事情："
    },
    {
      "indent": 3,
      "text": "1. Alarms are not deleted when they are cleared. Deleting alarms is an administrative process. The \"ietf-alarms\" YANG module defines an action \"purge-alarms\" that deletes alarms.",
      "zh-CHS": "1. 警报清除后不会被删除。删除报警是一个管理过程。“ietf报警”模块定义了删除报警的“清除报警”操作。"
    },
    {
      "indent": 3,
      "text": "2. Alarms are not cleared by operators; only the underlying instrumentation can clear an alarm. Operators can close alarms.",
      "zh-CHS": "2. 操作员未清除警报；只有底层仪器才能清除警报。操作员可以关闭警报。"
    },
    {
      "indent": 3,
      "text": "The YANG tree representation below illustrates the resource-oriented lifecycle:",
      "zh-CHS": "下面的杨树表示说明了面向资源的生命周期："
    },
    {
      "indent": 5,
      "text": "+--ro alarm* [resource alarm-type-id alarm-type-qualifier]\n   ...\n   +--ro is-cleared                 boolean\n   +--ro last-raised                yang:date-and-time\n   +--ro last-changed               yang:date-and-time\n   +--ro perceived-severity         severity\n   +--ro alarm-text                 alarm-text\n   +--ro status-change* [time] {alarm-history}?\n      +--ro time                    yang:date-and-time\n      +--ro perceived-severity      severity-with-clear\n      +--ro alarm-text              alarm-text",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For every status change from the resource perspective, a row is added to the \"status-change\" list, if the server implements the feature \"alarm-history\". The feature \"alarm-history\" is optional to implement, since keeping the alarm history may have an impact on the server's memory resources.",
      "zh-CHS": "如果服务器实现了“报警历史记录”功能，则从资源角度来看，对于每个状态更改，都会在“状态更改”列表中添加一行。“报警历史记录”功能是可选的，因为保留报警历史记录可能会影响服务器的内存资源。"
    },
    {
      "indent": 3,
      "text": "The last status values are also represented as leafs for the alarm. Note well that the alarm severity does not include \"cleared\"; alarm clearance is a boolean flag.",
      "zh-CHS": "最后的状态值也表示为报警的LEAF。请注意，警报严重性不包括“已清除”；报警清除是一个布尔标志。"
    },
    {
      "indent": 3,
      "text": "Therefore, an alarm can look like this: ((\"GigabitEthernet0/25\", \"link-alarm\",\"\"), false, 2018-04-08T08:20:10.00Z, 2018-04-08T08:20:10.00Z, major, \"Interface GigabitEthernet0/25 down\").",
      "zh-CHS": "因此，警报可以如下所示：（（“千兆以太网0/25”，“链路警报”，false，2018-04-08T08:20:10.00Z，2018-04-08T08:20:10.00Z，主，“接口千兆以太网0/25关闭”）。"
    },
    {
      "indent": 0,
      "text": "3.5.2. Operator Alarm Lifecycle",
      "section_title": true,
      "zh-CHS": "3.5.2. 操作员报警生命周期"
    },
    {
      "indent": 3,
      "text": "Operators can act upon alarms using the set-operator-state action:",
      "zh-CHS": "操作员可使用设置操作员状态操作对警报进行操作："
    },
    {
      "indent": 5,
      "text": "+--ro alarm* [resource alarm-type-id alarm-type-qualifier]\n   ...\n   +--ro operator-state-change* [time] {operator-actions}?\n   |  +--ro time        yang:date-and-time\n   |  +--ro operator    string\n   |  +--ro state       operator-state\n   |  +--ro text?       string\n   +---x set-operator-state {operator-actions}?\n      +---w input\n         +---w state    writable-operator-state\n         +---w text?    string",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The operator state for an alarm can be \"none\", \"ack\", \"shelved\", and \"closed\". Alarm deletion (using the action \"purge-alarms\") can use this state as a criterion. For example, a closed alarm is an alarm where the operator has performed any required corrective actions. Closed alarms are good candidates for being purged.",
      "zh-CHS": "报警的操作员状态可以是“无”、“确认”、“搁置”和“关闭”。警报删除（使用“清除警报”操作）可将此状态用作标准。例如，关闭报警是指操作员已执行任何所需纠正措施的报警。关闭的报警很可能被清除。"
    },
    {
      "indent": 0,
      "text": "3.5.3. Administrative Alarm Lifecycle",
      "section_title": true,
      "zh-CHS": "3.5.3. 管理报警生命周期"
    },
    {
      "indent": 3,
      "text": "Deleting alarms from the alarm list is considered an administrative action. This is supported by the \"purge-alarms\" action. The \"purge-alarms\" action takes a filter as input. The filter selects alarms based on the operator and resource alarm lifecycle such as \"all closed cleared alarms older than a time specification\". The server may also perform these operations based on other policies, but how that is done is out of scope for this document.",
      "zh-CHS": "从报警列表中删除报警被视为管理操作。这由“清除警报”操作支持。“清除警报”操作将过滤器作为输入。该过滤器根据操作员和资源报警生命周期选择报警，例如“所有已关闭且已清除且早于时间规范的报警”。服务器也可以基于其他策略执行这些操作，但是如何执行这些操作超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "Purged alarms are removed from the alarm list. Note well that if the alarm resource state changes after a purge, the alarm will reappear in the alarm list.",
      "zh-CHS": "清除的报警将从报警列表中删除。请注意，如果清除后报警资源状态发生变化，报警将重新出现在报警列表中。"
    },
    {
      "indent": 3,
      "text": "Alarms can be compressed. Compressing an alarm deletes all entries in the alarm's \"status-change\" list except for the last status change. A client can perform this using the \"compress-alarms\" action. The server may also perform these operations based on other policies, but how that is done is out of scope for this document.",
      "zh-CHS": "警报可以被压缩。压缩报警将删除报警“状态更改”列表中除上次状态更改外的所有条目。客户端可以使用“压缩报警”操作执行此操作。服务器也可以基于其他策略执行这些操作，但是如何执行这些操作超出了本文档的范围。"
    },
    {
      "indent": 0,
      "text": "3.6. Root Cause, Impacted Resources, and Related Alarms",
      "section_title": true,
      "zh-CHS": "3.6. 根本原因、受影响的资源和相关警报"
    },
    {
      "indent": 3,
      "text": "The alarm data model does not mandate any requirements for the system to support alarm correlation or root-cause and service-impact analysis. However, if such features are supported, this section describes how the results of such analysis are represented in the",
      "zh-CHS": "报警数据模型不要求系统支持报警关联或根本原因和服务影响分析。但是，如果支持这些功能，本节将介绍如何在"
    },
    {
      "indent": 3,
      "text": "data model. These parts of the model are optional. The module supports three scenarios:",
      "zh-CHS": "数据模型。模型的这些部分是可选的。该模块支持三种场景："
    },
    {
      "indent": 3,
      "text": "Root-cause analysis: An alarm can indicate candidate root-cause resources, for example, a database issue alarm referring to a full-disk partition.",
      "zh-CHS": "根本原因分析：警报可以指示候选根本原因资源，例如，数据库问题警报指的是完整的磁盘分区。"
    },
    {
      "indent": 3,
      "text": "Service-impact analysis: An alarm can refer to potential impacted resources, for example, an interface alarm referring to impacted network services.",
      "zh-CHS": "服务影响分析：警报可以指潜在的受影响资源，例如，接口警报指受影响的网络服务。"
    },
    {
      "indent": 3,
      "text": "Alarm correlation: Dependencies between alarms; several alarms can be grouped as relating to each other, for example, a streaming media alarm relating to a high-jitter alarm.",
      "zh-CHS": "报警关联：报警之间的依赖关系；可以将多个报警分组为彼此相关，例如，与高抖动报警相关的流媒体报警。"
    },
    {
      "indent": 3,
      "text": "Different systems have varying degrees of alarm correlation and analysis capabilities, and the intent of the alarm data model is to enable any capability, including none.",
      "zh-CHS": "不同的系统具有不同程度的报警关联和分析功能，报警数据模型的目的是启用任何功能，包括无功能。"
    },
    {
      "indent": 3,
      "text": "The general principle of this alarm data model is to limit the amount of alarms. In many cases, several resources are affected for a given underlying problem. A full disk will of course impact databases and applications as well. The recommendation is to have a single alarm for the underlying problem and list the affected resources in the alarm rather than having separate alarms for each resource.",
      "zh-CHS": "此报警数据模型的一般原则是限制报警量。在许多情况下，给定的潜在问题会影响多个资源。一个完整的磁盘当然也会影响数据库和应用程序。建议为潜在问题设置一个警报，并在警报中列出受影响的资源，而不是为每个资源设置单独的警报。"
    },
    {
      "indent": 3,
      "text": "The alarm has one leaf-list to identify a possible \"impacted-resource\" and a leaf-list to identify a possible \"root-cause-resource\". These serve as hints only. It is up to the client application to use this information to present the overall status. Using the disk-full example, a good alarm would be to use the hard-disk partition as the alarming resource and add the database and applications into the \"impacted-resource\" leaf-list.",
      "zh-CHS": "报警有一个叶列表，用于识别可能的“受影响资源”，还有一个叶列表，用于识别可能的“根本原因资源”。这些只是提示。由客户端应用程序使用此信息来表示总体状态。使用磁盘已满示例，一个好的警报是使用硬盘分区作为警报资源，并将数据库和应用程序添加到“受影响的资源”叶列表中。"
    },
    {
      "indent": 3,
      "text": "A system should always strive to identify the resource that can be acted upon as the \"resource\" leaf. The \"impacted-resource\" leaf-list shall be used to identify any side effects of the alarm. The impacted resources cannot be acted upon to fix the problem. The disk full example above illustrates the principle; you cannot fix the underlying issue by database operations. However, you need to pay attention to the database to perform any operations that limit the impact of the problem.",
      "zh-CHS": "系统应始终努力识别可作为“资源”叶的资源。“受影响资源”叶列表应用于识别警报的任何副作用。无法对受影响的资源采取行动来解决问题。上面的磁盘完整示例说明了该原理；您无法通过数据库操作修复基础问题。但是，您需要注意数据库以执行任何限制问题影响的操作。"
    },
    {
      "indent": 3,
      "text": "On some occasions, the system might not be capable of detecting the root cause, the resource that can be acted upon. The instrumentation in this case only monitors the side effect and raises an alarm to indicate a situation requiring attention. The instrumentation still might identify possible candidates for the root-cause resource. In",
      "zh-CHS": "在某些情况下，系统可能无法检测根本原因，即可以对其采取行动的资源。在这种情况下，仪器仅监测副作用并发出警报，以指示需要注意的情况。检测仍然可能确定根本原因资源的可能候选对象。在里面"
    },
    {
      "indent": 3,
      "text": "this case, the \"root-cause-resource\" leaf-list can be used to indicate the candidate root-cause resources. An example of this kind of alarm might be an active test tool that detects a Service Level Agreement (SLA) violation on a VPN connection and identifies the devices along the chain as candidate root causes.",
      "zh-CHS": "在这种情况下，“根本原因资源”叶列表可用于指示候选根本原因资源。此类警报的一个示例可能是一个主动测试工具，该工具检测VPN连接上的服务级别协议（SLA）冲突，并将链上的设备识别为候选根本原因。"
    },
    {
      "indent": 3,
      "text": "The alarm data model also supports a way to associate different alarms with each other using the \"related-alarm\" list. This list enables the server to inform the client that certain alarms are related to other alarms.",
      "zh-CHS": "报警数据模型还支持使用“相关报警”列表将不同报警相互关联的方法。此列表使服务器能够通知客户端某些报警与其他报警相关。"
    },
    {
      "indent": 3,
      "text": "Note well that this module does not prescribe any dependencies or preference between the above alarm correlation mechanisms. Different systems have different capabilities, and the above described mechanisms are available to support the instrumentation features.",
      "zh-CHS": "请注意，该模块没有规定上述报警关联机制之间的任何依赖关系或偏好。不同的系统具有不同的功能，上述机制可用于支持仪器功能。"
    },
    {
      "indent": 0,
      "text": "3.7. Alarm Shelving",
      "section_title": true,
      "zh-CHS": "3.7. 报警架"
    },
    {
      "indent": 3,
      "text": "Alarm shelving is an important function in order for alarm-management applications and operators to stop superfluous alarms. A shelved alarm implies that any alarms fulfilling these criteria are ignored (blocked/filtered). Shelved alarms appear in a dedicated shelved-alarm list; thus, they can be filtered out so that the main alarm list only contains entries of interest. Shelved alarms do not generate notifications, but the shelved-alarm list is updated with any alarm-state changes.",
      "zh-CHS": "报警搁置是报警管理应用程序和操作员停止多余报警的一项重要功能。搁置报警意味着忽略（阻止/过滤）满足这些条件的任何报警。已搁置警报显示在专用的已搁置警报列表中；因此，可以将它们过滤掉，以便主报警列表仅包含感兴趣的条目。搁置的报警不会生成通知，但搁置的报警列表会随报警状态的任何更改而更新。"
    },
    {
      "indent": 3,
      "text": "Alarm shelving is optional to implement, since matching alarms against shelf criteria may have an impact on the server's processing resources.",
      "zh-CHS": "报警搁置是可选的，因为根据搁置条件匹配报警可能会影响服务器的处理资源。"
    },
    {
      "indent": 0,
      "text": "3.8. Alarm Profiles",
      "section_title": true,
      "zh-CHS": "3.8. 报警配置文件"
    },
    {
      "indent": 3,
      "text": "Alarm profiles are used to configure further information to an alarm type. This module supports configuring severity levels overriding the system-default levels. This corresponds to the Alarm Severity Assignment Profile (ASAP) functionality in M.3100 [M.3100] and M.3160 [M.3160]. Other standard or enterprise modules can augment this list with further alarm-type information.",
      "zh-CHS": "报警配置文件用于配置报警类型的进一步信息。此模块支持配置严重性级别以覆盖系统默认级别。这与M.3100[M.3100]和M.3160[M.3160]中的报警严重性分配配置文件（ASAP）功能相对应。其他标准或企业模块可以使用更多报警类型信息来扩充此列表。"
    },
    {
      "indent": 0,
      "text": "4. Alarm Data Model",
      "section_title": true,
      "zh-CHS": "4. 报警数据模型"
    },
    {
      "indent": 3,
      "text": "The fundamental parts of the data model are the \"alarm-list\" with associated notifications and the \"alarm-inventory\" list of all possible alarm types. These MUST be implemented by a system. The rest of the data model is made conditional with these YANG features: \"operator-actions\", \"alarm-shelving\", \"alarm-history\", \"alarm-summary\", \"alarm-profile\", and \"severity-assignment\".",
      "zh-CHS": "数据模型的基本部分是带有相关通知的“报警列表”和所有可能报警类型的“报警清单”列表。这些必须通过一个系统来实现。数据模型的其余部分具有以下特征：“操作员操作”、“报警搁置”、“报警历史”、“报警摘要”、“报警配置文件”和“严重性分配”。"
    },
    {
      "indent": 3,
      "text": "The data model has the following overall structure:",
      "zh-CHS": "数据模型具有以下总体结构："
    },
    {
      "indent": 5,
      "text": "+--rw control\n|  +--rw max-alarm-status-changes?   union\n|  +--rw notify-status-changes?      enumeration\n|  +--rw notify-severity-level?      severity\n|  +--rw alarm-shelving {alarm-shelving}?\n|        ...\n+--ro alarm-inventory\n|  +--ro alarm-type* [alarm-type-id alarm-type-qualifier]\n|        ...\n+--ro summary {alarm-summary}?\n|  +--ro alarm-summary* [severity]\n|  |     ...\n|  +--ro shelves-active?   empty {alarm-shelving}?\n+--ro alarm-list\n|  +--ro number-of-alarms?   yang:gauge32\n|  +--ro last-changed?       yang:date-and-time\n|  +--ro alarm* [resource alarm-type-id alarm-type-qualifier]\n|  |     ...\n|  +---x purge-alarms\n|  |     ...\n|  +---x compress-alarms {alarm-history}?\n|        ...\n+--ro shelved-alarms {alarm-shelving}?\n|  +--ro number-of-shelved-alarms?      yang:gauge32\n|  +--ro shelved-alarms-last-changed?   yang:date-and-time\n|  +--ro shelved-alarm*\n|  |       [resource alarm-type-id alarm-type-qualifier]\n|  |     ...\n|  +---x purge-shelved-alarms\n|  |     ...\n|  +---x compress-shelved-alarms {alarm-history}?\n|        ...\n+--rw alarm-profile*\n        [alarm-type-id alarm-type-qualifier-match resource]\n        {alarm-profile}?\n   +--rw alarm-type-id                        alarm-type-id\n   +--rw alarm-type-qualifier-match           string\n   +--rw resource                             resource-match\n   +--rw description                          string\n   +--rw alarm-severity-assignment-profile\n           {severity-assignment}?\n         ...",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.1. Alarm Control",
      "section_title": true,
      "zh-CHS": "4.1. 报警控制"
    },
    {
      "indent": 3,
      "text": "The \"/alarms/control/notify-status-changes\" leaf controls whether notifications are sent for all state changes, only raise and clear, or only notifications more severe than a configured level. This feature, in combination with alarm shelving, corresponds to the ITU Alarm Report Control functionality; see Appendix F.2.4.",
      "zh-CHS": "“/alarms/control/notify status changes”（报警/控制/通知状态更改）叶控制是否发送所有状态更改的通知、是否仅发送raise和clear通知，或者是否仅发送比配置级别更严重的通知。此功能与报警搁置相结合，对应于ITU报警报告控制功能；见附录F.2.4。"
    },
    {
      "indent": 3,
      "text": "Every alarm has a list of status changes. The length of this list is controlled by \"/alarms/control/max-alarm-status-changes\". When the list is full and a new entry created, the oldest entry is removed.",
      "zh-CHS": "每个警报都有一个状态更改列表。此列表的长度由“/报警/控制/最大报警状态更改”控制。当列表已满且创建了新条目时，最早的条目将被删除。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Alarm Shelving",
      "section_title": true,
      "zh-CHS": "4.1.1. 报警架"
    },
    {
      "indent": 3,
      "text": "The shelving control tree is shown below:",
      "zh-CHS": "搁置控制树如下图所示："
    },
    {
      "indent": 5,
      "text": "+--rw control\n   +--rw alarm-shelving {alarm-shelving}?\n      +--rw shelf* [name]\n         +--rw name           string\n         +--rw resource*      resource-match\n         +--rw alarm-type*\n         |       [alarm-type-id alarm-type-qualifier-match]\n         |  +--rw alarm-type-id                 alarm-type-id\n         |  +--rw alarm-type-qualifier-match    string\n         +--rw description?   string",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Shelved alarms are shown in a dedicated shelved-alarm list. Matching alarms MUST appear in the \"/alarms/shelved-alarms/shelved-alarm\" list, and non-matching alarms MUST appear in the \"/alarms/alarm-list/ alarm\" list. The server does not send any notifications for shelved alarms.",
      "zh-CHS": "搁置警报显示在专用的搁置警报列表中。匹配报警必须出现在“/报警/搁置报警/搁置报警”列表中，不匹配报警必须出现在“/报警/报警列表/报警”列表中。服务器不发送任何已搁置警报的通知。"
    },
    {
      "indent": 3,
      "text": "Shelving and unshelving can only be performed by editing the shelf configuration. It cannot be performed on individual alarms. The server will add an operator state indicating that the alarm was shelved/unshelved.",
      "zh-CHS": "搁置和取消搁置只能通过编辑搁置配置来执行。不能对单个报警执行此操作。服务器将添加一个操作员状态，指示报警已搁置/取消搁置。"
    },
    {
      "indent": 3,
      "text": "A leaf, \"/alarms/summary/shelves-active\", in the alarm summary indicates if there are shelved alarms.",
      "zh-CHS": "报警摘要中的叶子“/alarms/summary/Shelfs active”指示是否存在搁置的报警。"
    },
    {
      "indent": 3,
      "text": "A system can select not to support the shelving feature.",
      "zh-CHS": "系统可以选择不支持搁置功能。"
    },
    {
      "indent": 0,
      "text": "4.2. Alarm Inventory",
      "section_title": true,
      "zh-CHS": "4.2. 报警清单"
    },
    {
      "indent": 3,
      "text": "The alarm inventory represents all possible alarm types that may occur in the system. A management system may use this to build alarm procedures. The alarm inventory is relevant for the following reasons:",
      "zh-CHS": "报警清单表示系统中可能发生的所有可能的报警类型。管理系统可使用此功能建立报警程序。报警清单与以下原因有关："
    },
    {
      "indent": 6,
      "text": "The system might not implement all defined alarm type identities, and some alarm identities are abstract.",
      "zh-CHS": "系统可能不会实现所有定义的报警类型标识，并且某些报警标识是抽象的。"
    },
    {
      "indent": 6,
      "text": "The system has configured dynamic alarm types using the alarm qualifier. The inventory makes it possible for the management system to discover these.",
      "zh-CHS": "系统已使用报警限定符配置了动态报警类型。库存使管理系统能够发现这些信息。"
    },
    {
      "indent": 3,
      "text": "Note that the mechanism whereby dynamic alarm types are added using the alarm-type qualifier MUST populate this list.",
      "zh-CHS": "请注意，使用报警类型限定符添加动态报警类型的机制必须填充此列表。"
    },
    {
      "indent": 3,
      "text": "The optional leaf-list \"resource\" in the alarm inventory enables the system to publish for which resources a given alarm type may appear.",
      "zh-CHS": "报警清单中的可选叶列表“资源”使系统能够发布给定报警类型可能出现的资源。"
    },
    {
      "indent": 3,
      "text": "A server MUST implement the alarm inventory in order to enable controlled alarm procedures in the client.",
      "zh-CHS": "服务器必须实现报警清单，以便在客户端中启用受控报警过程。"
    },
    {
      "indent": 3,
      "text": "A server implementer may want to document the alarm inventory for offline processing by clients. The file format defined in [YANG-INSTANCE] can be used for this purpose.",
      "zh-CHS": "服务器实现者可能希望记录报警清单，以便客户端进行脱机处理。[YANG-INSTANCE]中定义的文件格式可用于此目的。"
    },
    {
      "indent": 3,
      "text": "The alarm inventory tree is shown below:",
      "zh-CHS": "报警资源清册树如下所示："
    },
    {
      "indent": 5,
      "text": "+--ro alarm-inventory\n   +--ro alarm-type* [alarm-type-id alarm-type-qualifier]\n      +--ro alarm-type-id           alarm-type-id\n      +--ro alarm-type-qualifier    alarm-type-qualifier\n      +--ro resource*               resource-match\n      +--ro will-clear              boolean\n      +--ro severity-level*         severity\n      +--ro description             string",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.3. Alarm Summary",
      "section_title": true,
      "zh-CHS": "4.3. 警报摘要"
    },
    {
      "indent": 3,
      "text": "The alarm summary list summarizes alarms per severity: how many cleared, cleared and closed, and closed. It also gives an indication if there are shelved alarms.",
      "zh-CHS": "报警摘要列表按严重性汇总报警：清除、清除和关闭以及关闭的数量。它还指示是否存在搁置警报。"
    },
    {
      "indent": 3,
      "text": "The alarm summary tree is shown below:",
      "zh-CHS": "报警摘要树如下所示："
    },
    {
      "indent": 5,
      "text": "+--ro summary {alarm-summary}?\n   +--ro alarm-summary* [severity]\n   |  +--ro severity                  severity\n   |  +--ro total?                    yang:gauge32\n   |  +--ro not-cleared?              yang:gauge32\n   |  +--ro cleared?                  yang:gauge32\n   |  +--ro cleared-not-closed?       yang:gauge32\n   |  |       {operator-actions}?\n   |  +--ro cleared-closed?           yang:gauge32\n   |  |       {operator-actions}?\n   |  +--ro not-cleared-closed?       yang:gauge32\n   |  |       {operator-actions}?\n   |  +--ro not-cleared-not-closed?   yang:gauge32\n   |          {operator-actions}?\n   +--ro shelves-active?   empty {alarm-shelving}?",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.4. The Alarm List",
      "section_title": true,
      "zh-CHS": "4.4. 警报列表"
    },
    {
      "indent": 3,
      "text": "The alarm list, \"/alarms/alarm-list\", is a function from the tuple (resource, alarm type, alarm-type qualifier) to the current composite alarm state. The composite state includes states for the resource alarm lifecycle such as severity, clearance flag, and operator states such as acknowledged. This means that for a given resource and alarm type, the alarm list shows the current states of the alarm such as acknowledged and cleared.",
      "zh-CHS": "报警列表“/alarms/alarm list”是从元组（资源、报警类型、报警类型限定符）到当前复合报警状态的函数。复合状态包括资源警报生命周期的状态（如严重性、清除标志）和操作员状态（如已确认）。这意味着对于给定的资源和报警类型，报警列表显示报警的当前状态，如已确认和已清除。"
    },
    {
      "indent": 3,
      "text": "+--ro alarm-list\n   +--ro number-of-alarms?   yang:gauge32\n   +--ro last-changed?       yang:date-and-time\n   +--ro alarm* [resource alarm-type-id alarm-type-qualifier]\n   |  +--ro resource                 resource\n   |  +--ro alarm-type-id            alarm-type-id\n   |  +--ro alarm-type-qualifier     alarm-type-qualifier\n   |  +--ro alt-resource*            resource\n   |  +--ro related-alarm*\n   |  |       [resource alarm-type-id alarm-type-qualifier]\n   |  |       {alarm-correlation}?\n   |  |  +--ro resource\n   |  |  |       -> /alarms/alarm-list/alarm/resource\n   |  |  +--ro alarm-type-id           leafref\n   |  |  +--ro alarm-type-qualifier    leafref\n   |  +--ro impacted-resource*       resource\n   |  |       {service-impact-analysis}?\n   |  +--ro root-cause-resource*     resource\n   |  |       {root-cause-analysis}?\n   |  +--ro time-created             yang:date-and-time",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "|  +--ro is-cleared               boolean\n|  +--ro last-raised              yang:date-and-time\n|  +--ro last-changed             yang:date-and-time\n|  +--ro perceived-severity       severity\n|  +--ro alarm-text               alarm-text\n|  +--ro status-change* [time] {alarm-history}?\n|  |  +--ro time                  yang:date-and-time\n|  |  +--ro perceived-severity    severity-with-clear\n|  |  +--ro alarm-text            alarm-text\n|  +--ro operator-state-change* [time] {operator-actions}?\n|  |  +--ro time        yang:date-and-time\n|  |  +--ro operator    string\n|  |  +--ro state       operator-state\n|  |  +--ro text?       string\n|  +---x set-operator-state {operator-actions}?\n|  |  +---w input\n|  |     +---w state    writable-operator-state\n|  |     +---w text?    string\n|  +---n operator-action {operator-actions}?\n|     +-- time        yang:date-and-time\n|     +-- operator    string\n|     +-- state       operator-state\n|     +-- text?       string\n+---x purge-alarms\n|  +---w input\n|  |  +---w alarm-clearance-status    enumeration\n|  |  +---w older-than!\n|  |  |  +---w (age-spec)?\n|  |  |     +--:(seconds)\n|  |  |     |  +---w seconds?   uint16\n|  |  |     +--:(minutes)\n|  |  |     |  +---w minutes?   uint16\n|  |  |     +--:(hours)\n|  |  |     |  +---w hours?     uint16\n|  |  |     +--:(days)\n|  |  |     |  +---w days?      uint16\n|  |  |     +--:(weeks)\n|  |  |        +---w weeks?     uint16\n|  |  +---w severity!\n|  |  |  +---w (sev-spec)?\n|  |  |     +--:(below)\n|  |  |     |  +---w below?   severity\n|  |  |     +--:(is)\n|  |  |     |  +---w is?      severity\n|  |  |     +--:(above)\n|  |  |        +---w above?   severity\n|  |  +---w operator-state-filter! {operator-actions}?",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "|  |     +---w state?   operator-state\n|  |     +---w user?    string\n|  +--ro output\n|     +--ro purged-alarms?   uint32\n+---x compress-alarms {alarm-history}?\n   +---w input\n   |  +---w resource?               resource-match\n   |  +---w alarm-type-id?\n   |  |       -> /alarms/alarm-list/alarm/alarm-type-id\n   |  +---w alarm-type-qualifier?   leafref\n   +--ro output\n      +--ro compressed-alarms?   uint32",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Every alarm has three important states: the resource clearance state \"is-cleared\", the severity \"perceived-severity\", and the operator state available in the operator-state change list.",
      "zh-CHS": "每个警报都有三个重要状态：资源清除状态“已清除”、严重性“感知严重性”和操作员状态更改列表中可用的操作员状态。"
    },
    {
      "indent": 3,
      "text": "In order to see the alarm history, the resource state changes are available in the \"status-change\" list, and the operator history is available in the \"operator-state-change\" list.",
      "zh-CHS": "为了查看报警历史，资源状态更改可在“状态更改”列表中查看，操作员历史可在“操作员状态更改”列表中查看。"
    },
    {
      "indent": 0,
      "text": "4.5. The Shelved-Alarm List",
      "section_title": true,
      "zh-CHS": "4.5. 被搁置的警报列表"
    },
    {
      "indent": 3,
      "text": "The shelved-alarm list has the same structure as the alarm list above. It shows all the alarms that match the shelving criteria \"/alarms/control/alarm-shelving\".",
      "zh-CHS": "搁置报警列表的结构与上面的报警列表相同。它显示与搁置条件“/警报/控制/警报搁置”匹配的所有警报。"
    },
    {
      "indent": 0,
      "text": "4.6. Alarm Profiles",
      "section_title": true,
      "zh-CHS": "4.6. 报警配置文件"
    },
    {
      "indent": 3,
      "text": "Alarm profiles, \"/alarms/alarm-profile\", is a list of configurable alarm types. The list supports configurable alarm severity levels in the container \"alarm-severity-assignment-profile\". If an alarm matches the configured alarm type, it MUST use the configured severity level(s) instead of the system default. This configuration MUST also be represented in the alarm inventory.",
      "zh-CHS": "报警配置文件“/alarms/Alarm profile”是可配置报警类型的列表。该列表支持容器“报警严重性分配配置文件”中的可配置报警严重性级别。如果报警与配置的报警类型匹配，则必须使用配置的严重性级别，而不是系统默认级别。此配置也必须在报警清单中表示。"
    },
    {
      "indent": 5,
      "text": "+--rw alarm-profile*\n        [alarm-type-id alarm-type-qualifier-match resource]\n        {alarm-profile}?\n   +--rw alarm-type-id                        alarm-type-id\n   +--rw alarm-type-qualifier-match           string\n   +--rw resource                             resource-match\n   +--rw description                          string\n   +--rw alarm-severity-assignment-profile\n           {severity-assignment}?\n      +--rw severity-level*    severity",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.7. Operations",
      "section_title": true,
      "zh-CHS": "4.7. 操作"
    },
    {
      "indent": 3,
      "text": "The alarm data model supports the following actions to manage the alarms:",
      "zh-CHS": "报警数据模型支持以下操作来管理报警："
    },
    {
      "indent": 3,
      "text": "\"/alarms/alarm-list/purge-alarms\": Delete alarms from the \"alarm-list\" according to specific criteria, for example, all cleared alarms older than a specific date.",
      "zh-CHS": "“/alarms/alarm list/purge alarms”：根据特定标准从“alarm list”中删除报警，例如，所有已清除的报警都早于特定日期。"
    },
    {
      "indent": 3,
      "text": "\"/alarms/alarm-list/compress-alarms\": Compress the \"status-change\" list for the alarms.",
      "zh-CHS": "“/报警/报警列表/压缩报警”：压缩报警的“状态更改”列表。"
    },
    {
      "indent": 3,
      "text": "\"/alarms/alarm-list/alarm/set-operator-state\": Change the operator state for an alarm. For example, an alarm can be acknowledged by setting the operator state to \"ack\".",
      "zh-CHS": "“/报警/报警列表/报警/设置操作员状态”：更改报警的操作员状态。例如，可以通过将操作员状态设置为“确认”来确认报警。"
    },
    {
      "indent": 3,
      "text": "\"/alarms/shelved-alarm-list/purge-shelved-alarms\": Delete alarms from the \"shelved-alarm-list\" according to specific criteria, for example, all alarms older than a specific date.",
      "zh-CHS": "“/alarms/shelved alarms list/purge shelved alarms”：根据特定条件从“shelved alarms list”中删除报警，例如，所有早于特定日期的报警。"
    },
    {
      "indent": 3,
      "text": "\"/alarms/shelved-alarm-list/compress-shelved-alarms\": Compress the \"status-change\" list for the alarms.",
      "zh-CHS": "“/alarms/shelved alarm list/compress shelved alarms”：压缩报警的“状态更改”列表。"
    },
    {
      "indent": 0,
      "text": "4.8. Notifications",
      "section_title": true,
      "zh-CHS": "4.8. 通知"
    },
    {
      "indent": 3,
      "text": "The alarm data model supports a general notification to report alarm-state changes. It carries all relevant parameters for the alarm-management application.",
      "zh-CHS": "报警数据模型支持报告报警状态更改的常规通知。它包含报警管理应用程序的所有相关参数。"
    },
    {
      "indent": 3,
      "text": "There is also a notification to report that an operator changed the operator state on an alarm, like acknowledged.",
      "zh-CHS": "还有一个通知，用于报告操作员在警报上更改了操作员状态，如已确认。"
    },
    {
      "indent": 3,
      "text": "If the alarm inventory is changed, for example, a new card type is inserted, a notification will tell the management application that new alarm types are available.",
      "zh-CHS": "如果报警清单发生更改，例如，插入了新的卡类型，则会向管理应用程序发出通知，告知新的报警类型可用。"
    },
    {
      "indent": 0,
      "text": "5. Relationship to the ietf-hardware YANG Module",
      "section_title": true,
      "zh-CHS": "5. 与ietf硬件模块的关系"
    },
    {
      "indent": 3,
      "text": "RFC 8348 [RFC8348] defines the \"ietf-hardware\" YANG data model for the management of hardware. The \"alarm-state\" in RFC 8348 is a summary of the alarm severity levels that may be active on the specific hardware component. It does not say anything about how alarms are reported, and it doesn't provide any details of the alarms.",
      "zh-CHS": "RFC 8348[RFC8348]定义了用于硬件管理的“ietf硬件”数据模型。RFC 8348中的“报警状态”是特定硬件组件上可能处于活动状态的报警严重性级别的汇总。它没有说明警报是如何报告的，也没有提供警报的任何细节。"
    },
    {
      "indent": 3,
      "text": "The mapping between the alarm YANG data model, prefix \"al\", and the \"alarm-state\" in RFC 8348, prefix \"hw\", is as follows:",
      "zh-CHS": "报警数据模型前缀“al”与RFC 8348中前缀“hw”的“报警状态”之间的映射如下："
    },
    {
      "indent": 3,
      "text": "\"al:resource\": Corresponds to an entry in the list \"/hw:hardware/hw:component/\".",
      "zh-CHS": "“al:resource”：对应于列表中的一个条目“/hw:hardware/hw:component/”。"
    },
    {
      "indent": 3,
      "text": "\"al:is-cleared\": No bit set in \"/hw:hardware/hw:component/hw:state/ hw:alarm-state\".",
      "zh-CHS": "“al:已清除”：未在“/hw:硬件/hw:组件/hw:状态/hw:报警状态”中设置位。"
    },
    {
      "indent": 3,
      "text": "\"al:perceived-severity\": Corresponding bit set in \"/hw:hardware/hw:component/hw:state/hw:alarm-state\".",
      "zh-CHS": "“al:感知严重性”：在“/hw:硬件/hw:组件/hw:状态/hw:报警状态”中设置的对应位。"
    },
    {
      "indent": 3,
      "text": "\"al:operator-state-change/al:state\": If the alarm is acknowledged by the operator, the bit \"hw:under-repair\" is set in \"/hw:hardware/hw:component/hw:state/hw:alarm-state\".",
      "zh-CHS": "“al:操作员状态更改/al:状态”：如果操作员确认报警，则在“/hw:硬件/hw:组件/hw:状态/hw:报警状态”中设置位“hw:正在维修”。"
    },
    {
      "indent": 0,
      "text": "6. Alarm YANG Module",
      "section_title": true,
      "zh-CHS": "6. 报警阳模块"
    },
    {
      "indent": 3,
      "text": "This YANG module references [RFC6991] and [XSD-TYPES].",
      "zh-CHS": "此模块引用[RFC6991]和[XSD-TYPES]。"
    },
    {
      "indent": 2,
      "text": "<CODE BEGINS> file \"ietf-alarms@2019-09-11.yang\"\nmodule ietf-alarms {\n  yang-version 1.1;\n  namespace \"urn:ietf:params:xml:ns:yang:ietf-alarms\";\n  prefix al;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "import ietf-yang-types {\n  prefix yang;\n  reference\n    \"RFC 6991: Common YANG Data Types.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "organization\n  \"IETF CCAMP Working Group\";\ncontact\n  \"WG Web:   <https://trac.ietf.org/trac/ccamp>\n   WG List:  <mailto:ccamp@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Editor:   Stefan Vallin\n          <mailto:stefan@wallan.se>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": " Editor: Martin Bjorklund <mailto:mbj@tail-f.com>\"; description \"This module defines an interface for managing alarms. Main inputs to the module design are the 3GPP Alarm Integration Reference Point (IRP), ITU-T X.733, and ANSI/ISA-18.2 alarm standards.",
      "zh-CHS": "编辑：Martin Bjorklund<mailto:mbj@tail-f、 com>“说明”此模块定义用于管理报警的接口。模块设计的主要输入是3GPP报警集成参考点（IRP）、ITU-T X.733和ANSI/ISA-18.2报警标准。"
    },
    {
      "indent": 7,
      "text": "Main features of this module include:",
      "zh-CHS": "本模块的主要功能包括："
    },
    {
      "indent": 9,
      "text": "* Alarm list: A list of all alarms. Cleared alarms stay in the list until explicitly purged.",
      "zh-CHS": "* 报警列表：所有报警的列表。清除的报警将保留在列表中，直到明确清除。"
    },
    {
      "indent": 9,
      "text": "* Operator actions on alarms: Acknowledging and closing alarms.",
      "zh-CHS": "* 操作员对警报的操作：确认和关闭警报。"
    },
    {
      "indent": 9,
      "text": "* Administrative actions on alarms: Purging alarms from the list according to specific criteria.",
      "zh-CHS": "* 报警管理操作：根据特定标准从列表中清除报警。"
    },
    {
      "indent": 9,
      "text": "* Alarm inventory: A management application can read all alarm types implemented by the system.",
      "zh-CHS": "* 报警清单：管理应用程序可以读取系统实现的所有报警类型。"
    },
    {
      "indent": 9,
      "text": "* Alarm shelving: Shelving (blocking) alarms according to specific criteria.",
      "zh-CHS": "* 报警搁置：根据特定标准搁置（阻止）报警。"
    },
    {
      "indent": 9,
      "text": "* Alarm profiles: A management system can attach further information to alarm types, for example, overriding system-default severity levels.",
      "zh-CHS": "* 报警配置文件：管理系统可以向报警类型附加更多信息，例如，覆盖系统默认严重性级别。"
    },
    {
      "indent": 7,
      "text": "This module uses a stateful view on alarms. An alarm is a state for a specific resource (note that an alarm is not a notification). An alarm type is a possible alarm state for a resource. For example, the tuple:",
      "zh-CHS": "此模块使用报警的状态视图。报警是特定资源的状态（请注意，报警不是通知）。报警类型是资源的可能报警状态。例如，元组："
    },
    {
      "indent": 9,
      "text": "('link-alarm', 'GigabitEthernet0/25')",
      "zh-CHS": "（“链路报警”、“千兆以太网0/25”）"
    },
    {
      "indent": 7,
      "text": "is an alarm of type 'link-alarm' on the resource 'GigabitEthernet0/25'.",
      "zh-CHS": "是资源“GigabitEthernet0/25”上的“链接警报”类型的警报。"
    },
    {
      "indent": 7,
      "text": "Alarm types are identified using YANG identities and an optional string-based qualifier. The string-based qualifier allows for dynamic extension of the statically defined alarm types. Alarm types identify a possible alarm state and not the individual notifications. For example, the traditional 'link-down' and 'link-up' notifications are two notifications referring to the same alarm type 'link-alarm'.",
      "zh-CHS": "报警类型使用YANG标识和可选的基于字符串的限定符标识。基于字符串的限定符允许动态扩展静态定义的报警类型。报警类型标识可能的报警状态，而不是单个通知。例如，传统的“链接关闭”和“链接打开”通知是指同一报警类型“链接报警”的两种通知。"
    },
    {
      "indent": 7,
      "text": "With this design, there is no ambiguity about how alarm and alarm clear correlation should be performed; notifications that report the same resource and alarm type are considered updates",
      "zh-CHS": "通过这种设计，警报和警报清晰关联的执行方式没有歧义；报告相同资源和报警类型的通知被视为更新"
    },
    {
      "indent": 7,
      "text": "of the same alarm, e.g., clearing an active alarm or changing the severity of an alarm. The instrumentation can update the severity and alarm text on an existing alarm. The above alarm example can therefore look like the following:",
      "zh-CHS": "同一警报，例如，清除活动警报或更改警报的严重性。仪表可以更新现有报警的严重性和报警文本。因此，上述报警示例如下所示："
    },
    {
      "indent": 9,
      "text": "(('link-alarm', 'GigabitEthernet0/25'), warning, 'interface down while interface admin state is up')",
      "zh-CHS": "（（'link-alarm'，'GigabitEthernet0/25'），警告，'interface admin state为up时接口关闭'）"
    },
    {
      "indent": 7,
      "text": "There is a clear separation between updates on the alarm from the underlying resource, like clear, and updates from an operator, like acknowledging or closing an alarm:",
      "zh-CHS": "警报更新与基础资源（如clear）和操作员更新（如确认或关闭警报）之间存在明显的区别："
    },
    {
      "indent": 9,
      "text": "(('link-alarm', 'GigabitEthernet0/25'), warning, 'interface down while interface admin state is up', cleared, closed)",
      "zh-CHS": "（（'link-alarm'，'GigabitEthernet0/25'），警告，'interface admin state为up时接口关闭'，清除，关闭）"
    },
    {
      "indent": 7,
      "text": "Administrative actions like removing closed alarms older than a given time is supported.",
      "zh-CHS": "支持删除超过给定时间的已关闭报警等管理操作。"
    },
    {
      "indent": 7,
      "text": "This YANG module does not define how the underlying instrumentation detects and clears the specific alarms. That belongs to the Standards Development Organization (SDO) or enterprise that owns that specific technology.",
      "zh-CHS": "该模块不定义底层仪表如何检测和清除特定报警。属于标准开发组织（SDO）或拥有该特定技术的企业的。"
    },
    {
      "indent": 7,
      "text": "The key words 'MUST', 'MUST NOT', 'REQUIRED', 'SHALL', 'SHALL NOT', 'SHOULD', 'SHOULD NOT', 'RECOMMENDED', 'NOT RECOMMENDED', 'MAY', and 'OPTIONAL' in this document are to be interpreted as described in BCP 14 (RFC 2119) (RFC 8174) when, and only when, they appear in all capitals, as shown here.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可能”和“可选”在所有大写字母出现时（如图所示）应按照BCP 14（RFC 2119）（RFC 8174）所述进行解释。"
    },
    {
      "indent": 7,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as authors of the code. All rights reserved.",
      "zh-CHS": "版权（c）2019 IETF信托基金和被认定为代码作者的人员。版权所有。"
    },
    {
      "indent": 7,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info).",
      "zh-CHS": "根据IETF信托有关IETF文件的法律规定第4.c节规定的简化BSD许可证中包含的许可条款，允许以源代码和二进制格式重新分发和使用，无论是否修改(https://trustee.ietf.org/license-info)."
    },
    {
      "indent": 7,
      "text": "This version of this YANG module is part of RFC 8632; see the RFC itself for full legal notices.\";",
      "zh-CHS": "该模块的此版本是RFC 8632的一部分；有关完整的法律通知，请参见RFC本身。“；"
    },
    {
      "indent": 4,
      "text": "revision 2019-09-11 { description",
      "zh-CHS": "2019-09-11修订版{说明"
    },
    {
      "indent": 4,
      "text": "    \"Initial revision.\";\n  reference\n    \"RFC 8632: A YANG Data Model for Alarm Management\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "/*\n * Features\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature operator-actions {\n  description\n    \"This feature indicates that the system supports operator\n     states on alarms.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature alarm-shelving { description \"This feature indicates that the system supports shelving (blocking) alarms.",
      "zh-CHS": "功能报警搁置{说明“此功能表示系统支持搁置（阻止）报警。"
    },
    {
      "indent": 4,
      "text": "     Alarm shelving may have an impact on server processing\n     resources in order to match alarms against shelf\n     criteria.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature alarm-history { description \"This feature indicates that the server maintains a history of state changes for each alarm. For example, if an alarm toggles between cleared and active 10 times, these state changes are present in a separate list in the alarm.",
      "zh-CHS": "功能报警历史记录{description“此功能表示服务器维护每个报警的状态更改历史记录。例如，如果报警在清除和激活之间切换10次，这些状态更改将显示在报警的单独列表中。"
    },
    {
      "indent": 4,
      "text": "     Keeping the alarm history may have an impact on server\n     memory resources.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature alarm-summary {\n  description\n    \"This feature indicates that the server summarizes the number\n     of alarms per severity and operator state.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature alarm-profile {\n  description\n    \"The system enables clients to configure further information\n     to each alarm type.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature severity-assignment {\n  description\n    \"The system supports configurable alarm severity levels.\";\n  reference\n    \"ITU-T Recommendation M.3100:\n       Generic network information model\n     ITU-T Recommendation M.3160:\n       Generic, protocol-neutral management information model\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature root-cause-analysis {\n  description\n    \"The system supports identifying candidate root-cause\n     resources for an alarm, for example, a disk partition\n     root cause for a logger failure alarm.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature service-impact-analysis {\n  description\n    \"The system supports identifying candidate-impacted\n     resources for an alarm, for example, an interface state change\n     resulting in a link alarm, which can refer to a link as being\n     impacted.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "feature alarm-correlation {\n  description\n    \"The system supports correlating/grouping alarms\n     that belong together.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "/*\n * Identities\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "identity alarm-type-id { description \"Base identity for alarm types. A unique identification of the alarm, not including the resource. Different resources can share alarm types. If the resource reports the same alarm type, it is considered to be the same alarm. The alarm type is a simplification of the different X.733 and 3GPP Alarm IRP correlation mechanisms, and it allows for hierarchical extensions.",
      "zh-CHS": "标识报警类型id{说明\"报警类型的基本标识。报警的唯一标识，不包括资源。不同的资源可以共享报警类型。如果资源报告相同的报警类型，则认为它是相同的报警。报警类型是不同X.733和3GPP报警IRP关联机制的简化，并允许层次结构奇卡扩展。"
    },
    {
      "indent": 9,
      "text": "A string-based qualifier can be used in addition to the identity in order to have different alarm types based on information not known at design time, such as values in",
      "zh-CHS": "除了标识外，还可以使用基于字符串的限定符，以便根据设计时未知的信息（如中的值）具有不同的报警类型"
    },
    {
      "indent": 9,
      "text": "textual SNMP Notification varbinds.",
      "zh-CHS": "文本SNMP通知。"
    },
    {
      "indent": 9,
      "text": "Standards and vendors can define sub-identities to clearly identify specific alarm types.",
      "zh-CHS": "标准和供应商可以定义子标识，以明确标识特定的报警类型。"
    },
    {
      "indent": 4,
      "text": "     This identity is abstract and MUST NOT be used for alarms.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "/*\n * Common types\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef resource {\n  type union {\n    type instance-identifier {\n      require-instance false;\n    }\n    type yang:object-identifier;\n    type string;\n    type yang:uuid;\n  }\n  description\n    \"This is an identification of the alarming resource, such as an\n     interface.  It should be as fine-grained as possible to both\n     guide the operator and guarantee uniqueness of the alarms.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "If the alarming resource is modeled in YANG, this type will be an instance-identifier.",
      "zh-CHS": "如果报警资源在YANG中建模，则此类型将是实例标识符。"
    },
    {
      "indent": 9,
      "text": "If the resource is an SNMP object, the type will be an 'object-identifier'.",
      "zh-CHS": "如果资源是SNMP对象，则类型将是“对象标识符”。"
    },
    {
      "indent": 9,
      "text": "If the resource is anything else, for example, a distinguished name or a Common Information Model (CIM) path, this type will be a string.",
      "zh-CHS": "如果资源是其他任何内容，例如，可分辨名称或公共信息模型（CIM）路径，则此类型将是字符串。"
    },
    {
      "indent": 9,
      "text": "If the alarming object is identified by a Universally Unique Identifier (UUID), use the uuid type. Be cautious when using this type, since a UUID is hard to use for an operator.",
      "zh-CHS": "如果报警对象由通用唯一标识符（UUID）标识，则使用UUID类型。使用此类型时要小心，因为UUID对于操作员来说很难使用。"
    },
    {
      "indent": 4,
      "text": "     If the server supports several models, the precedence should\n     be in the order as given in the union definition.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef resource-match {\n  type union {\n    type yang:xpath1.0;\n    type yang:object-identifier;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "  type string;\n}\ndescription\n  \"This type is used to match resources of type 'resource'.\n   Since the type 'resource' is a union of different types, the\n   'resource-match' type is also a union of corresponding types.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "If the type is given as an XPath 1.0 expression, a resource of type 'instance-identifier' matches if the instance is part of the node set that is the result of evaluating the XPath 1.0 expression. For example, the XPath 1.0 expression:",
      "zh-CHS": "如果该类型作为XPath 1.0表达式提供，则如果该实例是计算XPath 1.0表达式结果的节点集的一部分，则“实例标识符”类型的资源将匹配。例如，XPath 1.0表达式："
    },
    {
      "indent": 10,
      "text": "/ietf-interfaces:interfaces/ietf-interfaces:interface\n    [ietf-interfaces:type='ianaift:ethernetCsmacd']",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "would match the resource instance-identifier:",
      "zh-CHS": "将与资源实例标识符匹配："
    },
    {
      "indent": 10,
      "text": "/if:interfaces/if:interface[if:name='eth1'],",
      "zh-CHS": "/if:interfaces/if:interface[if:name='eth1']，"
    },
    {
      "indent": 9,
      "text": "assuming that the interface 'eth1' is of type 'ianaift:ethernetCsmacd'.",
      "zh-CHS": "假设接口“eth1”的类型为“ianaift:ethernetCsmacd”。"
    },
    {
      "indent": 9,
      "text": "If the type is given as an object identifier, a resource of type 'object-identifier' matches if the match object identifier is a prefix of the resource's object identifier. For example, the value:",
      "zh-CHS": "如果该类型作为对象标识符给定，则如果匹配对象标识符是资源对象标识符的前缀，则“对象标识符”类型的资源将匹配。例如，值："
    },
    {
      "indent": 10,
      "text": "1.3.6.1.2.1.2.2",
      "zh-CHS": "1.3.6.1.2.1.2.2"
    },
    {
      "indent": 9,
      "text": "would match the resource object identifier:",
      "zh-CHS": "将与资源对象标识符匹配："
    },
    {
      "indent": 10,
      "text": "1.3.6.1.2.1.2.2.1.1.5",
      "zh-CHS": "1.3.6.1.2.1.2.2.1.1.5"
    },
    {
      "indent": 9,
      "text": "If the type is given as an UUID or a string, it is interpreted as an XML Schema regular expression, which matches a resource of type 'yang:uuid' or 'string' if the given regular expression matches the resource string.",
      "zh-CHS": "如果该类型以UUID或字符串形式给出，则将其解释为XML架构正则表达式，如果给定正则表达式与资源字符串匹配，则该正则表达式与类型为“yang:UUID”或“string”的资源相匹配。"
    },
    {
      "indent": 9,
      "text": "If the type is given as an XPath expression, it is evaluated in the following XPath context:",
      "zh-CHS": "如果类型作为XPath表达式提供，则在以下XPath上下文中对其求值："
    },
    {
      "indent": 11,
      "text": "o The set of namespace declarations is the set of prefix and namespace pairs for all YANG modules implemented by the server, where the prefix is the YANG module name and the namespace is as defined by the 'namespace' statement in the YANG module.",
      "zh-CHS": "o 命名空间声明集是服务器实现的所有YANG模块的前缀和命名空间对集，其中前缀是YANG模块名称，命名空间由YANG模块中的“namespace”语句定义。"
    },
    {
      "indent": 14,
      "text": "If a leaf of this type is encoded in XML, all namespace",
      "zh-CHS": "如果此类型的叶用XML编码，则所有名称空间"
    },
    {
      "indent": 14,
      "text": "declarations in scope on the leaf element are added to the set of namespace declarations. If a prefix found in the XML is already present in the set of namespace declarations, the namespace in the XML is used.",
      "zh-CHS": "叶元素上作用域中的声明被添加到名称空间声明集中。如果在XML中找到的前缀已存在于名称空间声明集中，则使用XML中的名称空间。"
    },
    {
      "indent": 11,
      "text": "o The set of variable bindings is empty.",
      "zh-CHS": "o 变量绑定集为空。"
    },
    {
      "indent": 11,
      "text": "o The function library is the core function library, and the functions are defined in Section 10 of RFC 7950.",
      "zh-CHS": "o 函数库是核心函数库，函数在RFC 7950第10节中定义。"
    },
    {
      "indent": 4,
      "text": "       o  The context node is the root node in the data tree.\";\n  reference\n    \"XML Schema Part 2: Datatypes Second Edition,\n       World Wide Web Consortium Recommendation\n       REC-xmlschema-2-20041028\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef alarm-text {\n  type string;\n  description\n    \"The string used to inform operators about the alarm.  This\n     MUST contain enough information for an operator to be able to\n     understand the problem and how to resolve it.  If this string\n     contains structure, this format should be clearly documented\n     for programs to be able to parse that information.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef severity {\n  type enumeration {\n    enum indeterminate {\n      value 2;\n      description\n        \"Indicates that the severity level could not be\n         determined.  This level SHOULD be avoided.\";\n    }\n    enum warning {\n      value 3;\n      description\n        \"The 'warning' severity level indicates the detection of a\n         potential or impending service-affecting fault, before any\n         significant effects have been felt.  Action should be\n         taken to further diagnose (if necessary) and correct the\n         problem in order to prevent it from becoming a more\n         serious service-affecting fault.\";\n    }\n    enum minor {\n      value 4;\n      description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "        \"The 'minor' severity level indicates the existence of a\n         non-service-affecting fault condition and that corrective\n         action should be taken in order to prevent a more serious\n         (for example, service-affecting) fault.  Such a severity\n         can be reported, for example, when the detected alarm\n         condition is not currently degrading the capacity of the\n         resource.\";\n    }\n    enum major {\n      value 5;\n      description\n        \"The 'major' severity level indicates that a service-\n         affecting condition has developed and an urgent corrective\n         action is required.  Such a severity can be reported, for\n         example, when there is a severe degradation in the\n         capability of the resource and its full capability must be\n         restored.\";\n    }\n    enum critical {\n      value 6;\n      description\n        \"The 'critical' severity level indicates that a service-\n         affecting condition has occurred and an immediate\n         corrective action is required.  Such a severity can be\n         reported, for example, when a resource becomes totally out\n         of service and its capability must be restored.\";\n    }\n  }\n  description\n    \"The severity level of the alarm.  Note well that the value\n     'clear' is not included.  Whether or not an alarm is cleared\n     is a separate boolean flag.\";\n  reference\n    \"ITU-T Recommendation X.733: Information Technology\n       - Open Systems Interconnection\n       - System Management: Alarm Reporting Function\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef severity-with-clear {\n  type union {\n    type enumeration {\n      enum cleared {\n        value 1;\n        description\n          \"The alarm is cleared by the instrumentation.\";\n      }\n    }\n    type severity;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "  }\n  description\n    \"The severity level of the alarm including clear.  This is used\n     only in notifications reporting state changes for an alarm.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef writable-operator-state {\n  type enumeration {\n    enum none {\n      value 1;\n      description\n        \"The alarm is not being taken care of.\";\n    }\n    enum ack {\n      value 2;\n      description\n        \"The alarm is being taken care of.  Corrective action not\n         taken yet or has failed\";\n    }\n    enum closed {\n      value 3;\n      description\n        \"Corrective action taken successfully.\";\n    }\n  }\n  description\n    \"Operator states on an alarm.  The 'closed' state indicates\n     that an operator considers the alarm being resolved.  This is\n     separate from the alarm's 'is-cleared' leaf.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef operator-state {\n  type union {\n    type writable-operator-state;\n    type enumeration {\n      enum shelved {\n        value 4;\n        description\n          \"The alarm is shelved.  Alarms in /alarms/shelved-alarms/\n           MUST be assigned this operator state by the server as\n           the last entry in the 'operator-state-change' list.  The\n           text for that entry SHOULD include the shelf name.\";\n      }\n      enum un-shelved {\n        value 5;\n        description\n          \"The alarm is moved back to 'alarm-list' from a shelf.\n           Alarms that are moved from /alarms/shelved-alarms/ to",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "           /alarms/alarm-list MUST be assigned this state by the\n           server as the last entry in the 'operator-state-change'\n           list.  The text for that entry SHOULD include the shelf\n           name.\";\n      }\n    }\n  }\n  description\n    \"Operator states on an alarm.  The 'closed' state indicates\n     that an operator considers the alarm being resolved.  This is\n     separate from the alarm's 'is-cleared' leaf.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "/* Alarm type */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef alarm-type-id {\n  type identityref {\n    base alarm-type-id;\n  }\n  description\n    \"Identifies an alarm type.  The description of the alarm type\n     id MUST indicate whether or not the alarm type is abstract.\n     An abstract alarm type is used as a base for other alarm type\n     ids and will not be used as a value for an alarm or be present\n     in the alarm inventory.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "typedef alarm-type-qualifier {\n  type string;\n  description\n    \"If an alarm type cannot be fully specified at design time by\n     'alarm-type-id', this string qualifier is used in addition to\n     fully define a unique alarm type.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "     The definition of alarm qualifiers is considered to be part of\n     the instrumentation and is out of scope for this module.  An\n     empty string is used when this is part of a key.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "/*\n * Groupings\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "grouping common-alarm-parameters { description \"Common parameters for an alarm.",
      "zh-CHS": "分组常见报警参数{description“报警的常见参数。"
    },
    {
      "indent": 9,
      "text": "This grouping is used both in the alarm list and in the",
      "zh-CHS": "此分组用于报警列表和报警列表中"
    },
    {
      "indent": 6,
      "text": "   notification representing an alarm-state change.\";\nleaf resource {\n  type resource;\n  mandatory true;\n  description\n    \"The alarming resource.  See also 'alt-resource'.  This could\n     be, for example, a reference to the alarming interface\";\n}\nleaf alarm-type-id {\n  type alarm-type-id;\n  mandatory true;\n  description\n    \"This leaf and the leaf 'alarm-type-qualifier' together\n     provide a unique identification of the alarm type.\";\n}\nleaf alarm-type-qualifier {\n  type alarm-type-qualifier;\n  description\n    \"This leaf is used when the 'alarm-type-id' leaf cannot\n     uniquely identify the alarm type.  Normally, this is not the\n     case, and this leaf is the empty string.\";\n}\nleaf-list alt-resource {\n  type resource;\n  description\n    \"Used if the alarming resource is available over other\n     interfaces.  This field can contain SNMP OIDs, CIM paths, or\n     3GPP distinguished names, for example.\";\n}\nlist related-alarm {\n  if-feature \"alarm-correlation\";\n  key \"resource alarm-type-id alarm-type-qualifier\";\n  description\n    \"References to related alarms.  Note that the related alarm\n     might have been purged from the alarm list.\";\n  leaf resource {\n    type leafref {\n      path \"/alarms/alarm-list/alarm/resource\";\n      require-instance false;\n    }\n    description\n      \"The alarming resource for the related alarm.\";\n  }\n  leaf alarm-type-id {\n    type leafref {\n      path \"/alarms/alarm-list/alarm\"\n         + \"[resource=current()/../resource]\"\n         + \"/alarm-type-id\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "        require-instance false;\n      }\n      description\n        \"The alarm type identifier for the related alarm.\";\n    }\n    leaf alarm-type-qualifier {\n      type leafref {\n        path \"/alarms/alarm-list/alarm\"\n           + \"[resource=current()/../resource]\"\n           + \"[alarm-type-id=current()/../alarm-type-id]\"\n           + \"/alarm-type-qualifier\";\n        require-instance false;\n      }\n      description\n        \"The alarm qualifier for the related alarm.\";\n    }\n  }\n  leaf-list impacted-resource {\n    if-feature \"service-impact-analysis\";\n    type resource;\n    description\n      \"Resources that might be affected by this alarm.  If the\n       system creates an alarm on a resource and also has a mapping\n       to other resources that might be impacted, these resources\n       can be listed in this leaf-list.  In this way, the system\n       can create one alarm instead of several.  For example, if an\n       interface has an alarm, the 'impacted-resource' can\n       reference the aggregated port channels.\";\n  }\n  leaf-list root-cause-resource {\n    if-feature \"root-cause-analysis\";\n    type resource;\n    description\n      \"Resources that are candidates for causing the alarm.  If the\n       system has a mechanism to understand the candidate root\n       causes of an alarm, this leaf-list can be used to list the\n       root-cause candidate resources.  In this way, the system can\n       create one alarm instead of several.  An example might be a\n       logging system (alarm resource) that fails; the alarm can\n       reference the file system in the 'root-cause-resource'\n       leaf-list.  Note that the intended use is not to also send\n       an alarm with the 'root-cause-resource' as an alarming\n       resource.  The 'root-cause-resource' leaf-list is a hint and\n       should not also generate an alarm for the same problem.\";\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "grouping alarm-state-change-parameters {",
      "zh-CHS": "分组报警状态更改参数{"
    },
    {
      "indent": 6,
      "text": "description \"Parameters for an alarm-state change.",
      "zh-CHS": "说明“报警状态更改的参数”。"
    },
    {
      "indent": 4,
      "text": "     This grouping is used both in the alarm list's status-change\n     list and in the notification representing an alarm-state\n     change.\";\n  leaf time {\n    type yang:date-and-time;\n    mandatory true;\n    description\n      \"The time the status of the alarm changed.  The value\n       represents the time the real alarm-state change appeared in\n       the resource and not when it was added to the alarm\n       list.  The /alarm-list/alarm/last-changed MUST be set to the\n       same value.\";\n  }\n  leaf perceived-severity {\n    type severity-with-clear;\n    mandatory true;\n    description\n      \"The severity of the alarm as defined by X.733.  Note that\n       this may not be the original severity since the alarm may\n       have changed severity.\";\n    reference\n      \"ITU-T Recommendation X.733: Information Technology\n         - Open Systems Interconnection\n         - System Management: Alarm Reporting Function\";\n  }\n  leaf alarm-text {\n    type alarm-text;\n    mandatory true;\n    description\n      \"A user-friendly text describing the alarm-state change.\";\n    reference\n      \"ITU-T Recommendation X.733: Information Technology\n         - Open Systems Interconnection\n         - System Management: Alarm Reporting Function\";\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "grouping operator-parameters {\n  description\n    \"This grouping defines parameters that can be changed by an\n     operator.\";\n  leaf time {\n    type yang:date-and-time;\n    mandatory true;\n    description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "      \"Timestamp for operator action on the alarm.\";\n  }\n  leaf operator {\n    type string;\n    mandatory true;\n    description\n      \"The name of the operator that has acted on this alarm.\";\n  }\n  leaf state {\n    type operator-state;\n    mandatory true;\n    description\n      \"The operator's view of the alarm state.\";\n  }\n  leaf text {\n    type string;\n    description\n      \"Additional optional textual information provided by the\n       operator.\";\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "grouping resource-alarm-parameters {\n  description\n    \"Alarm parameters that originate from the resource view.\";\n  leaf is-cleared {\n    type boolean;\n    mandatory true;\n    description\n      \"Indicates the current clearance state of the alarm.  An\n       alarm might toggle from active alarm to cleared alarm and\n       back to active again.\";\n  }\n  leaf last-raised {\n    type yang:date-and-time;\n    mandatory true;\n    description\n      \"An alarm may change severity level and toggle between\n       active and cleared during its lifetime.  This leaf indicates\n       the last time it was raised ('is-cleared' = 'false').\";\n  }\n  leaf last-changed {\n    type yang:date-and-time;\n    mandatory true;\n    description\n      \"A timestamp when the 'status-change' or\n       'operator-state-change' list was last changed.\";\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "leaf perceived-severity {\n  type severity;\n  mandatory true;\n  description\n    \"The last severity of the alarm.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "     If an alarm was raised with severity 'warning' but later\n     changed to 'major', this leaf will show 'major'.\";\n}\nleaf alarm-text {\n  type alarm-text;\n  mandatory true;\n  description\n    \"The last reported alarm text.  This text should contain\n     information for an operator to be able to understand the\n     problem and how to resolve it.\";\n}\nlist status-change {\n  if-feature \"alarm-history\";\n  key \"time\";\n  min-elements 1;\n  description\n    \"A list of status-change events for this alarm.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "The entry with latest timestamp in this list MUST correspond to the leafs 'is-cleared', 'perceived-severity', and 'alarm-text' for the alarm.",
      "zh-CHS": "此列表中具有最新时间戳的条目必须对应于报警的LEAF“已清除”、“感知严重性”和“报警文本”。"
    },
    {
      "indent": 11,
      "text": "This list is ordered according to the timestamps of alarm state changes. The first item corresponds to the latest state change.",
      "zh-CHS": "此列表根据报警状态更改的时间戳排序。第一项对应于最新的状态更改。"
    },
    {
      "indent": 4,
      "text": "       The following state changes create an entry in this\n       list:\n       - changed severity (warning, minor, major, critical)\n       - clearance status; this also updates the 'is-cleared'\n         leaf\n       - alarm-text update\";\n    uses alarm-state-change-parameters;\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "grouping filter-input {\n  description\n    \"Grouping to specify a filter construct on alarm information.\";\n  leaf alarm-clearance-status {\n    type enumeration {\n      enum any {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "      description\n        \"Ignore alarm-clearance status.\";\n    }\n    enum cleared {\n      description\n        \"Filter cleared alarms.\";\n    }\n    enum not-cleared {\n      description\n        \"Filter not-cleared alarms.\";\n    }\n  }\n  mandatory true;\n  description\n    \"The clearance status of the alarm.\";\n}\ncontainer older-than {\n  presence \"Age specification\";\n  description\n    \"Matches the 'last-status-change' leaf in the alarm.\";\n  choice age-spec {\n    description\n      \"Filter using date and time age.\";\n    case seconds {\n      leaf seconds {\n        type uint16;\n        description\n          \"Age expressed in seconds.\";\n      }\n    }\n    case minutes {\n      leaf minutes {\n        type uint16;\n        description\n          \"Age expressed in minutes.\";\n      }\n    }\n    case hours {\n      leaf hours {\n        type uint16;\n        description\n          \"Age expressed in hours.\";\n      }\n    }\n    case days {\n      leaf days {\n        type uint16;\n        description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "          \"Age expressed in days.\";\n      }\n    }\n    case weeks {\n      leaf weeks {\n        type uint16;\n        description\n          \"Age expressed in weeks.\";\n      }\n    }\n  }\n}\ncontainer severity {\n  presence \"Severity filter\";\n  choice sev-spec {\n    description\n      \"Filter based on severity level.\";\n    leaf below {\n      type severity;\n      description\n        \"Severity less than this leaf.\";\n    }\n    leaf is {\n      type severity;\n      description\n        \"Severity level equal to this leaf.\";\n    }\n    leaf above {\n      type severity;\n      description\n        \"Severity level higher than this leaf.\";\n    }\n  }\n  description\n    \"Filter based on severity.\";\n}\ncontainer operator-state-filter {\n  if-feature \"operator-actions\";\n  presence \"Operator state filter\";\n  leaf state {\n    type operator-state;\n    description\n      \"Filter on operator state.\";\n  }\n  leaf user {\n    type string;\n    description\n      \"Filter based on which operator.\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "    }\n    description\n      \"Filter based on operator state.\";\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "/*\n * The /alarms data tree\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "container alarms {\n  description\n    \"The top container for this module.\";\n  container control {\n    description\n      \"Configuration to control the alarm behavior.\";\n    leaf max-alarm-status-changes {\n      type union {\n        type uint16;\n        type enumeration {\n          enum infinite {\n            description\n              \"The status-change entries are accumulated\n               infinitely.\";\n          }\n        }\n      }\n      default \"32\";\n      description\n        \"The 'status-change' entries are kept in a circular list\n         per alarm.  When this number is exceeded, the oldest\n         status change entry is automatically removed.  If the\n         value is 'infinite', the status-change entries are\n         accumulated infinitely.\";\n    }\n    leaf notify-status-changes {\n      type enumeration {\n        enum all-state-changes {\n          description\n            \"Send notifications for all status changes.\";\n        }\n        enum raise-and-clear {\n          description\n            \"Send notifications only for raise, clear, and\n             re-raise.  Notifications for severity-level changes or\n             alarm-text changes are not sent.\";\n        }\n        enum severity-level {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "    description\n      \"Only send notifications for alarm-state changes\n       crossing the level specified in\n       'notify-severity-level'.  Always send clear\n       notifications.\";\n  }\n}\nmust '. != \"severity-level\" or ../notify-severity-level' {\n  description\n    \"When notify-status-changes is 'severity-level', a value\n     must be given for 'notify-severity-level'.\";\n}\ndefault \"all-state-changes\";\ndescription\n  \"This leaf controls the notifications sent for alarm status\n   updates.  There are three options:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "1. Notifications are sent for all updates, severity-level changes, and alarm-text changes.",
      "zh-CHS": "1. 发送所有更新、严重性级别更改和报警文本更改的通知。"
    },
    {
      "indent": 13,
      "text": "2. Notifications are only sent for alarm raise and clear.",
      "zh-CHS": "2. 通知仅在报警升高和清除时发送。"
    },
    {
      "indent": 13,
      "text": "3. Notifications are sent for status changes equal to or above the specified severity level. Clear notifications shall always be sent. Notifications shall also be sent for state changes that make an alarm less severe than the specified level.",
      "zh-CHS": "3. 对于等于或高于指定严重性级别的状态更改，将发送通知。应始终发送明确的通知。还应发送状态变化通知，以使警报的严重程度低于规定水平。"
    },
    {
      "indent": 13,
      "text": "For example, in option 3, assume that the severity level is set to major and that the alarm has the following state changes:",
      "zh-CHS": "例如，在选项3中，假设严重性级别设置为“主要”，并且报警具有以下状态更改："
    },
    {
      "indent": 13,
      "text": "[(Time, severity, clear)]:\n[(T1, major, -), (T2, minor, -), (T3, warning, -),\n (T4, minor, -), (T5, major, -), (T6, critical, -),\n (T7, major.  -), (T8, major, clear)]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "     In that case, notifications will be sent at times\n     T1, T2, T5, T6, T7, and T8.\";\n}\nleaf notify-severity-level {\n  when '../notify-status-changes = \"severity-level\"';\n  type severity;\n  description\n    \"Only send notifications for alarm-state changes crossing\n     the specified level.  Always send clear notifications.\";\n}\ncontainer alarm-shelving {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "if-feature \"alarm-shelving\"; description \"The 'alarm-shelving/shelf' list is used to shelve (block/filter) alarms. The conditions in the shelf criteria are logically ANDed. The first matching shelf is used, and an alarm is shelved only for this first match. Matching alarms MUST appear in the /alarms/shelved-alarms/shelved-alarm list, and non-matching /alarms MUST appear in the /alarms/alarm-list/alarm list. The server does not send any notifications for shelved alarms.",
      "zh-CHS": "如果具有“报警搁置”功能；说明“报警搁置/搁置”列表用于搁置（阻止/过滤）报警。工具架条件中的条件在逻辑上为and。使用第一个匹配的工具架，并且仅针对第一个匹配项搁置报警。匹配的报警必须出现在/alarms/shelved alarms/shelved alarms list中，不匹配的/报警必须出现在/alarms/alarm list/alarm list中。服务器不发送任何报警通知或搁置警报。"
    },
    {
      "indent": 13,
      "text": "The server MUST maintain states (e.g., severity changes) for the shelved alarms.",
      "zh-CHS": "服务器必须维护搁置警报的状态（例如，严重性更改）。"
    },
    {
      "indent": 10,
      "text": "   Alarms that match the criteria shall have an\n   operator state 'shelved'.  When the shelf\n   configuration removes an alarm from the shelf, the server\n   shall add the operator state 'un-shelved'.\";\nlist shelf {\n  key \"name\";\n  ordered-by user;\n  leaf name {\n    type string;\n    description\n      \"An arbitrary name for the alarm shelf.\";\n  }\n  description\n    \"Each entry defines the criteria for shelving alarms.\n     Criteria are ANDed.  If no criteria are specified,\n     all alarms will be shelved.\";\n  leaf-list resource {\n    type resource-match;\n    description\n      \"Shelve alarms for matching resources.\";\n  }\n  list alarm-type {\n    key \"alarm-type-id alarm-type-qualifier-match\";\n    description\n      \"Any alarm matching the combined criteria of\n       'alarm-type-id' and 'alarm-type-qualifier-match'\n       MUST be matched.\";\n    leaf alarm-type-id {\n      type alarm-type-id;\n      description\n        \"Shelve all alarms that have an 'alarm-type-id' that\n         is equal to or derived from the given\n         'alarm-type-id'.\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "        }\n        leaf alarm-type-qualifier-match {\n          type string;\n          description\n            \"An XML Schema regular expression that is used to\n             match an alarm type qualifier.  Shelve all alarms\n             that match this regular expression for the alarm\n             type qualifier.\";\n          reference\n            \"XML Schema Part 2: Datatypes Second Edition,\n               World Wide Web Consortium Recommendation\n               REC-xmlschema-2-20041028\";\n        }\n      }\n      leaf description {\n        type string;\n        description\n          \"An optional textual description of the shelf.  This\n           description should include the reason for shelving\n           these alarms.\";\n      }\n    }\n  }\n}\ncontainer alarm-inventory {\n  config false;\n  description\n    \"The 'alarm-inventory/alarm-type' list contains all possible\n     alarm types for the system.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "If the system knows for which resources a specific alarm type can appear, it is also identified in the inventory. The list also tells if each alarm type has a corresponding clear state. The inventory shall only contain concrete alarm types.",
      "zh-CHS": "如果系统知道特定报警类型可以出现在哪些资源上，则也会在资源清册中进行标识。该列表还说明每种报警类型是否具有相应的清除状态。清单应仅包含具体的报警类型。"
    },
    {
      "indent": 8,
      "text": "   The alarm inventory MUST be updated by the system when new\n   alarms can appear.  This can be the case when installing new\n   software modules or inserting new card types.  A\n   notification 'alarm-inventory-changed' is sent when the\n   inventory is changed.\";\nlist alarm-type {\n  key \"alarm-type-id alarm-type-qualifier\";\n  description\n    \"An entry in this list defines a possible alarm.\";\n  leaf alarm-type-id {\n    type alarm-type-id;\n    description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "    \"The statically defined alarm type identifier for this\n     possible alarm.\";\n}\nleaf alarm-type-qualifier {\n  type alarm-type-qualifier;\n  description\n    \"The optionally dynamically defined alarm type identifier\n     for this possible alarm.\";\n}\nleaf-list resource {\n  type resource-match;\n  description\n    \"Optionally, specifies for which resources the alarm type\n     is valid.\";\n}\nleaf will-clear {\n  type boolean;\n  mandatory true;\n  description\n    \"This leaf tells the operator if the alarm will be\n     cleared when the correct corrective action has been\n     taken.  Implementations SHOULD strive for detecting the\n     cleared state for all alarm types.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "If this leaf is 'true', the operator can monitor the alarm until it becomes cleared after the corrective action has been taken.",
      "zh-CHS": "如果此页为“真”，操作员可以监控报警，直到采取纠正措施后报警被清除。"
    },
    {
      "indent": 10,
      "text": "     If this leaf is 'false', the operator needs to validate\n     that the alarm is no longer active using other\n     mechanisms.  Alarms can lack a corresponding clear due\n     to missing instrumentation or no logical\n     corresponding clear state.\";\n}\nleaf-list severity-level {\n  type severity;\n  description\n    \"This leaf-list indicates the possible severity levels of\n     this alarm type.  Note well that 'clear' is not part of\n     the severity type.  In general, the severity level\n     should be defined by the instrumentation based on the\n     dynamic state, rather than being defined statically by\n     the alarm type, in order to provide a relevant severity\n     level based on dynamic state and context.  However, most\n     alarm types have a defined set of possible severity\n     levels, and this should be provided here.\";\n}\nleaf description {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "      type string;\n      mandatory true;\n      description\n        \"A description of the possible alarm.  It SHOULD include\n         information on possible underlying root causes and\n         corrective actions.\";\n    }\n  }\n}\ncontainer summary {\n  if-feature \"alarm-summary\";\n  config false;\n  description\n    \"This container gives a summary of the number of alarms.\";\n  list alarm-summary {\n    key \"severity\";\n    description\n      \"A global summary of all alarms in the system.  The summary\n       does not include shelved alarms.\";\n    leaf severity {\n      type severity;\n      description\n        \"Alarm summary for this severity level.\";\n    }\n    leaf total {\n      type yang:gauge32;\n      description\n        \"Total number of alarms of this severity level.\";\n    }\n    leaf not-cleared {\n      type yang:gauge32;\n      description\n        \"Total number of alarms of this severity level\n         that are not cleared.\";\n    }\n    leaf cleared {\n      type yang:gauge32;\n      description\n        \"For this severity level, the number of alarms that are\n         cleared.\";\n    }\n    leaf cleared-not-closed {\n      if-feature \"operator-actions\";\n      type yang:gauge32;\n      description\n        \"For this severity level, the number of alarms that are\n         cleared but not closed.\";\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "    leaf cleared-closed {\n      if-feature \"operator-actions\";\n      type yang:gauge32;\n      description\n        \"For this severity level, the number of alarms that are\n         cleared and closed.\";\n    }\n    leaf not-cleared-closed {\n      if-feature \"operator-actions\";\n      type yang:gauge32;\n      description\n        \"For this severity level, the number of alarms that are\n         not cleared but closed.\";\n    }\n    leaf not-cleared-not-closed {\n      if-feature \"operator-actions\";\n      type yang:gauge32;\n      description\n        \"For this severity level, the number of alarms that are\n         not cleared and not closed.\";\n    }\n  }\n  leaf shelves-active {\n    if-feature \"alarm-shelving\";\n    type empty;\n    description\n      \"This is a hint to the operator that there are active\n       alarm shelves.  This leaf MUST exist if the\n       /alarms/shelved-alarms/number-of-shelved-alarms is > 0.\";\n  }\n}\ncontainer alarm-list {\n  config false;\n  description\n    \"The alarms in the system.\";\n  leaf number-of-alarms {\n    type yang:gauge32;\n    description\n      \"This object shows the total number of\n       alarms in the system, i.e., the total number\n       of entries in the alarm list.\";\n  }\n  leaf last-changed {\n    type yang:date-and-time;\n    description\n      \"A timestamp when the alarm list was last\n       changed.  The value can be used by a manager to\n       initiate an alarm resynchronization procedure.\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "}\nlist alarm {\n  key \"resource alarm-type-id alarm-type-qualifier\";\n  description\n    \"The list of alarms.  Each entry in the list holds one\n     alarm for a given alarm type and resource.  An alarm can\n     be updated from the underlying resource or by the user.\n     The following leafs are maintained by the resource:\n     'is-cleared', 'last-change', 'perceived-severity', and\n     'alarm-text'.  An operator can change 'operator-state' and\n     'operator-text'.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Entries appear in the alarm list the first time an alarm becomes active for a given alarm type and resource. Entries do not get deleted when the alarm is cleared. Clear status is represented as a boolean flag.",
      "zh-CHS": "当给定报警类型和资源的报警第一次激活时，报警列表中会出现条目。清除报警后，条目不会被删除。清除状态表示为布尔标志。"
    },
    {
      "indent": 13,
      "text": "Alarm entries are removed, i.e., purged, from the list by an explicit purge action. For example, purge all alarms that are cleared and in closed operator state that are older than 24 hours. Purged alarms are removed from the alarm list. If the alarm resource state changes after a purge, the alarm will reappear in the alarm list.",
      "zh-CHS": "通过显式清除操作从列表中删除（即清除）报警条目。例如，清除所有已清除且处于关闭操作员状态且超过24小时的报警。清除的报警将从报警列表中删除。如果清除后报警资源状态发生变化，报警将重新出现在报警列表中。"
    },
    {
      "indent": 10,
      "text": "   Systems may also remove alarms based on locally configured\n   policies; this is out of scope for this module.\";\nuses common-alarm-parameters;\nleaf time-created {\n  type yang:date-and-time;\n  mandatory true;\n  description\n    \"The timestamp when this alarm entry was created.  This\n     represents the first time the alarm appeared; it can\n     also represent that the alarm reappeared after a purge.\n     Further state changes of the same alarm do not change\n     this leaf; these changes will update the 'last-changed'\n     leaf.\";\n}\nuses resource-alarm-parameters;\nlist operator-state-change {\n  if-feature \"operator-actions\";\n  key \"time\";\n  description\n    \"This list is used by operators to indicate the state of\n     human intervention on an alarm.  For example, if an\n     operator has seen an alarm, the operator can add a new\n     item to this list indicating that the alarm is\n     acknowledged.\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "    uses operator-parameters;\n  }\n  action set-operator-state {\n    if-feature \"operator-actions\";\n    description\n      \"This is a means for the operator to indicate the level\n       of human intervention on an alarm.\";\n    input {\n      leaf state {\n        type writable-operator-state;\n        mandatory true;\n        description\n          \"Set this operator state.\";\n      }\n      leaf text {\n        type string;\n        description\n          \"Additional optional textual information.\";\n      }\n    }\n  }\n  notification operator-action {\n    if-feature \"operator-actions\";\n    description\n      \"This notification is used to report that an operator\n       acted upon an alarm.\";\n    uses operator-parameters;\n  }\n}\naction purge-alarms {\n  description\n    \"This operation requests that the server delete entries\n     from the alarm list according to the supplied criteria.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Typically, this operation is used to delete alarms that are in closed operator state and older than a specified time.",
      "zh-CHS": "通常，此操作用于删除处于关闭操作员状态且超过指定时间的报警。"
    },
    {
      "indent": 10,
      "text": "   The number of purged alarms is returned as an output\n   parameter.\";\ninput {\n  uses filter-input;\n}\noutput {\n  leaf purged-alarms {\n    type uint32;\n    description\n      \"Number of purged alarms.\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "      }\n    }\n  }\n  action compress-alarms {\n    if-feature \"alarm-history\";\n    description\n      \"This operation requests that the server compress\n       entries in the alarm list by removing all but the\n       latest 'status-change' entry for all matching alarms.\n       Conditions in the input are logically ANDed.  If no\n       input condition is given, all alarms are compressed.\";\n    input {\n      leaf resource {\n        type resource-match;\n        description\n          \"Compress the alarms matching this resource.\";\n      }\n      leaf alarm-type-id {\n        type leafref {\n          path \"/alarms/alarm-list/alarm/alarm-type-id\";\n          require-instance false;\n        }\n        description\n          \"Compress alarms with this 'alarm-type-id'.\";\n      }\n      leaf alarm-type-qualifier {\n        type leafref {\n          path \"/alarms/alarm-list/alarm/alarm-type-qualifier\";\n          require-instance false;\n        }\n        description\n          \"Compress the alarms with this\n           'alarm-type-qualifier'.\";\n      }\n    }\n    output {\n      leaf compressed-alarms {\n        type uint32;\n        description\n          \"Number of compressed alarm entries.\";\n      }\n    }\n  }\n}\ncontainer shelved-alarms {\n  if-feature \"alarm-shelving\";\n  config false;\n  description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "  \"The shelved alarms.  Alarms appear here if they match the\n   criteria in /alarms/control/alarm-shelving.  This list does\n   not generate any notifications.  The list represents alarms\n   that are considered not relevant by the operator.  Alarms in\n   this list have an 'operator-state' of 'shelved'.  This\n   cannot be changed.\";\nleaf number-of-shelved-alarms {\n  type yang:gauge32;\n  description\n    \"This object shows the total number of current\n     alarms, i.e., the total number of entries\n     in the alarm list.\";\n}\nleaf shelved-alarms-last-changed {\n  type yang:date-and-time;\n  description\n    \"A timestamp when the shelved-alarm list was last changed.\n     The value can be used by a manager to initiate an alarm\n     resynchronization procedure.\";\n}\nlist shelved-alarm {\n  key \"resource alarm-type-id alarm-type-qualifier\";\n  description\n    \"The list of shelved alarms.  Shelved alarms can only be\n     updated from the underlying resource; no operator actions\n     are supported.\";\n  uses common-alarm-parameters;\n  leaf shelf-name {\n    type leafref {\n      path \"/alarms/control/alarm-shelving/shelf/name\";\n      require-instance false;\n    }\n    description\n      \"The name of the shelf.\";\n  }\n  uses resource-alarm-parameters;\n  list operator-state-change {\n    if-feature \"operator-actions\";\n    key \"time\";\n    description\n      \"This list is used by operators to indicate the state of\n       human intervention on an alarm.  For shelved alarms, the\n       system has set the list item in the list to 'shelved'.\";\n    uses operator-parameters;\n  }\n}\naction purge-shelved-alarms {\n  description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "\"This operation requests that the server delete entries from the shelved-alarm list according to the supplied criteria. In the shelved-alarm list, it makes sense to delete alarms that are not relevant anymore.",
      "zh-CHS": "“此操作要求服务器根据提供的条件从搁置报警列表中删除条目。在搁置报警列表中，删除不再相关的报警是有意义的。"
    },
    {
      "indent": 8,
      "text": "     The number of purged alarms is returned as an output\n     parameter.\";\n  input {\n    uses filter-input;\n  }\n  output {\n    leaf purged-alarms {\n      type uint32;\n      description\n        \"Number of purged alarms.\";\n    }\n  }\n}\naction compress-shelved-alarms {\n  if-feature \"alarm-history\";\n  description\n    \"This operation requests that the server compress entries\n     in the shelved-alarm list by removing all but the latest\n     'status-change' entry for all matching shelved alarms.\n     Conditions in the input are logically ANDed.  If no input\n     condition is given, all alarms are compressed.\";\n  input {\n    leaf resource {\n      type leafref {\n        path \"/alarms/shelved-alarms/shelved-alarm/resource\";\n        require-instance false;\n      }\n      description\n        \"Compress the alarms with this resource.\";\n    }\n    leaf alarm-type-id {\n      type leafref {\n        path \"/alarms/shelved-alarms/shelved-alarm\"\n           + \"/alarm-type-id\";\n        require-instance false;\n      }\n      description\n        \"Compress alarms with this 'alarm-type-id'.\";\n    }\n    leaf alarm-type-qualifier {\n      type leafref {\n        path \"/alarms/shelved-alarms/shelved-alarm\"\n           + \"/alarm-type-qualifier\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "          require-instance false;\n        }\n        description\n          \"Compress the alarms with this\n           'alarm-type-qualifier'.\";\n      }\n    }\n    output {\n      leaf compressed-alarms {\n        type uint32;\n        description\n          \"Number of compressed alarm entries.\";\n      }\n    }\n  }\n}\nlist alarm-profile {\n  if-feature \"alarm-profile\";\n  key \"alarm-type-id alarm-type-qualifier-match resource\";\n  ordered-by user;\n  description\n    \"This list is used to assign further information or\n     configuration for each alarm type.  This module supports a\n     mechanism where the client can override the system-default\n     alarm severity levels.  The 'alarm-profile' is also a useful\n     augmentation point for specific additions to alarm types.\";\n  leaf alarm-type-id {\n    type alarm-type-id;\n    description\n      \"The alarm type identifier to match.\";\n  }\n  leaf alarm-type-qualifier-match {\n    type string;\n    description\n      \"An XML Schema regular expression that is used to match the\n       alarm type qualifier.\";\n    reference\n      \"XML Schema Part 2: Datatypes Second Edition,\n         World Wide Web Consortium Recommendation\n         REC-xmlschema-2-20041028\";\n  }\n  leaf resource {\n    type resource-match;\n    description\n      \"Specifies which resources to match.\";\n  }\n  leaf description {\n    type string;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "  mandatory true;\n  description\n    \"A description of the alarm profile.\";\n}\ncontainer alarm-severity-assignment-profile {\n  if-feature \"severity-assignment\";\n  description\n    \"The client can override the system-default severity\n     level.\";\n  reference\n    \"ITU-T Recommendation M.3100:\n       Generic network information model\n     ITU-T Recommendation M.3160:\n       Generic, protocol-neutral management information model\";\n  leaf-list severity-level {\n    type severity;\n    ordered-by user;\n    description\n      \"Specifies the configured severity level(s) for the\n       matching alarm.  If the alarm has several severity\n       levels, the leaf-list shall be given in rising severity\n       order.  The original M3100/M3160 ASAP function only\n       allows for a one-to-one mapping between alarm type and\n       severity, but since YANG module supports stateful\n       alarms, the mapping must allow for several severity\n       levels.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "           Assume a high-utilization alarm type with two thresholds\n           with the system-default severity levels of threshold1 =\n           warning and threshold2 = minor.  Setting this leaf-list\n           to (minor, major) will assign the severity levels as\n           threshold1 = minor and threshold2 = major\";\n      }\n    }\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "/*\n * Notifications\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "notification alarm-notification {\n  description\n    \"This notification is used to report a state change for an\n     alarm.  The same notification is used for reporting a newly\n     raised alarm, a cleared alarm, or changing the text and/or\n     severity of an existing alarm.\";\n  uses common-alarm-parameters;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "  uses alarm-state-change-parameters;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "  notification alarm-inventory-changed {\n    description\n      \"This notification is used to report that the list of possible\n       alarms has changed.  This can happen when, for example, a new\n       software module is installed or a new physical card is\n       inserted.\";\n  }\n}\n<CODE ENDS>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. The X.733 Mapping Module",
      "section_title": true,
      "zh-CHS": "7. X.733映射模块"
    },
    {
      "indent": 3,
      "text": "Many alarm systems are based on the X.733 [X.733] and X.736 [X.736] alarm standards. This module \"ietf-alarms-x733\" augments the alarm inventory, the alarm lists, and the alarm notification with X.733 and X.736 parameters.",
      "zh-CHS": "许多报警系统基于X.733[X.733]和X.736[X.736]报警标准。该模块“ietf-alarms-x733”使用X.733和X.736参数扩充了报警清单、报警列表和报警通知。"
    },
    {
      "indent": 3,
      "text": "The module also supports a feature whereby the alarm manager can configure the mapping from alarm types to X.733 \"event-type\" and \"probable-cause\" parameters. This might be needed when the default mapping provided by the system is in conflict with other management systems or not considered correct.",
      "zh-CHS": "该模块还支持报警管理器配置从报警类型到X.733“事件类型”和“可能原因”参数的映射的功能。当系统提供的默认映射与其他管理系统冲突或被认为不正确时，可能需要这样做。"
    },
    {
      "indent": 3,
      "text": "Note that the term \"resource\" in this document is synonymous to the ITU term \"managed object\".",
      "zh-CHS": "请注意，本文件中的术语“资源”与ITU术语“托管对象”同义。"
    },
    {
      "indent": 3,
      "text": "This YANG module references [RFC6991], [X.721], [X.733], and [X.736].",
      "zh-CHS": "此模块参考[RFC6991]、[X.721]、[X.733]和[X.736]。"
    },
    {
      "indent": 3,
      "text": "<CODE BEGINS> file \"ietf-alarms-x733@2019-09-11.yang\"\nmodule ietf-alarms-x733 {\n  yang-version 1.1;\n  namespace \"urn:ietf:params:xml:ns:yang:ietf-alarms-x733\";\n  prefix x733;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "import ietf-alarms {\n  prefix al;\n}\nimport ietf-yang-types {\n  prefix yang;\n  reference\n    \"RFC 6991: Common YANG Data Types\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "organization \"IETF CCAMP Working Group\";",
      "zh-CHS": "组织“IETF CCAMP工作组”；"
    },
    {
      "indent": 5,
      "text": "contact\n  \"WG Web:   <https://trac.ietf.org/trac/ccamp>\n   WG List:  <mailto:ccamp@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Editor:   Stefan Vallin\n          <mailto:stefan@wallan.se>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": " Editor: Martin Bjorklund <mailto:mbj@tail-f.com>\"; description \"This module augments the ietf-alarms module with X.733 alarm parameters.",
      "zh-CHS": "编辑：Martin Bjorklund<mailto:mbj@tail-f、 com>“说明”此模块使用X.733报警参数扩充ietf报警模块。"
    },
    {
      "indent": 8,
      "text": "The following structures are augmented with the X.733 event type and probable cause:",
      "zh-CHS": "以下结构增加了X.733事件类型和可能原因："
    },
    {
      "indent": 9,
      "text": "1) alarms/alarm-inventory: all possible alarm types 2) alarms/alarm-list: every alarm in the system 3) alarm-notification: notifications indicating alarm-state changes 4) alarms/shelved-alarms",
      "zh-CHS": "1) 警报/警报清单：所有可能的警报类型2）警报/警报列表：系统中的每个警报3）警报通知：指示警报状态更改的通知4）警报/搁置警报"
    },
    {
      "indent": 8,
      "text": "The module also optionally allows the alarm-management system to configure the mapping from the ietf-alarms' alarm keys to the ITU tuple (event-type, probable-cause).",
      "zh-CHS": "该模块还可选地允许报警管理系统配置从ietf报警键到ITU元组（事件类型、可能原因）的映射。"
    },
    {
      "indent": 8,
      "text": "The mapping does not include a corresponding problem value specific to X.733. The recommendation is to use the 'alarm-type-qualifier' leaf, which serves the same purpose.",
      "zh-CHS": "映射不包括特定于X.733的相应问题值。建议使用“报警类型限定符”叶，其用途相同。"
    },
    {
      "indent": 8,
      "text": "The module uses an integer and a corresponding string for probable cause instead of a globally defined enumeration, in order to be able to manage conflicting enumeration definitions. A single globally defined enumeration is challenging to maintain.",
      "zh-CHS": "为了能够管理冲突的枚举定义，模块使用整数和对应的字符串作为可能原因，而不是全局定义的枚举。单个全局定义的枚举很难维护。"
    },
    {
      "indent": 8,
      "text": "The key words 'MUST', 'MUST NOT', 'REQUIRED', 'SHALL', 'SHALL NOT', 'SHOULD', 'SHOULD NOT', 'RECOMMENDED', 'NOT RECOMMENDED', 'MAY', and 'OPTIONAL' in this document are to be interpreted as described in BCP 14 (RFC 2119) (RFC 8174) when, and only when, they appear in all capitals, as shown here.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可能”和“可选”在所有大写字母出现时（如图所示）应按照BCP 14（RFC 2119）（RFC 8174）所述进行解释。"
    },
    {
      "indent": 8,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as authors of the code. All rights reserved.",
      "zh-CHS": "版权（c）2019 IETF信托基金和被认定为代码作者的人员。版权所有。"
    },
    {
      "indent": 8,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set",
      "zh-CHS": "根据简化BSD许可证集中包含的许可条款，允许以源代码和二进制格式重新分发和使用，无论是否进行修改"
    },
    {
      "indent": 8,
      "text": "forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info).",
      "zh-CHS": "IETF信托法律条款第4.c节中关于IETF文件的第四条(https://trustee.ietf.org/license-info)."
    },
    {
      "indent": 5,
      "text": "   This version of this YANG module is part of RFC 8632; see\n   the RFC itself for full legal notices.\";\nreference\n  \"ITU-T Recommendation X.733: Information Technology\n     - Open Systems Interconnection\n     - System Management: Alarm Reporting Function\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "revision 2019-09-11 {\n  description\n    \"Initial revision.\";\n  reference\n    \"RFC 8632: A YANG Data Model for Alarm Management\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "/*\n * Features\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "feature configure-x733-mapping {\n  description\n    \"The system supports configurable X733 mapping from\n     the ietf-alarms' alarm-type to X733 event-type\n     and probable-cause.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "/*\n * Typedefs\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "typedef event-type {\n  type enumeration {\n    enum other {\n      value 1;\n      description\n        \"None of the below.\";\n    }\n    enum communications-alarm {\n      value 2;\n      description\n        \"An alarm of this type is principally associated with the\n         procedures and/or processes required to convey\n         information from one point to another.\";\n    }\n    enum quality-of-service-alarm {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "  value 3;\n  description\n    \"An alarm of this type is principally associated with a\n     degradation in the quality of a service.\";\n}\nenum processing-error-alarm {\n  value 4;\n  description\n    \"An alarm of this type is principally associated with a\n     software or processing fault.\";\n}\nenum equipment-alarm {\n  value 5;\n  description\n    \"An alarm of this type is principally associated with an\n     equipment fault.\";\n}\nenum environmental-alarm {\n  value 6;\n  description\n    \"An alarm of this type is principally associated with a\n     condition relating to an enclosure in which the equipment\n     resides.\";\n}\nenum integrity-violation {\n  value 7;\n  description\n    \"An indication that information may have been illegally\n     modified, inserted, or deleted.\";\n}\nenum operational-violation {\n  value 8;\n  description\n    \"An indication that the provision of the requested service\n     was not possible due to the unavailability, malfunction,\n     or incorrect invocation of the service.\";\n}\nenum physical-violation {\n  value 9;\n  description\n    \"An indication that a physical resource has been violated\n     in a way that suggests a security attack.\";\n}\nenum security-service-or-mechanism-violation {\n  value 10;\n  description\n    \"An indication that a security attack has been detected by\n     a security service or mechanism.\";",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "    }\n    enum time-domain-violation {\n      value 11;\n      description\n        \"An indication that an event has occurred at an unexpected\n         or prohibited time.\";\n    }\n  }\n  description\n    \"The event types as defined by X.733 and X.736.\";\n  reference\n    \"ITU-T Recommendation X.733: Information Technology\n       - Open Systems Interconnection\n       - System Management: Alarm Reporting Function\n     ITU-T Recommendation X.736: Information Technology\n       - Open Systems Interconnection\n       - System Management: Security Alarm Reporting Function\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "typedef trend {\n  type enumeration {\n    enum less-severe {\n      description\n        \"There is at least one outstanding alarm of a\n         severity higher (more severe) than that in the\n         current alarm.\";\n    }\n    enum no-change {\n      description\n        \"The Perceived severity reported in the current\n         alarm is the same as the highest (most severe)\n         of any of the outstanding alarms\";\n    }\n    enum more-severe {\n      description\n        \"The Perceived severity in the current alarm is\n         higher (more severe) than that reported in any\n         of the outstanding alarms.\";\n    }\n  }\n  description\n    \"This type is used to describe the\n     severity trend of the alarming resource.\";\n  reference\n    \"ITU-T Recommendation X.721: Information Technology\n        - Open Systems Interconnection\n        - Structure of management information:\n          Definition of management information",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "          Module Attribute-ASN1Module\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "typedef value-type {\n  type union {\n    type int64;\n    type uint64;\n    type decimal64 {\n      fraction-digits 2;\n    }\n  }\n  description\n    \"A generic union type to match the ITU choice of\n     integer and real.\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "/*\n * Groupings\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "grouping x733-alarm-parameters {\n  description\n    \"Common X.733 parameters for alarms.\";\n  leaf event-type {\n    type event-type;\n    description\n      \"The X.733/X.736 event type for this alarm.\";\n  }\n  leaf probable-cause {\n    type uint32;\n    description\n      \"The X.733 probable cause for this alarm.\";\n  }\n  leaf probable-cause-string {\n    type string;\n    description\n      \"The user-friendly string matching\n       the probable cause integer value.  The string\n       SHOULD match the X.733 enumeration.  For example,\n       value 27 is 'localNodeTransmissionError'.\";\n  }\n  container threshold-information {\n    description\n      \"This parameter shall be present when the alarm\n       is a result of crossing a threshold. \";\n    leaf triggered-threshold {\n      type string;\n      description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "    \"The identifier of the threshold attribute that\n     caused the notification.\";\n}\nleaf observed-value {\n  type value-type;\n  description\n    \"The value of the gauge or counter that crossed\n     the threshold.  This may be different from the\n     threshold value if, for example, the gauge may\n     only take on discrete values.\";\n}\nchoice threshold-level {\n  description\n    \"In the case of a gauge, the threshold level specifies\n     a pair of threshold values: the first is the value\n     of the crossed threshold, and the second is its\n     corresponding hysteresis; in the case of a counter,\n     the threshold level specifies only the threshold\n     value.\";\n  case up {\n    leaf up-high {\n      type value-type;\n      description\n        \"The going-up threshold for raising the alarm.\";\n    }\n    leaf up-low {\n      type value-type;\n      description\n        \"The going-down threshold for clearing the alarm.\n         This is used for hysteresis functions for gauges.\";\n    }\n  }\n  case down {\n    leaf down-low {\n      type value-type;\n      description\n        \"The going-down threshold for raising the alarm.\";\n    }\n    leaf down-high {\n      type value-type;\n      description\n        \"The going-up threshold for clearing the alarm.\n         This is used for hysteresis functions for gauges.\";\n    }\n  }\n}\nleaf arm-time {\n  type yang:date-and-time;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "    description\n      \"For a gauge threshold, it's the time at which the\n       threshold was last re-armed; namely, it's the time after\n       the previous threshold crossing at which the hysteresis\n       value of the threshold was exceeded, thus again permitting\n       the generation of notifications when the threshold is\n       crossed.  For a counter threshold, it's the later of the\n       time at which the threshold offset was last applied or the\n       counter was last initialized (for resettable counters).\";\n  }\n}\nlist monitored-attributes {\n  uses attribute;\n  key \"id\";\n  description\n    \"The Monitored attributes parameter, when present, defines\n     one or more attributes of the resource and their\n     corresponding values at the time of the alarm.\";\n}\nleaf-list proposed-repair-actions {\n  type string;\n  description\n    \"This parameter, when present, is used if the cause is\n     known and the system being managed can suggest one or\n     more solutions (such as switch in standby equipment,\n     retry, and replace media).\";\n}\nleaf trend-indication {\n  type trend;\n  description\n    \"This parameter specifies the current severity\n     trend of the resource.  If present, it indicates\n     that there are one or more alarms ('outstanding\n     alarms') that have not been cleared and that\n     pertain to the same resource as this alarm\n     ('current alarm') does.  The possible values are:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "more-severe: The Perceived severity in the current alarm is higher (more severe) than that reported in any of the outstanding alarms.",
      "zh-CHS": "更严重：当前报警中的感知严重性高于（更严重）任何未完成报警中报告的严重性。"
    },
    {
      "indent": 14,
      "text": "no-change: The Perceived severity reported in the current alarm is the same as the highest (most severe) of any of the outstanding alarms.",
      "zh-CHS": "无变化：当前报警中报告的感知严重性与任何未完成报警中的最高（最严重）相同。"
    },
    {
      "indent": 14,
      "text": "less-severe: There is at least one outstanding alarm of a severity higher (more severe) than that in the current alarm.\";",
      "zh-CHS": "不太严重：至少有一个严重性高于（更严重）当前报警的未完成报警。“；"
    },
    {
      "indent": 7,
      "text": "}\nleaf backedup-status {\n  type boolean;\n  description\n    \"This parameter, when present, specifies whether or not the\n     object emitting the alarm has been backed up; therefore, it\n     is possible to know whether or not services provided to the\n     user have been disrupted when this parameter is included.\n     The use of this field in conjunction with the\n     'perceived-severity' field provides information in an\n     independent form to qualify the seriousness of the alarm and\n     the ability of the system as a whole to continue to provide\n     services.  If the value of this parameter is true, it\n     indicates that the object emitting the alarm has been backed\n     up; if false, the object has not been backed up.\";\n}\nleaf backup-object {\n  type al:resource;\n  description\n    \"This parameter SHALL be present when the 'backedup-status'\n     parameter is present and has the value 'true'.  This\n     parameter specifies the managed object instance that is\n     providing back-up services for the managed object to which\n     the notification pertains.  This parameter is useful, for\n     example, when the back-up object is from a pool of objects,\n     any of which may be dynamically allocated to replace a\n     faulty object.\";\n}\nlist additional-information {\n  key \"identifier\";\n  description\n    \"This parameter allows the inclusion of an additional\n     information set in the alarm.  It is a series of data\n     structures, each of which contains three items of\n     information: an identifier, a significance indicator,\n     and the problem information.\";\n  leaf identifier {\n    type string;\n    description\n      \"Identifies the data type of the information parameter.\";\n  }\n  leaf significant {\n    type boolean;\n    description\n      \"Set to 'true' if the receiving system must be able to\n       parse the contents of the information subparameter\n       for the event report to be fully understood.\";\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "    leaf information {\n      type string;\n      description\n        \"Additional information about the alarm.\";\n    }\n  }\n  leaf security-alarm-detector {\n    type al:resource;\n    description\n      \"This parameter identifies the detector of the security\n       alarm.\";\n  }\n  leaf service-user {\n    type al:resource;\n    description\n      \"This parameter identifies the service-user whose request\n       for service led to the generation of the security alarm.\";\n  }\n  leaf service-provider {\n    type al:resource;\n    description\n      \"This parameter identifies the intended service-provider\n       of the service that led to the generation of the security\n       alarm.\";\n  }\n  reference\n    \"ITU-T Recommendation X.733: Information Technology\n       - Open Systems Interconnection\n       - System Management: Alarm Reporting Function\n     ITU-T Recommendation X.736: Information Technology\n       - Open Systems Interconnection\n       - System Management: Security Alarm Reporting Function\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "grouping x733-alarm-definition-parameters {\n  description\n    \"Common X.733 parameters for alarm definitions.\n     This grouping is used to define those alarm\n     attributes that can be mapped from the alarm-type\n     mechanism in the ietf-alarms module.\";\n  leaf event-type {\n    type event-type;\n    description\n      \"The alarm type has this X.733/X.736 event type.\";\n  }\n  leaf probable-cause {\n    type uint32;\n    description",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "      \"The alarm type has this X.733 probable cause value.\n       This module defines probable cause as an integer\n       and not as an enumeration.  The reason being that the\n       primary use of probable cause is in the management\n       application if it is based on the X.733 standard.\n       However, most management applications have their own\n       defined enum definitions and merging enums from\n       different systems might create conflicts.  By using\n       a configurable uint32, the system can be configured\n       to match the enum values in the management application.\";\n  }\n  leaf probable-cause-string {\n    type string;\n    description\n      \"This string can be used to give a user-friendly string\n       to the probable cause value.\";\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "grouping attribute {\n  description\n    \"A grouping to match the ITU generic reference to\n     an attribute.\";\n  leaf id {\n    type al:resource;\n    description\n      \"The resource representing the attribute.\";\n  }\n  leaf value {\n    type string;\n    description\n      \"The value represented as a string since it could\n       be of any type.\";\n  }\n  reference\n    \"ITU-T Recommendation X.721: Information Technology\n        - Open Systems Interconnection\n        - Structure of management information:\n          Definition of management information\n     Module Attribute-ASN1Module\";\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "/*\n * Add X.733 parameters to the alarm definitions, alarms,\n * and notification.\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "augment \"/al:alarms/al:alarm-inventory/al:alarm-type\" {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "  description\n    \"Augment X.733 mapping information to the alarm inventory.\";\n  uses x733-alarm-definition-parameters;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "/*\n * Add X.733 configurable mapping.\n */",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "augment \"/al:alarms/al:control\" {\n  description\n    \"Add X.733 mapping capabilities. \";\n  list x733-mapping {\n    if-feature \"configure-x733-mapping\";\n    key \"alarm-type-id alarm-type-qualifier-match\";\n    description\n      \"This list allows a management application to control the\n       X.733 mapping for all alarm types in the system.  Any entry\n       in this list will allow the alarm manager to override the\n       default X.733 mapping in the system, and the final mapping\n       will be shown in the alarm inventory.\";\n    leaf alarm-type-id {\n      type al:alarm-type-id;\n      description\n        \"Map the alarm type with this alarm type identifier.\";\n    }\n    leaf alarm-type-qualifier-match {\n      type string;\n      description\n        \"A W3C regular expression that is used when mapping an\n         alarm type and alarm-type-qualifier to X.733 parameters.\";\n    }\n    uses x733-alarm-definition-parameters;\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "augment \"/al:alarms/al:alarm-list/al:alarm\" {\n  description\n    \"Augment X.733 information to the alarm.\";\n  uses x733-alarm-parameters;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "augment \"/al:alarms/al:shelved-alarms/al:shelved-alarm\" {\n  description\n    \"Augment X.733 information to the alarm.\";\n  uses x733-alarm-parameters;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "  augment \"/al:alarm-notification\" {\n    description\n      \"Augment X.733 information to the alarm notification.\";\n    uses x733-alarm-parameters;\n  }\n}\n<CODE ENDS>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "zh-CHS": "8. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document registers two URIs in the \"IETF XML Registry\" [RFC3688]. Following the format in RFC 3688, the following registrations have been made.",
      "zh-CHS": "本文档在“IETF XML注册表”[RFC3688]中注册了两个URI。按照RFC 3688中的格式，进行了以下注册。"
    },
    {
      "indent": 7,
      "text": "URI: urn:ietf:params:xml:ns:yang:ietf-alarms Registrant Contact: The IESG. XML: N/A; the requested URI is an XML namespace.",
      "zh-CHS": "URI:urn:ietf:params:xml:ns:yang:ietf报警注册人联系人：IESG。XML：不适用；请求的URI是一个XML命名空间。"
    },
    {
      "indent": 7,
      "text": "URI: urn:ietf:params:xml:ns:yang:ietf-alarms-x733 Registrant Contact: The IESG. XML: N/A; the requested URI is an XML namespace.",
      "zh-CHS": "URI:urn:ietf:params:xml:ns:yang:ietf-alarms-x733注册人联系人：IESG。XML：不适用；请求的URI是一个XML命名空间。"
    },
    {
      "indent": 3,
      "text": "This document registers two YANG modules in the \"YANG Module Names\" registry [RFC6020].",
      "zh-CHS": "本文件在“阳模块名称”注册表[RFC6020]中注册了两个阳模块。"
    },
    {
      "indent": 7,
      "text": "name:        ietf-alarms\nnamespace:   urn:ietf:params:xml:ns:yang:ietf-alarms\nprefix:      al\nreference:   RFC 8632",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "name:        ietf-alarms-x733\nnamespace:   urn:ietf:params:xml:ns:yang:ietf-alarms-x733\nprefix:      x733\nreference:   RFC 8632",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "zh-CHS": "9. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The YANG modules specified in this document define a schema for data that is designed to be accessed via network management protocols such as NETCONF [RFC6241] or RESTCONF [RFC8040]. The lowest NETCONF layer is the secure transport layer, and the mandatory-to-implement secure transport is Secure Shell (SSH) [RFC6242]. The lowest RESTCONF layer is HTTPS, and the mandatory-to-implement secure transport is TLS [RFC8446].",
      "zh-CHS": "本文档中指定的模块为数据定义了一个模式，该模式旨在通过网络管理协议（如NETCONF[RFC6241]或restcconf[RFC8040]）进行访问。最低的NETCONF层是安全传输层，实现安全传输的强制要求是安全Shell（SSH）[RFC6242]。最低的RESTCONF层是HTTPS，实现安全传输的强制层是TLS[RFC8446]。"
    },
    {
      "indent": 3,
      "text": "The Network Configuration Access Control Model (NACM) [RFC8341] provides the means to restrict access for particular NETCONF or RESTCONF users to a preconfigured subset of all available NETCONF or RESTCONF protocol operations and content.",
      "zh-CHS": "网络配置访问控制模型（NACM）[RFC8341]提供了将特定NETCONF或RESTCONF用户的访问限制为所有可用NETCONF或RESTCONF协议操作和内容的预配置子集的方法。"
    },
    {
      "indent": 3,
      "text": "The list of alarms itself may be potentially sensitive from a security perspective, in that it potentially gives an attacker an authoritative picture of the (broken) state of the network.",
      "zh-CHS": "从安全角度来看，警报列表本身可能具有潜在的敏感性，因为它可能为攻击者提供网络（断开）状态的权威图片。"
    },
    {
      "indent": 3,
      "text": "There are a number of data nodes defined in the YANG modules that are writable/creatable/deletable (i.e., config true, which is the default). These data nodes may be considered sensitive or vulnerable in some network environments. Write operations (e.g., edit-config) to these data nodes without proper protection can have a negative effect on network operations. These are the subtrees and data nodes in the \"ietf-alarms\" module and their sensitivity/vulnerability:",
      "zh-CHS": "在YANG模块中定义了许多数据节点，这些节点是可写/可创建/可删除的（即config true，这是默认值）。在某些网络环境中，这些数据节点可能被视为敏感或易受攻击。对这些数据节点的写入操作（如编辑配置）如果没有适当的保护，可能会对网络操作产生负面影响。这些是“ietf警报”模块中的子树和数据节点及其灵敏度/漏洞："
    },
    {
      "indent": 3,
      "text": "\"/alarms/control/notify-status-changes\": This leaf controls whether an alarm should notify based on various state changes. Unauthorized access to this leaf could have a negative impact on operational procedures relying on fine-grained alarm-state change reporting.",
      "zh-CHS": "“/alarms/control/notify status changes”：此叶控制报警是否应基于各种状态更改进行通知。未经授权访问此叶可能会对依赖细粒度报警状态更改报告的操作程序产生负面影响。"
    },
    {
      "indent": 3,
      "text": "\"/alarms/control/alarm-shelving/shelf\": This list controls the shelving (blocking) of alarms. Unauthorized access to this list could jeopardize the alarm-management procedures, since these alarms will not be notified or be part of the alarm list.",
      "zh-CHS": "“/alarms/control/alarm shelving/shelf”：此列表控制报警的搁置（阻止）。未经授权访问此列表可能会危及报警管理程序，因为这些报警不会被通知或成为报警列表的一部分。"
    },
    {
      "indent": 3,
      "text": "\"/alarms/control/alarm-profile/alarm-severity-assignment-profile\": This list controls the severity levels of an alarm. Unauthorized access to this could, for example, downgrade the severity of an alarm and thereby have a negative impact on the alarm-monitoring process.",
      "zh-CHS": "“/alarms/control/alarm profile/alarm severity assignment profile”：此列表控制报警的严重性级别。例如，未经授权的访问可能会降低报警的严重性，从而对报警监控过程产生负面影响。"
    },
    {
      "indent": 3,
      "text": "Some of the RPC operations in this YANG module may be considered sensitive or vulnerable in some network environments. It is thus important to control access to these operations. These are the operations and their sensitivity/vulnerability:",
      "zh-CHS": "在某些网络环境中，此模块中的某些RPC操作可能被视为敏感或易受攻击。因此，控制对这些操作的访问非常重要。这些是操作及其敏感性/脆弱性："
    },
    {
      "indent": 3,
      "text": "\"/alarms/alarm-list/purge-alarms\": This action deletes alarms from the alarm list. Unauthorized use of this action could jeopardize the alarm-management procedures since the deleted alarms may be vital for the alarm-management application.",
      "zh-CHS": "“/alarms/alarm list/purge alarms”：此操作从报警列表中删除报警。未经授权使用此操作可能会危及报警管理程序，因为删除的报警可能对报警管理应用程序至关重要。"
    },
    {
      "indent": 3,
      "text": "\"/alarms/alarm-list/alarm/set-operator-state\": This action can be used by the operator to indicate the level of human intervention on an alarm. Unauthorized use of this action could result in alarms being ignored by operators.",
      "zh-CHS": "“/alarms/alarm list/alarm/set operator state”（报警/报警列表/报警/设置操作员状态）：操作员可使用此操作指示报警的人为干预级别。未经授权使用此操作可能导致操作员忽略报警。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[M.3100] International Telecommunication Union, \"Generic network information model\", ITU-T Recommendation M.3100, April 2005, <https://www.itu.int/rec/T-REC-M.3100-200504-I/en>.",
      "zh-CHS": "[M.3100]国际电信联盟，“通用网络信息模型”，ITU-T建议M.3100，2005年4月<https://www.itu.int/rec/T-REC-M.3100-200504-I/en>."
    },
    {
      "indent": 3,
      "text": "[M.3160] International Telecommunication Union, \"Generic, protocol-neutral management information model\", ITU-T Recommendation M.3100, November 2008, <https://www.itu.int/rec/T-REC-M.3160-200811-I>.",
      "zh-CHS": "[M.3160]国际电信联盟，“通用、协议中立的管理信息模型”，ITU-T建议M.3100，2008年11月<https://www.itu.int/rec/T-REC-M.3160-200811-I>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<https://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC3688] Mealling, M., \"The IETF XML Registry\", BCP 81, RFC 3688, DOI 10.17487/RFC3688, January 2004, <https://www.rfc-editor.org/info/rfc3688>.",
      "zh-CHS": "[RFC3688]Mealling，M.，“IETF XML注册表”，BCP 81，RFC 3688，DOI 10.17487/RFC3688，2004年1月<https://www.rfc-editor.org/info/rfc3688>."
    },
    {
      "indent": 3,
      "text": "[RFC6020] Bjorklund, M., Ed., \"YANG - A Data Modeling Language for the Network Configuration Protocol (NETCONF)\", RFC 6020, DOI 10.17487/RFC6020, October 2010, <https://www.rfc-editor.org/info/rfc6020>.",
      "zh-CHS": "[RFC6020]Bjorklund，M.，Ed.“YANG-网络配置协议的数据建模语言（NETCONF）”，RFC 6020，DOI 10.17487/RFC6020，2010年10月<https://www.rfc-editor.org/info/rfc6020>."
    },
    {
      "indent": 3,
      "text": "[RFC6241] Enns, R., Ed., Bjorklund, M., Ed., Schoenwaelder, J., Ed., and A. Bierman, Ed., \"Network Configuration Protocol (NETCONF)\", RFC 6241, DOI 10.17487/RFC6241, June 2011, <https://www.rfc-editor.org/info/rfc6241>.",
      "zh-CHS": "[RFC6241]Enns，R.，Ed.，Bjorklund，M.，Ed.，Schoenwaeld，J.，Ed.，和A.Bierman，Ed.，“网络配置协议（NETCONF）”，RFC 6241，DOI 10.17487/RFC6241，2011年6月<https://www.rfc-editor.org/info/rfc6241>."
    },
    {
      "indent": 3,
      "text": "[RFC6242] Wasserman, M., \"Using the NETCONF Protocol over Secure Shell (SSH)\", RFC 6242, DOI 10.17487/RFC6242, June 2011, <https://www.rfc-editor.org/info/rfc6242>.",
      "zh-CHS": "[RFC6242]Wasserman，M.“在安全外壳上使用NETCONF协议（SSH）”，RFC 6242，DOI 10.17487/RFC6242，2011年6月<https://www.rfc-editor.org/info/rfc6242>."
    },
    {
      "indent": 3,
      "text": "[RFC6991] Schoenwaelder, J., Ed., \"Common YANG Data Types\", RFC 6991, DOI 10.17487/RFC6991, July 2013, <https://www.rfc-editor.org/info/rfc6991>.",
      "zh-CHS": "[RFC6991]Schoenwaeld，J.，Ed.，“常见杨数据类型”，RFC 6991，DOI 10.17487/RFC69911913年7月<https://www.rfc-editor.org/info/rfc6991>."
    },
    {
      "indent": 3,
      "text": "[RFC7950] Bjorklund, M., Ed., \"The YANG 1.1 Data Modeling Language\", RFC 7950, DOI 10.17487/RFC7950, August 2016, <https://www.rfc-editor.org/info/rfc7950>.",
      "zh-CHS": "[RFC7950]Bjorklund，M.，Ed.“YANG 1.1数据建模语言”，RFC 7950，DOI 10.17487/RFC7950，2016年8月<https://www.rfc-editor.org/info/rfc7950>."
    },
    {
      "indent": 3,
      "text": "[RFC8040] Bierman, A., Bjorklund, M., and K. Watsen, \"RESTCONF Protocol\", RFC 8040, DOI 10.17487/RFC8040, January 2017, <https://www.rfc-editor.org/info/rfc8040>.",
      "zh-CHS": "[RFC8040]Bierman，A.，Bjorklund，M.，和K.Watsen，“RESTCONF协议”，RFC 8040，DOI 10.17487/RFC8040，2017年1月<https://www.rfc-editor.org/info/rfc8040>."
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "zh-CHS": "[RFC8174]Leiba，B.，“RFC 2119关键词中大写与小写的歧义”，BCP 14，RFC 8174，DOI 10.17487/RFC8174，2017年5月<https://www.rfc-editor.org/info/rfc8174>."
    },
    {
      "indent": 3,
      "text": "[RFC8341] Bierman, A. and M. Bjorklund, \"Network Configuration Access Control Model\", STD 91, RFC 8341, DOI 10.17487/RFC8341, March 2018, <https://www.rfc-editor.org/info/rfc8341>.",
      "zh-CHS": "[RFC8341]Bierman，A.和M.Bjorklund，“网络配置访问控制模型”，STD 91，RFC 8341，DOI 10.17487/RFC8341，2018年3月<https://www.rfc-editor.org/info/rfc8341>."
    },
    {
      "indent": 3,
      "text": "[RFC8348] Bierman, A., Bjorklund, M., Dong, J., and D. Romascanu, \"A YANG Data Model for Hardware Management\", RFC 8348, DOI 10.17487/RFC8348, March 2018, <https://www.rfc-editor.org/info/rfc8348>.",
      "zh-CHS": "[RFC8348]Bierman，A.，Bjorklund，M.，Dong，J.，和D.Romascanu，“硬件管理的杨数据模型”，RFC 8348，DOI 10.17487/RFC8348，2018年3月<https://www.rfc-editor.org/info/rfc8348>."
    },
    {
      "indent": 3,
      "text": "[RFC8446] Rescorla, E., \"The Transport Layer Security (TLS) Protocol Version 1.3\", RFC 8446, DOI 10.17487/RFC8446, August 2018, <https://www.rfc-editor.org/info/rfc8446>.",
      "zh-CHS": "[RFC8446]Rescorla，E.“传输层安全（TLS）协议版本1.3”，RFC 8446，DOI 10.17487/RFC8446，2018年8月<https://www.rfc-editor.org/info/rfc8446>."
    },
    {
      "indent": 3,
      "text": "[X.721] International Telecommunication Union, \"Information technology - Open Systems Interconnection - Structure of management information: Definition of management information\", ITU-T Recommendation X.721, February 1992, <https://www.itu.int/rec/T-REC-X.721-199202-I/en>.",
      "zh-CHS": "[X.721]国际电信联盟，“信息技术-开放系统互连-管理信息的结构：管理信息的定义”，ITU-T建议X.721，1992年2月<https://www.itu.int/rec/T-REC-X.721-199202-I/en>."
    },
    {
      "indent": 3,
      "text": "[X.733] International Telecommunication Union, \"Information technology - Open Systems Interconnection - Systems Management: Alarm reporting function\", ITU-T Recommendation X.733, February 1992, <https://www.itu.int/rec/T-REC-X.733-199202-I/en>.",
      "zh-CHS": "[X.733]国际电信联盟，“信息技术-开放系统互连-系统管理：报警报告功能”，ITU-T建议X.733，1992年2月<https://www.itu.int/rec/T-REC-X.733-199202-I/en>."
    },
    {
      "indent": 3,
      "text": "[XSD-TYPES] Malhotra, A. and P. Biron, \"XML Schema Part 2: Datatypes Second Edition\", World Wide Web Consortium Recommendation REC-xmlschema-2-20041028, October 2004, <http://www.w3.org/TR/2004/REC-xmlschema-2-20041028>.",
      "zh-CHS": "[XSD-TYPES]Malhotra，A.和P.Biron，“XML模式第2部分：数据类型第二版”，万维网联盟建议REC-xmlschema-2-20041028，2004年10月<http://www.w3.org/TR/2004/REC-xmlschema-2-20041028>."
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[ALARMIRP] 3GPP, \"Telecommunication management; Fault Management; Part 2: Alarm Integration Reference Point (IRP): Information Service (IS)\", 3GPP TS 32.111-2, March 2005, <http://www.3gpp.org/ftp/Specs/html-info/32111-2.htm>.",
      "zh-CHS": "[ALARMIRP]3GPP，“电信管理；故障管理；第2部分：报警集成参考点（IRP）：信息服务（IS）”，3GPP TS 32.111-22005年3月<http://www.3gpp.org/ftp/Specs/html-info/32111-2.htm>."
    },
    {
      "indent": 3,
      "text": "[ALARMSEM] Wallin, S., Leijon, V., Nordlander, J., and N. Bystedt, \"The semantics of alarm definitions: enabling systematic reasoning about alarms\", International Journal of Network Management, Volume 22, Issue 3, May 2012, <http://dx.doi.org/10.1002/nem.800>.",
      "zh-CHS": "[ALARMSEM]Wallin，S.，Leijon，V.，Nordlander，J.，和N.Bystedt，“报警定义的语义：启用报警的系统推理”，《国际网络管理杂志》，第22卷，第3期，2012年5月<http://dx.doi.org/10.1002/nem.800>."
    },
    {
      "indent": 3,
      "text": "[EEMUA] \"Alarm systems: a guide to design, management and procurement\", EEMUA Publication No. 191, Engineering Equipment and Materials Users Association, Second Edition, 2007.",
      "zh-CHS": "[EEMUA]“报警系统：设计、管理和采购指南”，EEMUA第191号出版物，工程设备和材料用户协会，第二版，2007年。"
    },
    {
      "indent": 3,
      "text": "[G.7710] International Telecommunication Union, \"SERIES G: TRANSMISSION SYSTEMS AND MEDIA, DIGITAL SYSTEMS AND NETWORKS - Data over Transport - Generic aspects - Transport network control aspects; Common equipment management function requirements\", ITU-T Recommendation G.7710/Y.1701, Amendment 1, November 2012.",
      "zh-CHS": "[G.7710]国际电信联盟，“G系列：传输系统和媒体、数字系统和网络-传输数据-通用方面-传输网络控制方面；通用设备管理功能要求”，ITU-T建议G.7710/Y.1701，修改件1，2012年11月。"
    },
    {
      "indent": 3,
      "text": "[ISA182] International Society of Automation, \"Management of Alarm Systems for the Process Industries\", ANSI/ISA - 18.2-2016, March 2016.",
      "zh-CHS": "[ISA182]国际自动化学会，“过程工业报警系统的管理”，ANSI/ISA-18.2-2016，2016年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3877] Chisholm, S. and D. Romascanu, \"Alarm Management Information Base (MIB)\", RFC 3877, DOI 10.17487/RFC3877, September 2004, <https://www.rfc-editor.org/info/rfc3877>.",
      "zh-CHS": "[RFC3877]Chisholm，S.和D.Romascanu，“报警管理信息库（MIB）”，RFC 3877，DOI 10.17487/RFC3877，2004年9月<https://www.rfc-editor.org/info/rfc3877>."
    },
    {
      "indent": 3,
      "text": "[RFC8340] Bjorklund, M. and L. Berger, Ed., \"YANG Tree Diagrams\", BCP 215, RFC 8340, DOI 10.17487/RFC8340, March 2018, <https://www.rfc-editor.org/info/rfc8340>.",
      "zh-CHS": "[RFC8340]Bjorklund，M.和L.Berger，编辑，“杨树图”，BCP 215，RFC 8340，DOI 10.17487/RFC8340，2018年3月<https://www.rfc-editor.org/info/rfc8340>."
    },
    {
      "indent": 3,
      "text": "[X.736] International Telecommunication Union, \"Information technology - Open Systems Interconnection - Systems Management: Security alarm reporting function\", ITU-T Recommendation X.736, January 1992, <https://www.itu.int/rec/T-REC-X.736-199201-I/en>.",
      "zh-CHS": "[X.736]国际电信联盟，“信息技术-开放系统互连-系统管理：安全警报报告功能”，ITU-T建议X.736，1992年1月<https://www.itu.int/rec/T-REC-X.736-199201-I/en>."
    },
    {
      "indent": 3,
      "text": "[YANG-INSTANCE] Lengyel, B. and B. Claise, \"YANG Instance Data File Format\", Work in Progress, draft-ietf-netmod-yang-instance-file-format-02, August 2019.",
      "zh-CHS": "[YANG-INSTANCE]Lengyel，B.和B.Claise，“YANG-INSTANCE数据文件格式”，正在进行的工作，草稿-ietf-netmod-YANG-INSTANCE-File-Format-022019年8月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Vendor-Specific Alarm Types Example",
      "section_title": true,
      "zh-CHS": "附录A.供应商特定报警类型示例"
    },
    {
      "indent": 3,
      "text": "This example shows how to define alarm types in a vendor-specific module. In this case, the vendor \"xyz\" has chosen to define top-level identities according to X.733 event types.",
      "zh-CHS": "此示例显示如何在特定于供应商的模块中定义报警类型。在这种情况下，供应商“xyz”已选择根据X.733事件类型定义顶级标识。"
    },
    {
      "indent": 3,
      "text": "module example-xyz-alarms {\n  namespace \"urn:example:xyz-alarms\";\n  prefix xyz-al;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "import ietf-alarms {\n  prefix al;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "identity xyz-alarms {\n  base al:alarm-type-id;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "identity communications-alarm {\n  base xyz-alarms;\n}\nidentity quality-of-service-alarm {\n  base xyz-alarms;\n}\nidentity processing-error-alarm {\n  base xyz-alarms;\n}\nidentity equipment-alarm {\n  base xyz-alarms;\n}\nidentity environmental-alarm {\n  base xyz-alarms;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "// communications alarms\nidentity link-alarm {\n  base communications-alarm;\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "  // QoS alarms\n  identity high-jitter-alarm {\n    base quality-of-service-alarm;\n  }\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Appendix B. Alarm Inventory Example",
      "section_title": true,
      "zh-CHS": "附录B.警报清单示例"
    },
    {
      "indent": 3,
      "text": "This shows an alarm inventory: one alarm type is defined only with the identifier and another is dynamically configured. In the latter case, a digital input has been connected to a smoke detector; therefore, the \"alarm-type-qualifier\" is set to \"smoke-detector\" and the \"alarm-type-id\" to \"environmental-alarm\".",
      "zh-CHS": "这将显示报警清单：一个报警类型仅使用标识符定义，另一个是动态配置的。在后一种情况下，数字输入已连接到烟雾探测器；因此，“报警类型限定符”设置为“烟雾探测器”，“报警类型id”设置为“环境报警”。"
    },
    {
      "indent": 3,
      "text": "<alarms xmlns=\"urn:ietf:params:xml:ns:yang:ietf-alarms\"\n        xmlns:xyz-al=\"urn:example:xyz-alarms\"\n        xmlns:dev=\"urn:example:device\">\n  <alarm-inventory>\n    <alarm-type>\n      <alarm-type-id>xyz-al:link-alarm</alarm-type-id>\n      <alarm-type-qualifier/>\n      <resource>\n        /dev:interfaces/dev:interface\n      </resource>\n      <will-clear>true</will-clear>\n      <description>\n        Link failure; operational state down but admin state up\n      </description>\n    </alarm-type>\n    <alarm-type>\n      <alarm-type-id>xyz-al:environmental-alarm</alarm-type-id>\n      <alarm-type-qualifier>smoke-alarm</alarm-type-qualifier>\n      <will-clear>true</will-clear>\n      <description>\n        Connected smoke detector to digital input\n      </description>\n    </alarm-type>\n  </alarm-inventory>\n</alarms>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Appendix C. Alarm List Example",
      "section_title": true,
      "zh-CHS": "附录C.警报列表示例"
    },
    {
      "indent": 3,
      "text": "In this example, we show an alarm that has toggled [major, clear, major]. An operator has acknowledged the alarm.",
      "zh-CHS": "在本例中，我们显示了一个已切换[主、清除、主]的报警。操作员已确认警报。"
    },
    {
      "indent": 3,
      "text": "<alarms xmlns=\"urn:ietf:params:xml:ns:yang:ietf-alarms\"\n        xmlns:xyz-al=\"urn:example:xyz-alarms\"\n        xmlns:dev=\"urn:example:device\">\n  <alarm-list>\n    <number-of-alarms>1</number-of-alarms>\n    <last-changed>2018-04-08T08:39:50.00Z</last-changed>\n    <alarm>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "      <resource>\n        /dev:interfaces/dev:interface[name='FastEthernet1/0']\n      </resource>\n      <alarm-type-id>xyz-al:link-alarm</alarm-type-id>\n      <alarm-type-qualifier></alarm-type-qualifier>\n      <time-created>2018-04-08T08:20:10.00Z</time-created>\n      <is-cleared>false</is-cleared>\n      <alt-resource>1.3.6.1.2.1.2.2.1.1.17</alt-resource>\n      <last-raised>2018-04-08T08:39:40.00Z</last-raised>\n      <last-changed>2018-04-08T08:39:50.00Z</last-changed>\n      <perceived-severity>major</perceived-severity>\n      <alarm-text>\n        Link operationally down but administratively up\n      </alarm-text>\n      <status-change>\n        <time>2018-04-08T08:39:40.00Z</time>\n        <perceived-severity>major</perceived-severity>\n        <alarm-text>\n          Link operationally down but administratively up\n        </alarm-text>\n      </status-change>\n      <status-change>\n        <time>2018-04-08T08:30:00.00Z</time>\n        <perceived-severity>cleared</perceived-severity>\n        <alarm-text>\n          Link operationally up and administratively up\n        </alarm-text>\n      </status-change>\n      <status-change>\n        <time>2018-04-08T08:20:10.00Z</time>\n        <perceived-severity>major</perceived-severity>\n        <alarm-text>\n          Link operationally down but administratively up\n        </alarm-text>\n      </status-change>\n      <operator-state-change>\n        <time>2018-04-08T08:39:50.00Z</time>\n        <state>ack</state>\n        <operator>joe</operator>\n        <text>Will investigate, ticket TR764999</text>\n      </operator-state-change>\n    </alarm>\n  </alarm-list>\n</alarms>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Appendix D. Alarm Shelving Example",
      "section_title": true,
      "zh-CHS": "附录D.警报搁置示例"
    },
    {
      "indent": 3,
      "text": "This example shows how to shelve alarms. We shelve alarms related to the smoke detectors, since they are being installed and tested. We also shelve all alarms from FastEthernet1/0.",
      "zh-CHS": "此示例显示如何搁置警报。我们搁置了与烟雾探测器相关的警报，因为它们正在安装和测试。我们还搁置了FastEthernet1/0的所有警报。"
    },
    {
      "indent": 3,
      "text": "<alarms xmlns=\"urn:ietf:params:xml:ns:yang:ietf-alarms\"\n        xmlns:xyz-al=\"urn:example:xyz-alarms\"\n        xmlns:dev=\"urn:example:device\">\n  <control>\n    <alarm-shelving>\n      <shelf>\n        <name>FE10</name>\n        <resource>\n          /dev:interfaces/dev:interface[name='FastEthernet1/0']\n        </resource>\n      </shelf>\n      <shelf>\n        <name>detectortest</name>\n        <alarm-type>\n          <alarm-type-id>\n            xyz-al:environmental-alarm\n          </alarm-type-id>\n          <alarm-type-qualifier-match>\n            smoke-alarm\n          </alarm-type-qualifier-match>\n        </alarm-type>\n      </shelf>\n    </alarm-shelving>\n  </control>\n</alarms>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Appendix E. X.733 Mapping Example",
      "section_title": true,
      "zh-CHS": "附录E.X.733映射示例"
    },
    {
      "indent": 3,
      "text": "This example shows how to map a dynamic alarm type (alarm-type-id=environmental-alarm, alarm-type-qualifier=smoke-alarm) to the corresponding X.733 \"event-type\" and \"probable-cause\" parameters.",
      "zh-CHS": "此示例显示如何将动态报警类型（报警类型id=环境报警，报警类型限定符=烟雾报警）映射到相应的X.733“事件类型”和“可能原因”参数。"
    },
    {
      "indent": 3,
      "text": "<alarms xmlns=\"urn:ietf:params:xml:ns:yang:ietf-alarms\"\n        xmlns:xyz-al=\"urn:example:xyz-alarms\">\n  <control>\n    <x733-mapping\n       xmlns=\"urn:ietf:params:xml:ns:yang:ietf-alarms-x733\">\n      <alarm-type-id>xyz-al:environmental-alarm</alarm-type-id>\n      <alarm-type-qualifier-match>\n        smoke-alarm\n      </alarm-type-qualifier-match>\n      <event-type>quality-of-service-alarm</event-type>\n      <probable-cause>777</probable-cause>\n    </x733-mapping>\n  </control>\n</alarms>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Appendix F. Relationship to Other Alarm Standards",
      "section_title": true,
      "zh-CHS": "附录F.与其他报警标准的关系"
    },
    {
      "indent": 3,
      "text": "This section briefly describes how this alarm data model relates to other relevant standards.",
      "zh-CHS": "本节简要介绍了报警数据模型与其他相关标准的关系。"
    },
    {
      "indent": 0,
      "text": "F.1. Definition of \"Alarm\"",
      "section_title": true,
      "zh-CHS": "F.1. “警报”的定义"
    },
    {
      "indent": 3,
      "text": "The table below summarizes relevant definitions of the term \"alarm\" in other alarm standards.",
      "zh-CHS": "下表总结了其他报警标准中“报警”一词的相关定义。"
    },
    {
      "indent": 3,
      "text": "+------------+---------------------------+--------------------------+\n| Standard   | Definition                | Comment                  |\n+------------+---------------------------+--------------------------+\n| X.733      | error: A deviation of a   | The X.733 alarm          |\n| [X.733]    | system from normal        | definition is focused on |\n|            | operation.  fault: The    | the notification as such |\n|            | physical or algorithmic   | and not the state.       |\n|            | cause of a malfunction.   | X.733 defines an alarm   |\n|            | Faults manifest           | as a deviation from a    |\n|            | themselves as errors.     | normal condition but     |\n|            | alarm: A notification, of | without the requirement  |\n|            | the form defined by this  | that it needs corrective |\n|            | function, of a specific   | actions.                 |\n|            | event.  An alarm may or   |                          |\n|            | may not represent an      |                          |\n|            | error.                    |                          |\n|            |                           |                          |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "| G.7710     | Alarms are indications    | The G.7710 definition is |\n| [G.7710]   | that are automatically    | close to the original    |\n|            | generated by a device as  | X.733 definition.        |\n|            | a result of the           |                          |\n|            | declaration of a failure. |                          |\n|            |                           |                          |\n| Alarm MIB  | Alarm: Persistent         | RFC 3877 defines the     |\n| [RFC3877]  | indication of a fault.    | term alarm as referring  |\n|            | Fault: Lasting error or   | back to \"a deviation     |\n|            | warning condition.        | from normal operation\".  |\n|            | Error: A deviation of a   | The Alarm YANG data      |\n|            | system from normal        | model adds the           |\n|            | operation.                | requirement that it      |\n|            |                           | should require a         |\n|            |                           | corrective action and    |\n|            |                           | should be undesired, not |\n|            |                           | only a deviation from    |\n|            |                           | normal.  The alarm MIB   |\n|            |                           | is state oriented in the |\n|            |                           | same way as the Alarm    |\n|            |                           | YANG module; it focuses  |\n|            |                           | on the  \"lasting         |\n|            |                           | condition\", not the      |\n|            |                           | individual               |\n|            |                           | notifications.           |\n|            |                           |                          |\n| ISA        | Alarm: An audible and/or  | The ISA standard adds an |\n| [ISA182]   | visible means of          | important requirement to |\n|            | indicating to the         | the \"deviation from      |\n|            | operator an equipment     | normal condition state\": |\n|            | malfunction, process      | requiring a response.    |\n|            | deviation, or abnormal    |                          |\n|            | condition requiring a     |                          |\n|            | response.                 |                          |\n|            |                           |                          |\n| EEMUA      | An alarm is an event to   | This is the foundation   |\n| [EEMUA]    | which an operator must    | for the definition of    |\n|            | knowingly react, respond, | alarm in this document.  |\n|            | and acknowledge -- not    | It focuses on the core   |\n|            | simply acknowledge and    | criterion that an action |\n|            | ignore.                   | is really needed.        |\n|            |                           |                          |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "| 3GPP Alarm | 3GPP v15: An alarm        | The latest 3GPP Alarm    |\n| IRP        | signifies an undesired    | IRP version uses         |\n| [ALARMIRP] | condition of a resource   | literally the same alarm |\n|            | (e.g., device, link) for  | definition as this alarm |\n|            | which an operator action  | data model.  It is worth |\n|            | is required.  It          | noting that earlier      |\n|            | emphasizes a key          | versions used a          |\n|            | requirement that          | definition not requiring |\n|            | operators [...] should    | an operator action and   |\n|            | not be informed about an  | the more-broad           |\n|            | undesired condition       | definition of deviation  |\n|            | unless it requires        | from normal condition.   |\n|            | operator action.          | The earlier version also |\n|            | 3GPP v12: alarm: abnormal | defined an alarm as a    |\n|            | network entity condition, | special case of \"event\". |\n|            | which categorizes an      |                          |\n|            | event as a fault.         |                          |\n|            | fault: a deviation of a   |                          |\n|            | system from normal        |                          |\n|            | operation, which may      |                          |\n|            | result in the loss of     |                          |\n|            | operational capabilities  |                          |\n|            | [...]                     |                          |\n+------------+---------------------------+--------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Table 1: Definition of the Term \"Alarm\" in Standards",
      "zh-CHS": "表1：标准中“警报”一词的定义"
    },
    {
      "indent": 3,
      "text": "The evolution of the definition of alarm moves from focused on events reporting a deviation from normal operation towards a definition to a undesired *state* that *requires an operator action*.",
      "zh-CHS": "报警定义的演变从侧重于报告偏离正常运行的事件，转向了需要操作员采取行动的非期望*状态*。"
    },
    {
      "indent": 0,
      "text": "F.2. Data Model",
      "section_title": true,
      "zh-CHS": "F.2. 数据模型"
    },
    {
      "indent": 3,
      "text": "This section describes how this YANG alarm data model relates to other standard data models. Note well that we cover other data models for alarm interfaces but not other standards such as SDO-specific alarms.",
      "zh-CHS": "本节介绍此报警数据模型与其他标准数据模型的关系。请注意，我们介绍了报警接口的其他数据模型，但没有介绍其他标准，如SDO特定报警。"
    },
    {
      "indent": 0,
      "text": "F.2.1. X.733",
      "section_title": true,
      "zh-CHS": "F.2.1. X.733"
    },
    {
      "indent": 3,
      "text": "X.733 has acted as a base for several alarm data models over the years. The YANG alarm data model differs in the following ways:",
      "zh-CHS": "多年来，X.733一直是多个报警数据模型的基础。YANG报警数据模型在以下方面有所不同："
    },
    {
      "indent": 6,
      "text": "X.733 models the alarm list as a list of notifications. The YANG alarm data model defines the alarm list as the current alarm states for the resources, which is generated from the state change reporting notifications.",
      "zh-CHS": "X.733将报警列表建模为通知列表。YANG报警数据模型将报警列表定义为资源的当前报警状态，由状态更改报告通知生成。"
    },
    {
      "indent": 6,
      "text": "In X.733, an alarm can have the severity level \"clear\". In the YANG alarm data model, \"clear\" is not a severity level; it is a separate state of the alarm. An alarm can have the following states, for example, (major, cleared) and (minor, not cleared).",
      "zh-CHS": "在X.733中，警报的严重性级别为“清除”。在YANG报警数据模型中，“清除”不是严重级别；这是一个单独的报警状态。报警可以具有以下状态，例如，（主要，已清除）和（次要，未清除）。"
    },
    {
      "indent": 6,
      "text": "X.733 uses a flat, globally defined enumerated \"probable-cause\" to identify alarm types. This alarm data model uses a hierarchical YANG identity: \"alarm-type\". This enables delegation of alarm types within organizations. It also enables management to reason about abstract alarm types corresponding to base identities; see Section 3.2.",
      "zh-CHS": "X.733使用统一的、全局定义的枚举“可能原因”来识别报警类型。此报警数据模型使用分层标识：“报警类型”。这允许在组织内委派报警类型。它还允许管理层对与基本标识对应的抽象报警类型进行推理；见第3.2节。"
    },
    {
      "indent": 6,
      "text": "The YANG alarm data model has not included the majority of the X.733 alarm attributes. Rather, these are defined in an augmenting module [X.733] if \"strict\" X.733 compliance is needed.",
      "zh-CHS": "YANG报警数据模型未包含大多数X.733报警属性。相反，如果需要“严格”遵守X.733，则在扩充模块[X.733]中定义这些。"
    },
    {
      "indent": 0,
      "text": "F.2.2. The Alarm MIB (RFC 3877)",
      "section_title": true,
      "zh-CHS": "F.2.2. 报警MIB（RFC 3877）"
    },
    {
      "indent": 3,
      "text": "The MIB in RFC 3877 takes a different approach; rather than defining a concrete data model for alarms, it defines a model to map existing SNMP-managed objects and notifications into alarm states and alarm notifications. This was necessary since MIBs were already defined with both managed objects and notifications indicating alarms, for example, \"linkUp\" and \"linkDown\" notifications in combination with \"ifAdminState\" and \"ifOperState\". So, RFC 3877 cannot really be compared to the alarm YANG module in that sense.",
      "zh-CHS": "RFC3877中的MIB采用不同的方法；它没有为报警定义具体的数据模型，而是定义了一个模型，将现有的SNMP管理对象和通知映射到报警状态和报警通知中。这是必要的，因为MIB已经定义了托管对象和指示报警的通知，例如，“linkUp”和“linkDown”通知以及“ifAdminState”和“ifOperState”。因此，从这个意义上讲，RFC3877不能与报警模块相比较。"
    },
    {
      "indent": 3,
      "text": "The Alarm MIB maps existing MIB definitions into alarms, such as \"alarmModelTable\". The upside of that is that an SNMP Manager can, at runtime, read the possible alarm types. This corresponds to the \"alarmInventory\" in the alarm YANG module.",
      "zh-CHS": "报警MIB将现有MIB定义映射到报警中，例如“alarmModelTable”。这样做的好处是，SNMP管理器可以在运行时读取可能的报警类型。这与报警模块中的“报警清单”相对应。"
    },
    {
      "indent": 0,
      "text": "F.2.3. 3GPP Alarm IRP",
      "section_title": true,
      "zh-CHS": "F.2.3. 3GPP警报IRP"
    },
    {
      "indent": 3,
      "text": "The 3GPP Alarm IRP is an evolution of X.733. Main differences between the alarm YANG module and 3GPP are as follows:",
      "zh-CHS": "3GPP报警IRP是X.733的一种改进。报警模块与3GPP之间的主要区别如下："
    },
    {
      "indent": 6,
      "text": "3GPP keeps the majority of the X.733 attributes, but the alarm YANG module does not.",
      "zh-CHS": "3GPP保留了X.733的大部分属性，但报警模块没有。"
    },
    {
      "indent": 6,
      "text": "3GPP introduced overlapping and possibly conflicting keys for alarms, alarmId, and (managed object, event type, probable cause, specific problem). (See Example 3 in Annex C of [ALARMIRP]). In the YANG alarm data model, the key for identifying an alarm instance is clearly defined by (\"resource\", \"alarm-type-id\", \"alarm-type-qualifier\"). See also Section 3.4 for more information.",
      "zh-CHS": "3GPP为报警、alarmId和（受管对象、事件类型、可能原因、特定问题）引入了重叠且可能冲突的键。（参见[ALARMIRP]附录C中的示例3）。在YANG报警数据模型中，用于识别报警实例的键由（“资源”、“报警类型id”、“报警类型限定符”）明确定义。更多信息请参见第3.4节。"
    },
    {
      "indent": 6,
      "text": "The alarm YANG module clearly separates the resource/ instrumentation lifecycle from the operator lifecycle. 3GPP allows operators to set the alarm severity to clear; this is not allowed by this module. Rather, an operator closes an alarm, which does not affect the severity.",
      "zh-CHS": "报警模块清楚地将资源/仪器生命周期与操作员生命周期分开。3GPP允许操作员将警报严重性设置为清除；此模块不允许这样做。相反，操作员关闭警报，这不会影响严重性。"
    },
    {
      "indent": 0,
      "text": "F.2.4. G.7710",
      "section_title": true,
      "zh-CHS": "F.2.4. G.7710"
    },
    {
      "indent": 3,
      "text": "G.7710 is different than the previously referenced alarm standards. It does not define a data model for alarm reporting. It defines common equipment management function requirements including alarm instrumentation. The scope is transport networks.",
      "zh-CHS": "G.7710不同于先前参考的报警标准。它没有定义报警报告的数据模型。它定义了通用设备管理功能要求，包括报警仪表。范围是运输网络。"
    },
    {
      "indent": 3,
      "text": "The requirements in G.7710 correspond to features in the alarm YANG module in the following way:",
      "zh-CHS": "G.7710中的要求以以下方式与报警模块中的功能相对应："
    },
    {
      "indent": 6,
      "text": "Alarm Severity Assignment Profile (ASAP): the alarm profile \"/alarms/alarm-profile/\".",
      "zh-CHS": "报警严重性分配配置文件（ASAP）：报警配置文件“/报警/报警配置文件/”。"
    },
    {
      "indent": 6,
      "text": "Alarm Reporting Control (ARC): alarm shelving \"/alarms/control/ alarm-shelving/\" and the ability to control alarm notifications \"/alarms/control/notify-status-changes\". Alarm shelving corresponds to the use case of turning off alarm reporting for a specific resource, which is the NALM (No ALarM) state in M.3100.",
      "zh-CHS": "报警报告控制（ARC）：报警搁置“/报警/控制/报警搁置/”以及控制报警通知的能力“/报警/控制/通知状态更改”。报警搁置对应于关闭特定资源的报警报告的用例，这是M.3100中的NALM（无报警）状态。"
    },
    {
      "indent": 0,
      "text": "Appendix G. Alarm-Usability Requirements",
      "zh-CHS": "附录G.警报可用性要求"
    },
    {
      "indent": 3,
      "text": "This section defines usability requirements for alarms. Alarm usability is important for an alarm interface. A data model will help in defining the format, but if the actual alarms are of low value, we have not gained the goal of alarm management.",
      "zh-CHS": "本节定义了警报的可用性要求。报警可用性对于报警界面很重要。数据模型将有助于定义格式，但如果实际报警值较低，则我们尚未达到报警管理的目标。"
    },
    {
      "indent": 3,
      "text": "Common alarm problems and their causes are summarized in Table 2. This summary is adopted to networking based on the ISA [ISA182] and Engineering Equipment Materials Users Association (EEMUA) [EEMUA] standards.",
      "zh-CHS": "表2总结了常见报警问题及其原因。本摘要适用于基于ISA[ISA182]和工程设备材料用户协会（EEMUA）[EEMUA]标准的联网。"
    },
    {
      "indent": 3,
      "text": "+-----------------+--------------------------------+----------------+\n| Problem         | Cause                          | How this       |\n|                 |                                | module         |\n|                 |                                | addresses the  |\n|                 |                                | cause          |\n+-----------------+--------------------------------+----------------+\n| Alarms are      | \"Nuisance\" alarms (chattering  | Strict         |\n| generated, but  | alarms and fleeting alarms),   | definition of  |\n| they are        | faulty hardware, redundant     | alarms         |\n| ignored by the  | alarms, cascading alarms,      | requiring      |\n| operator.       | incorrect alarm settings, and  | corrective     |\n|                 | alarms that have not been      | response.  See |\n|                 | rationalized; the alarms       | alarm          |\n|                 | represent log information      | requirements   |\n|                 | rather than true alarms.       | in Table 3.    |\n|                 |                                |                |\n| When alarms     | Insufficient alarm-response    | The alarm      |\n| occur,          | procedures and not well-       | inventory      |\n| operators do    | defined alarm types.           | lists all      |\n| not know how to |                                | alarm types    |\n| respond.        |                                | and corrective |\n|                 |                                | actions.  See  |\n|                 |                                | alarm          |\n|                 |                                | requirements   |\n|                 |                                | in Table 3.    |\n|                 |                                |                |\n| The alarm       | Nuisance alarms, stale alarms, | The alarm      |\n| display is full | and alarms from equipment not  | definition and |\n| of alarms, even | in service.                    | alarm          |\n| when there is   |                                | shelving.      |\n| nothing wrong.  |                                |                |\n|                 |                                |                |\n| During a        | Incorrect prioritization of    | State-based    |\n| failure,        | alarms.  Not using advanced    | alarm model    |\n| operators are   | alarm techniques (e.g., state- | and alarm-rate |\n| flooded with so | based alarming).               | requirements;  |\n| many alarms     |                                | see Tables 4   |\n| that they do    |                                | and 5,         |\n| not know which  |                                | respectively.  |\n| ones are the    |                                |                |\n| most important. |                                |                |\n+-----------------+--------------------------------+----------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Table 2: Alarm Problems and Causes",
      "zh-CHS": "表2：报警问题和原因"
    },
    {
      "indent": 3,
      "text": "Based upon the above problems, EEMUA gives the following definition of a good alarm:",
      "zh-CHS": "基于上述问题，EEMUA给出了良好警报的以下定义："
    },
    {
      "indent": 3,
      "text": "+----------------+--------------------------------------------------+\n| Characteristic | Explanation                                      |\n+----------------+--------------------------------------------------+\n| Relevant       | Not spurious or of low operational value.        |\n|                |                                                  |\n| Unique         | Not duplicating another alarm.                   |\n|                |                                                  |\n| Timely         | Not long before any response is needed or too    |\n|                | late to do anything.                             |\n|                |                                                  |\n| Prioritized    | Indicating the importance that the operator      |\n|                | deals with the problem.                          |\n|                |                                                  |\n| Understandable | Having a message that is clear and easy to       |\n|                | understand.                                      |\n|                |                                                  |\n| Diagnostic     | Identifying the problem that has occurred.       |\n|                |                                                  |\n| Advisory       | Indicative of the action to be taken.            |\n|                |                                                  |\n| Focusing       | Drawing attention to the most important issues.  |\n+----------------+--------------------------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Table 3: Definition of a Good Alarm",
      "zh-CHS": "表3：良好警报的定义"
    },
    {
      "indent": 3,
      "text": "Vendors SHOULD rationalize all alarms according to the table above. Another crucial requirement is acceptable alarm notification rates. Vendors SHOULD make sure that they do not exceed the recommendations from EEMUA below:",
      "zh-CHS": "供应商应根据上表合理化所有警报。另一个关键要求是可接受的报警通知率。供应商应确保其不超过以下EEMUA的建议："
    },
    {
      "indent": 3,
      "text": "+-----------------------------------+-------------------------------+\n| Long-Term Alarm Rate in Steady    | Acceptability                 |\n| Operation                         |                               |\n+-----------------------------------+-------------------------------+\n| More than one per minute          | Very likely to be             |\n|                                   | unacceptable.                 |\n|                                   |                               |\n| One per 2 minutes                 | Likely to be overdemanding.   |\n|                                   |                               |\n| One per 5 minutes                 | Manageable.                   |\n|                                   |                               |\n| Less than one per 10 minutes      | Very likely to be acceptable. |\n+-----------------------------------+-------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Table 4: Acceptable Alarm Rates -- Steady State",
      "zh-CHS": "表4：可接受报警率——稳态"
    },
    {
      "indent": 3,
      "text": "+----------------------------+--------------------------------------+\n| Number of alarms displayed | Acceptability                        |\n| in 10 minutes following a  |                                      |\n| major network problem      |                                      |\n+----------------------------+--------------------------------------+\n| More than 100              | Definitely excessive and very likely |\n|                            | to lead to the operator abandoning   |\n|                            | the use of the alarm system.         |\n|                            |                                      |\n| 20-100                     | Hard to cope with.                   |\n|                            |                                      |\n| Under 10                   | Should be manageable, but it may be  |\n|                            | difficult if several of the alarms   |\n|                            | require a complex operator response. |\n+----------------------------+--------------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Table 5: Acceptable Alarm Rates -- Burst",
      "zh-CHS": "表5：可接受的报警率——突发"
    },
    {
      "indent": 3,
      "text": "The numbers in Tables 4 and 5 are the sum of all alarms for a network being managed from one alarm console. So every individual system or Network Management System (NMS) contributes to these numbers.",
      "zh-CHS": "表4和表5中的数字是从一个报警控制台管理的网络的所有报警的总和。因此，每个单独的系统或网络管理系统（NMS）都会对这些数字做出贡献。"
    },
    {
      "indent": 3,
      "text": "Vendors SHOULD make sure that the following rules are used in designing the alarm interface:",
      "zh-CHS": "供应商应确保在设计报警界面时使用以下规则："
    },
    {
      "indent": 3,
      "text": "1. Rationalize the alarms in the system to ensure that every alarm is necessary, has a purpose, and follows the cardinal rule that it requires an operator response. Adheres to the rules of Table 3.",
      "zh-CHS": "1. 使系统中的警报合理化，以确保每个警报都是必要的、有目的的，并遵循要求操作员响应的基本规则。遵守表3的规则。"
    },
    {
      "indent": 3,
      "text": "2. Audit the quality of the alarms. Talk with the operators about how well the alarm information supports them. Do they know what to do in the event of an alarm? Are they able to quickly diagnose the problem and determine the corrective action? Does the alarm text adhere to the requirements in Table 3?",
      "zh-CHS": "2. 审计警报的质量。与操作员讨论警报信息对他们的支持程度。他们知道发生警报时该怎么办吗？他们是否能够快速诊断问题并确定纠正措施？报警文本是否符合表3中的要求？"
    },
    {
      "indent": 3,
      "text": "3. Analyze and benchmark the performance of the system and compare it to the recommended metrics in Tables 4 and 5. Start by identifying nuisance alarms, as well as standing alarms at normal state and startup.",
      "zh-CHS": "3. 对系统的性能进行分析和基准测试，并将其与表4和表5中建议的指标进行比较。首先识别干扰警报，以及正常状态和启动时的持续警报。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Viktor Leijon and Johan Nordlander for their valuable input on forming the alarm model.",
      "zh-CHS": "作者希望感谢Viktor Leijon和Johan Nordlander在构建报警模型方面的宝贵投入。"
    },
    {
      "indent": 3,
      "text": "The authors also wish to thank Nick Hancock, Joey Boyd, Tom Petch, and Balazs Lengyel for their extensive reviews and contributions to this document.",
      "zh-CHS": "作者还要感谢Nick Hancock、Joey Boyd、Tom Petch和Balazs Lengyel对本文件的广泛评论和贡献。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Stefan Vallin Stefan Vallin AB",
      "zh-CHS": "Stefan Vallin Stefan Vallin AB"
    },
    {
      "indent": 3,
      "text": "Email: stefan@wallan.se",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Martin Bjorklund Cisco",
      "zh-CHS": "马丁·比约克隆德·思科"
    },
    {
      "indent": 3,
      "text": "Email: mbj@tail-f.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}