{
  "title": {
    "text": "RFC 8002: Host Identity Protocol Certificates",
    "zh-CHS": "RFC 8002"
  },
  "number": 8002,
  "created_at": "2021-10-28 09:37:13.188305+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           T. Heer\nRequest for Comments: 8002               Albstadt-Sigmaringen University\nObsoletes: 6253                                              S. Varjonen\nUpdates: 7401                                     University of Helsinki\nCategory: Standards Track                                   October 2016\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 18,
      "text": "Host Identity Protocol Certificates",
      "zh-CHS": "主机身份协议证书"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Certificate (CERT) parameter is a container for digital certificates. It is used for carrying these certificates in Host Identity Protocol (HIP) control packets. This document specifies the certificate parameter and the error signaling in case of a failed verification. Additionally, this document specifies the representations of Host Identity Tags (HITs) in X.509 version 3 (v3).",
      "zh-CHS": "Certificate（CERT）参数是数字证书的容器。它用于在主机身份协议（HIP）控制数据包中携带这些证书。本文档指定了验证失败时的证书参数和错误信号。此外，本文档还规定了X.509版本3（v3）中主机标识标记（HITs）的表示形式。"
    },
    {
      "indent": 3,
      "text": "The concrete use cases of certificates, including how certificates are obtained and requested and which actions are taken upon successful or failed verification, are specific to the scenario in which the certificates are used. Hence, the definition of these scenario-specific aspects is left to the documents that use the CERT parameter.",
      "zh-CHS": "证书的具体使用案例，包括如何获取和请求证书以及在验证成功或失败时采取哪些措施，都是特定于使用证书的场景的。因此，这些场景特定方面的定义留给使用CERT参数的文档。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 7401 and obsoletes RFC 6253.",
      "zh-CHS": "本文件更新了RFC 7401，淘汰了RFC 6253。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8002.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8002."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2016 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n2.  CERT Parameter  . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  X.509 v3 Certificate Object and Host Identities . . . . . . .   5\n4.  Revocation of Certificates  . . . . . . . . . . . . . . . . .   6\n5.  Error Signaling . . . . . . . . . . . . . . . . . . . . . . .   7\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n8.  Differences from RFC 6253 . . . . . . . . . . . . . . . . . .   8\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . .   9\n  9.2.  Informative References  . . . . . . . . . . . . . . . . .  10\nAppendix A.  X.509 v3 Certificate Example . . . . . . . . . . . .  11\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  13\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Digital certificates bind pieces of information to a public key by means of a digital signature and thus enable the holder of a private key to generate cryptographically verifiable statements. The Host Identity Protocol (HIP) [RFC7401] defines a new cryptographic namespace based on asymmetric cryptography. The identity of each host is derived from a public key, allowing hosts to digitally sign data and issue certificates with their private key. This document specifies the CERT parameter, which is used to transmit digital certificates in HIP. It fills the placeholder specified in Section 5.2 of [RFC7401] and thus updates [RFC7401].",
      "zh-CHS": "数字证书通过数字签名将信息绑定到公钥，从而使私钥持有者能够生成可加密验证的声明。主机标识协议（HIP）[RFC7401]基于非对称加密定义了一个新的加密命名空间。每个主机的标识都是从公钥派生的，允许主机对数据进行数字签名，并使用其私钥颁发证书。本文档指定了用于在HIP中传输数字证书的CERT参数。它填充[RFC7401]第5.2节中指定的占位符，从而更新[RFC7401]。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "1.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”应按照RFC 2119[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "2. CERT Parameter",
      "section_title": true,
      "zh-CHS": "2. 证书参数"
    },
    {
      "indent": 3,
      "text": "The CERT parameter is a container for certain types of digital certificates. It does not specify any certificate semantics. However, it defines supplementary parameters that help HIP hosts to transmit semantically grouped CERT parameters in a more systematic way. The specific use of the CERT parameter for different use cases is intentionally not discussed in this document. Hence, the use of the CERT parameter will be defined in the documents that use the CERT parameter.",
      "zh-CHS": "CERT参数是特定类型数字证书的容器。它没有指定任何证书语义。但是，它定义了辅助参数，帮助HIP主机以更系统的方式传输语义分组的CERT参数。本文档有意不讨论CERT参数在不同用例中的具体使用。因此，CERT参数的使用将在使用CERT参数的文档中定义。"
    },
    {
      "indent": 3,
      "text": "The CERT parameter is covered and protected, when present, by the HIP SIGNATURE field and is a non-critical parameter.",
      "zh-CHS": "CERT参数在存在时由HIP签名字段覆盖和保护，是一个非关键参数。"
    },
    {
      "indent": 3,
      "text": "The CERT parameter can be used in all HIP packets. However, using it in the first Initiator (I1) packet is NOT RECOMMENDED because it can increase the processing times of I1s, which can be problematic when processing storms of I1s. Each HIP control packet MAY contain multiple CERT parameters, each carrying one certificate. These parameters MAY be related or unrelated. Related certificates are managed in CERT groups. A CERT group specifies a group of related CERT parameters that SHOULD be interpreted in a certain order (e.g., for expressing certificate chains). Ungrouped certificates exhibit a unique CERT group field and set the CERT count to 1. CERT parameters with the same group number in the CERT group field indicate a logical grouping. The CERT count field indicates the number of CERT parameters in the group.",
      "zh-CHS": "CERT参数可用于所有HIP数据包。但是，不建议在第一个启动器（I1）数据包中使用它，因为它会增加I1的处理时间，这在处理I1的风暴时可能会出现问题。每个HIP控制包可能包含多个CERT参数，每个参数携带一个证书。这些参数可能相关，也可能无关。相关证书在证书组中管理。证书组指定一组相关的证书参数，这些参数应按特定顺序进行解释（例如，用于表示证书链）。未分组的证书显示唯一的证书组字段，并将证书计数设置为1。CERT group字段中具有相同组号的CERT参数表示逻辑分组。CERT count字段表示组中的CERT参数数。"
    },
    {
      "indent": 3,
      "text": "CERT parameters that belong to the same CERT group MAY be contained in multiple sequential HIP control packets. This is indicated by a higher CERT count than the amount of CERT parameters with matching CERT group fields in a HIP control packet. The CERT parameters MUST be placed in ascending order, within a HIP control packet, according to their CERT group field. CERT groups MAY only span multiple packets if the CERT group does not fit the packet. A HIP packet MUST NOT contain more than one incomplete CERT group that continues in the next HIP control packet.",
      "zh-CHS": "属于同一证书组的证书参数可能包含在多个顺序HIP控制数据包中。这通过证书计数高于HIP控制数据包中具有匹配证书组字段的证书参数数量来表示。CERT参数必须按照其CERT组字段在HIP控制数据包中按升序排列。如果证书组不适合数据包，则证书组只能跨越多个数据包。HIP数据包不得包含多个在下一个HIP控制数据包中继续的不完整证书组。"
    },
    {
      "indent": 3,
      "text": "The CERT ID acts as a sequence number to identify the certificates in a CERT group. The numbers in the CERT ID field MUST start from 1 up to CERT count.",
      "zh-CHS": "证书ID用作序列号，用于标识证书组中的证书。证书ID字段中的数字必须从1开始到证书计数。"
    },
    {
      "indent": 3,
      "text": "The CERT group and CERT ID namespaces are managed locally by each host that sends CERT parameters in HIP control packets.",
      "zh-CHS": "证书组和证书ID命名空间由在HIP控制数据包中发送证书参数的每个主机本地管理。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|             Type              |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  CERT group   |  CERT count   |    CERT ID    |   CERT type   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Certificate                          /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                               |   Padding (variable length)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Type 768 Length Length in octets, excluding Type, Length, and Padding. CERT group Group ID grouping multiple related CERT parameters. CERT count Total count of certificates that are sent, possibly in several consecutive HIP control packets. CERT ID The sequence number for this certificate. CERT Type Indicates the type of the certificate. Padding Any Padding, if necessary, to make the TLV a multiple of 8 bytes. Any added padding bytes MUST be zeroed by the sender, and their values SHOULD NOT be checked by the receiver.",
      "zh-CHS": "键入768长度八位字节，不包括类型、长度和填充。证书组ID将多个相关证书参数分组。CERT count发送的证书总数，可能在几个连续的HIP控制数据包中。证书ID此证书的序列号。证书类型指示证书的类型。填充任何填充，如有必要，使TLV为8字节的倍数。任何添加的填充字节必须由发送方归零，接收方不应检查其值。"
    },
    {
      "indent": 3,
      "text": "The certificates MUST use the algorithms defined in [RFC7401] as the signature and hash algorithms.",
      "zh-CHS": "证书必须使用[RFC7401]中定义的算法作为签名和哈希算法。"
    },
    {
      "indent": 3,
      "text": "The following certificate types are defined:",
      "zh-CHS": "定义了以下证书类型："
    },
    {
      "indent": 13,
      "text": "+--------------------------------+-------------+\n|          CERT format           | Type number |\n+--------------------------------+-------------+\n|            Reserved            |      0      |\n|            X.509 v3            |      1      |\n|           Obsoleted            |      2      |\n|    Hash and URL of X.509 v3    |      3      |\n|           Obsoleted            |      4      |\n|      LDAP URL of X.509 v3      |      5      |\n|           Obsoleted            |      6      |\n| Distinguished Name of X.509 v3 |      7      |\n|           Obsoleted            |      8      |\n+--------------------------------+-------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The next sections outline the use of HITs in X.509 v3. X.509 v3 certificates and the handling procedures are defined in [RFC5280]. The wire format for X.509 v3 is the Distinguished Encoding Rules format as defined in [X.690].",
      "zh-CHS": "下一节将概述X.509 v3中HITs的使用。[RFC5280]中定义了X.509 v3证书和处理程序。X.509 v3的wire格式是[X.690]中定义的可分辨编码规则格式。"
    },
    {
      "indent": 3,
      "text": "Hash and Uniform Resource Locator (URL) encoding (3) is used as defined in Section 3.6 of [RFC7296]. Using hash and URL encodings result in smaller HIP control packets than by including the certificate(s) but requires the receiver to resolve the URL or check a local cache against the hash.",
      "zh-CHS": "按照[RFC7296]第3.6节的定义，使用哈希和统一资源定位器（URL）编码（3）。与包含证书相比，使用哈希和URL编码会产生更小的HIP控制数据包，但需要接收方解析URL或根据哈希检查本地缓存。"
    },
    {
      "indent": 3,
      "text": "Lightweight Directory Access Protocol (LDAP) URL encoding (5) is used as defined in [RFC4516]. Using LDAP URL encoding results in smaller HIP control packets but requires the receiver to retrieve the certificate or check a local cache against the URL.",
      "zh-CHS": "轻量级目录访问协议（LDAP）URL编码（5）按照[RFC4516]中的定义使用。使用LDAP URL编码会产生较小的HIP控制数据包，但要求接收方检索证书或根据URL检查本地缓存。"
    },
    {
      "indent": 3,
      "text": "Distinguished Name (DN) encoding (7) is represented by the string representation of the certificate's subject DN as defined in [RFC4514]. Using the DN encoding results in smaller HIP control packets but requires the receiver to retrieve the certificate or check a local cache against the DN.",
      "zh-CHS": "可分辨名称（DN）编码（7）由[RFC4514]中定义的证书主题DN的字符串表示形式表示。使用DN编码会产生更小的HIP控制数据包，但要求接收方检索证书或根据DN检查本地缓存。"
    },
    {
      "indent": 0,
      "text": "3. X.509 v3 Certificate Object and Host Identities",
      "section_title": true,
      "zh-CHS": "3. X.509 v3证书对象和主机标识"
    },
    {
      "indent": 3,
      "text": "If needed, HITs can represent an issuer, a subject, or both in X.509 v3. HITs are represented as IPv6 addresses as defined in [RFC7343]. When the Host Identifier (HI) is used to sign the certificate, the respective HIT SHOULD be placed into the Issuer Alternative Name (IAN) extension using the GeneralName form iPAddress as defined in [RFC5280]. When the certificate is issued for a HIP host, identified by a HIT and an HI, the respective HIT SHOULD be placed into the",
      "zh-CHS": "如果需要，点击可以表示X.509 v3中的发行者、主题或两者。点击表示为[RFC7343]中定义的IPv6地址。当使用主机标识符（HI）对证书进行签名时，应使用[RFC5280]中定义的通用名称格式iPAddress将相应的HIT放入颁发者备选名称（IAN）扩展名中。为HIP主机（通过HIT和HI标识）颁发证书时，应将相应的HIT放入"
    },
    {
      "indent": 3,
      "text": "Subject Alternative Name (SAN) extension using the GeneralName form iPAddress, and the full HI is presented as the subject's public key info as defined in [RFC5280].",
      "zh-CHS": "使用GeneralName表单iPAddress的受试者备选名称（SAN）扩展，完整HI显示为[RFC5280]中定义的受试者公钥信息。"
    },
    {
      "indent": 3,
      "text": "The following examples illustrate how HITs are presented as the issuer and subject in the X.509 v3 extension alternative names.",
      "zh-CHS": "以下示例说明了如何在X.509 v3扩展名备选名称中将点击作为发行人和主题显示。"
    },
    {
      "indent": 7,
      "text": "Format of X509v3 extensions: X509v3 Issuer Alternative Name: IP Address:hit-of-issuer X509v3 Subject Alternative Name: IP Address:hit-of-subject",
      "zh-CHS": "X509v3扩展名格式：X509v3发行人备选名称：IP地址：发行人命中率X509v3主题备选名称：IP地址：主题命中率"
    },
    {
      "indent": 7,
      "text": "Example X509v3 extensions:\n    X509v3 Issuer Alternative Name:\n        IP Address:2001:24:6cf:fae7:bb79:bf78:7d64:c056\n    X509v3 Subject Alternative Name:\n        IP Address:2001:2c:5a14:26de:a07c:385b:de35:60e3",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Appendix A shows a full example X.509 v3 certificate with HIP content.",
      "zh-CHS": "附录A显示了一个完整的示例X.509 v3证书，其中包含HIP内容。"
    },
    {
      "indent": 3,
      "text": "As another example, consider a managed Public Key Infrastructure (PKI) environment in which the peers have certificates that are anchored in (potentially different) managed trust chains. In this scenario, the certificates issued to HIP hosts are signed by intermediate Certification Authorities (CAs) up to a root CA. In this example, the managed PKI environment is neither HIP aware nor can it be configured to compute HITs and include them in the certificates.",
      "zh-CHS": "作为另一个例子，考虑托管公钥基础设施（PKI）环境，其中对等体具有锚定在（可能不同的）托管信任链中的证书。在此场景中，颁发给HIP主机的证书由中间证书颁发机构（CA）签署，直至根CA。在本例中，托管PKI环境既不支持HIP，也不能配置为计算命中并将其包含在证书中。"
    },
    {
      "indent": 3,
      "text": "When HIP communications are established, the HIP hosts not only need to send their identity certificates (or pointers to their certificates) but also the chain of intermediate CAs (or pointers to the CAs) up to the root CA, or to a CA that is trusted by the remote peer. This chain of certificates SHOULD be sent in a CERT group as specified in Section 2. The HIP peers validate each other's certificates and compute peer HITs based on the certificate public keys.",
      "zh-CHS": "建立HIP通信时，HIP主机不仅需要发送其身份证书（或指向其证书的指针），还需要将中间CA链（或指向CA的指针）发送到根CA，或发送到远程对等方信任的CA。此证书链应按照第2节的规定以证书组的形式发送。HIP对等方验证彼此的证书，并根据证书公钥计算对等方命中率。"
    },
    {
      "indent": 0,
      "text": "4. Revocation of Certificates",
      "section_title": true,
      "zh-CHS": "4. 撤销证书"
    },
    {
      "indent": 3,
      "text": "Revocation of X.509 v3 certificates is handled as defined in Section 5 of [RFC5280] with two exceptions. First, any HIP certificate serial number that appears on the Certificate Revocation List (CRL) is treated as invalid regardless of the reason code. Second, the certificateHold is not supported.",
      "zh-CHS": "X.509 v3证书的撤销按照[RFC5280]第5节的规定处理，但有两个例外。首先，出现在证书吊销列表（CRL）上的任何HIP证书序列号都将被视为无效，而不考虑原因代码。其次，不支持certificateHold。"
    },
    {
      "indent": 0,
      "text": "5. Error Signaling",
      "section_title": true,
      "zh-CHS": "5. 错误信号"
    },
    {
      "indent": 3,
      "text": "If the Initiator does not send all the certificates that the Responder requires, the Responder may take actions (e.g., reject the connection). The Responder MAY signal this to the Initiator by sending a HIP NOTIFY message with NOTIFICATION parameter error type CREDENTIALS_REQUIRED.",
      "zh-CHS": "如果启动器未发送响应程序所需的所有证书，响应程序可能会采取措施（例如，拒绝连接）。响应者可以通过发送HIP NOTIFY消息（需要通知参数error type CREDENTIALS）。"
    },
    {
      "indent": 3,
      "text": "If the verification of a certificate fails, a verifier MAY signal this to the provider of the certificate by sending a HIP NOTIFY message with NOTIFICATION parameter error type INVALID_CERTIFICATE.",
      "zh-CHS": "如果证书验证失败，验证器可以通过发送带有通知参数error type INVALID_certificate的HIP NOTIFY消息向证书提供程序发出此信号。"
    },
    {
      "indent": 5,
      "text": "NOTIFICATION PARAMETER - ERROR TYPES     Value\n------------------------------------     -----",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "CREDENTIALS_REQUIRED 48",
      "zh-CHS": "所需证件48"
    },
    {
      "indent": 5,
      "text": "The Responder is unwilling to set up an association, as the Initiator did not send the needed credentials.",
      "zh-CHS": "响应者不愿意建立关联，因为发起方没有发送所需的凭据。"
    },
    {
      "indent": 5,
      "text": "INVALID_CERTIFICATE 50",
      "zh-CHS": "无效的\\u证书50"
    },
    {
      "indent": 5,
      "text": "Sent in response to a failed verification of a certificate. Notification Data MAY contain a CERT group and CERT ID octet (in this order) of the CERT parameter that caused the failure.",
      "zh-CHS": "为响应证书验证失败而发送。通知数据可能包含导致失败的证书参数的证书组和证书ID八位字节（按此顺序）。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document defines the CERT parameter for HIP [RFC7401]. The CERT parameter type number (768) is defined in [RFC7401].",
      "zh-CHS": "本文档定义了HIP[RFC7401]的CERT参数。证书参数类型号（768）在[RFC7401]中定义。"
    },
    {
      "indent": 3,
      "text": "The CERT parameter has an 8-bit unsigned integer field for different certificate types, for which IANA has created and maintains a subregistry entitled \"HIP Certificate Types\" under \"Host Identity Protocol (HIP) Parameters\". Values for the \"HIP Certificate Types\" registry are given in Section 2. New values for the Certificate types from the unassigned space are assigned through IETF Review.",
      "zh-CHS": "CERT参数有一个8位无符号整数字段，用于不同的证书类型，IANA已为其创建并维护了“主机标识协议（HIP）参数”下名为“HIP证书类型”的子区域。第2节给出了“HIP证书类型”注册表的值。来自未分配空间的证书类型的新值通过IETF评审分配。"
    },
    {
      "indent": 3,
      "text": "In Section 5, this document defines two types for the \"NOTIFY Message Types\" subregistry under \"Host Identity Protocol (HIP) Parameters\".",
      "zh-CHS": "在第5节中，本文件为“主机标识协议（HIP）参数”下的“通知消息类型”子区域定义了两种类型。"
    },
    {
      "indent": 3,
      "text": "As this document obsoletes [RFC6253], references to [RFC6253] in IANA registries have been replaced by references to this document. This document changes the \"HIP Certificate Types\" registry in Section 2.",
      "zh-CHS": "由于本文件淘汰了[RFC6253]，IANA注册中对[RFC6253]的引用已被本文件的引用所取代。本文件更改了第2节中的“HIP证书类型”注册表。"
    },
    {
      "indent": 3,
      "text": "The following updates to the \"HIP Certificate Types\" registry have been made.",
      "zh-CHS": "对“HIP证书类型”注册表进行了以下更新。"
    },
    {
      "indent": 6,
      "text": "The references have been updated from [RFC6253] to this document.",
      "zh-CHS": "参考文献已从[RFC6253]更新至本文件。"
    },
    {
      "indent": 6,
      "text": "This document obsoleted the type numbers \"2\", \"4\", \"6\", and \"8\" for the Simple Public Key Infrastructure (SPKI) certificates.",
      "zh-CHS": "本文件废除了简单公钥基础设施（SPKI）证书的类型号“2”、“4”、“6”和“8”。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Certificate grouping allows the certificates to be sent in multiple consecutive packets. This might allow similar attacks, as IP-layer fragmentation allows, for example, the sending of fragments in the wrong order and skipping some fragments to delay or stall packet processing by the victim in order to use resources (e.g., CPU or memory). Hence, hosts SHOULD implement mechanisms to discard certificate groups with outstanding certificates if state space is scarce.",
      "zh-CHS": "证书分组允许在多个连续数据包中发送证书。这可能允许类似的攻击，因为IP层碎片允许，例如，以错误的顺序发送碎片，并跳过一些碎片，以延迟或暂停受害者的数据包处理，从而使用资源（例如，CPU或内存）。因此，如果状态空间不足，主机应该实现丢弃具有未完成证书的证书组的机制。"
    },
    {
      "indent": 3,
      "text": "Although the CERT parameter is allowed in the I1 packet, it is NOT RECOMMENDED because it can increase the processing times of I1s, which can be problematic when processing storms of I1s. Furthermore, the Initiator has to take into consideration that the Responder can drop the CERT parameter in I1 without processing the parameter.",
      "zh-CHS": "尽管在I1数据包中允许使用CERT参数，但不建议使用该参数，因为它会增加I1的处理时间，这在处理I1数据包时可能会出现问题。此外，发起者必须考虑到响应者可以在不处理参数的情况下删除I1中的CERT参数。"
    },
    {
      "indent": 3,
      "text": "Checking of the URL and LDAP entries might allow denial-of-service (DoS) attacks, where the target host may be subjected to bogus work.",
      "zh-CHS": "检查URL和LDAP条目可能会允许拒绝服务（DoS）攻击，目标主机可能会受到伪造工作的攻击。"
    },
    {
      "indent": 3,
      "text": "Security considerations for X.509 v3 are discussed in [RFC5280].",
      "zh-CHS": "[RFC5280]中讨论了X.509 v3的安全注意事项。"
    },
    {
      "indent": 0,
      "text": "8. Differences from RFC 6253",
      "section_title": true,
      "zh-CHS": "8. 与RFC 6253的差异"
    },
    {
      "indent": 3,
      "text": "This section summarizes the technical changes made from [RFC6253]. This section is informational and is intended to help implementors of the previous protocol version. If any text in this section contradicts text in other portions of this specification, the text found outside of this section should be considered normative.",
      "zh-CHS": "本节总结了[RFC6253]所做的技术更改。本节仅供参考，旨在帮助先前协议版本的实施者。如果本节中的任何文本与本规范其他部分中的文本相矛盾，则本节以外的文本应视为规范性文本。"
    },
    {
      "indent": 3,
      "text": "The following change has been made.",
      "zh-CHS": "进行了以下更改。"
    },
    {
      "indent": 3,
      "text": "o Support for SPKI certificates has been removed.",
      "zh-CHS": "o 已删除对SPKI证书的支持。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC4514] Zeilenga, K., Ed., \"Lightweight Directory Access Protocol (LDAP): String Representation of Distinguished Names\", RFC 4514, DOI 10.17487/RFC4514, June 2006, <http://www.rfc-editor.org/info/rfc4514>.",
      "zh-CHS": "[RFC4514]Zeilenga，K.，编辑，“轻量级目录访问协议（LDAP）：可分辨名称的字符串表示”，RFC 4514，DOI 10.17487/RFC4514，2006年6月<http://www.rfc-editor.org/info/rfc4514>."
    },
    {
      "indent": 3,
      "text": "[RFC4516] Smith, M., Ed. and T. Howes, \"Lightweight Directory Access Protocol (LDAP): Uniform Resource Locator\", RFC 4516, DOI 10.17487/RFC4516, June 2006, <http://www.rfc-editor.org/info/rfc4516>.",
      "zh-CHS": "[RFC4516]Smith，M.，Ed.和T.Howes，“轻量级目录访问协议（LDAP）：统一资源定位器”，RFC 4516，DOI 10.17487/RFC4516，2006年6月<http://www.rfc-editor.org/info/rfc4516>."
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, DOI 10.17487/RFC5280, May 2008, <http://www.rfc-editor.org/info/rfc5280>.",
      "zh-CHS": "[RFC5280]Cooper，D.，Santesson，S.，Farrell，S.，Boeyen，S.，Housley，R.，和W.Polk，“Internet X.509公钥基础设施证书和证书撤销列表（CRL）配置文件”，RFC 5280，DOI 10.17487/RFC5280，2008年5月<http://www.rfc-editor.org/info/rfc5280>."
    },
    {
      "indent": 3,
      "text": "[RFC7296] Kaufman, C., Hoffman, P., Nir, Y., Eronen, P., and T. Kivinen, \"Internet Key Exchange Protocol Version 2 (IKEv2)\", STD 79, RFC 7296, DOI 10.17487/RFC7296, October 2014, <http://www.rfc-editor.org/info/rfc7296>.",
      "zh-CHS": "[RFC7296]Kaufman，C.，Hoffman，P.，Nir，Y.，Eronen，P.，和T.Kivinen，“互联网密钥交换协议版本2（IKEv2）”，STD 79，RFC 7296，DOI 10.17487/RFC72962014年10月<http://www.rfc-editor.org/info/rfc7296>."
    },
    {
      "indent": 3,
      "text": "[RFC7343] Laganier, J. and F. Dupont, \"An IPv6 Prefix for Overlay Routable Cryptographic Hash Identifiers Version 2 (ORCHIDv2)\", RFC 7343, DOI 10.17487/RFC7343, September 2014, <http://www.rfc-editor.org/info/rfc7343>.",
      "zh-CHS": "[RFC7343]Laganier，J.和F.Dupont，“覆盖可路由加密哈希标识符版本2（Vv2）的IPv6前缀”，RFC 7343，DOI 10.17487/RFC7343，2014年9月<http://www.rfc-editor.org/info/rfc7343>."
    },
    {
      "indent": 3,
      "text": "[RFC7401] Moskowitz, R., Ed., Heer, T., Jokela, P., and T. Henderson, \"Host Identity Protocol Version 2 (HIPv2)\", RFC 7401, DOI 10.17487/RFC7401, April 2015, <http://www.rfc-editor.org/info/rfc7401>.",
      "zh-CHS": "[RFC7401]Moskowitz，R.，Ed.，Heer，T.，Jokela，P.，和T.Henderson，“主机身份协议版本2（HIPv2）”，RFC 7401，DOI 10.17487/RFC7401，2015年4月<http://www.rfc-editor.org/info/rfc7401>."
    },
    {
      "indent": 3,
      "text": "[X.690] ITU-T, , \"Information Technology - ASN.1 encoding rules: Specification of Basic Encoding Rules (BER), Canonical Encoding Rules (CER) and Distinguished Encoding Rules (DER)\", ITU-T Recommendation X.690 | ISO/IEC 8825-1, August 2015.",
      "zh-CHS": "[X.690]ITU-T，“信息技术-ASN.1编码规则：基本编码规则（BER）、规范编码规则（CER）和区分编码规则（DER）规范”，ITU-T建议X.690 | ISO/IEC 8825-1，2015年8月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC6253] Heer, T. and S. Varjonen, \"Host Identity Protocol Certificates\", RFC 6253, DOI 10.17487/RFC6253, May 2011, <http://www.rfc-editor.org/info/rfc6253>.",
      "zh-CHS": "[RFC6253]Heer，T.和S.Varjonen，“主机身份协议证书”，RFC 6253，DOI 10.17487/RFC6253，2011年5月<http://www.rfc-editor.org/info/rfc6253>."
    },
    {
      "indent": 0,
      "text": "Appendix A. X.509 v3 Certificate Example",
      "section_title": true,
      "zh-CHS": "附录A.X.509 v3证书示例"
    },
    {
      "indent": 3,
      "text": "This section shows an X.509 v3 certificate with encoded HITs.",
      "zh-CHS": "本节显示了带有编码命中的X.509 v3证书。"
    },
    {
      "indent": 3,
      "text": "Certificate:\n    Data:\n        Version: 3 (0x2)\n        Serial Number: 12705268244493839545 (0xb0522e27291b2cb9)\n    Signature Algorithm: sha256WithRSAEncryption\n        Issuer: DC=Example, DC=com, CN=Example issuing host\n        Validity\n            Not Before: Feb 25 11:28:29 2016 GMT\n            Not After : Feb 24 11:28:29 2017 GMT\n        Subject: DC=Example, DC=com, CN=Example issuing host\n        Subject Public Key Info:\n            Public Key Algorithm: rsaEncryption\n                Public-Key: (2048 bit)\n                Modulus:\n                    00:c9:b0:85:94:af:1f:3a:77:39:c9:d5:81:a5:ee:\n                    d2:b5:6b:72:91:5d:22:2c:1e:59:e5:06:29:bd:a2:\n                    19:f6:ac:ca:eb:f7:88:d8:54:55:41:01:58:d8:87:\n                    64:d8:c8:cf:6e:c2:38:81:22:1a:ae:e9:a6:80:22:\n                    03:ee:f3:1b:7e:68:11:e3:f4:7b:98:33:28:bf:40:\n                    ec:4f:19:e8:10:8a:8b:07:60:f7:9f:e4:82:f8:a7:\n                    58:04:3d:42:07:c8:34:ca:99:6d:11:eb:73:c1:d9:\n                    96:93:55:e5:c7:ed:80:4f:8a:f2:1a:6f:83:c8:15:\n                    a4:8f:b8:6a:fe:f3:4f:49:1a:5c:1f:89:bb:30:e6:\n                    98:bc:ce:a3:a2:37:85:b1:79:1c:26:e6:44:0c:b9:\n                    3e:d8:37:81:46:f4:02:25:46:a2:ea:da:25:5c:46:\n                    a2:a3:c5:58:80:53:1f:c5:e5:11:a0:da:d8:f2:ad:\n                    d6:98:d4:ce:55:35:cc:0b:d3:5b:09:48:ef:57:65:\n                    80:cb:65:79:fd:cb:4d:5b:b3:8d:1a:ff:2a:58:3e:\n                    96:65:10:3e:04:81:78:2b:d5:ca:89:78:ea:28:5c:\n                    bc:02:4a:54:cd:aa:a9:99:8d:d6:39:e9:5e:a9:73:\n                    1a:5d:93:55:39:9b:72:1a:c2:a0:1f:e3:4c:b0:41:\n                    98:97\n                Exponent: 65537 (0x10001)\n        X509v3 extensions:\n            X509v3 Subject Alternative Name:\n                IP Address:2001:27:DCFC:CB8:F885:D53F:4E63:48B7\n            X509v3 Issuer Alternative Name:\n                IP Address:2001:2D:F878:64C1:67E3:9716:88BD:68E4",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Signature Algorithm: sha256WithRSAEncryption\n     6d:e6:a9:a6:30:c4:ab:3e:86:39:1e:de:76:4d:4e:a4:2d:63:\n     4d:bb:41:bf:d3:0c:66:13:8b:4d:b2:50:59:36:fc:ae:42:9e:\n     c8:a0:41:1a:1c:94:56:05:28:82:34:4e:63:75:87:31:25:67:\n     36:a6:1a:0f:b8:f7:db:03:e7:dd:a6:9a:26:c4:68:e2:cf:59:\n     54:e6:ee:cc:a7:ce:fb:56:bf:31:60:f4:cb:e7:f0:0e:50:f8:\n     b7:c5:3c:1a:de:74:d0:aa:83:e5:15:25:b1:bf:be:a4:7f:af:\n     0a:de:08:09:0e:13:1d:2a:3b:1a:99:d9:af:10:fc:08:92:5f:\n     d8:d0:10:d6:b9:0c:86:da:85:3b:44:b5:97:90:10:02:4f:5a:\n     1f:ae:07:30:6b:f5:e6:12:93:72:e2:10:c9:8e:2c:00:8b:d6:\n     f0:05:c3:ff:91:24:69:6d:5b:5a:0c:40:28:01:f2:5b:45:b8:\n     9b:ae:9e:73:e9:dd:83:e0:85:d7:ad:6c:b1:81:ac:a0:30:37:\n     9d:60:bd:92:3b:d2:a1:21:87:8b:c4:d9:5a:5c:21:56:3e:02:\n     7e:f3:6f:a5:de:40:75:80:f5:41:68:5c:b2:61:fb:1d:9a:a5:\n     97:a8:d4:a9:82:45:86:79:3c:63:76:3d:fd:86:a0:f8:14:84:\n     55:c1:8c:fa",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-----BEGIN CERTIFICATE-----\nMIIDWTCCAkGgAwIBAgIJALBSLicpGyy5MA0GCSqGSIb3DQEBCwUAME0xFzAVBgoJ\nkiaJk/IsZAEZFgdFeGFtcGxlMRMwEQYKCZImiZPyLGQBGRYDY29tMR0wGwYDVQQD\nExRFeGFtcGxlIGlzc3VpbmcgaG9zdDAeFw0xNjAyMjUxMTI4MjlaFw0xNzAyMjQx\nMTI4MjlaME0xFzAVBgoJkiaJk/IsZAEZFgdFeGFtcGxlMRMwEQYKCZImiZPyLGQB\nGRYDY29tMR0wGwYDVQQDExRFeGFtcGxlIGlzc3VpbmcgaG9zdDCCASIwDQYJKoZI\nhvcNAQEBBQADggEPADCCAQoCggEBAMmwhZSvHzp3OcnVgaXu0rVrcpFdIiweWeUG\nKb2iGfasyuv3iNhUVUEBWNiHZNjIz27COIEiGq7ppoAiA+7zG35oEeP0e5gzKL9A\n7E8Z6BCKiwdg95/kgvinWAQ9QgfINMqZbRHrc8HZlpNV5cftgE+K8hpvg8gVpI+4\nav7zT0kaXB+JuzDmmLzOo6I3hbF5HCbmRAy5Ptg3gUb0AiVGouraJVxGoqPFWIBT\nH8XlEaDa2PKt1pjUzlU1zAvTWwlI71dlgMtlef3LTVuzjRr/Klg+lmUQPgSBeCvV\nyol46ihcvAJKVM2qqZmN1jnpXqlzGl2TVTmbchrCoB/jTLBBmJcCAwEAAaM8MDow\nGwYDVR0RBBQwEocQIAEAJ9z8DLj4hdU/TmNItzAbBgNVHRIEFDAShxAgAQAt+Hhk\nwWfjlxaIvWjkMA0GCSqGSIb3DQEBCwUAA4IBAQBt5qmmMMSrPoY5Ht52TU6kLWNN\nu0G/0wxmE4tNslBZNvyuQp7IoEEaHJRWBSiCNE5jdYcxJWc2phoPuPfbA+fdppom\nxGjiz1lU5u7Mp877Vr8xYPTL5/AOUPi3xTwa3nTQqoPlFSWxv76kf68K3ggJDhMd\nKjsamdmvEPwIkl/Y0BDWuQyG2oU7RLWXkBACT1ofrgcwa/XmEpNy4hDJjiwAi9bw\nBcP/kSRpbVtaDEAoAfJbRbibrp5z6d2D4IXXrWyxgaygMDedYL2SO9KhIYeLxNla\nXCFWPgJ+82+l3kB1gPVBaFyyYfsdmqWXqNSpgkWGeTxjdj39hqD4FIRVwYz6\n-----END CERTIFICATE-----",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank A. Keranen, D. Mattes, M. Komu, and T. Henderson for the fruitful conversations on the subject. D. Mattes most notably contributed the non-HIP-aware use case in Section 3.",
      "zh-CHS": "作者要感谢A.Keranen、D.Mattes、M.Komu和T.Henderson就这一主题进行的富有成效的对话。D.Mattes在第3节中对非髋关节感知用例的贡献最为显著。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Tobias Heer Albstadt-Sigmaringen University Poststr. 6 72458 Albstadt Germany",
      "zh-CHS": "Tobias Heer Albstadt Sigmaringen大学Poststr。6 72458阿尔伯斯塔德德国"
    },
    {
      "indent": 3,
      "text": "Email: heer@hs-albsig.de",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Samu Varjonen University of Helsinki Gustaf Haellstroemin katu 2b 00560 Helsinki Finland",
      "zh-CHS": "SAMU VARJONEN赫尔辛基大学古斯塔夫HaelStuMin KATU 2B 00560赫尔辛基芬兰"
    },
    {
      "indent": 3,
      "text": "Email: samu.varjonen@helsinki.fi",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}