{
  "title": {
    "text": "RFC 8202: IS-IS Multi-Instance",
    "zh-CHS": "RFC 8202"
  },
  "number": 8202,
  "created_at": "2021-10-29 01:58:08.101806+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       L. Ginsberg\nRequest for Comments: 8202                                    S. Previdi\nObsoletes: 6822                                            Cisco Systems\nCategory: Standards Track                                  W. Henderickx\nISSN: 2070-1721                                                    Nokia\n                                                               June 2017",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 26,
      "text": "IS-IS Multi-Instance",
      "zh-CHS": "IS-IS多实例"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a mechanism that allows a single router to share one or more circuits among multiple Intermediate System to Intermediate System (IS-IS) routing protocol instances.",
      "zh-CHS": "本文档描述了一种机制，该机制允许单个路由器在多个中间系统到中间系统（IS-IS）路由协议实例之间共享一个或多个电路。"
    },
    {
      "indent": 3,
      "text": "Multiple instances allow the isolation of resources associated with each instance. Routers will form instance-specific adjacencies. Each instance can support multiple topologies. Each topology has a unique Link State Database (LSDB). Each Protocol Data Unit (PDU) will contain a new Type-Length-Value (TLV) identifying the instance and the topology (or topologies) to which the PDU belongs.",
      "zh-CHS": "多个实例允许隔离与每个实例关联的资源。路由器将形成特定于实例的邻接。每个实例都可以支持多种拓扑。每个拓扑都有一个唯一的链路状态数据库（LSDB）。每个协议数据单元（PDU）将包含一个新的类型长度值（TLV），用于标识实例和PDU所属的拓扑。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 6822.",
      "zh-CHS": "本文件淘汰了RFC 6822。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8202.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8202."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Requirements Language ...........................................4\n3. Elements of Procedure ...........................................4\n   3.1. Instance Identifier TLV ....................................4\n   3.2. Instance Membership ........................................6\n   3.3. Use of Authentication ......................................6\n   3.4. Adjacency Establishment ....................................6\n        3.4.1. Point-to-Point Adjacencies ..........................6\n        3.4.2. Multi-Access Adjacencies ............................7\n   3.5. Update Process Operation ...................................7\n        3.5.1. Update Process Operation on Point-to-Point\n               Circuits ............................................7\n        3.5.2. Update Process Operation on Broadcast Circuits ......7\n   3.6. Interoperability Considerations ............................7\n        3.6.1. Interoperability Issues on Broadcast Circuits .......8\n        3.6.2. Interoperability Using Point-to-Point Circuits ......9\n4. Usage Guidelines ................................................9\n   4.1. One-to-One Mapping between Topologies and Instances .......10\n   4.2. Many-to-One Mapping between Topologies and Instances ......10\n   4.3. Considerations for the Number of Instances ................11\n5. Relationship to M-ISIS .........................................11\n6. Graceful Restart Interactions ..................................12\n7. IANA Considerations ............................................12\n8. Security Considerations ........................................12\n9. References .....................................................12\n   9.1. Normative References ......................................12\n   9.2. Informative References ....................................14\nAppendix A. Changes to RFC 6822 ...................................15\nAcknowledgements ..................................................15\nAuthors' Addresses ................................................16",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "An existing limitation of the protocol defined by [ISO10589] is that only one instance of the protocol can operate on a given circuit. This document defines an extension to IS-IS to remove this restriction. The extension is referred to as \"Multi-Instance IS-IS\" (MI-IS-IS).",
      "zh-CHS": "[ISO10589]定义的协议的一个现有限制是，只有一个协议实例可以在给定电路上运行。本文档定义了IS-IS的扩展以删除此限制。该扩展称为“多实例is-is”（MI-is-is）。"
    },
    {
      "indent": 3,
      "text": "Routers that support this extension are referred to as \"Multi-Instance-capable routers\" (MI-RTR).",
      "zh-CHS": "支持此扩展的路由器称为“支持多实例的路由器”（MI-RTR）。"
    },
    {
      "indent": 3,
      "text": "The use of multiple instances enhances the ability to isolate the resources associated with a given instance both within a router and across the network. Instance-specific prioritization for processing PDUs and performing routing calculations within a router may be specified. Instance-specific flooding parameters may also be defined so as to allow different instances to consume network-wide resources at different rates.",
      "zh-CHS": "使用多个实例增强了在路由器内和网络上隔离与给定实例关联的资源的能力。可以指定在路由器内处理pdu和执行路由计算的实例特定优先级。还可以定义实例特定的泛洪参数，以便允许不同实例以不同的速率消耗网络范围的资源。"
    },
    {
      "indent": 3,
      "text": "Another existing protocol limitation is that a given instance supports a single Update Process operating on a single Link State Database (LSDB). This document defines an extension to IS-IS to allow non-zero instances of the protocol to support multiple Update Processes. Each Update Process is associated with a topology and a unique topology-specific LSDB. Non-zero instances of the protocol are only supported by MI-RTRs. Legacy routers support the standard or zero instance of the protocol. The behavior of the standard instance is not changed in any way by the extensions defined in this document.",
      "zh-CHS": "另一个现有的协议限制是，给定实例支持在单链路状态数据库（LSDB）上运行的单个更新进程。本文档定义了IS-IS的扩展，以允许协议的非零实例支持多个更新过程。每个更新过程都与一个拓扑和唯一的特定于拓扑的LSDB相关联。协议的非零实例仅由MI RTR支持。传统路由器支持协议的标准或零实例。本文档中定义的扩展不会以任何方式更改标准实例的行为。"
    },
    {
      "indent": 3,
      "text": "MI-IS-IS might be used to support topology-specific routing. Two methods of supporting such a use are defined in this document: one supports the use of [RFC5120] within a reserved instance-specific topology and the other is an alternative to [RFC5120] that supports topology-specific flooding of link state information.",
      "zh-CHS": "MI-IS-IS可用于支持特定于拓扑的路由。本文档中定义了两种支持此类使用的方法：一种支持在保留实例特定拓扑中使用[RFC5120]，另一种是支持链路状态信息的拓扑特定泛洪的[RFC5120]的替代方法。"
    },
    {
      "indent": 3,
      "text": "MI-IS-IS might also be used to support the advertisement of information on behalf of applications [RFC6823]. The advertisement of information not directly related to the operation of the IS-IS protocol can therefore be done in a manner that minimizes its impact on the operation of routing.",
      "zh-CHS": "MI-IS-IS还可用于支持代表应用程序发布信息[RFC6823]。因此，与IS-IS协议的操作不直接相关的信息的公布可以以最小化其对路由操作的影响的方式来完成。"
    },
    {
      "indent": 3,
      "text": "The above are examples of how MI-IS-IS might be used. The specification of uses of MI-IS-IS is outside the scope of this document.",
      "zh-CHS": "以上是如何使用MI-IS-IS的示例。MI-IS-IS的使用规范不在本文件范围内。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "zh-CHS": "2. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”在所有大写字母出现时（如图所示）应按照BCP 14[RFC2119][RFC8174]所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Elements of Procedure",
      "section_title": true,
      "zh-CHS": "3. 程序要素"
    },
    {
      "indent": 3,
      "text": "An Instance Identifier (IID) is introduced to uniquely identify an IS-IS instance. The protocol extension includes a new TLV (IID-TLV) in each IS-IS PDU originated by an MI-RTR except as noted in this document. The IID-TLV identifies the unique instance as well as the instance-specific topology/topologies to which the PDU applies. Each IS-IS PDU is associated with only one IS-IS instance.",
      "zh-CHS": "引入实例标识符（IID）来唯一标识is-is实例。协议扩展在MI-RTR发起的每个IS-IS PDU中包括一个新的TLV（IID-TLV），除非本文件另有说明。IID-TLV识别唯一实例以及PDU应用到的实例特定拓扑。每个IS-IS PDU仅与一个IS-IS实例关联。"
    },
    {
      "indent": 3,
      "text": "MI-RTRs form instance-specific adjacencies. The IID-TLV included in IS-IS Hellos (IIHs) includes the IID and the set of Instance-specific Topology Identifiers (ITIDs) that the sending IS supports. When multiple instances share the same circuit, each instance will have a separate set of adjacencies.",
      "zh-CHS": "MI RTR形成特定于实例的邻接。IS-IS Hellos（IIHs）中包含的IID-TLV包括发送IS支持的IID和一组实例特定拓扑标识符（ITID）。当多个实例共享同一回路时，每个实例将具有一组单独的邻接。"
    },
    {
      "indent": 3,
      "text": "MI-RTRs support the exchange of topology-specific Link State PDUs for the IID/ITID pairs that each neighbor supports. A unique IS-IS Update Process (see [ISO10589]) operates for each IID/ITID pair. This MAY also imply IID/ITID-specific routing calculations and IID/ITID-specific routing and forwarding tables. However, this aspect is outside the scope of this specification.",
      "zh-CHS": "MI RTR支持为每个邻居支持的IID/ITID对交换特定于拓扑的链路状态PDU。每个IID/ITID对都有一个唯一的IS-IS更新过程（见[ISO10589]）。这也可能意味着IID/ITID特定的路由计算以及IID/ITID特定的路由和转发表。然而，这方面不在本规范的范围内。"
    },
    {
      "indent": 3,
      "text": "The mechanisms used to implement support of the separation of IS-IS instances and topology-specific Update Processes within a router are outside the scope of this specification.",
      "zh-CHS": "用于在路由器内实现IS-IS实例分离和拓扑特定更新过程支持的机制不在本规范的范围内。"
    },
    {
      "indent": 0,
      "text": "3.1. Instance Identifier TLV",
      "section_title": true,
      "zh-CHS": "3.1. 实例标识符TLV"
    },
    {
      "indent": 3,
      "text": "A new TLV is defined in order to convey the IID and ITIDs supported. The IID-TLV associates a PDU with an IS-IS instance using a unique 16-bit number. The IID-TLV is carried in all IS-IS PDUs that are associated with a non-zero instance; this includes IIHs, Sequence Number PDUs (SNPs), and Link State PDUs (LSPs) .",
      "zh-CHS": "定义了一个新的TLV，以传递支持的IID和ITID。IID-TLV使用唯一的16位数字将PDU与IS-IS实例相关联。IID-TLV在与非零实例关联的所有is-is PDU中携带；这包括IIHs、序列号PDU（SNP）和链路状态PDU（LSP）。"
    },
    {
      "indent": 3,
      "text": "Multiple instances of IS-IS may coexist on the same circuit and on the same physical router. IIDs MUST be unique within the same routing domain.",
      "zh-CHS": "IS-IS的多个实例可能共存于同一电路和同一物理路由器上。IID在同一路由域中必须是唯一的。"
    },
    {
      "indent": 3,
      "text": "IID #0 is reserved for the standard instance supported by legacy systems. IS-IS PDUs associated with the standard instance MUST NOT include an IID-TLV except where noted in this document.",
      "zh-CHS": "IID#0保留给遗留系统支持的标准实例。与标准实例关联的IS-IS PDU不得包括IID-TLV，除非本文件另有说明。"
    },
    {
      "indent": 3,
      "text": "The IID-TLV MAY include one or more ITIDs. An ITID is a 16-bit identifier where all values (0 - 65535) are valid.",
      "zh-CHS": "IID-TLV可包括一个或多个ITID。ITID是一个16位标识符，其中所有值（0-65535）都有效。"
    },
    {
      "indent": 3,
      "text": "The following format is used for the IID-TLV:",
      "zh-CHS": "以下格式用于IID-TLV："
    },
    {
      "indent": 5,
      "text": "Type:   7\nLength: 2 - 254\nValue:\n                                       No. of octets\n            +-------------------------+\n            | IID (0 - 65535)         |     2\n            +-------------------------+\n            | Supported ITID          |     2\n            +-------------------------+\n            :                         :\n            +-------------------------+\n            | Supported ITID          |     2\n            +-------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "When the IID = 0, the list of supported ITIDs MUST NOT be present.",
      "zh-CHS": "当IID=0时，支持的ITID列表不得存在。"
    },
    {
      "indent": 6,
      "text": "An IID-TLV with IID = 0 MUST NOT appear in an SNP or LSP. When the TLV appears (with a non-zero IID) in an SNP or LSP, exactly one ITID MUST be present, indicating the instance-specific topology with which the PDU is associated. If no ITIDs or multiple ITIDs are present or the IID is zero, then the PDU MUST be ignored.",
      "zh-CHS": "IID=0的IID-TLV不得出现在SNP或LSP中。当TLV（具有非零IID）出现在SNP或LSP中时，必须正好存在一个ITID，指示与PDU关联的实例特定拓扑。如果没有ITID或存在多个ITID，或者IID为零，则必须忽略PDU。"
    },
    {
      "indent": 6,
      "text": "When the IID is non-zero and the TLV appears in an IIH, the set of ITIDs supported on the circuit over which the IIH is sent is included. There MUST be at least one ITID present.",
      "zh-CHS": "当IID为非零且TLV出现在IIH中时，包括发送IIH的电路上支持的ITID集。必须至少存在一个ITID。"
    },
    {
      "indent": 6,
      "text": "ITID #0 is reserved for a specific use case as described later in this document. ITID #0 MUST NOT be supported in combination with any non-zero ITID. If multiple ITIDs are advertised in an IIH and one of the ITIDs is #0, then the PDU MUST be ignored.",
      "zh-CHS": "ITID#0保留用于本文档后面描述的特定用例。ITID#0不得与任何非零ITID结合使用。如果在IIH中公布多个ITID，并且其中一个ITID为#0，则必须忽略PDU。"
    },
    {
      "indent": 6,
      "text": "Multiple IID-TLVs MAY appear in IIHs. If multiple IID-TLVs are present and the IID value in all IID-TLVs is not the same, then the PDU MUST be ignored.",
      "zh-CHS": "IIHs中可能出现多个IID TLV。如果存在多个IID TLV，且所有IID TLV中的IID值不相同，则必须忽略PDU。"
    },
    {
      "indent": 3,
      "text": "A single IID-TLV will support advertisement of up to 126 ITIDs. If multiple IID-TLVs are present in an IIH PDU, the supported set of ITIDs is the union of all ITIDs present in all IID-TLVs.",
      "zh-CHS": "单个IID-TLV将支持多达126个ITID的广告。如果一个IIH PDU中存在多个IID TLV，则支持的ITID集是所有IID TLV中存在的所有ITID的并集。"
    },
    {
      "indent": 3,
      "text": "When an LSP purge is initiated, the IID-TLV MUST be retained, but the remainder of the body of the LSP SHOULD be removed. The purge procedure is described in [RFC6233] and [RFC6232].",
      "zh-CHS": "启动LSP吹扫时，必须保留IID-TLV，但应移除LSP主体的剩余部分。[RFC6233]和[RFC6232]中描述了吹扫程序。"
    },
    {
      "indent": 3,
      "text": "It is recommended that (when present) the IID-TLV(s) be the first TLV(s) in the PDU. This allows determination of the association of a PDU with a particular instance more quickly.",
      "zh-CHS": "建议（当存在时）IID-TLV为PDU中的第一个TLV。这允许更快地确定PDU与特定实例的关联。"
    },
    {
      "indent": 3,
      "text": "A PDU without an IID-TLV belongs to the standard instance.",
      "zh-CHS": "没有IID-TLV的PDU属于标准实例。"
    },
    {
      "indent": 0,
      "text": "3.2. Instance Membership",
      "section_title": true,
      "zh-CHS": "3.2. 实例成员资格"
    },
    {
      "indent": 3,
      "text": "Each MI-RTR is configured to be participating in one or more instances of IS-IS. For each non-zero instance in which it participates, an MI-RTR marks IS-IS PDUs (IIHs, LSPs, or SNPs) generated that pertain to that instance by including the IID-TLV with the appropriate instance identifier.",
      "zh-CHS": "每个MI-RTR配置为参与is-is的一个或多个实例。对于其参与的每个非零实例，MI-RTR标记通过包括具有适当实例标识符的IID-TLV而生成的与该实例相关的IS-IS PDU（IIHs、LSP或SNP）。"
    },
    {
      "indent": 0,
      "text": "3.3. Use of Authentication",
      "section_title": true,
      "zh-CHS": "3.3. 身份验证的使用"
    },
    {
      "indent": 3,
      "text": "When authentication is in use, the IID, if present, is first used to select the authentication configuration that is applicable. The authentication check is then performed as normal. When multiple ITIDs are supported, ITID-specific authentication MAY be used in SNPs and LSPs.",
      "zh-CHS": "当使用身份验证时，IID（如果存在）首先用于选择适用的身份验证配置。然后，将正常执行身份验证检查。当支持多个ITID时，可以在SNP和LSP中使用特定于ITID的身份验证。"
    },
    {
      "indent": 0,
      "text": "3.4. Adjacency Establishment",
      "section_title": true,
      "zh-CHS": "3.4. 邻接建立"
    },
    {
      "indent": 3,
      "text": "In order to establish adjacencies, IS-IS routers exchange IIH PDUs. Two types of adjacencies exist in IS-IS: point-to-point and broadcast. The following subsections describe the additional rules an MI-RTR MUST follow when establishing adjacencies for non-zero instances.",
      "zh-CHS": "为了建立邻接，IS-IS路由器交换IIH PDU。IS-IS中存在两种类型的邻接：点对点和广播。以下小节描述了为非零实例建立邻接时MI-RTR必须遵循的其他规则。"
    },
    {
      "indent": 0,
      "text": "3.4.1. Point-to-Point Adjacencies",
      "section_title": true,
      "zh-CHS": "3.4.1. 点对点邻接"
    },
    {
      "indent": 3,
      "text": "MI-RTRs include the IID-TLV in the point-to-point Hello PDUs associated with non-zero instances that they originate. Upon reception of an IIH, an MI-RTR inspects the received IID-TLV, and if the IID matches any of the IIDs that the router supports on that circuit, normal adjacency establishment procedures are used to establish an instance-specific adjacency. Note that the absence of the IID-TLV implies IID #0. For instances other than IID #0, an adjacency SHOULD NOT be established unless there is at least one ITID in common.",
      "zh-CHS": "MI RTR将IID-TLV包含在与它们发起的非零实例相关联的点到点Hello PDU中。接收到IIH后，MI-RTR检查接收到的IID-TLV，如果IID与路由器在该电路上支持的任何IID匹配，则使用正常邻接建立过程来建立特定于实例的邻接。注意，缺少IID-TLV意味着IID#0。对于IID#0以外的实例，除非至少有一个ITID相同，否则不应建立邻接。"
    },
    {
      "indent": 3,
      "text": "This extension allows an MI-RTR to establish multiple adjacencies to the same physical neighbor over a point-to-point circuit. However, as the instances are logically independent, the normal expectation of at most one neighbor on a given point-to-point circuit still applies.",
      "zh-CHS": "此扩展允许MI-RTR在点到点电路上建立与同一物理邻居的多个邻接。然而，由于这些实例在逻辑上是独立的，所以在给定的点到点电路上最多有一个邻居的正常期望仍然适用。"
    },
    {
      "indent": 0,
      "text": "3.4.2. Multi-Access Adjacencies",
      "section_title": true,
      "zh-CHS": "3.4.2. 多址邻接"
    },
    {
      "indent": 3,
      "text": "Multi-Access (broadcast) circuits behave differently than point-to-point in that PDUs sent by one router are visible to all routers and all routers must agree on the election of a Designated Intermediate System (DIS) independent of the set of ITIDs supported.",
      "zh-CHS": "多址（广播）电路的行为与点对点不同，因为一个路由器发送的PDU对所有路由器都可见，并且所有路由器必须同意选择独立于所支持的ITID集的指定中间系统（DIS）。"
    },
    {
      "indent": 3,
      "text": "MI-RTRs will establish adjacencies and elect a DIS per IS-IS instance. Each MI-RTR will form adjacencies only with routers that advertise support for the instances that the local router has been configured to support on that circuit. Since an MI-RTR is not required to support all possible instances on a LAN, it's possible to elect a different DIS for different instances.",
      "zh-CHS": "MI RTR将根据IS-IS实例建立邻接并选择DIS。每个MI-RTR将仅与宣布支持本地路由器已配置为在该电路上支持的实例的路由器形成邻接。由于MI-RTR不需要支持LAN上所有可能的实例，因此可以为不同的实例选择不同的DI。"
    },
    {
      "indent": 0,
      "text": "3.5. Update Process Operation",
      "section_title": true,
      "zh-CHS": "3.5. 更新进程操作"
    },
    {
      "indent": 3,
      "text": "For non-zero instances, a unique Update Process exists for each supported ITID.",
      "zh-CHS": "对于非零实例，每个受支持的ITID都有一个唯一的更新过程。"
    },
    {
      "indent": 0,
      "text": "3.5.1. Update Process Operation on Point-to-Point Circuits",
      "section_title": true,
      "zh-CHS": "3.5.1. 更新点对点电路上的过程操作"
    },
    {
      "indent": 3,
      "text": "On Point-to-Point circuits -- including Point-to-Point Operation over LAN [RFC5309] -- the ITID-specific Update Process only operates on that circuit for those ITIDs that are supported by both ISs operating on the circuit.",
      "zh-CHS": "在点对点电路（包括LAN上的点对点操作[RFC5309]）上，ITID特定更新过程仅在该电路上对在该电路上运行的ISs支持的ITID进行操作。"
    },
    {
      "indent": 0,
      "text": "3.5.2. Update Process Operation on Broadcast Circuits",
      "section_title": true,
      "zh-CHS": "3.5.2. 更新广播电路上的进程操作"
    },
    {
      "indent": 3,
      "text": "On broadcast circuits, a single DIS is elected for each supported IID independent of the set of ITIDs advertised in LAN IIHs. This requires that the DIS generate pseudo-node LSPs for all supported ITIDs and that the Update Process for all supported ITIDs operate on the broadcast circuit. Among MI-RTRs operating on a broadcast circuit, if the set of supported ITIDs for a given non-zero IID is inconsistent, connectivity for the topology (or topologies) associated with the ITIDs not supported by some MI-RTRs can be compromised.",
      "zh-CHS": "在广播电路上，独立于LAN IIHs中公布的ITID集，为每个受支持的IID选择一个DI。这要求DIS为所有受支持的ITID生成伪节点LSP，并且所有受支持的ITID的更新过程在广播电路上运行。在广播电路上运行的MI RTR中，如果给定非零IID的受支持ITID集不一致，则与某些MI RTR不支持的ITID相关联的拓扑（或拓扑）的连接性可能会受到影响。"
    },
    {
      "indent": 0,
      "text": "3.6. Interoperability Considerations",
      "section_title": true,
      "zh-CHS": "3.6. 互操作性注意事项"
    },
    {
      "indent": 3,
      "text": "[ISO10589] requires that any TLV that is not understood be silently ignored without compromising the processing of the whole IS-IS PDU (IIH, LSP, SNP).",
      "zh-CHS": "[ISO10589]要求在不影响整个is-is PDU（IIH、LSP、SNP）处理的情况下，默示忽略任何未理解的TLV。"
    },
    {
      "indent": 3,
      "text": "To a router not implementing this extension, all IS-IS PDUs received will appear to be associated with the standard instance, regardless of whether an IID-TLV is present in those PDUs. This can cause interoperability issues unless the mechanisms and procedures discussed below are followed.",
      "zh-CHS": "对于未实现此扩展的路由器，接收到的所有IS-IS PDU似乎都与标准实例关联，无论这些PDU中是否存在IID-TLV。除非遵循下面讨论的机制和过程，否则这可能会导致互操作性问题。"
    },
    {
      "indent": 0,
      "text": "3.6.1. Interoperability Issues on Broadcast Circuits",
      "section_title": true,
      "zh-CHS": "3.6.1. 广播电路的互操作性问题"
    },
    {
      "indent": 3,
      "text": "In order for routers to correctly interoperate with routers not implementing this extension and in order not to cause disruption, a specific and dedicated Media Access Control (MAC) address is used for multicasting IS-IS PDUs with any non-zero IID. Each level will use a specific Layer 2 multicast address. Such an address allows MI-RTRs to exchange IS-IS PDUs with non-zero IIDs without these PDUs being processed by legacy routers; therefore, no disruption is caused.",
      "zh-CHS": "为了使路由器与未实现此扩展的路由器正确地互操作，并且为了不造成中断，使用特定的专用媒体访问控制（MAC）地址对具有任何非零IID的is-is PDU进行多播。每个级别将使用特定的第2层多播地址。这种地址允许MI RTR与非零IID交换IS-IS PDU，而无需传统路由器处理这些PDU；因此，不会造成中断。"
    },
    {
      "indent": 3,
      "text": "When sending SNPs, LSPs, and LAN IIHs for the standard instance (IID #0), an MI-RTR will use either the AllL1IS or the AllL2IS MAC-layer addresses (as defined in [ISO10589]) as the destination address. When sending SNPs, LSPs, and LAN IIHs for any non-zero IID, an MI-RTR MUST use one of two new dedicated Layer 2 multicast addresses (AllL1MI-ISs or AllL2MI-ISs) as the destination address. These addresses are specified in Section 7.",
      "zh-CHS": "在为标准实例（IID#0）发送SNP、LSP和LAN IIH时，MI-RTR将使用AllL1IS或AllL2IS MAC层地址（定义见[ISO10589]）作为目标地址。当为任何非零IID发送SNP、LSP和LAN IIH时，MI-RTR必须使用两个新的专用第2层多播地址（AllL1MI ISs或AllL2MI ISs）中的一个作为目标地址。第7节规定了这些地址。"
    },
    {
      "indent": 3,
      "text": "MI-RTRs MUST discard IS-IS PDUs received if either of the following is true:",
      "zh-CHS": "如果满足以下任一条件，MI RTRs必须丢弃接收到的IS-IS PDU："
    },
    {
      "indent": 3,
      "text": "o The destination multicast address is AllL1IS, AllL2IS, or AllIS and the PDU contains an IID-TLV.",
      "zh-CHS": "o 目标多播地址是AllL1IS、AllL2IS或AllIS，并且PDU包含IID-TLV。"
    },
    {
      "indent": 3,
      "text": "o The destination multicast address is AllL1MI-ISs or AllL2MI-ISs and the PDU contains an IID-TLV with a zero value for the IID or has no IID-TLV.",
      "zh-CHS": "o 目标多播地址为AllL1MI ISs或AllL2MI ISs，并且PDU包含IID-TLV，IID的值为零，或者没有IID-TLV。"
    },
    {
      "indent": 3,
      "text": "NOTE: If the multicast addresses AllL1IS, AllL2IS, and/or AllIS are improperly used to send IS-IS PDUs for non-zero IIDs, legacy systems will interpret these PDUs as being associated with IID #0. This will cause inconsistencies in the LSDB in those routers, may incorrectly maintain adjacencies, and may lead to inconsistent DIS election.",
      "zh-CHS": "注意：如果多播地址AllL1IS、AllL2IS和/或AllIS被不正确地用于发送非零IID的IS-IS PDU，传统系统会将这些PDU解释为与IID#0关联。这将导致这些路由器中的LSDB不一致，可能会错误地保持邻接，并可能导致不一致的取消选择。"
    },
    {
      "indent": 0,
      "text": "3.6.1.1. Special Considerations when Operating in Point-to-Point Mode",
      "section_title": true,
      "zh-CHS": "3.6.1.1. 在点对点模式下操作时的特殊注意事项"
    },
    {
      "indent": 3,
      "text": "When operating in point-to-point mode on a broadcast circuit [RFC5309], an MI-RTR will use AllL1IS, AllL2IS, or AllIS MAC-layer addresses when sending SNPs, LSPs, and point-to-point IIHs associated with the standard instance. When sending SNPs, LSPs, and point-to-point IIHs for a non-zero IID, an MI-RTR MUST use one of the two new",
      "zh-CHS": "当在广播电路[RFC5309]上以点对点模式运行时，MI-RTR在发送与标准实例相关联的SNP、LSP和点对点IIH时，将使用AllL1IS、AllL2IS或AllIS MAC层地址。当为非零IID发送SNP、LSP和点对点IIH时，MI-RTR必须使用两个新的"
    },
    {
      "indent": 3,
      "text": "multicast addresses (AllL1MI-ISs or AllL2MI-IS) as the destination address. When sending point-to-point IIHs for a non-zero IID, either address is permitted.",
      "zh-CHS": "多播地址（AllL1MI ISs或AllL2MI IS）作为目标地址。当为非零IID发送点对点IIH时，允许任何一个地址。"
    },
    {
      "indent": 0,
      "text": "3.6.2. Interoperability Using Point-to-Point Circuits",
      "section_title": true,
      "zh-CHS": "3.6.2. 使用点对点电路的互操作性"
    },
    {
      "indent": 3,
      "text": "In order for an MI-RTR to interoperate over a point-to-point circuit with a router that does NOT support this extension, the MI-RTR MUST NOT send IS-IS PDUs for instances other than IID #0 over the point-to-point circuit as these PDUs may affect the state of IID #0 in the neighbor.",
      "zh-CHS": "为了使MI-RTR在点到点电路上与不支持此扩展的路由器进行互操作，MI-RTR不得在点到点电路上为IID#0以外的实例发送IS-IS PDU，因为这些PDU可能会影响邻居中IID#0的状态。"
    },
    {
      "indent": 3,
      "text": "The presence or absence of the IID-TLV in an IIH indicates that the neighbor does or does not support this extension, respectively. Therefore, all IIHs sent on a point-to-point circuit by an MI-RTR MUST include an IID-TLV. This includes IIHs associated with IID #0. Once it is determined that the neighbor does not support this extension, an MI-RTR MUST NOT send PDUs (including IIHs) for instances other than IID #0.",
      "zh-CHS": "IIH中存在或不存在IID-TLV分别表示邻居支持或不支持此扩展。因此，MI-RTR在点对点电路上发送的所有IIH必须包括IID-TLV。这包括与IID#0相关的IIH。一旦确定邻居不支持此扩展，MI-RTR不得为IID#0以外的实例发送PDU（包括IIH）。"
    },
    {
      "indent": 3,
      "text": "Until an IIH is received from a neighbor, an MI-RTR MAY send IIHs for a non-zero instance. However, once an IIH with no IID-TLV has been received (indicating that the neighbor is not an MI-RTR), the MI-RTR MUST NOT send IIHs for a non-zero instance. The temporary relaxation of the restriction on sending IIHs for non-zero instances allows a non-zero instance adjacency to be established on an interface on which an MI-RTR does NOT support the standard instance.",
      "zh-CHS": "在从邻居接收到IIH之前，MI-RTR可以发送非零实例的IIH。但是，一旦接收到没有IID-TLV的IIH（表示邻居不是MI-RTR），MI-RTR就不能为非零实例发送IIH。临时放宽对非零实例发送IIH的限制，允许在MI-RTR不支持标准实例的接口上建立非零实例邻接。"
    },
    {
      "indent": 3,
      "text": "Point-to-point adjacency setup MUST be done through the use of the three-way handshaking procedure as defined in [RFC5303] in order to prevent a non-MI-capable neighbor from bringing up an adjacency prematurely based on reception of an IIH with an IID-TLV for a non-zero instance.",
      "zh-CHS": "点对点邻接设置必须通过使用[RFC5303]中定义的三向握手程序来完成，以防止不具备MI能力的邻居基于接收到IIH和非零实例的IID-TLV而过早地提出邻接。"
    },
    {
      "indent": 0,
      "text": "4. Usage Guidelines",
      "section_title": true,
      "zh-CHS": "4. 使用指南"
    },
    {
      "indent": 3,
      "text": "As discussed above, MI-IS-IS extends IS-IS to support multiple instances on a given circuit. Each instance is uniquely identified by the IID and forms instance-specific adjacencies. Each instance supports one or more topologies as represented by the ITIDs. All topologies associated with a given instance share the instance-specific adjacencies. The set of topologies supported by a given IID MAY differ from circuit to circuit. Each topology has its own set of LSPs and runs a topology-specific Update Process. Flooding of topology-specific LSPs is only performed on circuits on which both the local router and the neighbor(s) support a given topology (i.e., advertise the same ITID in the set of supported ITIDs sent in the IID-TLV included in IIHs).",
      "zh-CHS": "如上所述，MI-IS-IS扩展IS-IS以支持给定电路上的多个实例。每个实例都由IID唯一标识，并形成特定于实例的邻接。每个实例都支持一个或多个由ITID表示的拓扑。与给定实例关联的所有拓扑共享特定于实例的邻接。给定IID支持的拓扑集可能因电路而异。每个拓扑都有自己的LSP集，并运行特定于拓扑的更新过程。拓扑特定LSP的泛洪仅在本地路由器和邻居都支持给定拓扑的电路上执行（即，在IIHs中包含的IID-TLV中发送的受支持ITID集中公布相同的ITID）。"
    },
    {
      "indent": 3,
      "text": "The following subsections provide some guidelines for usage of instances and topologies within each instance. While this represents examples based on the intent of the authors, implementors are not constrained by the examples.",
      "zh-CHS": "以下小节提供了在每个实例中使用实例和拓扑的一些指导原则。虽然这代表了基于作者意图的示例，但实现者不受示例的约束。"
    },
    {
      "indent": 0,
      "text": "4.1. One-to-One Mapping between Topologies and Instances",
      "section_title": true,
      "zh-CHS": "4.1. 拓扑和实例之间的一对一映射"
    },
    {
      "indent": 3,
      "text": "When the set of information to be flooded in LSPs is intended to be flooded to all MI-RTRs supporting a given IID, a single topology MAY be used. The information contained in the single LSDB MAY still contain information associated with multiple applications as the GENINFO TLV for each application has an application-specific ID that identifies the application to which the TLV applies [RFC6823].",
      "zh-CHS": "当LSP中要被淹没的信息集打算被淹没到支持给定IID的所有MI RTR时，可以使用单个拓扑。单个LSDB中包含的信息可能仍然包含与多个应用程序相关的信息，因为每个应用程序的GENINFO TLV都有一个特定于应用程序的ID，标识TLV应用到的应用程序[RFC6823]。"
    },
    {
      "indent": 0,
      "text": "4.2. Many-to-One Mapping between Topologies and Instances",
      "section_title": true,
      "zh-CHS": "4.2. 拓扑和实例之间的多对一映射"
    },
    {
      "indent": 3,
      "text": "When the set of information to be flooded in LSPs includes subsets that are of interest to a subset of the MI-RTRs supporting a given IID, support of multiple ITIDs allows each subset to be flooded only to those MI-RTRs that are interested in that subset. In the simplest case, a one-to-one mapping between a given application and an ITID allows the information associated with that application to be flooded only to MI-RTRs that support that application -- but a many-to-one mapping between applications and a given ITID is also possible. When the set of application-specific information is large, the use of multiple ITIDs provides significantly greater efficiencies, as MI-RTRs only need to maintain the LSDB for applications of interest and that information only needs to be flooded over a topology defined by the MI-RTRs who support a given ITID.",
      "zh-CHS": "当要在lsp中淹没的信息集包括支持给定IID的MI-rtr的子集感兴趣的子集时，多个itid的支持允许每个子集仅淹没到对该子集感兴趣的那些MI-rtr。在最简单的情况下，给定应用程序和ITID之间的一对一映射允许与该应用程序相关联的信息仅被淹没到支持该应用程序的MI RTR中——但应用程序和给定ITID之间的多对一映射也是可能的。当特定于应用程序的信息集很大时，多个ITID的使用提供了显著更高的效率，因为MI RTR只需要维护感兴趣的应用程序的LSDB，并且该信息只需要淹没在支持给定ITID的MI RTR定义的拓扑上。"
    },
    {
      "indent": 3,
      "text": "The use of multiple ITIDs also allows the dedication of a full LSP set (256 LSPs at each level) for the use of a given (set of) applications, thereby minimizing the possibility of exceeding the carrying capacity of an LSP set. Such a possibility might arise if information for all applications were to be included in a single LSP set.",
      "zh-CHS": "使用多个ITID还允许为使用给定（一组）应用程序专用一个完整的LSP集（每个级别256个LSP），从而将超过LSP集承载能力的可能性降至最低。如果所有应用程序的信息都包含在单个LSP集中，则可能会出现这种情况。"
    },
    {
      "indent": 3,
      "text": "Note that the topology associated with each ITID MUST be fully connected in order for ITID-specific LSPs to be successfully flooded to all MI-RTRs that support that ITID.",
      "zh-CHS": "请注意，与每个ITID关联的拓扑必须完全连接，才能将ITID特定的LSP成功地淹没到支持该ITID的所有MI RTR。"
    },
    {
      "indent": 3,
      "text": "When multiple ITIDs are supported by an instance, ITID #0 MUST NOT be supported.",
      "zh-CHS": "当一个实例支持多个ITID时，不能支持ITID#0。"
    },
    {
      "indent": 0,
      "text": "4.3. Considerations for the Number of Instances",
      "section_title": true,
      "zh-CHS": "4.3. 对实例数量的考虑"
    },
    {
      "indent": 3,
      "text": "The support of multiple topologies within the context of a single instance provides better scalability in support of multiple applications both in terms of the number of adjacencies that are required and in the flooding of topology-specific LSDB. In many cases, the use of a single non-zero instance would be sufficient and optimal. However, in cases where the set of topologies desired in support of a set of applications is largely disjoint from the set of topologies desired in support of a second set of applications, it could make sense to use multiple instances.",
      "zh-CHS": "在单个实例的上下文中支持多个拓扑提供了更好的可伸缩性，以支持多个应用程序，包括所需的邻接数量和拓扑特定LSDB的泛滥。在许多情况下，使用单个非零实例就足够了，而且是最佳的。然而，在支持一组应用程序所需的拓扑集与支持第二组应用程序所需的拓扑集在很大程度上不相交的情况下，使用多个实例是有意义的。"
    },
    {
      "indent": 0,
      "text": "5. Relationship to M-ISIS",
      "section_title": true,
      "zh-CHS": "5. 与M-ISIS的关系"
    },
    {
      "indent": 3,
      "text": "[RFC5120] defines support for multi-topology routing. In that document, 12-bit Multi-Topology Identifiers (MTIDs) are defined to identify the topologies that an IS-IS instance (a \"standard instance\" as defined by this document) supports. There is no relationship between the MTIDs defined in [RFC5120] and the ITIDs defined in this document.",
      "zh-CHS": "[RFC5120]定义了对多拓扑路由的支持。在该文档中，定义了12位多拓扑标识符（MTID），以标识IS-IS实例（本文档定义的“标准实例”）支持的拓扑。[RFC5120]中定义的MTID与本文档中定义的ITID之间没有关系。"
    },
    {
      "indent": 3,
      "text": "An MI-RTR MAY use the extensions defined in this document to support multiple topologies in the context of an instance with a non-zero IID. Each MI topology is associated with a unique LSDB identified by an ITID. An ITID-specific IS-IS Update Process operates on each topology. This differs from [RFC5120], where a single LSDB and single IS-IS Update Process are used in support of all topologies. In such cases, if an MI-RTR uses the extensions in support of the BFD-Enabled TLV [RFC6213], the ITID MUST be used in place of the MTID; in which case, all 16 bits of the identifier field are useable.",
      "zh-CHS": "MI-RTR可以使用本文档中定义的扩展来支持具有非零IID的实例上下文中的多个拓扑。每个MI拓扑都与ITID标识的唯一LSDB相关联。ITID特定的IS-IS更新过程在每个拓扑上运行。这与[RFC5120]不同，后者使用单个LSDB和单个IS-IS更新过程来支持所有拓扑。在这种情况下，如果MI-RTR使用扩展来支持启用BFD的TLV[RFC6213]，则必须使用ITID代替MTID；在这种情况下，标识符字段的所有16位都可用。"
    },
    {
      "indent": 3,
      "text": "An MI-RTR MAY support [RFC5120] multi-topology within a non-zero instance when ITID #0 is supported. When ITID #0 is supported it MUST be the only ITID supported by that instance. In such cases, if an MI-RTR uses the extensions in support of the BFD Enabled TLV [RFC6213] the [RFC5120] MTID MUST be used as specified in [RFC6213].",
      "zh-CHS": "当支持ITID#0时，MI-RTR可以在非零实例中支持[RFC5120]多拓扑。当支持ITID#0时，它必须是该实例支持的唯一ITID。在这种情况下，如果MI-RTR使用扩展来支持启用BFD的TLV[RFC6213]，则必须按照[RFC6213]中的规定使用[RFC5120]MTID。"
    },
    {
      "indent": 3,
      "text": "An MI-RTR MUST NOT support [RFC5120] multi-topology within a non-zero instance when any non-zero ITID is supported. The following TLVs MUST NOT be sent in an LSP associated with a non-zero instance that supports a non-zero ITID, and such an LSP MUST be ignored when received:",
      "zh-CHS": "当支持任何非零ITID时，MI-RTR不得在非零实例内支持[RFC5120]多拓扑。以下TLV不得在与支持非零ITID的非零实例关联的LSP中发送，并且在接收时必须忽略此类LSP："
    },
    {
      "indent": 4,
      "text": "TLV 222 - MT IS Neighbors TLV 235 - MT IP Reachability TLV 237 - MT IPv6 Reachability",
      "zh-CHS": "TLV 222-MT是邻居TLV 235-MT IP可达性TLV 237-MT IPv6可达性"
    },
    {
      "indent": 0,
      "text": "6. Graceful Restart Interactions",
      "section_title": true,
      "zh-CHS": "6. 优雅的重启交互"
    },
    {
      "indent": 3,
      "text": "[RFC5306] defines protocol extensions in support of graceful restart of a routing instance. The extensions defined there apply to MI-RTRs with the notable addition that as there are topology-specific LSP databases all of the topology-specific LSP databases must be synchronized following restart in order for database synchronization to be complete. This involves the use of additional T2 timers. See [RFC5306] for further details.",
      "zh-CHS": "[RFC5306]定义协议扩展以支持路由实例的正常重启。此处定义的扩展适用于MI RTR，值得注意的是，由于存在特定于拓扑的LSP数据库，因此必须在重启后同步所有特定于拓扑的LSP数据库，以便完成数据库同步。这涉及到使用额外的T2定时器。详见[RFC5306]。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has registered an IS-IS TLV, reflected in the \"IS-IS TLV Codepoints Registry\":",
      "zh-CHS": "IANA已注册IS-IS TLV，反映在“IS-IS TLV代码点注册表”中："
    },
    {
      "indent": 4,
      "text": "Value  Name                   IIH  LSP  SNP  Purge\n----   ---------------------  ---  ---  ---  -----\n 7     Instance Identifier     y    y    y     y",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Per [RFC6822], IANA has registered two EUI-48 multicast addresses from the IANA-managed EUI address space as specified in [RFC7042]. The addresses are as follows:",
      "zh-CHS": "根据[RFC6822]，IANA已从[RFC7042]中指定的IANA管理的EUI地址空间注册了两个EUI-48多播地址。地址如下:"
    },
    {
      "indent": 6,
      "text": "01-00-5E-90-00-02 AllL1MI-ISs 01-00-5E-90-00-03 AllL2MI-ISs",
      "zh-CHS": "01-00-5E-90-00-02 AllL1MI ISs 01-00-5E-90-00-03 AllL2MI ISs"
    },
    {
      "indent": 3,
      "text": "All references to [RFC6822] in the \"IS-IS TLV Codepoints Registry\" and the \"IANA Multicast 48-bit MAC Addresses\" registry have been replaced by references to this document.",
      "zh-CHS": "“IS-IS TLV代码点注册表”和“IANA多播48位MAC地址”注册表中对[RFC6822]的所有引用均已替换为对本文件的引用。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Security concerns for IS-IS are addressed in [ISO10589], [RFC5304], and [RFC5310].",
      "zh-CHS": "IS-IS的安全问题在[ISO10589]、[RFC5304]和[RFC5310]中有说明。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISO10589] International Organization for Standardization, \"Information technology -- Telecommunications and information exchange between systems -- Intermediate System to Intermediate System intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service (ISO 8473)\", ISO/IEC 10589:2002, Second Edition, November 2002.",
      "zh-CHS": "[ISO10589]国际标准化组织，“信息技术——系统间电信和信息交换——与提供无连接模式网络服务协议一起使用的中间系统到中间系统域内路由信息交换协议（ISO 8473）”，ISO/IEC 10589:2002，第二版，2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC5120] Przygienda, T., Shen, N., and N. Sheth, \"M-ISIS: Multi Topology (MT) Routing in Intermediate System to Intermediate Systems (IS-ISs)\", RFC 5120, DOI 10.17487/RFC5120, February 2008, <http://www.rfc-editor.org/info/rfc5120>.",
      "zh-CHS": "[RFC5120]Przygienda，T.，Shen，N.，和N.Sheth，“M-ISIS：中间系统到中间系统（IS-ISs）的多拓扑（MT）路由”，RFC 5120，DOI 10.17487/RFC5120，2008年2月<http://www.rfc-editor.org/info/rfc5120>."
    },
    {
      "indent": 3,
      "text": "[RFC5303] Katz, D., Saluja, R., and D. Eastlake 3rd, \"Three-Way Handshake for IS-IS Point-to-Point Adjacencies\", RFC 5303, DOI 10.17487/RFC5303, October 2008, <http://www.rfc-editor.org/info/rfc5303>.",
      "zh-CHS": "[RFC5303]Katz，D.，Saluja，R.，和D.Eastlake 3rd，“IS-IS点对点邻接的三方握手”，RFC 5303，DOI 10.17487/RFC5303，2008年10月<http://www.rfc-editor.org/info/rfc5303>."
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, DOI 10.17487/RFC5304, October 2008, <http://www.rfc-editor.org/info/rfc5304>.",
      "zh-CHS": "[RFC5304]Li，T.和R.Atkinson，“IS-IS加密认证”，RFC 5304，DOI 10.17487/RFC5304，2008年10月<http://www.rfc-editor.org/info/rfc5304>."
    },
    {
      "indent": 3,
      "text": "[RFC5306] Shand, M. and L. Ginsberg, \"Restart Signaling for IS-IS\", RFC 5306, DOI 10.17487/RFC5306, October 2008, <http://www.rfc-editor.org/info/rfc5306>.",
      "zh-CHS": "[RFC5306]Shand，M.和L.Ginsberg，“IS-IS的重启信令”，RFC 5306，DOI 10.17487/RFC5306，2008年10月<http://www.rfc-editor.org/info/rfc5306>."
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, DOI 10.17487/RFC5310, February 2009, <http://www.rfc-editor.org/info/rfc5310>.",
      "zh-CHS": "[RFC5310]Bhatia，M.，Manral，V.，Li，T.，Atkinson，R.，White，R.，和M.Fanto，“IS-IS通用密码认证”，RFC 5310，DOI 10.17487/RFC5310，2009年2月<http://www.rfc-editor.org/info/rfc5310>."
    },
    {
      "indent": 3,
      "text": "[RFC6213] Hopps, C. and L. Ginsberg, \"IS-IS BFD-Enabled TLV\", RFC 6213, DOI 10.17487/RFC6213, April 2011, <http://www.rfc-editor.org/info/rfc6213>.",
      "zh-CHS": "[RFC6213]Hopps，C.和L.Ginsberg，“IS-IS BFD启用TLV”，RFC 6213，DOI 10.17487/RFC6213，2011年4月<http://www.rfc-editor.org/info/rfc6213>."
    },
    {
      "indent": 3,
      "text": "[RFC6232] Wei, F., Qin, Y., Li, Z., Li, T., and J. Dong, \"Purge Originator Identification TLV for IS-IS\", RFC 6232, DOI 10.17487/RFC6232, May 2011, <http://www.rfc-editor.org/info/rfc6232>.",
      "zh-CHS": "[RFC6232]Wei，F.，Qin，Y.，Li，Z.，Li，T.，和J.Dong，“IS-IS的清除发起人识别TLV”，RFC 6232，DOI 10.17487/RFC6232，2011年5月<http://www.rfc-editor.org/info/rfc6232>."
    },
    {
      "indent": 3,
      "text": "[RFC6233] Li, T. and L. Ginsberg, \"IS-IS Registry Extension for Purges\", RFC 6233, DOI 10.17487/RFC6233, May 2011, <http://www.rfc-editor.org/info/rfc6233>.",
      "zh-CHS": "[RFC6233]Li，T.和L.Ginsberg，“清洗的IS-IS注册扩展”，RFC 6233，DOI 10.17487/RFC6233，2011年5月<http://www.rfc-editor.org/info/rfc6233>."
    },
    {
      "indent": 3,
      "text": "[RFC6822] Previdi, S., Ed., Ginsberg, L., Shand, M., Roy, A., and D. Ward, \"IS-IS Multi-Instance\", RFC 6822, DOI 10.17487/RFC6822, December 2012, <http://www.rfc-editor.org/info/rfc6822>.",
      "zh-CHS": "[RFC6822]Previdi，S.，Ed.，Ginsberg，L.，Shand，M.，Roy，A.，和D.Ward，“IS-IS多实例”，RFC 6822，DOI 10.17487/RFC6822，2012年12月<http://www.rfc-editor.org/info/rfc6822>."
    },
    {
      "indent": 3,
      "text": "[RFC6823] Ginsberg, L., Previdi, S., and M. Shand, \"Advertising Generic Information in IS-IS\", RFC 6823, DOI 10.17487/RFC6823, December 2012, <http://www.rfc-editor.org/info/rfc6823>.",
      "zh-CHS": "[RFC6823]Ginsberg，L.，Previdi，S.，和M.Shand，“IS-IS中的广告通用信息”，RFC 6823，DOI 10.17487/RFC6823，2012年12月<http://www.rfc-editor.org/info/rfc6823>."
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <http://www.rfc-editor.org/info/rfc8174>.",
      "zh-CHS": "[RFC8174]Leiba，B.，“RFC 2119关键词中大写与小写的歧义”，BCP 14，RFC 8174，DOI 10.17487/RFC8174，2017年5月<http://www.rfc-editor.org/info/rfc8174>."
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[Err4519] RFC Errata, Erratum ID 4519, RFC 6822.",
      "zh-CHS": "[Err4519]RFC勘误表，勘误表ID 4519，RFC 6822。"
    },
    {
      "indent": 3,
      "text": "[Err4520] RFC Errata, Erratum ID 4520, RFC 6822.",
      "zh-CHS": "[Err4520]RFC勘误表，勘误表ID 4520，RFC 6822。"
    },
    {
      "indent": 3,
      "text": "[RFC5309] Shen, N., Ed. and A. Zinin, Ed., \"Point-to-Point Operation over LAN in Link State Routing Protocols\", RFC 5309, DOI 10.17487/RFC5309, October 2008, <http://www.rfc-editor.org/info/rfc5309>.",
      "zh-CHS": "[RFC5309]Shen，N.，Ed.和A.Zinin，Ed.，“链路状态路由协议下局域网上的点对点操作”，RFC 5309，DOI 10.17487/RFC5309，2008年10月<http://www.rfc-editor.org/info/rfc5309>."
    },
    {
      "indent": 3,
      "text": "[RFC7042] Eastlake 3rd, D. and J. Abley, \"IANA Considerations and IETF Protocol and Documentation Usage for IEEE 802 Parameters\", BCP 141, RFC 7042, DOI 10.17487/RFC7042, October 2013, <http://www.rfc-editor.org/info/rfc7042>.",
      "zh-CHS": "[RFC7042]Eastlake 3rd，D.和J.Abley，“IEEE802参数的IANA考虑因素和IETF协议及文档使用”，BCP 141，RFC 7042，DOI 10.17487/RFC7042，2013年10月<http://www.rfc-editor.org/info/rfc7042>."
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes to RFC 6822",
      "section_title": true,
      "zh-CHS": "附录A.对RFC 6822的变更"
    },
    {
      "indent": 3,
      "text": "RFC 6822 prohibited the use of Multi-Topology (MT) support as described in RFC 5120 in a non-zero instance. However, deployment experience since the writing of RFC 6822 has revealed a desire to be able to support the style of MT in RFC 5120 using multiple non-zero instances as an alternative means of controlling leaking of information between L1 areas while also supporting incongruent topologies for different address families. The rules have therefore been relaxed to allow use of MT per RFC 5120 in a non-zero instance so long as ITID #0 is the only instance topology (ITID) supported by the instance. Note that this change is not backwards compatible with implementations strictly following RFC 6822. As of this writing, all known implementations are compatible with this change.",
      "zh-CHS": "RFC 6822禁止在非零实例中使用RFC 5120中所述的多拓扑（MT）支持。然而，自编写RFC 6822以来的部署经验表明，希望能够支持RFC 5120中的MT样式，使用多个非零实例作为控制L1区域之间信息泄漏的替代方法，同时还支持不同地址族的不一致拓扑。因此，这些规则已经放宽，允许在非零实例中根据RFC 5120使用MT，只要ITID#0是实例支持的唯一实例拓扑（ITID）。请注意，此更改与严格遵循RFC 6822的实现不向后兼容。在撰写本文时，所有已知的实现都与此更改兼容。"
    },
    {
      "indent": 3,
      "text": "A suggestion has been added to place the IID-TLV as the first TLV in a PDU to speed recognition of the correct instance when parsing a received PDU.",
      "zh-CHS": "添加了一个建议，将IID-TLV作为PDU中的第一个TLV，以在解析接收到的PDU时加快正确实例的识别。"
    },
    {
      "indent": 3,
      "text": "Clarification that when operating in point-to-point mode on a broadcast circuit the IID-TLV is only included in point-to-point IIHs associated with non-zero instances has been added. This addresses Errata ID 4519 [Err4519].",
      "zh-CHS": "已添加说明，当在广播电路上以点对点模式运行时，IID-TLV仅包括在与非零实例相关的点对点IIH中。这解决了勘误表ID4519[Err4519]。"
    },
    {
      "indent": 3,
      "text": "Clarification of the appropriate MAC multicast addresses to use when sending PDUs on a broadcast interface for both standard instance and non-zero instances has been provided. This addresses Errata ID 4520 [Err4520].",
      "zh-CHS": "已经提供了在标准实例和非零实例的广播接口上发送PDU时要使用的适当MAC多播地址的说明。这解决了勘误表ID4520[Err4520]。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "The authors greatly acknowledge Mike Shand, Abhay Roy, and Dave Ward for their contributions as coauthors of RFC 6822. In addition, we note that RFC 6822 acknowledged contributions made by Dino Farinacci and Tony Li.",
      "zh-CHS": "作者非常感谢迈克·山德、阿比·罗伊和戴夫·沃德作为RFC6822的合著者所做的贡献。此外，我们注意到RFC 6822对迪诺·法里纳奇和托尼·李的贡献表示感谢。"
    },
    {
      "indent": 3,
      "text": "The authors of this document would also like to thank Paul Wells.",
      "zh-CHS": "本文件的作者还要感谢Paul Wells。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Les Ginsberg Cisco Systems 821 Alder Drive Milpitas, CA 95035 United States of America",
      "zh-CHS": "美国加利福尼亚州米尔皮塔斯阿尔德大道821号莱斯金斯堡思科系统公司，邮编95035"
    },
    {
      "indent": 3,
      "text": "Email: ginsberg@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems Via Del Serafico 200 Rome 0144 Italy",
      "zh-CHS": "Stefano Previdi Cisco Systems Via Del Serafico 200罗马0144意大利"
    },
    {
      "indent": 3,
      "text": "Email: sprevidi@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Wim Henderickx Nokia Belgium",
      "zh-CHS": "Wim Henderickx诺基亚比利时"
    },
    {
      "indent": 3,
      "text": "Email: wim.henderickx@nokia.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}