{
  "title": {
    "text": "RFC 8106: IPv6 Router Advertisement Options for DNS Configuration",
    "zh-CHS": "RFC 8106"
  },
  "number": 8106,
  "created_at": "2021-10-28 18:48:11.102187+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          J. Jeong\nRequest for Comments: 8106                       Sungkyunkwan University\nObsoletes: 6106                                                  S. Park\nCategory: Standards Track                            Samsung Electronics\nISSN: 2070-1721                                               L. Beloeil\n                                                                  Orange\n                                                          S. Madanapalli\n                                                                NTT Data\n                                                              March 2017",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "IPv6 Router Advertisement Options for DNS Configuration",
      "zh-CHS": "用于DNS配置的IPv6路由器播发选项"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document specifies IPv6 Router Advertisement (RA) options (called \"DNS RA options\") to allow IPv6 routers to advertise a list of DNS Recursive Server Addresses and a DNS Search List to IPv6 hosts.",
      "zh-CHS": "本文档指定了IPv6路由器公布（RA）选项（称为“DNS RA选项”），以允许IPv6路由器向IPv6主机公布DNS递归服务器地址列表和DNS搜索列表。"
    },
    {
      "indent": 3,
      "text": "This document, which obsoletes RFC 6106, defines a higher default value of the lifetime of the DNS RA options to reduce the likelihood of expiry of the options on links with a relatively high rate of packet loss.",
      "zh-CHS": "本文件淘汰了RFC 6106，定义了DNS RA选项生存期的更高默认值，以降低分组丢失率相对较高的链路上选项到期的可能性。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8106.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8106."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Applicability Statements ...................................3\n   1.2. Coexistence of RA Options and DHCP Options for DNS\n        Configuration ..............................................4\n2. Requirements Language ...........................................4\n3. Terminology .....................................................4\n4. Overview ........................................................5\n5. Neighbor Discovery Extension ....................................5\n   5.1. Recursive DNS Server Option ................................6\n   5.2. DNS Search List Option .....................................7\n   5.3. DNS Configuration Procedure ................................8\n        5.3.1. Procedure in IPv6 Hosts .............................9\n        5.3.2. Warnings for DNS Options Configuration ..............9\n6. Implementation Considerations ..................................10\n   6.1. DNS Repository Management .................................10\n   6.2. Synchronization between DNS Server List and\n        Resolver Repository .......................................11\n   6.3. Synchronization between DNS Search List and\n        Resolver Repository .......................................12\n7. Security Considerations ........................................12\n   7.1. Security Threats ..........................................12\n   7.2. Recommendations ...........................................13\n8. IANA Considerations ............................................13\n9. References .....................................................14\n   9.1. Normative References ......................................14\n   9.2. Informative References ....................................14\nAppendix A. Changes from RFC 6106 .................................17\nAcknowledgements ..................................................18\nAuthors' Addresses ................................................19",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to standardize IPv6 Router Advertisement (RA) options (DNS RA options) for DNS Recursive Server Addresses used for DNS name resolution in IPv6 hosts, and also for a DNS Search List (DNSSL) of domain suffixes.",
      "zh-CHS": "本文档旨在为IPv6主机中用于DNS名称解析的DNS递归服务器地址以及域后缀的DNS搜索列表（DNSSL）标准化IPv6路由器广告（RA）选项（DNS RA选项）。"
    },
    {
      "indent": 3,
      "text": "IPv6 Neighbor Discovery (ND) and IPv6 Stateless Address Autoconfiguration (SLAAC) provide ways to configure either fixed or mobile nodes with one or more IPv6 addresses, default routers, and some other parameters [RFC4861] [RFC4862].",
      "zh-CHS": "IPv6邻居发现（ND）和IPv6无状态地址自动配置（SLAAC）提供了使用一个或多个IPv6地址、默认路由器和一些其他参数配置固定或移动节点的方法[RFC4861][RFC4862]。"
    },
    {
      "indent": 3,
      "text": "It is infeasible to manually configure nomadic hosts each time they connect to a different network. While a one-time static configuration is possible, it is generally not desirable on general-purpose hosts such as laptops. For instance, locally defined namespaces would not be available to the host if it were to run its own recursive name server directly connected to the global DNS.",
      "zh-CHS": "不可能在游牧主机每次连接到不同的网络时手动配置它们。虽然一次性静态配置是可能的，但在笔记本电脑等通用主机上通常不可取。例如，如果主机运行自己的直接连接到全局DNS的递归名称服务器，则本地定义的名称空间将不可用于主机。"
    },
    {
      "indent": 3,
      "text": "The DNS information can also be provided through DHCPv6 [RFC3315] [RFC3736] [RFC3646]. However, access to DNS is a fundamental requirement for almost all hosts, so IPv6 SLAAC cannot stand on its own as an alternative deployment model in any practical network without any support for DNS configuration.",
      "zh-CHS": "DNS信息也可以通过DHCPv6[RFC3315][RFC3736][RFC3646]提供。然而，对DNS的访问是几乎所有主机的基本要求，因此IPv6 SLAAC不能在没有任何DNS配置支持的任何实际网络中单独作为替代部署模型。"
    },
    {
      "indent": 3,
      "text": "These issues are not pressing in dual-stack networks as long as a DNS server is available on the IPv4 side, but they become more critical with the deployment of IPv6-only networks. As a result, this document defines a mechanism based on DNS RA options to allow IPv6 hosts to perform automatic DNS configuration.",
      "zh-CHS": "只要IPv4端有DNS服务器可用，这些问题在双栈网络中并不紧迫，但随着仅IPv6网络的部署，这些问题变得更加关键。因此，本文档定义了一种基于DNS RA选项的机制，以允许IPv6主机执行自动DNS配置。"
    },
    {
      "indent": 0,
      "text": "1.1. Applicability Statements",
      "section_title": true,
      "zh-CHS": "1.1. 适用性声明"
    },
    {
      "indent": 3,
      "text": "RA-based DNS configuration is a useful alternative in networks where an IPv6 host's address is autoconfigured through IPv6 SLAAC and where either (i) there is no DHCPv6 infrastructure at all or (ii) some hosts do not have a DHCPv6 client. The intention is to enable the full configuration of basic networking information for hosts without requiring DHCPv6. However, for networks that need to distribute additional information, DHCPv6 is likely to be employed. In these networks, RA-based DNS configuration may not be needed.",
      "zh-CHS": "在通过IPv6 SLAAC自动配置IPv6主机地址的网络中，基于RA的DNS配置是一种有用的替代方案，并且（i）根本没有DHCPv6基础设施，或者（ii）某些主机没有DHCPv6客户端。其目的是在不需要DHCPv6的情况下为主机启用基本网络信息的完整配置。然而，对于需要分发额外信息的网络，可能会使用DHCPv6。在这些网络中，可能不需要基于RA的DNS配置。"
    },
    {
      "indent": 3,
      "text": "RA-based DNS configuration allows an IPv6 host to acquire the DNS configuration (i.e., DNS Recursive Server Addresses and the DNSSL) for the link(s) to which the host is connected. Furthermore, the host learns this DNS configuration from the same RA message that provides configuration information for the link.",
      "zh-CHS": "基于RA的DNS配置允许IPv6主机获取主机所连接链路的DNS配置（即DNS递归服务器地址和DNSSL）。此外，主机从为链路提供配置信息的同一RA消息中学习此DNS配置。"
    },
    {
      "indent": 3,
      "text": "The advantages and disadvantages of the RA-based approach are discussed in [RFC4339] along with other approaches, such as the DHCP and well-known anycast address approaches.",
      "zh-CHS": "[RFC4339]中讨论了基于RA的方法的优缺点以及其他方法，如DHCP和众所周知的选播地址方法。"
    },
    {
      "indent": 0,
      "text": "1.2. Coexistence of RA Options and DHCP Options for DNS Configuration",
      "section_title": true,
      "zh-CHS": "1.2. DNS配置的RA选项和DHCP选项共存"
    },
    {
      "indent": 3,
      "text": "Two protocols exist to configure the DNS information on a host: the RA options specified in this document and the DHCPv6 options specified in [RFC3646]. They can be used together. The rules governing the decision to use stateful configuration mechanisms are specified in [RFC4861]. Hosts conforming to this specification MUST extract DNS information from RA messages, unless static DNS configuration has been specified by the user. If there is DNS information available from multiple RAs and/or from DHCP, the host MUST maintain an ordered list of this information as specified in Section 5.3.1.",
      "zh-CHS": "存在两种协议来配置主机上的DNS信息：本文档中指定的RA选项和[RFC3646]中指定的DHCPv6选项。它们可以一起使用。[RFC4861]中规定了决定使用有状态配置机制的规则。符合此规范的主机必须从RA消息中提取DNS信息，除非用户指定了静态DNS配置。如果有来自多个RAs和/或DHCP的DNS信息可用，主机必须按照第5.3.1节的规定维护该信息的有序列表。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "zh-CHS": "2. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "zh-CHS": "3. 术语"
    },
    {
      "indent": 3,
      "text": "This document uses the terminology defined in [RFC4861] and [RFC4862]. In addition, six new terms are defined below:",
      "zh-CHS": "本文件使用[RFC4861]和[RFC4862]中定义的术语。此外，以下定义了六个新术语："
    },
    {
      "indent": 3,
      "text": "o Recursive DNS Server (RDNSS): A server that provides a recursive DNS resolution service for translating domain names into IP addresses or resolving PTR records as defined in [RFC1034] and [RFC1035].",
      "zh-CHS": "o 递归DNS服务器（RDNS）：提供递归DNS解析服务的服务器，用于将域名转换为IP地址或解析[RFC1034]和[RFC1035]中定义的PTR记录。"
    },
    {
      "indent": 3,
      "text": "o RDNSS Option: An IPv6 RA option to deliver the RDNSS information to IPv6 hosts [RFC4861].",
      "zh-CHS": "o RDNSS选项：一个IPv6 RA选项，用于将RDNSS信息传送到IPv6主机[RFC4861]。"
    },
    {
      "indent": 3,
      "text": "o DNS Search List (DNSSL): The list of DNS suffix domain names used by IPv6 hosts when they perform DNS query searches for short, unqualified domain names.",
      "zh-CHS": "o DNS搜索列表（DNSSL）：IPv6主机在执行DNS查询搜索短域名时使用的DNS后缀域名列表。"
    },
    {
      "indent": 3,
      "text": "o DNSSL Option: An IPv6 RA option to deliver the DNSSL information to IPv6 hosts.",
      "zh-CHS": "o DNSSL选项：一个IPv6 RA选项，用于将DNSSL信息传递到IPv6主机。"
    },
    {
      "indent": 3,
      "text": "o DNS Repository: Two data structures for managing DNS configuration information in the IPv6 protocol stack, in addition to the Neighbor Cache and Destination Cache for Neighbor Discovery",
      "zh-CHS": "o DNS存储库：用于管理IPv6协议栈中DNS配置信息的两种数据结构，以及用于邻居发现的邻居缓存和目标缓存"
    },
    {
      "indent": 6,
      "text": "[RFC4861]. The first data structure is the DNS Server List for RDNSS addresses, and the second is the DNSSL for DNS search domain names.",
      "zh-CHS": "[RFC4861]。第一个数据结构是用于RDNS地址的DNS服务器列表，第二个数据结构是用于DNS搜索域名的DNSSL。"
    },
    {
      "indent": 3,
      "text": "o Resolver Repository: Configuration repository with RDNSS addresses and a DNSSL that a DNS resolver on the host uses for DNS name resolution -- for example, the UNIX resolver file (i.e., /etc/resolv.conf) and the Windows registry.",
      "zh-CHS": "o 解析程序存储库：配置存储库，具有RDNS地址和主机上DNS解析程序用于DNS名称解析的DNSSL——例如，UNIX解析程序文件（即/etc/resolv.conf）和Windows注册表。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "zh-CHS": "4. 概述"
    },
    {
      "indent": 3,
      "text": "This document standardizes an ND option called the \"RDNSS option\", which contains the addresses of RDNSSes. This document also standardizes an ND option called the \"DNSSL option\", which contains the DNSSL. This is to maintain parity with the DHCPv6 options and to ensure that there is necessary functionality to determine the search domains.",
      "zh-CHS": "本文档标准化了名为“RDNSS选项”的ND选项，该选项包含RDNSS的地址。本文档还标准化了一个名为“DNSSL选项”的ND选项，该选项包含DNSSL。这是为了与DHCPv6选项保持一致，并确保有必要的功能来确定搜索域。"
    },
    {
      "indent": 3,
      "text": "The existing ND message (i.e., RA) is used to carry this information. An IPv6 host can configure the IPv6 addresses of one or more RDNSSes via RA messages. Through the RDNSS and DNSSL options, along with the Prefix Information option based on the ND protocol [RFC4861] [RFC4862], an IPv6 host can perform the network configuration of its IPv6 address and the DNS information simultaneously without needing DHCPv6 for the DNS configuration. The RA options for RDNSS and DNSSL can be used on networks that support the use of ND.",
      "zh-CHS": "现有ND消息（即RA）用于承载该信息。IPv6主机可以通过RA消息配置一个或多个RDNSE的IPv6地址。通过RDNS和DNSSL选项，以及基于ND协议[RFC4861][RFC4862]的前缀信息选项，IPv6主机可以同时执行其IPv6地址和DNS信息的网络配置，而无需DHCPv6进行DNS配置。RDNS和DNSSL的RA选项可用于支持ND使用的网络。"
    },
    {
      "indent": 3,
      "text": "This approach requires manual configuration or automatic mechanisms (e.g., DHCPv6 or vendor-proprietary configuration mechanisms) to configure the DNS information in routers sending the advertisements. The automatic configuration of RDNSS addresses and a DNSSL in routers is out of scope for this document.",
      "zh-CHS": "这种方法需要手动配置或自动机制（例如，DHCPv6或供应商专有配置机制）来配置发送广告的路由器中的DNS信息。路由器中RDNS地址和DNSSL的自动配置超出了本文档的范围。"
    },
    {
      "indent": 0,
      "text": "5. Neighbor Discovery Extension",
      "section_title": true,
      "zh-CHS": "5. 邻居发现扩展"
    },
    {
      "indent": 3,
      "text": "The IPv6 DNS configuration mechanism described in this document needs two ND options in Neighbor Discovery: (i) the RDNSS option and (ii) the DNSSL option.",
      "zh-CHS": "本文档中描述的IPv6 DNS配置机制在邻居发现中需要两个ND选项：（i）RDNSS选项和（ii）DNSSL选项。"
    },
    {
      "indent": 0,
      "text": "5.1. Recursive DNS Server Option",
      "section_title": true,
      "zh-CHS": "5.1. 递归DNS服务器选项"
    },
    {
      "indent": 3,
      "text": "The RDNSS option contains one or more IPv6 addresses of RDNSSes. All of the addresses share the same Lifetime value. If it is desirable to have different Lifetime values, multiple RDNSS options can be used. Figure 1 shows the format of the RDNSS option.",
      "zh-CHS": "RDNSS选项包含RDNSS的一个或多个IPv6地址。所有地址共享相同的生存期值。如果希望具有不同的生存期值，则可以使用多个RDNS选项。图1显示了RDNS选项的格式。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Length    |           Reserved            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Lifetime                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n:            Addresses of IPv6 Recursive DNS Servers            :\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "Figure 1: RDNSS Option Format",
      "zh-CHS": "图1:RDNS选项格式"
    },
    {
      "indent": 3,
      "text": "Fields:",
      "zh-CHS": "领域："
    },
    {
      "indent": 3,
      "text": "Type 8-bit identifier of the RDNSS option type as assigned by IANA: 25",
      "zh-CHS": "IANA分配的RDNS选项类型的8位标识符：25"
    },
    {
      "indent": 3,
      "text": "Length 8-bit unsigned integer. The length of the option (including the Type and Length fields) is in units of 8 octets. The minimum value is 3 if one IPv6 address is contained in the option. Every additional RDNSS address increases the length by 2. The Length field is used by the receiver to determine the number of IPv6 addresses in the option.",
      "zh-CHS": "长度为8位无符号整数。选项的长度（包括类型和长度字段）以8个八位字节为单位。如果选项中包含一个IPv6地址，则最小值为3。每增加一个RDNS地址，长度就会增加2。接收器使用长度字段来确定选项中的IPv6地址数。"
    },
    {
      "indent": 3,
      "text": "Lifetime 32-bit unsigned integer. The maximum time in seconds (relative to the time the packet is received) over which these RDNSS addresses MAY be used for name resolution. The value of Lifetime SHOULD by default be at least 3 * MaxRtrAdvInterval, where MaxRtrAdvInterval is the maximum RA interval as defined in [RFC4861]. A value of all one bits (0xffffffff) represents infinity. A value of zero means that the RDNSS addresses MUST no longer be used.",
      "zh-CHS": "生存期32位无符号整数。这些RDNS地址可用于名称解析的最长时间（相对于接收数据包的时间），以秒为单位。默认情况下，生存期的值应至少为3*MaxRtrAdvInterval，其中MaxRtrAdvInterval是[RFC4861]中定义的最大RA间隔。所有一位的值（0xFFFFFF）表示无穷大。值为零表示不能再使用RDNS地址。"
    },
    {
      "indent": 3,
      "text": "Addresses of IPv6 Recursive DNS Servers One or more 128-bit IPv6 addresses of the RDNSSes. The number of addresses is determined by the Length field. That is, the number of addresses is equal to (Length - 1) / 2.",
      "zh-CHS": "IPv6递归DNS服务器的地址RDNSE的一个或多个128位IPv6地址。地址数由长度字段决定。也就是说，地址数等于（长度-1）/2。"
    },
    {
      "indent": 3,
      "text": "Note: The addresses for RDNSSes in the RDNSS option MAY be link-local addresses. Such link-local addresses SHOULD be registered in the Resolver Repository along with the corresponding link zone indices of the links that receive the RDNSS option(s) for them. The link-local addresses MAY be represented in the Resolver Repository with their link zone indices in the textual format for scoped addresses as described in [RFC4007]. When a resolver sends a DNS query message to an RDNSS identified by a link-local address, it MUST use the corresponding link.",
      "zh-CHS": "注意：RDNSS选项中的RDNSS地址可能是链路本地地址。此类链路本地地址应与接收RDNS选项的链路的相应链路区域索引一起注册到解析器存储库中。链接本地地址可在解析器存储库中表示，其链接区域索引为[RFC4007]中所述的作用域地址的文本格式。当解析程序向链接本地地址标识的RDNS发送DNS查询消息时，它必须使用相应的链接。"
    },
    {
      "indent": 9,
      "text": "The rationale of the default value of the Lifetime field is as follows. The Router Lifetime field, set by AdvDefaultLifetime, has the default of 3 * MaxRtrAdvInterval as specified in [RFC4861], so such a default or a larger default can allow for the reliability of DNS options even under the loss of RAs on links with a relatively high rate of packet loss. Note that the ratio of AdvDefaultLifetime to MaxRtrAdvInterval is the number of unsolicited multicast RAs sent by the router. Since the DNS option entries can survive for at most three consecutive losses of RAs containing DNS options, the default value of the Lifetime lets the DNS option entries be resilient to packet-loss environments.",
      "zh-CHS": "Lifetime字段的默认值的基本原理如下。由AdvDefaultLifetime设置的Router Lifetime字段具有[RFC4861]中指定的默认值3*MaxRtrAdvInterval，因此，即使在数据包丢失率相对较高的链路上丢失RAs的情况下，这样的默认值或更大的默认值也可以允许DNS选项的可靠性。请注意，AdvDefaultLifetime与MaxRtrAdvInterval的比率是路由器发送的未经请求的多播RAs的数量。由于DNS选项条目最多可以连续丢失三次包含DNS选项的RAs，因此生存期的默认值使DNS选项条目能够适应丢包环境。"
    },
    {
      "indent": 0,
      "text": "5.2. DNS Search List Option",
      "section_title": true,
      "zh-CHS": "5.2. DNS搜索列表选项"
    },
    {
      "indent": 3,
      "text": "The DNSSL option contains one or more domain names of DNS suffixes. All of the domain names share the same Lifetime value. If it is desirable to have different Lifetime values, multiple DNSSL options can be used. Figure 2 shows the format of the DNSSL option.",
      "zh-CHS": "DNSSL选项包含一个或多个DNS后缀域名。所有域名共享相同的生存期值。如果希望具有不同的生存期值，则可以使用多个DNSSL选项。图2显示了DNSSL选项的格式。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Length    |           Reserved            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Lifetime                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n:                Domain Names of DNS Search List                :\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "Figure 2: DNSSL Option Format",
      "zh-CHS": "图2:DNSSL选项格式"
    },
    {
      "indent": 3,
      "text": "Fields:",
      "zh-CHS": "领域："
    },
    {
      "indent": 3,
      "text": "Type 8-bit identifier of the DNSSL option type as assigned by IANA: 31",
      "zh-CHS": "IANA分配的DNSSL选项类型的8位标识符：31"
    },
    {
      "indent": 3,
      "text": "Length 8-bit unsigned integer. The length of the option (including the Type and Length fields) is in units of 8 octets. The minimum value is 2 if at least one domain name is contained in the option. The Length field is set to a multiple of 8 octets to accommodate all the domain names in the \"Domain Names of DNS Search List\" field.",
      "zh-CHS": "长度为8位无符号整数。选项的长度（包括类型和长度字段）以8个八位字节为单位。如果选项中至少包含一个域名，则最小值为2。长度字段设置为8个八位字节的倍数，以容纳“DNS搜索列表的域名”字段中的所有域名。"
    },
    {
      "indent": 3,
      "text": "Lifetime 32-bit unsigned integer. The maximum time in seconds (relative to the time the packet is received) over which these DNSSL domain names MAY be used for name resolution. The Lifetime value has the same semantics as the semantics for the RDNSS option. That is, Lifetime SHOULD by default be at least 3 * MaxRtrAdvInterval. A value of all one bits (0xffffffff) represents infinity. A value of zero means that the DNSSL domain names MUST no longer be used.",
      "zh-CHS": "生存期32位无符号整数。这些DNSSL域名可用于名称解析的最长时间（相对于接收数据包的时间），以秒为单位。生存期值的语义与RDNSS选项的语义相同。也就是说，默认情况下，生存期应至少为3*maxrtradvnterval。所有一位的值（0xFFFFFF）表示无穷大。值为零表示不能再使用DNSSL域名。"
    },
    {
      "indent": 3,
      "text": "Domain Names of DNS Search List One or more domain names of the DNSSL that MUST be encoded as described in Section 3.1 of [RFC1035]. With this technique, each domain name is represented as a sequence of labels ending in a zero octet, defined as a domain name representation. For more than one domain name, the corresponding domain name representations are concatenated as they are. Note that for the simple decoding, the domain names MUST NOT be encoded in the compressed form described in Section 4.1.4 of [RFC1035]. Because the size of this field MUST be a multiple of 8 octets, for the minimum multiple including the domain name representations, the remaining octets other than the encoding parts of the domain name representations MUST be padded with zeros.",
      "zh-CHS": "DNS搜索域名列出必须按照[RFC1035]第3.1节所述进行编码的一个或多个DNSSL域名。使用这种技术，每个域名都表示为一系列以零八位元结尾的标签，定义为域名表示。对于多个域名，相应的域名表示按原样连接。请注意，对于简单解码，不得以[RFC1035]第4.1.4节所述的压缩形式对域名进行编码。由于此字段的大小必须是8个八位字节的倍数，对于包含域名表示的最小倍数，除域名表示的编码部分之外的其余八位字节必须用零填充。"
    },
    {
      "indent": 0,
      "text": "5.3. DNS Configuration Procedure",
      "section_title": true,
      "zh-CHS": "5.3. DNS配置过程"
    },
    {
      "indent": 3,
      "text": "The procedure for DNS configuration through the RDNSS and DNSSL options is the same as it is with any other ND option [RFC4861].",
      "zh-CHS": "通过RDNS和DNSSL选项进行DNS配置的过程与任何其他ND选项[RFC4861]的过程相同。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Procedure in IPv6 Hosts",
      "section_title": true,
      "zh-CHS": "5.3.1. IPv6主机中的过程"
    },
    {
      "indent": 3,
      "text": "When an IPv6 host receives DNS options (i.e., RDNSS and DNSSL options) through RA messages, it processes the options as follows:",
      "zh-CHS": "当IPv6主机通过RA消息接收DNS选项（即RDNS和DNSSL选项）时，它将按如下方式处理选项："
    },
    {
      "indent": 3,
      "text": "o The validity of DNS options is checked with the Length field; that is, the value of the Length field in the RDNSS option is greater than or equal to the minimum value (3) and satisfies the requirement that (Length - 1) % 2 == 0. The value of the Length field in the DNSSL option is greater than or equal to the minimum value (2). Also, the validity of the RDNSS option is checked with the \"Addresses of IPv6 Recursive DNS Servers\" field; that is, the addresses should be unicast addresses.",
      "zh-CHS": "o 使用长度字段检查DNS选项的有效性；也就是说，RDNSS选项中长度字段的值大于或等于最小值（3），并且满足（长度-1）%2==0的要求。DNSSL选项中长度字段的值大于或等于最小值（2）。此外，使用“IPv6递归DNS服务器的地址”字段检查RDNSS选项的有效性；也就是说，地址应该是单播地址。"
    },
    {
      "indent": 3,
      "text": "o If the DNS options are valid, the host SHOULD copy the values of the options into the DNS Repository and the Resolver Repository in order. Otherwise, the host MUST discard the options. Refer to Section 6 for the detailed procedure.",
      "zh-CHS": "o 如果DNS选项有效，主机应按顺序将选项的值复制到DNS存储库和解析程序存储库中。否则，主机必须放弃这些选项。有关详细程序，请参阅第6节。"
    },
    {
      "indent": 3,
      "text": "In the case where the DNS information of RDNSS and DNSSL can be obtained from multiple sources, such as RAs and DHCP, the IPv6 host SHOULD keep some DNS options from all sources. Unless explicitly specified for the discovery mechanism, the exact number of addresses and domain names to keep is a matter of local policy and implementation choice as a local configuration option. However, in the case of multiple sources, the ability to store a total of at least three RDNSS addresses (or DNSSL domain names) from the multiple sources is RECOMMENDED. The DNS options from RAs and DHCP SHOULD be stored in the DNS Repository and Resolver Repository so that information from DHCP appears there first and therefore takes precedence. Thus, the DNS information from DHCP takes precedence over that from RAs for DNS queries. On the other hand, for DNS options announced by RAs, if some RAs use the Secure Neighbor Discovery (SEND) protocol [RFC3971] for RA security, they MUST be preferred over those that do not use SEND. Also, DNS options announced by RAs via SEND MUST be preferred over those announced by unauthenticated DHCP [RFC3118]. Refer to Section 7 for a detailed discussion of SEND for DNS RA options.",
      "zh-CHS": "如果可以从多个源（如RAs和DHCP）获取RDNS和DNSSL的DNS信息，IPv6主机应保留来自所有源的一些DNS选项。除非为发现机制明确指定，否则要保留的地址和域名的确切数量取决于本地策略和作为本地配置选项的实现选择。但是，对于多个源，建议能够存储来自多个源的至少三个RDNS地址（或DNSSL域名）。来自RAs和DHCP的DNS选项应存储在DNS存储库和解析程序存储库中，以便来自DHCP的信息首先出现在那里，因此优先。因此，对于DNS查询，来自DHCP的DNS信息优先于来自RAs的DNS信息。另一方面，对于RAs宣布的DNS选项，如果一些RAs使用安全邻居发现（SEND）协议[RFC3971]实现RA安全，则必须优先于不使用SEND的。此外，RAs通过SEND宣布的DNS选项必须优先于未经验证的DHCP[RFC3118]宣布的DNS选项。有关发送DNS RA选项的详细讨论，请参阅第7节。"
    },
    {
      "indent": 0,
      "text": "5.3.2. Warnings for DNS Options Configuration",
      "section_title": true,
      "zh-CHS": "5.3.2. DNS选项配置警告"
    },
    {
      "indent": 3,
      "text": "There are two warnings for DNS options configuration: (i) warning for multiple sources of DNS options and (ii) warning for multiple network interfaces. First, in the case of multiple sources for DNS options (e.g., RAs and DHCP), an IPv6 host can configure its IP addresses from these sources. In this case, it is not possible to control how the host uses DNS information and what source addresses it uses to send DNS queries. As a result, configurations where different",
      "zh-CHS": "DNS选项配置有两个警告：（i）多个DNS选项源的警告和（ii）多个网络接口的警告。首先，对于DNS选项的多个源（例如，RAs和DHCP），IPv6主机可以从这些源配置其IP地址。在这种情况下，无法控制主机如何使用DNS信息以及它用于发送DNS查询的源地址。因此，不同的配置"
    },
    {
      "indent": 3,
      "text": "information is provided by different mechanisms for autoconfiguration may lead to problems. Therefore, the network administrator needs to carefully configure different DNS options in the multiple mechanisms for autoconfiguration in order to minimize the impact of such problems [DHCPv6-SLAAC].",
      "zh-CHS": "信息由不同的机制提供，自动配置可能会导致问题。因此，网络管理员需要在多个自动配置机制中仔细配置不同的DNS选项，以便将此类问题的影响降至最低[DHCPv6 SLAAC]。"
    },
    {
      "indent": 3,
      "text": "Second, if different DNS information is provided on different network interfaces, this can lead to inconsistent behavior. The IETF worked on solving this problem for both DNS and other information obtained from multiple interfaces [RFC6418] [RFC6419] and standardized a DHCP-based solution for RDNSS selection for multi-interfaced nodes as described in [RFC6731].",
      "zh-CHS": "其次，如果在不同的网络接口上提供不同的DNS信息，这可能会导致不一致的行为。IETF致力于解决从多个接口[RFC6418][RFC6419]获得的DNS和其他信息的问题，并为多接口节点的RDNS选择标准化了基于DHCP的解决方案，如[RFC6731]所述。"
    },
    {
      "indent": 0,
      "text": "6. Implementation Considerations",
      "section_title": true,
      "zh-CHS": "6. 实施考虑"
    },
    {
      "indent": 3,
      "text": "The implementation considerations in this document include the following three: (i) DNS repository management, (ii) synchronization between the DNS Server List and the Resolver Repository, and (iii) synchronization between the DNSSL and the Resolver Repository.",
      "zh-CHS": "本文档中的实施注意事项包括以下三点：（i）DNS存储库管理，（ii）DNS服务器列表和冲突解决程序存储库之间的同步，以及（iii）DNSSL和冲突解决程序存储库之间的同步。"
    },
    {
      "indent": 3,
      "text": "Note: The implementations that are updated according to this document will still interoperate with the existing implementations according to [RFC6106]. This is because the main change in this document is the increase of the default Lifetime of DNS options, considering lossy links.",
      "zh-CHS": "注意：根据本文档更新的实现仍将根据[RFC6106]与现有实现进行互操作。这是因为考虑到有损链接，本文档中的主要更改是增加了DNS选项的默认生存期。"
    },
    {
      "indent": 0,
      "text": "6.1. DNS Repository Management",
      "section_title": true,
      "zh-CHS": "6.1. DNS存储库管理"
    },
    {
      "indent": 3,
      "text": "For DNS repository management, the following two data structures SHOULD be synchronized with the Resolver Repository: (i) the DNS Server List, which keeps the list of RDNSS addresses and (ii) the DNSSL, which keeps the list of DNS search domain names. Each entry in these two lists consists of a pair of an RDNSS address (or DNSSL domain name) and Expiration-time as follows:",
      "zh-CHS": "对于DNS存储库管理，以下两个数据结构应与解析程序存储库同步：（i）DNS服务器列表，它保存RDNS地址列表；（ii）DNSSL，它保存DNS搜索域名列表。这两个列表中的每个条目由一对RDNSS地址（或DNSSL域名）和过期时间组成，如下所示："
    },
    {
      "indent": 3,
      "text": "o RDNSS address for DNS Server List: IPv6 address of the RDNSS that is available for recursive DNS resolution service in the network advertising the RDNSS option.",
      "zh-CHS": "o DNS服务器的RDNS地址列表：在公布RDNS选项的网络中，可用于递归DNS解析服务的RDNS的IPv6地址。"
    },
    {
      "indent": 3,
      "text": "o DNSSL domain name for DNSSL: DNS suffix domain name that is used to perform DNS query searches for short, unqualified domain names.",
      "zh-CHS": "o DNSSL的DNSSL域名：DNS后缀域名，用于执行DNS查询搜索短的、不合格的域名。"
    },
    {
      "indent": 3,
      "text": "o Expiration-time for DNS Server List or DNSSL: The time when this entry becomes invalid. Expiration-time is set to the value of the Lifetime field of the RDNSS option or DNSSL option plus the current time. Whenever a new RDNSS option with the same address (or DNSSL option with the same domain name) is received on the same interface as a previous RDNSS option (or DNSSL option), this",
      "zh-CHS": "o DNS服务器列表或DNSSL的过期时间：此项无效的时间。过期时间设置为RDNSS选项或DNSSL选项的生存期字段值加上当前时间。每当在与以前的RDNS选项（或DNSSL选项）相同的接口上接收到具有相同地址的新RDNS选项（或具有相同域名的DNSSL选项）时，此"
    },
    {
      "indent": 6,
      "text": "field is updated to have a new Expiration-time. When the current time becomes larger than Expiration-time, this entry is regarded as expired, so it should not be used any more. Note that the DNS information for the RDNSS and DNSSL options need not be dropped if the expiry of the RA router lifetime happens. This is because these options have their own lifetime values.",
      "zh-CHS": "字段将更新为具有新的过期时间。当当前时间大于过期时间时，此条目被视为已过期，因此不应再使用它。请注意，如果RA路由器生存期到期，则不需要删除RDNS和DNSSL选项的DNS信息。这是因为这些选项有自己的生存期值。"
    },
    {
      "indent": 0,
      "text": "6.2. Synchronization between DNS Server List and Resolver Repository",
      "section_title": true,
      "zh-CHS": "6.2. DNS服务器列表和解析程序存储库之间的同步"
    },
    {
      "indent": 3,
      "text": "When an IPv6 host receives the information of multiple RDNSS addresses within a network (e.g., campus network and company network) through an RA message with RDNSS option(s), it stores the RDNSS addresses (in order) in both the DNS Server List and the Resolver Repository. The processing of the RDNSS consists of (i) the processing of RDNSS option(s) included in an RA message and (ii) the handling of expired RDNSSes. The processing of RDNSS option(s) is as follows:",
      "zh-CHS": "当IPv6主机通过带有RDNS选项的RA消息接收到网络（如校园网和公司网）内多个RDNS地址的信息时，它会将RDNS地址（按顺序）存储在DNS服务器列表和解析程序存储库中。RDNS的处理包括（i）处理RA消息中包含的RDNS选项和（ii）处理过期的RDNS。RDNS选项的处理如下所示："
    },
    {
      "indent": 3,
      "text": "o Step (a): Receive and parse the RDNSS option(s). For the RDNSS addresses in each RDNSS option, perform Steps (b) through (d).",
      "zh-CHS": "o 步骤（a）：接收并解析RDNSS选项。对于每个RDNS选项中的RDNS地址，执行步骤（b）至（d）。"
    },
    {
      "indent": 3,
      "text": "o Step (b): For each RDNSS address, check the following: If the RDNSS address already exists in the DNS Server List and the RDNSS option's Lifetime field is set to zero, delete the corresponding RDNSS entry from both the DNS Server List and the Resolver Repository in order to prevent the RDNSS address from being used any more for certain reasons in network management, e.g., the termination of the RDNSS or a renumbering scenario. That is, the RDNSS can resign from its DNS service because the machine running the RDNSS is out of service intentionally or unintentionally. Also, in the renumbering scenario, the RDNSS's IPv6 address will be changed, so the previous RDNSS address should not be used any more. The processing of this RDNSS address is finished here. Otherwise, go to Step (c).",
      "zh-CHS": "o 步骤（b）：对于每个RDNS地址，检查以下内容：如果DNS服务器列表中已经存在RDNS地址，并且RDNS选项的生存期字段设置为零，从DNS服务器列表和解析程序存储库中删除相应的RDNS条目，以防止RDNS地址因网络管理中的某些原因而被再次使用，例如，RDNS的终止或重新编号方案。也就是说，RDNS可以退出其DNS服务，因为运行RDNS的机器有意或无意地停止服务。此外，在重新编号方案中，RDNS的IPv6地址将更改，因此不应再使用以前的RDNS地址。此RDNS地址的处理在此完成。否则，转至步骤（c）。"
    },
    {
      "indent": 3,
      "text": "o Step (c): For each RDNSS address, if it already exists in the DNS Server List and the RDNSS option's Lifetime field is not set to zero, then just update the value of the Expiration-time field according to the procedure specified in the third bullet of Section 6.1. Otherwise, go to Step (d).",
      "zh-CHS": "o 步骤（c）：对于每个RDNSS地址，如果它已经存在于DNS服务器列表中，并且RDNSS选项的生存期字段未设置为零，则只需根据第6.1节第三个项目符号中指定的程序更新过期时间字段的值。否则，转至步骤（d）。"
    },
    {
      "indent": 3,
      "text": "o Step (d): For each RDNSS address, if it does not exist in the DNS Server List, register the RDNSS address and Lifetime with the DNS Server List and then insert the RDNSS address as the first one in the Resolver Repository. In the case where the data structure for the DNS Server List is full of RDNSS entries (that is, has more RDNSSes than the sufficient number discussed in Section 5.3.1), delete from the DNS Server List the entry with the shortest",
      "zh-CHS": "o 步骤（d）：对于每个RDNS地址，如果它不存在于DNS服务器列表中，请在DNS服务器列表中注册RDNS地址和生存期，然后将RDNS地址作为第一个地址插入解析程序存储库。如果DNS服务器列表的数据结构中满是RDNSS条目（即，RDNSS的数量超过第5.3.1节中讨论的足够数量），请从DNS服务器列表中删除最短的条目"
    },
    {
      "indent": 6,
      "text": "Expiration-time (i.e., the entry that will expire first). The corresponding RDNSS address is also deleted from the Resolver Repository. For the ordering of RDNSS addresses in an RDNSS option, position the first RDNSS address in the RDNSS option as the first one in the Resolver Repository, the second RDNSS address in the option as the second one in the repository, and so on. This ordering allows the RDNSS addresses in the RDNSS option to be preferred according to their order in the RDNSS option for DNS name resolution. The processing of these RDNSS addresses is finished here.",
      "zh-CHS": "到期时间（即首先到期的条目）。相应的RDNS地址也将从冲突解决程序存储库中删除。对于RDNSS选项中RDNSS地址的排序，请将RDNSS选项中的第一个RDNSS地址定位为冲突解决程序存储库中的第一个，将选项中的第二个RDNSS地址定位为存储库中的第二个，依此类推。这种排序允许RDNS选项中的RDNS地址根据其在用于DNS名称解析的RDNS选项中的顺序优先选择。这些RDNS地址的处理在此完成。"
    },
    {
      "indent": 3,
      "text": "The handling of expired RDNSSes is as follows: Whenever an entry expires in the DNS Server List, the expired entry is deleted from the DNS Server List, and also the RDNSS address corresponding to the entry is deleted from the Resolver Repository.",
      "zh-CHS": "过期的RDNSS的处理如下：每当DNS服务器列表中的条目过期时，过期的条目将从DNS服务器列表中删除，并且与该条目对应的RDNSS地址也将从解析程序存储库中删除。"
    },
    {
      "indent": 0,
      "text": "6.3. Synchronization between DNS Search List and Resolver Repository",
      "section_title": true,
      "zh-CHS": "6.3. DNS搜索列表和解析程序存储库之间的同步"
    },
    {
      "indent": 3,
      "text": "When an IPv6 host receives the information of multiple DNSSL domain names within a network through an RA message with DNSSL option(s), it stores the DNSSL domain names (in order) in both the DNSSL and the Resolver Repository. The processing of the DNSSL consists of (i) the processing of DNSSL option(s) included in an RA message and (ii) the handling of expired DNSSLs. The processing of DNSSL option(s) is the same as the processing of RDNSS option(s) as described in Section 6.2.",
      "zh-CHS": "当IPv6主机通过带有DNSSL选项的RA消息接收到网络中多个DNSSL域名的信息时，它会将DNSSL域名（按顺序）存储在DNSSL和冲突解决程序存储库中。DNSSL的处理包括（i）处理RA消息中包含的DNSSL选项和（ii）处理过期的DNSSL。DNSSL选项的处理与第6.2节中描述的RDNS选项的处理相同。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "In this section, we analyze security threats related to DNS options and then make recommendations to cope with such security threats.",
      "zh-CHS": "在本节中，我们分析与DNS选项相关的安全威胁，然后提出应对此类安全威胁的建议。"
    },
    {
      "indent": 0,
      "text": "7.1. Security Threats",
      "section_title": true,
      "zh-CHS": "7.1. 安全威胁"
    },
    {
      "indent": 3,
      "text": "For the RDNSS option, an attacker could send an RA with a fraudulent RDNSS address, misleading IPv6 hosts into contacting an unintended DNS server for DNS name resolution. Also, for the DNSSL option, an attacker can let IPv6 hosts resolve a hostname without a DNS suffix into an unintended host's IP address with a fraudulent DNSSL. These attacks are similar to ND attacks specified in [RFC4861] that use Redirect or Neighbor Advertisement messages to redirect traffic to individual addresses of malicious parties.",
      "zh-CHS": "对于RDNS选项，攻击者可以发送具有欺诈RDNSAddress的RA，从而误导IPv6主机联系非预期的DNS服务器以进行DNS名称解析。此外，对于DNSSL选项，攻击者可以让IPv6主机使用欺诈性的DNSSL将不带DNS后缀的主机名解析为意外主机的IP地址。这些攻击类似于[RFC4861]中指定的ND攻击，使用重定向或邻居广告消息将流量重定向到恶意方的各个地址。"
    },
    {
      "indent": 3,
      "text": "However, the security of these RA options for DNS configuration does not affect ND protocol security [RFC4861]. This is because learning DNS information via the RA options cannot be worse than learning bad router information via the RA options. Therefore, the vulnerability of ND is not worse and is a subset of the attacks that any node attached to a LAN can do.",
      "zh-CHS": "但是，DNS配置的这些RA选项的安全性不影响ND协议安全性[RFC4861]。这是因为通过RA选项学习DNS信息比通过RA选项学习坏路由器信息更糟糕。因此，ND的漏洞并不更严重，而是任何连接到LAN的节点都可以进行的攻击的子集。"
    },
    {
      "indent": 0,
      "text": "7.2. Recommendations",
      "section_title": true,
      "zh-CHS": "7.2. 建议"
    },
    {
      "indent": 3,
      "text": "The Secure Neighbor Discovery (SEND) protocol [RFC3971] is designed as a security mechanism for ND. In this case, ND can use SEND to allow all the ND options, including the RDNSS and DNSSL options, to be automatically signed with digital signatures.",
      "zh-CHS": "安全邻居发现（SEND）协议[RFC3971]被设计为ND的安全机制。在这种情况下，ND可以使用SEND允许所有ND选项（包括RDNS和DNSSL选项）使用数字签名自动签名。"
    },
    {
      "indent": 3,
      "text": "It is common for network devices such as switches to include mechanisms to block unauthorized ports from running a DHCPv6 server to provide protection from rogue DHCPv6 servers [RFC7610]. That means that an attacker on other ports cannot insert bogus DNS servers using DHCPv6. The corresponding technique for network devices is RECOMMENDED to block rogue RA messages that include the RDNSS and DNSSL options from unauthorized nodes [RFC6104] [RFC6105].",
      "zh-CHS": "交换机等网络设备通常包括阻止未经授权端口运行DHCPv6服务器的机制，以提供针对恶意DHCPv6服务器的保护[RFC7610]。这意味着其他端口上的攻击者无法使用DHCPv6插入伪造的DNS服务器。建议使用网络设备的相应技术来阻止来自未经授权节点的包含RDNS和DNSSL选项的恶意RA消息[RFC6104][RFC6105]。"
    },
    {
      "indent": 3,
      "text": "An attacker may provide a bogus DNSSL option in order to cause the victim to send DNS queries to a specific DNS server when the victim queries non-FQDNs (fully qualified domain names). For this attack, the DNS resolver in IPv6 hosts can mitigate the vulnerability with the recommendations mentioned in [RFC1535], [RFC1536], and [RFC3646].",
      "zh-CHS": "攻击者可能提供伪造的DNSSL选项，以便在受害者查询非FQDNs（完全限定域名）时，使受害者向特定DNS服务器发送DNS查询。对于此攻击，IPv6主机中的DNS解析器可以使用[RFC1535]、[RFC1536]和[RFC3646]中提到的建议来缓解此漏洞。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "zh-CHS": "8. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The RDNSS option defined in this document uses the IPv6 Neighbor Discovery Option type assigned by IANA as follows:",
      "zh-CHS": "本文档中定义的RDNSS选项使用IANA分配的IPv6邻居发现选项类型，如下所示："
    },
    {
      "indent": 6,
      "text": "Option Name                    Type\n-----------------------------------\nRecursive DNS Server Option    25",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The DNSSL option defined in this document uses the IPv6 Neighbor Discovery Option type assigned by IANA as follows:",
      "zh-CHS": "本文档中定义的DNSSL选项使用IANA分配的IPv6邻居发现选项类型，如下所示："
    },
    {
      "indent": 6,
      "text": "Option Name                    Type\n-----------------------------------\nDNS Search List Option         31",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "These options are registered in the \"IPv6 Neighbor Discovery Option Formats\" registry [ICMPv6].",
      "zh-CHS": "这些选项在“IPv6邻居发现选项格式”注册表[ICMPv6]中注册。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, DOI 10.17487/RFC4861, September 2007, <http://www.rfc-editor.org/info/rfc4861>.",
      "zh-CHS": "[RFC4861]Narten，T.，Nordmark，E.，Simpson，W.，和H.Soliman，“IP版本6（IPv6）的邻居发现”，RFC 4861，DOI 10.17487/RFC48612007年9月<http://www.rfc-editor.org/info/rfc4861>."
    },
    {
      "indent": 3,
      "text": "[RFC4862] Thomson, S., Narten, T., and T. Jinmei, \"IPv6 Stateless Address Autoconfiguration\", RFC 4862, DOI 10.17487/RFC4862, September 2007, <http://www.rfc-editor.org/info/rfc4862>.",
      "zh-CHS": "[RFC4862]Thomson，S.，Narten，T.和T.Jinmei，“IPv6无状态地址自动配置”，RFC 4862，DOI 10.17487/RFC4862，2007年9月<http://www.rfc-editor.org/info/rfc4862>."
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, DOI 10.17487/RFC1035, November 1987, <http://www.rfc-editor.org/info/rfc1035>.",
      "zh-CHS": "[RFC1035]Mockapetris，P.，“域名-实现和规范”，STD 13，RFC 1035，DOI 10.17487/RFC1035，1987年11月<http://www.rfc-editor.org/info/rfc1035>."
    },
    {
      "indent": 3,
      "text": "[RFC4007] Deering, S., Haberman, B., Jinmei, T., Nordmark, E., and B. Zill, \"IPv6 Scoped Address Architecture\", RFC 4007, DOI 10.17487/RFC4007, March 2005, <http://www.rfc-editor.org/info/rfc4007>.",
      "zh-CHS": "[RFC4007]Deering，S.，Haberman，B.，Jinmei，T.，Nordmark，E.，和B.Zill，“IPv6作用域地址体系结构”，RFC 4007，DOI 10.17487/RFC4007，2005年3月<http://www.rfc-editor.org/info/rfc4007>."
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC1034] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, DOI 10.17487/RFC1034, November 1987, <http://www.rfc-editor.org/info/rfc1034>.",
      "zh-CHS": "[RFC1034]Mockapetris，P.，“域名-概念和设施”，STD 13，RFC 1034，DOI 10.17487/RFC1034，1987年11月<http://www.rfc-editor.org/info/rfc1034>."
    },
    {
      "indent": 3,
      "text": "[RFC3315] Droms, R., Ed., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, DOI 10.17487/RFC3315, July 2003, <http://www.rfc-editor.org/info/rfc3315>.",
      "zh-CHS": "[RFC3315]Droms，R.，Ed.，Bound，J.，Volz，B.，Lemon，T.，Perkins，C.，和M.Carney，“IPv6的动态主机配置协议（DHCPv6）”，RFC 3315，DOI 10.17487/RFC3315，2003年7月<http://www.rfc-editor.org/info/rfc3315>."
    },
    {
      "indent": 3,
      "text": "[RFC3736] Droms, R., \"Stateless Dynamic Host Configuration Protocol (DHCP) Service for IPv6\", RFC 3736, DOI 10.17487/RFC3736, April 2004, <http://www.rfc-editor.org/info/rfc3736>.",
      "zh-CHS": "[RFC3736]Droms，R.，“IPv6的无状态动态主机配置协议（DHCP）服务”，RFC 3736，DOI 10.17487/RFC3736，2004年4月<http://www.rfc-editor.org/info/rfc3736>."
    },
    {
      "indent": 3,
      "text": "[RFC3646] Droms, R., Ed., \"DNS Configuration options for Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3646, DOI 10.17487/RFC3646, December 2003, <http://www.rfc-editor.org/info/rfc3646>.",
      "zh-CHS": "[RFC3646]Droms，R.，Ed.“IPv6动态主机配置协议（DHCPv6）的DNS配置选项”，RFC 3646，DOI 10.17487/RFC3646，2003年12月<http://www.rfc-editor.org/info/rfc3646>."
    },
    {
      "indent": 3,
      "text": "[RFC6106] Jeong, J., Park, S., Beloeil, L., and S. Madanapalli, \"IPv6 Router Advertisement Options for DNS Configuration\", RFC 6106, DOI 10.17487/RFC6106, November 2010, <http://www.rfc-editor.org/info/rfc6106>.",
      "zh-CHS": "[RFC6106]Jeong，J.，Park，S.，Beloeil，L.，和S.Madanapalli，“DNS配置的IPv6路由器广告选项”，RFC 6106，DOI 10.17487/RFC6106，2010年11月<http://www.rfc-editor.org/info/rfc6106>."
    },
    {
      "indent": 3,
      "text": "[RFC4339] Jeong, J., Ed., \"IPv6 Host Configuration of DNS Server Information Approaches\", RFC 4339, DOI 10.17487/RFC4339, February 2006, <http://www.rfc-editor.org/info/rfc4339>.",
      "zh-CHS": "[RFC4339]Jeong，J.，Ed.，“DNS服务器信息方法的IPv6主机配置”，RFC 4339，DOI 10.17487/RFC4339，2006年2月<http://www.rfc-editor.org/info/rfc4339>."
    },
    {
      "indent": 3,
      "text": "[RFC3971] Arkko, J., Ed., Kempf, J., Zill, B., and P. Nikander, \"SEcure Neighbor Discovery (SEND)\", RFC 3971, DOI 10.17487/RFC3971, March 2005, <http://www.rfc-editor.org/info/rfc3971>.",
      "zh-CHS": "[RFC3971]Arkko，J.，Ed.，Kempf，J.，Zill，B.，和P.Nikander，“安全邻居发现（SEND）”，RFC 3971，DOI 10.17487/RFC3971，2005年3月<http://www.rfc-editor.org/info/rfc3971>."
    },
    {
      "indent": 3,
      "text": "[RFC3118] Droms, R., Ed., and W. Arbaugh, Ed., \"Authentication for DHCP Messages\", RFC 3118, DOI 10.17487/RFC3118, June 2001, <http://www.rfc-editor.org/info/rfc3118>.",
      "zh-CHS": "[RFC3118]Droms，R.，Ed.，和W.Arbaugh，Ed.，“DHCP消息的身份验证”，RFC 3118，DOI 10.17487/RFC3118，2001年6月<http://www.rfc-editor.org/info/rfc3118>."
    },
    {
      "indent": 3,
      "text": "[RFC6104] Chown, T. and S. Venaas, \"Rogue IPv6 Router Advertisement Problem Statement\", RFC 6104, DOI 10.17487/RFC6104, February 2011, <http://www.rfc-editor.org/info/rfc6104>.",
      "zh-CHS": "[RFC6104]Chown，T.和S.Venaas，“流氓IPv6路由器广告问题声明”，RFC 6104，DOI 10.17487/RFC6104，2011年2月<http://www.rfc-editor.org/info/rfc6104>."
    },
    {
      "indent": 3,
      "text": "[RFC6105] Levy-Abegnoli, E., Van de Velde, G., Popoviciu, C., and J. Mohacsi, \"IPv6 Router Advertisement Guard\", RFC 6105, DOI 10.17487/RFC6105, February 2011, <http://www.rfc-editor.org/info/rfc6105>.",
      "zh-CHS": "[RFC6105]Levy Abegnoli，E.，Van de Velde，G.，Popoviciu，C.，和J.Mohacsi，“IPv6路由器广告保护”，RFC 6105DOI 10.17487/RFC6105，2011年2月<http://www.rfc-editor.org/info/rfc6105>."
    },
    {
      "indent": 3,
      "text": "[RFC7610] Gont, F., Liu, W., and G. Van de Velde, \"DHCPv6-Shield: Protecting against Rogue DHCPv6 Servers\", BCP 199, RFC 7610, DOI 10.17487/RFC7610, August 2015, <http://www.rfc-editor.org/info/rfc7610>.",
      "zh-CHS": "[RFC7610]Gont，F.，Liu，W.，和G.Van de Velde，“DHCPv6防护：防范恶意DHCPv6服务器”，BCP 199，RFC 7610，DOI 10.17487/RFC7610，2015年8月<http://www.rfc-editor.org/info/rfc7610>."
    },
    {
      "indent": 3,
      "text": "[RFC1535] Gavron, E., \"A Security Problem and Proposed Correction With Widely Deployed DNS Software\", RFC 1535, DOI 10.17487/RFC1535, October 1993, <http://www.rfc-editor.org/info/rfc1535>.",
      "zh-CHS": "[RFC1535]Gavron，E.，“广泛部署DNS软件的安全问题和建议的纠正”，RFC 1535，DOI 10.17487/RFC1535，1993年10月<http://www.rfc-editor.org/info/rfc1535>."
    },
    {
      "indent": 3,
      "text": "[RFC1536] Kumar, A., Postel, J., Neuman, C., Danzig, P., and S. Miller, \"Common DNS Implementation Errors and Suggested Fixes\", RFC 1536, DOI 10.17487/RFC1536, October 1993, <http://www.rfc-editor.org/info/rfc1536>.",
      "zh-CHS": "[RFC1536]Kumar，A.，Postel，J.，Neuman，C.，Danzig，P.，和S.Miller，“常见DNS实现错误和建议修复”，RFC 1536，DOI 10.17487/RFC1536，1993年10月<http://www.rfc-editor.org/info/rfc1536>."
    },
    {
      "indent": 3,
      "text": "[DHCPv6-SLAAC] Liu, B., Jiang, S., Gong, X., Wang, W., and E. Rey, \"DHCPv6/SLAAC Interaction Problems on Address and DNS Configuration\", Work in Progress, draft-ietf-v6ops-dhcpv6-slaac-problem-07, August 2016.",
      "zh-CHS": "[DHCPv6 SLAAC]Liu，B.，Jiang，S.，Gong，X.，Wang，W.，和E.Rey，“地址和DNS配置方面的DHCPv6/SLAAC交互问题”，正在进行的工作，草稿-ietf-v6ops-DHCPv6-SLAAC-problem-072016年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6418] Blanchet, M. and P. Seite, \"Multiple Interfaces and Provisioning Domains Problem Statement\", RFC 6418, DOI 10.17487/RFC6418, November 2011, <http://www.rfc-editor.org/info/rfc6418>.",
      "zh-CHS": "[RFC6418]Blanchet，M.和P.Seite，“多接口和供应域问题声明”，RFC 6418，DOI 10.17487/RFC6418，2011年11月<http://www.rfc-editor.org/info/rfc6418>."
    },
    {
      "indent": 3,
      "text": "[RFC6419] Wasserman, M. and P. Seite, \"Current Practices for Multiple-Interface Hosts\", RFC 6419, DOI 10.17487/RFC6419, November 2011, <http://www.rfc-editor.org/info/rfc6419>.",
      "zh-CHS": "[RFC6419]Wasserman，M.和P.Seite，“多接口主机的当前实践”，RFC 6419，DOI 10.17487/RFC6419，2011年11月<http://www.rfc-editor.org/info/rfc6419>."
    },
    {
      "indent": 3,
      "text": "[RFC6731] Savolainen, T., Kato, J., and T. Lemon, \"Improved Recursive DNS Server Selection for Multi-Interfaced Nodes\", RFC 6731, DOI 10.17487/RFC6731, December 2012, <http://www.rfc-editor.org/info/rfc6731>.",
      "zh-CHS": "[RFC6731]Savolainen，T.，Kato，J.，和T.Lemon，“多接口节点的改进递归DNS服务器选择”，RFC 6731，DOI 10.17487/RFC6731，2012年12月<http://www.rfc-editor.org/info/rfc6731>."
    },
    {
      "indent": 3,
      "text": "[ICMPv6] IANA, \"Internet Control Message Protocol version 6 (ICMPv6) Parameters\", <http://www.iana.org/assignments/icmpv6-parameters/>.",
      "zh-CHS": "[ICMPv6]IANA，“互联网控制消息协议版本6（ICMPv6）参数”<http://www.iana.org/assignments/icmpv6-parameters/>."
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes from RFC 6106",
      "section_title": true,
      "zh-CHS": "附录A.RFC 6106的变更"
    },
    {
      "indent": 3,
      "text": "The following changes were made from RFC 6106 (\"IPv6 Router Advertisement Options for DNS Configuration\"):",
      "zh-CHS": "对RFC 6106（“DNS配置的IPv6路由器播发选项”）进行了以下更改："
    },
    {
      "indent": 3,
      "text": "o This document allows a higher default value of the lifetime of the DNS RA options than RFC 6106 in order to avoid the frequent expiry of the options on links with a relatively high rate of packet loss; at the same time, this document also makes additional clarifications. The lifetime's lower bound of 2 * MaxRtrAdvInterval was shown to lead to the expiry of these options on links with a relatively high rate of packet loss. To avoid this problem, this revision relaxes the lower bound and sets a higher default value of 3 * MaxRtrAdvInterval.",
      "zh-CHS": "o 本文件允许DNS RA选项的生存期的默认值高于RFC 6106，以避免在具有相对较高丢包率的链路上选项频繁失效；同时，本文件还作了补充澄清。寿命下限2*MaxRtrAdvInterval被证明会导致这些选项在数据包丢失率相对较高的链路上过期。为了避免此问题，此修订版放宽了下限，并设置了更高的默认值3*MaxRtrAdvInterval。"
    },
    {
      "indent": 3,
      "text": "o The text regarding the generation of a Router Solicitation message to ensure that the RDNSS information is fresh before the expiry of the RDNSS option is removed in order to prevent multicast traffic on the link from increasing.",
      "zh-CHS": "o 有关生成路由器请求消息的文本，以确保RDNSS信息在RDNSS选项到期之前是新鲜的，从而防止链路上的多播通信量增加。"
    },
    {
      "indent": 3,
      "text": "o The addresses for RDNSSes in the RDNSS option can be not only global addresses but also link-local addresses. The link-local addresses for RDNSSes should be registered in the Resolver Repository along with the corresponding link zone indices.",
      "zh-CHS": "o RDNSS选项中的RDNSS地址不仅可以是全局地址，还可以是链接本地地址。RDNSS的链接本地地址应与相应的链接区域索引一起注册到解析器存储库中。"
    },
    {
      "indent": 3,
      "text": "o RFC 6106 recommended that the number of RDNSS addresses that should be learned and maintained through the RDNSS RA option should be limited to three. This document removes that recommendation; thus, the number of RDNSS addresses to maintain is determined by an implementer's local policy.",
      "zh-CHS": "o RFC 6106建议通过RDNSS RA选项学习和维护的RDNSS地址数量应限制为三个。本文件删除了该建议；因此，要维护的RDNS地址数由实施者的本地策略决定。"
    },
    {
      "indent": 3,
      "text": "o RFC 6106 recommended that the number of DNS search domains that should be learned and maintained through the DNSSL RA option should be limited to three. This document removes that recommendation; thus, when the set of unique DNSSL values are not equivalent, none of them may be ignored for hostname lookups according to an implementer's local policy.",
      "zh-CHS": "o RFC 6106建议通过DNSSL RA选项学习和维护的DNS搜索域数量应限制为三个。本文件删除了该建议；因此，当一组唯一的DNSSL值不相等时，根据实现者的本地策略，在主机名查找时不能忽略其中任何一个值。"
    },
    {
      "indent": 3,
      "text": "o The guidance of the specific implementation for the synchronization of the DNS Repository and Resolver Repository in the kernel space and user space is removed.",
      "zh-CHS": "o 删除了内核空间和用户空间中DNS存储库和解析器存储库同步的具体实现指南。"
    },
    {
      "indent": 3,
      "text": "o The key words \"SHOULD\" and \"RECOMMENDED\" (RFC 2119) are removed in the recommendation of using SEND as a security mechanism for ND. Instead of using these key words, SEND is specified as only a possible security mechanism for ND.",
      "zh-CHS": "o 在使用发送作为ND安全机制的建议中，删除了关键字“应该”和“建议”（RFC 2119）。不使用这些关键字，而是将SEND指定为ND的唯一可能的安全机制。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "This document has greatly benefited from inputs by Robert Hinden, Pekka Savola, Iljitsch van Beijnum, Brian Haberman, Tim Chown, Erik Nordmark, Dan Wing, Jari Arkko, Ben Campbell, Vincent Roca, Tony Cheneau, Fernando Gont, Jen Linkova, Ole Troan, Mark Smith, Tatuya Jinmei, Lorenzo Colitti, Tore Anderson, David Farmer, Bing Liu, and Tassos Chatzithomaoglou. The authors sincerely appreciate their contributions.",
      "zh-CHS": "本文件得益于罗伯特·欣登、佩卡·萨沃拉、伊尔吉奇·范·贝伊南、布赖恩·哈伯曼、蒂姆·乔恩、埃里克·诺德马克、丹·温、贾里·阿尔科、本·坎贝尔、文森特·罗卡、托尼·切诺、费尔南多·冈特、延林科娃、奥勒·特罗安、马克·史密斯、塔图亚·金美、洛伦佐·科利蒂、托尔·安德森、大卫·法默、刘冰、，还有塔索斯·查齐托马格鲁。作者衷心感谢他们的贡献。"
    },
    {
      "indent": 3,
      "text": "This document was supported by an Institute for Information & communications Technology Promotion (IITP) grant funded by the Korean government (MSIP) [10041244, Smart TV 2.0 Software Platform].",
      "zh-CHS": "本文件得到韩国政府（MSIP）资助的信息与通信技术促进研究所（IITP）的资助[10041244，智能电视2.0软件平台]。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Jaehoon Paul Jeong Department of Software Sungkyunkwan University 2066 Seobu-Ro, Jangan-Gu Suwon, Gyeonggi-Do 16419 Republic of Korea",
      "zh-CHS": "韩国京畿道江根古水原，成均馆大学软件系2066 Seobu Ro，邮编：16419"
    },
    {
      "indent": 3,
      "text": "Phone: +82 31 299 4957\nFax:   +82 31 290 7996\nEmail: pauljeong@skku.edu\nURI:   http://iotlab.skku.edu/people-jaehoon-jeong.php",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Soohong Daniel Park Software R&D Center Samsung Electronics Seoul R&D Campus D-Tower, 56, Seongchon-Gil, Seocho-Gu Seoul 06765 Republic of Korea",
      "zh-CHS": "Soohong Daniel Park软件研发中心三星电子首尔研发园区D-Tower，56，Seocho Gu首尔Seongchon Gil 06765"
    },
    {
      "indent": 3,
      "text": "Email: soohong.park@samsung.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Luc Beloeil Orange 5 rue Maurice Sibille BP 44211 44042 Nantes Cedex 1 France",
      "zh-CHS": "Luc Beloeil Orange 5 rue Maurice Sibille英国石油公司44211 44042法国南特塞德斯1号"
    },
    {
      "indent": 3,
      "text": "Phone: +33 2 28 56 11 84\nEmail: luc.beloeil@orange.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Syam Madanapalli NTT Data #H304, Shriram Samruddhi, Thubarahalli Bangalore 560066 India",
      "zh-CHS": "Syam Madanapalli NTT数据#H304，Shriram Samruddhi，Thubarahali Bangalore 560066印度"
    },
    {
      "indent": 3,
      "text": "Phone: +91 959 175 7926\nEmail: smadanapalli@gmail.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}