{
  "title": {
    "text": "RFC 8056: Extensible Provisioning Protocol (EPP) and Registration Data Access Protocol (RDAP) Status Mapping",
    "zh-CHS": "RFC 8056"
  },
  "number": 8056,
  "created_at": "2021-10-28 15:32:47.446572+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          J. Gould\nRequest for Comments: 8056                                VeriSign, Inc.\nCategory: Standards Track                                   January 2017\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": " Extensible Provisioning Protocol (EPP) and Registration Data Access Protocol (RDAP) Status Mapping",
      "zh-CHS": "可扩展资源调配协议（EPP）和注册数据访问协议（RDAP）状态映射"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the mapping of the Extensible Provisioning Protocol (EPP) statuses with the statuses registered for use in the Registration Data Access Protocol (RDAP). This document identifies gaps in the mapping, and registers RDAP statuses to fill those gaps to ensure that all of the EPP statuses specified in RFCs are supported in RDAP.",
      "zh-CHS": "本文档描述了可扩展资源调配协议（EPP）状态与注册数据访问协议（RDAP）中注册使用的状态之间的映射。本文档确定了映射中的差距，并注册RDAP状态以填补这些差距，以确保RFCs中指定的所有EPP状态在RDAP中得到支持。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8056.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8056."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Conventions Used in This Document . . . . . . . . . . . .   2\n2.  EPP-to-RDAP Status Mapping  . . . . . . . . . . . . . . . . .   2\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   6\n  3.1.  JSON Values Registry  . . . . . . . . . . . . . . . . . .   6\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .  10\n5.  Normative References  . . . . . . . . . . . . . . . . . . . .  10\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  11\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .  11",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document maps the statuses defined in the Extensible Provisioning Protocol (EPP) RFCs to the list of statuses registered for use in the Registration Data Access Protocol (RDAP), in the \"RDAP JSON Values\" registry [rdap-json-values].",
      "zh-CHS": "本文档将可扩展资源调配协议（EPP）RFC中定义的状态映射到“RDAP JSON值”注册表[RDAP JSON值]中注册用于注册数据访问协议（RDAP）的状态列表。"
    },
    {
      "indent": 3,
      "text": "The \"RDAP JSON Values\" registry is described in Section 10.2 of [RFC7483] and is available in the \"RDAP JSON Values\" registry [rdap-json-values].",
      "zh-CHS": "[RFC7483]第10.2节介绍了“RDAP JSON值”注册表，该注册表位于“RDAP JSON值”注册表[RDAP JSON值]中。"
    },
    {
      "indent": 3,
      "text": "The EPP statuses used as the source of the mapping include Section 2.3 of the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Section 2.3 of \"Extensible Provisioning Protocol (EPP) Host Mapping\" [RFC5732], Section 2.2 of \"Extensible Provisioning Protocol (EPP) Contact Mapping\" [RFC5733], and Section 3.1 of \"Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP)\" [RFC3915].",
      "zh-CHS": "用作映射源的EPP状态包括可扩展配置协议（EPP）域名映射[RFC5731]的第2.3节、“可扩展配置协议（EPP）主机映射”[RFC5732]的第2.3节、“可扩展配置协议（EPP）联系人映射”[RFC5733]的第2.2节以及“可扩展资源调配协议（EPP）的域注册表宽限期映射”[RFC3915]。"
    },
    {
      "indent": 3,
      "text": "Each EPP status MUST map to a single RDAP status to ensure that data in the Domain Name Registries (DNRs) that use EPP can be accurately presented in RDAP.",
      "zh-CHS": "每个EPP状态必须映射到单个RDAP状态，以确保使用EPP的域名注册中心（DNR）中的数据可以准确地显示在RDAP中。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. EPP-to-RDAP Status Mapping",
      "section_title": true,
      "zh-CHS": "2. EPP到RDAP状态映射"
    },
    {
      "indent": 3,
      "text": "Below is a list of EPP statuses from the EPP RFCs ([RFC5731], [RFC5732], [RFC5733], and [RFC3915]) mapped to the RDAP statuses registered in the \"RDAP JSON Values\" registry [rdap-json-values], with the format <EPP Status> '=' <RDAP Status>, where a blank <RDAP Status> indicates a gap in the mapping.",
      "zh-CHS": "以下是EPP RFC（[RFC5731]、[RFC5732]、[RFC5733]和[RFC3915]）中映射到“RDAP JSON Values”注册表[RDAP JSON Values]中注册的RDAP状态的EPP状态列表，格式为<EPP Status>“=”<RDAP Status>，其中空白的<RDAP Status>表示映射中存在间隙。"
    },
    {
      "indent": 6,
      "text": "addPeriod = autoRenewPeriod = clientDeleteProhibited = clientHold = clientRenewProhibited = clientTransferProhibited = clientUpdateProhibited = inactive = inactive linked = associated ok = active pendingCreate = pending create pendingDelete = pending delete pendingRenew = pending renew pendingRestore = pendingTransfer = pending transfer pendingUpdate = pending update redemptionPeriod = renewPeriod = serverDeleteProhibited = serverRenewProhibited = serverTransferProhibited = serverUpdateProhibited = serverHold = transferPeriod =",
      "zh-CHS": "addPeriod=autoRenewPeriod=clientDeleteProhibited=clientRenewProhibited=clientUpdateProhibited=inactive=inactive linked=associated ok=active pendingCreate=pendingDelete=pendingRenew=pendingRenew=pendingRestore=pendingTransfer=pendingTransfer=pendingTransferpendingUpdate=pending update redemptionPeriod=renewPeriod=ServerDeleteProbited=ServerRenewProbited=serverTransferProhibited=serverUpdateProhibited=serverHold=transferPeriod="
    },
    {
      "indent": 3,
      "text": "The \"RDAP JSON Values\" registry [rdap-json-values] does have a set of prohibited statuses including \"renew prohibited\", \"update prohibited\", \"transfer prohibited\", and \"delete prohibited\", but these statuses do not directly map to the EPP prohibited statuses. EPP provides status codes that allow distinguishing the case that an action is prohibited because of server policy from the case that an action is prohibited because of a client request. The ability to make this distinction needs to be preserved in RDAP.",
      "zh-CHS": "“RDAP JSON Values”注册表[RDAP JSON Values]有一组禁止状态，包括“禁止续订”、“禁止更新”、“禁止传输”和“禁止删除”，但这些状态不会直接映射到EPP禁止状态。EPP提供的状态代码允许区分由于服务器策略而禁止操作的情况和由于客户端请求而禁止操作的情况。需要在RDAP中保留进行这种区分的能力。"
    },
    {
      "indent": 3,
      "text": "Each of the EPP status values that don't map directly to an RDAP status value is described below. Each EPP status value includes a proposed new RDAP status value and a description of the value. The RDAP status value is derived from the EPP status value by converting the EPP \"camelCase\" representation to lowercase with a space character inserted between word boundaries.",
      "zh-CHS": "下面描述了每个不直接映射到RDAP状态值的EPP状态值。每个EPP状态值包括建议的新RDAP状态值和该值的说明。RDAP状态值是通过将EPP“camelCase”表示转换为小写，并在单词边界之间插入空格字符，从EPP状态值派生而来的。"
    },
    {
      "indent": 3,
      "text": "addPeriod = add period; This grace period is provided after the initial registration of the object. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the registration.",
      "zh-CHS": "addPeriod=添加期间；该宽限期在对象首次注册后提供。如果该对象在此期间被客户机删除，服务器将向客户机提供注册费用的贷项。"
    },
    {
      "indent": 3,
      "text": "autoRenewPeriod = auto renew period; This grace period is provided after an object registration period expires and is extended (renewed) automatically by the server. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the auto renewal.",
      "zh-CHS": "自动续费周期=自动续费周期；此宽限期在对象注册期到期后提供，并由服务器自动延长（续订）。如果该对象在此期间被客户机删除，则服务器会向客户机提供自动续订费用的贷项。"
    },
    {
      "indent": 3,
      "text": "clientDeleteProhibited = client delete prohibited; The client requested that requests to delete the object MUST be rejected.",
      "zh-CHS": "clientdeletecompended=客户端删除禁止；客户端请求必须拒绝删除对象的请求。"
    },
    {
      "indent": 3,
      "text": "clientHold = client hold; The client requested that the DNS delegation information MUST NOT be published for the object.",
      "zh-CHS": "clientHold=客户持有；客户端请求不得发布对象的DNS委派信息。"
    },
    {
      "indent": 3,
      "text": "clientRenewProhibited = client renew prohibited; The client requested that requests to renew the object MUST be rejected.",
      "zh-CHS": "ClientRenewProbled=禁止客户端续订；客户端请求必须拒绝续订对象的请求。"
    },
    {
      "indent": 3,
      "text": "clientTransferProhibited = client transfer prohibited; The client requested that requests to transfer the object MUST be rejected.",
      "zh-CHS": "ClientTransferProbited=禁止客户端传输；客户端请求必须拒绝传输对象的请求。"
    },
    {
      "indent": 3,
      "text": "clientUpdateProhibited = client update prohibited; The client requested that requests to update the object (other than to remove this status) MUST be rejected.",
      "zh-CHS": "clientUpdateProhibited=禁止客户端更新；客户端请求必须拒绝更新对象（而不是删除此状态）的请求。"
    },
    {
      "indent": 3,
      "text": "pendingRestore = pending restore; An object is in the process of being restored after being in the redemption period state.",
      "zh-CHS": "pendingRestore=挂起的恢复；对象处于赎回期状态后正在恢复。"
    },
    {
      "indent": 3,
      "text": "redemptionPeriod = redemption period; A delete has been received, but the object has not yet been purged because an opportunity exists to restore the object and abort the deletion process.",
      "zh-CHS": "赎回期=赎回期；已收到删除，但尚未清除该对象，因为存在还原该对象并中止删除过程的机会。"
    },
    {
      "indent": 3,
      "text": "renewPeriod = renew period; This grace period is provided after an object registration period is explicitly extended (renewed) by the client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the renewal.",
      "zh-CHS": "续订期=续订期；此宽限期是在客户端显式延长（续订）对象注册期之后提供的。如果客户机在此期间删除了该对象，则服务器将向客户机提供续订成本的贷项。"
    },
    {
      "indent": 3,
      "text": "serverDeleteProhibited = server delete prohibited; The server set the status so that requests to delete the object MUST be rejected.",
      "zh-CHS": "ServerDeleteProbited=服务器删除禁止；服务器设置状态，以便删除对象的请求必须被拒绝。"
    },
    {
      "indent": 3,
      "text": "serverRenewProhibited = server renew prohibited; The server set the status so that requests to renew the object MUST be rejected.",
      "zh-CHS": "ServerRenewProbled=禁止服务器续订；服务器设置状态，以便必须拒绝续订对象的请求。"
    },
    {
      "indent": 3,
      "text": "serverTransferProhibited = server transfer prohibited; The server set the status so that requests to transfer the object MUST be rejected.",
      "zh-CHS": "ServerTransferProbited=禁止服务器传输；服务器设置状态，以便传输对象的请求必须被拒绝。"
    },
    {
      "indent": 3,
      "text": "serverUpdateProhibited = server update prohibited; The server set the status so that requests to update the object (other than to remove this status) MUST be rejected. serverHold = server hold; The server set the status so that DNS delegation information MUST NOT be published for the object.",
      "zh-CHS": "serverUpdateProhibited=禁止服务器更新；服务器设置状态，以便必须拒绝更新对象（而不是删除此状态）的请求。服务器保持=服务器保持；服务器设置该状态，以便不发布对象的DNS委派信息。"
    },
    {
      "indent": 3,
      "text": "transferPeriod = transfer period; This grace period is provided after the successful transfer of object registration sponsorship from one client to another client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the transfer.",
      "zh-CHS": "转让期=转让期；该宽限期在对象注册赞助从一个客户成功转移到另一个客户后提供。如果该对象在此期间被客户机删除，则服务器将向客户机提供传输成本的贷项。"
    },
    {
      "indent": 3,
      "text": "The resulting mapping after registering the new RDAP statuses is:",
      "zh-CHS": "注册新RDAP状态后产生的映射为："
    },
    {
      "indent": 6,
      "text": "addPeriod = add period autoRenewPeriod = auto renew period clientDeleteProhibited = client delete prohibited clientHold = client hold clientRenewProhibited = client renew prohibited clientTransferProhibited = client transfer prohibited clientUpdateProhibited = client update prohibited inactive = inactive linked = associated ok = active pendingCreate = pending create pendingDelete = pending delete pendingRenew = pending renew pendingRestore = pending restore pendingTransfer = pending transfer pendingUpdate = pending update redemptionPeriod = redemption period renewPeriod = renew period serverDeleteProhibited = server delete prohibited serverRenewProhibited = server renew prohibited serverTransferProhibited = server transfer prohibited serverUpdateProhibited = server update prohibited serverHold = server hold transferPeriod = transfer period",
      "zh-CHS": "addPeriod=添加期间autoRenewPeriod=自动续订期间clientDeleteProhibited=客户端删除禁止的clientHold=客户端保留clientRenewProhibited=客户端续订禁止的clientTransferProhibited=客户端更新禁止的不活动=不活动链接=关联的确定=活动pendingCreate=挂起创建pendingDelete=挂起删除pendingRenew=挂起续订PendingStore=挂起还原pendingTransfer=挂起传输pendingUpdate=挂起更新赎回期=赎回期续订期=续订期服务器删除禁止=服务器删除禁止的服务器续订禁止=服务器续订禁止的服务器传输禁止的=服务器传输禁止的服务器更新禁止的=服务器更新禁止的服务器保持=服务器保持传输期间=传输期间"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 0,
      "text": "3.1. JSON Values Registry",
      "section_title": true,
      "zh-CHS": "3.1. JSON值注册表"
    },
    {
      "indent": 3,
      "text": "The following values have been registered by the IANA in the \"RDAP JSON Values\" registry described in [RFC7483]:",
      "zh-CHS": "IANA已在[RFC7483]中描述的“RDAP JSON值”注册表中注册了以下值："
    },
    {
      "indent": 6,
      "text": "Value: add period Type: status Description: This grace period is provided after the initial registration of the object. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the registration. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'addPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：添加期间类型：状态描述：此宽限期在对象初始注册后提供。如果该对象在此期间被客户机删除，服务器将向客户机提供注册费用的贷项。这将映射到可扩展配置协议（EPP）[RFC3915]“addPeriod”状态的域注册表宽限期映射。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: auto renew period Type: status Description: This grace period is provided after an object registration period expires and is extended (renewed) automatically by the server. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the auto renewal. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'autoRenewPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：自动续订期限类型：状态描述：此宽限期在对象注册期限到期后提供，并由服务器自动延长（续订）。如果该对象在此期间被客户机删除，则服务器会向客户机提供自动续订费用的贷项。这将映射到可扩展配置协议（EPP）[RFC3915]“autoRenewPeriod”状态的域注册表宽限期映射。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client delete prohibited Type: status Description: The client requested that requests to delete the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'clientDeleteProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：客户端删除禁止类型：状态描述：客户端请求删除对象的请求必须被拒绝。这映射到可扩展配置协议（EPP）域名映射[RFC5731]、可扩展配置协议（EPP）主机映射[RFC5732]和可扩展配置协议（EPP）联系人映射[RFC5733]“ClientDeleteProtocol禁止”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client hold Type: status Description: The client requested that the DNS delegation information MUST NOT be published for the object. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'clientHold' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：客户端保留类型：状态描述：客户端请求不得发布对象的DNS委派信息。这映射到可扩展配置协议（EPP）域名映射[RFC5731]“clientHold”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client renew prohibited Type: status Description: The client requested that requests to renew the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'clientRenewProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：客户端续订禁止类型：状态描述：客户端请求必须拒绝续订对象的请求。这映射到可扩展配置协议（EPP）域名映射[RFC5731]“ClientRenewProbled”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client transfer prohibited Type: status Description: The client requested that requests to transfer the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'clientTransferProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：客户端传输禁止类型：状态描述：客户端请求必须拒绝传输对象的请求。这映射到可扩展配置协议（EPP）域名映射[RFC5731]和可扩展配置协议（EPP）联系人映射[RFC5733]“ClientTransferProtocol禁止”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client update prohibited Type: status Description: The client requested that requests to update the object (other than to remove this status) MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'clientUpdateProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：客户端更新禁止类型：状态描述：客户端请求必须拒绝更新对象（而不是删除此状态）的请求。这映射到可扩展配置协议（EPP）域名映射[RFC5731]、可扩展配置协议（EPP）主机映射[RFC5732]和可扩展配置协议（EPP）联系人映射[RFC5733]“clientUpdateProhibited”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: pending restore Type: status Description: An object is in the process of being restored after being in the redemption period state. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'pendingRestore' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：挂起还原类型：状态描述：对象处于赎回期状态后正在还原。这将映射到可扩展配置协议（EPP）[RFC3915]“PendingerStore”状态的域注册表宽限期映射。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: redemption period Type: status Description: A delete has been received, but the object has not yet been purged because an opportunity exists to restore the object and abort the deletion process. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'redemptionPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：赎回期类型：状态描述：已收到删除，但对象尚未清除，因为存在恢复对象并中止删除过程的机会。这将映射到可扩展配置协议（EPP）[RFC3915]“redemptionPeriod”状态的域注册表宽限期映射。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: renew period Type: status Description: This grace period is provided after an object registration period is explicitly extended (renewed) by the client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the renewal. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'renewPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：续订期限类型：状态描述：此宽限期是在客户端显式延长（续订）对象注册期限之后提供的。如果客户机在此期间删除了该对象，则服务器将向客户机提供续订成本的贷项。这将映射到可扩展配置协议（EPP）[RFC3915]“续订期限”状态的域注册表宽限期映射。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server delete prohibited Type: status Description: The server set the status so that requests to delete the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'serverDeleteProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：服务器删除禁止类型：状态描述：服务器设置状态，以便删除对象的请求必须被拒绝。这映射到可扩展配置协议（EPP）域名映射[RFC5731]、可扩展配置协议（EPP）主机映射[RFC5732]和可扩展配置协议（EPP）联系人映射[RFC5733]“服务器删除禁止”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server renew prohibited Type: status Description: The server set the status so that requests to renew the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'serverRenewProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：服务器续订禁止类型：状态描述：服务器设置状态，以便必须拒绝续订对象的请求。这将映射到可扩展资源调配协议（EPP）域名映射[RFC5731]“ServerRenewProtocol”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server transfer prohibited Type: status Description: The server set the status so that requests to transfer the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'serverTransferProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：服务器传输禁止类型：状态描述：服务器设置状态，以便必须拒绝传输对象的请求。这映射到可扩展配置协议（EPP）域名映射[RFC5731]和可扩展配置协议（EPP）联系人映射[RFC5733]“服务器传输禁止”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server update prohibited Type: status Description: The server set the status so that requests to update the object (other than to remove this status) MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'serverUpdateProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：服务器更新禁止类型：状态描述：服务器设置状态，以便必须拒绝更新对象（而不是删除此状态）的请求。这映射到可扩展配置协议（EPP）域名映射[RFC5731]、可扩展配置协议（EPP）主机映射[RFC5732]和可扩展配置协议（EPP）联系人映射[RFC5733]“serverUpdateProhibited”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server hold Type: status Description: The server set the status so that DNS delegation information MUST NOT be published for the object. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'serverHold' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：服务器保留类型：状态描述：服务器设置状态，以便不发布对象的DNS委派信息。这映射到可扩展配置协议（EPP）域名映射[RFC5731]“服务器保持”状态。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: transfer period Type: status Description: This grace period is provided after the successful transfer of object registration sponsorship from one client to another client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the transfer. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'transferPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "zh-CHS": "值：转移期间类型：状态描述：此宽限期在对象注册赞助从一个客户端成功转移到另一个客户端后提供。如果该对象在此期间被客户机删除，则服务器将向客户机提供传输成本的贷项。这将映射到可扩展配置协议（EPP）[RFC3915]“transferPeriod”状态的域注册表宽限期映射。注册人姓名：IESG注册人联系信息：iesg@ietf.org"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The status values described in this document can be subject to server-side information disclosure policies that restrict display of the values to authorized clients. Implementers may wish to review [RFC7481] for a description of the RDAP security services that can be used to implement information disclosure policies.",
      "zh-CHS": "本文档中描述的状态值可能受服务器端信息披露策略的约束，该策略限制向授权客户端显示这些值。实施者可能希望查看[RFC7481]以了解可用于实施信息披露策略的RDAP安全服务的描述。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "zh-CHS": "5. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[rdap-json-values] IANA, \"RDAP JSON Values\", <https://www.iana.org/assignments/rdap-json-values/>.",
      "zh-CHS": "[rdap json值]IANA，“rdap json值”<https://www.iana.org/assignments/rdap-json-values/>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC3915] Hollenbeck, S., \"Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP)\", RFC 3915, DOI 10.17487/RFC3915, September 2004, <http://www.rfc-editor.org/info/rfc3915>.",
      "zh-CHS": "[RFC3915]Hollenbeck，S.，“可扩展资源调配协议（EPP）的域注册表宽限期映射”，RFC 3915，DOI 10.17487/RFC3915，2004年9月<http://www.rfc-editor.org/info/rfc3915>."
    },
    {
      "indent": 3,
      "text": "[RFC5731] Hollenbeck, S., \"Extensible Provisioning Protocol (EPP) Domain Name Mapping\", STD 69, RFC 5731, DOI 10.17487/RFC5731, August 2009, <http://www.rfc-editor.org/info/rfc5731>.",
      "zh-CHS": "[RFC5731]Hollenbeck，S.，“可扩展资源调配协议（EPP）域名映射”，STD 69，RFC 5731，DOI 10.17487/RFC5731，2009年8月<http://www.rfc-editor.org/info/rfc5731>."
    },
    {
      "indent": 3,
      "text": "[RFC5732] Hollenbeck, S., \"Extensible Provisioning Protocol (EPP) Host Mapping\", STD 69, RFC 5732, DOI 10.17487/RFC5732, August 2009, <http://www.rfc-editor.org/info/rfc5732>.",
      "zh-CHS": "[RFC5732]Hollenbeck，S.，“可扩展资源调配协议（EPP）主机映射”，STD 69，RFC 5732，DOI 10.17487/RFC5732，2009年8月<http://www.rfc-editor.org/info/rfc5732>."
    },
    {
      "indent": 3,
      "text": "[RFC5733] Hollenbeck, S., \"Extensible Provisioning Protocol (EPP) Contact Mapping\", STD 69, RFC 5733, DOI 10.17487/RFC5733, August 2009, <http://www.rfc-editor.org/info/rfc5733>.",
      "zh-CHS": "[RFC5733]Hollenbeck，S.，“可扩展供应协议（EPP）联系人映射”，STD 69，RFC 5733，DOI 10.17487/RFC5733，2009年8月<http://www.rfc-editor.org/info/rfc5733>."
    },
    {
      "indent": 3,
      "text": "[RFC7481] Hollenbeck, S. and N. Kong, \"Security Services for the Registration Data Access Protocol (RDAP)\", RFC 7481, DOI 10.17487/RFC7481, March 2015, <http://www.rfc-editor.org/info/rfc7481>.",
      "zh-CHS": "[RFC7481]Hollenbeck，S.和N.Kong，“注册数据访问协议（RDAP）的安全服务”，RFC 7481，DOI 10.17487/RFC7481，2015年3月<http://www.rfc-editor.org/info/rfc7481>."
    },
    {
      "indent": 3,
      "text": "[RFC7483] Newton, A. and S. Hollenbeck, \"JSON Responses for the Registration Data Access Protocol (RDAP)\", RFC 7483, DOI 10.17487/RFC7483, March 2015, <http://www.rfc-editor.org/info/rfc7483>.",
      "zh-CHS": "[RFC7483]Newton，A.和S.Hollenbeck，“注册数据访问协议（RDAP）的JSON响应”，RFC 7483，DOI 10.17487/RFC7483，2015年3月<http://www.rfc-editor.org/info/rfc7483>."
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "Suggestions that have been incorporated into this document were provided by Andrew Newton, Scott Hollenbeck, Jim Galvin, Gustavo Lozano, and Robert Sparks.",
      "zh-CHS": "安德鲁·牛顿、斯科特·霍伦贝克、吉姆·加尔文、古斯塔沃·洛扎诺和罗伯特·斯帕克斯提供了纳入本文件的建议。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "James Gould VeriSign, Inc. 12061 Bluemont Way Reston, VA 20190 United States of America",
      "zh-CHS": "James Gould VeriSign，Inc.美国弗吉尼亚州布鲁蒙特路莱斯顿12061号，邮编：20190"
    },
    {
      "indent": 3,
      "text": "Email: jgould@verisign.com\nURI:   http://www.verisign.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}