{
  "title": {
    "text": "RFC 8153: Digital Preservation Considerations for the RFC Series",
    "zh-CHS": "RFC 8153"
  },
  "number": 8153,
  "created_at": "2021-10-28 22:12:41.328201+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                            H. Flanagan\nRequest for Comments: 8153                                    RFC Editor\nCategory: Informational                                       April 2017\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Digital Preservation Considerations for the RFC Series",
      "zh-CHS": "RFC系列的数字保存注意事项"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The RFC Editor is both the publisher and the archivist for the RFC Series. This document applies specifically to the archivist role of the RFC Editor. It provides guidance on when and how to preserve RFCs and describes the tools required to view or re-create RFCs as necessary. This document also highlights gaps in the current process and suggests compromises to balance cost with best practice.",
      "zh-CHS": "RFC编辑既是RFC系列的出版者也是档案管理员。本文件特别适用于RFC编辑的档案管理员角色。它提供了关于何时以及如何保存RFC的指导，并描述了必要时查看或重新创建RFC所需的工具。本文件还强调了当前流程中的差距，并提出了平衡成本与最佳实践的折衷方案。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。它代表了互联网体系结构委员会（IAB）的共识。IAB批准发布的文件不适用于任何级别的互联网标准；见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8153.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8153."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Terminology ................................................4\n   1.2. Life Cycle of Digital Preservation .........................4\n2. Updating Policy and Procedure ...................................5\n   2.1. Acquisition of Documents ...................................6\n   2.2. Ingestion of Documents .....................................6\n   2.3. Metadata and Document Registration .........................7\n   2.4. Normalization and Standardization of Canonical File\n        Structure and Format .......................................9\n        2.4.1. 'Best Effort' Data Retention .......................10\n        2.4.2. Single Format for Archival Purposes ................11\n        2.4.3. Holistic Archiving of the Computing Environment ....12\n   2.5. Transformation/Migration to Current Publication Formats ...12\n   2.6. System Parameters .........................................13\n   2.7. Financial Impact ..........................................13\n3. Recommendations ................................................14\n4. Summary ........................................................15\n5. IANA Considerations ............................................15\n6. Security Considerations ........................................15\n7. Informative References .........................................16\nIAB Members at the Time of Approval ...............................18\nAuthor's Address ..................................................18",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The RFC Editor is both the publisher and the archivist for the RFC Series, a series of technical specifications and policy documents that includes foundational Internet standards [RFC6635] [RFC-SERIES]. The goal of the RFC Editor is to is to produce clear, consistent, and readable documents for the Internet community. Over time, the RFC Editor will use as many modern features, such as hyperlinks and content markup, within the document as necessary to convey the information the authors intended for their audience. As the archivist, however, the main goal is to preserve both the information described and the documents themselves for the indefinite future. To meet both of these goals, the RFC Editor must find the necessary balance between the publication needs of today and the archival needs of tomorrow, while acknowledging a finite set of resources to complete both aspects of the RFC Editor function.",
      "zh-CHS": "RFC编辑器是RFC系列的出版者和档案管理员，RFC系列是一系列技术规范和政策文件，包括基础互联网标准[RFC6635][RFC-Series]。RFC编辑器的目标是为互联网社区生成清晰、一致和可读的文档。随着时间的推移，RFC编辑器将根据需要在文档中使用尽可能多的现代功能，如超链接和内容标记，以传达作者为读者准备的信息。然而，作为档案管理员，主要目标是保存所描述的信息和文档本身，以供将来无限期使用。为了实现这两个目标，RFC编辑器必须在今天的出版需求和明天的存档需求之间找到必要的平衡，同时承认有限的资源集可以完成RFC编辑器功能的两个方面。"
    },
    {
      "indent": 3,
      "text": "While many files are created during the editing process, this document focuses on the archival needs of the Internet-Drafts (I-Ds) that were approved for publication and the RFCs that resulted from these I-Ds; I-Ds before they are approved for publication by the appropriate stream-approving body are out of scope.",
      "zh-CHS": "虽然许多文件是在编辑过程中创建的，但本文件重点关注已批准发布的互联网草案（I-D）和这些I-D产生的RFC的档案需求；未经相关流审批机构批准发布的I-D超出范围。"
    },
    {
      "indent": 3,
      "text": "To summarize, the key areas of tension between the roles of publisher and archivist are:",
      "zh-CHS": "总而言之，出版商和档案管理员角色之间存在紧张关系的关键领域是："
    },
    {
      "indent": 3,
      "text": "o the desire of the publisher to meet the needs expressed by authors who want to use the latest technology (e.g., vector graphics, live links, and a rich set of metadata) within their documents; and",
      "zh-CHS": "o 出版商希望满足希望在其文档中使用最新技术（如矢量图形、实时链接和丰富的元数据集）的作者表达的需求；和"
    },
    {
      "indent": 3,
      "text": "o the desire of the archivist to support only the simplest format for documents possible -- currently held by the Series to be plain-text, ASCII-only documents -- so that the tools needed to view the documents are equally simple and resistant to changes in technology, resulting in a set of documents that will be easier to archive for at least the next several decades, if not centuries.",
      "zh-CHS": "o 档案管理员希望只支持最简单的文档格式——目前该系列将其保留为纯文本、仅ASCII文档——以便查看文档所需的工具同样简单，并且能够抵抗技术的变化，最终形成一套文档，这些文档至少在未来几十年（如果不是几百年的话）更容易归档。"
    },
    {
      "indent": 3,
      "text": "Through most of the history of the RFC Series, the file format for RFCs has been plain text with an ASCII-only character set. This choice offered the simplest format likely to remain available to the largest number of consumers and the format most likely to be resistant to changes in technology over time. Increasingly, however, consumers and authors are requesting additional features that would allow for easy reading on a wider array of devices while retaining all the metadata authors intended in their documents. In 2013, RFC 6949 (\"RFC Series Format Requirements and Future Development\") captured the high-level requirements for the Series; the fundamental issue was that plain-text, ASCII-only documents no longer meet the needs of the communities interested in using and producing RFCs [RFC6949].",
      "zh-CHS": "在RFC系列的大部分历史中，RFC的文件格式都是纯文本，只有ASCII字符集。这一选择提供了最简单的格式，最有可能为最多的消费者提供，并且最有可能抵抗随着时间的推移技术的变化。然而，消费者和作者越来越多地要求提供额外的功能，以便在更广泛的设备上轻松阅读，同时保留作者在文档中想要的所有元数据。2013年，RFC 6949（“RFC系列格式要求和未来发展”）捕获了该系列的高级要求；基本问题是纯文本、仅ASCII文件不再满足对使用和生成RFC感兴趣的社区的需求[RFC6949]。"
    },
    {
      "indent": 3,
      "text": "The assertion that plain-text, ASCII-only documents no longer meet the needs of the community suggests that the simple archival process maintained by the RFC Editor is also no longer sufficient. More complex tools and file formats require a more complex process to ensure that RFCs can be read and rendered far into the future. This document describes the considerations that must inform any changes in policy and procedure, and it describes a model for the RFC Series to follow when additional formats beyond plain-text, ASCII-only RFCs are published. The functional model that provides the framework for the archival process described in this document was derived from the ISO Open Archival Information System (OAIS) reference model, defined in \"Space data and information transfer systems -- Open archival information system (OAIS) -- Reference model\" [ISO14721].",
      "zh-CHS": "纯文本、仅ASCII文档不再满足社区需求的说法表明，RFC编辑器维护的简单归档过程也不再足够。更复杂的工具和文件格式需要一个更复杂的过程，以确保RFC可以在遥远的将来读取和呈现。本文档描述了必须通知策略和程序中任何更改的注意事项，并描述了在发布纯文本、仅ASCII格式的RFC以外的其他格式时RFC系列要遵循的模型。本文件中描述的为归档过程提供框架的功能模型源自ISO开放归档信息系统（OAIS）参考模型，定义见“空间数据和信息传输系统——开放归档信息系统（OAIS）——参考模型”[ISO14721]。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "zh-CHS": "1.1. 术语"
    },
    {
      "indent": 3,
      "text": "Acquisition: The point at which a document is accepted by the RFC Editor for future inclusion into the archive.",
      "zh-CHS": "获取：RFC编辑器接受文档以供将来包含到存档中的点。"
    },
    {
      "indent": 3,
      "text": "Ingestion: The point at which a digital object is assigned all necessary metadata to describe the object and its contents and is added to the archive.",
      "zh-CHS": "摄取：为数字对象分配所有必要元数据以描述对象及其内容并添加到存档的点。"
    },
    {
      "indent": 3,
      "text": "Bitstream preservation: The process of storing and maintaining digital objects over time, ensuring that there is no loss or corruption of the bits making up those objects.",
      "zh-CHS": "位流保存：一段时间内存储和维护数字对象的过程，确保构成这些对象的位不会丢失或损坏。"
    },
    {
      "indent": 3,
      "text": "Content preservation: The retention of the ability to read, listen, or watch a digital file in perpetuity. Content preservation is not about the bits being stored; it is about being able to access and present those bits to the user.",
      "zh-CHS": "内容保存：永久保留读取、侦听或观看数字文件的能力。内容保存与存储的位无关；它是关于能够访问这些位并将其呈现给用户。"
    },
    {
      "indent": 0,
      "text": "1.2. Life Cycle of Digital Preservation",
      "section_title": true,
      "zh-CHS": "1.2. 数字保存的生命周期"
    },
    {
      "indent": 3,
      "text": "The basic process for preserving digital information has been described by a variety of organizations. From the Life cycle Information For E-Literature (LIFE) project [LIFE] in the United Kingdom to the ongoing digital preservation work in the U.S. Library of Congress [USLOC], the basic digital preservation process is straightforward. Documents are acquired and processed, metadata is recorded, physical media is refreshed, and content is regularly checked to see if it is still accessible by interested parties. Complexities arise when one considers the need to preserve both the bits of the digital objects themselves and the tools with which to express those bits in an environment that experiences rapid changes in technology.",
      "zh-CHS": "各种组织都描述了保存数字信息的基本过程。从英国的电子文献生命周期信息（Life）项目[Life]到美国国会图书馆[USLOC]正在进行的数字保存工作，基本的数字保存过程非常简单。获取和处理文档，记录元数据，刷新物理媒体，并定期检查内容，以确定相关方是否仍然可以访问。当人们考虑到需要保留数字对象本身的比特以及在经历技术快速变化的环境中表达这些比特的工具时，就会出现复杂性。"
    },
    {
      "indent": 3,
      "text": "For most of the existence of the RFC Series, the digital preservation process has been fairly simple, focusing on bitstream preservation and relying on paper copies of digital files.",
      "zh-CHS": "对于大多数现有的RFC系列，数字保存过程相当简单，重点是位流保存，并依赖于数字文件的纸质副本。"
    },
    {
      "indent": 3,
      "text": "The current archival process for the RFC Series is as follows:",
      "zh-CHS": "RFC系列的当前存档过程如下："
    },
    {
      "indent": 3,
      "text": "1. Acquisition: The RFC Editor database is updated to indicate an I-D has been approved for publication. At this point, the document is taken through the editorial process on the way to publication [RFC-PUB].",
      "zh-CHS": "1. 采集：更新RFC编辑器数据库，以表明已批准发布I-D。此时，文档将在发布[RFC-PUB]的过程中经过编辑过程。"
    },
    {
      "indent": 3,
      "text": "2. Ingestion: The RFC is added to the archive at the time of publication.",
      "zh-CHS": "2. 摄取：RFC在发布时添加到存档中。"
    },
    {
      "indent": 3,
      "text": "3. Metadata creation: The details regarding an RFC, including RFC number, author, title, abstract, etc., are created at time of publication. Additional metadata in the form of status and errata can be added or changed at any time, following the process of the originating document stream.",
      "zh-CHS": "3. 元数据创建：关于RFC的详细信息，包括RFC编号、作者、标题、摘要等，在发布时创建。在原始文档流处理之后，可以随时添加或更改状态和勘误表形式的附加元数据。"
    },
    {
      "indent": 3,
      "text": "4. Bitstream preservation: This part of the process is handled as part of the IT system administration; all servers, disks, and backup technology are refreshed on a regular cycle.",
      "zh-CHS": "4. 比特流保存：这部分过程作为IT系统管理的一部分进行处理；所有服务器、磁盘和备份技术都会定期刷新。"
    },
    {
      "indent": 3,
      "text": "5. Content preservation: All RFCs since January 2010 have been printed out on standard office paper at time of publication, and the electronic files have been preserved on disk and in backups with no particular focus on preserving the entire computing environment used to create the electronic documents. Most RFCs prior to January 2010 are also available on paper, but there are gaps in the record and issues of ownership around the paper copies before that date.",
      "zh-CHS": "5. 内容保存：自2010年1月以来，所有RFC在发布时都已打印在标准办公纸上，电子文件已保存在磁盘和备份中，没有特别注重保存用于创建电子文档的整个计算环境。2010年1月之前的大多数RFC也可以纸质形式获得，但在该日期之前的纸质副本的记录和所有权问题上存在差距。"
    },
    {
      "indent": 3,
      "text": "When the format for RFCs transitions from plain-text, ASCII-only files to an XML format with multiple outputs, the overall archival process will become more complex. Additional metadata and some (or possibly all) of the computing environment may need to be added to the archive.",
      "zh-CHS": "当RFC的格式从纯文本、仅ASCII文件转换为具有多个输出的XML格式时，整个归档过程将变得更加复杂。可能需要将其他元数据和部分（或可能全部）计算环境添加到存档中。"
    },
    {
      "indent": 0,
      "text": "2. Updating Policy and Procedure",
      "section_title": true,
      "zh-CHS": "2. 更新政策和程序"
    },
    {
      "indent": 3,
      "text": "RFCs are created and published as digital objects. Unlike paper-based publications, a digital collection requires a focus on retaining the details of the technology as well as retaining the object itself. Specifically, a digital archive needs to:",
      "zh-CHS": "RFC作为数字对象创建和发布。与纸质出版物不同的是，数字收藏不仅需要保留实物本身，还需要重点保留技术细节。具体而言，数字存档需要："
    },
    {
      "indent": 3,
      "text": "o consider the inherent instability of digital media,",
      "zh-CHS": "o 考虑数字媒体固有的不稳定性，"
    },
    {
      "indent": 3,
      "text": "o plan for a relatively short path to technological obsolescence,",
      "zh-CHS": "o 规划相对较短的技术过时路径，"
    },
    {
      "indent": 3,
      "text": "o schedule regular media updates,",
      "zh-CHS": "o 定期安排媒体更新，"
    },
    {
      "indent": 3,
      "text": "o apply predefined criteria for technology evaluation, and",
      "zh-CHS": "o 应用预定义的技术评估标准，以及"
    },
    {
      "indent": 3,
      "text": "o ensure the continued authenticity and integrity of documents through any changes in technology.",
      "zh-CHS": "o 通过技术上的任何更改，确保文档的持续真实性和完整性。"
    },
    {
      "indent": 3,
      "text": "As the custodian and canonical source of RFCs and associated errata, the RFC Editor must consider how to ensure the availability and integrity of this document series far into the future and determine whether the focus must be on bitstream preservation, content preservation, or both.",
      "zh-CHS": "RFC编辑器作为RFC和相关勘误表的保管人和规范来源，必须考虑如何确保该文档系列的可用性和完整性，并确定焦点是否必须保留在比特流、内容保存或两者上。"
    },
    {
      "indent": 3,
      "text": "The RFC Editor has several advantages in acting as the digital archivist for the Series. Since the RFC Editor is the publisher as well as the archivist, the RFC Editor controls the format of the material and the process for adding that material to an archive and can add any additional metadata considered necessary. External material, while a major consideration for more general archives, is no longer accepted by the RFC Editor. (See \"Internet Archaeology: Documents from Early History\" [RFC-HISTORY] for the list of non-RFC digital objects held by the RFC Editor.)",
      "zh-CHS": "RFC编辑器在担任该系列的数字档案管理员方面有几个优势。由于RFC编辑器既是发布者也是档案管理员，因此RFC编辑器控制材料的格式以及将材料添加到档案的过程，并可以添加任何必要的附加元数据。外部材料虽然是一般档案的主要考虑因素，但RFC编辑器不再接受。（有关RFC编辑器持有的非RFC数字对象列表，请参见“互联网考古学：早期历史文献”[RFC-History]）"
    },
    {
      "indent": 3,
      "text": "This document describes several different preservation models that may fit the needs of the Series and raises several points for community consideration. Specifically, this document covers information on:",
      "zh-CHS": "本文件描述了几种不同的保护模式，这些模式可能适合本系列的需要，并提出了一些社区考虑的要点。具体而言，本文件涵盖以下信息："
    },
    {
      "indent": 3,
      "text": "o Acquisition of documents",
      "zh-CHS": "o 文件的获取"
    },
    {
      "indent": 3,
      "text": "o Ingestion of documents",
      "zh-CHS": "o 文件的接收"
    },
    {
      "indent": 3,
      "text": "o Metadata and document registration",
      "zh-CHS": "o 元数据和文档注册"
    },
    {
      "indent": 3,
      "text": "o Normalization and standardization of canonical file structure and format",
      "zh-CHS": "o 规范文件结构和格式的规范化和标准化"
    },
    {
      "indent": 3,
      "text": "o Transformation/migration to current publication formats",
      "zh-CHS": "o 转换/迁移到当前发布格式"
    },
    {
      "indent": 3,
      "text": "o Content and computing environment preservation",
      "zh-CHS": "o 内容与计算环境保护"
    },
    {
      "indent": 3,
      "text": "o System parameters",
      "zh-CHS": "o 系统参数"
    },
    {
      "indent": 3,
      "text": "o Financial impact",
      "zh-CHS": "o 财务影响"
    },
    {
      "indent": 0,
      "text": "2.1. Acquisition of Documents",
      "section_title": true,
      "zh-CHS": "2.1. 文件的获取"
    },
    {
      "indent": 3,
      "text": "The acquisition process for documents intended for the archive starts with the submission of an approved I-D for publication. During the editorial process, information such as the document metadata is finalized prior to publication. However, the initial I-D as submitted and the RFC produced from it do not formally enter the archive until the time of publication, which is considered the point of ingestion from an archival perspective.",
      "zh-CHS": "用于存档的文件的获取过程始于提交经批准的I-D以供发布。在编辑过程中，诸如文档元数据之类的信息在发布之前就已最终确定。然而，提交的初始I-D和由此产生的RFC直到发布时才正式进入存档，从存档的角度来看，这被认为是摄入点。"
    },
    {
      "indent": 0,
      "text": "2.2. Ingestion of Documents",
      "section_title": true,
      "zh-CHS": "2.2. 文件的接收"
    },
    {
      "indent": 3,
      "text": "Once an RFC is published, the canonical format is considered immutable. At this point, the RFC Production Center, one of the internal roles within the RFC Editor, assigns the document metadata that an archivist needs to identify the unique object.",
      "zh-CHS": "一旦发布RFC，规范格式就被认为是不可变的。此时，RFC生产中心（RFC编辑器中的一个内部角色）分配文档元数据，档案管理员需要该元数据来标识唯一对象。"
    },
    {
      "indent": 3,
      "text": "In the case of RFCs, the metadata assigned to a document at the time of publication includes:",
      "zh-CHS": "对于RFC，发布时分配给文档的元数据包括："
    },
    {
      "indent": 3,
      "text": "o the RFC number",
      "zh-CHS": "o RFC编号"
    },
    {
      "indent": 3,
      "text": "o ISSN",
      "zh-CHS": "o 伊森"
    },
    {
      "indent": 3,
      "text": "o publication date",
      "zh-CHS": "o 出版日期"
    },
    {
      "indent": 3,
      "text": "o Digital Object Identifier (DOI)",
      "zh-CHS": "o 数字对象标识符（DOI）"
    },
    {
      "indent": 3,
      "text": "Additional metadata, such as author name, is assigned earlier in the document creation process, but it is subject to change up to the point of publication. More information on metadata is available in Section 2.3 (\"Metadata and Document Registration\").",
      "zh-CHS": "其他元数据（如作者姓名）在文档创建过程的早期分配，但在发布之前可能会更改。有关元数据的更多信息，请参见第2.3节（“元数据和文档注册”）。"
    },
    {
      "indent": 3,
      "text": "In terms of deciding what to accept in the archive -- a major question for most archives and yet a simple one for the RFC Series -- the RFC Editor accepts documents that are approved for publication by the approving body of one of the document streams: the IETF, IAB, IRTF, or Independent Submission streams [RFC7841]. Each document stream has defined processes on when and how I-Ds are approved and submitted to the RFC Editor for publication. The RFC Editor does not select documents for publication and archiving; the RFC Editor edits and publishes documents approved for publication by the document streams.",
      "zh-CHS": "就决定在档案中接受什么内容而言——这是大多数档案的一个主要问题，也是RFC系列的一个简单问题——RFC编辑器接受批准机构批准发布的文件流：IETF、IAB、IRTF或独立提交流[RFC7841]。每个文档流都定义了I-D批准的时间和方式以及提交给RFC编辑器以供发布的流程。RFC编辑器不选择要发布和归档的文档；RFC编辑器编辑并发布文档流批准发布的文档。"
    },
    {
      "indent": 3,
      "text": "The RFC Editor holds no copyright on I-Ds or RFCs. As per the IETF Trust Legal Provisions [TLP], the copyright for RFCs is held by the authors and the IETF Trust. At any point in time, the current entities providing RFC Editor services must be able to release the archive of RFCs to the IETF Trust.",
      "zh-CHS": "RFC编辑器不拥有I-Ds或RFC的版权。根据IETF信托法律条款[TLP]，RFC的版权由作者和IETF信托持有。在任何时候，提供RFC编辑器服务的当前实体必须能够向IETF信托机构发布RFC档案。"
    },
    {
      "indent": 3,
      "text": "Note: The RFC Editor is currently only responsible for RFCs; any associated datasets or other research data is not considered within the RFC Editor's mandate at this time; therefore, no consideration to the archival requirements of such datasets is covered in this document.",
      "zh-CHS": "注：RFC编辑器目前仅负责RFC；任何相关数据集或其他研究数据目前不在RFC编辑的授权范围内；因此，本文件不考虑此类数据集的归档要求。"
    },
    {
      "indent": 0,
      "text": "2.3. Metadata and Document Registration",
      "section_title": true,
      "zh-CHS": "2.3. 元数据和文档注册"
    },
    {
      "indent": 3,
      "text": "Metadata is data about data. In the field of digital archiving, this is the data that clearly identifies every aspect of a document, from its identifier (i.e., the RFC number and the I-D draft string) to the size and file format of the document and more. Metadata is stored in a central registry that records information on exactly what is being",
      "zh-CHS": "元数据是关于数据的数据。在数字归档领域，这是一种能够清楚标识文档各个方面的数据，从文档的标识符（即RFC编号和i-D草稿字符串）到文档的大小和文件格式等等。元数据存储在一个中央注册表中，该注册表准确地记录正在执行的操作的信息"
    },
    {
      "indent": 3,
      "text": "preserved and where it is located, information on authenticity and provenance, and details on the hardware and/or software needed to view or create the documents.",
      "zh-CHS": "保存和位置、真实性和出处信息，以及查看或创建文档所需的硬件和/或软件的详细信息。"
    },
    {
      "indent": 3,
      "text": "The RFC Editor maintains this registry in the form of a database that includes all metadata available for documents being edited and for published RFCs. This database feeds the search engine on the RFC Editor website and the info pages available for every RFC (e.g., http://www.rfc-editor.org/info/rfc####).",
      "zh-CHS": "RFC编辑器以数据库的形式维护此注册表，该数据库包含可用于正在编辑的文档和已发布的RFC的所有元数据。该数据库为RFC编辑器网站上的搜索引擎以及每个RFC可用的信息页面提供信息（例如。，http://www.rfc-editor.org/info/rfc####)."
    },
    {
      "indent": 3,
      "text": "Following is the current list of metadata presented in the RFC info pages:",
      "zh-CHS": "以下是RFC信息页面中显示的元数据的当前列表："
    },
    {
      "indent": 3,
      "text": "o RFC number",
      "zh-CHS": "o RFC编号"
    },
    {
      "indent": 3,
      "text": "o Canonical URI",
      "zh-CHS": "o 规范URI"
    },
    {
      "indent": 3,
      "text": "o Title",
      "zh-CHS": "o 标题"
    },
    {
      "indent": 3,
      "text": "o Status",
      "zh-CHS": "o 地位"
    },
    {
      "indent": 3,
      "text": "o Updates (if applicable)",
      "zh-CHS": "o 更新（如适用）"
    },
    {
      "indent": 3,
      "text": "o Updated by (if applicable)",
      "zh-CHS": "o 更新人（如适用）"
    },
    {
      "indent": 3,
      "text": "o Obsoletes (if applicable)",
      "zh-CHS": "o 废弃品（如适用）"
    },
    {
      "indent": 3,
      "text": "o Obsoleted by (if applicable)",
      "zh-CHS": "o 被淘汰（如适用）"
    },
    {
      "indent": 3,
      "text": "o Authors",
      "zh-CHS": "o 作者"
    },
    {
      "indent": 3,
      "text": "o Stream",
      "zh-CHS": "o 流动"
    },
    {
      "indent": 3,
      "text": "o Abstract",
      "zh-CHS": "o 摘要"
    },
    {
      "indent": 3,
      "text": "o Content-Type",
      "zh-CHS": "o 内容类型"
    },
    {
      "indent": 3,
      "text": "o Character Set",
      "zh-CHS": "o 字符集"
    },
    {
      "indent": 3,
      "text": "o ISSN",
      "zh-CHS": "o 伊森"
    },
    {
      "indent": 3,
      "text": "o Publication date",
      "zh-CHS": "o 出版日期"
    },
    {
      "indent": 3,
      "text": "o Digital Object Identifier (DOI)",
      "zh-CHS": "o 数字对象标识符（DOI）"
    },
    {
      "indent": 3,
      "text": "The following metadata will be added in the future:",
      "zh-CHS": "未来将添加以下元数据："
    },
    {
      "indent": 3,
      "text": "o Publication format URIs",
      "zh-CHS": "o 发布格式URI"
    },
    {
      "indent": 3,
      "text": "Info pages also include links to errata, IPR searches, and both plain-text and XML citation files.",
      "zh-CHS": "信息页面还包括到勘误表、IPR搜索以及纯文本和XML引用文件的链接。"
    },
    {
      "indent": 3,
      "text": "In terms of best practice, all documents used as normative references within an RFC would also be stored in the archive. While this is done automatically when the normative reference is another RFC (the usual case), retaining a copy of third-party documents is considered out of scope for the RFC Editor. As the digital archive industry stabilizes, services such as Perma.cc [PERMACC] may be a reasonable compromise. These services provide a permanent URI and image capture of online documents, with a goal of buffering against URI and online availability changes.",
      "zh-CHS": "就最佳实践而言，RFC中用作规范性参考的所有文件也将存储在档案中。当规范性参考文件是另一个RFC（通常情况下）时，会自动执行此操作，但保留第三方文档的副本被视为超出RFC编辑器的范围。随着数字存档行业的稳定，Perma.cc[PERMACC]等服务可能是一个合理的折衷方案。这些服务提供在线文档的永久URI和图像捕获，目的是缓冲URI和在线可用性变化。"
    },
    {
      "indent": 0,
      "text": "2.4. Normalization and Standardization of Canonical File Structure and Format",
      "zh-CHS": "2.4. 规范文件结构和格式的规范化和标准化"
    },
    {
      "indent": 3,
      "text": "The normalization process is perhaps the most technically critical part of digital archiving. The purpose is content preservation -- making sure the data accepted for archiving are in the most stable and easily accessed formats possible for the long-term future and require the least amount of re-engineering and emulation of environments in order to view the document in the future. Normalization is about enabling long-term access to the information within a document.",
      "zh-CHS": "标准化过程可能是数字归档中技术上最关键的部分。其目的是保存内容--确保接受存档的数据在长期内以最稳定、最易于访问的格式保存，并且需要最少的环境重新设计和模拟，以便在将来查看文档。规范化是指允许对文档中的信息进行长期访问。"
    },
    {
      "indent": 3,
      "text": "Over the history of the RFC Series, documents have been submitted for publication in a variety of formats, including paper for the earliest RFCs. Today, the majority of RFCs are available in both a canonical plain-text format and PDF format. For exceptions, see the RFC Online Project [RFC-ONLINE].",
      "zh-CHS": "在RFC系列的历史上，已经提交了各种格式的文件供出版，包括最早的RFC文件。今天，大多数RFC都有标准的纯文本格式和PDF格式。有关例外情况，请参阅RFC Online项目[RFC-Online]。"
    },
    {
      "indent": 3,
      "text": "Currently, all RFCs are printed out to paper and stored at time of publication. This has been a reasonable backup plan for several decades. With few of the features one might expect from a digital document format (such as links, metadata within the document, and line drawings), plain-text files do not lose much, if any, information when printed out to paper. However, as the published formats change (see RFC 6949), printing to paper provides less value as much of the metadata that is an intrinsic yet invisible part of the rendered document will be lost in such printing. With that in mind, the focus needs to change to preserving the new file formats electronically.",
      "zh-CHS": "目前，所有RFC都打印到纸上，并在发布时存储。几十年来，这一直是一个合理的备份计划。由于数字文档格式（如链接、文档中的元数据和线条图）所具有的功能很少，纯文本文件在打印到纸上时不会丢失太多（如果有的话）信息。但是，随着已发布格式的更改（请参见RFC 6949），纸质打印的价值会降低，因为作为呈现文档固有但不可见部分的大部分元数据将在此类打印中丢失。考虑到这一点，重点需要转向以电子方式保存新的文件格式。"
    },
    {
      "indent": 3,
      "text": "While each RFC today is printed to paper and all electronic versions stored on multiple hard drives, no particular effort is made to ensure copies of the software used to render or read the canonical",
      "zh-CHS": "虽然现在的每个RFC都打印成纸张，并且所有电子版本都存储在多个硬盘上，但没有特别努力确保用于呈现或读取规范的软件副本"
    },
    {
      "indent": 3,
      "text": "plain-text RFC are also archived. The RFC Editor has several choices on how to adapt to the need to archive a more complex set of data and follow best practice as defined by the digital archive community:",
      "zh-CHS": "纯文本RFC也被归档。RFC编辑器在如何适应归档更复杂数据集的需要以及遵循数字归档社区定义的最佳实践方面有多种选择："
    },
    {
      "indent": 3,
      "text": "o a simplified bitstream preservation model that focuses on standard \"best effort\" data-retention practices, which rely on backups, upgrades, and regular equipment change to preserve the data. This model assumes that emulators may be built when needed if the formats used go out of common use (a significant part of the model currently followed by the RFC Editor).",
      "zh-CHS": "o 一种简化的比特流保存模型，侧重于标准的“尽力而为”数据保留做法，该做法依靠备份、升级和定期设备更换来保存数据。该模型假设，如果所使用的格式不再通用（RFC编辑器当前遵循的模型的重要部分），则可以在需要时构建模拟器。"
    },
    {
      "indent": 3,
      "text": "o a content preservation model that focuses on one publication format as the version most likely to be viewable and provide all necessary metadata in the future. This is a viable option considering that PDF/A-3 [PDF], one of the intended publication formats, was designed for this type of archiving.",
      "zh-CHS": "o 一种内容保存模型，侧重于一种发布格式，作为最有可能查看的版本，并在将来提供所有必要的元数据。这是一个可行的选择，因为PDF/a-3[PDF]是一种预期的发布格式，专为此类归档而设计。"
    },
    {
      "indent": 3,
      "text": "o a complex bitstream and content preservation model that focuses on archiving the canonical XML and the entire computing environment required to create, view and render all outputs from that file. This is the \"best practice\" from an archivist's perspective.",
      "zh-CHS": "o 一种复杂的比特流和内容保存模型，重点是归档规范XML以及创建、查看和呈现该文件的所有输出所需的整个计算环境。从档案管理员的角度来看，这是“最佳实践”。"
    },
    {
      "indent": 3,
      "text": "Those options are listed in order of least to greatest complexity and expense. More detail on each option is described below.",
      "zh-CHS": "这些选项按复杂性和费用从最小到最大的顺序列出。关于每个选项的更多详细信息如下所述。"
    },
    {
      "indent": 0,
      "text": "2.4.1. 'Best Effort' Data Retention",
      "section_title": true,
      "zh-CHS": "2.4.1. “尽力而为”的数据保留"
    },
    {
      "indent": 3,
      "text": "When dealing with very simple data structures such as plain-text, ASCII-only files, the experience of the RFC Series suggests that for the last few decades, hardware and operating system changes have had minimal impact on the document files being stored. While a complete failure of an operating system migration corrupted the dataset in the past, that situation represents a somewhat different problem than the tools themselves changing such that plain-text files are not easily read with existing technology. Given that the basic plain-text format and ASCII encoding remain in common use, the standard protections against file corruption and data loss, such as disk mirroring, off-site backups, and periodic restoration testing, will continue to provide access to the entirety of the RFC Series for the foreseeable future. As has been pointed out, both in this document and in broader community discussion, that is not sufficient for complex formats such as XML, HTML, PDF, or other proprietary formats offered by today's large IT companies. The risk of technological change resulting in the file formats mentioned being deprecated or changed without backwards compatibility is fairly high when looking decades or centuries into the future.",
      "zh-CHS": "在处理非常简单的数据结构（如纯文本、仅ASCII文件）时，RFC系列的经验表明，在过去几十年中，硬件和操作系统的更改对存储的文档文件的影响最小。虽然操作系统迁移的完全失败在过去损坏了数据集，但这种情况与工具本身的变化有些不同，因为现有技术无法轻松读取纯文本文件。鉴于基本的纯文本格式和ASCII编码仍在普遍使用，防止文件损坏和数据丢失的标准保护（如磁盘镜像、异地备份和定期恢复测试）将在可预见的未来继续提供对整个RFC系列的访问。正如本文档和更广泛的社区讨论中所指出的，对于复杂的格式（如XML、HTML、PDF或当今大型IT公司提供的其他专有格式），这是不够的。展望未来几十年或几百年，技术变革导致所提到的文件格式被弃用或更改而没有向后兼容性的风险相当高。"
    },
    {
      "indent": 3,
      "text": "It is recommended that this model of archiving the RFC Series cease to be the primary model after the plain-text, ASCII-only format is no longer the canonical format. Best effort data retention is a necessary but not sufficient level of effort for preserving a digital archive. For more guidance on how to define best effort data retention, the section on \"Media and Formats, Summary Recommendations\" in the 2009 version of the Digital Preservation Handbook [DPC2009] provides useful and concrete information.",
      "zh-CHS": "建议在纯文本、仅ASCII格式不再是标准格式之后，这种RFC系列存档模式不再是主要模式。尽力而为的数据保留对于保存数字归档来说是必要的，但还不够。有关如何定义尽力而为的数据保留的更多指导，2009年版《数字保存手册》[DPC2009]中关于“媒体和格式，摘要建议”的章节提供了有用的具体信息。"
    },
    {
      "indent": 0,
      "text": "2.4.2. Single Format for Archival Purposes",
      "section_title": true,
      "zh-CHS": "2.4.2. 用于存档目的的单一格式"
    },
    {
      "indent": 3,
      "text": "If preserving the information described by a document, rather than the document itself, is the primary purpose of an archive, then focusing efforts on a single file format is a reasonable option. Some well-supported archival tooling projects follow this route, such as Archivematica [ARCHIVEMATICA]. By selecting a feature-rich yet fundamentally stable file format for documents, an organization may avoid expensive whole-environment reconstruction in order to view the document. The PDF/A formats were designed to be an archival format for electronic documents, and PDF/A-3 is one of the options intended for publication as the RFC Series moves from a plain-text canonical format to an XML canonical format with multiple publication formats. A PDF/A-3 file can be produced that embeds the XML from which the PDF/A-3 file was created; this allows for both original and rendered document validation if one has the correct tools available to see the source of the PDF/A-3 file [RFC7995]. The XML is not otherwise visible when viewing the PDF/A-3 file through typical PDF reader software.",
      "zh-CHS": "如果存档的主要目的是保存文档所描述的信息，而不是文档本身，那么将精力集中在单个文件格式上是一个合理的选择。一些支持良好的归档工具项目遵循这一路线，例如Archivematica[Archivematica]。通过为文档选择功能丰富但基本上稳定的文件格式，组织可以避免昂贵的整个环境重建以查看文档。PDF/A格式被设计为电子文档的归档格式，随着RFC系列从纯文本规范格式转变为具有多种发布格式的XML规范格式，PDF/A-3是用于发布的选项之一。可以生成嵌入创建PDF/A-3文件的XML的PDF/A-3文件；如果有正确的工具可以查看PDF/A-3文件[RFC7995]的源，则可以对原始文档和呈现文档进行验证。通过典型的PDF阅读器软件查看PDF/A-3文件时，XML不可见。"
    },
    {
      "indent": 3,
      "text": "When looking at the need to archive RFCs in a resource-limited environment, a content-preservation-only model has merit, but it is not without risks. First, PDF/A-3 will not be the canonical format; it is intended to be one of the rendered outputs. It may contain rendering bugs that were not intended to be in the document. Second, while the various PDF/A formats were designed to be archival, they have not been put to the test of time to determine if they will actually live up to the design goals.",
      "zh-CHS": "当考虑到在资源有限的环境中归档RFC的需要时，只保存内容的模型有其优点，但并非没有风险。首先，PDF/A-3将不是标准格式；它旨在成为渲染输出之一。它可能包含不在文档中的呈现错误。第二，尽管各种PDF/A格式都是为了存档而设计的，但它们还没有经过时间的检验，以确定它们是否真的能达到设计目标。"
    },
    {
      "indent": 3,
      "text": "This is a valid option to consider, but the risks, priorities, and costs must be discussed by the community before a decision is made to follow this path. The best option may be to combine this with one of the other methods of archiving described in this document to help minimize both risk and cost.",
      "zh-CHS": "这是一个有效的选择，但风险，优先权和成本必须由社区讨论，然后才决定要遵循这条道路。最好的选择可能是将此方法与本文档中描述的其他归档方法之一结合使用，以帮助将风险和成本降至最低。"
    },
    {
      "indent": 0,
      "text": "2.4.3. Holistic Archiving of the Computing Environment",
      "section_title": true,
      "zh-CHS": "2.4.3. 计算环境的整体归档"
    },
    {
      "indent": 3,
      "text": "Preserving everything published by the RFC Editor in order to have a permanent record of information, standards, and best practice is arguably the whole point of being an archival series. One can argue that it is not only about the information described in an RFC, it is also about supporting Intellectual Property Rights (IPR) and retaining the history of the Internet. In following this model, however, one must consider the complexity of the archival environment as matching, and possibly exceeding, the complexity of the file formats being preserved.",
      "zh-CHS": "保存RFC编辑器发布的所有内容，以便永久记录信息、标准和最佳实践，可以说是归档系列的全部要点。有人可能会说，这不仅与RFC中描述的信息有关，还与支持知识产权（IPR）和保留互联网历史有关。然而，在遵循该模型时，人们必须考虑档案环境的复杂性，作为匹配和可能超过的文件格式保存的复杂性。"
    },
    {
      "indent": 3,
      "text": "Consider a future where XML has been obsoleted for half a century, HTML5 was a format used three to four human generations ago, and PDF/ A-3 is no longer supported by any existing company's reading software. For RFCs that were produced with XML as their canonical format, an archive must not only hold the data, it must also hold the entire computing environment that allows the data to be rendered and viewed. Operating systems and hardware on which those OSs can run, each major version of each piece of software used or relied upon during the publication of an RFC, browsers and readers for HTML, PDF, and any other publication format must be preserved in some fashion. This is considered best practice when archiving digital documents. This is also the most expensive method, and the cost only increases over time as more and more instances of the computing environment must be preserved over the lifetime of the Series.",
      "zh-CHS": "考虑XML已经过时了半个世纪的未来，HTML5是人类三到四代使用的格式，PDF/A-3不再被任何现有公司的阅读软件所支持。对于以XML作为标准格式生成的RFC，归档文件不仅必须保存数据，还必须保存允许呈现和查看数据的整个计算环境。这些操作系统可以运行的操作系统和硬件、RFC发布过程中使用或依赖的每个软件的每个主要版本、HTML、PDF和任何其他发布格式的浏览器和阅读器必须以某种方式保留。这被认为是归档数字文档时的最佳做法。这也是最昂贵的方法，而且成本只会随着时间的推移而增加，因为越来越多的计算环境实例必须在该系列的生命周期内保留。"
    },
    {
      "indent": 3,
      "text": "This is a valid option to consider, but the sheer scope of resources required suggests that this must be discussed by the community before a decision is made. Pursuing this may require an entirely different paradigm for the RFC Editor from what has been considered in the past; expanding the scope and resources for the RFC Editor, finding a third party to take over the responsibilities of archiving, or some other option may be necessary.",
      "zh-CHS": "这是一个有效的选择，但所需资源的范围表明，在作出决定之前，必须由社区讨论。为了实现这一点，RFC编辑器可能需要一种与过去完全不同的范式；扩展RFC编辑器的范围和资源，寻找第三方来接管归档职责，或者其他一些选项可能是必要的。"
    },
    {
      "indent": 0,
      "text": "2.5. Transformation/Migration to Current Publication Formats",
      "section_title": true,
      "zh-CHS": "2.5. 转换/迁移到当前发布格式"
    },
    {
      "indent": 3,
      "text": "Because normalization is a complex subject, it is important to consider how to mitigate the risk of failure of the normalization process.",
      "zh-CHS": "由于归一化是一个复杂的主题，重要的是要考虑如何减轻归一化处理失败的风险。"
    },
    {
      "indent": 3,
      "text": "The RFC Editor is responsible for making RFCs available to the Internet community. The canonical version of an RFC does not change once published; any formats officially rendered from the canonical version, however, may change. One way to mitigate the need to preserve the entire computing environment for an RFC, including web browsers and PDF readers, would be to take advantage of the non-canonical nature of the publication formats and re-render them from",
      "zh-CHS": "RFC编辑器负责向互联网社区提供RFC。RFC的规范版本在发布后不会更改；但是，从规范版本正式呈现的任何格式都可能更改。减轻为RFC保留整个计算环境（包括web浏览器和PDF阅读器）需求的一种方法是利用发布格式的非规范性，并从"
    },
    {
      "indent": 3,
      "text": "the canonical source at the point that browser or reader technology has changed sufficiently to make RFCs largely unavailable to 'modern' tools.",
      "zh-CHS": "浏览器或读卡器技术已经发生了充分的变化，使得RFC在很大程度上不可用于“现代”工具，这是一个规范的来源。"
    },
    {
      "indent": 3,
      "text": "For example, the RFC Editor may develop the practice of annually reviewing the tools needed to view the publication formats created by the RFC Editor to determine whether or not the current common and popular reader technologies (i.e., web browsers, PDF viewers, e-readers) can view the existing publication formats. During that review, the RFC Editor would work with the community to determine if the current publication formats meet the needs of the community and whether any should be retired or added to improve the availability of information to the community at that time.",
      "zh-CHS": "例如，RFC编辑器可以制定每年审查查看RFC编辑器创建的发布格式所需的工具的实践，以确定当前常见和流行的阅读器技术（即web浏览器、PDF查看器、电子阅读器）是否可以查看现有的发布格式。在审查期间，RFC编辑将与社区合作，以确定当前的出版物格式是否满足社区的需要，以及是否应取消或添加任何格式，以提高社区当时的信息可用性。"
    },
    {
      "indent": 0,
      "text": "2.6. System Parameters",
      "section_title": true,
      "zh-CHS": "2.6. 系统参数"
    },
    {
      "indent": 3,
      "text": "While the industry best practice on the backup and restoration of data is not sufficient as a long-term archival solution, it is still a necessary part of keeping the Series available now and into the future. In the past, nearly 800 RFCs had to be manually transcribed from paper back to electronic format due to a failed server migration and insufficient backups.",
      "zh-CHS": "虽然业界关于数据备份和恢复的最佳做法不足以作为长期存档解决方案，但它仍然是保持本系列现在和将来可用的必要部分。在过去，由于服务器迁移失败和备份不足，将近800份RFC必须手动从纸质格式转录回电子格式。"
    },
    {
      "indent": 3,
      "text": "The underlying servers hosting the tools, database, RFCs, and errata are the physical link in the archival environment. While such systems cannot and should not remain static and unchanging, there must be clear documentation regarding the environment, in particular, the storage, backups, and recovery processes for all RFC-related material. The documentation must include information on the refresh cycle for the physical storage and backup media and describe a regular cycle of data restoration and/or migration testing.",
      "zh-CHS": "托管工具、数据库、RFC和勘误表的底层服务器是归档环境中的物理链接。虽然此类系统不能也不应该保持静态不变，但必须有关于环境的清晰文档，特别是所有RFC相关材料的存储、备份和恢复过程。文档必须包括物理存储和备份介质的刷新周期信息，并描述数据恢复和/或迁移测试的常规周期。"
    },
    {
      "indent": 0,
      "text": "2.7. Financial Impact",
      "section_title": true,
      "zh-CHS": "2.7. 财务影响"
    },
    {
      "indent": 3,
      "text": "Having a policy regarding digital archiving provides input into the budget process. The main costs associated with digital archives come from the complexity and quantity of the material being archived, as described in Section 2.4 on normalization.",
      "zh-CHS": "制定有关数字归档的政策可为预算流程提供投入。与数字归档相关的主要成本来自于归档材料的复杂性和数量，如第2.4节“标准化”所述。"
    },
    {
      "indent": 3,
      "text": "Estimating potential costs and providing figures are outside of the scope of this document, but it should be noted that costs are a major factor when determining what level of archival practice an organization will follow.",
      "zh-CHS": "估算潜在成本和提供数字超出了本文件的范围，但应注意，成本是决定组织将遵循何种归档实践水平的一个主要因素。"
    },
    {
      "indent": 3,
      "text": "For more information on potential business plans and cost modeling for digital preservation, see the \"Business cases, benefits, costs, and impact\" section of the Digital Preservation Handbook [DPC].",
      "zh-CHS": "有关数字保存的潜在业务计划和成本建模的更多信息，请参阅《数字保存手册》[DPC]的“业务案例、好处、成本和影响”部分。"
    },
    {
      "indent": 0,
      "text": "3. Recommendations",
      "section_title": true,
      "zh-CHS": "3. 建议"
    },
    {
      "indent": 3,
      "text": "Given the need to balance cost and complexity with retention of information for historic, legal, and informational purposes, preservation efforts should focus on the XML canonical format files, the PDF/A-3 format files, the xml2rfc tool and its documentation, and at least two PDF reader applications capable of extracting the embedded XML. Care should be taken that the software being included in this archive has a provision for free copies for backup or archival purposes. All other formats and the overall computing environment should be stored as described in \"best effort\" data retention (Section 2.4.1), which should in turn be described in the appropriate vendor contract for the RFC Publisher.",
      "zh-CHS": "考虑到需要平衡成本和复杂性以及出于历史、法律和信息目的保留信息，保存工作应重点关注XML规范格式文件、PDF/A-3格式文件、xml2rfc工具及其文档，以及至少两个能够提取嵌入XML的PDF阅读器应用程序。应注意，此存档中包含的软件应提供免费副本，以备备份或存档之用。所有其他格式和整个计算环境应按照“尽力而为”数据保留（第2.4.1节）中的说明进行存储，而“尽力而为”数据保留应在RFC发布者的相应供应商合同中进行说明。"
    },
    {
      "indent": 3,
      "text": "Particular preservation efforts should be made by:",
      "zh-CHS": "应通过以下方式开展特别的保护工作："
    },
    {
      "indent": 3,
      "text": "o choosing a format designed for archiving RFCs (PDF/A-3 as indicated by [RFC7995])",
      "zh-CHS": "o 选择用于归档RFC的格式（PDF/a-3，如[RFC7995]所示）"
    },
    {
      "indent": 3,
      "text": "o embedding the canonical XML format within the PDF/A-3 file for RFCs",
      "zh-CHS": "o 在RFC的PDF/A-3文件中嵌入规范XML格式"
    },
    {
      "indent": 3,
      "text": "o retaining a copy of the plain-text or XML file submitted for approved I-Ds",
      "zh-CHS": "o 保留为获得批准的I-D提交的纯文本或XML文件的副本"
    },
    {
      "indent": 3,
      "text": "o retaining all major versions of the tools and their associated documentation used to acquire and ingest an RFC",
      "zh-CHS": "o 保留用于获取和接收RFC的工具及其相关文档的所有主要版本"
    },
    {
      "indent": 3,
      "text": "o retaining the final XML file as well as the PDF/A-3 file with the embedded XML",
      "zh-CHS": "o 保留最终的XML文件以及带有嵌入XML的PDF/A-3文件"
    },
    {
      "indent": 3,
      "text": "o retaining at least two software reader applications to ensure the PDF/A-3 and XML files can be viewed in the future",
      "zh-CHS": "o 保留至少两个软件阅读器应用程序，以确保将来可以查看PDF/A-3和XML文件"
    },
    {
      "indent": 3,
      "text": "o partnering with other digital archives around the world to mirror copies of the target data",
      "zh-CHS": "o 与世界各地的其他数字档案馆合作，镜像目标数据的副本"
    },
    {
      "indent": 3,
      "text": "In order to control costs and focus the archiving effort on the entire content of an RFC, including the metadata and other features embedded within each RFC published in more than just plain text, printing each RFC to paper upon publication is no longer reasonable. Proper data storage and mirrored copies of RFCs provide more efficient and effective copies in case of catastrophic failure of the existing archive of material.",
      "zh-CHS": "为了控制成本并将归档工作重点放在RFC的整个内容上，包括以纯文本形式发布的每个RFC中嵌入的元数据和其他功能，在发布时将每个RFC打印到纸上已不再合理。适当的数据存储和RFC镜像副本可在现有资料存档发生灾难性故障时提供更高效的副本。"
    },
    {
      "indent": 3,
      "text": "Particular focus should be given to finding partners that specialize in digital preservation to ingest RFCs. Ideally, they will ingest all material associated with an RFC, including all metadata, digital",
      "zh-CHS": "应特别关注寻找专门从事数字保存的合作伙伴来接收RFC。理想情况下，他们将摄取与RFC相关的所有材料，包括所有元数据、数字和数据"
    },
    {
      "indent": 3,
      "text": "signatures, and the approved I-D that was submitted to the RFC Editor. The possibilities and options should be discussed with each archival partner; at minimum, they must ingest copies of RFCs as they are published, with the basic metadata associated with each document.",
      "zh-CHS": "签名，以及提交给RFC编辑的经批准的ID。应与每个档案合作伙伴讨论可能性和选项；至少，他们必须在RFC发布时接收其副本，以及与每个文档相关的基本元数据。"
    },
    {
      "indent": 3,
      "text": "Preservation efforts should be reviewed and validated through a biennial audit that will verify that the targeted content and all its associated metadata can be read with existing tools. The full process from acquisition to ingestion should be reviewed to ensure that best current practice is being followed from the perspective of the digital archive community. Since the overall model for the digital archive maintained by the RFC Editor follows the OAIS reference model, the associated audit guidelines should also be followed. While the RFC Editor does not seek to be recognized as 'OAIS-compliant' at this time, use of the ISO standard \"Space data and information transfer systems -- Audit and certification of trustworthy digital repositories\" [ISO16363] would provide a solid, accepted method for structuring an audit for this digital archive.",
      "zh-CHS": "保存工作应通过两年一次的审计进行审查和验证，该审计将验证目标内容及其所有相关元数据是否可以用现有工具读取。应审查从获取到接收的整个过程，以确保从数字归档社区的角度遵循当前最佳做法。由于RFC编辑器维护的数字存档的总体模型遵循OAIS参考模型，因此还应遵循相关的审计指南。虽然RFC编辑器目前并不寻求被认可为“OAIS合规”，但使用ISO标准“空间数据和信息传输系统——可信数字存储库的审核和认证”[ISO16363]将为构建该数字存档的审核提供一种可靠、可接受的方法。"
    },
    {
      "indent": 0,
      "text": "4. Summary",
      "section_title": true,
      "zh-CHS": "4. 总结"
    },
    {
      "indent": 3,
      "text": "The RFC Series is worth archiving. It contains the history of the early Internet, as well as some of the key standards for Internet technology and best practice today. Who knows what the community will create in the future? There are many ways to preserve the Series, from relying on preservation of the bits, to focusing on a single file format, to preserving the entire computing environment. Each possibility, or permutations of them, involves risks and requires varying levels of resources. The goal of this document is to describe the possibilities and associated risks so that the community can come to an informed decision regarding what it is willing to see supported far into the future.",
      "zh-CHS": "RFC系列值得存档。它包含了早期互联网的历史，以及当今互联网技术和最佳实践的一些关键标准。谁知道社区将来会创造什么？保存该系列的方法有很多，从依赖位的保存，到关注单个文件格式，再到保存整个计算环境。每种可能性，或它们的排列，都涉及风险，需要不同程度的资源。本文件的目的是描述可能性和相关风险，以便社区能够就其希望在未来得到支持的内容做出明智的决定。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document does not require any IANA actions.",
      "zh-CHS": "本文件不要求IANA采取任何行动。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document assumes that the origination of RFCs via the RFC Editor is secure and trusted. With that assumption, the activities discussed in this document do not affect the security of the Internet.",
      "zh-CHS": "本文档假设通过RFC编辑器生成的RFC是安全可靠的。基于这一假设，本文件中讨论的活动不会影响互联网的安全。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "zh-CHS": "7. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[ARCHIVEMATICA] \"Archivematica\", <https://www.archivematica.org/wiki/ Main_Page>.",
      "zh-CHS": "[ARCHIVEMATICA]“ARCHIVEMATICA”<https://www.archivematica.org/wiki/ 主页>。"
    },
    {
      "indent": 3,
      "text": "[DPC] Digital Preservation Coalition, \"Digital Preservation Handbook\", 2015, <http://dpconline.org/handbook>.",
      "zh-CHS": "[DPC]数字保存联盟，“数字保存手册”，2015年<http://dpconline.org/handbook>."
    },
    {
      "indent": 3,
      "text": "[DPC2009] Digital Preservation Coalition, \"Digital Preservation Handbook\", 2009, <http://www.dpconline.org/docman/digital-preservation-handbook/304-digital-preservation-handbook-media-and-formats>.",
      "zh-CHS": "[DPC2009]数字保存联盟，“数字保存手册”，2009年<http://www.dpconline.org/docman/digital-preservation-handbook/304-digital-preservation-handbook-media-and-formats>."
    },
    {
      "indent": 3,
      "text": "[ISO14721] International Organization for Standardization, \"Space data and information transfer systems -- Open archival information system (OAIS) -- Reference model\", ISO 14721:2012, 2012.",
      "zh-CHS": "[ISO14721]国际标准化组织，“空间数据和信息传输系统——开放式档案信息系统（OAIS）——参考模型”，ISO 14721:2012，2012。"
    },
    {
      "indent": 3,
      "text": "[ISO16363] International Organization for Standardization, \"Space data and information transfer systems -- Audit and certification of trustworthy digital repositories\", ISO 16363:2012, 2012.",
      "zh-CHS": "[ISO16363]国际标准化组织，“空间数据和信息传输系统——可信数字存储库的审核和认证”，ISO 16363:2012，2012。"
    },
    {
      "indent": 3,
      "text": "[LIFE] Hole, B., \"LIFE^3: Predictive Costing of Digital Preservation\", July 2010, <http://www.life.ac.uk/3/docs/Hole_pasig_v1.pdf>.",
      "zh-CHS": "[LIFE]Hole，B.，“LIFE^3：数字保存的预测成本”，2010年7月<http://www.life.ac.uk/3/docs/Hole_pasig_v1.pdf>."
    },
    {
      "indent": 3,
      "text": "[PDF] International Organization for Standardization, \"Document management -- Electronic document file format for long-term preservation -- Part 3: Use of ISO 32000-1 with support for embedded files (PDF/A-3)\", ISO 19005-3:2012, 2012.",
      "zh-CHS": "[PDF]国际标准化组织，“文件管理——长期保存的电子文件格式——第3部分：支持嵌入文件的ISO 32000-1的使用（PDF/A-3）”，ISO 19005-3:2012，2012。"
    },
    {
      "indent": 3,
      "text": "[PERMACC] \"Perma.cc\", <http://perma.cc/>.",
      "zh-CHS": "[PERMACC]“Perma.cc”<http://perma.cc/>."
    },
    {
      "indent": 3,
      "text": "[RFC-HISTORY] RFC Editor, \"Internet Archaeology: Documents from Early History\", <http://www.rfc-editor.org/history.html>.",
      "zh-CHS": "[RFC-HISTORY]RFC编辑，“互联网考古学：早期历史文献”<http://www.rfc-editor.org/history.html>."
    },
    {
      "indent": 3,
      "text": "[RFC-ONLINE] RFC Editor, \"History of RFC Online Project\", <http://www.rfc-editor.org/rfc-online-2000.html>.",
      "zh-CHS": "[RFC-ONLINE]RFC编辑器，“RFC ONLINE项目历史记录”<http://www.rfc-editor.org/rfc-online-2000.html>."
    },
    {
      "indent": 3,
      "text": "[RFC-PUB] RFC Editor, \"Publication Process\", <http://www.rfc-editor.org/pubprocess.html>.",
      "zh-CHS": "[RFC-PUB]RFC编辑器，“发布过程”<http://www.rfc-editor.org/pubprocess.html>."
    },
    {
      "indent": 3,
      "text": "[RFC-SERIES] RFC Editor, \"About Us\", <http://www.rfc-editor.org/RFCoverview.html>.",
      "zh-CHS": "[RFC-SERIES]RFC编辑器，“关于我们”<http://www.rfc-editor.org/RFCoverview.html>."
    },
    {
      "indent": 3,
      "text": "[RFC6635] Kolkman, O., Ed., Halpern, J., Ed., and IAB, \"RFC Editor Model (Version 2)\", RFC 6635, DOI 10.17487/RFC6635, June 2012, <http://www.rfc-editor.org/info/rfc6635>.",
      "zh-CHS": "[RFC6635]Kolkman，O.，Ed.，Halpern，J.，Ed.，和IAB，“RFC编辑器模型（版本2）”，RFC 6635，DOI 10.17487/RFC66352012年6月<http://www.rfc-editor.org/info/rfc6635>."
    },
    {
      "indent": 3,
      "text": "[RFC6949] Flanagan, H. and N. Brownlee, \"RFC Series Format Requirements and Future Development\", RFC 6949, DOI 10.17487/RFC6949, May 2013, <http://www.rfc-editor.org/info/rfc6949>.",
      "zh-CHS": "[RFC6949]Flanagan，H.和N.Brownlee，“RFC系列格式要求和未来发展”，RFC 6949，DOI 10.17487/RFC6949，2013年5月<http://www.rfc-editor.org/info/rfc6949>."
    },
    {
      "indent": 3,
      "text": "[RFC7841] Halpern, J., Ed., Daigle, L., Ed., and O. Kolkman, Ed., \"RFC Streams, Headers, and Boilerplates\", RFC 7841, DOI 10.17487/RFC7841, May 2016, <http://www.rfc-editor.org/info/rfc7841>.",
      "zh-CHS": "[RFC7841]Halpern，J.，Ed.，Daigle，L.，Ed.，和O.Kolkman，Ed.，“RFC流，标题和样板”，RFC 7841，DOI 10.17487/RFC78412016年5月<http://www.rfc-editor.org/info/rfc7841>."
    },
    {
      "indent": 3,
      "text": "[RFC7995] Hansen, T., Ed., Masinter, L., and M. Hardy, \"PDF Format for RFCs\", RFC 7995, DOI 10.17487/RFC7995, December 2016, <http://www.rfc-editor.org/info/rfc7995>.",
      "zh-CHS": "[RFC7995]Hansen，T.，Ed.，Masinter，L.，和M.Hardy，“RFC的PDF格式”，RFC 7995，DOI 10.17487/RFC7995，2016年12月<http://www.rfc-editor.org/info/rfc7995>."
    },
    {
      "indent": 3,
      "text": "[TLP] IETF Trust, \"Trust Legal Provisions (TLP)\", <https://trustee.ietf.org/trust-legal-provisions.html>.",
      "zh-CHS": "[TLP]IETF信托，“信托法律条款（TLP）”<https://trustee.ietf.org/trust-legal-provisions.html>."
    },
    {
      "indent": 3,
      "text": "[USLOC] LeFurgy, B., \"Life Cycle Models for Digital Stewardship\", February 2012, <http://blogs.loc.gov/digitalpreservation/2012/02/ life-cycle-models-for-digital-stewardship/>.",
      "zh-CHS": "[USLOC]Leforgy，B.“数字管理的生命周期模型”，2012年2月<http://blogs.loc.gov/digitalpreservation/2012/02/ 数字管理的生命周期模型/>。"
    },
    {
      "indent": 0,
      "text": "IAB Members at the Time of Approval",
      "zh-CHS": "批准时的IAB成员"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time this document was approved were (in alphabetical order):",
      "zh-CHS": "本文件批准时，IAB成员为（按字母顺序排列）："
    },
    {
      "indent": 6,
      "text": "Jari Arkko Ralph Droms Ted Hardie Joe Hildebrand Lee Howard Erik Nordmark Robert Sparks Andrew Sullivan Dave Thaler Martin Thomson Brian Trammell Suzanne Woolf",
      "zh-CHS": "贾里·阿尔科·拉尔夫·德罗姆·泰德·哈迪·乔·希尔德布兰德·李·霍华德·埃里克·诺德马克·罗伯特·斯帕克斯·安德鲁·沙利文·戴夫·泰勒·马丁·汤姆森·布莱恩·特拉梅尔·苏珊娜·伍尔夫"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Heather Flanagan RFC Editor",
      "zh-CHS": "希瑟·弗拉纳根RFC编辑"
    },
    {
      "indent": 3,
      "text": "Email: rse@rfc-editor.org\nURI:   http://orcid.org/0000-0002-2647-2220",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}