{
  "title": {
    "text": "RFC 8128: IETF Appointment Procedures for the ICANN Root Zone Evolution Review Committee",
    "zh-CHS": "RFC 8128"
  },
  "number": 8128,
  "created_at": "2021-10-28 20:08:58.953451+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                              C. Morgan\nRequest for Comments: 8128                                           AMS\nCategory: Informational                                       March 2017\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": " IETF Appointment Procedures for the ICANN Root Zone Evolution Review Committee",
      "zh-CHS": "ICANN根区演进审查委员会的IETF任命程序"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo outlines the process by which the IETF makes an appointment to the ICANN Root Zone Evolution Review Committee (RZERC).",
      "zh-CHS": "本备忘录概述了IETF向ICANN根区域演进审查委员会（RZERC）作出任命的过程。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。它代表了互联网体系结构委员会（IAB）的共识。IAB批准发布的文件不适用于任何级别的互联网标准；见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8128.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8128."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Desirable Qualifications for an IETF-Nominated RZERC Member .   2\n3.  IETF-Nominated RZERC Member Selection Process . . . . . . . .   3\n  3.1.  Term Length . . . . . . . . . . . . . . . . . . . . . . .   3\n  3.2.  Nominations and Eligibility . . . . . . . . . . . . . . .   3\n  3.3.  Selection . . . . . . . . . . . . . . . . . . . . . . . .   4\n  3.4.  Timeframe . . . . . . . . . . . . . . . . . . . . . . . .   4\n  3.5.  Mid-term Vacancies  . . . . . . . . . . . . . . . . . . .   4\n    3.5.1.  Interim Appointment Process . . . . . . . . . . . . .   4\n4.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .   5\n6.  Normative References  . . . . . . . . . . . . . . . . . . . .   5\nIAB Members at the Time of Approval .  . . . . . . . . . . . . . .  5\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The ICANN Root Zone Evolution Review Committee (RZERC) reviews proposed architectural changes to the content of the DNS root zone, the systems including both hardware and software components used in executing changes to the DNS root zone, and the mechanisms used for distribution of the DNS root zone, and makes recommendations to the ICANN Board. As stipulated in [RZERC-Charter], the IETF is called upon to name its delegate to the committee.",
      "zh-CHS": "ICANN根区域演进审查委员会（RZERC）审查DNS根区域内容的拟议架构变更、包括用于执行DNS根区域变更的硬件和软件组件的系统以及用于分发DNS根区域的机制，并向ICANN董事会提出建议。按照[RZERC宪章]的规定，IETF被要求任命其委员会代表。"
    },
    {
      "indent": 3,
      "text": "The IAB will select one person for a one-year term. This appointment can be renewed for up to three additional one-year terms. This memo outlines the process by which the IETF makes that selection.",
      "zh-CHS": "IAB将选择一人，任期一年。此任命最多可延长三个额外的一年任期。本备忘录概述了IETF做出选择的过程。"
    },
    {
      "indent": 3,
      "text": "In brief, this document describes the timeframe and procedures for the IAB to solicit public input and make a selection for the open position.",
      "zh-CHS": "简而言之，本文件描述了IAB征求公众意见和选择空缺职位的时间框架和程序。"
    },
    {
      "indent": 0,
      "text": "2. Desirable Qualifications for an IETF-Nominated RZERC Member",
      "section_title": true,
      "zh-CHS": "2. IETF提名RZERC成员的理想资格"
    },
    {
      "indent": 3,
      "text": "Candidates for the RZERC should have a demonstrable involvement in the IETF with a particular focus on active participation in IETF Working Groups.",
      "zh-CHS": "RZERC的候选人应明显参与IETF，特别关注积极参与IETF工作组。"
    },
    {
      "indent": 3,
      "text": "The candidate is expected to possess clearly demonstrated technical competence in Internet technology relating to the DNS root zone and be able to articulate those technology issues such that the ICANN Board can be provided with sound technical perspectives. The candidate is also expected to be able to understand the respective roles and responsibilities of the IETF and ICANN and be able to articulate these roles within both organizational communities.",
      "zh-CHS": "候选人应具备与DNS根区域相关的互联网技术方面的明确证明的技术能力，并能够阐明这些技术问题，以便为ICANN董事会提供良好的技术视角。候选人还应能够理解IETF和ICANN各自的角色和职责，并能够在两个组织团体中阐明这些角色。"
    },
    {
      "indent": 3,
      "text": "The candidate will be a representative or a delegate of the IETF. It is expected that the candidate would be able to call on experts in the IETF community as required, to ensure that the ICANN Board receives the highest-quality technical advice available.",
      "zh-CHS": "候选人将是IETF的代表或代表。预计候选人将能够根据需要拜访IETF社区的专家，以确保ICANN董事会收到最高质量的技术建议。"
    },
    {
      "indent": 0,
      "text": "3. IETF-Nominated RZERC Member Selection Process",
      "section_title": true,
      "zh-CHS": "3. IETF指定RZERC成员选择过程"
    },
    {
      "indent": 0,
      "text": "3.1. Term Length",
      "section_title": true,
      "zh-CHS": "3.1. 期限"
    },
    {
      "indent": 3,
      "text": "The IETF appointment to the RZERC will serve a one-year term. This appointment can be renewed for up to three additional one-year terms.",
      "zh-CHS": "IETF对RZERC的任命将为期一年。此任命最多可延长三个额外的一年任期。"
    },
    {
      "indent": 3,
      "text": "In cases when the incumbent is willing to serve for an additional term and has not yet exceeded the term limits described above, the IAB may ask the IETF community for feedback on the incumbent to find out whether it is necessary to run a full selection process. If the IAB determines that it is not necessary to run a full selection process, the incumbent may be reappointed by the IAB for another year.",
      "zh-CHS": "如果任职者愿意继续任职，且尚未超过上述任期限制，IAB可要求IETF社区对任职者进行反馈，以确定是否有必要运行完整的选拔流程。如果IAB确定无需运行完整的甄选流程，则IAB可能会再次任命任职者一年。"
    },
    {
      "indent": 0,
      "text": "3.2. Nominations and Eligibility",
      "section_title": true,
      "zh-CHS": "3.2. 提名和资格"
    },
    {
      "indent": 3,
      "text": "Except in cases when the IAB has decided to reappoint the incumbent, each year, the IAB will make a public call for nominations on the IETF Announce <ietf-announce@ietf.org> mailing list. The public call will specify the manner by which nominations will be accepted and the means by which the list of nominees will be published. The call for nominations will also include the expected workload for the position, as provided by the current IETF-appointed RZERC member.",
      "zh-CHS": "除IAB决定重新任命现任者的情况外，IAB每年都会在IETF上公开呼吁提名-announce@ietf.org>邮件列表。公众电话将说明接受提名的方式以及公布提名名单的方式。提名要求还将包括该职位的预期工作量，由IETF任命的RZERC现任成员提供。"
    },
    {
      "indent": 3,
      "text": "Self-nominations are permitted. Along with the name and contact information for each candidate, details about the candidate's background and qualifications for the position should be attached to the nomination. All IETF participants are eligible for nomination. While IETF NomCom members, IAB members, IAOC members, and IESG members are eligible, the IAB will balance time constraints and potential conflicts of interest from those members in its consideration of nominees.",
      "zh-CHS": "允许自我提名。提名书应附上候选人的姓名和联系方式以及候选人的背景和任职资格的详细信息。所有IETF参与者都有资格获得提名。虽然IETF NomCom成员、IAB成员、IAOC成员和IESG成员符合资格，但IAB将在考虑被提名人时平衡这些成员的时间限制和潜在利益冲突。"
    },
    {
      "indent": 3,
      "text": "IAB members who accept a nomination will recuse themselves from selection discussions.",
      "zh-CHS": "接受提名的IAB成员将回避选择讨论。"
    },
    {
      "indent": 0,
      "text": "3.3. Selection",
      "section_title": true,
      "zh-CHS": "3.3. 选择"
    },
    {
      "indent": 3,
      "text": "The IAB will publish the list of nominated persons, review the material, and make a selection.",
      "zh-CHS": "IAB将公布提名人员名单，审查材料，并进行选择。"
    },
    {
      "indent": 3,
      "text": "The IAB will consider potential conflicts with a position on the ICANN RZERC and any other ICANN committees supported by nominated candidates.",
      "zh-CHS": "IAB将考虑与ICANN RRACC和任何其他被提名候选人支持的ICANN委员会的潜在冲突。"
    },
    {
      "indent": 0,
      "text": "3.4. Timeframe",
      "section_title": true,
      "zh-CHS": "3.4. 时间框架"
    },
    {
      "indent": 3,
      "text": "The IAB expects to seat new RZERC members in time for ICANN's annual general meeting in Q4 of each year. Basic timeframe requirements for the IETF process are as follows:",
      "zh-CHS": "IAB预计将在ICANN每年第4季度的年度股东大会上及时选出新的RZERC成员。IETF过程的基本时间框架要求如下："
    },
    {
      "indent": 3,
      "text": "o 4-6 weeks for solicitation of nominations or review of incumbent",
      "zh-CHS": "o 4-6周，用于征求提名或审查在职人员"
    },
    {
      "indent": 3,
      "text": "o 4-6 weeks for review of nominees, deliberation, and selection",
      "zh-CHS": "o 4-6周用于审查提名人、审议和选择"
    },
    {
      "indent": 3,
      "text": "In Q2 of each year, the IAB will announce the specific dates for the RZERC selection process for that year (taking into account the particular dates of IETF and ICANN meetings, etc.) following the guidelines above.",
      "zh-CHS": "在每年的第二季度，IAB将根据上述指南宣布当年RZERC选择过程的具体日期（考虑IETF和ICANN会议的特定日期等）。"
    },
    {
      "indent": 0,
      "text": "3.5. Mid-term Vacancies",
      "section_title": true,
      "zh-CHS": "3.5. 中期空缺"
    },
    {
      "indent": 3,
      "text": "This document describes the process for the general, annual appointment of RZERC members to fill the seats of members whose terms are ending. However, if an IETF-appointed member of the RZERC is unable to serve his or her full term, the IAB may, at its discretion, immediately select a replacement to serve the remainder of the term using the interim process defined in Section 3.5.1. If the IAB does not invoke the interim process, the next annual selection process will fill the vacancy.",
      "zh-CHS": "本文件描述了RZERC成员的一般年度任命流程，以填补任期即将结束的成员席位。但是，如果IETF任命的RZERC成员无法履行其全部任期，IAB可自行决定立即选择替代者，使用第3.5.1节规定的临时程序履行剩余任期。如果IAB不调用临时流程，则下一年度甄选流程将填补空缺。"
    },
    {
      "indent": 0,
      "text": "3.5.1. Interim Appointment Process",
      "section_title": true,
      "zh-CHS": "3.5.1. 临时任命程序"
    },
    {
      "indent": 3,
      "text": "If the IAB elects to fill the mid-term vacancy before the next annual selection, a separate timeline will be announced and the rest of the process described in this document will be followed.",
      "zh-CHS": "如果IAB选择在下一次年度遴选之前填补中期空缺，则将宣布一个单独的时间表，并遵循本文件中描述的其余流程。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document does not require any IANA actions.",
      "zh-CHS": "本文件不要求IANA采取任何行动。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not describe any technical protocols and has no implications for network security.",
      "zh-CHS": "本文件不描述任何技术协议，也不涉及网络安全。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "zh-CHS": "6. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RZERC-Charter] ICANN, \"Root Zone Evolution Review Committee (RZERC) Charter\", August 2016, <https://www.icann.org/en/system/files/files/ revised-rzerc-charter-08aug16-en.pdf>.",
      "zh-CHS": "[RZERC章程]ICANN，“根区演化审查委员会（RZERC）章程”，2016年8月<https://www.icann.org/en/system/files/files/ 修订版-rzerc-charter-08aug16-en.pdf>。"
    },
    {
      "indent": 0,
      "text": "IAB Members at the Time of Approval",
      "zh-CHS": "批准时的IAB成员"
    },
    {
      "indent": 3,
      "text": "Jari Arkko Ralph Droms Ted Hardie Joe Hildebrand Russ Housley Lee Howard Erik Nordmark Robert Sparks Andrew Sullivan Dave Thaler Martin Thomson Brian Trammell Suzanne Woolf",
      "zh-CHS": "贾里·阿克科·拉尔夫·德罗姆斯·泰德·哈迪·乔·希尔德布兰德·罗斯·霍斯利·李·霍华德·埃里克·诺德马克·罗伯特·斯帕克斯·安德鲁·沙利文·戴夫·泰勒·马丁·汤姆森·布莱恩·特拉梅尔·苏珊娜·伍尔夫"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Cindy Morgan AMS",
      "zh-CHS": "辛迪摩根医疗辅助队"
    },
    {
      "indent": 3,
      "text": "Email: cmorgan@amsl.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}