{
  "title": {
    "text": "RFC 8140: The Arte of ASCII: Or, An True and Accurate Representation of an Menagerie of Thynges Fabulous and Wonderful in Ye Forme of Character",
    "zh-CHS": "RFC 8140"
  },
  "number": 8140,
  "created_at": "2021-10-28 20:54:19.212849+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                         A. Farrel\nRequest for Comments: 8140                            Old Dog Consulting\nCategory: Informational                                     1 April 2017\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": " The Arte of ASCII: Or, An True and Accurate Representation of an Menagerie of Thynges Fabulous and Wonderful in Ye Forme of Character",
      "zh-CHS": "ASCII的艺术：或者说，真实而准确地表现了塞因格斯动物园的神话般的精彩"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Ever since Gutenberg discovered and patented ASCII and the corresponding \"Courier New\" font with its now-famous \"ten\" point size, artisans and artificers have striven to represent their views of the world in print.",
      "zh-CHS": "自从古腾堡发现并申请了ASCII和相应的“Courier New”字体及其现在著名的“十”字号以来，工匠和工匠一直努力在印刷品中表达他们对世界的看法。"
    },
    {
      "indent": 3,
      "text": "Similarly, starting from Darwin's discovery of the hippogriff and his subsequent registration of the creature as an International Trade Mark, men (and some women) have struggled to catalog the fabulous variety that is called \"nature\".",
      "zh-CHS": "类似地，从达尔文发现河马以及随后将其注册为国际商标开始，男性（和一些女性）一直在努力为这种被称为“自然”的神奇物种分类。"
    },
    {
      "indent": 3,
      "text": "This document supplies a number of representations of all manner of things (both elemental and hypothetical) supplied by some of our best collectors of curios and delivered in a manner that may well be reused by the cunning document author.",
      "zh-CHS": "本文件提供了由我们一些最优秀的古玩收藏家提供的各种物品（包括基本物品和假设物品）的大量表示，并以狡猾的文件作者可以重复使用的方式提供。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "zh-CHS": "这是对RFC系列的贡献，独立于任何其他RFC流。RFC编辑器已选择自行发布此文档，并且未声明其对实现或部署的价值。RFC编辑批准发布的文件不适用于任何级别的互联网标准；见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8140.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc8140."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2017 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Beasts of the Land  . . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  The Troll . . . . . . . . . . . . . . . . . . . . . . . .   3\n  2.2.  The Unicorn Rampant . . . . . . . . . . . . . . . . . . .   4\n3.  Creatures of the Deep . . . . . . . . . . . . . . . . . . . .   5\n  3.1.  The Loch Ness Monster . . . . . . . . . . . . . . . . . .   5\n  3.2.  The Marlynne or Sword Fishe . . . . . . . . . . . . . . .   6\n4.  Spirits of the Air  . . . . . . . . . . . . . . . . . . . . .   7\n  4.1.  Ze Vompyre  . . . . . . . . . . . . . . . . . . . . . . .   7\n  4.2.  Avian Carriers  . . . . . . . . . . . . . . . . . . . . .   8\n5.  Man-Made Structures . . . . . . . . . . . . . . . . . . . . .   9\n  5.1.  Bauhaus . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  5.2.  The Gingerbread House . . . . . . . . . . . . . . . . . .  10\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  11\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n  7.1.  A Private Key . . . . . . . . . . . . . . . . . . . . . .  11\n  7.2.  A Security Mechanism  . . . . . . . . . . . . . . . . . .  12\n  7.3.  Backdoors . . . . . . . . . . . . . . . . . . . . . . . .  13\n8.  Manageability Considerations  . . . . . . . . . . . . . . . .  14\n9.  Morality Considerations . . . . . . . . . . . . . . . . . . .  14\n  9.1.  Likelihood of Misuse by the Depraved  . . . . . . . . . .  14\n  9.2.  Likelihood of Misuse by the Misguided . . . . . . . . . .  15\n  9.3.  Likelihood of Misuse by Corporations  . . . . . . . . . .  15\n  9.4.  Oversight Facilities  . . . . . . . . . . . . . . . . . .  15\n  9.5.  Other Ways of Doing Things  . . . . . . . . . . . . . . .  15\n  9.6.  Concern for Wildlife  . . . . . . . . . . . . . . . . . .  15\n10. References That May Be Informative to Those Who Know How To\n    Read Them . . . . . . . . . . . . . . . . . . . . . . . . . .  15\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  16\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .  16",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Once upon a time, in a land far, far away, where princes were available to those who knew how to kiss, and frogs could be picked up by the handful and were sold in brown paper bags at the shop on the corner of your street, there was an impish discovery made by the appropriately named Johannes Gensfleisch zur Laden zum Gutenberg. His name, it turned out, was coincidentally fortuitous for when he uncovered the Gutenberg Press he was able to claim it as his own.",
      "zh-CHS": "曾几何时，在一个遥远的地方，王子们可以与懂得接吻的人接触，青蛙可以被一把抓起，装在棕色纸袋里在你街道拐角的商店里出售。在那里，有一个顽皮的发现，这个发现是由适当命名的约翰·根斯弗莱什·祖尔·拉丹·祖姆·古腾堡发现的。事实证明，他的名字是巧合的，因为当他揭开古腾堡出版社的面纱时，他能够声称它是他自己的。"
    },
    {
      "indent": 3,
      "text": "Amongst Gutenberg's better known discoveries were the ten point font, the Courier New Font (which he is supposed to have found growing in a hedgerow close to his cottage), and the ASCII character set. All of these have been embraced as comforting and warm blankets by the engineers of the IETF as they embark on expeditions to plot the desolated wastes of the Internet.",
      "zh-CHS": "Gutenberg更著名的发现包括十点字体、Courier新字体（他应该是在他小屋附近的树篱中发现的）和ASCII字符集。当IETF的工程师们开始探索互联网荒芜的荒芜之地时，所有这些都被他们视为舒适温暖的毯子。"
    },
    {
      "indent": 3,
      "text": "Although the RFC Editor has recently dragged the IETF kicking and screaming into the twentieth century [RFC7990] [RFC7996], there is a yearning among all right-thinking Internet architects to \"keep it simple\" and to return to the olden days when pigs could be given thrust without anyone taking undue offence [RFC1925]. This document attempts to address that yearning by demonstrating the full wonder of the natural world in vivid two-dimensional representation and a colour palette that would put even the august L. S. Lowry to shame.",
      "zh-CHS": "尽管RFC编辑最近将IETF“踢”和“尖叫”拖到了二十世纪[RFC7990][RFC7996]，但所有有思想的互联网架构师都渴望“保持简单”，并回到过去的时代，那时猪可以被猛推而没有任何人受到不正当的冒犯[RFC1925]。这篇文章试图通过生动的二维表现和一种连庄严的L.S.Lowry都会感到羞愧的调色板来展示自然界的全部奇迹，以此来表达这种渴望。"
    },
    {
      "indent": 3,
      "text": "Readers of this document are encouraged to be familiar.",
      "zh-CHS": "鼓励本文档的读者熟悉本文档。"
    },
    {
      "indent": 0,
      "text": "2. Beasts of the Land",
      "section_title": true,
      "zh-CHS": "2. 野兽"
    },
    {
      "indent": 3,
      "text": "\"Many and wonderful are the beasts of the land\" wrote the poet. And he was right in some ways.",
      "zh-CHS": "诗人写道：“这片土地上的野兽多而奇妙。”。他在某些方面是对的。"
    },
    {
      "indent": 3,
      "text": "Of these many beasts, the most fabulous are the Troll and the Unicorn. Here are reproduced representations of sightings in the field.",
      "zh-CHS": "在这些动物中，最令人难以置信的是巨魔和独角兽。这里是现场目击的再现。"
    },
    {
      "indent": 0,
      "text": "2.1. The Troll",
      "section_title": true,
      "zh-CHS": "2.1. 巨魔"
    },
    {
      "indent": 3,
      "text": "The troll is an evil beast that frequently appears around the IETF. It feeds alternately on passing goats and cookies, but it prefers above all things the taste of distress, especially that expressed in email.",
      "zh-CHS": "巨魔是一种邪恶的野兽，经常出现在IETF中。它交替地吃过往的山羊和饼干，但它最喜欢的是痛苦的味道，尤其是在电子邮件中表达的痛苦。"
    },
    {
      "indent": 3,
      "text": "Trolls should be shunned and never fed. Stories about them being sensitive to water or light are unsubstantiated, but it may be true that they can be pacified with alcohol.",
      "zh-CHS": "巨魔应该被避开，永远不要进食。关于他们对水或光敏感的故事是没有事实根据的，但他们确实可以用酒精来安抚。"
    },
    {
      "indent": 3,
      "text": "The chief weapons of a Troll are its sharp tongue, its blunt phrasing, and its total disregard for doing useful work.",
      "zh-CHS": "巨魔的主要武器是尖利的舌头、直率的措辞和对有用工作的完全漠视。"
    },
    {
      "indent": 16,
      "text": "                            .:\\::::/:.\n+-------------------+      .:\\:\\::/:/:.\n|   PLEASE DO NOT   |     :.:\\:\\::/:/:.:\n|  FEED THE TROLLS  |    :=.`  -  -  '.=:\n|                   |    `=(\\  0  0  /)='\n|  Thank you,       |       (  (__)  )\n|   The Management  |     .--`-vvvv-'--\n+-------------------+     |            |\n         | |             /  /(      )\\  \\\n         | |            /  / (  /\\  ) \\  \\\n         | |           (  | /  /  \\  \\ |  )\n         | |            ^^ (  (    )  ) ^^\n         | |              __\\  \\  /  /__\n         | |            `(______||______)'\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 1: The Troll at Feeding Time",
      "zh-CHS": "图1：喂食时的巨魔"
    },
    {
      "indent": 0,
      "text": "2.2. The Unicorn Rampant",
      "section_title": true,
      "zh-CHS": "2.2. 独角兽猖獗"
    },
    {
      "indent": 3,
      "text": "Many things in the IETF rely on majick. Without pixie dust or other artful contributions from the world of faerie, it is unlikely that the Internet would work at all.",
      "zh-CHS": "IETF中的许多内容都依赖于majick。如果没有精灵之尘或来自仙境的其他巧妙贡献，互联网根本不可能起作用。"
    },
    {
      "indent": 3,
      "text": "Software Defined Networking (SDN) is a concept whereby complex and devious networks may be subjugated to the will of a sorcerer (or an opensourcerer as they are sometimes know). Fundamental to the body of an SDN is the Path Computation Element (PCE) [RFC7399]. Essential to the proper function of the PCE is the Unicorn that roams the dark wood of the Traffic Engineering Database, rearing up and spearing unwitting paths on the horn of its intellect.",
      "zh-CHS": "软件定义的网络（SDN）是一个概念，通过这个概念，复杂和迂回的网络可能会受制于巫师（或者有时他们知道的开源者）的意志。SDN主体的基础是路径计算元素（PCE）[RFC7399]。对于PCE的正确功能至关重要的是独角兽，它在交通工程数据库的黑树林中漫游，用自己的智慧竖立和开辟不知情的道路。"
    },
    {
      "indent": 3,
      "text": "Unicorns, it is claimed, can only be captured by the pure of heart who have never operated a real network.",
      "zh-CHS": "据称，独角兽只能被从未运营过真正网络的纯真心灵捕获。"
    },
    {
      "indent": 21,
      "text": "    .\n    |\\\n     \\\\______\n     /    \\  \\_\n    /  O   \\   \\\n   /  __     \\  |\n  (__/  /      \\|\n       /         \\____\n   __--               \\__\n --___/                  \\   ___\n( (  __----               |--    \\\n || (     \\___     /      /--.    \\\n  -\\_\\        \\___(      /   /  __/\n    \\_\\           \\_     \\_ |  /\n                  _/\\__   _) \\_\\\n                 /  __/ _/\n                |__/  _/\n               /__\\__/\n                  /__|",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Figure 2: A Unicorn in Rampant State",
      "zh-CHS": "图2：处于猖獗状态的独角兽"
    },
    {
      "indent": 0,
      "text": "3. Creatures of the Deep",
      "section_title": true,
      "zh-CHS": "3. 深海生物"
    },
    {
      "indent": 3,
      "text": "\"Not all that crawls upon the land can rival the creatures of the deep,\" said the great ethnographer and philanderer. And how often it has been observed that he was both wise and drunk.",
      "zh-CHS": "“不是所有在陆地上爬行的动物都能与深海生物相匹敌，”这位伟大的民族志学家和风流学家说。人们经常观察到他既聪明又喝醉。"
    },
    {
      "indent": 3,
      "text": "The things that slide below the surface of the water remain hidden to most of us, a mystery no less than the ways of the elliptic curve. Most elusive of all is the Loch Ness Monster; most peculiar is the Marlynne.",
      "zh-CHS": "在水面下滑动的东西对我们大多数人来说仍然是隐藏的，这是一个不亚于椭圆曲线的奥秘。最难以捉摸的是尼斯湖水怪；最奇特的是玛琳。"
    },
    {
      "indent": 0,
      "text": "3.1. The Loch Ness Monster",
      "section_title": true,
      "zh-CHS": "3.1. 尼斯湖水怪"
    },
    {
      "indent": 3,
      "text": "So rare are the sightings of this beast that we must count ourselves lucky to have presented here a very real etching collected at great expense from a native Scott.",
      "zh-CHS": "看到这种野兽是如此罕见，以至于我们必须庆幸自己在这里展示了一幅非常真实的蚀刻画，这幅蚀刻画是从一位当地人斯科特那里花费巨资收集的。"
    },
    {
      "indent": 3,
      "text": "The Loch Ness Monster appears most often on dark nights or in heavy storms when the only thing that parts the fog is the rain that lashes your face. Thus, the creature is most often visible when it can be least well seen. In this respect, it is most like clear text in an RFC, which is most easy to read and comprehend when it is least written.",
      "zh-CHS": "尼斯湖水怪最常出现在黑夜或暴风雨中，因为只有雨水才能驱散浓雾。因此，这种生物在最不显眼的时候最容易被看见。在这方面，它最像RFC中的明文，当它写得最少时，最容易阅读和理解。"
    },
    {
      "indent": 30,
      "text": ".",
      "zh-CHS": "."
    },
    {
      "indent": 18,
      "text": "_______________________________________",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 30,
      "text": ".",
      "zh-CHS": "."
    },
    {
      "indent": 15,
      "text": "Figure 3: The Loch Ness Monster On a Calm Day",
      "zh-CHS": "图3：平静日子里的尼斯湖水怪"
    },
    {
      "indent": 0,
      "text": "3.2. The Marlynne or Sword Fishe",
      "section_title": true,
      "zh-CHS": "3.2. 马林鱼或剑鱼"
    },
    {
      "indent": 3,
      "text": "Getting to the point is not always something that is practised in the IETF. But there is one beast that Roams the Deeps and Never Sleeps: The Marlynne, when hauled from its roost by an unsuspecting fisherman for delivery to his equally unsuspecting fishwife has often been mistaken for a very angry mermaid [MTFTW]. Do not mistake its sharp wit for a valid argument.",
      "zh-CHS": "在IETF中，并非总是要做到这一点。但有一种野兽在深海中游荡，从不睡觉：当一个毫无戒心的渔夫把马林鱼从栖息处拖出来交给他同样毫无戒心的渔夫时，它常常被误认为是非常愤怒的美人鱼[MTFTW]。不要把它敏锐的机智误认为是有效的论点。"
    },
    {
      "indent": 3,
      "text": "As can be seen from the rendition here presented, the Marlynne is happy in its work.",
      "zh-CHS": "从这里呈现的表演中可以看出，Marlynne对自己的作品很满意。"
    },
    {
      "indent": 25,
      "text": "        __\n        \\ \\\n--     __) \\_____\n\\ \\   /          \\\n \\ \\./          o \\\n / ..            __=====---\n/ /  \\           \\\n--    ------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Figure 4: The Sword Fishe - An Happy Fishe",
      "zh-CHS": "图4：剑鱼-快乐的鱼"
    },
    {
      "indent": 0,
      "text": "4. Spirits of the Air",
      "section_title": true,
      "zh-CHS": "4. 空气中的精灵"
    },
    {
      "indent": 3,
      "text": "Cloud is the latest buzz for the trendy hipster, active in networking. But be careful not to let your feet get off the crowd lest your head become implanted somewhere it shouldn't be.",
      "zh-CHS": "对于活跃在网络中的时尚潮人来说，云是最新的热门话题。但要小心，不要让你的脚离开人群，以免你的头被植入不该植入的地方。"
    },
    {
      "indent": 0,
      "text": "4.1. Ze Vompyre",
      "section_title": true,
      "zh-CHS": "4.1. 泽冯皮雷"
    },
    {
      "indent": 3,
      "text": "Most afeared of all of the creatures is surely the vampire, for it will drain the blood of any good idea until it withers or is completely changed into a problem statement I-D. More scary than the dreaded Old Timer that will suck the air from a room with its hated Process Discussion. More frightening than the RFC 2119 Usage Debate of Doom.",
      "zh-CHS": "所有生物中最害怕的肯定是吸血鬼，因为它会吸干任何好主意的血液，直到它枯萎或完全变成问题陈述的身份证。比可怕的老家伙更可怕，他会用讨厌的过程讨论从房间里吸空气。比RFC2119使用厄运的辩论更可怕。"
    },
    {
      "indent": 3,
      "text": "The vampire bat is sometimes mistaken for its third cousin on its mother's side, the fruitbat. That beast is equally evil and will remove whole plates of fruit from refreshment tables, leaving only celery sticks for latecomers.",
      "zh-CHS": "吸血蝙蝠有时被误认为是它母亲的第三个表亲，果蝠。这只野兽同样邪恶，它会从茶点桌上拿走整盘水果，只给迟到的人留下芹菜条。"
    },
    {
      "indent": 3,
      "text": "Data that is once nibbled by a vampire may find that some of its most precious bits become corrupted and drop off. Sure protection may only be achieved by placing garlic in the metadata or overhead of a packet.",
      "zh-CHS": "曾经被吸血鬼蚕食过的数据可能会发现它最珍贵的部分被破坏掉了。当然，只有将大蒜放入元数据或数据包的开销中，才能实现保护。"
    },
    {
      "indent": 14,
      "text": "                   /\\     /\\\n                  /  \\---/  \\\n      /\\    /\\   |           |   /\\    /\\\n     /  \\  /  \\  |   -   -   |  /  \\  /  \\\n    /    \\/    \\/   (.) (.)   \\/    \\/    \\\n   /                 -   -                 \\\n  /                  _ _ _                  \\\n /    ------\\         V V         /------    \\\n/    /       \\                   /       \\    \\\n-----         \\                 /         -----\n               \\               /\n                \\             /\n                 |           |\n                 |     ^     |\n                  \\   / \\   /\n                   vvv   vvv",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 5: The Cursed Vampire or Fruitbat",
      "zh-CHS": "图5：被诅咒的吸血鬼或果蝠"
    },
    {
      "indent": 21,
      "text": "     _______________________\n    |  ___________________  |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |                   | |\n    | |___________________| |\n    |_______________________|\n ___(_______________________)___\n(_______________________________)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Figure 6: A Fine Mirror Showing The Reflection of a Vampire Bat",
      "zh-CHS": "图6：一个精致的镜子，显示吸血蝙蝠的倒影"
    },
    {
      "indent": 0,
      "text": "4.2. Avian Carriers",
      "section_title": true,
      "zh-CHS": "4.2. 鸟类携带者"
    },
    {
      "indent": 3,
      "text": "More famous than the Thrusted Pig [RFC1925] and more celebrated than the Infinite Monkey [RFC2795] is the Avian Carrier [RFC1149].",
      "zh-CHS": "比插入式猪[RFC1925]更著名，比无限猴子[RFC2795]更著名的是鸟类载体[RFC1149]。"
    },
    {
      "indent": 3,
      "text": "This scavenger of the sky comes in a variety of bright colors, perhaps an evolutionary trait enabling a hunter to distinguish the carriers and drop those it considers weakest, or maybe acting as a warning to predatory Buphyres so that they do not attack the carriers deemed most important by the flock.",
      "zh-CHS": "天空中的这种食腐动物有多种鲜艳的颜色，也许这是一种进化特征，使猎人能够区分携带者并丢弃它认为最弱的携带者，或者可能是对食肉动物的警告，这样它们就不会攻击羊群认为最重要的携带者。"
    },
    {
      "indent": 28,
      "text": "_   _           _   _\n \\o/             \\o/\n     /\\o/\\ /\\o/\\",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 30,
      "text": "/\\o/\\       /\\o/\\",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 35,
      "text": "/\\o/\\ _ _ \\o/",
      "zh-CHS": "/\\o/\\\\uuo\\uo/"
    },
    {
      "indent": 21,
      "text": "      ---------    ---------\n     |       | |  |       | |\n ---------   | |------    | |---\n|       | |----     | |-----  | |\n|       | | |       | |---    | |\n ---------   ---------  | |-----\n                |       | |\n                 ---------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Figure 7: A Flock of Avian Carriers with a Nest of Packets",
      "zh-CHS": "图7：一群带有一窝小包的鸟类携带者"
    },
    {
      "indent": 0,
      "text": "5. Man-Made Structures",
      "section_title": true,
      "zh-CHS": "5. 人造结构"
    },
    {
      "indent": 3,
      "text": "\"Man has become God and shapes the world at will\" said the slightly disgruntled theologian. And who would dare argue this point that wanted to escape the conversation in time to get home for dinner?",
      "zh-CHS": "这位稍有不满的神学家说：“人已经成为上帝，随意塑造世界。”。谁敢说这一点是为了及时逃离谈话，回家吃晚饭？"
    },
    {
      "indent": 0,
      "text": "5.1. Bauhaus",
      "section_title": true,
      "zh-CHS": "5.1. 包豪斯"
    },
    {
      "indent": 3,
      "text": "When Laura Ingalls Wilder was just starting out on her cover designs, she agonized about what shade her little house should be. She narrowly avoided madness thanks to the timely intervention of Professor Kandinsky, a prominent Moscow lawyer.",
      "zh-CHS": "当劳拉·英格尔·怀尔德刚刚开始她的封面设计时，她为自己的小房子应该有多大的阴影而苦恼。多亏了莫斯科著名律师康定斯基教授的及时介入，她才勉强避免了疯狂。"
    },
    {
      "indent": 3,
      "text": "It has often been asserted that new art forms are needed to allow the inclusion of colors in IETF publications. Figure 8 clearly demonstrates this to be a fallacy.",
      "zh-CHS": "人们经常断言，需要新的艺术形式来允许在IETF出版物中包含颜色。图8清楚地表明这是一个谬论。"
    },
    {
      "indent": 26,
      "text": " ---------            /\\\n|         |          /  \\\n|         |         /    \\\n|   Red   |        /      \\\n|         |       / Yellow \\\n|         |      /          \\\n ---------       ------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "      __----__\n    .'        `.\n   /            \\\n  /              \\\n /                \\\n|                  |\n|       Blue       |\n|                  |\n \\                /\n  \\              /\n   \\            /\n    `.__    __.'\n        ----",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 8: The Fundaments of Bauhaus",
      "zh-CHS": "图8：包豪斯的基本原理"
    },
    {
      "indent": 0,
      "text": "5.2. The Gingerbread House",
      "section_title": true,
      "zh-CHS": "5.2. 姜饼屋"
    },
    {
      "indent": 3,
      "text": "Many stories have been told of how young Hans and his sister, the equally young Gretha, came to be abandoned in the woods [TFTW]. However, it may have been Herr Grimm and his eponymous brother, Herr Grimm, who first recorded the existence of a house made of gingerbread (with all the trimmings).",
      "zh-CHS": "许多故事都讲述了年轻的汉斯和他的妹妹，同样年轻的格雷莎，是如何被遗弃在树林里的。然而，可能是格里姆先生和他同名的兄弟格里姆先生第一次记录了姜饼（带所有装饰物）房子的存在。"
    },
    {
      "indent": 3,
      "text": "Note that attempts to perform packet tracing using breadcrumbs will usually fail owing to avian carriers who like to keep the forest floor tidy (Section 4.2.",
      "zh-CHS": "注意，由于鸟类携带者喜欢保持森林地面整洁（第4.2节），使用面包屑进行数据包跟踪的尝试通常会失败。"
    },
    {
      "indent": 28,
      "text": "                (  )\n               ( )\n        /^\\   ()\n       /   \\  -\n      /     \\| |\n     /       \\ |\n    /         \\|\n   /           \\\n  /             \\\n /               \\\n/-^v^v^v^v^v^v^v^-\\\n |               |\n |  ---     ---  |\n | | | |   | | | |\n | |-+-|   |-+-| |\n | | | |   | | | |\n |  ---     ---  |\n |_              |\n   )        ---  |\n    )      |   | |\n   )       |o  | |\n  )        |   | |\n |_______ _|...|_|\n            \\  \\\n             \\  \\\n              \\  \\\n               \\  \\",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Figure 9: A Deserted and Partially Nibbled (or Byted) Gingerbread House",
      "zh-CHS": "图9：一座废弃的、部分被蚕食的姜饼屋"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA might consider introducing a registry for Figure 8 to track the assignment of colours to shapes.",
      "zh-CHS": "IANA可能考虑引入图8的注册表来跟踪颜色对形状的分配。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Stone walls do not a prison make, nor iron bars a cage: but they do help. And with this in mind, our elders encourage us always to be mindful of the security and privacy of our eternal souls.",
      "zh-CHS": "石墙不是监狱，铁栅栏不是笼子，但它们确实有用。记住这一点，我们的长辈鼓励我们时刻注意我们永恒灵魂的安全和隐私。"
    },
    {
      "indent": 0,
      "text": "7.1. A Private Key",
      "section_title": true,
      "zh-CHS": "7.1. 私钥"
    },
    {
      "indent": 3,
      "text": "Keys that are shared are keys that other people have. If someone else has a key, they will use it. If you have a key, you will probably leave it in the lock or drop it in the street. Hence we conclude that keys are a security vulnerability.",
      "zh-CHS": "共享的密钥是其他人拥有的密钥。如果其他人有钥匙，他们会使用它。如果你有一把钥匙，你可能会把它留在锁里或者掉在街上。因此，我们得出结论，密钥是一个安全漏洞。"
    },
    {
      "indent": 8,
      "text": "    ---\n   / _ \\\n  | / \\ |\n / /   \\ \\\n| |     | -------------------------------------------------\n| |     | ------------------------------------             )\n \\ \\   / /                                    |           |\n  | \\_/ |                                     |    _      |\n   \\   /                                      |  _| |  _  |\n    ---                                       | |   | | | |\n                                              |_|   |_| |_|",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Figure 10: A Security Key",
      "zh-CHS": "图10：安全密钥"
    },
    {
      "indent": 0,
      "text": "7.2. A Security Mechanism",
      "section_title": true,
      "zh-CHS": "7.2. 安全机制"
    },
    {
      "indent": 3,
      "text": "Locks, on the other hand, are good. They can become rusted solid, meaning that no one can open them. What could be more secure?",
      "zh-CHS": "另一方面，锁是好的。它们可能会变成生锈的固体，这意味着没有人能打开它们。还有什么比这更安全呢？"
    },
    {
      "indent": 3,
      "text": "And remember, a smile is the key that fits the lock to everybody's heart. So don't trust people who smile.",
      "zh-CHS": "记住，微笑是打开每个人心扉的钥匙。所以不要相信微笑的人。"
    },
    {
      "indent": 27,
      "text": "        _____\n       /     \\\n      /  ___  \\\n     /  /   \\  \\\n    |  /     \\  |\n    | |       | |\n    | |       | |\n    | |       | |\n    | |       | |\n    | |       | |\n    | |       | |\n    | |       | |\n -------------------\n|                   |\n|                   |\n|                   |\n|         _         |\n|        / \\        |\n|       /   \\       |\n|       \\   /       |\n|        | |        |\n|        | |        |\n|        | |        |\n|        | |        |\n|        | |        |\n|         -         |\n|                   |\n -------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Figure 11: A General Purpose Security Mechanism",
      "zh-CHS": "图11：通用安全机制"
    },
    {
      "indent": 0,
      "text": "7.3. Backdoors",
      "section_title": true,
      "zh-CHS": "7.3. 后门"
    },
    {
      "indent": 3,
      "text": "If you have a door, you are admitting (sic) a weakness. A closed door invites opening, and an open door invites ingress. Security lies in bricks and mortar.",
      "zh-CHS": "如果你有一扇门，你就是在承认一个弱点。一扇关闭的门需要打开，一扇打开的门需要进入。安全在于砖块和灰泥。"
    },
    {
      "indent": 28,
      "text": "    ____________\n   /            \\\n  /  __________  \\\n /  /        _/\\  \\\n|  /       _/   \\  |\n| |      _/      | |\n| |     |        | |\n| |     |        | |\n| |     |        | |\n| |     |        | |\n| |     | O      | |\n| |     | .      | |\n| |     |        | |\n| |     |        | |\n| |     |        | |\n| |     |        | |\n| |     |        | |\n| |     |___     | |\n| |         \\____| |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 12: A Backdoor Left Conveniently Open",
      "zh-CHS": "图12：方便打开的后门"
    },
    {
      "indent": 0,
      "text": "8. Manageability Considerations",
      "section_title": true,
      "zh-CHS": "8. 可管理性考虑"
    },
    {
      "indent": 3,
      "text": "Some of the wild beasts depicted in this tome are best confined to a managerie.",
      "zh-CHS": "这本书中描绘的一些野兽最好被关在一个经理的房间里。"
    },
    {
      "indent": 0,
      "text": "9. Morality Considerations",
      "section_title": true,
      "zh-CHS": "9. 道德考虑"
    },
    {
      "indent": 3,
      "text": "In accordance with advice offered in [RFC4041], this section considers the impact of this document on the public morals.",
      "zh-CHS": "根据[RFC4041]中提供的建议，本节考虑了本文件对公共道德的影响。"
    },
    {
      "indent": 3,
      "text": "It is still the view of popular opinion and can be verified by reliable metrics that moral values are declining and that degeneracy is on the rise. One has only to look at the apostasy surrounding the True Use of Language as set forth in RFC 2119 [RFC2119] to know that the populace has become truly debauched.",
      "zh-CHS": "这仍然是流行意见的观点，可以通过可靠的指标来验证，道德价值正在下降，而退化正在上升。人们只要看看RFC2119[RFC2119]中所阐述的语言的真实使用的背道，就会知道民众已经变得真正的堕落。"
    },
    {
      "indent": 0,
      "text": "9.1. Likelihood of Misuse by the Depraved",
      "section_title": true,
      "zh-CHS": "9.1. 被堕落者滥用的可能性"
    },
    {
      "indent": 3,
      "text": "Care must be taken lest ASCII fall into the hands of disreputable characters.",
      "zh-CHS": "必须小心，以免ASCII落入声名狼藉的字符手中。"
    },
    {
      "indent": 0,
      "text": "9.2. Likelihood of Misuse by the Misguided",
      "section_title": true,
      "zh-CHS": "9.2. 被误导者滥用的可能性"
    },
    {
      "indent": 3,
      "text": "We should warn our children against engraving self-portraits in ASCII-art and sharing them with their friends as woodcuts or in other modern media. Recall that a picture, once made, lasts forever.",
      "zh-CHS": "我们应该警告我们的孩子不要用ASCII艺术雕刻自画像，并将其作为木刻或其他现代媒体与朋友分享。回想一下，一幅画，一旦制作完成，将永垂不朽。"
    },
    {
      "indent": 0,
      "text": "9.3. Likelihood of Misuse by Corporations",
      "section_title": true,
      "zh-CHS": "9.3. 公司滥用的可能性"
    },
    {
      "indent": 3,
      "text": "The very idea that someone might patent unicorn DNA is, of course, unthinkable. Large companies only have our best interests at heart.",
      "zh-CHS": "当然，有人可能为独角兽DNA申请专利的想法是不可想象的。大公司只把我们的最大利益放在心上。"
    },
    {
      "indent": 0,
      "text": "9.4. Oversight Facilities",
      "section_title": true,
      "zh-CHS": "9.4. 监督设施"
    },
    {
      "indent": 3,
      "text": "Adequate oversight of all things is performed by the RFC Editor. Who has a higher moral compass or a better sense of directional values?",
      "zh-CHS": "RFC编辑器对所有内容进行充分监督。谁有更高的道德指南针或更好的方向价值观？"
    },
    {
      "indent": 0,
      "text": "9.5. Other Ways of Doing Things",
      "section_title": true,
      "zh-CHS": "9.5. 其他做事方式"
    },
    {
      "indent": 3,
      "text": "Radical and subversive cliques, such as that established by the heretics, Georges Seurat and Paul Signac, may also be represented in ASCII art. However, doing so will, in almost every case, exceed the 72 character width limit used by all right-thinking people and must, therefore, be avoided by all who do not wish to be doomed to spend eternity in a dark corner with only dial-up access.",
      "zh-CHS": "激进的和颠覆性的派系，如由异端人士乔治·修拉和保罗·西纳克建立的派系，也可以用ASCII艺术表现出来。然而，在几乎所有情况下，这样做都会超过所有思维正常的人所使用的72个字符的宽度限制，因此，所有不希望注定要在只有拨号接入的黑暗角落中度过漫长时光的人都必须避免这样做。"
    },
    {
      "indent": 0,
      "text": "9.6. Concern for Wildlife",
      "section_title": true,
      "zh-CHS": "9.6. 关注野生动物"
    },
    {
      "indent": 3,
      "text": "Never was a truer word spoken than when it was said that a duck may be somebody's mother. See also Section 4.2",
      "zh-CHS": "有人说鸭子可能是某人的母亲，这句话再真实不过了。另见第4.2节"
    },
    {
      "indent": 0,
      "text": "10. References That May Be Informative to Those Who Know How To Read Them",
      "zh-CHS": "10. 对那些知道如何阅读的人来说可能是有用的参考资料"
    },
    {
      "indent": 3,
      "text": "[MTFTW] Farrel, A., \"More Tales From The Wood\", 2016.",
      "zh-CHS": "[MTFTW]Farrel，A.，“更多来自森林的故事”，2016年。"
    },
    {
      "indent": 3,
      "text": "[RFC1149] Waitzman, D., \"Standard for the transmission of IP datagrams on avian carriers\", RFC 1149, DOI 10.17487/RFC1149, April 1990, <http://www.rfc-editor.org/info/rfc1149>.",
      "zh-CHS": "[RFC1149]Waitzman，D.，“鸟类载体上IP数据报传输标准”，RFC 1149，DOI 10.17487/RFC1149，1990年4月<http://www.rfc-editor.org/info/rfc1149>."
    },
    {
      "indent": 3,
      "text": "[RFC1925] Callon, R., \"The Twelve Networking Truths\", RFC 1925, DOI 10.17487/RFC1925, April 1996, <http://www.rfc-editor.org/info/rfc1925>.",
      "zh-CHS": "[RFC1925]Callon，R.，“十二个网络真理”，RFC 1925，DOI 10.17487/RFC1925，1996年4月<http://www.rfc-editor.org/info/rfc1925>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<http://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC2795] Christey, S., \"The Infinite Monkey Protocol Suite (IMPS)\", RFC 2795, DOI 10.17487/RFC2795, April 2000, <http://www.rfc-editor.org/info/rfc2795>.",
      "zh-CHS": "[RFC2795]Christey，S.，“无限猴子协议套件（IMPS）”，RFC 2795，DOI 10.17487/RFC2795，2000年4月<http://www.rfc-editor.org/info/rfc2795>."
    },
    {
      "indent": 3,
      "text": "[RFC4041] Farrel, A., \"Requirements for Morality Sections in Routing Area Drafts\", RFC 4041, DOI 10.17487/RFC4041, April 2005, <http://www.rfc-editor.org/info/rfc4041>.",
      "zh-CHS": "[RFC4041]Farrel，A.“路由区域草案中道德部分的要求”，RFC 4041，DOI 10.17487/RFC4041，2005年4月<http://www.rfc-editor.org/info/rfc4041>."
    },
    {
      "indent": 3,
      "text": "[RFC7399] Farrel, A. and D. King, \"Unanswered Questions in the Path Computation Element Architecture\", RFC 7399, DOI 10.17487/RFC7399, October 2014, <http://www.rfc-editor.org/info/rfc7399>.",
      "zh-CHS": "[RFC7399]Farrel，A.和D.King，“路径计算元素架构中未回答的问题”，RFC 7399，DOI 10.17487/RFC7399，2014年10月<http://www.rfc-editor.org/info/rfc7399>."
    },
    {
      "indent": 3,
      "text": "[RFC7990] Flanagan, H., \"RFC Format Framework\", RFC 7990, DOI 10.17487/RFC7990, December 2016, <http://www.rfc-editor.org/info/rfc7990>.",
      "zh-CHS": "[RFC7990]Flanagan，H.，“RFC格式框架”，RFC 7990，DOI 10.17487/RFC7990，2016年12月<http://www.rfc-editor.org/info/rfc7990>."
    },
    {
      "indent": 3,
      "text": "[RFC7996] Brownlee, N., \"SVG Drawings for RFCs: SVG 1.2 RFC\", RFC 7996, DOI 10.17487/RFC7996, December 2016, <http://www.rfc-editor.org/info/rfc7996>.",
      "zh-CHS": "[RFC7996]Brownlee，N.，“RFC的SVG图纸：SVG 1.2 RFC”，RFC 7996，DOI 10.17487/RFC7996，2016年12月<http://www.rfc-editor.org/info/rfc7996>."
    },
    {
      "indent": 3,
      "text": "[TFTW] Farrel, A., \"Tales From The Wood\", 2015.",
      "zh-CHS": "[TFTW]Farrel，A.，“来自森林的故事”，2015年。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "Thanks to Wassily Kandinsky, Martin Luther, and Johannes Gutenberg for their help with this work.",
      "zh-CHS": "感谢瓦西里·康定斯基、马丁·路德和约翰内斯·古腾堡对这项工作的帮助。"
    },
    {
      "indent": 3,
      "text": "L. S. Lowry was not harmed in the production of this document.",
      "zh-CHS": "L.S.Lowry在制作本文件时没有受到伤害。"
    },
    {
      "indent": 3,
      "text": "The work in Section 2.1 is based on an original lithograph by John De Scudder.",
      "zh-CHS": "第2.1节中的作品基于John De Scudder的原始石版画。"
    },
    {
      "indent": 3,
      "text": "Without the very existence of Madame Flanagan, it would not have been possible or necessary to compile this volume.",
      "zh-CHS": "没有弗拉纳根夫人的存在，就不可能也没有必要编纂这本书。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Old Dog Consulting",
      "zh-CHS": "阿德里安·法雷尔老狗咨询公司"
    },
    {
      "indent": 3,
      "text": "Email: adrian@olddog.co.uk",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}