{
  "title": {
    "text": "RFC 8314: Cleartext Considered Obsolete: Use of Transport Layer Security (TLS) for Email Submission and Access",
    "zh-CHS": "RFC 8314"
  },
  "number": 8314,
  "created_at": "2021-10-29 10:14:38.306030+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          K. Moore\nRequest for Comments: 8314                                Windrock, Inc.\nUpdates: 1939, 2595, 3501, 5068, 6186, 6409                    C. Newman\nCategory: Standards Track                                         Oracle\nISSN: 2070-1721                                             January 2018",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Cleartext Considered Obsolete: Use of Transport Layer Security (TLS) for Email Submission and Access",
      "zh-CHS": "被认为过时的明文：使用传输层安全（TLS）提交和访问电子邮件"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This specification outlines current recommendations for the use of Transport Layer Security (TLS) to provide confidentiality of email traffic between a Mail User Agent (MUA) and a Mail Submission Server or Mail Access Server. This document updates RFCs 1939, 2595, 3501, 5068, 6186, and 6409.",
      "zh-CHS": "本规范概述了使用传输层安全性（TLS）在邮件用户代理（MUA）和邮件提交服务器或邮件访问服务器之间提供电子邮件通信保密性的当前建议。本文档更新了RFCs 1939、2595、3501、5068、6186和6409。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 7841第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8314.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问https://www.rfc-editor.org/info/rfc8314."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2018 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(https://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. How This Document Updates Previous RFCs ....................3\n2. Conventions and Terminology Used in This Document ...............4\n3. Implicit TLS ....................................................5\n   3.1. Implicit TLS for POP .......................................5\n   3.2. Implicit TLS for IMAP ......................................5\n   3.3. Implicit TLS for SMTP Submission ...........................6\n   3.4. Implicit TLS Connection Closure for POP, IMAP, and\n        SMTP Submission ............................................7\n4. Use of TLS by Mail Access Servers and Message Submission\n   Servers .........................................................7\n   4.1. Deprecation of Services Using Cleartext and TLS Versions\n        Less Than 1.1 ..............................................8\n   4.2. Mail Server Use of Client Certificate Authentication .......9\n   4.3. Recording TLS Ciphersuite in \"Received\" Header Field .......9\n   4.4. TLS Server Certificate Requirements .......................10\n   4.5. Recommended DNS Records for Mail Protocol Servers .........11\n        4.5.1. MX Records .........................................11\n        4.5.2. SRV Records ........................................11\n        4.5.3. DNSSEC .............................................11\n        4.5.4. TLSA Records .......................................11\n   4.6. Changes to Internet-Facing Servers ........................11\n5. Use of TLS by Mail User Agents .................................12\n   5.1. Use of SRV Records in Establishing Configuration ..........13\n   5.2. Minimum Confidentiality Level .............................14\n   5.3. Certificate Validation ....................................15\n   5.4. Certificate Pinning .......................................15\n   5.5. Client Certificate Authentication .........................16\n6. Considerations Related to Antivirus/Antispam Software\n   and Services ...................................................17\n7. IANA Considerations ............................................17\n   7.1. POP3S Port Registration Update ............................17\n   7.2. IMAPS Port Registration Update ............................18\n   7.3. Submissions Port Registration .............................18\n   7.4. Additional Registered Clauses for \"Received\" Fields .......19\n8. Security Considerations ........................................19\n9. References .....................................................20\n   9.1. Normative References ......................................20\n   9.2. Informative References ....................................22\nAppendix A. Design Considerations .................................24\nAcknowledgements ..................................................26\nAuthors' Addresses ................................................26",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Software that provides email service via the Internet Message Access Protocol (IMAP) [RFC3501], the Post Office Protocol (POP) [RFC1939], and/or Simple Mail Transfer Protocol (SMTP) Submission [RFC6409] usually has Transport Layer Security (TLS) [RFC5246] support but often does not use it in a way that maximizes end-user confidentiality. This specification describes current recommendations for the use of TLS in interactions between Mail User Agents (MUAs) and Mail Access Servers, and also between MUAs and Mail Submission Servers.",
      "zh-CHS": "通过互联网消息访问协议（IMAP）[RFC3501]、邮局协议（POP）[RFC1939]和/或简单邮件传输协议（SMTP）提交[RFC6409]提供电子邮件服务的软件通常具有传输层安全性（TLS）[RFC5246]支持，但通常不会以最大化最终用户机密性的方式使用它。本规范描述了在邮件用户代理（MUA）和邮件访问服务器之间以及MUA和邮件提交服务器之间的交互中使用TLS的当前建议。"
    },
    {
      "indent": 3,
      "text": "In brief, this memo now recommends that:",
      "zh-CHS": "简而言之，本备忘录建议："
    },
    {
      "indent": 3,
      "text": "o TLS version 1.2 or greater be used for all traffic between MUAs and Mail Submission Servers, and also between MUAs and Mail Access Servers.",
      "zh-CHS": "o TLS版本1.2或更高版本可用于MUAs和邮件提交服务器之间以及MUAs和邮件访问服务器之间的所有通信。"
    },
    {
      "indent": 3,
      "text": "o MUAs and Mail Service Providers (MSPs) (a) discourage the use of cleartext protocols for mail access and mail submission and (b) deprecate the use of cleartext protocols for these purposes as soon as practicable.",
      "zh-CHS": "o MUA和邮件服务提供商（MSP）（a）不鼓励将明文协议用于邮件访问和邮件提交，以及（b）在切实可行的情况下尽快反对将明文协议用于这些目的。"
    },
    {
      "indent": 3,
      "text": "o Connections to Mail Submission Servers and Mail Access Servers be made using \"Implicit TLS\" (as defined below), in preference to connecting to the \"cleartext\" port and negotiating TLS using the STARTTLS command or a similar command.",
      "zh-CHS": "o 与使用STARTTLS命令或类似命令连接到“明文”端口和协商TLS相比，可以使用“隐式TLS”（如下定义）连接到邮件提交服务器和邮件访问服务器。"
    },
    {
      "indent": 3,
      "text": "This memo does not address the use of TLS with SMTP for message relay (where Message Submission [RFC6409] does not apply). Improving the use of TLS with SMTP for message relay requires a different approach. One approach to address that topic is described in [RFC7672]; another is provided in [MTA-STS].",
      "zh-CHS": "本备忘录未说明将TLS与SMTP一起用于邮件中继的问题（邮件提交[RFC6409]不适用）。改进TLS与SMTP在邮件中继中的使用需要不同的方法。[RFC7672]中描述了解决该主题的一种方法；另一个在[MTA-STS]中提供。"
    },
    {
      "indent": 3,
      "text": "The recommendations in this memo do not replace the functionality of, and are not intended as a substitute for, end-to-end encryption of electronic mail.",
      "zh-CHS": "本备忘录中的建议不会取代电子邮件的端到端加密功能，也不会取代电子邮件的端到端加密功能。"
    },
    {
      "indent": 0,
      "text": "1.1. How This Document Updates Previous RFCs",
      "section_title": true,
      "zh-CHS": "1.1. 本文档如何更新以前的RFC"
    },
    {
      "indent": 3,
      "text": "This document updates POP (RFC 1939), IMAP (RFC 3501), and Submission (RFC 6409, RFC 5068) in two ways:",
      "zh-CHS": "本文档以两种方式更新POP（RFC 1939）、IMAP（RFC 3501）和提交（RFC 6409、RFC 5068）："
    },
    {
      "indent": 3,
      "text": "1. By adding Implicit TLS ports as Standards Track ports for these protocols as described in Section 3.",
      "zh-CHS": "1. 如第3节所述，通过添加隐式TLS端口作为这些协议的标准跟踪端口。"
    },
    {
      "indent": 3,
      "text": "2. By updating TLS best practices that apply to these protocols as described in Sections 4 and 5.",
      "zh-CHS": "2. 如第4节和第5节所述，通过更新适用于这些协议的TLS最佳实践。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 2595 by replacing Section 7 of RFC 2595 with the preference for Implicit TLS as described in Sections 1 and 3 of this document, as well as by updating TLS best practices that apply to the protocols in RFC 2595 as described in Sections 4 and 5 of this document.",
      "zh-CHS": "本文件更新了RFC 2595，将RFC 2595的第7节替换为本文件第1节和第3节所述的隐式TLS，并更新了适用于RFC 2595协议的TLS最佳实践，如本文件第4节和第5节所述。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 6186 as described herein, in Section 5.1.",
      "zh-CHS": "本文件更新了RFC 6186，如第5.1节所述。"
    },
    {
      "indent": 0,
      "text": "2. Conventions and Terminology Used in This Document",
      "section_title": true,
      "zh-CHS": "2. 本文件中使用的约定和术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”在所有大写字母出现时（如图所示）应按照BCP 14[RFC2119][RFC8174]所述进行解释。"
    },
    {
      "indent": 3,
      "text": "The term \"Implicit TLS\" refers to the automatic negotiation of TLS whenever a TCP connection is made on a particular TCP port that is used exclusively by that server for TLS connections. The term \"Implicit TLS\" is intended to contrast with the use of STARTTLS and similar commands in POP, IMAP, SMTP Message Submission, and other protocols, that are used by the client and the server to explicitly negotiate TLS on an established cleartext TCP connection.",
      "zh-CHS": "术语“隐式TLS”是指每当在特定TCP端口上进行TCP连接时，TLS的自动协商，该端口由该服务器专用于TLS连接。术语“隐式TLS”旨在与在POP、IMAP、SMTP消息提交和其他协议中使用STARTTLS和类似命令形成对比，客户机和服务器使用这些命令在已建立的明文TCP连接上显式协商TLS。"
    },
    {
      "indent": 3,
      "text": "The term \"Mail Access Server\" refers to a server for POP, IMAP, and any other protocol used to access or modify received messages, or to access or modify a mail user's account configuration.",
      "zh-CHS": "术语“邮件访问服务器”是指POP、IMAP和任何其他协议的服务器，用于访问或修改收到的邮件，或访问或修改邮件用户的帐户配置。"
    },
    {
      "indent": 3,
      "text": "The term \"Mail Submission Server\" refers to a server for the protocol specified in [RFC6409] (or one of its predecessors or successors) for submission of outgoing messages for delivery to recipients.",
      "zh-CHS": "术语“邮件提交服务器”是指[RFC6409]（或其前身或继任者之一）中指定的协议服务器，用于提交发送给收件人的传出邮件。"
    },
    {
      "indent": 3,
      "text": "The term \"Mail Service Provider\" (or \"MSP\") refers to an operator of Mail Access Servers and/or Mail Submission Servers.",
      "zh-CHS": "术语“邮件服务提供商”（或“MSP”）是指邮件访问服务器和/或邮件提交服务器的运营商。"
    },
    {
      "indent": 3,
      "text": "The term \"Mail Account\" refers to a user's identity with an MSP, that user's authentication credentials, any user email that is stored by the MSP, and any other per-user configuration information maintained by the MSP (for example, instructions for filtering spam). Most MUAs support the ability to access multiple Mail Accounts.",
      "zh-CHS": "术语“邮件帐户”是指具有MSP的用户身份、该用户的认证凭证、由MSP存储的任何用户电子邮件以及由MSP维护的任何其他每用户配置信息（例如，用于过滤垃圾邮件的说明）。大多数MUA支持访问多个邮件帐户。"
    },
    {
      "indent": 3,
      "text": "For each account that an MUA accesses on its user's behalf, it must have the server names, ports, authentication credentials, and other configuration information specified by the user. This information, which is used by the MUA, is referred to as \"Mail Account Configuration\".",
      "zh-CHS": "对于MUA代表其用户访问的每个帐户，它必须具有用户指定的服务器名称、端口、身份验证凭据和其他配置信息。MUA使用的此信息称为“邮件帐户配置”。"
    },
    {
      "indent": 3,
      "text": "This specification expresses syntax using the Augmented Backus-Naur Form (ABNF) as described in [RFC5234], including the core rules provided in Appendix B of [RFC5234] and the rules provided in [RFC5322].",
      "zh-CHS": "本规范使用[RFC5234]中所述的增广巴科斯诺尔形式（ABNF）表示语法，包括[RFC5234]附录B中提供的核心规则和[RFC5322]中提供的规则。"
    },
    {
      "indent": 0,
      "text": "3. Implicit TLS",
      "section_title": true,
      "zh-CHS": "3. 隐式TLS"
    },
    {
      "indent": 3,
      "text": "Previous standards for the use of email protocols with TLS used the STARTTLS mechanism: [RFC2595], [RFC3207], and [RFC3501]. With STARTTLS, the client establishes a cleartext application session and determines whether to issue a STARTTLS command based on server capabilities and client configuration. If the client issues a STARTTLS command, a TLS handshake follows that can upgrade the connection. Although this mechanism has been deployed, an alternate mechanism where TLS is negotiated immediately at connection start on a separate port (referred to in this document as \"Implicit TLS\") has been deployed more successfully. To encourage more widespread use of TLS and to also encourage greater consistency regarding how TLS is used, this specification now recommends the use of Implicit TLS for POP, IMAP, SMTP Submission, and all other protocols used between an MUA and an MSP.",
      "zh-CHS": "以前的TLS电子邮件协议使用标准使用了STARTTLS机制：[RFC2595]、[RFC3207]和[RFC3501]。使用STARTTLS，客户机建立一个明文应用程序会话，并根据服务器功能和客户机配置确定是否发出STARTTLS命令。如果客户机发出STARTTLS命令，则随后会发生TLS握手，从而可以升级连接。尽管已经部署了此机制，但在另一个端口上（在本文档中称为“隐式TLS”）的连接启动时立即协商TLS的替代机制已经部署得更加成功。为了鼓励更广泛地使用TLS，也为了鼓励TLS使用方式的更大一致性，本规范现在建议对POP、IMAP、SMTP提交以及MUA和MSP之间使用的所有其他协议使用隐式TLS。"
    },
    {
      "indent": 0,
      "text": "3.1. Implicit TLS for POP",
      "section_title": true,
      "zh-CHS": "3.1. POP的隐式TLS"
    },
    {
      "indent": 3,
      "text": "When a TCP connection is established for the \"pop3s\" service (default port 995), a TLS handshake begins immediately. Clients MUST implement the certificate validation mechanism described in [RFC7817]. Once the TLS session is established, POP3 [RFC1939] protocol messages are exchanged as TLS application data for the remainder of the TCP connection. After the server sends an +OK greeting, the server and client MUST enter the AUTHORIZATION state, even if a client certificate was supplied during the TLS handshake.",
      "zh-CHS": "当为“pop3s”服务（默认端口995）建立TCP连接时，TLS握手立即开始。客户端必须实现[RFC7817]中描述的证书验证机制。一旦TLS会话建立，POP3[RFC1939]协议消息将作为剩余TCP连接的TLS应用程序数据进行交换。服务器发送+OK问候语后，服务器和客户端必须进入授权状态，即使在TLS握手期间提供了客户端证书。"
    },
    {
      "indent": 3,
      "text": "See Sections 5.5 and 4.2 for additional information on client certificate authentication. See Section 7.1 for port registration information.",
      "zh-CHS": "有关客户端证书身份验证的更多信息，请参见第5.5节和第4.2节。有关港口注册信息，请参见第7.1节。"
    },
    {
      "indent": 0,
      "text": "3.2. Implicit TLS for IMAP",
      "section_title": true,
      "zh-CHS": "3.2. IMAP的隐式TLS"
    },
    {
      "indent": 3,
      "text": "When a TCP connection is established for the \"imaps\" service (default port 993), a TLS handshake begins immediately. Clients MUST implement the certificate validation mechanism described in [RFC7817]. Once the TLS session is established, IMAP [RFC3501] protocol messages are exchanged as TLS application data for the remainder of the TCP connection. If a client certificate was provided during the TLS handshake that the server finds acceptable, the server MAY issue a PREAUTH greeting, in which case both the",
      "zh-CHS": "为“imaps”服务（默认端口993）建立TCP连接时，TLS握手立即开始。客户端必须实现[RFC7817]中描述的证书验证机制。一旦TLS会话建立，IMAP[RFC3501]协议消息将作为剩余TCP连接的TLS应用程序数据进行交换。如果在TLS握手期间提供了客户端证书，并且服务器认为该证书是可接受的，则服务器可能会发出预授权问候语，在这种情况下，两个"
    },
    {
      "indent": 3,
      "text": "server and the client enter the AUTHENTICATED state. If the server issues an OK greeting, then both the server and the client enter the NOT AUTHENTICATED state.",
      "zh-CHS": "服务器和客户端进入已验证状态。如果服务器发出“确定”问候语，则服务器和客户端都将进入“未验证”状态。"
    },
    {
      "indent": 3,
      "text": "See Sections 5.5 and 4.2 for additional information on client certificate authentication. See Section 7.2 for port registration information.",
      "zh-CHS": "有关客户端证书身份验证的更多信息，请参见第5.5节和第4.2节。有关港口注册信息，请参见第7.2节。"
    },
    {
      "indent": 0,
      "text": "3.3. Implicit TLS for SMTP Submission",
      "section_title": true,
      "zh-CHS": "3.3. SMTP提交的隐式TLS"
    },
    {
      "indent": 3,
      "text": "When a TCP connection is established for the \"submissions\" service (default port 465), a TLS handshake begins immediately. Clients MUST implement the certificate validation mechanism described in [RFC7817]. Once the TLS session is established, Message Submission protocol data [RFC6409] is exchanged as TLS application data for the remainder of the TCP connection. (Note: The \"submissions\" service name is defined in Section 7.3 of this document and follows the usual convention that the name of a service layered on top of Implicit TLS consists of the name of the service as used without TLS, with an \"s\" appended.)",
      "zh-CHS": "当为“提交”服务（默认端口465）建立TCP连接时，TLS握手立即开始。客户端必须实现[RFC7817]中描述的证书验证机制。一旦TLS会话建立，消息提交协议数据[RFC6409]将作为TCP连接其余部分的TLS应用程序数据进行交换。（注：“提交”服务名称在本文件第7.3节中定义，并遵循通常的惯例，即在隐式TLS之上分层的服务名称由未使用TLS的服务名称组成，并附加“s”。）"
    },
    {
      "indent": 3,
      "text": "The STARTTLS mechanism on port 587 is relatively widely deployed due to the situation with port 465 (discussed in Section 7.3). This differs from IMAP and POP services where Implicit TLS is more widely deployed on servers than STARTTLS. It is desirable to migrate core protocols used by MUA software to Implicit TLS over time, for consistency as well as for the additional reasons discussed in Appendix A. However, to maximize the use of encryption for submission, it is desirable to support both mechanisms for Message Submission over TLS for a transition period of several years. As a result, clients and servers SHOULD implement both STARTTLS on port 587 and Implicit TLS on port 465 for this transition period. Note that there is no significant difference between the security properties of STARTTLS on port 587 and Implicit TLS on port 465 if the implementations are correct and if both the client and the server are configured to require successful negotiation of TLS prior to Message Submission.",
      "zh-CHS": "由于端口465的情况（在第7.3节中讨论），端口587上的STARTTLS机制部署相对广泛。这与IMAP和POP服务不同，后者隐式TLS比STARTTLS更广泛地部署在服务器上。出于一致性以及附录A中讨论的其他原因，随着时间的推移，最好将MUA软件使用的核心协议迁移到隐式TLS。然而，为了最大限度地使用加密进行提交，最好在几年的过渡期内支持两种机制，以便通过TLS提交消息。因此，在此过渡期内，客户端和服务器应在端口587上实现STARTTLS，并在端口465上实现隐式TLS。请注意，如果实现正确，并且如果客户端和服务器都配置为在提交消息之前要求成功协商TLS，则端口587上的STARTTLS和端口465上的隐式TLS的安全属性之间没有显著差异。"
    },
    {
      "indent": 3,
      "text": "Note that the \"submissions\" port provides access to a Message Submission Agent (MSA) as defined in [RFC6409], so requirements and recommendations for MSAs in that document, including the requirement to implement SMTP AUTH [RFC4954] and the requirements of Email Submission Operations [RFC5068], also apply to the submissions port.",
      "zh-CHS": "请注意，“提交”端口提供对[RFC6409]中定义的邮件提交代理（MSA）的访问，因此该文档中对MSA的要求和建议，包括实现SMTP验证[RFC4954]的要求和电子邮件提交操作[RFC5068]的要求，也适用于提交端口。"
    },
    {
      "indent": 3,
      "text": "See Sections 5.5 and 4.2 for additional information on client certificate authentication. See Section 7.3 for port registration information.",
      "zh-CHS": "有关客户端证书身份验证的更多信息，请参见第5.5节和第4.2节。有关港口注册信息，请参见第7.3节。"
    },
    {
      "indent": 0,
      "text": "3.4. Implicit TLS Connection Closure for POP, IMAP, and SMTP Submission",
      "section_title": true,
      "zh-CHS": "3.4. POP、IMAP和SMTP提交的隐式TLS连接关闭"
    },
    {
      "indent": 3,
      "text": "When a client or server wishes to close the connection, it SHOULD initiate the exchange of TLS close alerts before TCP connection termination. The client MAY, after sending a TLS close alert, gracefully close the TCP connection (e.g., call the close() function on the TCP socket or otherwise issue a TCP CLOSE ([RFC793], Section 3.5)) without waiting for a TLS response from the server.",
      "zh-CHS": "当客户端或服务器希望关闭连接时，应在TCP连接终止之前启动TLS关闭警报的交换。在发送TLS close警报后，客户端可以正常关闭TCP连接（例如，调用TCP套接字上的close（）函数或以其他方式发出TCP close（[RFC793]，第3.5节）），而无需等待服务器的TLS响应。"
    },
    {
      "indent": 0,
      "text": "4. Use of TLS by Mail Access Servers and Message Submission Servers",
      "section_title": true,
      "zh-CHS": "4. 邮件访问服务器和邮件提交服务器使用TLS"
    },
    {
      "indent": 3,
      "text": "The following requirements and recommendations apply to Mail Access Servers and Mail Submission Servers, or, if indicated, to MSPs:",
      "zh-CHS": "以下要求和建议适用于邮件访问服务器和邮件提交服务器，或适用于MSP（如有指示）："
    },
    {
      "indent": 3,
      "text": "o MSPs that support POP, IMAP, and/or Message Submission MUST support TLS access for those protocol servers.",
      "zh-CHS": "o 支持POP、IMAP和/或消息提交的MSP必须支持这些协议服务器的TLS访问。"
    },
    {
      "indent": 3,
      "text": "o Servers provided by MSPs other than POP, IMAP, and/or Message Submission SHOULD support TLS access and MUST support TLS access for those servers that support authentication via username and password.",
      "zh-CHS": "o MSP提供的服务器（POP、IMAP和/或消息提交除外）应支持TLS访问，并且必须支持通过用户名和密码进行身份验证的服务器的TLS访问。"
    },
    {
      "indent": 3,
      "text": "o MSPs that support POP, IMAP, and/or Message Submission SHOULD provide and support instances of those services that use Implicit TLS. (See Section 3.)",
      "zh-CHS": "o 支持POP、IMAP和/或消息提交的MSP应提供并支持使用隐式TLS的服务实例。（见第3节。）"
    },
    {
      "indent": 3,
      "text": "o For compatibility with existing MUAs and existing MUA configurations, MSPs SHOULD also, in the near term, provide instances of these services that support STARTTLS. This will permit legacy MUAs to discover new availability of TLS capability on servers and may increase the use of TLS by such MUAs. However, servers SHOULD NOT advertise STARTTLS if the use of the STARTTLS command by a client is likely to fail (for example, if the server has no server certificate configured).",
      "zh-CHS": "o 为了与现有MUA和现有MUA配置兼容，MSP还应在近期内提供这些支持STARTTLS的服务实例。这将允许遗留MUA发现服务器上TLS功能的新可用性，并可能增加此类MUA对TLS的使用。但是，如果客户端使用STARTTLS命令可能失败（例如，如果服务器未配置服务器证书），则服务器不应播发STARTTLS。"
    },
    {
      "indent": 3,
      "text": "o MSPs SHOULD advertise their Mail Access Servers and Mail Submission Servers, using DNS SRV records according to [RFC6186]. (In addition to making correct configuration easier for MUAs, this provides a way by which MUAs can discover when an MSP begins to offer TLS-based services.) Servers supporting TLS SHOULD be advertised in preference to cleartext servers (if offered). In addition, servers using Implicit TLS SHOULD be advertised in preference to servers supporting STARTTLS (if offered). (See also Section 4.5.)",
      "zh-CHS": "o MSP应根据[RFC6186]使用DNS SRV记录公布其邮件访问服务器和邮件提交服务器。（除了使MUA更容易进行正确的配置外，这还提供了一种方式，MUA可以通过该方式发现MSP何时开始提供基于TLS的服务。）支持TLS的服务器应该优先于明文服务器（如果提供）进行广告宣传。此外，使用隐式TLS的服务器应优先于支持STARTTLS的服务器（如果提供）。（另见第4.5节。）"
    },
    {
      "indent": 3,
      "text": "o MSPs SHOULD deprecate the use of cleartext Mail Access Servers and Mail Submission Servers as soon as practicable. (See Section 4.1.)",
      "zh-CHS": "o MSP应尽快反对使用明文邮件访问服务器和邮件提交服务器。（见第4.1节。）"
    },
    {
      "indent": 3,
      "text": "o MSPs currently supporting such use of cleartext SMTP (on port 25) as a means of Message Submission by their users (whether or not requiring authentication) SHOULD transition their users to using TLS (either Implicit TLS or STARTTLS) as soon as practicable.",
      "zh-CHS": "o 目前支持使用明文SMTP（在端口25上）作为其用户提交邮件的方式的MSP（无论是否需要身份验证）应尽快将其用户转换为使用TLS（隐式TLS或STARTTLS）。"
    },
    {
      "indent": 3,
      "text": "o Mail Access Servers and Mail Submission Servers MUST support TLS 1.2 or later.",
      "zh-CHS": "o 邮件访问服务器和邮件提交服务器必须支持TLS 1.2或更高版本。"
    },
    {
      "indent": 3,
      "text": "o All Mail Access Servers and Mail Submission Servers SHOULD implement the recommended TLS ciphersuites described in [RFC7525] or a future BCP or Standards Track revision of that document.",
      "zh-CHS": "o 所有邮件访问服务器和邮件提交服务器应实施[RFC7525]中所述的推荐TLS密码套件，或该文档的未来BCP或标准跟踪修订版。"
    },
    {
      "indent": 3,
      "text": "o As soon as practicable, MSPs currently supporting Secure Sockets Layer (SSL) 2.x, SSL 3.0, or TLS 1.0 SHOULD transition their users to TLS 1.1 or later and discontinue support for those earlier versions of SSL and TLS.",
      "zh-CHS": "o 目前支持安全套接字层（SSL）2.x、SSL 3.0或TLS 1.0的MSP应尽快将其用户转移到TLS 1.1或更高版本，并停止对这些早期版本的SSL和TLS的支持。"
    },
    {
      "indent": 3,
      "text": "o Mail Submission Servers accepting mail using TLS SHOULD include in the Received field of the outgoing message the TLS ciphersuite of the session in which the mail was received. (See Section 4.3.)",
      "zh-CHS": "o 使用TLS接收邮件的邮件提交服务器应在传出邮件的Received字段中包含接收邮件的会话的TLS ciphersuite。（见第4.3节。）"
    },
    {
      "indent": 3,
      "text": "o All Mail Access Servers and Mail Submission Servers implementing TLS SHOULD log TLS cipher information along with any connection or authentication logs that they maintain.",
      "zh-CHS": "o 实现TLS的所有邮件访问服务器和邮件提交服务器都应记录TLS密码信息以及它们维护的任何连接或身份验证日志。"
    },
    {
      "indent": 3,
      "text": "Additional considerations and details appear below.",
      "zh-CHS": "其他注意事项和细节见下文。"
    },
    {
      "indent": 0,
      "text": "4.1. Deprecation of Services Using Cleartext and TLS Versions Less Than 1.1",
      "zh-CHS": "4.1. 使用Cleartext和TLS版本低于1.1的服务的弃用"
    },
    {
      "indent": 3,
      "text": "The specific means employed for deprecation of cleartext Mail Access Servers and Mail Submission Servers MAY vary from one MSP to the next in light of their user communities' needs and constraints. For example, an MSP MAY implement a gradual transition in which, over time, more and more users are forbidden to authenticate to cleartext instances of these servers, thus encouraging those users to migrate to Implicit TLS. Access to cleartext servers should eventually be either (a) disabled or (b) limited strictly for use by legacy systems that cannot be upgraded.",
      "zh-CHS": "针对明文邮件访问服务器和邮件提交服务器的弃用所采用的具体方式可能因MSP的不同而有所不同，这取决于其用户社区的需求和限制。例如，MSP可以实现逐渐过渡，随着时间的推移，越来越多的用户被禁止对这些服务器的明文实例进行身份验证，从而鼓励这些用户迁移到隐式TLS。对明文服务器的访问最终应该（a）禁用或（b）严格限制，以供无法升级的遗留系统使用。"
    },
    {
      "indent": 3,
      "text": "After a user's ability to authenticate to a server using cleartext is revoked, the server denying such access MUST NOT provide any indication over a cleartext channel of whether the user's authentication credentials were valid. An attempt to authenticate as such a user using either invalid credentials or valid credentials MUST both result in the same indication of access being denied.",
      "zh-CHS": "在用户使用明文对服务器进行身份验证的能力被撤销后，拒绝此类访问的服务器不得通过明文通道提供任何关于用户身份验证凭据是否有效的指示。尝试使用无效凭据或有效凭据作为这样的用户进行身份验证必须导致相同的访问被拒绝指示。"
    },
    {
      "indent": 3,
      "text": "Also, users previously authenticating with passwords sent as cleartext SHOULD be required to change those passwords when migrating to TLS, if the old passwords were likely to have been compromised. (For any large community of users using the public Internet to access mail without encryption, the compromise of at least some of those passwords should be assumed.)",
      "zh-CHS": "此外，如果旧密码可能已被泄露，则应要求以前使用明文发送的密码进行身份验证的用户在迁移到TLS时更改这些密码。（对于任何使用公共互联网访问邮件而无需加密的大型用户社区，至少应假定其中一些密码存在泄露。）"
    },
    {
      "indent": 3,
      "text": "Transition of users from SSL or TLS 1.0 to later versions of TLS MAY be accomplished by a means similar to that described above. There are multiple ways to accomplish this. One way is for the server to refuse a ClientHello message from any client sending a ClientHello.version field corresponding to any version of SSL or TLS 1.0. Another way is for the server to accept ClientHello messages from some client versions that it does not wish to support but later refuse to allow the user to authenticate. The latter method may provide a better indication to the user of the reason for the failure but (depending on the protocol and method of authentication used) may also risk exposure of the user's password over a channel that is known to not provide adequate confidentiality.",
      "zh-CHS": "用户从SSL或TLS 1.0到TLS更高版本的转换可以通过与上述类似的方式完成。实现这一点有多种方法。一种方法是服务器拒绝来自发送与任何版本的SSL或TLS 1.0对应的ClientHello.version字段的任何客户端的ClientHello消息。另一种方法是服务器接受来自某些客户端版本的ClientHello消息，这些客户端版本不希望支持这些消息，但随后拒绝允许用户进行身份验证。后一种方法可以向用户提供故障原因的更好指示，但是（取决于所使用的协议和认证方法）也可能存在用户密码在已知不提供足够机密性的信道上暴露的风险。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that new users be required to use TLS version 1.1 or greater from the start. However, an MSP may find it necessary to make exceptions to accommodate some legacy systems that support only earlier versions of TLS or only cleartext.",
      "zh-CHS": "建议要求新用户从一开始就使用TLS 1.1版或更高版本。然而，MSP可能会发现有必要进行例外处理，以适应一些仅支持TLS早期版本或仅支持明文的遗留系统。"
    },
    {
      "indent": 0,
      "text": "4.2. Mail Server Use of Client Certificate Authentication",
      "section_title": true,
      "zh-CHS": "4.2. 邮件服务器使用客户端证书身份验证"
    },
    {
      "indent": 3,
      "text": "Mail Submission Servers and Mail Access Servers MAY implement client certificate authentication on the Implicit TLS port. Such servers MUST NOT request a client certificate during the TLS handshake unless the server is configured to accept some client certificates as sufficient for authentication and the server has the ability to determine a mail server authorization identity matching such certificates. How to make this determination is presently implementation specific.",
      "zh-CHS": "邮件提交服务器和邮件访问服务器可以在隐式TLS端口上实现客户端证书身份验证。在TLS握手期间，此类服务器不得请求客户端证书，除非服务器配置为接受某些客户端证书以进行身份验证，并且服务器能够确定与此类证书匹配的邮件服务器授权标识。如何作出这一决定目前取决于具体的实施情况。"
    },
    {
      "indent": 3,
      "text": "If the server accepts the client's certificate as sufficient for authorization, it MUST enable the Simple Authentication and Security Layer (SASL) EXTERNAL mechanism [RFC4422]. An IMAPS server MAY issue a PREAUTH greeting instead of enabling SASL EXTERNAL.",
      "zh-CHS": "如果服务器接受客户机的证书作为足够的授权，则必须启用简单身份验证和安全层（SASL）外部机制[RFC4422]。IMAPS服务器可能会发出预授权问候语，而不是启用SASL外部。"
    },
    {
      "indent": 0,
      "text": "4.3. Recording TLS Ciphersuite in \"Received\" Header Field",
      "section_title": true,
      "zh-CHS": "4.3. 在“已接收”标题字段中记录TLS密码套件"
    },
    {
      "indent": 3,
      "text": "The ESMTPS transmission type [RFC3848] provides trace information that can indicate that TLS was used when transferring mail. However, TLS usage by itself is not a guarantee of confidentiality or security. The TLS ciphersuite provides additional information about the level of security made available for a connection. This section",
      "zh-CHS": "ESMTPS传输类型[RFC3848]提供跟踪信息，可指示传输邮件时使用了TLS。然而，TLS的使用本身并不能保证机密性或安全性。TLS密码套件提供了有关连接可用安全级别的附加信息。本节"
    },
    {
      "indent": 3,
      "text": "defines a new SMTP \"tls\" Received header additional-registered-clause that is used to record the TLS ciphersuite that was negotiated for the connection. This clause SHOULD be included whenever a Submission server generates a Received header field for a message received via TLS. The value included in this additional clause SHOULD be the registered ciphersuite name (e.g., TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256) included in the \"TLS Cipher Suite Registry\". In the event that the implementation does not know the name of the ciphersuite (a situation that should be remedied promptly), a four-digit hexadecimal ciphersuite identifier MAY be used. In addition, the Diffie-Hellman group name associated with the ciphersuite MAY be included (when applicable and known) following the ciphersuite name. The ABNF for the field follows:",
      "zh-CHS": "定义一个新的SMTP“tls”接收头附加注册子句，用于记录为连接协商的tls密码套件。每当提交服务器为通过TLS接收的消息生成Received header字段时，都应包含此子句。本附加条款中包含的值应为“TLS密码套件注册表”中包含的已注册密码套件名称（例如，TLS_ECDHE_RSA_和_AES_128_GCM_SHA256）。如果实现不知道密码套件的名称（这种情况应立即纠正），则可以使用四位十六进制密码套件标识符。此外，与密码套件相关联的Diffie-Hellman组名称可包括在密码套件名称之后（如适用和已知）。该字段的ABNF如下所示："
    },
    {
      "indent": 3,
      "text": "tls-cipher-clause = CFWS \"tls\" FWS tls-cipher [ CFWS tls-dh-group-clause ]",
      "zh-CHS": "tls密码子句=CFWS“tls”FWS tls密码[CFWS tls dh group子句]"
    },
    {
      "indent": 3,
      "text": "tls-cipher         =  tls-cipher-name / tls-cipher-hex",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "tls-cipher-name    =  ALPHA *(ALPHA / DIGIT / \"_\")\n; as registered in the IANA \"TLS Cipher Suite Registry\"\n; <https://www.iana.org/assignments/tls-parameters>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "tls-cipher-hex = \"0x\" 4HEXDIG",
      "zh-CHS": "tls密码hex=“0x”4HEXDIG"
    },
    {
      "indent": 3,
      "text": "tls-dh-group-clause = \"group\" FWS dh-group ; not to be used except immediately after tls-cipher",
      "zh-CHS": "tls dh group子句=“group”FWS dh group；除非在tls密码后立即使用，否则不得使用"
    },
    {
      "indent": 3,
      "text": "dh-group           = ALPHA *(ALPHA / DIGIT / \"_\" / \"-\")\n; as registered in the IANA \"TLS Supported Groups Registry\"\n; <https://www.iana.org/assignments/tls-parameters>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.4. TLS Server Certificate Requirements",
      "section_title": true,
      "zh-CHS": "4.4. TLS服务器证书要求"
    },
    {
      "indent": 3,
      "text": "MSPs MUST maintain valid server certificates for all servers. See [RFC7817] for the recommendations and requirements necessary to achieve this.",
      "zh-CHS": "MSP必须为所有服务器维护有效的服务器证书。有关实现这一目标所需的建议和要求，请参见[RFC7817]。"
    },
    {
      "indent": 3,
      "text": "If a protocol server provides service for more than one mail domain, it MAY use a separate IP address for each domain and/or a server certificate that advertises multiple domains. This will generally be necessary unless and until it is acceptable to impose the constraint that the server and all clients support the Server Name Indication (SNI) extension to TLS [RFC6066]. Mail servers supporting the SNI need to support the post-SRV hostname to interoperate with MUAs that have not implemented [RFC6186]. For more discussion of this problem, see Section 5.1 of [RFC7817].",
      "zh-CHS": "如果协议服务器为多个邮件域提供服务，则它可以为每个域使用单独的IP地址和/或播发多个域的服务器证书。这通常是必要的，除非并且直到可以接受服务器和所有客户端支持TLS的服务器名称指示（SNI）扩展[RFC6066]的约束。支持SNI的邮件服务器需要支持post SRV主机名，以便与尚未实现的MUA进行互操作[RFC6186]。有关此问题的更多讨论，请参见[RFC7817]第5.1节。"
    },
    {
      "indent": 0,
      "text": "4.5. Recommended DNS Records for Mail Protocol Servers",
      "section_title": true,
      "zh-CHS": "4.5. 邮件协议服务器的推荐DNS记录"
    },
    {
      "indent": 3,
      "text": "This section discusses not only the DNS records that are recommended but also implications of DNS records for server configuration and TLS server certificates.",
      "zh-CHS": "本节不仅讨论推荐的DNS记录，还讨论DNS记录对服务器配置和TLS服务器证书的影响。"
    },
    {
      "indent": 0,
      "text": "4.5.1. MX Records",
      "section_title": true,
      "zh-CHS": "4.5.1. MX记录"
    },
    {
      "indent": 3,
      "text": "It is recommended that MSPs advertise MX records for the handling of inbound mail (instead of relying entirely on A or AAAA records) and that those MX records be signed using DNSSEC [RFC4033]. This is mentioned here only for completeness, as the handling of inbound mail is out of scope for this document.",
      "zh-CHS": "建议MSP公布用于处理入站邮件的MX记录（而不是完全依赖A或AAAA记录），并使用DNSSEC[RFC4033]对这些MX记录进行签名。这里提到这一点只是为了完整性，因为入站邮件的处理超出了本文档的范围。"
    },
    {
      "indent": 0,
      "text": "4.5.2. SRV Records",
      "section_title": true,
      "zh-CHS": "4.5.2. SRV记录"
    },
    {
      "indent": 3,
      "text": "MSPs SHOULD advertise SRV records to aid MUAs in determining the proper configuration of servers, per the instructions in [RFC6186].",
      "zh-CHS": "MSP应根据[RFC6186]中的说明公布SRV记录，以帮助MUA确定服务器的正确配置。"
    },
    {
      "indent": 3,
      "text": "MSPs SHOULD advertise servers that support Implicit TLS in preference to servers that support cleartext and/or STARTTLS operation.",
      "zh-CHS": "MSP应该宣传支持隐式TLS的服务器，而不是支持明文和/或STARTTLS操作的服务器。"
    },
    {
      "indent": 0,
      "text": "4.5.3. DNSSEC",
      "section_title": true,
      "zh-CHS": "4.5.3. DNSSEC"
    },
    {
      "indent": 3,
      "text": "All DNS records advertised by an MSP as a means of aiding clients in communicating with the MSP's servers SHOULD be signed using DNSSEC if and when the parent DNS zone supports doing so.",
      "zh-CHS": "如果父DNS区域支持这样做，则MSP作为帮助客户端与MSP服务器通信的手段发布的所有DNS记录都应使用DNSSEC进行签名。"
    },
    {
      "indent": 0,
      "text": "4.5.4. TLSA Records",
      "section_title": true,
      "zh-CHS": "4.5.4. TLSA记录"
    },
    {
      "indent": 3,
      "text": "MSPs SHOULD advertise TLSA records to provide an additional trust anchor for public keys used in TLS server certificates. However, TLSA records MUST NOT be advertised unless they are signed using DNSSEC.",
      "zh-CHS": "MSP应该公布TLSA记录，为TLS服务器证书中使用的公钥提供额外的信任锚。但是，除非使用DNSSEC对TLSA记录进行签名，否则不得发布TLSA记录。"
    },
    {
      "indent": 0,
      "text": "4.6. Changes to Internet-Facing Servers",
      "section_title": true,
      "zh-CHS": "4.6. 对面向Internet的服务器的更改"
    },
    {
      "indent": 3,
      "text": "When an MSP changes the Internet-facing Mail Access Servers and Mail Submission Servers, including SMTP-based spam/virus filters, it is generally necessary to support the same and/or a newer version of TLS than the one previously used.",
      "zh-CHS": "当MSP更改面向Internet的邮件访问服务器和邮件提交服务器（包括基于SMTP的垃圾邮件/病毒过滤器）时，通常需要支持与以前使用的相同和/或更新版本的TLS。"
    },
    {
      "indent": 0,
      "text": "5. Use of TLS by Mail User Agents",
      "section_title": true,
      "zh-CHS": "5. 邮件用户代理使用TLS"
    },
    {
      "indent": 3,
      "text": "The following requirements and recommendations apply to MUAs:",
      "zh-CHS": "以下要求和建议适用于MUA："
    },
    {
      "indent": 3,
      "text": "o MUAs SHOULD be capable of using DNS SRV records to discover Mail Access Servers and Mail Submission Servers that are advertised by an MSP for an account being configured. Other means of discovering server configuration information (e.g., a database maintained by the MUA vendor) MAY also be supported. (See Section 5.1 for more information.)",
      "zh-CHS": "o MUA应该能够使用DNS SRV记录来发现MSP为正在配置的帐户播发的邮件访问服务器和邮件提交服务器。还可以支持发现服务器配置信息的其他方法（例如，MUA供应商维护的数据库）。（详见第5.1节。）"
    },
    {
      "indent": 3,
      "text": "o MUAs SHOULD be configurable to require a minimum level of confidentiality for any particular Mail Account and refuse to exchange information via any service associated with that Mail Account if the session does not provide that minimum level of confidentiality. (See Section 5.2.)",
      "zh-CHS": "o MUA应可配置为要求任何特定邮件帐户的最低保密级别，并在会话未提供最低保密级别时拒绝通过与该邮件帐户相关联的任何服务交换信息。（见第5.2节。）"
    },
    {
      "indent": 3,
      "text": "o MUAs MUST NOT treat a session as meeting a minimum level of confidentiality if the server's TLS certificate cannot be validated. (See Section 5.3.)",
      "zh-CHS": "o 如果无法验证服务器的TLS证书，MUA不得将会话视为满足最低保密级别。（见第5.3节。）"
    },
    {
      "indent": 3,
      "text": "o MUAs MAY impose other minimum confidentiality requirements in the future, e.g., in order to discourage the use of TLS versions or cryptographic algorithms in which weaknesses have been discovered.",
      "zh-CHS": "o MUA将来可能会提出其他最低保密要求，例如，为了阻止使用TLS版本或发现弱点的加密算法。"
    },
    {
      "indent": 3,
      "text": "o MUAs SHOULD provide a prominent indication of the level of confidentiality associated with an account configuration that is appropriate for the user interface (for example, a \"lock\" icon or changed background color for a visual interface, or some sort of audible indication for an audio user interface), at appropriate times and/or locations, in order to inform the user of the confidentiality of the communications associated with that account. For example, this might be done whenever (a) the user is prompted for authentication credentials, (b) the user is composing mail that will be sent to a particular submission server, (c) a list of accounts is displayed (particularly if the user can select from that list to read mail), or (d) the user is asking to view or update any configuration data that will be stored on a remote server. If, however, an MUA provides such an indication, it MUST NOT indicate confidentiality for any connection that does not at least use TLS 1.1 with certificate verification and also meet the minimum confidentiality requirements associated with that account.",
      "zh-CHS": "o MUA应在适当的时间和/或位置提供与适用于用户界面的帐户配置相关的保密级别的显著指示（例如，视觉界面的“锁定”图标或更改的背景颜色，或音频用户界面的某种音频指示），以告知用户与该账户相关的通信的机密性。例如，每当（a）提示用户输入身份验证凭据，（b）用户正在编写将发送到特定提交服务器的邮件，（c）显示帐户列表（特别是如果用户可以从该列表中选择以读取邮件）或（d）时，都可以执行此操作用户请求查看或更新将存储在远程服务器上的任何配置数据。但是，如果MUA提供了此类指示，则不得对至少未使用TLS 1.1进行证书验证的任何连接表示机密性，也不得满足与该帐户相关的最低机密性要求。"
    },
    {
      "indent": 3,
      "text": "o MUAs MUST implement TLS 1.2 [RFC5246] or later. Earlier TLS and SSL versions MAY also be supported, so long as the MUA requires at least TLS 1.1 [RFC4346] when accessing accounts that are configured to impose minimum confidentiality requirements.",
      "zh-CHS": "o MUA必须实现TLS 1.2[RFC5246]或更高版本。也可以支持早期TLS和SSL版本，只要MUA在访问配置为施加最低保密要求的帐户时至少需要TLS 1.1[RFC4346]。"
    },
    {
      "indent": 3,
      "text": "o All MUAs SHOULD implement the recommended TLS ciphersuites described in [RFC7525] or a future BCP or Standards Track revision of that document.",
      "zh-CHS": "o 所有MUA应实施[RFC7525]中所述的推荐TLS密码套件，或该文件的未来BCP或标准跟踪修订版。"
    },
    {
      "indent": 3,
      "text": "o MUAs that are configured to not require minimum confidentiality for one or more accounts SHOULD detect when TLS becomes available on those accounts (using [RFC6186] or other means) and offer to upgrade the account to require TLS.",
      "zh-CHS": "o 配置为不要求一个或多个帐户的最低机密性的MUA应检测这些帐户上的TLS何时可用（使用[RFC6186]或其他方式），并提供升级帐户以要求TLS。"
    },
    {
      "indent": 3,
      "text": "Additional considerations and details appear below.",
      "zh-CHS": "其他注意事项和细节见下文。"
    },
    {
      "indent": 0,
      "text": "5.1. Use of SRV Records in Establishing Configuration",
      "section_title": true,
      "zh-CHS": "5.1. 在建立配置时使用SRV记录"
    },
    {
      "indent": 3,
      "text": "This document updates [RFC6186] by changing the preference rules and adding a new SRV service label _submissions._tcp to refer to Message Submission with Implicit TLS.",
      "zh-CHS": "本文档通过更改首选项规则并添加新的SRV服务标签_submissions来更新[RFC6186]。_tcp以引用带有隐式TLS的消息提交。"
    },
    {
      "indent": 3,
      "text": "User-configurable MUAs SHOULD support the use of [RFC6186] for account setup. However, when using configuration information obtained via this method, MUAs SHOULD ignore advertised services that do not satisfy minimum confidentiality requirements, unless the user has explicitly requested reduced confidentiality. This will have the effect of causing the MUA to default to ignoring advertised configurations that do not support TLS, even when those advertised configurations have a higher priority than other advertised configurations.",
      "zh-CHS": "用户可配置的MUA应支持使用[RFC6186]进行帐户设置。然而，当使用通过此方法获得的配置信息时，MUA应忽略不满足最低保密要求的广告服务，除非用户明确要求降低保密性。这将导致MUA默认忽略不支持TLS的播发配置，即使这些播发配置的优先级高于其他播发配置。"
    },
    {
      "indent": 3,
      "text": "When using configuration information per [RFC6186], MUAs SHOULD NOT automatically establish new configurations that do not require TLS for all servers, unless there are no advertised configurations using TLS. If such a configuration is chosen, prior to attempting to authenticate to the server or use the server for Message Submission, the MUA SHOULD warn the user that traffic to that server will not be encrypted and that it will therefore likely be intercepted by unauthorized parties. The specific wording is to be determined by the implementation, but it should adequately capture the sense of risk, given the widespread incidence of mass surveillance of email traffic.",
      "zh-CHS": "根据[RFC6186]使用配置信息时，MUA不应自动建立不需要所有服务器TLS的新配置，除非没有使用TLS的公告配置。如果选择了这种配置，则在尝试向服务器进行身份验证或使用服务器提交消息之前，MUA应警告用户，到该服务器的通信将不会加密，因此可能会被未经授权的方截获。具体措辞将由实施情况决定，但鉴于电子邮件流量大规模监控的普遍发生，它应充分捕捉风险感。"
    },
    {
      "indent": 3,
      "text": "Similarly, an MUA MUST NOT attempt to \"test\" a particular Mail Account configuration by submitting the user's authentication credentials to a server, unless a TLS session meeting minimum confidentiality levels has been established with that server. If minimum confidentiality requirements have not been satisfied, the MUA must explicitly warn that the user's password may be exposed to attackers before testing the new configuration.",
      "zh-CHS": "类似地，MUA不得试图通过向服务器提交用户的身份验证凭据来“测试”特定邮件帐户配置，除非已与该服务器建立了满足最低保密级别的TLS会话。如果未满足最低保密要求，MUA必须在测试新配置之前明确警告用户密码可能会暴露给攻击者。"
    },
    {
      "indent": 3,
      "text": "When establishing a new configuration for connecting to an IMAP, POP, or SMTP submission server, based on SRV records, an MUA SHOULD verify that either (a) the SRV records are signed using DNSSEC or (b) the target Fully Qualified Domain Name (FQDN) of the SRV record matches the original server FQDN for which the SRV queries were made. If the target FQDN is not in the queried domain, the MUA SHOULD verify with the user that the SRV target FQDN is suitable for use, before executing any connections to the host. (See Section 6 of [RFC6186].)",
      "zh-CHS": "根据SRV记录建立连接到IMAP、POP或SMTP提交服务器的新配置时，MUA应验证（a）SRV记录是否使用DNSSEC签名，或（b）SRV记录的目标完全限定域名（FQDN）是否与进行SRV查询的原始服务器FQDN匹配。如果目标FQDN不在查询的域中，MUA应在执行到主机的任何连接之前，与用户验证SRV目标FQDN是否适合使用。（见[RFC6186]第6节）"
    },
    {
      "indent": 3,
      "text": "An MUA MUST NOT consult SRV records to determine which servers to use on every connection attempt, unless those SRV records are signed by DNSSEC and have a valid signature. However, an MUA MAY consult SRV records from time to time to determine if an MSP's server configuration has changed and alert the user if it appears that this has happened. This can also serve as a means to encourage users to upgrade their configurations to require TLS if and when their MSPs support it.",
      "zh-CHS": "MUA不得查阅SRV记录以确定在每次连接尝试中使用哪些服务器，除非这些SRV记录由DNSSEC签名并具有有效签名。但是，MUA可能会不时查阅SRV记录，以确定MSP的服务器配置是否已更改，并在出现这种情况时通知用户。如果MSP支持TLS，这也可以作为一种鼓励用户升级配置以要求TLS的手段。"
    },
    {
      "indent": 0,
      "text": "5.2. Minimum Confidentiality Level",
      "section_title": true,
      "zh-CHS": "5.2. 最低保密级别"
    },
    {
      "indent": 3,
      "text": "MUAs SHOULD, by default, require a minimum level of confidentiality for services accessed by each account. For MUAs supporting the ability to access multiple Mail Accounts, this requirement SHOULD be configurable on a per-account basis.",
      "zh-CHS": "默认情况下，MUA应该要求每个帐户访问的服务具有最低级别的保密性。对于支持访问多个邮件帐户的MUA，应根据每个帐户配置此要求。"
    },
    {
      "indent": 3,
      "text": "The default minimum expected level of confidentiality for all new accounts MUST require successful validation of the server's certificate and SHOULD require negotiation of TLS version 1.1 or greater. (Future revisions to this specification may raise these requirements or impose additional requirements to address newly discovered weaknesses in protocols or cryptographic algorithms.)",
      "zh-CHS": "所有新帐户的默认最低预期保密级别必须要求成功验证服务器的证书，并要求协商TLS版本1.1或更高版本。（本规范的未来修订可能会提出这些要求，或提出附加要求，以解决协议或加密算法中新发现的弱点。）"
    },
    {
      "indent": 3,
      "text": "MUAs MAY permit the user to disable this minimum confidentiality requirement during initial account configuration or when subsequently editing an account configuration but MUST warn users that such a configuration will not assure privacy for either passwords or messages.",
      "zh-CHS": "MUAs可允许用户在初始帐户配置期间或随后编辑帐户配置时禁用此最低保密要求，但必须警告用户，此类配置不会确保密码或消息的隐私。"
    },
    {
      "indent": 3,
      "text": "An MUA that is configured to require a minimum level of confidentiality for a Mail Account MUST NOT attempt to perform any operation other than capability discovery, or STARTTLS for servers not using Implicit TLS, unless the minimum level of confidentiality is provided by that connection.",
      "zh-CHS": "配置为要求邮件帐户具有最低保密级别的MUA不得尝试执行除功能发现之外的任何操作，也不得对不使用隐式TLS的服务器执行STARTTLS，除非该连接提供了最低保密级别。"
    },
    {
      "indent": 3,
      "text": "MUAs SHOULD NOT allow users to easily access or send mail via a connection, or authenticate to any service using a password, if that account is configured to impose minimum confidentiality requirements and that connection does not meet all of those requirements. An",
      "zh-CHS": "MUA不应允许用户通过连接轻松访问或发送邮件，或使用密码对任何服务进行身份验证，如果该帐户被配置为施加最低保密要求，且该连接不满足所有这些要求。一"
    },
    {
      "indent": 3,
      "text": "example of \"easy access\" would be to display a dialog informing the user that the security requirements of the account were not met by the connection but allowing the user to \"click through\" to send mail or access the service anyway. Experience indicates that users presented with such an option often \"click through\" without understanding the risks that they're accepting by doing so. Furthermore, users who frequently find the need to \"click through\" to use an insecure connection may become conditioned to do so as a matter of habit, before considering whether the risks are reasonable in each specific instance.",
      "zh-CHS": "“轻松访问”的示例是显示一个对话框，通知用户连接未满足帐户的安全要求，但允许用户“点击”发送邮件或访问服务。经验表明，提供此类选项的用户通常会“点击”，而不了解这样做所带来的风险。此外，经常发现需要“点击”以使用不安全连接的用户可能会习惯性地这样做，然后再考虑在每个特定情况下风险是否合理。"
    },
    {
      "indent": 3,
      "text": "An MUA that is not configured to require a minimum level of confidentiality for a Mail Account SHOULD still attempt to connect to the services associated with that account using the most secure means available, e.g., by using Implicit TLS or STARTTLS.",
      "zh-CHS": "未配置为要求邮件帐户具有最低保密级别的MUA仍应尝试使用最安全的可用方式（例如，使用隐式TLS或STARTTLS）连接到与该帐户关联的服务。"
    },
    {
      "indent": 0,
      "text": "5.3. Certificate Validation",
      "section_title": true,
      "zh-CHS": "5.3. 证书验证"
    },
    {
      "indent": 3,
      "text": "MUAs MUST validate TLS server certificates according to [RFC7817] and PKIX [RFC5280].",
      "zh-CHS": "MUA必须根据[RFC7817]和PKIX[RFC5280]验证TLS服务器证书。"
    },
    {
      "indent": 3,
      "text": "MUAs MAY also support DNS-Based Authentication of Named Entities (DANE) [RFC6698] as a means of validating server certificates in order to meet minimum confidentiality requirements.",
      "zh-CHS": "MUA还可以支持基于DNS的命名实体身份验证（DANE）[RFC6698]作为验证服务器证书的手段，以满足最低保密要求。"
    },
    {
      "indent": 3,
      "text": "MUAs MAY support the use of certificate pinning but MUST NOT consider a connection in which the server's authenticity relies on certificate pinning as providing the minimum level of confidentiality. (See Section 5.4.)",
      "zh-CHS": "MUAS可以支持证书钉扎的使用，但不能考虑服务器的真实性依赖于证书钉扎的连接，以提供最低级别的机密性。（见第5.4节。）"
    },
    {
      "indent": 0,
      "text": "5.4. Certificate Pinning",
      "section_title": true,
      "zh-CHS": "5.4. 证书固定"
    },
    {
      "indent": 3,
      "text": "During account setup, the MUA will identify servers that provide account services such as mail access and mail submission (Section 5.1 describes one way to do this). The certificates for these servers are verified using the rules described in [RFC7817] and PKIX [RFC5280]. In the event that the certificate does not validate due to an expired certificate, a lack of an appropriate chain of trust, or a lack of an identifier match, the MUA MAY offer to create a persistent binding between that certificate and the saved hostname for the server, for use when accessing that account's servers. This is called \"certificate pinning\".",
      "zh-CHS": "在帐户设置期间，MUA将识别提供帐户服务（如邮件访问和邮件提交）的服务器（第5.1节介绍了一种方法）。使用[RFC7817]和PKIX[RFC5280]中描述的规则验证这些服务器的证书。如果由于证书过期、缺少适当的信任链或缺少标识符匹配而导致证书无法验证，MUA可能会提供在该证书和服务器保存的主机名之间创建持久绑定，以便在访问该帐户的服务器时使用。这称为“证书固定”。"
    },
    {
      "indent": 3,
      "text": "(Note: This use of the term \"certificate pinning\" means something subtly different than HTTP Public Key Pinning as described in [RFC7469]. The dual use of the same term is confusing, but unfortunately both uses are well established.)",
      "zh-CHS": "（注意：术语“证书固定”的使用与[RFC7469]中所述的HTTP公钥固定有细微的不同。同一术语的双重使用令人困惑，但不幸的是，这两种用法都已确立。）"
    },
    {
      "indent": 3,
      "text": "Certificate pinning is only appropriate during Mail Account setup and MUST NOT be offered as an option in response to a failed certificate validation for an existing Mail Account. An MUA that allows certificate pinning MUST NOT allow a certificate pinned for one account to validate connections for other accounts. An MUA that allows certificate pinning MUST also allow a user to undo the pinning, i.e., to revoke trust in a certificate that has previously been pinned.",
      "zh-CHS": "证书固定仅适用于邮件帐户设置期间，不得作为响应现有邮件帐户证书验证失败的选项提供。允许固定证书的MUA不得允许固定一个帐户的证书来验证其他帐户的连接。允许证书固定的MUA还必须允许用户撤消固定，即撤销对先前已固定的证书的信任。"
    },
    {
      "indent": 3,
      "text": "A pinned certificate is subject to a man-in-the-middle attack at account setup time and typically lacks a mechanism to automatically revoke or securely refresh the certificate. Note also that a man-in-the-middle attack at account setup time will expose the user's password to the attacker (if a password is used). Therefore, the use of a pinned certificate does not meet the requirement for a minimum confidentiality level, and an MUA MUST NOT indicate to the user that such confidentiality is provided. Additional advice on certificate pinning is presented in [RFC6125].",
      "zh-CHS": "固定证书在帐户设置时会受到中间人攻击，并且通常缺少自动撤销或安全刷新证书的机制。还要注意，在帐户设置时，中间人攻击会将用户密码暴露给攻击者（如果使用密码）。因此，固定证书的使用不符合最低保密级别的要求，MUA不得向用户表明提供了此类保密性。[RFC6125]中提供了有关证书固定的其他建议。"
    },
    {
      "indent": 0,
      "text": "5.5. Client Certificate Authentication",
      "section_title": true,
      "zh-CHS": "5.5. 客户端证书身份验证"
    },
    {
      "indent": 3,
      "text": "MUAs MAY implement client certificate authentication on the Implicit TLS port. An MUA MUST NOT provide a client certificate during the TLS handshake unless the server requests one and the MUA has been authorized to use that client certificate with that account. Having the end user explicitly configure a client certificate for use with a given account is sufficient to meet this requirement. However, installing a client certificate for use with one account MUST NOT automatically authorize the use of that certificate with other accounts. This is not intended to prohibit site-specific authorization mechanisms, such as (a) a site-administrator-controlled mechanism to authorize the use of a client certificate with a given account or (b) a domain-name-matching mechanism.",
      "zh-CHS": "MUA可以在隐式TLS端口上实现客户端证书身份验证。MUA不得在TLS握手期间提供客户端证书，除非服务器请求提供客户端证书，并且MUA已被授权将该客户端证书用于该帐户。让最终用户显式配置客户机证书以用于给定帐户就足以满足此要求。但是，安装用于一个帐户的客户端证书不能自动授权将该证书用于其他帐户。这并不是为了禁止特定于站点的授权机制，例如（a）站点管理员控制的机制，用于授权使用具有给定帐户的客户端证书，或（b）域名匹配机制。"
    },
    {
      "indent": 3,
      "text": "Note: The requirement that the server request a certificate is just a restatement of the TLS protocol rules, e.g., Section 7.4.6 of [RFC5246]. The requirement that the client not send a certificate not known to be acceptable to the server is pragmatic in multiple ways: the current TLS protocol provides no way for the client to know which of the potentially multiple certificates it should use; also, when the client sends a certificate, it is potentially disclosing its identity (or its user's identity) to both the server and any party with access to the transmission medium, perhaps unnecessarily and for no useful purpose.",
      "zh-CHS": "注：服务器请求证书的要求只是对TLS协议规则的重申，例如[RFC5246]第7.4.6节。客户端不发送服务器不可接受的证书的要求在多个方面都是实用的：当前的TLS协议无法让客户端知道它应该使用哪些潜在的多个证书；此外，当客户机发送证书时，它可能向服务器和能够访问传输介质的任何一方披露其身份（或其用户的身份），这可能是不必要的，也没有任何有用的目的。"
    },
    {
      "indent": 3,
      "text": "A client supporting client certificate authentication with Implicit TLS MUST implement the SASL EXTERNAL mechanism [RFC4422], using the appropriate authentication command (AUTH for POP3 [RFC5034], AUTH for SMTP Submission [RFC4954], or AUTHENTICATE for IMAP [RFC3501]).",
      "zh-CHS": "支持隐式TLS客户端证书身份验证的客户端必须使用适当的身份验证命令（针对POP3的身份验证[RFC5034]、针对SMTP提交的身份验证[RFC4954]或针对IMAP的身份验证[RFC3501]），实现SASL外部机制[RFC4422]。"
    },
    {
      "indent": 0,
      "text": "6. Considerations Related to Antivirus/Antispam Software and Services",
      "section_title": true,
      "zh-CHS": "6. 与防病毒/反垃圾邮件软件和服务相关的注意事项"
    },
    {
      "indent": 3,
      "text": "There are multiple ways to connect an AVAS service (e.g., \"Antivirus & Antispam\") to a mail server. Some mechanisms, such as the de facto \"milter\" protocol, are out of scope for this specification. However, some services use an SMTP relay proxy that intercepts mail at the application layer to perform a scan and proxy or forward to another Mail Transfer Agent (MTA). Deploying AVAS services in this way can cause many problems [RFC2979], including direct interference with this specification, and other forms of confidentiality or security reduction. An AVAS product or service is considered compatible with this specification if all IMAP, POP, and SMTP-related software (including proxies) it includes are compliant with this specification.",
      "zh-CHS": "有多种方法可以将AVAS服务（例如，“防病毒和反垃圾邮件”）连接到邮件服务器。一些机制，如事实上的“milter”协议，超出了本规范的范围。但是，某些服务使用SMTP中继代理，该代理在应用程序层拦截邮件，以执行扫描和代理，或转发到另一个邮件传输代理（MTA）。以这种方式部署AVAS服务可能会导致许多问题[RFC2979]，包括直接干扰本规范，以及其他形式的保密性或安全性降低。如果AVAS产品或服务包含的所有IMAP、POP和SMTP相关软件（包括代理）均符合本规范，则视为与本规范兼容。"
    },
    {
      "indent": 3,
      "text": "Note that end-to-end email encryption prevents AVAS software and services from using email content as part of a spam or virus assessment. Furthermore, although a minimum confidentiality level can prevent a man-in-the-middle from introducing spam or virus content between the MUA and Submission server, it does not prevent other forms of client or account compromise. The use of AVAS services for submitted email therefore remains necessary.",
      "zh-CHS": "请注意，端到端电子邮件加密可防止AVAS软件和服务将电子邮件内容用作垃圾邮件或病毒评估的一部分。此外，尽管最低保密级别可以防止中间人在MUA和提交服务器之间引入垃圾邮件或病毒内容，但它不能防止其他形式的客户端或帐户泄露。因此，对提交的电子邮件使用AVAS服务仍然是必要的。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 0,
      "text": "7.1. POP3S Port Registration Update",
      "section_title": true,
      "zh-CHS": "7.1. POP3S端口注册更新"
    },
    {
      "indent": 3,
      "text": "IANA has updated the registration of the TCP well-known port 995 using the following template [RFC6335]:",
      "zh-CHS": "IANA已使用以下模板[RFC6335]更新TCP已知端口995的注册："
    },
    {
      "indent": 5,
      "text": "Service Name: pop3s\nTransport Protocol: TCP\nAssignee: IESG <iesg@ietf.org>\nContact: IETF Chair <chair@ietf.org>\nDescription: POP3 over TLS protocol\nReference: RFC 8314\nPort Number: 995",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7.2. IMAPS Port Registration Update",
      "section_title": true,
      "zh-CHS": "7.2. IMAPS端口注册更新"
    },
    {
      "indent": 3,
      "text": "IANA has updated the registration of the TCP well-known port 993 using the following template [RFC6335]:",
      "zh-CHS": "IANA已使用以下模板[RFC6335]更新TCP已知端口993的注册："
    },
    {
      "indent": 5,
      "text": "Service Name: imaps\nTransport Protocol: TCP\nAssignee: IESG <iesg@ietf.org>\nContact: IETF Chair <chair@ietf.org>\nDescription: IMAP over TLS protocol\nReference: RFC 8314\nPort Number: 993",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "No changes to existing UDP port assignments for pop3s or imaps are being requested.",
      "zh-CHS": "未请求更改POP3或IMAP的现有UDP端口分配。"
    },
    {
      "indent": 0,
      "text": "7.3. Submissions Port Registration",
      "section_title": true,
      "zh-CHS": "7.3. 提交港口注册"
    },
    {
      "indent": 3,
      "text": "IANA has assigned an alternate usage of TCP port 465 in addition to the current assignment using the following template [RFC6335]:",
      "zh-CHS": "IANA已使用以下模板[RFC6335]分配了TCP端口465的备用用法，以及当前分配："
    },
    {
      "indent": 5,
      "text": "Service Name: submissions\nTransport Protocol: TCP\nAssignee: IESG <iesg@ietf.org>\nContact: IETF Chair <chair@ietf.org>\nDescription: Message Submission over TLS protocol\nReference: RFC 8314\nPort Number: 465",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This is a one-time procedural exception to the rules in [RFC6335]. This requires explicit IESG approval and does not set a precedent. Note: Since the purpose of this alternate usage assignment is to align with widespread existing practice and there is no known usage of UDP port 465 for Message Submission over TLS, IANA has not assigned an alternate usage of UDP port 465.",
      "zh-CHS": "这是[RFC6335]中规则的一次性程序例外。这需要得到IESG的明确批准，并不构成先例。注意：由于此备用使用分配的目的是与广泛的现有实践保持一致，并且没有已知的UDP端口465用于通过TLS提交消息，因此IANA未分配UDP端口465的备用使用。"
    },
    {
      "indent": 3,
      "text": "Historically, port 465 was briefly registered as the \"smtps\" port. This registration made no sense, as the SMTP transport MX infrastructure has no way to specify a port, so port 25 is always used. As a result, the registration was revoked and was subsequently reassigned to a different service. In hindsight, the \"smtps\" registration should have been renamed or reserved rather than revoked. Unfortunately, some widely deployed mail software interpreted \"smtps\" as \"submissions\" [RFC6409] and used that port for email submission by default when an end user requested security during account setup. If a new port is assigned for the submissions service, either (a) email software will continue with unregistered use of port 465 (leaving the port registry inaccurate relative to",
      "zh-CHS": "历史上，465端口曾短暂注册为“smtps”端口。这种注册毫无意义，因为SMTP传输MX基础设施无法指定端口，因此始终使用端口25。结果，注册被撤销，随后被重新分配到其他服务。事后看来，“smtps”注册本应更名或保留，而不是撤销。不幸的是，一些广泛部署的邮件软件将“smtps”解释为“提交”[RFC6409]，并在最终用户在帐户设置期间请求安全性时默认使用该端口提交电子邮件。如果为提交服务分配了新端口，则（a）电子邮件软件将继续未注册地使用端口465（使端口注册表相对于"
    },
    {
      "indent": 3,
      "text": "de facto practice and wasting a well-known port) or (b) confusion between the de facto and registered ports will cause harmful interoperability problems that will deter the use of TLS for Message Submission. The authors of this document believe that both of these outcomes are less desirable than a \"wart\" in the registry documenting real-world usage of a port for two purposes. Although STARTTLS on port 587 has been deployed, it has not replaced the deployed use of Implicit TLS submission on port 465.",
      "zh-CHS": "事实上的做法和浪费一个众所周知的端口）或（b）事实上的端口和注册的端口之间的混淆将导致有害的互操作性问题，这将阻止使用TLS提交消息。本文件的作者认为，这两种结果都不如注册中心中记录港口实际使用情况的“疣”那么理想。虽然端口587上的STARTTLS已经部署，但它并没有取代端口465上隐式TLS提交的部署使用。"
    },
    {
      "indent": 0,
      "text": "7.4. Additional Registered Clauses for \"Received\" Fields",
      "section_title": true,
      "zh-CHS": "7.4. “已接收”字段的附加注册条款"
    },
    {
      "indent": 3,
      "text": "Per the provisions in [RFC5321], IANA has added two additional-registered-clauses for Received fields as defined in Section 4.3 of this document:",
      "zh-CHS": "根据[RFC5321]中的规定，IANA为本文件第4.3节中定义的接收字段添加了两个额外的注册条款："
    },
    {
      "indent": 3,
      "text": "o \"tls\": Indicates the TLS cipher used (if applicable)",
      "zh-CHS": "o “tls”：表示使用的tls密码（如适用）"
    },
    {
      "indent": 3,
      "text": "o \"group\": Indicates the Diffie-Hellman group used with the TLS cipher (if applicable)",
      "zh-CHS": "o “组”：表示与TLS密码一起使用的Diffie-Hellman组（如果适用）"
    },
    {
      "indent": 3,
      "text": "The descriptions and syntax of these additional clauses are provided in Section 4.3 of this document.",
      "zh-CHS": "本文件第4.3节提供了这些附加条款的说明和语法。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This entire document is about security considerations. In general, this is targeted to improve mail confidentiality and to mitigate threats external to the email system such as network-level snooping or interception; this is not intended to mitigate active attackers who have compromised service provider systems.",
      "zh-CHS": "整个文档都是关于安全方面的考虑。一般来说，这旨在提高邮件保密性，并缓解电子邮件系统外部的威胁，如网络级窥探或拦截；这并不是为了缓解已危害服务提供商系统的主动攻击者。"
    },
    {
      "indent": 3,
      "text": "Implementers should be aware that the use of client certificates with TLS 1.2 reveals the user's identity to any party with the ability to read packets from the transmission medium and therefore may compromise the user's privacy. There seems to be no easy fix with TLS 1.2 or earlier versions, other than to avoid presenting client certificates except when there is explicit authorization to do so. TLS 1.3 [TLS-1.3] appears to reduce this privacy risk somewhat.",
      "zh-CHS": "实施者应意识到，使用TLS 1.2的客户端证书会向能够从传输介质读取数据包的任何一方透露用户的身份，因此可能会损害用户的隐私。TLS 1.2或更早版本似乎没有简单的修复方法，除了避免提供客户端证书，除非有明确的授权这样做。TLS 1.3[TLS-1.3]似乎在一定程度上降低了这种隐私风险。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, DOI 10.17487/RFC0793, September 1981, <https://www.rfc-editor.org/info/rfc793>.",
      "zh-CHS": "[RFC793]Postel，J.，“传输控制协议”，标准7，RFC 793，DOI 10.17487/RFC0793，1981年9月<https://www.rfc-editor.org/info/rfc793>."
    },
    {
      "indent": 3,
      "text": "[RFC1939] Myers, J. and M. Rose, \"Post Office Protocol - Version 3\", STD 53, RFC 1939, DOI 10.17487/RFC1939, May 1996, <https://www.rfc-editor.org/info/rfc1939>.",
      "zh-CHS": "[RFC1939]迈尔斯，J.和M.罗斯，“邮局协议-第3版”，STD 53，RFC 1939，DOI 10.17487/RFC1939，1996年5月<https://www.rfc-editor.org/info/rfc1939>."
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，DOI 10.17487/RFC2119，1997年3月<https://www.rfc-editor.org/info/rfc2119>."
    },
    {
      "indent": 3,
      "text": "[RFC3207] Hoffman, P., \"SMTP Service Extension for Secure SMTP over Transport Layer Security\", RFC 3207, DOI 10.17487/RFC3207, February 2002, <https://www.rfc-editor.org/info/rfc3207>.",
      "zh-CHS": "[RFC3207]Hoffman，P.，“传输层安全SMTP的SMTP服务扩展”，RFC 3207，DOI 10.17487/RFC3207，2002年2月<https://www.rfc-editor.org/info/rfc3207>."
    },
    {
      "indent": 3,
      "text": "[RFC3501] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, DOI 10.17487/RFC3501, March 2003, <https://www.rfc-editor.org/info/rfc3501>.",
      "zh-CHS": "[RFC3501]Crispin，M.，“互联网消息访问协议-版本4rev1”，RFC 3501，DOI 10.17487/RFC3501，2003年3月<https://www.rfc-editor.org/info/rfc3501>."
    },
    {
      "indent": 3,
      "text": "[RFC4033] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"DNS Security Introduction and Requirements\", RFC 4033, DOI 10.17487/RFC4033, March 2005, <https://www.rfc-editor.org/info/rfc4033>.",
      "zh-CHS": "[RFC4033]Arends，R.，Austein，R.，Larson，M.，Massey，D.，和S.Rose，“DNS安全介绍和要求”，RFC 4033，DOI 10.17487/RFC4033，2005年3月<https://www.rfc-editor.org/info/rfc4033>."
    },
    {
      "indent": 3,
      "text": "[RFC5034] Siemborski, R. and A. Menon-Sen, \"The Post Office Protocol (POP3) Simple Authentication and Security Layer (SASL) Authentication Mechanism\", RFC 5034, DOI 10.17487/RFC5034, July 2007, <https://www.rfc-editor.org/info/rfc5034>.",
      "zh-CHS": "[RFC5034]Siemborski，R.和A.Menon Sen，“邮局协议（POP3）简单身份验证和安全层（SASL）身份验证机制”，RFC 5034，DOI 10.17487/RFC5034，2007年7月<https://www.rfc-editor.org/info/rfc5034>."
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <https://www.rfc-editor.org/info/rfc5234>.",
      "zh-CHS": "[RFC5234]Crocker，D.，Ed.，和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，DOI 10.17487/RFC5234，2008年1月<https://www.rfc-editor.org/info/rfc5234>."
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, DOI 10.17487/RFC5246, August 2008, <https://www.rfc-editor.org/info/rfc5246>.",
      "zh-CHS": "[RFC5246]Dierks，T.和E.Rescorla，“传输层安全（TLS）协议版本1.2”，RFC 5246，DOI 10.17487/RFC5246，2008年8月<https://www.rfc-editor.org/info/rfc5246>."
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, DOI 10.17487/RFC5280, May 2008, <https://www.rfc-editor.org/info/rfc5280>.",
      "zh-CHS": "[RFC5280]Cooper，D.，Santesson，S.，Farrell，S.，Boeyen，S.，Housley，R.，和W.Polk，“Internet X.509公钥基础设施证书和证书撤销列表（CRL）配置文件”，RFC 5280，DOI 10.17487/RFC5280，2008年5月<https://www.rfc-editor.org/info/rfc5280>."
    },
    {
      "indent": 3,
      "text": "[RFC5322] Resnick, P., Ed., \"Internet Message Format\", RFC 5322, DOI 10.17487/RFC5322, October 2008, <https://www.rfc-editor.org/info/rfc5322>.",
      "zh-CHS": "[RFC5322]Resnick，P.，Ed.，“互联网信息格式”，RFC 5322，DOI 10.17487/RFC5322，2008年10月<https://www.rfc-editor.org/info/rfc5322>."
    },
    {
      "indent": 3,
      "text": "[RFC6186] Daboo, C., \"Use of SRV Records for Locating Email Submission/Access Services\", RFC 6186, DOI 10.17487/RFC6186, March 2011, <https://www.rfc-editor.org/info/rfc6186>.",
      "zh-CHS": "[RFC6186]Daboo，C.“使用SRV记录查找电子邮件提交/访问服务”，RFC 6186，DOI 10.17487/RFC6186，2011年3月<https://www.rfc-editor.org/info/rfc6186>."
    },
    {
      "indent": 3,
      "text": "[RFC6409] Gellens, R. and J. Klensin, \"Message Submission for Mail\", STD 72, RFC 6409, DOI 10.17487/RFC6409, November 2011, <https://www.rfc-editor.org/info/rfc6409>.",
      "zh-CHS": "[RFC6409]Gellens，R.和J.Klensin，“邮件的邮件提交”，STD 72，RFC 6409，DOI 10.17487/RFC6409，2011年11月<https://www.rfc-editor.org/info/rfc6409>."
    },
    {
      "indent": 3,
      "text": "[RFC6698] Hoffman, P. and J. Schlyter, \"The DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS) Protocol: TLSA\", RFC 6698, DOI 10.17487/RFC6698, August 2012, <https://www.rfc-editor.org/info/rfc6698>.",
      "zh-CHS": "[RFC6698]Hoffman，P.和J.Schlyter，“基于DNS的命名实体认证（DANE）传输层安全（TLS）协议：TLSA”，RFC 6698，DOI 10.17487/RFC6698，2012年8月<https://www.rfc-editor.org/info/rfc6698>."
    },
    {
      "indent": 3,
      "text": "[RFC7525] Sheffer, Y., Holz, R., and P. Saint-Andre, \"Recommendations for Secure Use of Transport Layer Security (TLS) and Datagram Transport Layer Security (DTLS)\", BCP 195, RFC 7525, DOI 10.17487/RFC7525, May 2015, <https://www.rfc-editor.org/info/rfc7525>.",
      "zh-CHS": "[RFC7525]Sheffer，Y.，Holz，R.，和P.Saint Andre，“安全使用传输层安全性（TLS）和数据报传输层安全性（DTLS）的建议”，BCP 195，RFC 7525，DOI 10.17487/RFC7525，2015年5月<https://www.rfc-editor.org/info/rfc7525>."
    },
    {
      "indent": 3,
      "text": "[RFC7672] Dukhovni, V. and W. Hardaker, \"SMTP Security via Opportunistic DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS)\", RFC 7672, DOI 10.17487/RFC7672, October 2015, <https://www.rfc-editor.org/info/rfc7672>.",
      "zh-CHS": "[RFC7672]Dukhovni，V.和W.Hardaker，“通过基于机会DNS的命名实体身份验证（DANE）传输层安全性（TLS）实现SMTP安全”，RFC 7672，DOI 10.17487/RFC7672，2015年10月<https://www.rfc-editor.org/info/rfc7672>."
    },
    {
      "indent": 3,
      "text": "[RFC7817] Melnikov, A., \"Updated Transport Layer Security (TLS) Server Identity Check Procedure for Email-Related Protocols\", RFC 7817, DOI 10.17487/RFC7817, March 2016, <https://www.rfc-editor.org/info/rfc7817>.",
      "zh-CHS": "[RFC7817]Melnikov，A.，“电子邮件相关协议的更新传输层安全（TLS）服务器身份检查程序”，RFC 7817，DOI 10.17487/RFC78172016年3月<https://www.rfc-editor.org/info/rfc7817>."
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "zh-CHS": "[RFC8174]Leiba，B.，“RFC 2119关键词中大写与小写的歧义”，BCP 14，RFC 8174，DOI 10.17487/RFC8174，2017年5月<https://www.rfc-editor.org/info/rfc8174>."
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[CERT-555316] CERT, \"Vulnerability Note VU#555316: STARTTLS plaintext command injection vulnerability\", Carnegie Mellon University Software Engineering Institute, September 2011, <https://www.kb.cert.org/vuls/id/555316>.",
      "zh-CHS": "[CERT-555316]CERT，“漏洞注释VU#555316:STARTTLS明文命令注入漏洞”，卡内基梅隆大学软件工程研究所，2011年9月<https://www.kb.cert.org/vuls/id/555316>."
    },
    {
      "indent": 3,
      "text": "[Email-TLS] Moore, K., \"Recommendations for use of TLS by Electronic Mail Access Protocols\", Work in Progress, draft-moore-email-tls-00, October 2013.",
      "zh-CHS": "[电子邮件TLS]Moore，K.，“通过电子邮件访问协议使用TLS的建议”，正在进行的工作，草稿-Moore-Email-TLS-00，2013年10月。"
    },
    {
      "indent": 3,
      "text": "[MTA-STS] Margolis, D., Risher, M., Ramakrishnan, B., Brotman, A., and J. Jones, \"SMTP MTA Strict Transport Security (MTA-STS)\", Work in Progress, draft-ietf-uta-mta-sts-14, January 2018.",
      "zh-CHS": "[MTA-STS]Margolis，D.，Risher，M.，Ramakrishnan，B.，Brotman，A.，和J.Jones，“SMTP MTA严格传输安全（MTA-STS）”，正在进行的工作，草案-ietf-uta-MTA-STS-14，2018年1月。"
    },
    {
      "indent": 3,
      "text": "[POP3-over-TLS] Melnikov, A., Newman, C., and M. Yevstifeyev, Ed., \"POP3 over TLS\", Work in Progress, draft-melnikov-pop3- over-tls-02, August 2011.",
      "zh-CHS": "[POP3 over TLS]Melnikov，A.，Newman，C.，和M.Yevstifeyev，Ed.，“POP3 over TLS”，正在进行的工作，draft-Melnikov-POP3-over-TLS-022011年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2595] Newman, C., \"Using TLS with IMAP, POP3 and ACAP\", RFC 2595, DOI 10.17487/RFC2595, June 1999, <https://www.rfc-editor.org/info/rfc2595>.",
      "zh-CHS": "[RFC2595]Newman，C.，“将TLS与IMAP、POP3和ACAP一起使用”，RFC 2595，DOI 10.17487/RFC2595，1999年6月<https://www.rfc-editor.org/info/rfc2595>."
    },
    {
      "indent": 3,
      "text": "[RFC2979] Freed, N., \"Behavior of and Requirements for Internet Firewalls\", RFC 2979, DOI 10.17487/RFC2979, October 2000, <https://www.rfc-editor.org/info/rfc2979>.",
      "zh-CHS": "[RFC2979]Freed，N.，“互联网防火墙的行为和要求”，RFC 2979，DOI 10.17487/RFC2979，2000年10月<https://www.rfc-editor.org/info/rfc2979>."
    },
    {
      "indent": 3,
      "text": "[RFC3848] Newman, C., \"ESMTP and LMTP Transmission Types Registration\", RFC 3848, DOI 10.17487/RFC3848, July 2004, <https://www.rfc-editor.org/info/rfc3848>.",
      "zh-CHS": "[RFC3848]Newman，C.，“ESMTP和LMTP传输类型登记”，RFC 3848，DOI 10.17487/RFC3848，2004年7月<https://www.rfc-editor.org/info/rfc3848>."
    },
    {
      "indent": 3,
      "text": "[RFC4346] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.1\", RFC 4346, DOI 10.17487/RFC4346, April 2006, <https://www.rfc-editor.org/info/rfc4346>.",
      "zh-CHS": "[RFC4346]Dierks，T.和E.Rescorla，“传输层安全（TLS）协议版本1.1”，RFC 4346，DOI 10.17487/RFC4346，2006年4月<https://www.rfc-editor.org/info/rfc4346>."
    },
    {
      "indent": 3,
      "text": "[RFC4422] Melnikov, A., Ed., and K. Zeilenga, Ed., \"Simple Authentication and Security Layer (SASL)\", RFC 4422, DOI 10.17487/RFC4422, June 2006, <https://www.rfc-editor.org/info/rfc4422>.",
      "zh-CHS": "[RFC4422]Melnikov，A.，Ed.，和K.Zeilenga，Ed.，“简单身份验证和安全层（SASL）”，RFC 4422，DOI 10.17487/RFC4422，2006年6月<https://www.rfc-editor.org/info/rfc4422>."
    },
    {
      "indent": 3,
      "text": "[RFC4954] Siemborski, R., Ed., and A. Melnikov, Ed., \"SMTP Service Extension for Authentication\", RFC 4954, DOI 10.17487/RFC4954, July 2007, <https://www.rfc-editor.org/info/rfc4954>.",
      "zh-CHS": "[RFC4954]Siemborski，R.，Ed.，和A.Melnikov，Ed.，“用于身份验证的SMTP服务扩展”，RFC 4954，DOI 10.17487/RFC4954，2007年7月<https://www.rfc-editor.org/info/rfc4954>."
    },
    {
      "indent": 3,
      "text": "[RFC5068] Hutzler, C., Crocker, D., Resnick, P., Allman, E., and T. Finch, \"Email Submission Operations: Access and Accountability Requirements\", BCP 134, RFC 5068, DOI 10.17487/RFC5068, November 2007, <https://www.rfc-editor.org/info/rfc5068>.",
      "zh-CHS": "[RFC5068]Hutzler，C.，Crocker，D.，Resnick，P.，Allman，E.，和T.Finch，“电子邮件提交操作：访问和责任要求”，BCP 134，RFC 5068，DOI 10.17487/RFC5068，2007年11月<https://www.rfc-editor.org/info/rfc5068>."
    },
    {
      "indent": 3,
      "text": "[RFC5321] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 5321, DOI 10.17487/RFC5321, October 2008, <https://www.rfc-editor.org/info/rfc5321>.",
      "zh-CHS": "[RFC5321]Klensin，J.，“简单邮件传输协议”，RFC 5321DOI 10.17487/RFC5321，2008年10月<https://www.rfc-editor.org/info/rfc5321>."
    },
    {
      "indent": 3,
      "text": "[RFC6066] Eastlake 3rd, D., \"Transport Layer Security (TLS) Extensions: Extension Definitions\", RFC 6066, DOI 10.17487/RFC6066, January 2011, <https://www.rfc-editor.org/info/rfc6066>.",
      "zh-CHS": "[RFC6066]Eastlake 3rd，D.，“传输层安全（TLS）扩展：扩展定义”，RFC 6066，DOI 10.17487/RFC6066，2011年1月<https://www.rfc-editor.org/info/rfc6066>."
    },
    {
      "indent": 3,
      "text": "[RFC6125] Saint-Andre, P. and J. Hodges, \"Representation and Verification of Domain-Based Application Service Identity within Internet Public Key Infrastructure Using X.509 (PKIX) Certificates in the Context of Transport Layer Security (TLS)\", RFC 6125, DOI 10.17487/RFC6125, March 2011, <https://www.rfc-editor.org/info/rfc6125>.",
      "zh-CHS": "[RFC6125]Saint Andre，P.和J.Hodges，“在传输层安全（TLS）环境下使用X.509（PKIX）证书在互联网公钥基础设施内表示和验证基于域的应用程序服务身份”，RFC 6125，DOI 10.17487/RFC6125，2011年3月<https://www.rfc-editor.org/info/rfc6125>."
    },
    {
      "indent": 3,
      "text": "[RFC6335] Cotton, M., Eggert, L., Touch, J., Westerlund, M., and S. Cheshire, \"Internet Assigned Numbers Authority (IANA) Procedures for the Management of the Service Name and Transport Protocol Port Number Registry\", BCP 165, RFC 6335, DOI 10.17487/RFC6335, August 2011, <https://www.rfc-editor.org/info/rfc6335>.",
      "zh-CHS": "[RFC6335]Cotton，M.，Eggert，L.，Touch，J.，Westerlund，M.，和S.Cheshire，“互联网分配号码管理局（IANA）服务名称和传输协议端口号注册管理程序”，BCP 165，RFC 6335，DOI 10.17487/RFC6335，2011年8月<https://www.rfc-editor.org/info/rfc6335>."
    },
    {
      "indent": 3,
      "text": "[RFC7469] Evans, C., Palmer, C., and R. Sleevi, \"Public Key Pinning Extension for HTTP\", RFC 7469, DOI 10.17487/RFC7469, April 2015, <https://www.rfc-editor.org/info/rfc7469>.",
      "zh-CHS": "[RFC7469]Evans，C.，Palmer，C.，和R.Sleevi，“HTTP的公钥锁定扩展”，RFC 7469，DOI 10.17487/RFC7469，2015年4月<https://www.rfc-editor.org/info/rfc7469>."
    },
    {
      "indent": 3,
      "text": "[TLS-1.3] Rescorla, E., \"The Transport Layer Security (TLS) Protocol Version 1.3\", Work in Progress, draft-ietf-tls-tls13-23, January 2018.",
      "zh-CHS": "[TLS-1.3]Rescorla，E.“传输层安全（TLS）协议版本1.3”，正在进行的工作，草案-ietf-TLS-tls13-23，2018年1月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Design Considerations",
      "section_title": true,
      "zh-CHS": "附录A.设计注意事项"
    },
    {
      "indent": 3,
      "text": "This section is not normative.",
      "zh-CHS": "本节不规范。"
    },
    {
      "indent": 3,
      "text": "The first version of this document was written independently from the October 2013 version of [Email-TLS] (\"Recommendations for use of TLS by Electronic Mail Access Protocols\"). Subsequent versions merge ideas from both documents.",
      "zh-CHS": "本文件的第一个版本独立于2013年10月版本的[电子邮件TLS]（“通过电子邮件访问协议使用TLS的建议”）编写。后续版本合并了两个文档中的想法。"
    },
    {
      "indent": 3,
      "text": "One author of this document was also the author of RFC 2595, which became the standard for TLS usage with POP and IMAP, and the other author was perhaps the first to propose that idea. In hindsight, both authors now believe that that approach was a mistake. At this point, the authors believe that while anything that makes it easier to deploy TLS is good, the desirable end state is that these protocols always use TLS, leaving no need for a separate port for cleartext operation except to support legacy clients while they continue to be used. The separate-port model for TLS is inherently simpler to implement, debug, and deploy. It also enables a \"generic TLS load-balancer\" that accepts secure client connections for arbitrary foo-over-TLS protocols and forwards them to a server that may or may not support TLS. Such load-balancers cause many problems because they violate the end-to-end principle and the server loses the ability to log security-relevant information about the client unless the protocol is designed to forward that information (as this specification does for the ciphersuite). However, they can result in TLS deployment where it would not otherwise happen, which is a sufficiently important goal that it overrides any problems.",
      "zh-CHS": "本文档的一位作者也是RFC2595的作者，RFC2595成为了POP和IMAP使用TLS的标准，而另一位作者可能是第一个提出这一想法的人。事后看来，两位作者现在都认为这种方法是错误的。在这一点上，作者认为，尽管任何使TLS更容易部署的方法都是好的，但理想的最终状态是这些协议始终使用TLS，不需要为明文操作提供单独的端口，除非在继续使用传统客户端时支持它们。TLS的独立端口模型本质上更易于实现、调试和部署。它还支持一个“通用TLS负载平衡器”，该平衡器接受TLS协议上任意foo的安全客户端连接，并将它们转发到可能支持或不支持TLS的服务器。此类负载平衡器会导致许多问题，因为它们违反了端到端原则，服务器无法记录有关客户端的安全相关信息，除非协议设计用于转发该信息（如本规范针对ciphersuite所做的那样）。然而，它们可能导致TLS部署在本来不会发生的地方，这是一个非常重要的目标，它可以覆盖任何问题。"
    },
    {
      "indent": 3,
      "text": "Although STARTTLS appears only slightly more complex than separate-port TLS, we again learned the lesson that complexity is the enemy of security in the form of the STARTTLS command injection vulnerability (Computer Emergency Readiness Team (CERT) vulnerability ID #555316 [CERT-555316]). Although there's nothing inherently wrong with STARTTLS, the fact that it resulted in a common implementation error (made independently by multiple implementers) suggests that it is a less secure architecture than Implicit TLS.",
      "zh-CHS": "尽管STARTTLS看起来只比单独的端口TLS稍微复杂一点，但我们再次吸取了教训，即复杂性是安全的敌人，表现为STARTTLS命令注入漏洞（计算机应急准备团队（CERT）漏洞ID#555316[CERT-555316]）。尽管STARTTLS本身并没有什么问题，但它导致了一个常见的实现错误（由多个实现者独立产生）这一事实表明，它的安全性不如隐式TLS。"
    },
    {
      "indent": 3,
      "text": "Section 7 of RFC 2595 critiques the separate-port approach to TLS. The first bullet was a correct critique. There are proposals in the HTTP community to address that, and the use of SRV records as described in RFC 6186 resolves that critique for email. The second bullet is correct as well but is not very important because useful deployment of security layers other than TLS in email is small enough to be effectively irrelevant. (Also, it's less correct than it used to be because \"export\" ciphersuites are no longer supported in modern versions of TLS.) The third bullet is incorrect because it misses the desirable option of \"use TLS for all subsequent connections to",
      "zh-CHS": "RFC 2595第7节对TLS的独立端口方法进行了评论。第一颗子弹是正确的批评。HTTP社区提出了解决这一问题的建议，RFC6186中所述的SRV记录的使用解决了对电子邮件的批评。第二个要点也是正确的，但并不十分重要，因为电子邮件中除TLS之外的安全层的有用部署非常小，因此实际上无关紧要。（此外，由于TLS的现代版本不再支持“导出”密码套件，因此它比以前更不正确。）第三个项目符号不正确，因为它忽略了“将TLS用于所有后续连接”的理想选项"
    },
    {
      "indent": 3,
      "text": "this server once TLS is successfully negotiated\". The fourth bullet may be correct, but it is not a problem yet with current port consumption rates. The fundamental error was prioritizing a perceived better design based on a mostly valid critique over real-world deployability. But getting security and confidentiality facilities actually deployed is so important that it should trump design purity considerations.",
      "zh-CHS": "一旦成功协商TLS，此服务器将关闭“。第四项可能是正确的，但就目前的港口消费率而言，这还不是问题。根本的错误是，基于对现实世界可部署性的最有效的批评，优先考虑可感知的更好的设计。但实际部署安全和保密设施是如此重要，它应该胜过设计纯度考虑。"
    },
    {
      "indent": 3,
      "text": "Port 465 is presently used for two purposes: for submissions by a large number of clients and service providers and for the \"urd\" protocol by one vendor. Actually documenting this current state is controversial, as discussed in the IANA Considerations section. However, there is no good alternative. Registering a new port for submissions when port 465 is already widely used for that purpose will just create interoperability problems. Registering a port that's only used if advertised by an SRV record (RFC 6186) would not create interoperability problems but would require all client deployments, server deployments, and software to change significantly, which is contrary to the goal of promoting the increased use of TLS. Encouraging the use of STARTTLS on port 587 would not create interoperability problems, but it is unlikely to have any impact on the current undocumented use of port 465 and makes the guidance in this document less consistent. The remaining option is to document the current state of the world and support future use of port 465 for submission, as this increases consistency and ease of deployment for TLS email submission.",
      "zh-CHS": "端口465目前用于两个目的：用于大量客户和服务提供商的提交，以及一个供应商的“urd”协议。正如IANA注意事项一节所讨论的那样，实际记录这种当前状态是有争议的。然而，没有好的选择。当端口465已被广泛用于提交时，注册一个新端口只会产生互操作性问题。注册一个只有在SRV记录（RFC 6186）公布时才使用的端口不会产生互操作性问题，但需要对所有客户端部署、服务器部署和软件进行重大更改，这与提高TLS使用率的目标背道而驰。鼓励在587端口上使用STARTTLS不会产生互操作性问题，但不太可能对465端口当前未记录的使用产生任何影响，并使本文档中的指南不太一致。剩下的选项是记录世界的当前状态，并支持将来使用端口465进行提交，因为这提高了TLS电子邮件提交的一致性和部署的方便性。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "zh-CHS": "致谢"
    },
    {
      "indent": 3,
      "text": "Thanks to Ned Freed for discussion of the initial concepts in this document. Thanks to Alexey Melnikov for [POP3-over-TLS], which was the basis of the POP3 Implicit TLS text. Thanks to Russ Housley, Alexey Melnikov, and Dan Newman for review feedback. Thanks to Paul Hoffman for interesting feedback in initial conversations about this idea.",
      "zh-CHS": "感谢Ned Freed在本文档中对初始概念的讨论。感谢Alexey Melnikov的[POP3 over TLS]，这是POP3隐式TLS文本的基础。感谢Russ Housley、Alexey Melnikov和Dan Newman的评论反馈。感谢Paul Hoffman在关于此想法的初始对话中提供了有趣的反馈。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Keith Moore Windrock, Inc. PO Box 1934 Knoxville, TN 37901 United States of America",
      "zh-CHS": "Keith Moore Windrock，Inc.美国田纳西州诺克斯维尔市邮政信箱1934号，邮编：37901"
    },
    {
      "indent": 3,
      "text": "Email: moore@network-heretics.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Chris Newman Oracle 440 E. Huntington Dr., Suite 400 Arcadia, CA 91006 United States of America",
      "zh-CHS": "Chris Newman Oracle 440 E.Huntington博士，美国加利福尼亚州阿卡迪亚400室，91006"
    },
    {
      "indent": 3,
      "text": "Email: chris.newman@oracle.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}