{
  "title": {
    "text": "RFC 4439: Fibre Channel Fabric Address Manager MIB",
    "zh-CHS": "RFC 4439"
  },
  "number": 4439,
  "created_at": "2021-11-13 22:33:00.084237+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         C. DeSanti\nRequest for Comments: 4439                                    V. Gaonkar\nCategory: Standards Track                                  K. McCloghrie\n                                                           Cisco Systems\n                                                                  S. Gai\n                                                                 Retired\n                                                              March 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Fibre Channel Fabric Address Manager MIB",
      "zh-CHS": "光纤通道结构地址管理器MIB"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects for information related to a Fibre Channel network's Fabric Address Manager.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别是，它描述了与光纤通道网络的结构地址管理器相关的信息的托管对象。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. The Internet-Standard Management Framework ......................3\n3. Short Overview of Fibre Channel .................................3\n4. Relationship to Other MIBs ......................................4\n5. MIB Overview ....................................................5\n   5.1. Fibre Channel Management Instance ..........................5\n   5.2. Switch Index ...............................................5\n   5.3. Fabric Index ...............................................5\n   5.4. The t11FamGroup Group ......................................6\n   5.5. The t11FamDatabaseGroup Group ..............................6\n   5.6. The t11FamAreaGroup Group ..................................6\n   5.7. The t11FamCacheGroup Group .................................6\n   5.8. The t11FamCommandGroup Group ...............................6\n   5.9. The t11FamNotificationGroup Group ..........................6\n   5.10. Use of RCF and BF .........................................6\n6. Definitions .....................................................8\n   6.1. The T11-TC-MIB Module ......................................8\n   6.2. The T11-FC-FABRIC-ADDR-MGR-MIB Module ......................9\n7. Acknowledgements ...............................................35\n8. Normative References ...........................................36\n9. Informative References .........................................36\n10. IANA Considerations ...........................................37\n11. Security Considerations .......................................37",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects for information related to a Fibre Channel network's Fabric Address Manager. Fabric Address Manager refers to the functionality of acquiring DomainID(s) as specified in [FC-SW-3], and managing Fibre Channel Identifiers as specified in [FC-FS].",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别是，它描述了与光纤通道网络的结构地址管理器相关的信息的托管对象。结构地址管理器是指按照[FC-SW-3]中的规定获取域ID，并按照[FC-FS]中的规定管理光纤通道标识符的功能。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "2. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了符合SMIv2的MIB模块，如STD 58、RFC 2578[RFC2578]、STD 58、RFC 2579[RFC2579]和STD 58、RFC 2580[RFC2580]所述。"
    },
    {
      "indent": 0,
      "text": "3. Short Overview of Fibre Channel",
      "section_title": true,
      "zh-CHS": "3. 光纤通道简要概述"
    },
    {
      "indent": 3,
      "text": "The Fibre Channel (FC) is logically a bidirectional point-to-point serial data channel, structured for high performance. Fibre Channel provides a general transport vehicle for higher-level protocols such as Small Computer System Interface (SCSI) command sets, the High-Performance Parallel Interface (HIPPI) data framing, IP (Internet Protocol), IEEE 802.2, and others.",
      "zh-CHS": "光纤通道（FC）在逻辑上是一种双向点对点串行数据通道，其结构旨在实现高性能。光纤通道为高级协议（如小型计算机系统接口（SCSI）命令集、高性能并行接口（HIPI）数据帧、IP（Internet协议）、IEEE 802.2等）提供了通用传输工具。"
    },
    {
      "indent": 3,
      "text": "Physically, Fibre Channel is an interconnection of multiple communication points, called N_Ports, interconnected either by a switching network, called a Fabric, or by a point-to-point link. A Fibre Channel \"node\" consists of one or more N_Ports. A Fabric may consist of multiple Interconnect Elements, some of which are switches. An N_Port connects to the Fabric via a port on a switch called an F_Port. When multiple FC nodes are connected to a single port on a switch via an \"Arbitrated Loop\" topology, the switch port is called an FL_Port, and the nodes' ports are called NL_Ports. The term Nx_Port is used to refer to either an N_Port or an NL_Port. The term Fx_Port is used to refer to either an F_Port or an FL_Port. A switch port, which is interconnected to another switch port via an",
      "zh-CHS": "从物理上讲，光纤通道是多个通信点（称为N_端口）的互连，这些通信点通过交换网络（称为结构）或点到点链路互连。光纤通道“节点”由一个或多个N_端口组成。一个结构可以由多个互连元件组成，其中一些是交换机。N_端口通过交换机上称为F_端口的端口连接到结构。当多个FC节点通过“仲裁环路”拓扑连接到交换机上的单个端口时，交换机端口称为FL_端口，节点的端口称为NL_端口。术语Nx_端口用于指N_端口或NL_端口。术语Fx_端口用于指F_端口或FL_端口。一种交换机端口，通过网络与另一个交换机端口互连"
    },
    {
      "indent": 3,
      "text": "Inter-Switch Link (ISL), is called an E_Port. A B_Port connects a bridge device with an E_Port on a switch; a B_Port provides a subset of E_Port functionality.",
      "zh-CHS": "交换机间链路（ISL）称为E_端口。B_端口将桥接设备与交换机上的E_端口连接起来；B_端口提供E_端口功能的子集。"
    },
    {
      "indent": 3,
      "text": "Many Fibre Channel components, including the Fabric, each node, and most ports, have globally-unique names. These globally-unique names are typically formatted as World Wide Names (WWNs). More information on WWNs can be found in [FC-FS]. WWNs are expected to be persistent across agent and unit resets.",
      "zh-CHS": "许多光纤通道组件（包括光纤网、每个节点和大多数端口）具有全局唯一的名称。这些全局唯一的名称通常格式化为全球通用名称（WWN）。有关WWN的更多信息，请参见[FC-FS]。WWN预计将在代理和单元重置之间保持不变。"
    },
    {
      "indent": 3,
      "text": "Fibre Channel frames contain 24-bit address identifiers, which identify the frame's source and destination ports. Each FC port has both an address identifier and a WWN. When a Fabric is in use, the FC address identifiers are dynamically assigned by a switch. Each octet of a 24-bit address represents a level in an address hierarchy, with a Domain_ID being the highest level of the hierarchy.",
      "zh-CHS": "光纤通道帧包含24位地址标识符，用于标识帧的源端口和目标端口。每个FC端口都有地址标识符和WWN。在使用结构时，FC地址标识符由交换机动态分配。24位地址的每个八位字节表示地址层次结构中的一个级别，域ID是层次结构中的最高级别。"
    },
    {
      "indent": 3,
      "text": "Each switch in a Fabric is assigned one (or more) unique Domain_IDs using a two-step process. First, one switch, called Principal Switch, is selected from the switches of a Fabric. Then, the Principal Switch assigns Domain_IDs to the other switches of the Fabric. Address assignment within a domain is performed by the switch to which that Domain_ID is granted.",
      "zh-CHS": "结构中的每个交换机使用两步过程分配一个（或多个）唯一的域ID。首先，从结构的交换机中选择一个称为主体交换机的交换机。然后，主体交换机将域ID分配给结构的其他交换机。域内的地址分配由授予该域\\u ID的交换机执行。"
    },
    {
      "indent": 0,
      "text": "4. Relationship to Other MIBs",
      "section_title": true,
      "zh-CHS": "4. 与其他MIB的关系"
    },
    {
      "indent": 3,
      "text": "The first standardized MIB for Fibre Channel [RFC2837] was focused on Fibre Channel switches. It is being replaced by the more generic Fibre Channel Management MIB [FC-MGMT], which defines basic information for Fibre Channel hosts and switches, including extensions to the standard IF-MIB [IF-MIB] for Fibre Channel interfaces. [FC-MGMT] includes the specification of how the generic objects defined in [IF-MIB] apply to Fibre Channel interfaces.",
      "zh-CHS": "光纤通道的第一个标准化MIB[RFC2837]集中于光纤通道交换机。它正被更通用的光纤通道管理MIB[FC-MGMT]所取代，它定义了光纤通道主机和交换机的基本信息，包括光纤通道接口标准IF-MIB[IF-MIB]的扩展。[FC-MGMT]包括[IF-MIB]中定义的通用对象如何应用于光纤通道接口的规范。"
    },
    {
      "indent": 3,
      "text": "Note that an interface's ifIndex value must be unique within an SNMP context, irrespective of how many Fibre Channel management instances (see below) and how many Fibre Channel switches are instrumented within that SNMP context.",
      "zh-CHS": "请注意，在SNMP上下文中，无论有多少光纤通道管理实例（请参见下文）以及在该SNMP上下文中检测了多少光纤通道交换机，接口的ifIndex值都必须是唯一的。"
    },
    {
      "indent": 3,
      "text": "This document defines the T11-FC-FABRIC-ADDR-MGR-MIB module, which extends beyond [FC-MGMT] to cover the functionality, in Fibre Channel switches, which is used to manage Fabric configuration, domains, and addresses within a domain.",
      "zh-CHS": "本文档定义了光纤通道交换机中的T11-FC-FABRIC-ADDR-MGR-MIB模块，该模块扩展到[FC-MGMT]之外，以涵盖功能，用于管理域内的结构配置、域和地址。"
    },
    {
      "indent": 3,
      "text": "This document also contains a MIB module, T11-TC-MIB, to define textual conventions that might also be useful in other MIBs defined by T11.",
      "zh-CHS": "本文档还包含一个MIB模块T11-TC-MIB，用于定义文本约定，该约定在T11定义的其他MIB中也可能有用。"
    },
    {
      "indent": 0,
      "text": "5. MIB Overview",
      "section_title": true,
      "zh-CHS": "5. MIB概述"
    },
    {
      "indent": 3,
      "text": "This section explains the use of a Fibre Channel management instance, a Switch Index, and a Fabric Index. It also describes the six MIB groups contained in the MIB.",
      "zh-CHS": "本节介绍光纤通道管理实例、交换机索引和结构索引的使用。它还描述了MIB中包含的六个MIB组。"
    },
    {
      "indent": 0,
      "text": "5.1. Fibre Channel Management Instance",
      "section_title": true,
      "zh-CHS": "5.1. 光纤通道管理实例"
    },
    {
      "indent": 3,
      "text": "A Fibre Channel management instance is defined in [FC-MGMT] as a separable managed instance of Fibre Channel functionality. Fibre Channel functionality may be grouped into Fibre Channel management instances in whatever way is most convenient for the implementation(s). For example, one such grouping accommodates a single SNMP agent having multiple AgentX sub-agents, with each sub-agent implementing a different Fibre Channel management instance.",
      "zh-CHS": "光纤通道管理实例在[FC-MGMT]中定义为光纤通道功能的可分离托管实例。光纤通道功能可以以对实施最方便的方式分组到光纤通道管理实例中。例如，一个这样的分组容纳具有多个AgentX子代理的单个SNMP代理，每个子代理实现不同的光纤通道管理实例。"
    },
    {
      "indent": 3,
      "text": "The object, fcmInstanceIndex, is IMPORTed from the FC-MGMT-MIB [FC-MGMT] as the index value to uniquely identify a Fibre Channel management instance.",
      "zh-CHS": "对象fcmInstanceIndex作为索引值从FC-MGMT-MIB[FC-MGMT]导入，以唯一标识光纤通道管理实例。"
    },
    {
      "indent": 0,
      "text": "5.2. Switch Index",
      "section_title": true,
      "zh-CHS": "5.2. 开关指数"
    },
    {
      "indent": 3,
      "text": "The FC-MGMT-MIB [FC-MGMT] defines the fcmSwitchTable as a table of information about Fibre Channel switches that are managed by Fibre Channel management instances. Each Fibre Channel management instance can manage one or more Fibre Channel switches. The Switch Index, fcmSwitchIndex, is IMPORTed from the FC-MGMT-MIB as the index value to uniquely identify a Fibre Channel switch amongst those (one or more) managed by the same Fibre Channel management instance.",
      "zh-CHS": "FC-MGMT-MIB[FC-MGMT]将fcmSwitchTable定义为有关由光纤通道管理实例管理的光纤通道交换机的信息表。每个光纤通道管理实例都可以管理一个或多个光纤通道交换机。交换机索引fcmSwitchIndex作为索引值从FC-MGMT-MIB导入，以便在由同一光纤通道管理实例管理的那些（一个或多个）交换机中唯一标识光纤通道交换机。"
    },
    {
      "indent": 0,
      "text": "5.3. Fabric Index",
      "section_title": true,
      "zh-CHS": "5.3. 织物指数"
    },
    {
      "indent": 3,
      "text": "The [FC-SW-3] standard for an interconnecting Fabric consisting of multiple Fabric Switch elements describes the operation of a single Fabric in a physical infrastructure. The current [FC-SW-4] standard also supports the operation of multiple Virtual Fabrics operating within one (or more) physical infrastructures. In such a scenario, each Fabric has, of course, its own management instrumentation. In order to accommodate this scenario, this MIB module defines all Fabric-related information in tables that are INDEXed by an arbitrary integer, named a \"Fabric Index\". In a Fabric that is conformant to [FC-SW-3], the value of this Fabric Index will always be 1.",
      "zh-CHS": "由多个结构交换机元件组成的互连结构的[FC-SW-3]标准描述了物理基础设施中单个结构的操作。当前的[FC-SW-4]标准还支持在一个（或多个）物理基础设施内运行多个虚拟结构。在这种情况下，每个结构当然都有自己的管理工具。为了适应这种情况，此MIB模块在表中定义了所有与结构相关的信息，这些信息由一个名为“结构索引”的任意整数索引。在符合[FC-SW-3]的结构中，该结构索引的值始终为1。"
    },
    {
      "indent": 3,
      "text": "It is quite possible, and may even become likely, that (a port of) a Fibre Channel switch will be connected to multiple such Fabrics. Thus, in order to simplify a query concerning all the Fabrics to which a single switch is connected, fcmSwitchIndex will be listed before t11FamFabricIndex when they both appear in the same INDEX clause.",
      "zh-CHS": "光纤通道交换机（的一个端口）很可能（甚至可能）连接到多个这样的结构。因此，为了简化有关单个交换机连接到的所有结构的查询，当fcmSwitchIndex和t11FamFabricIndex出现在同一个INDEX子句中时，它们将列在T11FamFabriIndex之前。"
    },
    {
      "indent": 0,
      "text": "5.4. The t11FamGroup Group",
      "section_title": true,
      "zh-CHS": "5.4. T11FAMGOUP组"
    },
    {
      "indent": 3,
      "text": "This group contains basic information about the Fabric Address Manager functionality within a switch, including its configuration parameters that are per-interface (i.e., specified for a particular Fibre Channel interface identified by an ifIndex value).",
      "zh-CHS": "此组包含交换机内结构地址管理器功能的基本信息，包括每个接口的配置参数（即，为ifIndex值标识的特定光纤通道接口指定的配置参数）。"
    },
    {
      "indent": 0,
      "text": "5.5. The t11FamDatabaseGroup Group",
      "section_title": true,
      "zh-CHS": "5.5. t11FamDatabaseGroup组"
    },
    {
      "indent": 3,
      "text": "This group contains information about which switches are assigned to which domains.",
      "zh-CHS": "此组包含有关将哪些交换机分配给哪些域的信息。"
    },
    {
      "indent": 0,
      "text": "5.6. The t11FamAreaGroup Group",
      "section_title": true,
      "zh-CHS": "5.6. t11FamAreaGroup组"
    },
    {
      "indent": 3,
      "text": "This group contains information about which Port-IDs have been assigned within the areas of the local domain.",
      "zh-CHS": "此组包含有关在本地域区域内分配了哪些端口ID的信息。"
    },
    {
      "indent": 0,
      "text": "5.7. The t11FamCacheGroup Group",
      "section_title": true,
      "zh-CHS": "5.7. t11FamCacheGroup组"
    },
    {
      "indent": 3,
      "text": "This conditional mandatory group contains information about all the FC address identifier assignments that have been recently released. This cache is kept to support the concept of Preferred Domain_ID via a best-effort attempt for (short-term) re-assignment of the same FC address identifiers.",
      "zh-CHS": "此条件强制组包含有关最近发布的所有FC地址标识符分配的信息。该缓存通过尽最大努力（短期）重新分配相同FC地址标识符来支持首选域_ID的概念。"
    },
    {
      "indent": 0,
      "text": "5.8. The t11FamCommandGroup Group",
      "section_title": true,
      "zh-CHS": "5.8. t11FamCommandGroup组"
    },
    {
      "indent": 3,
      "text": "This optional group contains objects used for initiating an operation on a Fabric.",
      "zh-CHS": "此可选组包含用于在结构上启动操作的对象。"
    },
    {
      "indent": 0,
      "text": "5.9. The t11FamNotificationGroup Group",
      "section_title": true,
      "zh-CHS": "5.9. t11FamNotificationGroup组"
    },
    {
      "indent": 3,
      "text": "This group contains notifications of significant events concerning the Fabric Address management functionality within a switch.",
      "zh-CHS": "此组包含有关交换机内结构地址管理功能的重要事件的通知。"
    },
    {
      "indent": 0,
      "text": "5.10. Use of RCF and BF",
      "section_title": true,
      "zh-CHS": "5.10. 循环流化床和高炉的使用"
    },
    {
      "indent": 3,
      "text": "Included in [FC-SW-3] is the specification of Reconfigure Fabric (RCF) and Build Fabric (BF), both of which are command codes of the Switch Fabric Internal Link Service (SW_ILS). [FC-SW-3] includes the warning:",
      "zh-CHS": "[FC-SW-3]中包括重新配置结构（RCF）和构建结构（BF）的规范，这两种规范都是交换结构内部链路服务（SW_ILS）的命令代码。[FC-SW-3]包括警告："
    },
    {
      "indent": 6,
      "text": "NOTE 13 - Since the RCF causes a complete reconfiguration of the Fabric, and may cause addresses allocated to a Switch to change, this SW_ILS should be used with caution. The BF SW_ILS allows the Fabric to attempt reconfiguration without loss of or change of address and therefore should be attempted before an RCF. Examples of situations in which RCF may be appropriate include resolution of overlapped Domains, or the failure of a Fabric Reconfiguration initiated by a BF.",
      "zh-CHS": "注13-由于RCF会导致结构的完全重新配置，并可能导致分配给交换机的地址发生变化，因此应谨慎使用此软件。BF SW_ILS允许结构在不丢失或更改地址的情况下尝试重新配置，因此应在RCF之前尝试。RCF可能适用的情况示例包括解决重叠域，或BF启动的结构重新配置失败。"
    },
    {
      "indent": 3,
      "text": "Further, [FC-MI] specifies:",
      "zh-CHS": "此外，[FC-MI]规定："
    },
    {
      "indent": 6,
      "text": "A Fabric is prohibited from autonomously generating an RCF, but an outside administrative function may request a switch to generate an RCF. Such an administrative function is outside the scope of this technical report.",
      "zh-CHS": "禁止结构自动生成RCF，但外部管理功能可能会请求交换机生成RCF。此类管理职能不在本技术报告的范围内。"
    },
    {
      "indent": 3,
      "text": "The T11-FC-FABRIC-ADDR-MGR-MIB defined in this document is consistent with both of the above quotes since it defines two objects, t11FamAutoReconfigure and t11FamRestart, which are defined with a MAX-ACCESS of read-write, and setting them to the appropriate value is a means by which \"an outside administrative function may request a switch to generate an RCF\" [FC-MI].",
      "zh-CHS": "本文档中定义的T11-FC-FABRIC-ADDR-MGR-MIB与上述两个引号一致，因为它定义了两个对象，T11FamaAutoConfigure和t11FamRestart，这两个对象是通过读写的最大访问权限定义的，将它们设置为适当的值是“外部管理职能部门可请求交换机生成RCF”[FC-MI]。"
    },
    {
      "indent": 3,
      "text": "Note, however, the MIB specifies in its compliance section that the minimum required level of support for these two objects is read-only.",
      "zh-CHS": "但是，请注意，MIB在其compliance部分中指定这两个对象所需的最低支持级别为只读。"
    },
    {
      "indent": 3,
      "text": "Further, for both t11FamAutoReconfigure and t11FamRestart, the MIB serves only as a request to generate; it does not represent the action of the RCF or BF. That is, a successful SNMP SetRequest on these objects will cause an RCF (or BF) to be sent, but SNMP does not/cannot ensure the successful operation of the SW_ILS operation.",
      "zh-CHS": "此外，对于T11FamAutoConfigure和t11FamRestart，MIB仅用作生成的请求；它不代表RCF或BF的行动。也就是说，这些对象上成功的SNMP SetRequest将导致发送RCF（或BF），但SNMP不能/不能确保SW_ILS操作的成功运行。"
    },
    {
      "indent": 0,
      "text": "6. Definitions",
      "section_title": true,
      "zh-CHS": "6. 定义"
    },
    {
      "indent": 0,
      "text": "6.1. The T11-TC-MIB Module",
      "section_title": true,
      "zh-CHS": "6.1. T11-TC-MIB模块"
    },
    {
      "indent": 0,
      "text": "T11-TC-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, Unsigned32, mib-2 FROM SNMPv2-SMI -- [RFC2578] TEXTUAL-CONVENTION FROM SNMPv2-TC; -- [RFC2579]",
      "zh-CHS": "从SNMPv2 SMI中导入模块标识、未签名32、mib-2--[RFC2578]文本约定从SNMPv2 TC；--[RFC2579]"
    },
    {
      "indent": 0,
      "text": "t11TcMIB MODULE-IDENTITY LAST-UPDATED \"200603020000Z\" ORGANIZATION \"T11\" CONTACT-INFO \" Claudio DeSanti Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA Phone: +1 408 853-9172 EMail: cds@cisco.com",
      "zh-CHS": "t11TcMIB MODULE-IDENTITY上次更新的“2006030200000Z”组织“T11”联系人信息“Claudio DeSanti Cisco Systems，Inc.美国加利福尼亚州圣何塞市西塔斯曼大道170号95134电话：+1 408 853-9172电子邮件：cds@cisco.com"
    },
    {
      "indent": 4,
      "text": " Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA USA 95134 Phone: +1 408-526-5260 EMail: kzm@cisco.com\" DESCRIPTION \"This module defines textual conventions used in T11 MIBs.",
      "zh-CHS": "Keith McCloghrie Cisco Systems，Inc.美国加利福尼亚州圣何塞西塔斯曼大道170号95134电话：+1 408-526-5260电子邮件：kzm@cisco.com“说明”此模块定义T11 MIB中使用的文本约定。"
    },
    {
      "indent": 4,
      "text": "       Copyright (C) The Internet Society (2006).  This version\n       of this MIB module is part of RFC 4439;  see the RFC\n       itself for full legal notices.\"\nREVISION    \"200603020000Z\"\nDESCRIPTION\n       \"Initial version of this MIB module, published as RFC 4439.\"\n::= { mib-2 136 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "T11FabricIndex ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT  \"d\"\n    STATUS    current\n    DESCRIPTION\n           \"A Fabric Index that is used as a unique\n           index value to identify a particular Fabric within\n           one (or more) physical infrastructures.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "In an environment that is conformant to FC-SW-3, where",
      "zh-CHS": "在符合FC-SW-3的环境中，其中"
    },
    {
      "indent": 11,
      "text": "there is always exactly one Fabric in a single physical infrastructure, the value of this Fabric Index will always be 1.",
      "zh-CHS": "单个物理基础结构中始终只有一个结构，此结构索引的值始终为1。"
    },
    {
      "indent": 11,
      "text": "However, the current standard, FC-SW-4, defines how multiple Fabrics, each with its own management instrumentation, could operate within one (or more) physical infrastructures. When such multiple Fabrics are in use, this index value is used to uniquely identify a particular Fabric within a physical infrastructure.",
      "zh-CHS": "但是，当前的标准FC-SW-4定义了多个结构如何在一个（或多个）物理基础架构内运行，每个结构都有自己的管理工具。当使用这样的多个结构时，此索引值用于唯一标识物理基础结构中的特定结构。"
    },
    {
      "indent": 4,
      "text": " Note that the value of this textual convention has a range of (0..4095) so as to be consistent with FC-SW-4, which says that a 'VF_ID Bitmap' is 512 bytes long, with the high-order bit representing VF_ID zero, and the low-order bit representing 4095.\" REFERENCE \"Fibre Channel - Switch Fabric - 4 (FC-SW-4), ANSI INCITS 418-2006, section 6.1.27.2.4.\" SYNTAX Unsigned32 (0..4095)",
      "zh-CHS": "请注意，此文本约定的值的范围为（0..4095），以便与FC-SW-4一致，FC-SW-4表示“VF_ID位图”为512字节长，高阶位表示VF_ID零，低阶位表示4095。“参考”光纤通道-交换机结构-4（FC-SW-4），ANSI INCITS 418-2006，第6.1.27.2.4节。“语法未签名32（0..4095）"
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "6.2. The T11-FC-FABRIC-ADDR-MGR-MIB Module",
      "section_title": true,
      "zh-CHS": "6.2. T11-FC-FABRIC-ADDR-MGR-MIB模块"
    },
    {
      "indent": 0,
      "text": "T11-FC-FABRIC-ADDR-MGR-MIB  DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- the Fibre Channel Fabric Address Manager MIB\n--\n-- for management of the functionality, in Fibre Channel switches,\n-- which is used to manage fabric configuration, domains, and\n-- addresses within a domain.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS\n    MODULE-IDENTITY, OBJECT-TYPE,\n    NOTIFICATION-TYPE, Unsigned32,\n    Counter32, Gauge32, mib-2          FROM SNMPv2-SMI   -- [RFC2578]\n    MODULE-COMPLIANCE, OBJECT-GROUP,\n    NOTIFICATION-GROUP                 FROM SNMPv2-CONF  -- [RFC2580]\n    TEXTUAL-CONVENTION, TruthValue,\n    RowStatus                          FROM SNMPv2-TC    -- [RFC2579]\n    ifIndex                            FROM IF-MIB       -- [IF-MIB]\n    fcmInstanceIndex, fcmSwitchIndex,\n    FcDomainIdOrZero, FcNameIdOrZero   FROM FC-MGMT-MIB  -- [FC-MGMT]\n    T11FabricIndex                     FROM T11-TC-MIB;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FcFabricAddrMgrMIB MODULE-IDENTITY",
      "zh-CHS": "t11FcFabricAddrMgrMIB模块标识"
    },
    {
      "indent": 4,
      "text": "LAST-UPDATED \"200603020000Z\" ORGANIZATION \"T11\" CONTACT-INFO \" Claudio DeSanti Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA Phone: +1 408 853-9172 EMail: cds@cisco.com",
      "zh-CHS": "最近更新的“200603020000Z”组织“T11”联系人信息“Claudio DeSanti Cisco Systems，Inc.170 West Tasman Drive San Jose，CA 95134美国电话：+1 408 853-9172电子邮件：cds@cisco.com"
    },
    {
      "indent": 4,
      "text": " Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA USA 95134 Phone: +1 408-526-5260 EMail: kzm@cisco.com\" DESCRIPTION \"The MIB module for the Fabric Address management functionality defined by the Fibre Channel standards. For the purposes of this MIB, Fabric Address Manager refers to the functionality of acquiring DomainID(s) as specified in FC-SW-3, and managing Fibre Channel Identifiers as specified in FC-FS. An instance of 'Fabric Address Manager' software functionality executes in the Principal Switch, and in each other switch.",
      "zh-CHS": "Keith McCloghrie Cisco Systems，Inc.美国加利福尼亚州圣何塞西塔斯曼大道170号95134电话：+1 408-526-5260电子邮件：kzm@cisco.com“说明”光纤通道标准定义的结构地址管理功能的MIB模块。在本MIB中，结构地址管理器指的是获取FC-SW-3中指定的域ID和管理FC-FS中指定的光纤通道标识符的功能。“结构地址管理器”软件功能的实例在主交换机和其他交换机中执行。"
    },
    {
      "indent": 11,
      "text": "After an agent reboot, the values of read-write objects defined in this MIB module are implementation-dependent.",
      "zh-CHS": "代理重新启动后，此MIB模块中定义的读写对象的值取决于实现。"
    },
    {
      "indent": 4,
      "text": "       Copyright (C) The Internet Society (2006).  This version of\n       this MIB module is part of RFC 4439;  see the RFC itself for\n       full legal notices.\"\nREVISION    \"200603020000Z\"\nDESCRIPTION\n       \"Initial version of this MIB module, published as RFC 4439.\"\n::= { mib-2 137 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamNotifications   OBJECT IDENTIFIER ::= { t11FcFabricAddrMgrMIB 0 }\nt11FamMIBObjects      OBJECT IDENTIFIER ::= { t11FcFabricAddrMgrMIB 1 }\nt11FamMIBConformance  OBJECT IDENTIFIER ::= { t11FcFabricAddrMgrMIB 2 }\nt11FamConfiguration   OBJECT IDENTIFIER ::= { t11FamMIBObjects 1 }\nt11FamInfo            OBJECT IDENTIFIER ::= { t11FamMIBObjects 2 }\nt11FamNotifyControl   OBJECT IDENTIFIER ::= { t11FamMIBObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Textual Conventions",
      "zh-CHS": "--文本约定"
    },
    {
      "indent": 0,
      "text": "T11FamDomainPriority ::= TEXTUAL-CONVENTION",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "DISPLAY-HINT \"d\" STATUS current DESCRIPTION \"Priority of a switch.",
      "zh-CHS": "显示提示“d”状态当前描述“开关优先级”。"
    },
    {
      "indent": 11,
      "text": "The Principal Switch selection is influenced by the priority of the switches.",
      "zh-CHS": "主开关的选择受开关优先级的影响。"
    },
    {
      "indent": 11,
      "text": "Some values of importance are:",
      "zh-CHS": "一些重要的价值观是："
    },
    {
      "indent": 4,
      "text": " 1 : The highest priority in Principal Switch selection, which is used by the administrator to establish which switch becomes the Principal Switch. 255 : Indicates that the switch is not capable of acting as a Principal Switch.\" REFERENCE \"Fibre Channel - Switch Fabric - 3 (FC-SW-3), ANSI INCITS 384-2004, section 6.1.5.\" SYNTAX Unsigned32 (1..255)",
      "zh-CHS": "1：主体交换机选择中的最高优先级，管理员使用该优先级确定哪个交换机成为主体交换机。255：表示交换机不能充当主交换机。“参考”光纤通道-交换机结构-3（FC-SW-3），ANSI INCITS 384-2004，第6.1.5节。“语法无符号32（1..255）"
    },
    {
      "indent": 0,
      "text": "T11FamDomainInterfaceRole ::= TEXTUAL-CONVENTION\n    STATUS    current\n    DESCRIPTION\n           \"The 'designated' state/role of the Inter-Switch Link (ISL)\n           to which an interface connects, or (if not connected)\n           the state of the interface:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "       nonPrincipal (1)       - non-Principal ISL\n       principalUpstream (2)  - Upstream Principal ISL\n       principalDownsteam (3) - Downstream Principal ISL\n       isolated (4)           - interface is isolated\n       down (5)               - interface is down\n       unknown (6)            - state/role is unknown\n       \"\nREFERENCE   \"Fibre Channel - Switch Fabric - 3 (FC-SW-3),\n             ANSI INCITS 384-2004, Sections 3.1, 5.7,\n             and Figure 9.\"\nSYNTAX    INTEGER {\n                   nonPrincipal (1),\n                   principalUpstream (2),\n                   principalDownsteam (3),\n                   isolated (4),\n                   down (5),\n                   unknown (6)\n          }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "T11FamState ::= TEXTUAL-CONVENTION\n    STATUS    current",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"The state of the Fabric Address Manager, as described in Table 86 and Figure 15 of FC-SW-3.",
      "zh-CHS": "DESCRIPTION“光纤网地址管理器的状态，如FC-SW-3的表86和图15所述。"
    },
    {
      "indent": 11,
      "text": "- 'other' represents a switch that is in a state not represented by any of the below enumerations.",
      "zh-CHS": "- “other”表示处于以下任何枚举均不表示的状态的交换机。"
    },
    {
      "indent": 11,
      "text": "- 'starting' represents a switch engaged in the process represented by the first row in Table 86.",
      "zh-CHS": "- “启动”表示参与表86中第一行所示过程的开关。"
    },
    {
      "indent": 11,
      "text": "- 'unconfigured' represents a switch that requires operator input before it can begin the process represented by the first row in Table 86.",
      "zh-CHS": "- “unconfigured”（未配置）表示需要操作员输入才能开始表86中第一行所示流程的交换机。"
    },
    {
      "indent": 11,
      "text": "- 'principalSwitchSelection' represents a switch engaged in the process represented by the second row in Table 86, but not in states F0 or F1 of Figure 15.",
      "zh-CHS": "- “principalSwitchSelection”表示参与表86第二行所示过程的交换机，但不在图15的状态F0或F1中。"
    },
    {
      "indent": 11,
      "text": "- 'domainIdDistribution' represents a switch engaged in the process represented by the third row in Table 86.",
      "zh-CHS": "- “domainIdDistribution”表示参与表86第三行所示流程的交换机。"
    },
    {
      "indent": 11,
      "text": "- 'buildFabricPhase' represents a switch that is in state F0 of Figure 15.",
      "zh-CHS": "- “buildFabricPhase”表示处于图15中F0状态的交换机。"
    },
    {
      "indent": 11,
      "text": "- 'reconfigureFabricPhase' represents a switch that is in state F1 of Figure 15.",
      "zh-CHS": "- “reconfigureFabricPhase”表示处于图15状态F1的交换机。"
    },
    {
      "indent": 11,
      "text": "- 'stable' represents a switch that has successfully completed the process represented by the third row in Table 86 and has at least one E_Port.",
      "zh-CHS": "- “稳定”表示已成功完成表86中第三行所示流程的交换机，并且至少有一个E_端口。"
    },
    {
      "indent": 11,
      "text": "- 'stableWithNoEports' represents a switch that has successfully completed the process represented by the third row in Table 86 but has no E_Ports.",
      "zh-CHS": "- “stableWithNoEports”表示已成功完成表86中第三行所示流程但没有E_端口的交换机。"
    },
    {
      "indent": 11,
      "text": "- 'noDomains' represents a switch that has completed the process represented by the third row in Table 86 but failed to obtain a Domain_ID.",
      "zh-CHS": "- “节点域”表示已完成表86中第三行表示的过程但未能获取域ID的交换机。"
    },
    {
      "indent": 11,
      "text": "- 'disabled' represents any situation in which the corresponding instance of t11FamEnable has the value 'false'.",
      "zh-CHS": "- “disabled”表示T11Familable的对应实例的值为“false”的任何情况。"
    },
    {
      "indent": 4,
      "text": " - 'unknown' represents a switch that is confused about what state it is in.\" REFERENCE \"Fibre Channel - Switch Fabric - 3 (FC-SW-3), ANSI INCITS 384-2004, Table 86 and Figure 15.\" SYNTAX INTEGER {",
      "zh-CHS": "-“unknown”表示对其处于何种状态感到困惑的交换机。“参考”光纤通道-交换机结构-3（FC-SW-3），ANSI INCITS 384-2004，表86和图15。“语法整数”{"
    },
    {
      "indent": 14,
      "text": " other(1), starting(2), unconfigured(3), principalSwitchSelection(4), domainIdDistribution(5), buildFabricPhase(6), reconfigureFabricPhase(7), stable(8), stableWithNoEports(9), noDomains(10), disabled(11), unknown(12) }",
      "zh-CHS": "其他（1）、启动（2）、未配置（3）、主开关选择（4）、域ID分布（5）、构建Fabric阶段（6）、重新配置阶段（7）、稳定（8）、无端口稳定（9）、节点域（10）、禁用（11）、未知（12）}"
    },
    {
      "indent": 0,
      "text": "-- -- t11FamTable --",
      "zh-CHS": "----T11表格--"
    },
    {
      "indent": 0,
      "text": "t11FamTable  OBJECT-TYPE\n    SYNTAX     SEQUENCE OF T11FamEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n           \"This table contains Fabric Address Manager related\n           parameters that are able to be configured and monitored\n           in a Fibre Channel switch.  For each of the switches\n           (identified by fcmSwitchIndex) managed by a Fibre Channel\n           management instance (identified by fcmInstanceIndex),\n           there is any entry for each Fabric known to that switch.\n           Entries are implicitly created/removed if and when\n           additional Fabrics are created/deleted.\"\n    ::= { t11FamConfiguration 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamEntry OBJECT-TYPE\n    SYNTAX     T11FamEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n           \"An entry provides information on the local Fabric Address\n           Manager functionality for a Fabric known to a\n           particular switch.\"\n    INDEX { fcmInstanceIndex, fcmSwitchIndex, t11FamFabricIndex }\n    ::= { t11FamTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "T11FamEntry ::= SEQUENCE {\n    t11FamFabricIndex                       T11FabricIndex,\n    t11FamConfigDomainId                    FcDomainIdOrZero,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": " t11FamConfigDomainIdType INTEGER, t11FamAutoReconfigure TruthValue, t11FamContiguousAllocation TruthValue, t11FamPriority T11FamDomainPriority, t11FamPrincipalSwitchWwn FcNameIdOrZero, t11FamLocalSwitchWwn FcNameIdOrZero, t11FamAssignedAreaIdList OCTET STRING, t11FamGrantedFcIds Counter32, t11FamRecoveredFcIds Counter32, t11FamFreeFcIds Gauge32, t11FamAssignedFcIds Gauge32, t11FamAvailableFcIds Gauge32, t11FamRunningPriority T11FamDomainPriority, t11FamPrincSwRunningPriority T11FamDomainPriority, t11FamState T11FamState, t11FamLocalPrincipalSwitchSlctns Counter32, t11FamPrincipalSwitchSelections Counter32, t11FamBuildFabrics Counter32, t11FamFabricReconfigures Counter32, t11FamDomainId FcDomainIdOrZero, t11FamSticky TruthValue, t11FamRestart INTEGER, t11FamRcFabricNotifyEnable TruthValue, t11FamEnable TruthValue, t11FamFabricName FcNameIdOrZero }",
      "zh-CHS": "t11FamConfigDomainIdType INTEGER，T11FamAuto-Reconfigure TruthValue，T11FamContinguous Allocation TruthValue，T11FamDomainPriority，t11FamPrincipalSwitchWwn FcNameIdOrZero，t11FamLocalSwitchWwn FcNameIdOrZero，T11FamAssignedAriedList八进制字符串，T11FamGrandedFCIDS计数器32，t11FamRecoveredFcIds计数器32，t11FamFreeFcIds量表32，T11指定的CIDS仪表32、T11可用的FCID仪表32、T11运行优先级T11内存域优先级、T11内存运行优先级T11内存域优先级、T11内存状态T11内存状态、T11本地主开关计数器32、T11内存主开关选择计数器32、T11内存构建结构计数器32、T11内存制造经济图计数器32、，t11FamDomainId FcDomainIdOrZero、t11FamSticky TruthValue、t11FamRestart INTEGER、t11FamRcFabricNotifyEnable TruthValue、t11FamFabricName FcNameIdOrZero}"
    },
    {
      "indent": 0,
      "text": "t11FamFabricIndex OBJECT-TYPE SYNTAX T11FabricIndex MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A unique index value that uniquely identifies a particular Fabric known to a particular switch.",
      "zh-CHS": "T11FabricIndex对象类型语法T11FabricIndex MAX-ACCESS不可访问状态当前描述“唯一索引值，用于唯一标识特定交换机已知的特定结构。"
    },
    {
      "indent": 11,
      "text": "In a Fabric conformant to FC-SW-3, only a single Fabric can operate within a physical infrastructure, and thus, the value of this Fabric Index will always be 1.",
      "zh-CHS": "在符合FC-SW-3的结构中，只有一个结构可以在物理基础设施中运行，因此，此结构索引的值始终为1。"
    },
    {
      "indent": 4,
      "text": "       However, the current standard, FC-SW-4, defines\n       how multiple Fabrics, each with its own management\n       instrumentation, could operate within one (or more)\n       physical infrastructures.  When such multiple Fabrics\n       are in use, this index value is used to uniquely\n       identify a particular Fabric within a physical\n       infrastructure.\"\n::= { t11FamEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamConfigDomainId OBJECT-TYPE SYNTAX FcDomainIdOrZero MAX-ACCESS read-write STATUS current DESCRIPTION \"The configured Domain_ID of the particular switch on this Fabric, or zero if no Domain_ID has been configured. The meaning of this object depends on t11FamConfigDomainIdType object.",
      "zh-CHS": "t11FamConfigDomainId对象类型语法FcDomainIdOrZero最大访问读写状态当前描述“此结构上特定交换机的已配置域ID，如果未配置域ID，则为零。此对象的含义取决于t11FamConfigDomainIdType对象。"
    },
    {
      "indent": 11,
      "text": "If t11FamConfigDomainIdType is 'preferred', then the configured Domain_ID is called the 'preferred Domain_ID'. Valid values are between 0 and 239. In a situation where this Domain_ID cannot be assigned, any other Domain_ID will be acceptable. A value of zero means any Domain_ID.",
      "zh-CHS": "如果域ID为“首选”，则域ID为“首选”。有效值介于0和239之间。在无法分配此域ID的情况下，可以接受任何其他域ID。值为零表示任何域ID。"
    },
    {
      "indent": 11,
      "text": "If t11FamConfigDomainIdType is 'insistent', then the configured Domain_ID is called the 'insistent Domain_ID' and valid values are between 1 and 239. In a situation where this Domain_ID cannot be assigned, no other Domain_ID is acceptable.",
      "zh-CHS": "如果t11FamConfigDomainIdType为“持续”，则配置的域ID称为“持续域ID”，有效值介于1和239之间。在无法分配此域ID的情况下，不接受其他域ID。"
    },
    {
      "indent": 11,
      "text": "In both of the above cases, the switch sends an RDI (Request Domain_ID) to request this Domain_ID to the Principal Switch. If no Domain_ID is able to be granted in the case of 'preferred', or if an 'insistent' Domain_ID is configured but not able to be granted, then it is an error condition. When this error occurs, the switch will continue as if it receives a SW_RJT with a reason/explanation of 'Unable to perform command request'/'Domain_ID not available'. That is, its E_Ports on that Fabric will be isolated and the administrator informed via a 't11FamDomainIdNotAssigned' notification.",
      "zh-CHS": "在上述两种情况下，交换机都会发送一个RDI（请求域ID）来向主交换机请求该域ID。如果在“首选”情况下无法授予任何域\\u ID，或者如果配置了“持续”域\\u ID但无法授予，则这是一个错误条件。发生此错误时，交换机将继续运行，就像它接收到一个SW_RJT，其原因/解释为“无法执行命令请求”/“域ID不可用”。也就是说，它在该结构上的E_端口将被隔离，并通过“t11FamDomainIdNotAssigned”通知管理员。"
    },
    {
      "indent": 11,
      "text": "If t11FamConfigDomainIdType is 'static', then the configured Domain_ID is called the 'static Domain_ID' and valid values are between 1 and 239. In this situation, there is no Principal Switch in the Fabric and the Domain_ID is simply assigned by configuration, together with the Fabric_Name. A switch configured with a static Domain_ID, on receiving an EFP, BF, RCF, DIA, or RDI SW_ILS, shall reply with an SW_RJT having Reason Code Explanation 'E_Port is Isolated' and shall isolate the receiving E_Port.",
      "zh-CHS": "如果t11FamConfigDomainIdType为“静态”，则配置的域ID称为“静态域ID”，有效值介于1和239之间。在这种情况下，结构中没有主交换机，域ID仅通过配置和结构名称分配。配置有静态域ID的交换机在接收EFP、BF、RCF、DIA或RDI SW_ILS时，应回复SW_RJT，原因码解释为“E_端口已隔离”，并应隔离接收E_端口。"
    },
    {
      "indent": 4,
      "text": " For the persistence of values across reboots, see the MODULE-IDENTITY's DESCRIPTION clause.\" REFERENCE \"Fibre Channel - Switch Fabric - 4 (FC-SW-4), ANSI INCITS 418-2006, section 7.\"",
      "zh-CHS": "有关重新启动期间值的持久性，请参阅MODULE-IDENTITY的说明条款。“参考”光纤通道-交换机结构-4（FC-SW-4），ANSI INCITS 418-2006，第7节"
    },
    {
      "indent": 4,
      "text": "DEFVAL      { 0 }\n::= { t11FamEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamConfigDomainIdType OBJECT-TYPE\n    SYNTAX      INTEGER {\n                       preferred(1),\n                       insistent(2),\n                       static(3)\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n           \"Type of configured Domain_ID contained in\n           t11FamConfigDomainId.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "       For the persistence of values across reboots, see the\n       MODULE-IDENTITY's DESCRIPTION clause.\"\nDEFVAL  { preferred }\n::= { t11FamEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAutoReconfigure OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-write STATUS current DESCRIPTION \"This object determines how a particular switch responds to certain error conditions.",
      "zh-CHS": "T11FA自动重新配置对象类型语法TruthValue MAX-ACCESS读写状态当前描述“此对象确定特定交换机如何响应特定错误条件。"
    },
    {
      "indent": 11,
      "text": "The condition that might cause these errors is the merging of two disjoint Fabrics that have overlapping Domain_ID lists.",
      "zh-CHS": "可能导致这些错误的条件是合并具有重叠域ID列表的两个不相交结构。"
    },
    {
      "indent": 11,
      "text": "If value of this object is 'true', the switch will send an RCF (ReConfigureFabric) to rebuild the Fabric.",
      "zh-CHS": "如果此对象的值为“true”，则交换机将发送RCF（ReconfigurateFabric）以重建结构。"
    },
    {
      "indent": 11,
      "text": "If 'false', the switch will isolate the E_Ports on which the errors happened.",
      "zh-CHS": "如果“false”，交换机将隔离发生错误的E_端口。"
    },
    {
      "indent": 4,
      "text": "       For the persistence of values across reboots, see the\n       MODULE-IDENTITY's DESCRIPTION clause.\"\nREFERENCE   \"Fibre Channel - Switch Fabric - 3 (FC-SW-3),\n               December 2003, sections 6.1.12 & 7.3.\n            Fibre Channel - Methodologies for Interconnects\n               (FC-MI), INCITS TR-30-2002, table 14, note g.\"\nDEFVAL  { false }\n::= { t11FamEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamContiguousAllocation OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-write STATUS current DESCRIPTION \"Determines how a particular switch behaves when elected as the Principal Switch.",
      "zh-CHS": "t11FamContiguousAllocation对象类型语法TruthValue MAX-ACCESS read-write STATUS current DESCRIPTION“确定选择为主交换机时特定交换机的行为。"
    },
    {
      "indent": 11,
      "text": "If true, the switch will only accept RDIs with a contiguous allocation; specifically, it will reject RDIs with non-contiguous Domain_IDs, and if an RDI for a contiguous Domain_ID is not able to be fulfilled, it will try to replace all the Domain_IDs in the list with contiguous Domain_IDs, and if that fails, the RDI will be rejected.",
      "zh-CHS": "如果为true，交换机将只接受具有连续分配的RDI；具体地说，它将拒绝使用非连续域ID的RDI，如果无法实现连续域ID的RDI，它将尝试用连续域ID替换列表中的所有域ID，如果失败，RDI将被拒绝。"
    },
    {
      "indent": 11,
      "text": "If false, then the switch acts normally in granting the Domain_IDs even if they are not contiguous.",
      "zh-CHS": "如果为false，则该开关在授予域_id时正常工作，即使它们不是连续的。"
    },
    {
      "indent": 4,
      "text": "       For the persistence of values across reboots, see the\n       MODULE-IDENTITY's DESCRIPTION clause.\"\n::= { t11FamEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamPriority OBJECT-TYPE SYNTAX T11FamDomainPriority MAX-ACCESS read-write STATUS current DESCRIPTION \"The initial or configured priority of a particular switch to be used in Principal Switch selection process.",
      "zh-CHS": "T11Ampriority对象类型语法T11FamDomainPriority MAX-ACCESS读写状态当前描述“要在主交换机选择过程中使用的特定交换机的初始或配置优先级。"
    },
    {
      "indent": 4,
      "text": "       For the persistence of values across reboots, see the\n       MODULE-IDENTITY's DESCRIPTION clause.\"\n::= { t11FamEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamPrincipalSwitchWwn OBJECT-TYPE\n    SYNTAX      FcNameIdOrZero\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n           \"The WWN of the Principal Switch on this Fabric,\n           or zero-length string if the identity of the principal\n           switch is unknown.\"\n    DEFVAL  { ''H }\n    ::= { t11FamEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamLocalSwitchWwn OBJECT-TYPE SYNTAX FcNameIdOrZero MAX-ACCESS read-only",
      "zh-CHS": "t11FamLocalSwitchWwn对象类型语法FcNameIdOrZero MAX-ACCESS只读"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n       \"The WWN of the particular switch on this Fabric.\"\n::= { t11FamEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAssignedAreaIdList OBJECT-TYPE SYNTAX OCTET STRING (SIZE(0..256)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The list of (zero or more) Area_IDs that have been assigned by a particular switch in this Fabric, formatted as an array of octets in ascending order.",
      "zh-CHS": "T11AmassignedAreaidList对象类型语法八位字节字符串（大小（0..256））MAX-ACCESS只读状态当前描述“此结构中由特定交换机分配的（零个或多个）区域_ID列表，按升序格式化为八位字节数组。"
    },
    {
      "indent": 11,
      "text": "Each octet represents one Area_ID. So, the list containing Area_IDs 23, 45, 235, and 56 would be formatted as the 4-octet string x'172d38eb'.",
      "zh-CHS": "每个八位组代表一个区域ID。因此，包含区域ID 23、45、235和56的列表将被格式化为4个八位组字符串x'172d38eb'。"
    },
    {
      "indent": 4,
      "text": "       A particular area's Area_ID is used as the index into the\n       t11FamAreaTable to get the statistics on that area.\"\n::= { t11FamEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamGrantedFcIds OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The total number of Fibre Channel Address Identifiers granted (for local use, i.e., with a particular switch's Domain_ID) by the Fabric Address Manager on that switch.",
      "zh-CHS": "t11FamGrantedFcIds对象类型语法计数器32 MAX-ACCESS只读状态当前描述“结构地址管理器在该交换机上授予的光纤通道地址标识符（用于本地使用，即具有特定交换机的域ID）总数。"
    },
    {
      "indent": 4,
      "text": "       This counter has no discontinuities other than those\n       that all Counter32s have when sysUpTime=0.\"\n::= { t11FamEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamRecoveredFcIds OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The total number of Fibre Channel Address Identifiers that have been recovered by the Fabric Address Manager on a particular switch since the switch has been initialized. A recovered Fibre Channel Address Identifier is one that is explicitly returned after previously being used.",
      "zh-CHS": "T11AMRecoveredFCIDS对象类型语法计数器32 MAX-ACCESS只读状态当前说明“自交换机初始化以来，结构地址管理器在特定交换机上恢复的光纤通道地址标识符的总数。恢复的光纤通道地址标识符是在先前使用后显式返回的标识符。"
    },
    {
      "indent": 11,
      "text": "This counter has no discontinuities other than those that all Counter32s have when sysUpTime=0.\"",
      "zh-CHS": "除sysUpTime=0时所有计数器32具有的中断外，此计数器没有其他中断。”"
    },
    {
      "indent": 4,
      "text": "::= { t11FamEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFreeFcIds OBJECT-TYPE SYNTAX Gauge32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of Fibre Channel Address Identifiers that are currently unassigned on this Fabric and could be available for assignment either immediately or at some later time.",
      "zh-CHS": "T11FAMFREFCIDS对象类型语法量表32 MAX-ACCESS只读状态当前描述“此结构上当前未分配且可立即或稍后分配的光纤通道地址标识符的数量。"
    },
    {
      "indent": 4,
      "text": "       The sum of the instances of FreeFcIds and AssignedFcIds\n       corresponding to a particular Fabric is the total number of\n       Fibre Channel Address Identifiers that the local Fabric\n       Address Management is capable of assigning on that Fabric.\"\n::= { t11FamEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAssignedFcIds OBJECT-TYPE SYNTAX Gauge32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of Fibre Channel Address Identifiers that are currently assigned on this Fabric.",
      "zh-CHS": "T11AmassignedFCIDS对象类型语法量表32 MAX-ACCESS只读状态当前描述“当前在此结构上分配的光纤通道地址标识符的数量。"
    },
    {
      "indent": 4,
      "text": "       The sum of the instances of FreeFcIds and AssignedFcIds\n       corresponding to a particular Fabric is the total number of\n       Fibre Channel Address Identifiers that the local Fabric\n       Address Management is capable of assigning on that Fabric.\"\n::= { t11FamEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAvailableFcIds OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS      current\n    DESCRIPTION\n           \"The number of Fibre Channel Address Identifiers that are\n           unassigned and currently available for immediate assignment\n           on the Fabric, e.g., with the 'Clean Address' bit set to 1.\"\n    REFERENCE\n        \"Fibre Channel - Framing and Signaling (FC-FS),\n         ANSI INCITS 373-2003, section 15.6.2.4.2.\"\n    ::= { t11FamEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamRunningPriority OBJECT-TYPE SYNTAX T11FamDomainPriority MAX-ACCESS read-only STATUS current",
      "zh-CHS": "t11FamRunningPriority对象类型语法T11FamDomainPriority最大访问只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n       \"The running priority of a particular switch on this Fabric.\n       This value is initialized to the value of t11FamPriority,\n       and subsequently altered as specified by the procedures\n       defined in FC-SW-3.\"\n::= { t11FamEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamPrincSwRunningPriority OBJECT-TYPE\n    SYNTAX     T11FamDomainPriority\n    MAX-ACCESS read-only\n    STATUS      current\n    DESCRIPTION\n           \"The running priority of the Principal Switch on this\n           Fabric.\"\n    ::= { t11FamEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamState OBJECT-TYPE\n    SYNTAX     T11FamState\n    MAX-ACCESS read-only\n    STATUS      current\n    DESCRIPTION\n           \"The state of the Fabric Address Manager on a particular\n           switch on this Fabric.\"\n    ::= { t11FamEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamLocalPrincipalSwitchSlctns OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of times a particular switch became the Principal Switch on this Fabric.",
      "zh-CHS": "t11FamLocalPrincipalSwitchSlctns对象类型语法计数器32 MAX-ACCESS只读状态当前描述“特定交换机成为此结构上的主交换机的次数。"
    },
    {
      "indent": 4,
      "text": "       This counter has no discontinuities other than those\n       that all Counter32s have when sysUpTime=0.\"\n::= { t11FamEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamPrincipalSwitchSelections OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of Principal Switch selections on this Fabric.",
      "zh-CHS": "T11AmprincipalSwitchSelections对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此结构上的主交换机选择数。"
    },
    {
      "indent": 4,
      "text": "       This counter has no discontinuities other than those\n       that all Counter32s have when sysUpTime=0.\"\n::= { t11FamEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamBuildFabrics OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of non-disruptive fabric reconfigurations (BFs) that have occurred on this Fabric.",
      "zh-CHS": "t11FamBuildFabrics对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此结构上发生的无中断结构重新配置（BF）的数量。"
    },
    {
      "indent": 4,
      "text": "       This counter has no discontinuities other than those\n       that all Counter32s have when sysUpTime=0.\"\n::= { t11FamEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFabricReconfigures OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of disruptive fabric reconfigurations (RCFs) that have occurred on this Fabric.",
      "zh-CHS": "t11FamFabricReconfigures对象类型语法计数器32 MAX-ACCESS只读状态当前说明“此结构上发生的中断结构重新配置（RCF）的数量。"
    },
    {
      "indent": 4,
      "text": "       This counter has no discontinuities other than those\n       that all Counter32s have when sysUpTime=0.\"\n::= { t11FamEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamDomainId OBJECT-TYPE\n    SYNTAX      FcDomainIdOrZero\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n           \"The Domain_ID of a particular switch on this Fabric or\n           zero if no Domain_ID has been assigned.\"\n    ::= { t11FamEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamSticky OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"An indication of whether a particular switch is supporting the concept of Preferred Domain_IDs via a best-effort attempt to re-assign the same Fibre Channel Address Identifier value to a port on the next occasion when a port requests an assignment on this Fabric.",
      "zh-CHS": "t11FamSticky对象类型语法TruthValue MAX-ACCESS只读状态当前说明“下一次端口请求在此结构上分配时，通过尽最大努力将相同的光纤通道地址标识符值重新分配给端口，指示特定交换机是否支持首选域ID的概念。"
    },
    {
      "indent": 4,
      "text": "       If the value of this object is 'true', then the switch is\n       maintaining rows in the t11FamFcIdCacheTable for this\n       Fabric.\"\n::= { t11FamEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamRestart  OBJECT-TYPE\n    SYNTAX     INTEGER {\n                       nonDisruptive(1),\n                       disruptive(2),\n                       noOp(3)\n               }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n           \"This object tells the Fabric Address Manager to\n           request a Fabric reconfiguration.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "If this object is set to 'disruptive', then an RCF (ReConfigure Fabric) is generated in the Fabric in order for the Fabric to recover from the errors.",
      "zh-CHS": "如果此对象设置为“中断”，则会在结构中生成RCF（重新配置结构），以便结构从错误中恢复。"
    },
    {
      "indent": 11,
      "text": "If this object is set to 'nonDisruptive', then a BF (Build Fabric) is generated in the Fabric.",
      "zh-CHS": "如果此对象设置为“无中断”，则会在结构中生成BF（构建结构）。"
    },
    {
      "indent": 11,
      "text": "No action is taken if this object is set to 'noOp'. The value of the object when read is always 'noOp'.",
      "zh-CHS": "如果此对象设置为“noOp”，则不会执行任何操作。读取时对象的值始终为“noOp”。"
    },
    {
      "indent": 4,
      "text": "       For the persistence of values across reboots, see the\n       MODULE-IDENTITY's DESCRIPTION clause.\"\nREFERENCE   \"Fibre Channel - Switch Fabric - 3 (FC-SW-3),\n             ANSI INCITS 384-2004, section 7.3.\"\n::= { t11FamEntry 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamRcFabricNotifyEnable OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-write STATUS current DESCRIPTION \"An indication of whether or not a particular switch should issue a t11FamFabricChangeNotify notification on sending or receiving ReConfigureFabric (RCF) on a Fabric.",
      "zh-CHS": "T11FamFabricNotifyEnable对象类型语法TruthValue MAX-ACCESS读写状态当前描述“指示特定交换机是否应在结构上发送或接收重新配置（RCF）时发出t11FamFabricChangeNotify通知。"
    },
    {
      "indent": 11,
      "text": "If the value of the object is 'true', then the notification is generated. If the value is 'false', notification is not generated.",
      "zh-CHS": "如果对象的值为“true”，则生成通知。如果该值为“false”，则不会生成通知。"
    },
    {
      "indent": 11,
      "text": "If an implementation requires all Fabrics to have the same value, then setting one instance of this object to a new object will result in all corresponding instances being set to that same new value.",
      "zh-CHS": "如果一个实现要求所有结构都具有相同的值，那么将此对象的一个实例设置为新对象将导致所有对应实例都设置为相同的新值。"
    },
    {
      "indent": 11,
      "text": "For the persistence of values across reboots, see the MODULE-IDENTITY's DESCRIPTION clause.\"",
      "zh-CHS": "有关重新启动期间值的持久性，请参阅MODULE-IDENTITY的DESCRIPTION子句。“"
    },
    {
      "indent": 4,
      "text": "DEFVAL { false }\n::= { t11FamEntry 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamEnable OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-write STATUS current DESCRIPTION \"Enables the Fabric Address Manager on this switch on this Fabric.",
      "zh-CHS": "T11适用的对象类型语法TruthValue MAX-ACCESS读写状态current DESCRIPTION“在此结构上启用此交换机上的结构地址管理器。"
    },
    {
      "indent": 11,
      "text": "If enabled on a Fabric, the switch will participate in Principal Switch selection, and Domain_IDs are assigned dynamically. If disabled, the switch will not participate in Principal Switch selection, and Domain_IDs are assigned statically. Thus, the corresponding value of t11FamConfigDomainIdType needs to be 'static'.",
      "zh-CHS": "如果在结构上启用，交换机将参与主体交换机选择，并且动态分配域ID。如果禁用，交换机将不参与主体交换机选择，并且域ID将静态分配。因此，t11FamConfigDomainIdType的对应值需要为“static”。"
    },
    {
      "indent": 2,
      "text": "         For the persistence of values across reboots, see the\n         MODULE-IDENTITY's DESCRIPTION clause.\"\nREFERENCE   \"Fibre Channel - Switch Fabric - 4 (FC-SW-4),\n             ANSI INCITS 418-2006, sections 7.1 and 7.3.\"\nDEFVAL  { true }\n::= { t11FamEntry 26 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFabricName OBJECT-TYPE SYNTAX FcNameIdOrZero MAX-ACCESS read-write STATUS current DESCRIPTION \"The WWN that is configured on this switch to be used as the name of this Fabric when the value of t11FamEnable is 'false'.",
      "zh-CHS": "t11FamFabricName对象类型语法FcNameIdOrZero MAX-ACCESS读写状态当前描述“当T11Famable的值为“false”时，在此交换机上配置的用作此结构名称的WWN”。"
    },
    {
      "indent": 11,
      "text": "If the value of t11FamEnable is 'true', this value is not used.",
      "zh-CHS": "如果T11Familable的值为“true”，则不使用该值。"
    },
    {
      "indent": 11,
      "text": "Fibre Channel requires that: a) all switches in an operational Fabric be configured with the same Fabric name; and b) each Fabric have a unique Fabric name. If either of these is violated, either by switches within a single Fabric being configured with different Fabric names, or by multiple Fabrics that share management applications or interact in other ways having the same Fabric name, then the behavior of the switches and associated management functions is not specified by Fibre Channel or Internet standards.",
      "zh-CHS": "光纤通道要求：a）操作结构中的所有交换机均配置为相同的结构名称；和b）每个结构都有一个唯一的结构名称。如果违反了这两个条件之一，或者是单个结构中的交换机配置了不同的结构名称，或者是共享管理应用程序或以其他方式进行交互的多个结构具有相同的结构名称，那么，交换机和相关管理功能的行为不是由光纤通道或Internet标准指定的。"
    },
    {
      "indent": 4,
      "text": "       For the persistence of values across reboots, see the\n       MODULE-IDENTITY's DESCRIPTION clause.\"\nREFERENCE   \"Fibre Channel - Switch Fabric - 4 (FC-SW-4),\n             ANSI INCITS 418-2006, section 7.1.\"\n::= { t11FamEntry 27 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- t11FamIfTable - Interface configuration --",
      "zh-CHS": "----T11友好-接口配置--"
    },
    {
      "indent": 0,
      "text": "t11FamIfTable OBJECT-TYPE SYNTAX SEQUENCE OF T11FamIfEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table contains those Fabric Address Manager parameters and status values that are per-interface (identified by an ifIndex value), per-Fabric (identified by a t11FamFabricIndex value), and per-switch (identified by values of fcmInstanceIndex and fcmSwitchIndex).",
      "zh-CHS": "T11familifentry MAX-ACCESS的T11familifentry对象类型语法序列不可访问状态当前描述“此表包含每个接口（由ifIndex值标识）、每个结构（由T11FamilifactricIndex值标识）和每个交换机的结构地址管理器参数和状态值（由fcmInstanceIndex和fcmSwitchIndex的值标识）。"
    },
    {
      "indent": 11,
      "text": "An entry in this table is automatically created when an E_Port becomes non-isolated on a particular Fabric.",
      "zh-CHS": "当E_端口在特定结构上变为非隔离时，将自动创建此表中的条目。"
    },
    {
      "indent": 11,
      "text": "An entry is deleted automatically from this table if: a) the corresponding interface is no longer an E_Port (e.g., a G_Port that is dynamically determined to be an F_Port), and all configuration parameter(s) have default values; or b) the interface identified by ifIndex no longer exists (e.g., because a line-card is physically removed); or c) the row in the t11FamTable corresponding the fabric identified by t11FamFabricID no longer exists.",
      "zh-CHS": "如果：a）相应接口不再是E_端口（例如，动态确定为F_端口的g_端口），并且所有配置参数都具有默认值，则会自动从此表中删除条目；或b）ifIndex标识的接口不再存在（例如，因为线路卡被物理移除）；或者c）t11FamTable中与t11FamFabricID标识的结构相对应的行不再存在。"
    },
    {
      "indent": 4,
      "text": "       Creating an entry in this table via t11FamIfRowStatus\n       provides the means to specify non-default parameter value(s)\n       for an interface at a time when the relevant row in this\n       table does not exist, i.e., because the interface is either\n       down or it is not an E_Port.\"\n::= { t11FamConfiguration 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamIfEntry OBJECT-TYPE SYNTAX T11FamIfEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An entry containing information on the interface configuration on the Fabric identified by",
      "zh-CHS": "T11FamilyFentry对象类型语法T11FamilyFentry MAX-ACCESS不可访问状态当前描述“一个条目，包含由标识的结构上的接口配置信息"
    },
    {
      "indent": 4,
      "text": "       t11FamFabricIndex.\"\nINDEX { fcmInstanceIndex, fcmSwitchIndex,\n        t11FamFabricIndex, ifIndex}\n::= { t11FamIfTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "T11FamIfEntry ::= SEQUENCE {\n    t11FamIfRcfReject    TruthValue,\n    t11FamIfRole         T11FamDomainInterfaceRole,\n    t11FamIfRowStatus    RowStatus\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamIfRcfReject OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-create STATUS current DESCRIPTION \"This object determines if the incoming ReConfigure Fabric (RCF) messages on this interface on this Fabric is accepted or not. If this object is 'true', then the incoming RCF is rejected. If 'false', incoming RCF is accepted.",
      "zh-CHS": "t11FamIfRcfReject对象类型语法TruthValue MAX-ACCESS读取创建状态当前描述“此对象确定是否接受此结构上此接口上的传入重新配置结构（RCF）消息。如果此对象为“真”，则拒绝传入RCF。如果为“假”，则接受传入RCF。"
    },
    {
      "indent": 11,
      "text": "Note that this object does not apply to the outgoing RCFs generated by this interface.",
      "zh-CHS": "请注意，此对象不适用于此接口生成的传出RCF。"
    },
    {
      "indent": 4,
      "text": "       Implementations that support write-access to this object\n       can do so under whatever conditions they choose.\"\nDEFVAL {false}\n::= { t11FamIfEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamIfRole    OBJECT-TYPE\n    SYNTAX     T11FamDomainInterfaceRole\n    MAX-ACCESS read-only\n    STATUS      current\n    DESCRIPTION\n           \"The role of this interface.\"\n    ::= { t11FamIfEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamIfRowStatus    OBJECT-TYPE\n    SYNTAX     RowStatus\n    MAX-ACCESS read-create\n    STATUS      current\n    DESCRIPTION\n           \"The status of this row.\"\n    ::= { t11FamIfEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--",
      "zh-CHS": "--"
    },
    {
      "indent": 0,
      "text": "-- t11FamAreaTable --",
      "zh-CHS": "--T11可食用--"
    },
    {
      "indent": 0,
      "text": "t11FamAreaTable  OBJECT-TYPE\n    SYNTAX     SEQUENCE OF T11FamAreaEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n           \"This table contains area assignments per-Fabric by a\n           switch's Fabric Address Manager.  Each octet in\n           t11FamAssignedAreaList is able to be used to index into\n           this table to find information on each area.\"\n    REFERENCE   \"Fibre Channel - Switch Fabric - 3 (FC-SW-3),\n                 ANSI INCITS 384-2004, section 4.8.\"\n    ::= { t11FamInfo 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAreaEntry OBJECT-TYPE\n    SYNTAX     T11FamAreaEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n           \"An entry gives information on the Area_ID and all\n           Port_IDs that have been assigned within an area for\n           the Fabric identified by t11FamFabricIndex, by the\n           Fabric Address Manager in the switch identified by\n           fcmInstanceIndex and fcmSwitchIndex.\"\n    INDEX { fcmInstanceIndex, fcmSwitchIndex,\n            t11FamFabricIndex, t11FamAreaAreaId}\n    ::= { t11FamAreaTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "T11FamAreaEntry ::= SEQUENCE {\n    t11FamAreaAreaId                Unsigned32,\n    t11FamAreaAssignedPortIdList    OCTET STRING\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAreaAreaId    OBJECT-TYPE\n    SYNTAX     Unsigned32 (0..255)\n    MAX-ACCESS not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"The Area_ID of this area.\"\n    ::= { t11FamAreaEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAreaAssignedPortIdList OBJECT-TYPE SYNTAX OCTET STRING (SIZE(0..256)) MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "t11FamAreaAssignedPortIdList对象类型语法八位字节字符串（大小（0..256））最大访问只读状态当前说明"
    },
    {
      "indent": 11,
      "text": "\"The list of Port_IDs which have been assigned in this area and Fabric, formatted as an array of octets in ascending order. There could be zero or more Port_IDs assigned on this area and Fabric.",
      "zh-CHS": "已在此区域和结构中分配的端口号列表，按升序格式化为八位字节数组。在此区域和结构上可能分配了零个或多个端口号。"
    },
    {
      "indent": 4,
      "text": "       Each octet represents one Port_ID.  So, the list containing\n       the Port_IDs 23, 45, 235, and 56 would be formatted as the\n       4-octet string x'172d38eb'.\"\n::= { t11FamAreaEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- t11FamDatabaseTable --",
      "zh-CHS": "----t11FamDatabaseTable--"
    },
    {
      "indent": 0,
      "text": "t11FamDatabaseTable  OBJECT-TYPE\n    SYNTAX     SEQUENCE OF T11FamDatabaseEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n           \"This table contains all information known by\n           a switch about all the domains that have been\n           assigned in each Fabric.\"\n    REFERENCE   \"Fibre Channel - Switch Fabric - 3 (FC-SW-3),\n                 ANSI INCITS 384-2004, section 4.8.\"\n    ::= { t11FamInfo 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamDatabaseEntry OBJECT-TYPE\n    SYNTAX     T11FamDatabaseEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n           \"An entry (conceptual row) in the t11FamDatabaseTable\n           containing information about one Domain_ID in the\n           Fabric identified by t11FamFabricIndex, and known by\n           the switch identified by t11FamFabricIndex and\n           t11FamDatabaseDomainId.\"\n    INDEX { fcmInstanceIndex, fcmSwitchIndex,\n            t11FamFabricIndex , t11FamDatabaseDomainId}\n    ::= { t11FamDatabaseTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "T11FamDatabaseEntry ::= SEQUENCE {\n    t11FamDatabaseDomainId              FcDomainIdOrZero,\n    t11FamDatabaseSwitchWwn             FcNameIdOrZero\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamDatabaseDomainId OBJECT-TYPE SYNTAX FcDomainIdOrZero (1..239)",
      "zh-CHS": "t11FamDatabaseDomainId对象类型语法FcDomainIdOrZero（1..239）"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS not-accessible\nSTATUS      current\nDESCRIPTION\n       \"The Domain_ID for which this row contains information.\n       The value must be non-zero.\"\n::= { t11FamDatabaseEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamDatabaseSwitchWwn  OBJECT-TYPE\n    SYNTAX      FcNameIdOrZero\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The node name (WWN) of the switch to which the\n            corresponding value of t11FamDatabaseDomainId is currently\n            assigned for the particular Fabric.\"\n    ::= { t11FamDatabaseEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Fibre Channel Address Identifier cache information\n--\n-- The cached information allows the Fabric Address Manager to\n-- implement the concept of a Preferred Domain_ID, whereby after a port\n-- releases a Fibre Channel Address Identifier value, a switch makes an\n-- attempt to re-assign the same Fibre Channel Address Identifier value\n-- on the next occasion when that port requests an assignment.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamMaxFcIdCacheSize  OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..4294967295)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n           \"The maximum number of Fibre Channel Address Identifiers\n           that are able to be cached in the t11FamFcIdCacheTable.\n           If the number is unknown, the value of this object is\n           zero.\"\n    ::= { t11FamInfo 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- t11FamFcIdCacheTable --",
      "zh-CHS": "----T11FAMFCIDCHACHETABLE--"
    },
    {
      "indent": 0,
      "text": "t11FamFcIdCacheTable OBJECT-TYPE SYNTAX SEQUENCE OF T11FamFcIdCacheEntry MAX-ACCESS not-accessible STATUS current",
      "zh-CHS": "T11FAMFCIDDCACHETABLE T11FAMFCIDDCACHEENTRY MAX-ACCESS的对象类型语法序列不可访问当前状态"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n       \"This table contains all the Fibre Channel Address\n       Identifiers that have recently been released by the\n       Fabric Address Manager in a switch.  So, it lists\n       all the Fibre Channel Address Identifiers that have valid\n       WWN-to-Fibre Channel Address Identifier mappings and are\n       currently not assigned to any ports.  These Fibre Channel\n       Address Identifiers were assigned to ports but have since\n       been released.  These cached Fibre Channel Address\n       Identifiers contain only Area_ID and Port_ID information.\n       This cache is kept to provide best-effort re-assignment of\n       same Fibre Channel Address Identifiers; i.e., when an\n       Nx_Port asks for a Fibre Channel Address Identifier, soon\n       after releasing one, the same value is re-assigned, if\n       possible.\"\n::= { t11FamInfo 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFcIdCacheEntry OBJECT-TYPE\n    SYNTAX     T11FamFcIdCacheEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n           \"An entry (conceptual row) in the t11FamFcIdCacheTable\n           containing information about one Fibre Channel Address\n           Identifier that was released from a WWN, corresponding to a\n           range of one or more ports connected to the switch\n           (identified by t11FamFabricIndex and t11FamFcIdCacheWwn) in\n           the Fabric (identified by t11FamFabricIndex).  An entry is\n           created when a Fibre Channel Address Identifier is released\n           by the last port in the range.  The oldest entry is deleted\n           if the number of rows in this table reaches\n           t11FamMaxFcIdCacheSize, and its space is required for a new\n           entry.  An entry is also deleted when its Fibre Channel\n           Address Identifier is assigned to a port.\"\n    INDEX { fcmInstanceIndex, fcmSwitchIndex,\n            t11FamFabricIndex, t11FamFcIdCacheWwn}\n    ::= { t11FamFcIdCacheTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "T11FamFcIdCacheEntry ::= SEQUENCE {\n    t11FamFcIdCacheWwn                  FcNameIdOrZero,\n    t11FamFcIdCacheAreaIdPortId         OCTET STRING,\n    t11FamFcIdCachePortIds              Unsigned32\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFcIdCacheWwn OBJECT-TYPE SYNTAX FcNameIdOrZero MAX-ACCESS not-accessible STATUS current",
      "zh-CHS": "T11FAMFCIDDCACHEWWN对象类型语法FcNameIdOrZero MAX-ACCESS不可访问状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n       \"The N_Port_Name (WWN) of the port associated with this\n       entry.\"\n::= { t11FamFcIdCacheEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFcIdCacheAreaIdPortId OBJECT-TYPE SYNTAX OCTET STRING (SIZE (2)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The combination of this object and t11FamFcIdCachePortIds represent one range of Fibre Channel Address Identifiers, which were assigned and later released. This object contains the Area_ID and Port_ID of the first Fibre Channel Address Identifier in the range.",
      "zh-CHS": "T11FAMFCIDDCACHEAREAIDPORTID对象类型语法八位字节字符串（大小（2））最大访问只读状态当前说明“此对象和T11FAMFCIDDCachePortID的组合表示一系列光纤通道地址标识符，这些标识符已分配并随后发布。此对象包含范围中第一个光纤通道地址标识符的区域ID和端口ID。"
    },
    {
      "indent": 4,
      "text": "       Note that this object is only 2 bytes.\"\n::= { t11FamFcIdCacheEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFcIdCachePortIds  OBJECT-TYPE\n    SYNTAX     Unsigned32 (0..65535)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n           \"The combination of t11FamFcIdCacheAreaIdPortId and this\n           object represent one range of Fibre Channel Address\n           Identifiers, which were assigned and later released.  This\n           object contains the number of (consecutive) Fibre Channel\n           Address Identifiers in the range.\"\n    ::= { t11FamFcIdCacheEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Objects for use in notifications",
      "zh-CHS": "--用于通知的对象"
    },
    {
      "indent": 0,
      "text": "t11FamNotifyFabricIndex OBJECT-TYPE SYNTAX T11FabricIndex MAX-ACCESS accessible-for-notify STATUS current DESCRIPTION \"A unique index value that identifies a particular Fabric for which a particular notification is generated.",
      "zh-CHS": "t11FamNotifyFabricIndex对象类型语法T11FabricIndex MAX-ACCESS可访问通知状态当前描述“唯一的索引值，用于标识为其生成特定通知的特定结构。"
    },
    {
      "indent": 11,
      "text": "In a Fabric conformant to SW-3, only a single Fabric can operate within a physical infrastructure, and thus, the value of this Fabric Index will always be 1.",
      "zh-CHS": "在符合SW-3的结构中，只有一个结构可以在物理基础设施内运行，因此，该结构索引的值始终为1。"
    },
    {
      "indent": 11,
      "text": "However, the current standard, FC-SW-4, defines how multiple Fabrics, each with its own management",
      "zh-CHS": "但是，当前的标准FC-SW-4定义了如何使用多个结构，每个结构都有自己的管理"
    },
    {
      "indent": 4,
      "text": "       instrumentation, could operate within one (or more)\n       physical infrastructures.  In order to accommodate this\n       scenario, this index value is used to uniquely identify a\n       particular Fabric within a physical infrastructure.\"\n::= { t11FamNotifyControl 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Notifications",
      "zh-CHS": "--通知"
    },
    {
      "indent": 0,
      "text": "t11FamDomainIdNotAssignedNotify NOTIFICATION-TYPE OBJECTS { t11FamLocalSwitchWwn, t11FamNotifyFabricIndex } STATUS current DESCRIPTION \"This notification indicates that a Domain_ID has not been configured or assigned for a particular Fabric, identified by t11FamNotifyFabricIndex, on a particular switch identified by t11FamLocalSwitchWwn. This could happen under the following conditions, and results in the switch isolating E_Ports on the Fabric:",
      "zh-CHS": "t11FamDomainIdNotAssignedNotify通知类型对象{t11FamLocalSwitchWwn，t11FamNotifyFabricIndex}状态当前说明“此通知表示尚未在t11FamLocalSwitchWwn标识的特定交换机上为t11FamNotifyFabricIndex标识的特定结构配置或分配域ID。这可能在以下情况下发生，并导致交换机隔离结构上的E_端口："
    },
    {
      "indent": 4,
      "text": "        - if the switch's request for a configured static\n          Domain_ID is rejected or no other Domain_ID is\n          assigned, then the E_Ports are isolated.\"\n::= { t11FamNotifications 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamNewPrincipalSwitchNotify NOTIFICATION-TYPE OBJECTS { t11FamLocalSwitchWwn, t11FamNotifyFabricIndex } STATUS current DESCRIPTION \"This notification indicates that a particular switch, identified by t11FamLocalSwitchWwn, has become the new Principal Switch on the Fabric identified by t11FamNotifyFabricIndex.",
      "zh-CHS": "t11FamNewPrincipalSwitchNotify通知类型对象{t11FamLocalSwitchWwn，t11FamNotifyFabricIndex}状态当前描述“此通知表示t11FamLocalSwitchWwn标识的特定交换机已成为t11FamNotifyFabricIndex标识的结构上的新主交换机。"
    },
    {
      "indent": 4,
      "text": "       This notification is sent soon after its election as\n       the new Principal Switch, i.e., upon expiration of a\n       Principal Switch selection timer that is equal to\n       twice the Fabric Stability Timeout value (F_S_TOV).\"\n::= { t11FamNotifications 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamFabricChangeNotify NOTIFICATION-TYPE OBJECTS { t11FamLocalSwitchWwn, t11FamNotifyFabricIndex } STATUS current DESCRIPTION \"This notification is sent whenever a particular switch, identified by t11FamLocalSwitchWwn, sends or receives a Build Fabric (BF) or a ReConfigure Fabric (RCF) message on the Fabric identified by",
      "zh-CHS": "t11FamFabricChangeNotify通知类型对象{t11FamLocalSwitchWwn，t11FamNotifyFabricIndex}状态当前描述“只要t11FamLocalSwitchWwn标识的特定交换机在其标识的结构上发送或接收构建结构（BF）或重新配置结构（RCF）消息，就会发送此通知"
    },
    {
      "indent": 11,
      "text": "t11FamNotifyFabricIndex.",
      "zh-CHS": "t11FamNotifyFabricIndex。"
    },
    {
      "indent": 4,
      "text": "       This notification is not sent if a\n       't11FamNewPrincipalSwitchNotify' notification is sent\n       for the same event.\"\n::= { t11FamNotifications 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Conformance --",
      "zh-CHS": "----一致性--"
    },
    {
      "indent": 0,
      "text": "t11FamMIBCompliances OBJECT IDENTIFIER ::= { t11FamMIBConformance 1 }\nt11FamMIBGroups OBJECT IDENTIFIER ::= { t11FamMIBConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamMIBCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for Fibre Channel switches that implement Fabric Address Manager functionality.\" MODULE MANDATORY-GROUPS { t11FamGroup, t11FamDatabaseGroup, t11FamAreaGroup, t11FamNotificationGroup }",
      "zh-CHS": "t11FamMIBCompliance MODULE-COMPLIANCE STATUS当前描述“实现光纤通道地址管理器功能的光纤通道交换机的符合性声明”。模块必填组{t11FamGroup、T11FAMGatabaseGroup、t11FamAreaGroup、T11FAMGNotificationGroup}"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamConfigDomainId MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象t11FamConfigDomainId最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamConfigDomainIdType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象t11FamConfigDomainIdType MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamAutoReconfigure MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象T11FA自动重新配置最小访问只读描述“不需要写入访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamContiguousAllocation MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象T11FamContinguousAllocation最小访问只读描述“不需要写访问权限。”"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamPriority",
      "zh-CHS": "对象T11安培数"
    },
    {
      "indent": 6,
      "text": "MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamIfRcfReject MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象t11FamIfRcfReject最小访问只读描述“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamIfRowStatus MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象t11FamIfRowStatus MIN-ACCESS只读描述“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "OBJECT t11FamRcFabricNotifyEnable MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象t11FamRcFabricNotifyEnable最小访问只读说明“不需要写访问。”"
    },
    {
      "indent": 6,
      "text": "GROUP t11FamCacheGroup DESCRIPTION \"This group is mandatory only for switches that support the concept of Preferred Domain_ID via a best-effort attempt for (short-term) re-assignment of the same FC address identifiers.\"",
      "zh-CHS": "GROUP t11FamCacheGroup DESCRIPTION“只有通过尽最大努力（短期）重新分配相同FC地址标识符来支持首选域\\u ID概念的交换机才必须使用此组。”"
    },
    {
      "indent": 6,
      "text": "GROUP t11FamCommandGroup DESCRIPTION \"This group is optional.\"",
      "zh-CHS": "组t11FamCommandGroup DESCRIPTION“此组是可选的。”"
    },
    {
      "indent": 4,
      "text": "::= { t11FamMIBCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Units of Conformance",
      "zh-CHS": "--一致性单位"
    },
    {
      "indent": 0,
      "text": "t11FamGroup OBJECT-GROUP OBJECTS { t11FamConfigDomainId, t11FamConfigDomainIdType, t11FamAutoReconfigure, t11FamContiguousAllocation, t11FamPriority, t11FamPrincipalSwitchWwn, t11FamLocalSwitchWwn, t11FamAssignedAreaIdList, t11FamGrantedFcIds, t11FamRecoveredFcIds, t11FamFreeFcIds, t11FamAssignedFcIds,",
      "zh-CHS": "t11FamGroup对象组对象{t11FamConfigDomainId，t11FamConfigDomainId类型，T11FamAutoReconfigue，T11FamContinguousAllocation，t11FamPrincipalSwitchWwn，t11FamLocalSwitchWwn，T11FamAssignedAidList，T11FamGrandedFCID，T11FamRecoveredFCID，T11FamFreeFCID，T11FamAssignedCids，"
    },
    {
      "indent": 4,
      "text": "           t11FamAvailableFcIds,\n           t11FamRunningPriority,\n           t11FamPrincSwRunningPriority,\n           t11FamState,\n           t11FamLocalPrincipalSwitchSlctns,\n           t11FamPrincipalSwitchSelections,\n           t11FamBuildFabrics,\n           t11FamFabricReconfigures,\n           t11FamDomainId,\n           t11FamSticky,\n           t11FamRestart,\n           t11FamRcFabricNotifyEnable,\n           t11FamEnable,\n           t11FamFabricName,\n           t11FamIfRcfReject,\n           t11FamIfRole,\n           t11FamIfRowStatus,\n           t11FamNotifyFabricIndex\n        }\nSTATUS   current\nDESCRIPTION\n       \"A collection of general objects for displaying and\n       configuring Fabric Address management.\"\n::= { t11FamMIBGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamCommandGroup OBJECT-GROUP\n    OBJECTS  { t11FamRestart }\n    STATUS   current\n    DESCRIPTION\n           \"A collection of objects used for initiating an\n           operation on the Fabric.\"\n    ::= { t11FamMIBGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamDatabaseGroup OBJECT-GROUP\n    OBJECTS  { t11FamDatabaseSwitchWwn }\n    STATUS   current\n    DESCRIPTION\n           \"A collection of objects containing information about\n           Domain-IDs assignments.\"\n    ::= { t11FamMIBGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamAreaGroup OBJECT-GROUP\n    OBJECTS  { t11FamAreaAssignedPortIdList }\n    STATUS   current\n    DESCRIPTION\n           \"A collection of objects containing information about\n           currently assigned addresses within a domain.\"\n    ::= { t11FamMIBGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamCacheGroup OBJECT-GROUP\n    OBJECTS  { t11FamMaxFcIdCacheSize,\n               t11FamFcIdCacheAreaIdPortId,\n               t11FamFcIdCachePortIds\n             }\n    STATUS   current\n    DESCRIPTION\n           \"A collection of objects containing information about\n           recently-released Fibre Channel Address Identifiers.\"\n    ::= { t11FamMIBGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "t11FamNotificationGroup NOTIFICATION-GROUP\n    NOTIFICATIONS  { t11FamDomainIdNotAssignedNotify,\n                     t11FamNewPrincipalSwitchNotify,\n                     t11FamFabricChangeNotify }\n    STATUS   current\n    DESCRIPTION\n           \"A collection of notifications for status monitoring\n           and notification.\"\n    ::= { t11FamMIBGroups 6 }\nEND",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "This document began life as a work item of the INCITS Task Group T11.5. We wish to acknowledge the many contributions and comments from the INCITS Technical Committee T11, including the following:",
      "zh-CHS": "本文件作为INCITS任务组T11.5的一个工作项开始使用。我们希望感谢INCITS技术委员会T11的许多贡献和评论，包括以下内容："
    },
    {
      "indent": 6,
      "text": "T11 Chair: Robert Snively, Brocade T11 Vice Chair: Claudio DeSanti, Cisco Systems T11.5 Chair: Roger Cummings, Symantec T11.5 members, especially: Ken Hirata, Emulex Scott Kipp, McData Michael O'Donnell, McData Elizabeth G. Rodriguez, Dot Hill Steven L. Wilson, Brocade",
      "zh-CHS": "T11主席：Robert Snifly，Brocade T11副主席：Claudio DeSanti，Cisco Systems T11.5主席：罗杰·卡明斯，赛门铁克T11.5成员，特别是肯·平田，Emulex Scott Kipp，麦克塔塔·迈克尔·奥唐纳，麦克塔塔·伊丽莎白·G·罗德里格斯，多特·希尔·史蒂文·L·威尔逊，Brocade"
    },
    {
      "indent": 3,
      "text": "Thanks also to Orly Nicklass of RAD Data Communications, Bert Wijnen of Lucent, and those members of the IMSS WG who provided review comments.",
      "zh-CHS": "还要感谢RAD数据通信公司的Orly Nicklass、朗讯公司的Bert Wijnen以及提供审查意见的IMSS工作组成员。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "zh-CHS": "8. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 3,
      "text": "[IF-MIB] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "zh-CHS": "[IF-MIB]McCloghrie，K.和F.Kastenholz，“接口组MIB”，RFC 28632000年6月。"
    },
    {
      "indent": 3,
      "text": "[FC-MGMT] McCloghrie, K., \"Fibre Channel Management MIB\", RFC 4044, May 2005.",
      "zh-CHS": "[FC-MGMT]McCloghrie，K.，“光纤通道管理MIB”，RFC 4044，2005年5月。"
    },
    {
      "indent": 3,
      "text": "[FC-SW-3] \"Fibre Channel - Switch Fabric - 3 (FC-SW-3)\", ANSI INCITS 384-2004, June 2004.",
      "zh-CHS": "[FC-SW-3]“光纤通道-交换机结构-3（FC-SW-3）”，ANSI INCITS 384-2004，2004年6月。"
    },
    {
      "indent": 3,
      "text": "[FC-SW-4] \"Fibre Channel - Switch Fabric - 4 (FC-SW-4)\", ANSI INCITS 418-2006, 2006.",
      "zh-CHS": "[FC-SW-4]“光纤通道-交换机结构-4（FC-SW-4）”，ANSI INCITS 418-2006，2006年。"
    },
    {
      "indent": 3,
      "text": "[FC-FS] \"Fibre Channel - Framing and Signaling (FC-FS)\" ANSI INCITS 373-2003, April 2003.",
      "zh-CHS": "[FC-FS]“光纤通道-帧和信令（FC-FS）”，ANSI INCITS 373-2003，2003年4月。"
    },
    {
      "indent": 0,
      "text": "9. Informative References",
      "section_title": true,
      "zh-CHS": "9. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2837] Teow, K., \"Definitions of Managed Objects for the Fabric Element in Fibre Channel Standard\", RFC 2837, May 2000.",
      "zh-CHS": "[RFC2837]Teow，K.，“光纤通道标准中结构元素的托管对象定义”，RFC 2837，2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.，和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 34102002年12月。"
    },
    {
      "indent": 3,
      "text": "[FC-MI] \"Fibre Channel - Methodologies for Interconnects (FC-MI)\", INCITS TR-30-2002, November 2002.",
      "zh-CHS": "[FC-MI]“光纤通道-互连方法（FC-MI）”，INCITS TR-30-2002，2002年11月。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "zh-CHS": "10. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has made two MIB OID assignments, one for the T11-TC-MIB module and one for the T11-FC-FABRIC-ADDR-MGR-MIB module, under the appropriate subtree(s).",
      "zh-CHS": "IANA已在相应子树下分配了两个MIB OID，一个用于T11-TC-MIB模块，另一个用于T11-FC-FABRIC-ADDR-MGR-MIB模块。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "zh-CHS": "11. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations. These are the tables and objects and their sensitivity/vulnerability:",
      "zh-CHS": "此MIB模块中定义了许多管理对象，其MAX-ACCESS子句为read-write和/或read-create。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作可能会对网络操作产生负面影响。以下是表和对象及其敏感度/漏洞："
    },
    {
      "indent": 9,
      "text": "t11FamConfigDomainId, t11FamConfigDomainIdType and t11FamContiguousAllocation -- ability to change the address allocation policy.",
      "zh-CHS": "t11FamConfigDomainId、t11FamConfigDomainId类型和T11FAMConfiguousAllocation—更改地址分配策略的能力。"
    },
    {
      "indent": 9,
      "text": "t11FamRestart and t11FamAutoReconfigure -- ability to cause a fabric reconfiguration, e.g., on certain error conditions.",
      "zh-CHS": "t11FamRestart和T11FamAutoReconfiguration——在某些错误情况下导致结构重新配置的能力。"
    },
    {
      "indent": 9,
      "text": "t11FamPriority -- ability to affect which switch becomes the Principal Switch.",
      "zh-CHS": "T11Ampriority——影响哪个开关成为主开关的能力。"
    },
    {
      "indent": 9,
      "text": "t11FamRcFabricNotifyEnable -- ability to enable/disable a notification.",
      "zh-CHS": "t11FamRcFabricNotifyEnable——启用/禁用通知的功能。"
    },
    {
      "indent": 9,
      "text": "t11FamIfRcfReject -- ability to change the switch's behavior on receipt of an RCF.",
      "zh-CHS": "t11FamIfRcfReject——在收到RCF时更改交换机行为的能力。"
    },
    {
      "indent": 9,
      "text": "t11FamIfRowStatus -- ability to change an interface configuration parameter.",
      "zh-CHS": "t11FamIfRowStatus——更改接口配置参数的能力。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may also be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. These are the tables and objects and their sensitivity/vulnerability:",
      "zh-CHS": "在某些网络环境中，此MIB模块中的某些可读对象（即具有MAX-ACCESS而非not ACCESS的对象）也可能被视为敏感或易受攻击。因此，在通过SNMP通过网络发送这些对象时，控制甚至获取和/或通知对这些对象的访问，甚至可能加密这些对象的值，这一点非常重要。以下是表和对象及其敏感度/漏洞："
    },
    {
      "indent": 9,
      "text": "t11FamTable and t11FamIfTable -- contain the configuration, status, and statistics of the Fabric Address Manager.",
      "zh-CHS": "t11FamTable和t11FamIfTable——包含结构地址管理器的配置、状态和统计信息。"
    },
    {
      "indent": 9,
      "text": "t11FamAreaTable, t11FamDatabaseTable and t11FamFcIdCacheTable -- contain information on currently assigned or recently-released addresses.",
      "zh-CHS": "t11FamDatabaseTable、t11FamDatabaseTable和t11FamFcIdCacheTable——包含有关当前分配或最近发布的地址的信息。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "zh-CHS": "SNMPv3之前的SNMP版本未包含足够的安全性。即使网络本身是安全的（例如通过使用IPsec），即使如此，也无法控制安全网络上的谁可以访问和获取/设置（读取/更改/创建/删除）此MIB模块中的对象。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementors consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "zh-CHS": "建议执行者考虑SNMPv3框架所提供的安全特性（参见[RCFC310]，第8节），包括对SNMPv3加密机制的完全支持（用于身份验证和隐私）。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "此外，不建议部署SNMPv3之前的SNMP版本。相反，建议部署SNMPv3并启用加密安全性。然后，客户/运营商应负责确保授予访问此MIB模块实例权限的SNMP实体已正确配置为仅授予那些拥有确实获取或设置（更改/创建/删除）对象的合法权限的主体（用户）访问对象。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Claudio DeSanti Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "zh-CHS": "Claudio DeSanti Cisco Systems，Inc.美国加利福尼亚州圣何塞西塔斯曼大道170号，邮编95134"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 853-9172\nEMail: cds@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Vinay Gaonkar Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "zh-CHS": "Vinay Gaonkar Cisco Systems，Inc.美国加利福尼亚州圣何塞西塔斯曼大道170号，邮编95134"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 527-8576\nEMail: vgaonkar@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA USA 95134",
      "zh-CHS": "Keith McCloghrie Cisco Systems，Inc.美国加利福尼亚州圣何塞西塔斯曼大道170号，邮编95134"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408-526-5260\nEMail: kzm@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Silvano Gai Retired",
      "zh-CHS": "西尔瓦诺·盖退休了"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}