{
  "title": {
    "text": "RFC 4613: Media Type Registrations for Downloadable Sounds for Musical Instrument Digital Interface (MIDI)",
    "zh-CHS": "RFC 4613"
  },
  "number": 4613,
  "created_at": "2021-11-14 11:11:00.506276+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          P. Frojdh\nRequest for Comments: 4613                                   U. Lindgren\nCategory: Informational                                    M. Westerlund\n                                                                Ericsson\n                                                          September 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Media Type Registrations for Downloadable Sounds for Musical Instrument Digital Interface (MIDI)",
      "zh-CHS": "乐器数字接口（MIDI）可下载声音的媒体类型注册"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document serves to register a media type for Downloadable Sounds.",
      "zh-CHS": "本文档用于注册可下载声音的媒体类型。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................1\n2. Security Considerations .........................................2\n3. IANA Considerations .............................................2\n   3.1. Media Type for Downloadable Sounds .........................3\n4. References ......................................................5\n   4.1. Normative References .......................................5\n   4.2. Informative References .....................................5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The present document seeks to register a media type for Downloadable Sounds (DLSes). The DLS format is used to define instruments for widely used wavetable synthesizers associated with the standards [DLS1, DLS2, MDLS]. DLSes and their associated standards are maintained and defined by two organizations, the Musical Instrument Digital Interface (MIDI) Manufacturers Association (MMA) and the Association of the Musical Electronics Industry (AMEI).",
      "zh-CHS": "本文件旨在注册可下载声音（DLSE）的媒体类型。DLS格式用于定义与标准[DLS1、DLS2、MDLS]相关的广泛使用的波表合成器的仪器。DLSE及其相关标准由两个组织维护和定义，即乐器数字接口（MIDI）制造商协会（MMA）和音乐电子行业协会（AMEI）。"
    },
    {
      "indent": 3,
      "text": "The media type defined here is needed to identify DLS files correctly when they are served over HTTP, included in multi-part documents, or used in other places where media types are used.",
      "zh-CHS": "当通过HTTP提供DLS文件、包含在多部分文档中或在使用媒体类型的其他地方使用DLS文件时，需要在此定义的媒体类型来正确标识这些文件。"
    },
    {
      "indent": 0,
      "text": "2. Security Considerations",
      "section_title": true,
      "zh-CHS": "2. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The DLS format may contain audio, displayable text data, and modeling parameters (a.k.a. articulation parameters). In addition, the DLS format contains a so-called conditional chunk that is 'active' in the sense that it affects the execution of a DLS file parser. However, the DLS format does not currently define any scripting mechanism.",
      "zh-CHS": "DLS格式可能包含音频、可显示文本数据和建模参数（也称为铰接参数）。此外，DLS格式包含一个所谓的条件块，从影响DLS文件解析器执行的意义上说，该块是“活动的”。但是，DLS格式当前未定义任何脚本机制。"
    },
    {
      "indent": 3,
      "text": "Clearly, it is possible to author malicious files that, for example, contain large amounts of data always blocked by a conditional statement; i.e., no synthesizer loads the instruments.",
      "zh-CHS": "显然，有可能编写恶意文件，例如，包含大量总是被条件语句阻止的数据；i、 例如，没有合成器加载仪器。"
    },
    {
      "indent": 3,
      "text": "However, for DLS, clients can and usually do protect themselves against these kinds of attacks. A key point is that conditional chunks are optional, that is, a parser does not have to execute a conditional chunk. However, if a parser evaluates a conditional chunk, it is still possible to parse its content and draw to a conclusion as to whether it is usable for a particular synthesizer engine.",
      "zh-CHS": "但是，对于DLS，客户端可以而且通常确实保护自己免受此类攻击。关键的一点是条件块是可选的，也就是说，解析器不必执行条件块。但是，如果解析器对条件块进行求值，仍然可以解析其内容并得出结论，确定它是否可用于特定的合成器引擎。"
    },
    {
      "indent": 3,
      "text": "Note that selected metadata fields may include information partly intended to protect the media against unauthorized use or distribution. In this case, the intention is that alteration or removal of the data in the field would be treated as an offense under national agreements based on World Intellectual Property Organization (WIPO) treaties.",
      "zh-CHS": "请注意，选定的元数据字段可能包括部分用于保护媒体免受未经授权的使用或分发的信息。在这种情况下，意图是根据基于世界知识产权组织（WIPO）条约的国家协定，更改或删除该领域的数据将被视为犯罪。"
    },
    {
      "indent": 3,
      "text": "DLS have an extensible structure, making it theoretically possible to define metadata fields or media formats in the future that could be used to induce particular actions of the recipient, and thus that would present additional security risks. However, this type of capability is currently not supported in the referenced specifications.",
      "zh-CHS": "DLS有一个可扩展的结构，从理论上讲，将来可以定义元数据字段或媒体格式，这些字段或格式可用于诱导接收者的特定操作，因此会带来额外的安全风险。但是，参考规范中目前不支持这种类型的功能。"
    },
    {
      "indent": 3,
      "text": "There is no current provision in the DLS standard for encryption, signing, or authentication within the file formats.",
      "zh-CHS": "DLS标准中没有关于文件格式中的加密、签名或身份验证的现行规定。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the media type audio/dls, as specified in Section 3.1. The registration uses the template present in [RFC4288].",
      "zh-CHS": "IANA已按照第3.1节的规定注册了媒体类型音频/dls。注册使用[RFC4288]中的模板。"
    },
    {
      "indent": 0,
      "text": "3.1. Media Type for Downloadable Sounds",
      "section_title": true,
      "zh-CHS": "3.1. 可下载声音的媒体类型"
    },
    {
      "indent": 3,
      "text": "Type name: audio",
      "zh-CHS": "类型名称：音频"
    },
    {
      "indent": 3,
      "text": "Subtype name: dls",
      "zh-CHS": "子类型名称：dls"
    },
    {
      "indent": 3,
      "text": "Required parameters: None",
      "zh-CHS": "所需参数：无"
    },
    {
      "indent": 3,
      "text": "Optional parameters: 'dls-type' A comma-separated list of the dls types (one or more) that the file content conforms to. The following values are specified: 0, 1, and 2 signify Downloadable Sounds Level 1.1b content, Downloadable Sounds Level 2.1 content, and Mobile Downloadable Sound content, respectively. All types that the content conforms to should be indicated. Further values (integers) may be specified in the future, and any unknown values shall be ignored. If the parameter is not specified, it corresponds to a value equal to 0; i.e., the content conforms to Downloadable Sound level 1.1b.",
      "zh-CHS": "可选参数：“dls类型”文件内容符合的dls类型（一个或多个）的逗号分隔列表。指定以下值：0、1和2分别表示可下载声音级别1.1b内容、可下载声音级别2.1内容和移动可下载声音内容。应注明内容符合的所有类型。将来可能会指定更多的值（整数），并且应忽略任何未知值。如果未指定参数，则对应于等于0的值；i、 例如，内容符合可下载声级1.1b。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: DLS files are binary and should be transmitted in a suitable encoding without CR/LF conversion, 7-bit stripping etc.; base64 [RFC3548] is a suitable encoding.",
      "zh-CHS": "编码注意事项：DLS文件为二进制文件，应以适当的编码传输，无需CR/LF转换、7位剥离等。；base64[RFC3548]是一种合适的编码。"
    },
    {
      "indent": 3,
      "text": "Security considerations: see the security considerations in Section 2 of RFC 4613.",
      "zh-CHS": "安全注意事项：参见RFC 4613第2节中的安全注意事项。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: This media type is for consumption by a MIDI player capable of utilizing downloadable sounds for its synthesizers. A general-purpose audio player will not be capable of utilizing the audio within the format without explicit support of the format.",
      "zh-CHS": "互操作性注意事项：这种媒体类型供MIDI播放器使用，MIDI播放器能够为其合成器使用可下载的声音。如果没有对格式的明确支持，通用音频播放器将无法使用格式内的音频。"
    },
    {
      "indent": 3,
      "text": "Published specification: Downloadable Sounds Level 1.1b [DLS1], Downloadable Sounds Level 2.1 [DLS2], and Mobile Downloadable Sounds [MDLS]. MMA specifications can be ordered from the MMA web site, www.midi.org.",
      "zh-CHS": "已发布的规范：可下载声音级别1.1b[DLS1]、可下载声音级别2.1[DLS2]和移动可下载声音[MDLS]。MMA规范可从MMA网站www.midi.org订购。"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: Multi-media",
      "zh-CHS": "使用此媒体类型的应用程序：多媒体"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "zh-CHS": "其他信息："
    },
    {
      "indent": 6,
      "text": "Magic number(s):                The ninth to twelfth bytes of\n                                the file must equal (in\n                                hexadecimal notation) 44, 4c,\n                                53, and 20, respectively.\nFile extension(s):              .dls is declared at\n                                http://www.nist.gov/nics",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: Ulf A. Lindgren, ulf.a.lindgren@ericsson.com",
      "zh-CHS": "联系人和电子邮件地址，以获取更多信息：Ulf A.Lindgren，Ulf.A。lindgren@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: None",
      "zh-CHS": "使用限制：无"
    },
    {
      "indent": 3,
      "text": "Author: Per Frojdh Ulf A. Lindgren Magnus Westerlund",
      "zh-CHS": "作者：Per Frojdh Ulf A.Lindgren Magnus Westerlund"
    },
    {
      "indent": 3,
      "text": "Change controller:                 MIDI Manufacturers Association\n                                   http://www.midi.org\n                                   info@midi.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "zh-CHS": "4. 工具书类"
    },
    {
      "indent": 0,
      "text": "4.1. Normative References",
      "section_title": true,
      "zh-CHS": "4.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[DLS1] \"Downloadable Sounds Level 1.1b\", MMA/AMEI specification v1.1b, Los Angeles, CA, USA, 2004.",
      "zh-CHS": "[DLS1]“可下载声音级别1.1b”，MMA/AMEI规范v1.1b，美国加利福尼亚州洛杉矶，2004年。"
    },
    {
      "indent": 3,
      "text": "[DLS2] \"Downloadable Sounds Level 2.1\", MMA/AMEI specification v1.0, Los Angeles, CA, USA, 2001.",
      "zh-CHS": "[DLS2]“2.1级可下载声音”，MMA/AMEI规范v1.0，美国加利福尼亚州洛杉矶，2001年。"
    },
    {
      "indent": 3,
      "text": "[MDLS] \"Mobile Downloadable Sounds 1.0\", MMA specification v1.0, Los Angeles, CA, USA, 2004.",
      "zh-CHS": "[MDLS]“移动可下载声音1.0”，MMA规范1.0版，美国加利福尼亚州洛杉矶，2004年。"
    },
    {
      "indent": 3,
      "text": "[RFC4288] Freed, N. and J. Klensin, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 4288, December 2005.",
      "zh-CHS": "[RFC4288]Freed，N.和J.Klensin，“介质类型规范和注册程序”，BCP 13，RFC 4288，2005年12月。"
    },
    {
      "indent": 0,
      "text": "4.2. Informative References",
      "section_title": true,
      "zh-CHS": "4.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3548] Josefsson, S., \"The Base16, Base32, and Base64 Data Encodings\", RFC 3548, July 2003.",
      "zh-CHS": "[RFC3548]Josefsson，S.，“Base16、Base32和Base64数据编码”，RFC3548，2003年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Per Frojdh Ericsson AB Ericsson Research SE-164 80 Stockholm Sweden",
      "zh-CHS": "Per Frojdh Ericsson AB Ericsson Research SE-164 80瑞典斯德哥尔摩"
    },
    {
      "indent": 3,
      "text": "EMail: per.frojdh@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Ulf A. Lindgren Ericsson AB Ericsson Research SE-417 56 Goteborg Sweden",
      "zh-CHS": "Ulf A.Lindgren Ericsson AB Ericsson Research SE-417 56瑞典哥德堡"
    },
    {
      "indent": 3,
      "text": "EMail: ulf.a.lindgren@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Magnus Westerlund Ericsson AB Ericsson Research SE-164 80 Stockholm Sweden",
      "zh-CHS": "Magnus Westerlund Ericsson AB Ericsson Research SE-164 80瑞典斯德哥尔摩"
    },
    {
      "indent": 3,
      "text": "EMail: magnus.westerlund@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}