{
  "title": {
    "text": "RFC 4968: Analysis of IPv6 Link Models for 802.16 Based Networks",
    "zh-CHS": "RFC 4968"
  },
  "number": 4968,
  "created_at": "2021-11-15 18:42:06.154714+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                S. Madanapalli, Ed.\nRequest for Comments: 4968                            Ordyn Technologies\nCategory: Informational                                      August 2007",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Analysis of IPv6 Link Models for IEEE 802.16 Based Networks",
      "zh-CHS": "基于ieee802.16网络的IPv6链路模型分析"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document provides different IPv6 link models that are suitable for IEEE 802.16 based networks and provides analysis of various considerations for each link model and the applicability of each link model under different deployment scenarios. This document is the result of a design team (DT) that was formed to analyze the IPv6 link models for IEEE 802.16 based networks.",
      "zh-CHS": "本文档提供了适用于基于IEEE 802.16的网络的不同IPv6链路模型，并分析了每个链路模型的各种考虑因素以及每个链路模型在不同部署场景下的适用性。本文档是为分析基于IEEE 802.16网络的IPv6链路模型而成立的设计团队（DT）的成果。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n3.  IPv6 Link Models for IEEE 802.16 Based Networks  . . . . . . .  3\n  3.1.  Shared IPv6 Prefix Link Model  . . . . . . . . . . . . . .  3\n    3.1.1.  Prefix Assignment  . . . . . . . . . . . . . . . . . .  5\n    3.1.2.  Address Autoconfiguration  . . . . . . . . . . . . . .  5\n    3.1.3.  Duplicate Address Detection  . . . . . . . . . . . . .  5\n    3.1.4.  Considerations . . . . . . . . . . . . . . . . . . . .  6\n    3.1.5.  Applicability  . . . . . . . . . . . . . . . . . . . .  7\n  3.2.  Point-to-Point Link Model  . . . . . . . . . . . . . . . .  7\n    3.2.1.  Prefix Assignment  . . . . . . . . . . . . . . . . . .  8\n    3.2.2.  Address Autoconfiguration  . . . . . . . . . . . . . .  8\n    3.2.3.  Considerations . . . . . . . . . . . . . . . . . . . .  8\n    3.2.4.  Applicability  . . . . . . . . . . . . . . . . . . . .  9\n  3.3.  Ethernet-Like Link Model . . . . . . . . . . . . . . . . . 10\n    3.3.1.  Prefix Assignment  . . . . . . . . . . . . . . . . . . 10\n    3.3.2.  Address Autoconfiguration  . . . . . . . . . . . . . . 10\n    3.3.3.  Duplicate Address Detection  . . . . . . . . . . . . . 10\n    3.3.4.  Considerations . . . . . . . . . . . . . . . . . . . . 11\n    3.3.5.  Applicability  . . . . . . . . . . . . . . . . . . . . 11\n4.  Renumbering  . . . . . . . . . . . . . . . . . . . . . . . . . 11\n5.  Effect on Dormant Mode . . . . . . . . . . . . . . . . . . . . 12\n6.  Effect on Routing  . . . . . . . . . . . . . . . . . . . . . . 12\n7.  Conclusions and Relevant Link Models . . . . . . . . . . . . . 13\n8.  Security Considerations  . . . . . . . . . . . . . . . . . . . 13\n9.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 13\n10. Contributors . . . . . . . . . . . . . . . . . . . . . . . . . 14\n11. References . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n  11.1. Normative References . . . . . . . . . . . . . . . . . . . 14\n  11.2. Informative References . . . . . . . . . . . . . . . . . . 14",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "IEEE 802.16 [4] [5] is a point-to-multipoint, connection-oriented access technology for the last mile without bi-directional native multicast support. IEEE 802.16 has defined only downlink multicast support. This leads to two methods for running IP protocols that traditionally assume the availability of multicast at the link layer. One method is to use bridging, e.g., IEEE 802.1D [6], to support bi-directional multicast. Another method is to treat the IEEE 802.16 MAC (Message Authentication Code) transport connections between an MS (Mobile Station) and BS (Base Station) as point-to-point IP links so that the IP protocols (e.g., ARP (Address Resolution Protocol), IPv6 Neighbor Discovery) can be run without any problems.",
      "zh-CHS": "IEEE 802.16[4][5]是一种面向连接的点对多点接入技术，适用于最后一英里，无需双向本机多播支持。IEEE 802.16仅定义了下行链路多播支持。这导致了两种运行IP协议的方法，它们传统上假设链路层的多播可用性。一种方法是使用桥接，例如IEEE 802.1D[6]，以支持双向多播。另一种方法是将MS（移动站）和BS（基站）之间的IEEE 802.16 MAC（消息认证码）传输连接视为点对点IP链路，以便IP协议（例如，ARP（地址解析协议）、IPv6邻居发现）可以无任何问题地运行。"
    },
    {
      "indent": 3,
      "text": "This is further complicated by the definition of commercial network models like WiMAX, which defines the WiMAX transport connection that extends the IEEE 802.16 MAC transport connection all the way to an access router by using a tunnel between the base station and the access router [14]. This leads to multiple ways of deploying IP over IEEE 802.16 based networks.",
      "zh-CHS": "商业网络模型（如WiMAX）的定义使这一点更加复杂，WiMAX定义了WiMAX传输连接，通过使用基站和接入路由器之间的隧道将IEEE 802.16 MAC传输连接一直延伸到接入路由器[14]。这导致了在基于IEEE 802.16的网络上部署IP的多种方法。"
    },
    {
      "indent": 3,
      "text": "This document looks at various considerations in selecting a link model for IEEE 802.16 based networks and provides an analysis of the various possible link models. And finally, this document provides a recommendation for choosing one link model that is best suitable for the deployment.",
      "zh-CHS": "本文档介绍了为基于IEEE 802.16的网络选择链路模型时的各种注意事项，并对各种可能的链路模型进行了分析。最后，本文档提供了选择最适合部署的链路模型的建议。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The terminology in this document is based on the definitions in [6], in addition to the ones specified in this section.",
      "zh-CHS": "除本节规定的定义外，本文件中的术语以[6]中的定义为基础。"
    },
    {
      "indent": 3,
      "text": "Access Router (AR): An entity that performs an IP routing function to provide IP connectivity for Mobile Stations. In WiMAX Networks, the AR is an Access Service Network Gateway.",
      "zh-CHS": "接入路由器（AR）：执行IP路由功能为移动站提供IP连接的实体。在WiMAX网络中，AR是接入服务网络网关。"
    },
    {
      "indent": 3,
      "text": "Access Service Network (ASN) - The ASN is defined as a complete set of network functions needed to provide radio access to a WiMAX subscriber. The ASN is the access network to which the MS attaches. The IPv6 access router is an entity within the ASN. The term ASN is specific to the WiMAX network architecture.",
      "zh-CHS": "接入服务网络（ASN）——ASN被定义为向WiMAX用户提供无线接入所需的一整套网络功能。ASN是MS连接的接入网络。IPv6访问路由器是ASN中的一个实体。术语ASN特定于WiMAX网络架构。"
    },
    {
      "indent": 3,
      "text": "Dormant Mode: A state in which a mobile station restricts its ability to receive normal IP traffic by reducing monitoring of radio channels. This allows the mobile station to save power and reduces signaling load on the network. In the dormant mode, the MS is only listening at scheduled intervals to the paging channel. The network (e.g., the AR) maintains state about an MS that has transitioned to dormant mode and can page it when needed.",
      "zh-CHS": "休眠模式：移动台通过减少对无线信道的监控来限制其接收正常IP通信的能力的一种状态。这允许移动站节省电力并减少网络上的信令负载。在休眠模式下，MS仅以预定的间隔监听寻呼信道。网络（例如，AR）维持已转换到休眠模式的MS的状态，并可在需要时对其进行寻呼。"
    },
    {
      "indent": 0,
      "text": "3. IPv6 Link Models for IEEE 802.16 Based Networks",
      "section_title": true,
      "zh-CHS": "3. 基于IEEE 802.16网络的IPv6链路模型"
    },
    {
      "indent": 3,
      "text": "This section discusses various IPv6 link models for IEEE 802.16 based networks and provides their operational considerations in practical deployment scenarios.",
      "zh-CHS": "本节讨论基于IEEE 802.16的网络的各种IPv6链路模型，并提供它们在实际部署场景中的操作注意事项。"
    },
    {
      "indent": 0,
      "text": "3.1. Shared IPv6 Prefix Link Model",
      "section_title": true,
      "zh-CHS": "3.1. 共享IPv6前缀链路模型"
    },
    {
      "indent": 3,
      "text": "In this model, all MSs attached to an AR share one or more prefixes for constructing their global IPv6 addresses, however this model does not provide any multicast capability. The following figures illustrates a high-level view of this link model wherein one or more",
      "zh-CHS": "在该模型中，所有连接到AR的MS共享一个或多个前缀以构建其全局IPv6地址，但是该模型不提供任何多播功能。下图说明了此链接模型的高级视图，其中一个或多个"
    },
    {
      "indent": 3,
      "text": "prefixes advertised on the link would be used by all the MSs attached to the IPv6 link.",
      "zh-CHS": "链接上公布的前缀将由连接到IPv6链接的所有MS使用。"
    },
    {
      "indent": 8,
      "text": "+-----+\n| MS1 |-----+\n+-----+     |\n            |\n            |\n+-----+     |     +-----+          +--------+\n| MS2 |-----+-----| BS1 |----------|   AR   |-------Internet\n+-----+     |     +-----+          +--------+\n   .        |           ____________\n   .        |          ()__________()\n+-----+     |             L2 Tunnel\n| MSn |-----+\n+-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 1. Shared IPv6 Prefix Link Model",
      "zh-CHS": "图1。共享IPv6前缀链路模型"
    },
    {
      "indent": 3,
      "text": "The above figure shows the case where the BS and AR exist as separate entities. In this case, a tunnel exists between the BS and AR per MS basis.",
      "zh-CHS": "上图显示了BS和AR作为独立实体存在的情况。在这种情况下，基于每MS在BS和AR之间存在隧道。"
    },
    {
      "indent": 3,
      "text": "In this link model, the link between the MS and the AR at the IPv6 layer is viewed as a shared link, and the lower layer link between the MS and BS is a point-to-point link. This point-to-point link between the MS and BS is extended all the way to the AR when the granularity of the tunnel between the BS and AR is on a per MS basis. This is illustrated in the following figure below.",
      "zh-CHS": "在该链路模型中，IPv6层的MS和AR之间的链路被视为共享链路，MS和BS之间的较低层链路是点对点链路。当BS和AR之间的隧道的粒度基于每MS时，MS和BS之间的点到点链路一直扩展到AR。下图对此进行了说明。"
    },
    {
      "indent": 8,
      "text": "  MS\n+----+                                     +----+\n|    |      IPv6 (Shared link)             |    |\n| L3 |=====================================|    |\n|    |                                     |    |\n|----|   PTP conn. +----+   L2 Tunnel      | AR |---Internet\n| L2 |-------------| BS |==================|    |\n|    |             |    |                  |    |\n+----+             +----+                  |    |\n                                           |    |\n                   +----+   L2 Tunnel      |    |\n                   | BS |==================|    |\n                   |    |                  |    |\n                   +----+                  +----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Figure 2. Shared IPv6 Prefix Link Model - Layered View",
      "zh-CHS": "图2。共享IPv6前缀链路模型-分层视图"
    },
    {
      "indent": 3,
      "text": "In this link model, an AR can serve one or more BSs. All MSs connected to BSs that are served by an AR are on the same IPv6 link. This model is different from an Ethernet Like Link model wherein the later model provides an Ethernet link abstraction and multicast capability to the IPv6 layer, whereas the Shared IPv6 Prefix Link Model defined here does not provide native link-layer multicast and broadcast capabilities.",
      "zh-CHS": "在此链路模型中，AR可以服务于一个或多个BSs。所有连接到由AR提供服务的BSs的MS都位于同一IPv6链路上。此模型不同于类似以太网的链路模型，后者为IPv6层提供以太网链路抽象和多播功能，而此处定义的共享IPv6前缀链路模型不提供本机链路层多播和广播功能。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Prefix Assignment",
      "section_title": true,
      "zh-CHS": "3.1.1. 前缀分配"
    },
    {
      "indent": 3,
      "text": "One or more IPv6 prefixes are assigned to the link and hence shared by all the nodes that are attached to the link. The prefixes are advertised with the autonomous flag (A-Flag) set and the On-link flag (L-flag) reset for address autoconfiguration so that the nodes may not make an on-link assumption for the addresses in those prefixes.",
      "zh-CHS": "一个或多个IPv6前缀分配给链路，因此由连接到链路的所有节点共享。使用设置的自治标志（A标志）和用于地址自动配置的链路上标志（L标志）重置来通告前缀，以便节点不会对这些前缀中的地址进行链路上假设。"
    },
    {
      "indent": 0,
      "text": "3.1.2. Address Autoconfiguration",
      "section_title": true,
      "zh-CHS": "3.1.2. 地址自动配置"
    },
    {
      "indent": 3,
      "text": "The standard IPv6 address autoconfiguration mechanisms, which are specified in [2] [3], are used.",
      "zh-CHS": "使用[2][3]中规定的标准IPv6地址自动配置机制。"
    },
    {
      "indent": 0,
      "text": "3.1.3. Duplicate Address Detection",
      "section_title": true,
      "zh-CHS": "3.1.3. 重复地址检测"
    },
    {
      "indent": 3,
      "text": "The DAD procedure, as specified in [2], does not adapt well to the IEEE 802.16 air interface as there is no native multicast support. The DAD can be performed with MLD (Multicast Listener Discovery) snooping [7] and the AR relaying the DAD probe to the address owners in case the address is a duplicate, called Relay DAD. In this method, the MS behavior is the same as specified in [2] and the optimization is achieved with the support of AR, which maintains the MLD table for a list of multicast addresses and the nodes that joined the multicast address. The relay DAD works as below:",
      "zh-CHS": "[2]中规定的DAD过程不适合IEEE 802.16空中接口，因为没有本机多播支持。DAD可以通过MLD（多播侦听器发现）窥探[7]执行，如果地址是重复的，AR将DAD探测转发给地址所有者，称为中继DAD。在该方法中，MS行为与[2]中规定的相同，并且在AR的支持下实现了优化，AR为多播地址列表和加入多播地址的节点维护MLD表。继电器DAD的工作原理如下："
    },
    {
      "indent": 3,
      "text": "1. An MS constructs a Link Local Address as specified in [2].",
      "zh-CHS": "1. MS按照[2]中的规定构造链路本地地址。"
    },
    {
      "indent": 3,
      "text": "2. The MS constructs a solicited node multicast address for the corresponding Link Local Address and sends an MLD Join request for the solicited node multicast address.",
      "zh-CHS": "2. MS为对应的链路本地地址构造请求的节点多播地址，并为请求的节点多播地址发送MLD加入请求。"
    },
    {
      "indent": 3,
      "text": "3. The MS starts verifying address uniqueness by sending a DAD NS on the initial MAC transport connection.",
      "zh-CHS": "3. MS通过在初始MAC传输连接上发送DAD NS来开始验证地址唯一性。"
    },
    {
      "indent": 3,
      "text": "4. The AR consults the MLD table for who joined the multicast address. If the AR does not find any entry in the MLD table, the AR silently discards the DAD NS. If the AR finds a match, the AR relays the DAD NS to the address owner.",
      "zh-CHS": "4. AR查询MLD表以查找加入多播地址的用户。如果AR在MLD表中找不到任何条目，AR会自动丢弃DAD N。如果AR找到匹配项，则AR将DAD N转发给地址所有者。"
    },
    {
      "indent": 3,
      "text": "5. The address owner defends the address by sending DAD NA, which is relayed to the DAD originating MS via the AR.",
      "zh-CHS": "5. 地址所有者通过发送DAD NA来保护地址，DAD NA通过AR转发给DAD发起MS。"
    },
    {
      "indent": 3,
      "text": "6. If the DAD originating MS does not receive any response (DAD NA) to its DAD NS, the MS assigns the address to its interface. If the MS receives the DAD NA, the MS discards the tentative address and behaves as specified in [2].",
      "zh-CHS": "6. 如果发起DAD的MS没有收到对其DAD NS的任何响应（DAD NA），则MS将地址分配给其接口。如果MS接收到DAD NA，MS将丢弃暂定地址，并按照[2]中的规定行事。"
    },
    {
      "indent": 0,
      "text": "3.1.4. Considerations",
      "section_title": true,
      "zh-CHS": "3.1.4. 考虑"
    },
    {
      "indent": 0,
      "text": "3.1.4.1. Reuse of Existing Specifications",
      "section_title": true,
      "zh-CHS": "3.1.4.1. 重用现有规范"
    },
    {
      "indent": 3,
      "text": "The shared IPv6 prefix model uses the existing specification and does not require any protocol changes or any new protocols. However, this model requires implementation changes for DAD optimization on the AR.",
      "zh-CHS": "共享IPv6前缀模型使用现有规范，不需要任何协议更改或任何新协议。但是，此模型需要对AR上的DAD优化进行实现更改。"
    },
    {
      "indent": 0,
      "text": "3.1.4.2. On-link Multicast Support",
      "section_title": true,
      "zh-CHS": "3.1.4.2. 链路多播支持"
    },
    {
      "indent": 3,
      "text": "No native on-link multicast is possible with this method. However, the multicast can be supported with using a backend process in AR that maintains the multicast members list and forwards the multicast packets to the MSs belonging to a particular multicast group in a unicast manner. MLD snooping [7] should be used for maintaining the multicast members list.",
      "zh-CHS": "此方法不允许本地链路上多播。然而，可以通过使用AR中的后端处理来支持多播，该后端处理维护多播成员列表并以单播方式将多播分组转发给属于特定多播组的ms。MLD窥探[7]应用于维护多播成员列表。"
    },
    {
      "indent": 0,
      "text": "3.1.4.3. Consistency in IP Link Definition",
      "section_title": true,
      "zh-CHS": "3.1.4.3. IP链路定义的一致性"
    },
    {
      "indent": 3,
      "text": "The definition of an IPv6 link is consistent for all procedures and functionalities except for the support of native on-link multicast support.",
      "zh-CHS": "IPv6链路的定义对于所有过程和功能都是一致的，但支持本机链路上多播支持除外。"
    },
    {
      "indent": 0,
      "text": "3.1.4.4. Packet Forwarding",
      "section_title": true,
      "zh-CHS": "3.1.4.4. 包转发"
    },
    {
      "indent": 3,
      "text": "All the packets travel to the AR before being delivered to the final destination as the layer 2 transport connection exists between the MS and AR. The AR normally handles the packets with external IPv6 addresses. However, the packets with link local destination addresses are relayed by the AR to the destination without decrementing the hop-limit.",
      "zh-CHS": "由于MS和AR之间存在第2层传输连接，因此所有数据包在交付到最终目的地之前都会传输到AR。AR通常处理具有外部IPv6地址的数据包。然而，具有链路本地目的地地址的分组由AR中继到目的地，而不降低跳数限制。"
    },
    {
      "indent": 0,
      "text": "3.1.4.5. Changes to Host Implementation",
      "section_title": true,
      "zh-CHS": "3.1.4.5. 对主机实现的更改"
    },
    {
      "indent": 3,
      "text": "This link model does not require any implementation changes for the host implementation.",
      "zh-CHS": "此链接模型不需要对主机实现进行任何实现更改。"
    },
    {
      "indent": 0,
      "text": "3.1.4.6. Changes to Router Implementation",
      "section_title": true,
      "zh-CHS": "3.1.4.6. 路由器实现的变化"
    },
    {
      "indent": 3,
      "text": "This link model requires MLD snooping in the AR for supporting Relay DAD.",
      "zh-CHS": "该链路模型需要在AR中进行MLD窥探以支持中继DAD。"
    },
    {
      "indent": 0,
      "text": "3.1.5. Applicability",
      "section_title": true,
      "zh-CHS": "3.1.5. 适用性"
    },
    {
      "indent": 3,
      "text": "This model is good for providing shared on-link services in conjunction with the IP convergence sublayer with IPv6 classifiers. However, in public access networks like cellular networks, this model cannot be used for the end users to share any of their personal devices/services with the public.",
      "zh-CHS": "该模型适合于结合带有IPv6分类器的IP聚合子层提供共享的链路上服务。然而，在诸如蜂窝网络之类的公共接入网络中，该模型不能用于最终用户与公众共享其任何个人设备/服务。"
    },
    {
      "indent": 3,
      "text": "This link model was also under consideration of the WiMAX Forum Network Working Group for use with IPv6 CS (Convergence Sublayer) access.",
      "zh-CHS": "WiMAX论坛网络工作组也在考虑这种链路模型，以用于ipv6cs（汇聚子层）接入。"
    },
    {
      "indent": 0,
      "text": "3.2. Point-to-Point Link Model",
      "section_title": true,
      "zh-CHS": "3.2. 点对点链接模型"
    },
    {
      "indent": 3,
      "text": "In this model, a set of MAC transport connections between an MS and an AR are treated as a single link. The point-to-point link model follows the recommendations of [8]. In this model, each link between an MS and an AR is allocated a separate, unique prefix or a set of unique prefixes by the AR. No other node under the AR has the same prefixes on the link between it and the AR. The following diagram illustrates this model.",
      "zh-CHS": "在该模型中，MS和AR之间的一组MAC传输连接被视为单个链路。点到点链路模型遵循[8]的建议。在此模型中，MS和AR之间的每条链路由AR分配一个单独的、唯一的前缀或一组唯一的前缀。AR下的其他节点在其和AR之间的链路上没有相同的前缀。下图说明了此模型。"
    },
    {
      "indent": 10,
      "text": "                    +----+                   +----+\n+-----+             |    |      Tunnel       |    |\n| MS1 |-------------|....|===================|    |\n+-----+             |    |                   |    |\n                    |    |                   |    |\n+-----+             |    |      Tunnel       |    |\n| MS2 |-------------|....|===================|    |---Internet\n+-----+             |    |                   | AR |\n                    | BS |                   |    |\n+-----+             |    |      Tunnel       |    |\n| MS3 |-------------|....|===================|    |\n+-----+             |    |                   |    |\n                    +----+                   +----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 3. Point-to-Point Link Model",
      "zh-CHS": "图3。点对点链接模型"
    },
    {
      "indent": 3,
      "text": "There are multiple possible ways that the point-to-point link between the AR and the MS can be implemented.",
      "zh-CHS": "有多种可能的方式可以实现AR和MS之间的点到点链路。"
    },
    {
      "indent": 3,
      "text": "1. One way to accomplish this is to run PPP on the link [8]. Running PPP requires that the IEEE 802.16 link use the Ethernet CS and PPP over Ethernet [9]. Since the IPv6 CS does not support PPP, whether PPP can be run depends on the network architecture.",
      "zh-CHS": "1. 实现这一点的一种方法是在链路上运行PPP[8]。运行PPP要求IEEE 802.16链路使用以太网CS和以太网PPP[9]。由于IPv6 CS不支持PPP，PPP是否可以运行取决于网络架构。"
    },
    {
      "indent": 3,
      "text": "2. If the actual physical medium is shared, like Ethernet, but PPP is not run, the link can be made point to point between the MS and AR by having each MS on a separate VLAN [11].",
      "zh-CHS": "2. 如果实际物理介质是共享的，如以太网，但PPP未运行，则可以通过将每个MS置于单独的VLAN上，在MS和AR之间建立点对点链路[11]。"
    },
    {
      "indent": 3,
      "text": "3. If neither PPP nor VLAN is used, the set of IEEE 802.16 connections can be viewed as a virtual point-to-point link.",
      "zh-CHS": "3. 如果既不使用PPP也不使用VLAN，则可以将IEEE 802.16连接集视为虚拟点到点链路。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Prefix Assignment",
      "section_title": true,
      "zh-CHS": "3.2.1. 前缀分配"
    },
    {
      "indent": 3,
      "text": "Prefixes are assigned to the link using the standard [1] Router Advertisement mechanism. The AR assigns a unique prefix or a set of unique prefixes for each MS. In the prefix information options, both the A-flag and L-flag are set to 1, as they can be used for address autoconfiguration and the prefixes are on the link.",
      "zh-CHS": "使用标准[1]路由器播发机制为链路分配前缀。AR为每个MS分配一个唯一前缀或一组唯一前缀。在前缀信息选项中，a标志和L标志均设置为1，因为它们可用于地址自动配置，且前缀位于链路上。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Address Autoconfiguration",
      "section_title": true,
      "zh-CHS": "3.2.2. 地址自动配置"
    },
    {
      "indent": 3,
      "text": "MSs perform link local as well as global address autoconfiguration exactly as specified in [2], including duplicate address detection. Because there is only one other node on the link, the AR, there is only a possibility of an address conflict with the AR, so collisions are statistically very unlikely, and easy to fix if they should occur.",
      "zh-CHS": "MSs完全按照[2]中的规定执行链路本地和全局地址自动配置，包括重复地址检测。由于链路上只有另一个节点，即AR，因此只有与AR发生地址冲突的可能性，因此从统计上讲，冲突非常不可能发生，如果发生冲突，则很容易修复。"
    },
    {
      "indent": 3,
      "text": "If DHCP is used for address configuration ('M=1' in the Router Advertisement), the DHCP server must provide addresses with a separate prefix per MS. The prefix must of course match a prefix that the ASN Gateway has advertised to the MS (if any).",
      "zh-CHS": "如果DHCP用于地址配置（“路由器播发中的M=1”），DHCP服务器必须为每毫秒提供一个单独的前缀。前缀当然必须与ASN网关向MS播发的前缀匹配（如果有）。"
    },
    {
      "indent": 0,
      "text": "3.2.3. Considerations",
      "section_title": true,
      "zh-CHS": "3.2.3. 考虑"
    },
    {
      "indent": 0,
      "text": "3.2.3.1. Reuse of Existing Specifications",
      "section_title": true,
      "zh-CHS": "3.2.3.1. 重用现有规范"
    },
    {
      "indent": 3,
      "text": "This solution reuses RFC 2461, 2462, and, if PPP is used, RFC 2472 and RFC 2516. No changes in these protocols are required; the protocols must only be configured properly.",
      "zh-CHS": "此解决方案重用RFC 2461、2462，如果使用PPP，则重用RFC 2472和RFC 2516。这些协议无需更改；必须正确配置协议。"
    },
    {
      "indent": 3,
      "text": "If PPP is not used, any VLAN solution, such as IEEE 802.1Q [9] or any L2 tunnel, can be used.",
      "zh-CHS": "如果不使用PPP，则可以使用任何VLAN解决方案，如IEEE 802.1Q[9]或任何L2隧道。"
    },
    {
      "indent": 0,
      "text": "3.2.3.2. On-link Multicast Support",
      "section_title": true,
      "zh-CHS": "3.2.3.2. 链路多播支持"
    },
    {
      "indent": 3,
      "text": "Since the link between the MS and the AR is point to point, any multicast can only be sent by one or the other node. Link local multicast between other nodes and the AR will not be seen.",
      "zh-CHS": "由于MS和AR之间的链路是点对点的，因此任何多播只能由一个或另一个节点发送。其他节点和AR之间的链路本地多播将不可见。"
    },
    {
      "indent": 0,
      "text": "3.2.3.3. Consistency in IP Link Definition",
      "section_title": true,
      "zh-CHS": "3.2.3.3. IP链路定义的一致性"
    },
    {
      "indent": 3,
      "text": "The IP link is fully consistent with a standard IP point-to-point link, without exception.",
      "zh-CHS": "IP链路与标准IP点到点链路完全一致，没有例外。"
    },
    {
      "indent": 0,
      "text": "3.2.3.4. Packet Forwarding",
      "section_title": true,
      "zh-CHS": "3.2.3.4. 包转发"
    },
    {
      "indent": 3,
      "text": "The MS always sends all packets to the AR because it is the only other node on the link. Link local unicast and multicast packets are also forwarded only between the two.",
      "zh-CHS": "MS总是将所有数据包发送到AR，因为它是链路上唯一的其他节点。链路本地单播和多播数据包也仅在两者之间转发。"
    },
    {
      "indent": 0,
      "text": "3.2.3.5. Changes to Host Implementation",
      "section_title": true,
      "zh-CHS": "3.2.3.5. 对主机实现的更改"
    },
    {
      "indent": 3,
      "text": "Host implementations follow standard IPv6 stack procedures. No changes are needed.",
      "zh-CHS": "主机实现遵循标准的IPv6堆栈过程。不需要改变。"
    },
    {
      "indent": 0,
      "text": "3.2.3.6. Changes to Router Implementation",
      "section_title": true,
      "zh-CHS": "3.2.3.6. 路由器实现的变化"
    },
    {
      "indent": 3,
      "text": "If PPP is used, no changes in router implementations are needed. If PPP is not used, the AR must be capable of doing the following:",
      "zh-CHS": "如果使用PPP，则不需要更改路由器实现。如果未使用PPP，AR必须能够执行以下操作："
    },
    {
      "indent": 3,
      "text": "1. Each MS is assigned a separate VLAN when IEEE 802.1X [12] or each MS must have an L2 tunnel to the AR to aggregate all the connections to the MS and present these set of connections as an interface to the IPv6 layer.",
      "zh-CHS": "1. 当IEEE 802.1X[12]或每个MS必须具有到AR的L2隧道时，每个MS被分配一个单独的VLAN，以聚合到MS的所有连接，并将这些连接集作为到IPv6层的接口。"
    },
    {
      "indent": 3,
      "text": "2. The AR must be configured to include a unique prefix or a set of prefixes for each MS. This unique prefix or set of prefixes must be included in Router Advertisements every time they are sent, and if DHCP is used, the addresses leased to the MS must include only the uniquely advertised prefixes.",
      "zh-CHS": "2. AR必须配置为包括每个MS的唯一前缀或一组前缀。每次发送路由器播发时，必须将此唯一前缀或一组前缀包括在路由器播发中，如果使用DHCP，则租给MS的地址必须仅包括唯一播发的前缀。"
    },
    {
      "indent": 3,
      "text": "Note that, depending on the router implementation, these functions may or may not be possible with simple configuration. No protocol changes are required, however.",
      "zh-CHS": "注意，根据路由器的实现情况，这些功能在简单配置下可能实现，也可能不实现。但是，不需要更改协议。"
    },
    {
      "indent": 0,
      "text": "3.2.4. Applicability",
      "section_title": true,
      "zh-CHS": "3.2.4. 适用性"
    },
    {
      "indent": 3,
      "text": "In enterprise networks, shared services including printers, fax machines, and other such online services are often available on the local link. These services are typically discovered using some kind of link local service discovery protocol. The unique prefix per MS",
      "zh-CHS": "在企业网络中，共享服务（包括打印机、传真机和其他此类在线服务）通常在本地链接上可用。这些服务通常使用某种链路本地服务发现协议来发现。每毫秒的唯一前缀"
    },
    {
      "indent": 3,
      "text": "model is not appropriate for these kinds of deployments, since it is not possible to have shared link services in the ASN.",
      "zh-CHS": "该模型不适用于此类部署，因为ASN中不可能有共享链路服务。"
    },
    {
      "indent": 3,
      "text": "The p2p link model is applicable to deployments where there are no shared services in the ASN. Such deployments are typical of service provider networks like cellular networks, which provide public access to wireless networks.",
      "zh-CHS": "p2p链路模型适用于ASN中没有共享服务的部署。这种部署是典型的服务提供商网络，如蜂窝网络，它提供对无线网络的公共访问。"
    },
    {
      "indent": 0,
      "text": "3.3. Ethernet-Like Link Model",
      "section_title": true,
      "zh-CHS": "3.3. 类以太网链路模型"
    },
    {
      "indent": 3,
      "text": "This model describes a scheme for configuration and provisioning of an IEEE 802.16 network so that it emulates a broadcast link in a manner similar to Ethernet. Figure 4 illustrates an example of the Ethernet model. This model essentially functions like an Ethernet link, which means the model works as described in [1], [2].",
      "zh-CHS": "该模型描述了IEEE 802.16网络的配置和供应方案，以便以类似于以太网的方式模拟广播链路。图4展示了以太网模型的一个示例。该模型的功能基本上类似于以太网链路，这意味着该模型的工作原理如[1]、[2]所述。"
    },
    {
      "indent": 3,
      "text": "One way to construct an Ethernet-like link is to implement bridging [13] between BSs and an AR, like a switched Ethernet. In Figure 4, bridging performs link aggregation between BSs and an AR. Bridging also supports multicast packet filtering.",
      "zh-CHS": "构建类似以太网的链路的一种方法是在BSs和AR之间实现桥接[13]，如交换式以太网。在图4中，桥接在BSs和AR之间执行链路聚合。桥接还支持多播数据包过滤。"
    },
    {
      "indent": 5,
      "text": "         +-----+                 +---+       +----+\n         | MS1 |---+             |   |   +---|AR1 |---Internet\n         +-----+   |             |  S|   |   +----+\n         +-----+   |   +-----+   |E w|   |\n         | MS2 |---+---| BS1 |---|t i|   |\n         +-----+       +-----+   |h t|---+\n                                 |  c|   |   +----+\n+-----+  +-----+       +-----+   |  h|   +---|AR2 |---Internet\n|Hosts|--|MS/GW|-------| BS2 |---|   |       +----+\n+-----+  +-----+       +-----+   +---+\nA network\nmay exist behind\nMS/GW",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 18,
      "text": "Figure 4: Ethernet Like Link Model",
      "zh-CHS": "图4：类似以太网的链路模型"
    },
    {
      "indent": 0,
      "text": "3.3.1. Prefix Assignment",
      "section_title": true,
      "zh-CHS": "3.3.1. 前缀分配"
    },
    {
      "indent": 3,
      "text": "Prefixes are assigned as specified in [1], [2].",
      "zh-CHS": "按照[1]、[2]中的规定分配前缀。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Address Autoconfiguration",
      "section_title": true,
      "zh-CHS": "3.3.2. 地址自动配置"
    },
    {
      "indent": 3,
      "text": "It is the same as described in [2].",
      "zh-CHS": "与[2]中所述相同。"
    },
    {
      "indent": 0,
      "text": "3.3.3. Duplicate Address Detection",
      "section_title": true,
      "zh-CHS": "3.3.3. 重复地址检测"
    },
    {
      "indent": 3,
      "text": "It is the same as described in [2].",
      "zh-CHS": "与[2]中所述相同。"
    },
    {
      "indent": 0,
      "text": "3.3.4. Considerations",
      "section_title": true,
      "zh-CHS": "3.3.4. 考虑"
    },
    {
      "indent": 0,
      "text": "3.3.4.1. Reuse of Existing Specifications",
      "section_title": true,
      "zh-CHS": "3.3.4.1. 重用现有规范"
    },
    {
      "indent": 3,
      "text": "All the IPv6 standards can be preserved or reused in this model.",
      "zh-CHS": "所有IPv6标准都可以在该模型中保留或重用。"
    },
    {
      "indent": 0,
      "text": "3.3.4.2. On-link Multicast Support",
      "section_title": true,
      "zh-CHS": "3.3.4.2. 链路多播支持"
    },
    {
      "indent": 3,
      "text": "On-link multicast can be emulated in a unicast manner by efficiently bridging between all BSs with IEEE 802.16 providing the links between the MSs and the bridge on top of the BS. MLD snooping should be used for efficient forwarding of multicast packets as specified in [7]. Nevertheless, in case of bridging, direct inter-MSs communication may not be not allowed due to restrictions from the service providers.",
      "zh-CHS": "通过使用IEEE 802.16在所有BSs之间有效桥接，可以以单播方式模拟链路上多播，该IEEE 802.16提供MSs与BS顶部桥接器之间的链路。MLD窥探应用于有效转发[7]中规定的多播数据包。然而，在桥接的情况下，由于服务提供商的限制，可能不允许MSs之间的直接通信。"
    },
    {
      "indent": 0,
      "text": "3.3.4.3. Consistency in IP Link Definition",
      "section_title": true,
      "zh-CHS": "3.3.4.3. IP链路定义的一致性"
    },
    {
      "indent": 3,
      "text": "This model is consistent with the IP link definition.",
      "zh-CHS": "该模型与IP链路定义一致。"
    },
    {
      "indent": 0,
      "text": "3.3.4.4. Packet Forwarding",
      "section_title": true,
      "zh-CHS": "3.3.4.4. 包转发"
    },
    {
      "indent": 3,
      "text": "When properly configured and assisted by simple bridging, IEEE 802.16 can emulate a simple broadcast network like Ethernet.",
      "zh-CHS": "当通过简单桥接进行适当配置和辅助时，IEEE 802.16可以模拟简单的广播网络，如以太网。"
    },
    {
      "indent": 0,
      "text": "3.3.4.5. Changes to Host Implementation",
      "section_title": true,
      "zh-CHS": "3.3.4.5. 对主机实现的更改"
    },
    {
      "indent": 3,
      "text": "No special impact on host implementation.",
      "zh-CHS": "对主机实现没有特殊影响。"
    },
    {
      "indent": 0,
      "text": "3.3.4.6. Changes to Router Implementation",
      "section_title": true,
      "zh-CHS": "3.3.4.6. 路由器实现的变化"
    },
    {
      "indent": 3,
      "text": "No special impact on router implementation under a separated AR-BS model, if the bridging is implemented in BS. Some networks, e.g., WiMAX networks, may require bridging to be implemented in the AR (ASN Gateway).",
      "zh-CHS": "如果桥接在BS中实现，则在分离的AR-BS模型下对路由器实现没有特殊影响。一些网络，例如WiMAX网络，可能需要在AR（ASN网关）中实现桥接。"
    },
    {
      "indent": 0,
      "text": "3.3.5. Applicability",
      "section_title": true,
      "zh-CHS": "3.3.5. 适用性"
    },
    {
      "indent": 3,
      "text": "This model works with the Ethernet CS and is chosen for fixed/nomadic WiMAX networks by the WiMAX Forum Network Working Group.",
      "zh-CHS": "该模型适用于以太网CS，由WiMAX论坛网络工作组为固定/游牧WiMAX网络选择。"
    },
    {
      "indent": 0,
      "text": "4. Renumbering",
      "section_title": true,
      "zh-CHS": "4. 重新编号"
    },
    {
      "indent": 3,
      "text": "If the downstream prefixes managed by the AR are involved in renumbering, it may be necessary to renumber each link under the AR. [10] discusses recommended procedures for renumbering.",
      "zh-CHS": "如果AR管理的下游前缀涉及重新编号，则可能需要对AR下的每个链接重新编号。[10]讨论了重新编号的建议程序。"
    },
    {
      "indent": 3,
      "text": "If the prefixes are advertised in RAs, the AR must withdraw the existing prefixes and advertise the new ones. Since each MS,",
      "zh-CHS": "如果在RAs中公布前缀，AR必须撤回现有前缀并公布新前缀。因为每一次,，"
    },
    {
      "indent": 3,
      "text": "irrespective of the link model, is on a separate point-to-point link at the MAC level because of the IEEE 802.16 connection oriented architecture, the AR must send an RA withdrawing the old prefix and advertising the new one to each link. In a point-to-point link model, the number of RAs sent is equal to the number of nodes the AR serves, whereas in the other two models, the AR sends a single RA to BS that is sent to all the MSs as separate RAs.",
      "zh-CHS": "无论链路模型如何，由于IEEE 802.16面向连接的体系结构，在MAC层的独立点到点链路上，AR必须发送RA，收回旧前缀并向每个链路公布新前缀。在点到点链路模型中，发送的RA数量等于AR服务的节点数量，而在其他两个模型中，AR向BS发送单个RA，作为单独的RA发送到所有MS。"
    },
    {
      "indent": 3,
      "text": "If DHCP is used to assign addresses, either the DHCP address lease lifetime may be reduced prior to the renumbering event to encourage MSs to renew their addresses quickly, or a DHCP Reconfigure message may be sent to each of the MSs by the server to cause them to renew their addresses.",
      "zh-CHS": "如果使用DHCP分配地址，则可能会在重新编号事件之前缩短DHCP地址租用期限，以鼓励MSs快速更新其地址，或者服务器可能会向每个MSs发送DHCP重新配置消息，使其更新其地址。"
    },
    {
      "indent": 3,
      "text": "In conclusion, the amount of traffic on the air-interface is the same for all link models. However, the number of RAs sent by the AR to BS can be better compared to the other two models.",
      "zh-CHS": "总之，对于所有链路模型，空中接口上的通信量是相同的。然而，与其他两种模型相比，AR发送给BS的RAs的数量可以更好。"
    },
    {
      "indent": 0,
      "text": "5. Effect on Dormant Mode",
      "section_title": true,
      "zh-CHS": "5. 对休眠模式的影响"
    },
    {
      "indent": 3,
      "text": "If the network needs to deliver packets to an MS, which is in dormant mode, the AR pages the MS. The MS that is monitoring the paging channel receives the page and transitions out of the dormant mode to active mode. It establishes connectivity with the network by requesting and obtaining the radio resources. The network is then able to deliver the packets to the MS. In many networks, packets destined to an MS in dormant mode are buffered at the AR in the network until connectivity is established.",
      "zh-CHS": "如果网络需要向处于休眠模式的MS发送数据包，AR将寻呼该MS。监控寻呼信道的MS接收该页面并从休眠模式转换到活动模式。它通过请求和获取无线资源来建立与网络的连接。然后，网络能够将分组传送到MS。在许多网络中，在休眠模式下发送到MS的分组在网络中的AR处缓冲，直到建立连接为止。"
    },
    {
      "indent": 3,
      "text": "Support for dormant MSs is critical in mobile networks, hence it is a necessary feature. Paging capability and optimizations possible for paging an MS are neither enhanced nor handicapped by the link model itself. However, the multicast capability within a link may cause for an MS to wake up for an unwanted packet. This can be avoided by filtering the multicast packets and delivering the packets to only for MSs that are listening for particular multicast packets. As the Shared IPv6 Prefix model does not have the multicast capability and the point-to-point link model has only one node on the link, neither has any effect on the dormant mode. The Ethernet-like link model may have the multicast capability, which requires filtering at the BS to support the dormant mode for the MSs.",
      "zh-CHS": "在移动网络中，对休眠MSs的支持至关重要，因此它是一个必要的功能。链路模型本身既不增强也不妨碍寻呼MS的寻呼能力和优化。然而，链路内的多播能力可能导致MS因不需要的分组而醒来。这可以通过过滤多播分组并仅针对正在侦听特定多播分组的ms将分组传送到来避免。由于共享IPv6前缀模型不具有多播功能，并且点到点链路模型在链路上只有一个节点，因此对休眠模式也没有任何影响。类似以太网的链路模型可能具有多播能力，这需要在BS处进行过滤以支持ms的休眠模式。"
    },
    {
      "indent": 0,
      "text": "6. Effect on Routing",
      "section_title": true,
      "zh-CHS": "6. 对路由的影响"
    },
    {
      "indent": 3,
      "text": "The model used in an IEEE 802.16 network may have a significant impact on how routing protocols are run over such a network. The deployment model presented in this document discusses the least impacting model on routing as connectivity on the provider edge is",
      "zh-CHS": "IEEE 802.16网络中使用的模型可能会对路由协议在此类网络上的运行方式产生重大影响。本文档中介绍的部署模型讨论了对路由影响最小的模型，因为提供程序边缘上的连接是"
    },
    {
      "indent": 3,
      "text": "intentionally limited to point-to-point connectivity from one BS to any one of multiple MSs. Any other deployment model may cause a significant impact on routing protocols, however, they are outside the scope of this document.",
      "zh-CHS": "有意限制从一个BS到多个ms中的任意一个的点对点连接。任何其他部署模型都可能对路由协议造成重大影响，但是，它们不在本文档的范围之内。"
    },
    {
      "indent": 0,
      "text": "7. Conclusions and Relevant Link Models",
      "section_title": true,
      "zh-CHS": "7. 结论和相关链接模型"
    },
    {
      "indent": 3,
      "text": "Ethernet-Like Link models would be used when the deployment requires the use of Ethernet CS, as this is the only model being proposed for the Ethernet CS and running IPv6 over Ethernet is well understood.",
      "zh-CHS": "当部署需要使用以太网CS时，将使用类似以太网的链路模型，因为这是为以太网CS提出的唯一模型，并且通过以太网运行IPv6是众所周知的。"
    },
    {
      "indent": 3,
      "text": "For IP CS with IPv6 classifiers, a point-to-point link model appears to be the choice because of its simplicity for performing the DAD and because it does not break any existing applications nor requires defining any new protocol. However, the IPv6 shared prefix model would be defined if there is any interest from the service provider community.",
      "zh-CHS": "对于具有IPv6分类器的IP CS，点对点链路模型似乎是一种选择，因为它执行DAD的简单性，并且不破坏任何现有应用程序，也不需要定义任何新协议。但是，如果服务提供商社区感兴趣，将定义IPv6共享前缀模型。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document provides the analysis of various IPv6 link models for IEEE 802.16 based networks, and as such does not introduce any new security threats. No matter what the link model is, the networks employ the same link-layer security mechanisms defined in [5]. However, the chosen link model affects the scope of link local communication, and this may have security implications for protocols that are designed to work within the link scope. This is the concern for a shared link model compared with other models wherein private resources e.g., personal printer, cannot be put onto a public WiMAX network. This may restrict the usage of a shared prefix model to enterprise environments. The Neighbor Discovery related security issues are document in [1] [2] and these are applicable for all the models described in this document. The model specific security considerations are documented in their respective protocol specifications.",
      "zh-CHS": "本文档分析了基于IEEE 802.16的网络的各种IPv6链路模型，因此不会引入任何新的安全威胁。无论链路模型是什么，网络都采用了[5]中定义的相同链路层安全机制。然而，所选择的链路模型会影响链路本地通信的范围，这可能会对设计在链路范围内工作的协议产生安全影响。这是共享链路模型与其他模型相比的问题，在这些模型中，私人资源（如个人打印机）不能放在公共WiMAX网络上。这可能会将共享前缀模型的使用限制在企业环境中。[1][2]中介绍了邻居发现相关的安全问题，这些问题适用于本文档中描述的所有模型。特定于模型的安全注意事项记录在各自的协议规范中。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "zh-CHS": "9. 致谢"
    },
    {
      "indent": 3,
      "text": "This document is a result of discussions in the v6subnet design team for IPv6 Prefix Model Analysis. The members of this design team are (in alphabetical order): Dave Thaler, David Johnston, Junghoon Jee, Max Riegel, Myungki Shin and Syam Madanapalli. The discussion in the DT was benefited from the active participation of James Kempf, Behcet Sarikaya, Basavaraj Patil and JinHyeock Choi in the DT mailing list. The DT thanks the chairs (Gabriel Montenegro and Soohong Daniel Park) and Shepherding AD (Jari Arkko) for their active participation and motivation.",
      "zh-CHS": "本文档是v6subnet设计团队讨论IPv6前缀模型分析的结果。该设计团队的成员（按字母顺序排列）：戴夫·泰勒、大卫·约翰斯顿、郑勋吉、马克斯·里格尔、明基·申和西姆·马达纳帕利。DT中的讨论得益于James Kempf、Behcet Sarikaya、Basavaraj Patil和JinHyeock Choi在DT邮件列表中的积极参与。DT感谢主席（加布里埃尔·黑山和苏洪·丹尼尔·帕克）和牧羊广告（贾里·阿尔科）的积极参与和激励。"
    },
    {
      "indent": 0,
      "text": "10. Contributors",
      "section_title": true,
      "zh-CHS": "10. 贡献者"
    },
    {
      "indent": 3,
      "text": "The members who provided the text based on the DT discussion are:",
      "zh-CHS": "根据DT讨论提供文本的成员包括："
    },
    {
      "indent": 3,
      "text": "Myung-Ki Shin ETRI EMail: myungki.shin@gmail.com",
      "zh-CHS": "明基信电子邮箱：明基。shin@gmail.com"
    },
    {
      "indent": 3,
      "text": "James Kempf DoCoMo Communications Labs USA EMail: kempf@docomolabs-usa.com",
      "zh-CHS": "James Kempf DoCoMo通信实验室美国电子邮件：kempf@docomolabs-美国网"
    },
    {
      "indent": 3,
      "text": "Soohong Daniel Park Samsung Electronics EMail: soohong.park@samsung.com",
      "zh-CHS": "Soohong Daniel Park三星电子电子邮件：Soohong。park@samsung.com"
    },
    {
      "indent": 3,
      "text": "Dave Thaler Microsoft EMail: dthaler@microsoft.com",
      "zh-CHS": "Dave Thaler Microsoft电子邮件：dthaler@microsoft.com"
    },
    {
      "indent": 3,
      "text": "JinHyeock Choi Samsung Advanced Institute of Technology EMail: jinchoe@samsung.com",
      "zh-CHS": "JinHyeock Choi三星高级技术学院电子邮件：jinchoe@samsung.com"
    },
    {
      "indent": 3,
      "text": "Behcet Sarikaya Huawei USA EMail: sarikaya@ieee.org",
      "zh-CHS": "Behcet Sarikaya华为美国电子邮件：sarikaya@ieee.org"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "zh-CHS": "11. 工具书类"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "zh-CHS": "11.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Narten, T., Nordmark, E., and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "zh-CHS": "[1] Narten，T.，Nordmark，E.，和W.Simpson，“IP版本6（IPv6）的邻居发现”，RFC24611998年12月。"
    },
    {
      "indent": 3,
      "text": "[2] Thomson, S. and T. Narten, \"IPv6 Stateless Address Autoconfiguration\", RFC 2462, December 1998.",
      "zh-CHS": "[2] Thomson，S.和T.Narten，“IPv6无状态地址自动配置”，RFC 2462，1998年12月。"
    },
    {
      "indent": 3,
      "text": "[3] Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, July 2003.",
      "zh-CHS": "[3] Droms，R.，Bound，J.，Volz，B.，Lemon，T.，Perkins，C.，和M.Carney，“IPv6的动态主机配置协议（DHCPv6）”，RFC3315，2003年7月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "zh-CHS": "11.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[4] \"IEEE 802.16-2004, IEEE standard for Local and metropolitan area networks, Part 16:Air Interface for fixed broadband wireless access systems\", October 2004.",
      "zh-CHS": "[4] “IEEE 802.16-2004，IEEE局域网和城域网标准，第16部分：固定宽带无线接入系统的空中接口”，2004年10月。"
    },
    {
      "indent": 3,
      "text": "[5] \"IEEE 802.16e, IEEE standard for Local and metropolitan area networks, Part 16:Air Interface for fixed and Mobile broadband wireless access systems\", October 2005.",
      "zh-CHS": "[5] “IEEE 802.16e，IEEE局域网和城域网标准，第16部分：固定和移动宽带无线接入系统的空中接口”，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[6] Jee, J., \"IP over IEEE 802.16 Problem Statement and Goals\", Work in Progress, October 2006.",
      "zh-CHS": "[6] Jee，J.，“IP over IEEE 802.16问题陈述和目标”，进展中的工作，2006年10月。"
    },
    {
      "indent": 3,
      "text": "[7] Christensen, M., Kimball, K., and F. Solensky, \"Considerations for Internet Group Management Protocol (IGMP) and Multicast Listener Discovery (MLD) Snooping Switches\", RFC 4541, May 2006.",
      "zh-CHS": "[7] Christensen，M.，Kimball，K.，和F.Solensky，“互联网组管理协议（IGMP）和多播侦听器发现（MLD）窥探交换机的注意事项”，RFC 4541，2006年5月。"
    },
    {
      "indent": 3,
      "text": "[8] Wasserman, M., \"Recommendations for IPv6 in Third Generation Partnership Project (3GPP) Standards\", RFC 3314, September 2002.",
      "zh-CHS": "[8] Wasserman，M.，“第三代合作伙伴项目（3GPP）标准中IPv6的建议”，RFC 3314，2002年9月。"
    },
    {
      "indent": 3,
      "text": "[9] Mamakos, L., Lidl, K., Evarts, J., Carrel, D., Simone, D., and R. Wheeler, \"A Method for Transmitting PPP Over Ethernet (PPPoE)\", RFC 2516, February 1999.",
      "zh-CHS": "[9] Mamakos，L.，Lidl，K.，Evarts，J.，Carrel，D.，Simone，D.，和R.Wheeler，“通过以太网传输PPP（PPPoE）的方法”，RFC 2516，1999年2月。"
    },
    {
      "indent": 3,
      "text": "[10] Baker, F., Lear, E., and R. Droms, \"Procedures for Renumbering an IPv6 Network without a Flag Day\", RFC 4192, September 2005.",
      "zh-CHS": "[10] Baker，F.，Lear，E.和R.Droms，“在没有国旗日的情况下对IPv6网络重新编号的程序”，RFC 41922005年9月。"
    },
    {
      "indent": 3,
      "text": "[11] \"IEEE, Virtual Bridged Local Area Networks, IEEE 802.1Q\", May 2003.",
      "zh-CHS": "[11] “IEEE，虚拟桥接局域网，IEEE 802.1Q”，2003年5月。"
    },
    {
      "indent": 3,
      "text": "[12] \"IEEE, Port-based Network Access Control, IEEE 802.1X\", December 2004.",
      "zh-CHS": "[12] “IEEE，基于端口的网络访问控制，IEEE 802.1X”，2004年12月。"
    },
    {
      "indent": 3,
      "text": "[13] \"IEEE Std 802.1D-2004, \"IEEE Standard for Local and metropolitan area networks, Media Access Control (MAC) Bridges\"\", June 2004.",
      "zh-CHS": "[13] “IEEE标准802.1D-2004，《局域网和城域网IEEE标准，媒体访问控制（MAC）网桥》，2004年6月。"
    },
    {
      "indent": 3,
      "text": "[14] \"WiMAX End-to-End Network Systems Architecture\", March 2007, <http://www.wimaxforum.org/technology/documents>.",
      "zh-CHS": "[14] “WiMAX端到端网络系统架构”，2007年3月<http://www.wimaxforum.org/technology/documents>."
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Syam Madanapalli (editor) Ordyn Technologies 1st Floor, Creator Building, ITPL Bangalore - 560066 India",
      "zh-CHS": "Syam Madanapalli（编辑）印度ITPL班加罗尔创造者大厦一楼Ordyn Technologies-560066"
    },
    {
      "indent": 3,
      "text": "EMail: smadanapalli@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}