{
  "title": {
    "text": "RFC 4198: A Uniform Resource Name (URN) Namespace for Federated Content",
    "zh-CHS": "RFC 4198"
  },
  "number": 4198,
  "created_at": "2021-11-13 03:50:09.300485+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         D. Tessman\nRequest for Comments: 4198                                      Zelestra\nCategory: Informational                                    November 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "A Uniform Resource Name (URN) Namespace for Federated Content",
      "zh-CHS": "联合内容的统一资源名称（URN）命名空间"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a URN (Uniform Resource Name) namespace for identifying content resources within federated content collections. A federated content collection often does not have a strong centralized authority but relies upon shared naming, metadata, and access conventions to provide interoperability among its members.",
      "zh-CHS": "本文档描述了一个URN（统一资源名称）命名空间，用于标识联合内容集合中的内容资源。联合内容集合通常没有强大的集中式权限，但依赖共享命名、元数据和访问约定来提供其成员之间的互操作性。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Federated content collections are often loose constructs of both small and large content providers, with an active community, but without significant central authority. Members are bound together by shared purpose and interoperate through shared naming, metadata, and access conventions. Federations may also consist of other federations, creating complex associations and dependencies.",
      "zh-CHS": "联合内容集合通常是小型和大型内容提供商的松散结构，具有活跃的社区，但没有重要的中心权限。成员通过共享目的绑定在一起，并通过共享命名、元数据和访问约定进行互操作。联合体也可以由其他联合体组成，创建复杂的关联和依赖关系。"
    },
    {
      "indent": 3,
      "text": "A content provider may join or leave a federation at any time and may be part of more than one federation at the same time. Content providers may also cease as organizations altogether, freeing their domain names for use by others. In addition, content identifiers are spread throughout the members of a federation. These identifiers are stored on various media, sometimes for long durations before being used. Therefore, although they work well in situations without a strong content naming authority, URLs are insufficient as content identifiers within a federation because they cannot be uniquely and permanently tied to a specific content resource.",
      "zh-CHS": "内容提供商可以随时加入或退出联盟，并且可以同时成为多个联盟的一部分。内容提供商也可能完全停止作为组织，释放其域名供他人使用。此外，内容标识符分布在联盟的所有成员中。这些标识符存储在各种介质上，有时在使用前会保存很长时间。因此，尽管URL在没有强大的内容命名权限的情况下工作良好，但URL在联合体中不足以作为内容标识符，因为它们不能唯一且永久地绑定到特定的内容资源。"
    },
    {
      "indent": 3,
      "text": "This URN namespace provides a mechanism whereby a central naming authority is not required. Providers maintain naming authority over their own content within guidelines that guarantee URNs to be unique and permanent.",
      "zh-CHS": "此URN名称空间提供了一种不需要中央命名机构的机制。提供商在保证URN唯一性和永久性的指导原则内维护其自身内容的命名权限。"
    },
    {
      "indent": 3,
      "text": "A simple identifier resolution convention is also recommended to provide a consistent URN resolver interface across all providers.",
      "zh-CHS": "还建议使用简单的标识符解析约定，以便在所有提供程序之间提供一致的URN解析器接口。"
    },
    {
      "indent": 3,
      "text": "This namespace specification is for a formal namespace.",
      "zh-CHS": "此名称空间规范适用于正式名称空间。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in RFC 2119 [1].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[1]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Specification Template",
      "section_title": true,
      "zh-CHS": "3. 规范模板"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 6,
      "text": "\"fdc\"",
      "zh-CHS": "“fdc”"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "Registration Version Number: 1 Registration Date: 2005-04-25",
      "zh-CHS": "注册版本号：1注册日期：2005-04-25"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "Name: Zelestra Address: 2314 Henrietta Avenue La Crescenta, CA 91214-3007 USA",
      "zh-CHS": "姓名：Zelestra地址：美国加利福尼亚州克雷森塔市亨利塔大道2314号，邮编：91214-3007"
    },
    {
      "indent": 6,
      "text": "Contact: Dave Tessman E-mail: dtessman@zelestra.com",
      "zh-CHS": "联系人：Dave Tessman电子邮件：dtessman@zelestra.com"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "zh-CHS": "句法结构声明："
    },
    {
      "indent": 6,
      "text": "The NSS has the following ABNF [2] specification:",
      "zh-CHS": "NSS具有以下ABNF[2]规范："
    },
    {
      "indent": 6,
      "text": "NSS         = ProviderId \":\" DateId \":\" ResourceId\nProviderId  = 1*(label \".\") toplabel\nDateId      = (CCYY [MM [DD]]) / 1*3(DIGIT)\nResourceId  = 1*(alphanum / other / (\"%\" hex hex))\nlabel       = alphanum / alphanum *(alphanum / \"-\") alphanum\ntoplabel    = ALPHA / ALPHA *(alphanum / \"-\") alphanum\nCCYY        = 4(DIGIT)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "MM          = (\"0\" %x31-39) / (\"1\" %x30-32)\nDD          = (\"0\" %x31-39) / (%x31-32 DIGIT) / \"30\" / \"31\"\nalphanum    = ALPHA / DIGIT\nhex         = DIGIT / %x41-46 / %x61-66\nother       = \"(\" / \")\" / \"+\" / \",\" / \"-\" / \".\" / \":\" / \"=\" /\n              \"@\" / \";\" / \"$\" / \"_\" / \"!\" / \"*\" / \"'\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "ProviderId is the content provider's identifier. ProviderId MUST be an Internet domain name and MUST be owned by the organization creating the resource and allocating the URN to the resource.",
      "zh-CHS": "ProviderId是内容提供商的标识符。ProviderId必须是Internet域名，并且必须由创建资源并将URN分配给资源的组织所有。"
    },
    {
      "indent": 6,
      "text": "DateId is a date in ISO 8601 Basic Format (CCYY[MM[DD]]), and MUST correspond to a specific day on which the organization allocating the URN owned the domain name specified in the ProviderId. If not included, the default value for MM and DD is \"01\". DateIds of 1 to 3 digits are reserved.",
      "zh-CHS": "DateId是ISO 8601基本格式（CCYY[MM[DD]]的日期，必须对应于分配URN的组织拥有ProviderId中指定的域名的特定日期。如果未包括在内，MM和DD的默认值为“01”。保留1到3位的日期ID。"
    },
    {
      "indent": 6,
      "text": "ResourceId MUST be unique among all ResourceIds emanating from the same provider and having the same DateId.",
      "zh-CHS": "ResourceId在来自同一提供程序且具有相同DateId的所有ResourceId中必须是唯一的。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "None.",
      "zh-CHS": "没有一个"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "The combination of ProviderId and DateId serves to uniquely identify the organization that is allocating the URN. That organization is responsible for ensuring the uniqueness of the ResourceId.",
      "zh-CHS": "ProviderId和DateId的组合用于唯一标识分配URN的组织。该组织负责确保ResourceId的唯一性。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 6,
      "text": "A URN of this namespace may only be allocated by an organization that owns an Internet domain name. The URN identifies a date on which the organization owned that domain name. The combination of domain name and date will serve to uniquely identify that organization for all time.",
      "zh-CHS": "此命名空间的URN只能由拥有Internet域名的组织分配。URN标识组织拥有该域名的日期。域名和日期的组合将有助于始终唯一标识该组织。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 5,
      "text": "The organization identified by the ProviderId/DateId combination is responsible for allocating a ResourceId that is unique among all those that it allocates with that DateId.",
      "zh-CHS": "由ProviderId/DateId组合标识的组织负责分配一个ResourceId，该ResourceId在其使用该日期ID分配的所有资源中是唯一的。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 5,
      "text": "Content providers are responsible for the provision of a URN resolution service, if any, for URNs they have assigned with a valid ProviderId/DateId combination.",
      "zh-CHS": "内容提供商负责为其分配了有效ProviderId/DateId组合的URN提供URN解析服务（如果有）。"
    },
    {
      "indent": 5,
      "text": "Content providers SHOULD support URN resolution by using the HTTP protocol convention described in RFC 2169 [3]. The ProviderId SHOULD be used as the HTTP server location.",
      "zh-CHS": "内容提供商应使用RFC 2169[3]中描述的HTTP协议约定支持URN解析。ProviderId应用作HTTP服务器位置。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "In addition to the rules defined in RFC 2141 [4], normalize the case of the ProviderId to lower case before comparison.",
      "zh-CHS": "除了RFC 2141[4]中定义的规则外，在比较之前，将ProviderId的大小写规范化为小写。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "There are no additional characters reserved.",
      "zh-CHS": "没有保留其他字符。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "None additional to resolution specified.",
      "zh-CHS": "除指定的分辨率外，没有其他分辨率。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "Global",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "4. Examples",
      "section_title": true,
      "zh-CHS": "4. 例子"
    },
    {
      "indent": 3,
      "text": "The following examples are representative of URNs in this namespace, but may not refer to actual resources.",
      "zh-CHS": "以下示例代表此命名空间中的URN，但可能未引用实际资源。"
    },
    {
      "indent": 3,
      "text": "urn:fdc:example.com:2002:A572007\nurn:fdc:example.net:200406:ivr:51089\nurn:fdc:example.org:20010527:img089322-038",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "除了通常与使用和解决骨灰盒相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 0,
      "text": "6. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "6. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "Distribution of naming authority, identifier flexibility, and a recommended URN resolution mechanism make this namespace a unique and valuable tool to meet the URN requirements of small content providers and federated content collections.",
      "zh-CHS": "命名权限的分布、标识符的灵活性以及推荐的URN解析机制使该名称空间成为满足小型内容提供商和联合内容集合的URN需求的独特而有价值的工具。"
    },
    {
      "indent": 0,
      "text": "7. Community Considerations",
      "section_title": true,
      "zh-CHS": "7. 社区考虑"
    },
    {
      "indent": 3,
      "text": "By establishing a simple, flexible, and efficient means for smaller content providers to uniquely identify and publish their content, this namespace reduces the effort required for these providers to participate in federated collections. A consistent identifier format and resolution mechanism also increases the ability of federations to accept content references from smaller providers and to aggregate themselves into federations of federations. Increased participation and aggregation results in a larger selection of distinctive content that is more accessible to the community.",
      "zh-CHS": "通过为较小的内容提供商建立一种简单、灵活、高效的方法来唯一地标识和发布其内容，此命名空间减少了这些提供商参与联合集合所需的工作量。一致的标识符格式和解析机制还提高了联合体接受来自较小提供者的内容引用并将自身聚合为联合体联合体的能力。更多的参与和聚合导致更多的独特内容选择，社区更容易访问。"
    },
    {
      "indent": 3,
      "text": "To make use of this namespace, a content provider should further decompose the ResourceId portion of the namespace syntactic structure to meet their internal content identification needs and establish an internal governance mechanism to ensure that all identifiers created follow the requirements of this namespace. It is also recommended that the identifier resolution mechanism described in RFC 2169 [3] be provisioned within an HTTP server designated by the ProviderId portion of the namespace syntactic structure.",
      "zh-CHS": "要使用此命名空间，内容提供者应进一步分解命名空间语法结构的ResourceId部分，以满足其内部内容标识需求，并建立内部治理机制，以确保创建的所有标识符都符合此命名空间的要求。还建议在由命名空间语法结构的ProviderId部分指定的HTTP服务器内提供RFC 2169[3]中描述的标识符解析机制。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "zh-CHS": "8. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document includes a URN NID registration that conforms to RFC 3406 [5] and has been entered into the IANA registry of URN NIDs.",
      "zh-CHS": "本文件包括符合RFC 3406[5]的URN NID注册，并已输入URN NID的IANA注册。"
    },
    {
      "indent": 0,
      "text": "Normative References",
      "zh-CHS": "规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 4234, October 2005.",
      "zh-CHS": "[2] Crocker，D.和P.Overell，“语法规范的扩充BNF:ABNF”，RFC 42342005年10月。"
    },
    {
      "indent": 3,
      "text": "[3] Daniel, R., \"A Trivial Convention for using HTTP in URN Resolution\", RFC 2169, June 1997.",
      "zh-CHS": "[3] Daniel，R.，“在URN解析中使用HTTP的简单约定”，RFC 2169，1997年6月。"
    },
    {
      "indent": 3,
      "text": "[4] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[4] 护城河，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 0,
      "text": "Informative References",
      "zh-CHS": "资料性引用"
    },
    {
      "indent": 3,
      "text": "[5] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "zh-CHS": "[5] Daigle，L.，van Gulik，D.，Iannella，R.，和P.Faltstrom，“统一资源名（URN）命名空间定义机制”，BCP 66，RFC 3406，2002年10月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Dave Tessman Zelestra 2314 Henrietta Avenue La Crescenta, California 91214-3007 USA",
      "zh-CHS": "戴夫·泰斯曼·泽莱斯特拉美国加利福尼亚州克雷森塔市亨利埃塔大道2314号，邮编：91214-3007"
    },
    {
      "indent": 3,
      "text": "Phone: +1 818 249 8906\nEMail: dtessman@zelestra.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}