{
  "title": {
    "text": "RFC 4946: Atom License Extension",
    "zh-CHS": "RFC 4946"
  },
  "number": 4946,
  "created_at": "2021-11-15 15:28:23.649141+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           J. Snell\nRequest for Comments: 4946                                     July 2007\nCategory: Experimental",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Atom License Extension",
      "zh-CHS": "Atom许可证扩展"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
      "zh-CHS": "这份备忘录为互联网社区定义了一个实验性协议。它没有规定任何类型的互联网标准。要求进行讨论并提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines an extension to the Atom Syndication Format for describing licenses associated with Atom feeds and entries.",
      "zh-CHS": "此备忘录定义了Atom联合格式的扩展，用于描述与Atom提要和条目关联的许可证。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Notational Conventions .....................................2\n   1.2. Terminology ................................................2\n2. The \"license\" Link Relation .....................................3\n   2.1. Unspecified License Links ..................................3\n   2.2. Comparing License Links ....................................3\n   2.3. Example ....................................................3\n   2.4. Inherited Licenses .........................................4\n   2.5. Relationship with the atom:rights Element ..................4\n3. Security Considerations .........................................5\n4. IANA Considerations .............................................5\n5. Normative References ............................................5\nAppendix A.  Acknowledgements ......................................7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document defines an extension to the Atom Syndication Format that can be used to add links to Atom feed or entry documents referencing resources that describe the explicit rights that have been granted to consumers of those documents.",
      "zh-CHS": "此文档定义了Atom联合格式的扩展，可用于添加指向Atom提要或条目文档的链接，这些文档引用了描述已授予这些文档的使用者的显式权限的资源。"
    },
    {
      "indent": 3,
      "text": "Describing licenses using the mechanisms defined in this specification is currently considered to be largely experimental. While it is a common practice for feed publishers to associate licenses with syndicated content, there are still very few feed consumers that utilize such metadata, and the effectiveness of doing so is still largely unknown. As it is not yet certain how these mechanisms will be used, implementations and feedback are encouraged.",
      "zh-CHS": "使用本规范中定义的机制描述许可证目前被认为在很大程度上是实验性的。虽然feed发布商将许可证与辛迪加内容相关联是一种常见做法，但利用此类元数据的feed消费者仍然很少，这样做的有效性在很大程度上仍然未知。由于尚不确定这些机制将如何使用，因此鼓励实施和反馈。"
    },
    {
      "indent": 0,
      "text": "1.1. Notational Conventions",
      "section_title": true,
      "zh-CHS": "1.1. 符号约定"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照BCP 14、[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "zh-CHS": "1.2. 术语"
    },
    {
      "indent": 3,
      "text": "The term \"link relation\" refers to the value of the Atom link elements rel attribute as defined in Section 4.2.7.2 of [RFC4287].",
      "zh-CHS": "术语“链接关系”是指[RFC4287]第4.2.7.2节中定义的原子链接元素rel属性的值。"
    },
    {
      "indent": 3,
      "text": "The term \"license\" refers to a potentially machine-readable description of explicit rights that have been granted to consumers of an Atom feed or entry. Rights granted by a license may be associated with obligations that must be assumed by those exercising those rights.",
      "zh-CHS": "术语“许可证”是指授予Atom提要或条目的使用者的明确权利的潜在机器可读描述。许可授予的权利可能与行使这些权利的人必须承担的义务有关。"
    },
    {
      "indent": 3,
      "text": "Atom allows the use of Internationalized Resource Identifiers (IRIs) [RFC3987]. Every URI [RFC3986] is also an IRI, so a URI may be used wherever below an IRI is named. When an IRI that is not also a URI is given for dereferencing, it MUST be mapped to a URI using the steps in Section 3.1 of [RFC3987].",
      "zh-CHS": "Atom允许使用国际化资源标识符（IRI）[RFC3987]。每个URI[RFC3986]也是一个IRI，因此可以在IRI下面的任何地方使用URI。当为解引用而给出的IRI不是URI时，必须使用[RFC3987]第3.1节中的步骤将其映射到URI。"
    },
    {
      "indent": 3,
      "text": "Atom allows the use of the xml:base attribute [W3C.REC-xmlbase-20010627] to establish the base URI (or IRI) used to resolve any relative references as described in Section 5.1.1 of [RFC3986].",
      "zh-CHS": "Atom允许使用xml:base属性[W3C.REC-xmlbase-20010627]来建立用于解析任何相关引用的基本URI（或IRI），如[RFC3986]第5.1.1节所述。"
    },
    {
      "indent": 3,
      "text": "Atom allows the use of the xml:lang attribute to indicate the natural language of an element, its attributes, and its descendents. The language context is only significant for elements and attributes declared to be \"Language-Sensitive\" as described in [RFC4287]. The title attribute of the atom:link element is defined as being Language-Sensitive.",
      "zh-CHS": "Atom允许使用xml:lang属性来指示元素的自然语言、属性及其后代。如[RFC4287]所述，语言上下文仅对声明为“语言敏感”的元素和属性有效。atom:link元素的title属性定义为语言敏感。"
    },
    {
      "indent": 0,
      "text": "2. The \"license\" Link Relation",
      "section_title": true,
      "zh-CHS": "2. “许可证”链接关系"
    },
    {
      "indent": 3,
      "text": "The \"license\" link relation can be used to associate licenses with a feed or entry.",
      "zh-CHS": "“许可证”链接关系可用于将许可证与提要或条目关联。"
    },
    {
      "indent": 3,
      "text": "Feed and entry elements MAY contain any number of \"license\" link relations but MUST NOT contain more than one with the same combination of href and type attribute values. The IRI specified by the link's href attribute SHOULD be dereferenceable to return a representation of the license. The license representation MAY be machine readable.",
      "zh-CHS": "提要和条目元素可以包含任意数量的“许可证”链接关系，但不能包含多个具有相同href和type属性值组合的链接关系。链接的href属性指定的IRI应该是可取消引用的，以返回许可证的表示形式。许可证表示可以是机器可读的。"
    },
    {
      "indent": 3,
      "text": "Feeds and entries can be dual-licensed by including multiple \"license\" link relations specifying different href attribute values. If multiple \"license\" link relations are specified, each SHOULD contain a title attribute specifying a human-readable label for the license.",
      "zh-CHS": "提要和条目可以通过包含指定不同href属性值的多个“许可证”链接关系进行双重许可。如果指定了多个“许可证”链接关系，则每个链接关系都应包含一个title属性，用于指定许可证的人类可读标签。"
    },
    {
      "indent": 0,
      "text": "2.1. Unspecified License Links",
      "section_title": true,
      "zh-CHS": "2.1. 未指定的许可证链接"
    },
    {
      "indent": 3,
      "text": "A publisher can use an \"unspecified license link\" (a \"license\" link relation with an href attribute value equal to \"http://purl.org/atompub/license#unspecified\") to indicate that a feed or license has not been explicitly linked to a license description.",
      "zh-CHS": "发布者可以使用“未指定的许可证链接”（href属性值等于的“许可证”链接关系）http://purl.org/atompub/license#unspecified）以指示源或许可证未显式链接到许可证说明。"
    },
    {
      "indent": 3,
      "text": "A feed or entry containing an unspecified license link MUST NOT contain any other \"license\" link relations.",
      "zh-CHS": "包含未指定许可证链接的提要或条目不得包含任何其他“许可证”链接关系。"
    },
    {
      "indent": 0,
      "text": "2.2. Comparing License Links",
      "section_title": true,
      "zh-CHS": "2.2. 比较许可证链接"
    },
    {
      "indent": 3,
      "text": "Atom implementations that are capable of supporting \"license\" links SHOULD use the simple string-comparison method described in [RFC3987], Section 5.3.1, to determine whether multiple \"license\" links are equivalent. The other comparison methods discussed in Section 5.1 of the IRI specification MAY be used. If the \"license\" link is specified using a relative reference, it MUST be converted to its fully qualified form before comparison.",
      "zh-CHS": "能够支持“许可证”链接的Atom实现应使用[RFC3987]第5.3.1节中描述的简单字符串比较方法来确定多个“许可证”链接是否等效。可以使用IRI规范第5.1节中讨论的其他比较方法。如果使用相对引用指定“许可证”链接，则必须在比较之前将其转换为完全限定形式。"
    },
    {
      "indent": 0,
      "text": "2.3. Example",
      "section_title": true,
      "zh-CHS": "2.3. 实例"
    },
    {
      "indent": 5,
      "text": "<feed xmlns=\"http://www.w3.org/2005/Atom\">\n  <id>http://www.example.com/myfeed</id>\n  <title>My Example Feed</title>\n  <updated>2005-07-28T12:00:00Z</updated>\n  <link href=\"http://www.example.com/myfeed\" />\n  <link rel=\"license\" type=\"application/rdf+xml\"\n    href=\"http://creativecommons.org/licenses/by-nc/2.5/rdf\" />",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "  <rights>\n    Copyright (c) 2005.  Some rights reserved.  This feed\n    is licensed under a Creative Commons Attribute-NonCommercial\n    Use License.  It contains material originally published by\n    Jane Smith at http://www.example.com/entries/1 under the\n    Creative Commons Attribute License.\n  </rights>\n  <author><name>James</name></author>\n  <entry>\n    <id>tag:entries.org,2005:1</id>\n    <title>Atom Powered Robots Run Amok</title>\n    <updated>2005-06-28T12:00:00Z</updated>\n    <link href=\"http://www.example.org/entries/1\" />\n    <summary>Atom Powered Robots Run Amok</summary>\n    <author><name>Jane Smith</name></author>\n    <link rel=\"license\" type=\"text/html\"\n      href=\"http://creativecommons.org/licenses/by/2.5/\" />\n  </entry>\n</feed>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.4. Inherited Licenses",
      "section_title": true,
      "zh-CHS": "2.4. 继承的许可证"
    },
    {
      "indent": 3,
      "text": "\"License\" links specified within atom:feed or atom:source elements are inherited by entries. Generally, a more specific license overrides a less specific license. More specifically, if an atom:entry has any \"license\" link relations, including the \"undefined\" license, it does not inherit any license from a containing atom:feed element or contained atom:source element. If an entry has no \"license\" link relations, and contains an atom:source element, it inherits licenses from the atom:source. If the atom:source element contains no \"license\" links, or if the entry does not have an atom:source element, the entry inherits licenses from the containing atom:feed.",
      "zh-CHS": "atom:feed或atom:source元素中指定的“许可证”链接由条目继承。通常，更具体的许可会覆盖不太具体的许可。更具体地说，如果atom:entry具有任何“许可证”链接关系，包括“未定义”许可证，则它不会从包含atom:feed元素或包含atom:source元素继承任何许可证。如果条目没有“许可证”链接关系，并且包含atom:source元素，则它将从atom:source继承许可证。如果atom:source元素不包含“license”链接，或者如果条目没有atom:source元素，则该条目将从包含atom:feed的条目继承许可证。"
    },
    {
      "indent": 3,
      "text": "An entry's license MAY be inherited by media resources associated with the entry. Some media types have ways of including license information, which always overrides the entry's licensing.",
      "zh-CHS": "条目的许可证可以由与该条目关联的媒体资源继承。某些媒体类型有包含许可证信息的方法，这些信息总是覆盖条目的许可。"
    },
    {
      "indent": 3,
      "text": "An agent searching to find entries that fall under a specific license (e.g. a search for entries containing pictures and the word \"knitting\" where the entry is under any Creative Commons license) MUST check the most granular license definition available, rather than assume license inheritance without checking.",
      "zh-CHS": "代理搜索特定许可证下的条目（例如，搜索包含图片和单词“kniting”的条目，其中条目属于任何Creative Commons许可证）必须检查可用的最精细的许可证定义，而不是在不检查的情况下假设许可证继承。"
    },
    {
      "indent": 0,
      "text": "2.5. Relationship with the atom:rights Element",
      "section_title": true,
      "zh-CHS": "2.5. 与atom的关系：rights元素"
    },
    {
      "indent": 3,
      "text": "\"License\" link relations are related to the atom:rights element in that both are intended to communicate information about the rights",
      "zh-CHS": "“许可证”链接关系与atom:rights元素相关，因为两者都旨在传递有关权限的信息"
    },
    {
      "indent": 3,
      "text": "associated with an Atom document. Where the two differ, however, is in the fact that atom:rights is intended strictly as a human-readable assertion of rights held over a work while the \"license\" link relation is intended to provide a potentially machine-readable description of what rights have been granted to others. The two constructs may overlap one another and conflicts could arise if they are contradictory. It is important that publishers of Atom documents ensure that the atom:rights and \"license\" link relations are consistent with one another.",
      "zh-CHS": "与Atom文档关联。然而，两者的不同之处在于，atom:rights的目的是严格地作为一种人类可读的作品权利主张，而“许可”链接关系的目的是提供一种潜在的机器可读描述，说明授予他人的权利。这两种结构可能相互重叠，如果它们相互矛盾，则可能发生冲突。Atom文档的发布者必须确保Atom:rights和“license”链接关系彼此一致。"
    },
    {
      "indent": 3,
      "text": "If an atom:entry that does not contain an atom:source is copied from one feed into another feed, then if the feed into which it is copied contains a license, an atom:source element SHOULD be added to the copied entry. If a source feed contains a license, that license SHOULD be preserved in an atom:source element added to any entries copied from the source feed that do not already contain atom:source elements.",
      "zh-CHS": "如果将不包含atom:source的atom:entry从一个提要复制到另一个提要，则如果复制到的提要包含许可证，则应将atom:source元素添加到复制的条目中。如果源提要包含许可证，则应将该许可证保留在atom:source元素中，该元素添加到从源提要复制的、尚未包含atom:source元素的任何条目中。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "When \"license\" link relations are used in Atom documents, the security considerations specified in [RFC4287] Section 8 apply.",
      "zh-CHS": "当在Atom文档中使用“许可”链接关系时，[RFC4287]第8节中规定的安全注意事项适用。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This specification defines one new Atom link relation type to be registered in the IANA Registry of Link Relations as defined by [RFC4287].",
      "zh-CHS": "本规范定义了一种新的Atom链接关系类型，该类型将在[RFC4287]定义的链接关系IANA注册表中注册。"
    },
    {
      "indent": 7,
      "text": "Attribute Value: license Description: Specifies the IRI of a license associated with the containing feed, entry, or source element. Expected display characteristics: None Security considerations: When \"license\" link relations are used in Atom documents, the security considerations for handling links in Atom documents apply.",
      "zh-CHS": "属性值：许可证描述：指定与包含提要、条目或源元素关联的许可证的IRI。预期显示特征：无安全注意事项：当在Atom文档中使用“许可证”链接关系时，处理Atom文档中链接的安全注意事项适用。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "zh-CHS": "5. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "zh-CHS": "[RFC3986]Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3987] Duerst, M. and M. Suignard, \"Internationalized Resource Identifiers (IRIs)\", RFC 3987, January 2005.",
      "zh-CHS": "[RFC3987]Duerst，M.和M.Suignard，“国际化资源标识符（IRIs）”，RFC 3987，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4287] Nottingham, M., Ed., and R. Sayre, Ed., \"The Atom Syndication Format\", RFC 4287, December 2005.",
      "zh-CHS": "[RFC4287]诺丁汉，M.，Ed.，和R.Sayre，Ed.，“原子联合格式”，RFC 4287，2005年12月。"
    },
    {
      "indent": 3,
      "text": "[W3C.REC-xmlbase-20010627] Marsh, J., \"XML Base\", World Wide Web Consortium Recommendation REC-xmlbase-20010627, June 2001, <http://www.w3.org/TR/2001/REC-xmlbase-20010627>.",
      "zh-CHS": "[W3C.REC-xmlbase-20010627]Marsh，J.，“XML库”，万维网联盟建议REC-xmlbase-20010627，2001年6月<http://www.w3.org/TR/2001/REC-xmlbase-20010627>."
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "section_title": true,
      "zh-CHS": "附录A.确认书"
    },
    {
      "indent": 3,
      "text": "The author gratefully acknowledges the feedback from Mike Linksvayer, Robin Cover, Lisa Dusseault, Bjorn Hohrmann, Frank Ellermann, and the members of Atom Publishing Format and Protocol working group during the development of this specification.",
      "zh-CHS": "作者非常感谢Mike Linksvayer、Robin Cover、Lisa Dusseault、Bjorn Hohrmann、Frank Ellermann以及Atom出版格式和协议工作组成员在本规范制定过程中提供的反馈。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "James M Snell",
      "zh-CHS": "詹姆斯·姆斯内尔"
    },
    {
      "indent": 3,
      "text": "EMail: jasnell@gmail.com\nURI:   http://www.snellspace.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}