{
  "title": {
    "text": "RFC 4195: A Uniform Resource Name (URN) Namespace for the TV-Anytime Forum",
    "zh-CHS": "RFC 4195"
  },
  "number": 4195,
  "created_at": "2021-11-13 03:40:04.981206+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        W. Kameyama\nRequest for Comments: 4195                       GITS, Waseda University\nCategory: Informational                                     October 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "A Uniform Resource Name (URN) Namespace for the TV-Anytime Forum",
      "zh-CHS": "TV Anytime论坛的统一资源名称（URN）命名空间"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace that is engineered by the TV-Anytime Forum for naming persistent resources published by the TV-Anytime Forum including the TV-Anytime Forum Standards, XML (Extensible Markup Language) Document Type Definitions, XML Schemas, Namespaces, and other documents.",
      "zh-CHS": "本文档描述了由TV Anytime论坛设计的统一资源名称（URN）命名空间，用于命名TV Anytime论坛发布的持久资源，包括TV Anytime论坛标准、XML（可扩展标记语言）文档类型定义、XML架构、命名空间和其他文档。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The TV-Anytime Forum produces many kinds of documents (i.e., specifications, working documents, and schemas) that are currently being considered for adoption by many standardization bodies such as ETSI (European Telecommunication Standardization Institute), DVB (Digital Video Broadcasting), ARIB (Association of Radio Industries and Businesses), and ATSC (Advance Television Systems Committee).",
      "zh-CHS": "TV Anytime论坛产生了多种文件（即规范、工作文件和模式），目前许多标准化机构正在考虑采用这些文件，如ETSI（欧洲电信标准化协会）、DVB（数字视频广播）、ARIB（无线电工业和商业协会），和ATSC（高级电视系统委员会）。"
    },
    {
      "indent": 3,
      "text": "The TV-Anytime Forum wishes to provide global, distributed, persistent, location-independent names for these resources.",
      "zh-CHS": "TV Anytime论坛希望为这些资源提供全局、分布式、持久、位置独立的名称。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "zh-CHS": "2. 规范模板"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 6,
      "text": "\"tva\"",
      "zh-CHS": "“tva”"
    },
    {
      "indent": 3,
      "text": "Registration information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "Registration Version Number: 1 Registration Date: 2005-1-6",
      "zh-CHS": "注册版本号：1注册日期：2005-1-6"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "Name: Wataru KAMEYAMA Title: Vice Chairman and Secretary, The TV-Anytime Forum Affiliation: Graduate School of Global Information and Telecommunication Studies, Waseda University Address: 1011 Okuboyama, Nishi-tomida, Honjo-shi, Saitama 367-0035, JAPAN Phone: +81 495 24 6052 Email: wataru@waseda.jp",
      "zh-CHS": "姓名：Wataru KAMEYAMA职务：电视论坛副主席兼秘书附属机构：早稻田大学全球信息和电信研究生院地址：1011 Okuboyama，Nishi tomida，Honjo shi，Saitama 367-0035，日本电话：+81 495 24 6052电子邮件：wataru@waseda.jp"
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "zh-CHS": "结构声明："
    },
    {
      "indent": 6,
      "text": "The Namespace Specific String (NSS) of all URNs assigned by the TV-Anytime Forum will have the following hierarchical structure:",
      "zh-CHS": "TV Anytime论坛分配的所有URN的命名空间特定字符串（NSS）将具有以下层次结构："
    },
    {
      "indent": 18,
      "text": "urn:tva:{category}:{string}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "where the \"category\" is a US-ASCII string that conforms to URN syntax requirements ([RFC2141]), and \"{string}\" is a string that confirms to URN syntax requirements ([RFC2141]).",
      "zh-CHS": "其中，“类别”是符合URN语法要求的US-ASCII字符串（[RFC2141]），而“{string}”是符合URN语法要求的字符串（[RFC2141]）。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "The TV-Anytime Forum specifications have been publicly available at all stages during their development from \"ftp://tva:tva@ftp.bbc.co.uk/Specifications/\". The final specifications are also available as formal ETSI (European Telecommunication Standardization Institute) technical specification documents, ETSI TS 102 822 series.",
      "zh-CHS": "TV Anytime论坛规范在其开发过程中的各个阶段都已公开，从“ftp://tva:tva@ftp.bbc.co.uk/Specifications/”。最终规范也可作为正式的ETSI（欧洲电信标准化协会）技术规范文件ETSI TS 102 822系列提供。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "The TV-Anytime Forum shall establish unique identifiers as appropriate.",
      "zh-CHS": "TV Anytime论坛应酌情建立唯一标识符。"
    },
    {
      "indent": 6,
      "text": "Uniqueness is guaranteed as long as the assigned \"{category}\" is never reassigned for other categories. The TV-Anytime Forum is responsible for this.",
      "zh-CHS": "只要分配的“{category}”从未重新分配给其他类别，就可以保证唯一性。电视论坛对此负责。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 6,
      "text": "The TV-Anytime Forum is committed to maintaining the accessibility and persistence of all resources that are officially assigned URNs by the organization. Persistence of identifiers is dependent upon suitable delegation at the level of \"category\"s, and persistence of category assignment.",
      "zh-CHS": "TV Anytime论坛致力于维护组织正式分配给URN的所有资源的可访问性和持久性。标识符的持久性取决于“类别”级别的适当授权以及类别分配的持久性。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 6,
      "text": "All the assignments of identifiers are fully controlled and managed by the TV-Anytime Forum.",
      "zh-CHS": "所有标识符的分配都完全由TV Anytime论坛控制和管理。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 6,
      "text": "The namespace is not listed with an RDS; this is not relevant.",
      "zh-CHS": "名称空间未与RDS一起列出；这是不相关的。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "The \"{category}\" is case-insensitive. Thus, the portion of the URN:",
      "zh-CHS": "“{category}”不区分大小写。因此，URN的部分："
    },
    {
      "indent": 18,
      "text": "urn:tva:{category}:",
      "zh-CHS": "urn:tva:{category}:"
    },
    {
      "indent": 6,
      "text": "is case-insensitive for matches. The remainder of the identifier shall be considered case-sensitive; hence, URNs are only lexically equivalent if they are also lexically identical in the remaining {string} field.",
      "zh-CHS": "匹配项不区分大小写。标识符的其余部分应视为区分大小写；因此，只有在剩余的{string}字段中，URN在词汇上相同时，URN才在词汇上等效。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "zh-CHS": "没有特别考虑。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "Validation shall be done by a syntax grammar corresponding to each \"{category}\".",
      "zh-CHS": "应通过对应于每个“{category}”的语法进行验证。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "Global.",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are provided for pedagogical reasons only.",
      "zh-CHS": "以下示例不能保证是真实的。它们仅用于教学目的。"
    },
    {
      "indent": 9,
      "text": "urn:tva:metadata:2002\nurn:tva:metadata:cs:IntentionCS:2002\nurn:tva:metadata:cs:ActionTypeCS:2002\nurn:tva:rmp:tvax",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Community Considerations",
      "section_title": true,
      "zh-CHS": "4. 社区考虑"
    },
    {
      "indent": 3,
      "text": "The names in this namespace are to be used in any public implementations of the TV-Anytime Forum specifications so that anybody can benefit from the officially assigned namespace.",
      "zh-CHS": "此名称空间中的名称将用于TV Anytime论坛规范的任何公共实现中，以便任何人都可以从官方指定的名称空间中受益。"
    },
    {
      "indent": 3,
      "text": "Potential beneficiary communities include:",
      "zh-CHS": "潜在受益社区包括："
    },
    {
      "indent": 3,
      "text": "a) Implementers of the TV-Anytime specifications.",
      "zh-CHS": "a) TV Anytime规范的实施者。"
    },
    {
      "indent": 6,
      "text": "Resources that comply with the TV-Anytime Forum specifications (including TV-Anytime schemas, instance documents that comply with TV-Anytime schemas, and TV-Anytime default Classification Schemes) may, by means of the registered namespace, become exposed to the general Internet and gain from the interoperability benefits of the Internet at large.",
      "zh-CHS": "符合TV Anytime论坛规范的资源（包括TV Anytime架构、符合TV Anytime架构的实例文档和TV Anytime默认分类方案）可以通过注册的名称空间暴露于通用Internet，并从Internet的互操作性好处中获益。"
    },
    {
      "indent": 3,
      "text": "b) Implementers of other specifications that incorporate components of the TV-Anytime specifications.",
      "zh-CHS": "b) 包含TV Anytime规范组件的其他规范的实现者。"
    },
    {
      "indent": 6,
      "text": "URNs used to identify TV-Anytime components may be used to enable their inclusion in, and enhancement of, other specifications while maintaining, to a certain degree, interoperability with the TV-Anytime community (see a) above).",
      "zh-CHS": "用于识别TV Anytime组件的URN可用于在一定程度上保持与TV Anytime社区的互操作性的同时，使其包含在其他规范中并增强其他规范（见上文a）。"
    },
    {
      "indent": 3,
      "text": "c) Implementers of other semantically related specifications that do not directly incorporate components of the TV-Anytime specifications.",
      "zh-CHS": "c) 其他语义相关规范的实现者，这些规范不直接包含TV Anytime规范的组件。"
    },
    {
      "indent": 6,
      "text": "URNs used to identify components of the TV-Anytime specifications, such as identifiers of terms within default Classification Schemes, may enable interoperation with other semantically determined specifications (including present and future metadata/resource description and ontology specifications) of relevance to TV-Anytime implementation communities (see a) and b) above).",
      "zh-CHS": "用于标识TV-Anytime规范的组件（例如默认分类方案中的术语标识符）的urn可实现与其他语义确定规范（包括当前和未来的元数据/资源描述和本体规范）的互操作与TV Anytime实施社区相关（见上文a）和b）。"
    },
    {
      "indent": 0,
      "text": "5. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "5. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "This application requires a unique namespace because the assignment mechanism requires delegation to the TV-Anytime Forum. As a namespace used to identify components of the TV-Anytime specifications, the TV-Anytime Forum will manage the inter-relationship of the components and the uniqueness of the identifiers.",
      "zh-CHS": "此应用程序需要唯一的命名空间，因为分配机制需要委派到TV Anytime论坛。作为用于标识TV Anytime规范组件的名称空间，TV Anytime论坛将管理组件的相互关系和标识符的唯一性。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "除了通常与使用和解决骨灰盒相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 0,
      "text": "Informative References",
      "zh-CHS": "资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[RFC2141]Moats，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Wataru KAMEYAMA GITS, Waseda University 1011 Okuboyama, Nishi-tomida Honjo-shi, Saitama, 367-0035 JAPAN",
      "zh-CHS": "Wataru KAMEYAMA GITS，早稻田大学1011 Okuboyama，西富田本州市，Saitama，367-0035"
    },
    {
      "indent": 3,
      "text": "Phone: +81 495 24 6052\nEMail: wataru@waseda.jp",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}