{
  "title": {
    "text": "RFC 4583: Session Description Protocol (SDP) Format for Binary Floor Control Protocol (BFCP) Streams",
    "zh-CHS": "RFC 4583"
  },
  "number": 4583,
  "created_at": "2021-11-14 08:48:24.745893+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       G. Camarillo\nRequest for Comments: 4583                                      Ericsson\nCategory: Standards Track                                  November 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Session Description Protocol (SDP) Format for Binary Floor Control Protocol (BFCP) Streams",
      "zh-CHS": "二进制地板控制协议（BFCP）流的会话描述协议（SDP）格式"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2006).",
      "zh-CHS": "版权所有（C）IETF信托基金（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document specifies how to describe Binary Floor Control Protocol (BFCP) streams in Session Description Protocol (SDP) descriptions. User agents using the offer/answer model to establish BFCP streams use this format in their offers and answers.",
      "zh-CHS": "本文档指定如何在会话描述协议（SDP）描述中描述二进制地板控制协议（BFCP）流。使用报价/应答模型建立BFCP流的用户代理在其报价和应答中使用此格式。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................2\n3. Fields in the 'm' Line ..........................................2\n4. Floor Control Server Determination ..............................3\n5. The 'confid' and 'userid' SDP Attributes ........................5\n6. Association between Streams and Floors ..........................5\n7. TCP Connection Management .......................................5\n8. Authentication ..................................................6\n9. Examples ........................................................7\n10. Security Considerations ........................................8\n11. IANA Considerations ............................................8\n   11.1. Registration of the 'TCP/BFCP' and 'TCP/TLS/BFCP'\n         SDP 'proto' Values ........................................8\n   11.2. Registration of the SDP 'floorctrl' Attribute .............8\n   11.3. Registration of the SDP 'confid' Attribute ................9\n   11.4. Registration of the SDP 'userid' Attribute ................9\n   11.5. Registration of the SDP 'floorid' Attribute ..............10\n12. Acknowledgements ..............................................10\n13. Normative References ..........................................10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As discussed in the BFCP (Binary Floor Control Protocol) specification [8], a given BFCP client needs a set of data in order to establish a BFCP connection to a floor control server. These data include the transport address of the server, the conference identifier, and the user identifier.",
      "zh-CHS": "如BFCP（二进制地板控制协议）规范[8]所述，给定的BFCP客户端需要一组数据，以便建立到地板控制服务器的BFCP连接。这些数据包括服务器的传输地址、会议标识符和用户标识符。"
    },
    {
      "indent": 3,
      "text": "One way for clients to obtain this information is to use an offer/answer [4] exchange. This document specifies how to encode this information in the SDP session descriptions that are part of such an offer/answer exchange.",
      "zh-CHS": "客户获取此信息的一种方法是使用报价/应答[4]交换。本文档指定如何在SDP会话描述中对该信息进行编码，SDP会话描述是此类提供/应答交换的一部分。"
    },
    {
      "indent": 3,
      "text": "User agents typically use the offer/answer model to establish a number of media streams of different types. Following this model, a BFCP connection is described as any other media stream by using an SDP 'm' line, possibly followed by a number of attributes encoded in 'a' lines.",
      "zh-CHS": "用户代理通常使用提供/应答模型来建立许多不同类型的媒体流。按照此模型，BFCP连接通过使用SDP“m”行（可能后跟在“a”行中编码的许多属性）被描述为任何其他媒体流。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in BCP 14, RFC 2119 [1] and indicate requirement levels for compliant implementations.",
      "zh-CHS": "在本文件中，关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”应按照BCP 14、RFC 2119[1]中的描述进行解释，并指出合规实施的要求级别。"
    },
    {
      "indent": 0,
      "text": "3. Fields in the 'm' Line",
      "section_title": true,
      "zh-CHS": "3. “m”行中的字段"
    },
    {
      "indent": 3,
      "text": "This section describes how to generate an 'm' line for a BFCP stream.",
      "zh-CHS": "本节介绍如何为BFCP流生成“m”行。"
    },
    {
      "indent": 3,
      "text": "According to the SDP specification [11], the 'm' line format is the following:",
      "zh-CHS": "根据SDP规范[11]，m行格式如下："
    },
    {
      "indent": 6,
      "text": "m=<media> <port> <transport> <fmt> ...",
      "zh-CHS": "m=<media><port><transport><fmt>。。。"
    },
    {
      "indent": 3,
      "text": "The media field MUST have a value of \"application\".",
      "zh-CHS": "“媒体”字段的值必须为“应用程序”。"
    },
    {
      "indent": 3,
      "text": "The port field is set following the rules in [7]. Depending on the value of the 'setup' attribute (discussed in Section 7), the port field contains the port to which the remote endpoint will initiate its TCP connection or is irrelevant (i.e., the endpoint will initiate the connection towards the remote endpoint) and should be set to a value of 9, which is the discard port. Since BFCP only runs on top of TCP, the port is always a TCP port. A port field value of zero has the standard SDP meaning (i.e., rejection of the media stream).",
      "zh-CHS": "端口字段按照[7]中的规则设置。根据“设置”属性的值（在第7节中讨论），端口字段包含远程端点将向其启动TCP连接或与之无关的端口（即，端点将向远程端点启动连接），并且应设置为值9，即丢弃端口。由于BFCP仅在TCP之上运行，因此该端口始终是TCP端口。端口字段值为零具有标准SDP含义（即拒绝媒体流）。"
    },
    {
      "indent": 3,
      "text": "We define two new values for the transport field: TCP/BFCP and TCP/TLS/BFCP. The former is used when BFCP runs directly on top of TCP, and the latter is used when BFCP runs on top of TLS, which in turn runs on top of TCP.",
      "zh-CHS": "我们为传输字段定义了两个新值：TCP/BFCP和TCP/TLS/BFCP。前者用于BFCP直接在TCP上运行时，后者用于BFCP在TLS上运行时，而后者又在TCP上运行。"
    },
    {
      "indent": 3,
      "text": "The fmt (format) list is ignored for BFCP. The fmt list of BFCP 'm' lines SHOULD contain a single \"*\" character.",
      "zh-CHS": "BFCP忽略fmt（格式）列表。BFCP“m”行的fmt列表应包含单个“*”字符。"
    },
    {
      "indent": 3,
      "text": "The following is an example of an 'm' line for a BFCP connection:",
      "zh-CHS": "以下是BFCP连接的“m”线示例："
    },
    {
      "indent": 6,
      "text": "m=application 50000 TCP/TLS/BFCP *",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Floor Control Server Determination",
      "section_title": true,
      "zh-CHS": "4. 楼层控制服务器确定"
    },
    {
      "indent": 3,
      "text": "When two endpoints establish a BFCP stream, they need to determine which of them acts as a floor control server. In the most common scenario, a client establishes a BFCP stream with a conference server that acts as the floor control server. Floor control server determination is straight forward because one endpoint can only act as a client and the other can only act as a floor control server.",
      "zh-CHS": "当两个端点建立BFCP流时，它们需要确定其中哪一个充当楼层控制服务器。在最常见的场景中，客户端与充当楼层控制服务器的会议服务器建立BFCP流。楼层控制服务器的确定是直接的，因为一个端点只能充当客户端，而另一个端点只能充当楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "However, there are scenarios where both endpoints could act as a floor control server. For example, in a two-party session that involves an audio stream and a shared whiteboard, the endpoints need to decide which party will be acting as the floor control server.",
      "zh-CHS": "但是，在某些情况下，两个端点都可以充当楼层控制服务器。例如，在涉及音频流和共享白板的两方会话中，端点需要决定哪一方将充当楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "Furthermore, there are situations where both the offerer and the answerer act as both clients and floor control servers in the same session. For example, in a two-party session that involves an audio stream and a shared whiteboard, one party acts as the floor control server for the audio stream and the other acts as the floor control server for the shared whiteboard.",
      "zh-CHS": "此外，在某些情况下，报价人和应答人在同一会话中同时充当客户端和楼层控制服务器。例如，在涉及音频流和共享白板的两方会话中，一方充当音频流的楼层控制服务器，另一方充当共享白板的楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "We define the 'floorctrl' SDP media-level attribute to perform floor control determination. Its Augmented BNF syntax [2] is:",
      "zh-CHS": "我们定义“floorctrl”SDP媒体级别属性以执行楼层控制确定。其扩充的BNF语法[2]为："
    },
    {
      "indent": 3,
      "text": "floor-control-attribute  = \"a=floorctrl:\" role *(SP role)\nrole                     = \"c-only\" / \"s-only\" / \"c-s\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The offerer includes this attribute to state all the roles it would be willing to perform:",
      "zh-CHS": "报价人包含此属性，以说明其愿意履行的所有角色："
    },
    {
      "indent": 3,
      "text": "c-only: The offerer would be willing to act as a floor control client only.",
      "zh-CHS": "c-only：报价人只愿意充当楼层控制客户。"
    },
    {
      "indent": 3,
      "text": "s-only: The offerer would be willing to act as a floor control server only.",
      "zh-CHS": "s-only：报价人只愿意充当楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "c-s: The offerer would be willing to act both as a floor control client and as a floor control server.",
      "zh-CHS": "c-s：报价人愿意同时充当楼层控制客户端和楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "If an 'm' line in an offer contains a 'floorctrl' attribute, the answerer MUST include one in the corresponding 'm' line in the answer. The answerer includes this attribute to state which role the answerer will perform. That is, the answerer chooses one of the roles the offerer is willing to perform and generates an answer with the corresponding role for the answerer. Table 1 shows the corresponding roles for an answerer, depending on the offerer's role.",
      "zh-CHS": "如果报价中的“m”行包含“floorctrl”属性，则应答者必须在回答中相应的“m”行中包含一个属性。应答者包含此属性以说明应答者将执行的角色。也就是说，回答者选择报价者愿意扮演的角色之一，并为回答者生成具有相应角色的答案。表1显示了应答者的相应角色，具体取决于报价人的角色。"
    },
    {
      "indent": 26,
      "text": "+---------+----------+\n| Offerer | Answerer |\n+---------+----------+\n|  c-only |  s-only  |\n|  s-only |  c-only  |\n|   c-s   |    c-s   |\n+---------+----------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 30,
      "text": "Table 1: Roles",
      "zh-CHS": "表1：角色"
    },
    {
      "indent": 3,
      "text": "The following are the descriptions of the roles when they are chosen by an answerer:",
      "zh-CHS": "以下是回答者选择角色时的描述："
    },
    {
      "indent": 3,
      "text": "c-only: The answerer will act as a floor control client. Consequently, the offerer will act as a floor control server.",
      "zh-CHS": "c-仅限：回答者将充当楼层控制客户。因此，报价人将充当楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "s-only: The answerer will act as a floor control server. Consequently, the offerer will act as a floor control client.",
      "zh-CHS": "仅限s：应答者将充当楼层控制服务器。因此，报价人将作为楼层控制客户。"
    },
    {
      "indent": 3,
      "text": "c-s: The answerer will act both as a floor control client and as a floor control server. Consequently, the offerer will also act both as a floor control client and as a floor control server.",
      "zh-CHS": "c-s：应答者将同时充当楼层控制客户端和楼层控制服务器。因此，报价人还将充当楼层控制客户端和楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "Endpoints that use the offer/answer model to establish BFCP connections MUST support the 'floorctrl' attribute. A floor control server acting as an offerer or as an answerer SHOULD include this attribute in its session descriptions.",
      "zh-CHS": "使用提供/应答模型建立BFCP连接的端点必须支持“floorctrl”属性。作为报价人或应答人的楼层控制服务器应在其会话描述中包含此属性。"
    },
    {
      "indent": 3,
      "text": "If the 'floorctrl' attribute is not used in an offer/answer exchange, by default the offerer and the answerer will act as a floor control client and as a floor control server, respectively.",
      "zh-CHS": "如果“floorctrl”属性未在报价/应答交换中使用，默认情况下，报价人和应答人将分别充当楼层控制客户端和楼层控制服务器。"
    },
    {
      "indent": 3,
      "text": "The following is an example of a 'floorctrl' attribute in an offer. When this attribute appears in an answer, it only carries one role:",
      "zh-CHS": "以下是报价中“floorctrl”属性的示例。当此属性出现在答案中时，它只包含一个角色："
    },
    {
      "indent": 6,
      "text": "a=floorctrl:c-only s-only c-s",
      "zh-CHS": "a=地板TRL:c-仅限s-仅限c-s"
    },
    {
      "indent": 0,
      "text": "5. The 'confid' and 'userid' SDP Attributes",
      "section_title": true,
      "zh-CHS": "5. “confid”和“userid”SDP属性"
    },
    {
      "indent": 3,
      "text": "We define the 'confid' and the 'userid' SDP media-level attributes. These attributes are used by a floor control server to provide a client with a conference ID and a user ID, respectively. Their Augmented BNF syntax [2] is:",
      "zh-CHS": "我们定义了“confid”和“userid”SDP媒体级属性。楼层控制服务器使用这些属性分别向客户端提供会议ID和用户ID。它们的扩充BNF语法[2]是："
    },
    {
      "indent": 3,
      "text": "confid-attribute      = \"a=confid:\" conference-id\nconference-id         = token\nuserid-attribute      = \"a=userid:\" user-id\nuser-id               = token",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The 'confid' and the 'userid' attributes carry the integer representation of a conference ID and a user ID, respectively.",
      "zh-CHS": "“confid”和“userid”属性分别携带会议ID和用户ID的整数表示。"
    },
    {
      "indent": 3,
      "text": "Endpoints that use the offer/answer model to establish BFCP connections MUST support the 'confid' and the 'userid' attributes. A floor control server acting as an offerer or as an answerer SHOULD include these attributes in its session descriptions.",
      "zh-CHS": "使用提供/应答模型建立BFCP连接的端点必须支持“confid”和“userid”属性。作为报价人或应答人的楼层控制服务器应在其会话描述中包含这些属性。"
    },
    {
      "indent": 0,
      "text": "6. Association between Streams and Floors",
      "section_title": true,
      "zh-CHS": "6. 流与层之间的关联"
    },
    {
      "indent": 3,
      "text": "We define the 'floorid' SDP media-level attribute. Its Augmented BNF syntax [2] is:",
      "zh-CHS": "我们定义了“Floorrid”SDP媒体级别属性。其扩充的BNF语法[2]为："
    },
    {
      "indent": 3,
      "text": "floor-id-attribute = \"a=floorid:\" token [\" mstrm:\" token *(SP token)]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The 'floorid' attribute is used in BFCP 'm' lines. It defines a floor identifier and, possibly, associates it with one or more media streams. The token representing the floor ID is the integer representation of the Floor ID to be used in BFCP. The token representing the media stream is a pointer to the media stream, which is identified by an SDP label attribute [9].",
      "zh-CHS": "“floorid”属性用于BFCP“m”行。它定义楼层标识符，并可能将其与一个或多个媒体流相关联。表示楼层ID的标记是要在BFCP中使用的楼层ID的整数表示。表示媒体流的令牌是指向媒体流的指针，由SDP标签属性标识[9]。"
    },
    {
      "indent": 3,
      "text": "Endpoints that use the offer/answer model to establish BFCP connections MUST support the 'floorid' and the 'label' attributes. A floor control server acting as an offerer or as an answerer SHOULD include these attributes in its session descriptions.",
      "zh-CHS": "使用提供/应答模型建立BFCP连接的端点必须支持“floorid”和“label”属性。作为报价人或应答人的楼层控制服务器应在其会话描述中包含这些属性。"
    },
    {
      "indent": 0,
      "text": "7. TCP Connection Management",
      "section_title": true,
      "zh-CHS": "7. TCP连接管理"
    },
    {
      "indent": 3,
      "text": "The management of the TCP connection used to transport BFCP is performed using the 'setup' and 'connection' attributes, as defined in [7].",
      "zh-CHS": "使用[7]中定义的“设置”和“连接”属性来管理用于传输BFCP的TCP连接。"
    },
    {
      "indent": 3,
      "text": "The 'setup' attribute indicates which of the endpoints (client or floor control server) initiates the TCP connection. The 'connection' attribute handles TCP connection reestablishment.",
      "zh-CHS": "“setup”属性指示哪个端点（客户端或楼层控制服务器）启动TCP连接。“connection”属性处理TCP连接的重新建立。"
    },
    {
      "indent": 3,
      "text": "The BFCP specification [8] describes a number of situations when the TCP connection between a client and the floor control server needs to be reestablished. However, that specification does not describe the reestablishment process because this process depends on how the connection was established in the first place. BFCP entities using the offer/answer model follow the following rules.",
      "zh-CHS": "BFCP规范[8]描述了客户机和楼层控制服务器之间需要重新建立TCP连接的许多情况。但是，该规范没有描述重建过程，因为该过程取决于连接最初是如何建立的。使用报价/应答模型的BFCP实体遵循以下规则。"
    },
    {
      "indent": 3,
      "text": "When the existing TCP connection is reset following the rules in [8], the client SHOULD generate an offer towards the floor control server in order to reestablish the connection. If a TCP connection cannot deliver a BFCP message and times out, the entity that attempted to send the message (i.e., the one that detected the TCP timeout) SHOULD generate an offer in order to reestablish the TCP connection.",
      "zh-CHS": "当按照[8]中的规则重置现有TCP连接时，客户端应向楼层控制服务器生成报价，以便重新建立连接。如果TCP连接无法传递BFCP消息并超时，则尝试发送消息的实体（即检测到TCP超时的实体）应生成要约，以便重新建立TCP连接。"
    },
    {
      "indent": 3,
      "text": "Endpoints that use the offer/answer model to establish BFCP connections MUST support the 'setup' and 'connection' attributes.",
      "zh-CHS": "使用提供/应答模型建立BFCP连接的端点必须支持“设置”和“连接”属性。"
    },
    {
      "indent": 0,
      "text": "8. Authentication",
      "section_title": true,
      "zh-CHS": "8. 认证"
    },
    {
      "indent": 3,
      "text": "When a BFCP connection is established using the offer/answer model, it is assumed that the offerer and the answerer authenticate each other using some mechanism. Once this mutual authentication takes place, all the offerer and the answerer need to ensure is that the entity they are receiving BFCP messages from is the same as the one that generated the previous offer or answer.",
      "zh-CHS": "当使用提供/应答模型建立BFCP连接时，假设提供方和应答方使用某种机制相互验证。一旦发生这种相互认证，报价人和应答人需要确保他们接收BFCP消息的实体与生成先前报价或应答的实体相同。"
    },
    {
      "indent": 3,
      "text": "When SIP is used to perform an offer/answer exchange, the initial mutual authentication takes place at the SIP level. Additionally, SIP uses S/MIME [6] to provide an integrity-protected channel with optional confidentiality for the offer/answer exchange. BFCP takes advantage of this integrity-protected offer/answer exchange to perform authentication. Within the offer/answer exchange, the offerer and answerer exchange the fingerprints of their self-signed certificates. These self-signed certificates are then used to establish the TLS connection that will carry BFCP traffic between the offerer and the answerer.",
      "zh-CHS": "当SIP用于执行提供/应答交换时，初始相互认证在SIP级别进行。此外，SIP使用S/MIME[6]为提供/应答交换提供一个完整性保护通道，该通道具有可选的机密性。BFCP利用此完整性保护的提供/应答交换来执行身份验证。在要约/应答交换中，要约人和应答人交换其自签名证书的指纹。然后，这些自签名证书用于建立TLS连接，该连接将在报价人和应答人之间承载BFCP流量。"
    },
    {
      "indent": 3,
      "text": "BFCP clients and floor control servers follow the rules in [10] regarding certificate choice and presentation. This implies that unless a 'fingerprint' attribute is included in the session description, the certificate provided at the TLS-level MUST either be directly signed by one of the other party's trust anchors or be validated using a certification path that terminates at one of the other party's trust anchors [5]. Endpoints that use the offer/answer",
      "zh-CHS": "BFCP客户端和楼层控制服务器遵循[10]中关于证书选择和表示的规则。这意味着，除非会话描述中包含“指纹”属性，否则在TLS级别提供的证书必须由另一方的信任锚点之一直接签名，或者使用在另一方的信任锚点之一终止的证书路径进行验证[5]。使用提供/应答的端点"
    },
    {
      "indent": 3,
      "text": "model to establish BFCP connections MUST support the 'fingerprint' attribute and SHOULD include it in their session descriptions.",
      "zh-CHS": "用于建立BFCP连接的模型必须支持“指纹”属性，并应将其包含在会话描述中。"
    },
    {
      "indent": 3,
      "text": "When TLS is used, once the underlaying TCP connection is established, the answerer acts as the TLS server regardless of its role (passive or active) in the TCP establishment procedure.",
      "zh-CHS": "使用TLS时，一旦建立了底层TCP连接，应答者将充当TLS服务器，而不管其在TCP建立过程中的角色（被动或主动）。"
    },
    {
      "indent": 0,
      "text": "9. Examples",
      "section_title": true,
      "zh-CHS": "9. 例子"
    },
    {
      "indent": 3,
      "text": "For the purpose of brevity, the main portion of the session description is omitted in the examples, which only show 'm' lines and their attributes.",
      "zh-CHS": "为简洁起见，示例中省略了会话描述的主要部分，其中仅显示“m”行及其属性。"
    },
    {
      "indent": 3,
      "text": "The following is an example of an offer sent by a conference server to a client.",
      "zh-CHS": "以下是会议服务器向客户端发送的报价示例。"
    },
    {
      "indent": 3,
      "text": "m=application 50000 TCP/TLS/BFCP *\na=setup:passive\na=connection:new\na=fingerprint:SHA-1 \\\n     4A:AD:B9:B1:3F:82:18:3B:54:02:12:DF:3E:5D:49:6B:19:E5:7C:AB\na=floorctrl:s-only\na=confid:4321\na=userid:1234\na=floorid:1 m-stream:10\na=floorid:2 m-stream:11\nm=audio 50002 RTP/AVP 0\na=label:10\nm=video 50004 RTP/AVP 31\na=label:11",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that due to RFC formatting conventions, this document splits SDP across lines whose content would exceed 72 characters. A backslash character marks where this line folding has taken place. This backslash and its trailing CRLF and whitespace would not appear in actual SDP content.",
      "zh-CHS": "请注意，由于RFC格式约定，此文档将SDP拆分为内容超过72个字符的行。反斜杠字符标记此折线发生的位置。此反斜杠及其尾部的CRLF和空格不会出现在实际的SDP内容中。"
    },
    {
      "indent": 3,
      "text": "The following is the answer returned by the client.",
      "zh-CHS": "以下是客户机返回的答案。"
    },
    {
      "indent": 3,
      "text": "m=application 9 TCP/TLS/BFCP *\na=setup:active\na=connection:new\na=fingerprint:SHA-1 \\\n     3D:B4:7B:E3:CC:FC:0D:1B:5D:31:33:9E:48:9B:67:FE:68:40:E8:21\na=floorctrl:c-only\nm=audio 55000 RTP/AVP 0\nm=video 55002 RTP/AVP 31",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "zh-CHS": "10. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The BFCP [8], SDP [11], and offer/answer [4] specifications discuss security issues related to BFCP, SDP, and offer/answer, respectively. In addition, [7] and [10] discuss security issues related to the establishment of TCP and TLS connections using an offer/answer model.",
      "zh-CHS": "BFCP[8]、SDP[11]和offer/answer[4]规范分别讨论了与BFCP、SDP和offer/answer相关的安全问题。此外，[7]和[10]还讨论了与使用提供/应答模型建立TCP和TLS连接相关的安全问题。"
    },
    {
      "indent": 3,
      "text": "BFCP assumes that an initial integrity-protected channel is used to exchange self-signed certificates between a client and the floor control server. For session descriptions carried in SIP [3], S/MIME [6] is the natural choice to provide such a channel.",
      "zh-CHS": "BFCP假定初始完整性保护通道用于在客户端和楼层控制服务器之间交换自签名证书。对于SIP[3]中的会话描述，S/MIME[6]是提供此类信道的自然选择。"
    },
    {
      "indent": 0,
      "text": "11. IANA Considerations",
      "section_title": true,
      "zh-CHS": "11. IANA考虑"
    },
    {
      "indent": 0,
      "text": "11.1. Registration of the 'TCP/BFCP' and 'TCP/TLS/BFCP' SDP 'proto' Values",
      "zh-CHS": "11.1. “TCP/BFCP”和“TCP/TLS/BFCP”SDP“proto”值的注册"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the following two new values for the SDP 'proto' field under the Session Description Protocol (SDP) Parameters registry:",
      "zh-CHS": "IANA已在会话描述协议（SDP）参数注册表下为SDP“proto”字段注册了以下两个新值："
    },
    {
      "indent": 23,
      "text": "+--------------+-----------+\n| Value        | Reference |\n+--------------+-----------+\n| TCP/BFCP     |  RFC4583  |\n| TCP/TLS/BFCP |  RFC4583  |\n+--------------+-----------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Table 2: Values for the SDP 'proto' field",
      "zh-CHS": "表2:SDP“proto”字段的值"
    },
    {
      "indent": 0,
      "text": "11.2. Registration of the SDP 'floorctrl' Attribute",
      "section_title": true,
      "zh-CHS": "11.2. SDP“floorctrl”属性的注册"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the following SDP att-field under the Session Description Protocol (SDP) Parameters registry:",
      "zh-CHS": "IANA已在会话描述协议（SDP）参数注册表下注册了以下SDP att字段："
    },
    {
      "indent": 3,
      "text": "Contact name: Gonzalo.Camarillo@ericsson.com",
      "zh-CHS": "联系人姓名：Gonzalo。Camarillo@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Attribute name: floorctrl",
      "zh-CHS": "属性名称：floorctrl"
    },
    {
      "indent": 3,
      "text": "Long-form attribute name: Floor Control",
      "zh-CHS": "长格式属性名称：楼层控制"
    },
    {
      "indent": 3,
      "text": "Type of attribute: Media level",
      "zh-CHS": "属性类型：媒体级别"
    },
    {
      "indent": 3,
      "text": "Subject to charset: No",
      "zh-CHS": "以字符集为准：否"
    },
    {
      "indent": 3,
      "text": "Purpose of attribute: The 'floorctrl' attribute is used to perform floor control server determination.",
      "zh-CHS": "属性用途：“floorctrl”属性用于执行楼层控制服务器确定。"
    },
    {
      "indent": 3,
      "text": "Allowed attribute values:   1*(\"c-only\" / \"s-only\" / \"c-s\")",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "11.3. Registration of the SDP 'confid' Attribute",
      "section_title": true,
      "zh-CHS": "11.3. SDP“confid”属性的注册"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the following SDP att-field under the Session Description Protocol (SDP) Parameters registry:",
      "zh-CHS": "IANA已在会话描述协议（SDP）参数注册表下注册了以下SDP att字段："
    },
    {
      "indent": 3,
      "text": "Contact name: Gonzalo.Camarillo@ericsson.com",
      "zh-CHS": "联系人姓名：Gonzalo。Camarillo@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Attribute name: confid",
      "zh-CHS": "属性名称：confid"
    },
    {
      "indent": 3,
      "text": "Long-form attribute name: Conference Identifier",
      "zh-CHS": "长格式属性名称：会议标识符"
    },
    {
      "indent": 3,
      "text": "Type of attribute: Media level",
      "zh-CHS": "属性类型：媒体级别"
    },
    {
      "indent": 3,
      "text": "Subject to charset: No",
      "zh-CHS": "以字符集为准：否"
    },
    {
      "indent": 3,
      "text": "Purpose of attribute: The 'confid' attribute carries the integer representation of a Conference ID.",
      "zh-CHS": "属性用途：“confid”属性携带会议ID的整数表示形式。"
    },
    {
      "indent": 3,
      "text": "Allowed attribute values: A token",
      "zh-CHS": "允许的属性值：标记"
    },
    {
      "indent": 0,
      "text": "11.4. Registration of the SDP 'userid' Attribute",
      "section_title": true,
      "zh-CHS": "11.4. SDP“userid”属性的注册"
    },
    {
      "indent": 3,
      "text": "This section instructs the IANA to register the following SDP att-field under the Session Description Protocol (SDP) Parameters registry:",
      "zh-CHS": "本节指示IANA在会话描述协议（SDP）参数注册表下注册以下SDP att字段："
    },
    {
      "indent": 3,
      "text": "Contact name: Gonzalo.Camarillo@ericsson.com",
      "zh-CHS": "联系人姓名：Gonzalo。Camarillo@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Attribute name: userid",
      "zh-CHS": "属性名称：userid"
    },
    {
      "indent": 3,
      "text": "Long-form attribute name: User Identifier",
      "zh-CHS": "长格式属性名称：用户标识符"
    },
    {
      "indent": 3,
      "text": "Type of attribute: Media level",
      "zh-CHS": "属性类型：媒体级别"
    },
    {
      "indent": 3,
      "text": "Subject to charset: No",
      "zh-CHS": "以字符集为准：否"
    },
    {
      "indent": 3,
      "text": "Purpose of attribute: The 'userid' attribute carries the integer representation of a User ID.",
      "zh-CHS": "属性用途：“userid”属性携带用户ID的整数表示。"
    },
    {
      "indent": 3,
      "text": "Allowed attribute values: A token",
      "zh-CHS": "允许的属性值：标记"
    },
    {
      "indent": 0,
      "text": "11.5. Registration of the SDP 'floorid' Attribute",
      "section_title": true,
      "zh-CHS": "11.5. SDP“floorid”属性的注册"
    },
    {
      "indent": 3,
      "text": "This section instructs the IANA to register the following SDP att-field under the Session Description Protocol (SDP) Parameters registry:",
      "zh-CHS": "本节指示IANA在会话描述协议（SDP）参数注册表下注册以下SDP att字段："
    },
    {
      "indent": 3,
      "text": "Contact name: Gonzalo.Camarillo@ericsson.com",
      "zh-CHS": "联系人姓名：Gonzalo。Camarillo@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Attribute name: floorid",
      "zh-CHS": "属性名称：Floorrid"
    },
    {
      "indent": 3,
      "text": "Long-form attribute name: Floor Identifier",
      "zh-CHS": "长格式属性名称：楼层标识符"
    },
    {
      "indent": 3,
      "text": "Type of attribute: Media level",
      "zh-CHS": "属性类型：媒体级别"
    },
    {
      "indent": 3,
      "text": "Subject to charset: No",
      "zh-CHS": "以字符集为准：否"
    },
    {
      "indent": 3,
      "text": "Purpose of attribute: The 'floorid' attribute associates a floor with one or more media streams.",
      "zh-CHS": "属性用途：“floorid”属性将地板与一个或多个媒体流相关联。"
    },
    {
      "indent": 3,
      "text": "Allowed attribute values: Tokens",
      "zh-CHS": "允许的属性值：标记"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgements",
      "section_title": true,
      "zh-CHS": "12. 致谢"
    },
    {
      "indent": 3,
      "text": "Joerg Ott, Keith Drage, Alan Johnston, Eric Rescorla, Roni Even, and Oscar Novo provided useful ideas for this document.",
      "zh-CHS": "Joerg Ott、Keith Drage、Alan Johnston、Eric Rescorla、Roni Even和Oscar Novo为本文档提供了有用的想法。"
    },
    {
      "indent": 0,
      "text": "13. Normative References",
      "section_title": true,
      "zh-CHS": "13. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 4234, October 2005.",
      "zh-CHS": "[2] Crocker，D.，Ed.和P.Overell，“语法规范的扩充BNF:ABNF”，RFC 42342005年10月。"
    },
    {
      "indent": 3,
      "text": "[3] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[3] Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.，和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[4] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with Session Description Protocol (SDP)\", RFC 3264, June 2002.",
      "zh-CHS": "[4] Rosenberg，J.和H.Schulzrinne，“具有会话描述协议（SDP）的提供/应答模型”，RFC 3264，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[5] Housley, R., Polk, W., Ford, W., and D. Solo, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 3280, April 2002.",
      "zh-CHS": "[5] Housley，R.，Polk，W.，Ford，W.，和D.Solo，“Internet X.509公钥基础设施证书和证书撤销列表（CRL）配置文件”，RFC 32802002年4月。"
    },
    {
      "indent": 3,
      "text": "[6] Ramsdell, B., \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Certificate Handling\", RFC 3850, July 2004.",
      "zh-CHS": "[6] Ramsdell，B.，“安全/多用途Internet邮件扩展（S/MIME）版本3.1证书处理”，RFC 38502004年7月。"
    },
    {
      "indent": 3,
      "text": "[7] Yon, D. and G. Camarillo, \"TCP-Based Media Transport in the Session Description Protocol (SDP)\", RFC 4145, September 2005.",
      "zh-CHS": "[7] Yon，D.和G.Camarillo，“会话描述协议（SDP）中基于TCP的媒体传输”，RFC 41452005年9月。"
    },
    {
      "indent": 3,
      "text": "[8] Camarillo, G., Ott, J., and K. Drage, \"The Binary Floor Control Protocol (BFCP)\", RFC 4582, November 2006.",
      "zh-CHS": "[8] Camarillo，G.，Ott，J.，和K.Drage，“二进制地板控制协议（BFCP）”，RFC 4582，2006年11月。"
    },
    {
      "indent": 3,
      "text": "[9] Levin, O. and G. Camarillo, \"The Session Description Protocol (SDP) Label Attribute\", RFC 4574, July 2006.",
      "zh-CHS": "[9] Levin，O.和G.Camarillo，“会话描述协议（SDP）标签属性”，RFC 45742006年7月。"
    },
    {
      "indent": 3,
      "text": "[10] Lennox, J., \"Connection-Oriented Media Transport over the Transport Layer Security (TLS) Protocol in the Session Description Protocol (SDP)\", RFC 4572, July 2006.",
      "zh-CHS": "[10] Lennox，J.，“会话描述协议（SDP）中传输层安全（TLS）协议上的面向连接的媒体传输”，RFC 4572，2006年7月。"
    },
    {
      "indent": 3,
      "text": "[11] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, July 2006.",
      "zh-CHS": "[11] Handley，M.，Jacobson，V.，和C.Perkins，“SDP：会话描述协议”，RFC4566，2006年7月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Gonzalo Camarillo Ericsson Hirsalantie 11 Jorvas 02420 Finland",
      "zh-CHS": "Gonzalo Camarillo Ericsson Hirsalantie 11 Jorvas 02420芬兰"
    },
    {
      "indent": 3,
      "text": "EMail: Gonzalo.Camarillo@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2006).",
      "zh-CHS": "版权所有（C）IETF信托基金（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST, AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}