{
  "title": {
    "text": "RFC 4152: A Uniform Resource Name (URN) Namespace for the Common Language Equipment Identifier (CLEI) Code",
    "zh-CHS": "RFC 4152"
  },
  "number": 4152,
  "created_at": "2021-11-12 23:59:57.547873+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          K. Tesink\nRequest for Comments: 4152                                        R. Fox\nCategory: Informational                           Telcordia Technologies\n                                                             August 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": " A Uniform Resource Name (URN) Namespace for the Common Language Equipment Identifier (CLEI) Code",
      "zh-CHS": "公共语言设备标识符（CLEI）代码的统一资源名称（URN）命名空间"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace (RFC 3406) for the assignment of the Common Language Equipment Identifier (CLEI) code, which is used in messages standardized by ANSI. The URN namespace is managed by Telcordia Technologies, Inc., as the maintenance agent for ANSI T1.213. The CLEI code is a globally unique, ten-character alphanumeric intelligent code assigned by Telcordia Technologies at the request of equipment suppliers. The CLEI code identifies communications equipment by specifying product type and features. There is a one-to-one relationship between a CLEI code and supplier's product ID (the manufacturer's name and the part number along with its version number).",
      "zh-CHS": "本文档描述了用于分配通用语言设备标识符（CLEI）代码的统一资源名称（URN）命名空间（RFC 3406），该代码用于ANSI标准化的消息中。URN名称空间由Telcordia Technologies，Inc.作为ANSI T1.213的维护代理进行管理。CLEI代码是Telcordia Technologies应设备供应商的要求分配的全球唯一的十字符字母数字智能代码。CLEI代码通过指定产品类型和功能来识别通信设备。CLEI代码与供应商的产品ID（制造商名称、零件号及其版本号）之间存在一对一的关系。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Specification Template ..........................................2\n3. Examples ........................................................4\n4. Namespace and Community Considerations ..........................4\n5. Security Considerations .........................................5\n6. IANA Considerations .............................................5\n7. Acknowledgments .................................................5\n8. Normative References ............................................5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Many circuit cards used in the global telecommunications network have a CLEI code assigned and have a bar code or two-dimensional symbol on a label affixed to the front. Service providers utilize the CLEI code to:",
      "zh-CHS": "全球电信网络中使用的许多电路卡都指定了CLEI代码，并且在正面贴上了条形码或二维符号。服务提供商利用CLEI代码："
    },
    {
      "indent": 3,
      "text": "o Track inventory, both working and spare",
      "zh-CHS": "o 跟踪库存，包括工作库存和备用库存"
    },
    {
      "indent": 3,
      "text": "o Handle logistics (movement of circuit cards, along with the serial number)",
      "zh-CHS": "o 处理物流（电路卡的移动，以及序列号）"
    },
    {
      "indent": 3,
      "text": "o Provision equipment",
      "zh-CHS": "o 供应设备"
    },
    {
      "indent": 3,
      "text": "o Maintain asset records (accounting information)",
      "zh-CHS": "o 维护资产记录（会计信息）"
    },
    {
      "indent": 3,
      "text": "The goal of the CLEI namespace is to ensure the stability and uniqueness of the names of various (specific) items that are used within the messages exchanged between equipment of the global telecommunications network.",
      "zh-CHS": "CLEI名称空间的目标是确保全球电信网络设备之间交换的消息中使用的各种（特定）项的名称的稳定性和唯一性。"
    },
    {
      "indent": 3,
      "text": "The assigned maintenance agent for the CLEI code, Telcordia Technologies, is responsible for assigning certain equipment and other identifiers (e.g., location, manufacturer/supplier) for the telecommunications industry. The code assignment process identifies the structure and intelligence of the CLEI code to identify the circuit card's form, fit, functions, and features. Equipment may exist in multiple physical locations with the exact same form, fit, functions, and features; such equipment will have the same CLEI code if their product ID is the same.",
      "zh-CHS": "为CLEI代码指定的维护代理Telcordia Technologies负责为电信行业指定某些设备和其他标识符（如位置、制造商/供应商）。代码分配过程识别CLEI代码的结构和智能，以识别电路卡的形式、配合、功能和特征。设备可能存在于多个物理位置，具有完全相同的形状、配合、功能和特征；如果这些设备的产品ID相同，则它们将具有相同的CLEI代码。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "zh-CHS": "2. 规范模板"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 6,
      "text": "\"CLEI\"",
      "zh-CHS": "“克莱”"
    },
    {
      "indent": 3,
      "text": "Registration information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "Version 1 Date: 2004-12-31",
      "zh-CHS": "版本1日期：2004-12-31"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "Telcordia Technologies, Inc. Customer Support Center 8 Corporate Place Piscataway, NJ 08854",
      "zh-CHS": "Telcordia Technologies，Inc.客户支持中心，新泽西州皮斯卡塔韦市企业广场8号，邮编：08854"
    },
    {
      "indent": 6,
      "text": "U.S.A. +1.732.699.5577 http://www.commonlanguage.com",
      "zh-CHS": "美国+1.732.699.5577http://www.commonlanguage.com"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structures:",
      "zh-CHS": "句法结构声明："
    },
    {
      "indent": 6,
      "text": "The structure of the Namespace Specific String is a flat space of 10 characters, as defined in [T1.213][T1.213a].",
      "zh-CHS": "命名空间特定字符串的结构是一个包含10个字符的平面空间，如[T1.213][T1.213a]中所定义。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "[T1.213] and [T1.213a].",
      "zh-CHS": "[T1.213]和[T1.213a]。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "Identifiers are assigned by Telcordia URN registration that guarantees uniqueness for items with different form, fit, functions, and features. This is achieved simply by comparing all new proposed names to the already assigned names contained in a database. If the name already exists, a new one is created per the rules of the process. See [T1.213][T1.213a] for assignment examples.",
      "zh-CHS": "标识符由Telcordia URN注册分配，确保具有不同形状、配合、功能和特征的项目的唯一性。这只需将所有新提议的名称与数据库中已分配的名称进行比较即可实现。如果名称已存在，则根据流程规则创建一个新名称。作业示例见[T1.213][T1.213a]。"
    },
    {
      "indent": 3,
      "text": "Identifiers persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 6,
      "text": "The process defined by ANSI and the CLEI maintenance agent ensure that the binding between the name and its resource is permanent, and that names are not reassigned.",
      "zh-CHS": "ANSI和CLEI维护代理定义的过程确保名称与其资源之间的绑定是永久的，并且名称不会被重新分配。"
    },
    {
      "indent": 3,
      "text": "Process of identifiers assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 6,
      "text": "A CLEI code is an intelligent code that consists of 10 alphanumeric characters with 4 data elements. The first data element is considered the basic code with the first 2 characters indicating the technology or equipment type, and the third and fourth characters denoting the functional sub-category. The second data element represents the features, and its three characters denote functional capabilities or changes. The third data element has one character and denotes a reference to a manufacturer, system ID, specification, or drawing. The fourth data element consists of two characters and contains complementary data. These two characters provide a means of differentiating or providing uniqueness between the eight character CLEI codes by identifying the manufacturing vintage of the product. Names are assigned via procedures defined in [GR485].",
      "zh-CHS": "CLEI代码是由10个字母数字字符和4个数据元素组成的智能代码。第一个数据元素被视为基本代码，前两个字符表示技术或设备类型，第三和第四个字符表示功能子类别。第二个数据元素表示特征，其三个字符表示功能能力或更改。第三个数据元素有一个字符，表示对制造商、系统ID、规范或图纸的引用。第四个数据元素由两个字符组成，包含补充数据。这两个字符通过识别产品的制造年份来区分或提供八个字符的CLEI代码之间的唯一性。通过[GR485]中定义的程序分配名称。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 6,
      "text": "Telcordia URNs are resolved via Telcordia resolvers run under Telcordia responsibility. For further information see www.commonlanguage.com.",
      "zh-CHS": "Telcordia URN由Telcordia负责运行的Telcordia解析器解决。有关更多信息，请访问www.commonlanguage.com。"
    },
    {
      "indent": 3,
      "text": "Rules for lexical equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "Lexical equivalence of two CLEI URN namespace specific strings is defined as an exact, case-insensitive string match. CLEI codes are assigned in a case-insensitive fashion, so that there will not be two CLEI codes that differ only in case. See [T1.213] and [T1.213a] for further information.",
      "zh-CHS": "两个特定于CLEI URN命名空间的字符串的词法等价性定义为精确的、不区分大小写的字符串匹配。CLEI代码是以不区分大小写的方式分配的，这样就不会有两个仅大小写不同的CLEI代码。有关更多信息，请参见[T1.213]和[T1.213a]。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "No special consideration.",
      "zh-CHS": "没有特别考虑。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "None specified.",
      "zh-CHS": "没有具体说明。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "Global.",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "The following three examples are based on the examples provided in [T1.213a], and correspond with three different sets of features by three different manufacturers (Nortel Networks, Lear, and Lucent Technologies) producing \"D4CE\" (a particular D4 channel bank type) equipment. The fourth example refers to a SONET power unit convertor of Alcatel.",
      "zh-CHS": "以下三个示例基于[T1.213a]中提供的示例，并与生产“D4CE”（特定的D4通道组类型）设备的三家不同制造商（北电网络、李尔和朗讯科技）的三组不同功能相对应。第四个示例涉及阿尔卡特的SONET功率单元转换器。"
    },
    {
      "indent": 6,
      "text": "URN:CLEI:D4CE18B7AA\nURN:CLEI:D4CE4248AA\nURN:CLEI:D4CE363PAB\nURN:CLEI:SNPWBBC7AA",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Namespace and Community Considerations",
      "section_title": true,
      "zh-CHS": "4. 命名空间和社区注意事项"
    },
    {
      "indent": 3,
      "text": "CLEI codes have historically been used in a variety of communications equipment (see examples above and [T1.213a]). There are circumstances in which entities with CLEI codes need to be managed or exposed in a larger context, such as the general Internet. In these",
      "zh-CHS": "CLEI代码历史上曾用于各种通信设备（见上文示例和[T1.213a]）。在某些情况下，具有CLEI代码的实体需要在更大的环境中进行管理或公开，例如通用互联网。在这些"
    },
    {
      "indent": 3,
      "text": "cases, the use of the CLEI URN namespace will provide general interoperability benefits to the Internet at large, as well as to specific internets.",
      "zh-CHS": "在某些情况下，使用CLEI URN名称空间将为整个Internet以及特定Internet提供通用的互操作性好处。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "除了通常与使用和解决骨灰盒相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 3,
      "text": "However, note that attempting to resolve a Telcordia URN through a resolver other than the one provided by Telcordia is not considered authoritative.",
      "zh-CHS": "但是，请注意，尝试通过Telcordia提供的解析程序以外的解析程序解析Telcordia URN并不具有权威性。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the formal URN namespace CLEI within the IANA registry of URN NIDs.",
      "zh-CHS": "IANA已经在URN NID的IANA注册表中注册了正式的URN名称空间CLEI。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The contributions of the Entity MIB Working Group members are gratefully acknowledged. Special thanks go to Mike Heard, Juergen Schoenwaelder, Dave Perkins, and Dan Romascanu.",
      "zh-CHS": "感谢实体MIB工作组成员的贡献。特别感谢Mike Heard、Juergen Schoenwaelder、Dave Perkins和Dan Romascanu。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "zh-CHS": "8. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", RFC 3406, October 2002.",
      "zh-CHS": "[RFC3406]Daigle，L.，van Gulik，D.，Iannella，R.，和P.Faltstrom，“统一资源名（URN）命名空间定义机制”，RFC 3406，2002年10月。"
    },
    {
      "indent": 3,
      "text": "[T1.213] ATIS T1.213-2001, Coded Identification of Equipment Entities in the North American Telecommunications System for Information Exchange, 2001, www.ansi.org.",
      "zh-CHS": "[T1.213]ATIS T1.213-2001，《北美电信系统中用于信息交换的设备实体编码标识》，2001年，www.ansi.org。"
    },
    {
      "indent": 3,
      "text": "[T1.213a] ATIS T1.213a, Supplement to T1.213-2001, Coded Identification of Equipment Entities in the North American Telecommunications System for Information Exchange, to correct the representation of the Basic Code in Figure B.1, 2001, www.ansi.org.",
      "zh-CHS": "[T1.213a]ATIS T1.213a，T1.213-2001的补充，北美电信系统中用于信息交换的设备实体的编码标识，以更正图B.1中的基本代码表示，2001年，www.ansi.org。"
    },
    {
      "indent": 3,
      "text": "[GR485] GR-485-CORE, COMMON LANGUAGE Equipment Codes (CLEI Codes), Generic Requirements for Processes And Guidelines, Issue 5, Telcordia Technologies, April 2004.",
      "zh-CHS": "[GR485]GR-485-CORE，通用语言设备代码（CLEI代码），过程和指南的一般要求，第5期，Telcordia Technologies，2004年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Kaj Tesink One Telcordia Drive Piscataway, NJ 08854 USA",
      "zh-CHS": "美国新泽西州皮斯卡塔韦泰尔科迪亚大道Kaj Tesink一号，邮编：08854"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 699-6068\nEMail: kaj@research.telcordia.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Robert H. Fox 3545 S.Ocean Blvd, #417 Palm Beach, FL 33480-5715 USA",
      "zh-CHS": "罗伯特·H·福克斯美国佛罗里达州棕榈滩417号海洋大道南3545号，邮编33480-5715"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 699-8968\nEMail: rfox@telcordia.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}