{
  "title": {
    "text": "RFC 4560: Definitions of Managed Objects for Remote Ping, Traceroute, and Lookup Operations",
    "zh-CHS": "RFC 4560"
  },
  "number": 4560,
  "created_at": "2021-11-14 07:19:05.081602+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    J. Quittek, Ed.\nRequest for Comments: 4560                                           NEC\nObsoletes: 2925                                            K. White, Ed.\nCategory: Standards Track                                      IBM Corp.\n                                                               June 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": " Definitions of Managed Objects for Remote Ping, Traceroute, and Lookup Operations",
      "zh-CHS": "远程Ping、Traceroute和查找操作的托管对象定义"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines Management Information Bases (MIBs) for performing ping, traceroute, and lookup operations at a host. When managing a network, it is useful to be able to initiate and retrieve the results of ping or traceroute operations when they are performed at a remote host. A lookup capability is defined in order to enable resolution of either an IP address to an DNS name or a DNS name to an IP address at a remote host.",
      "zh-CHS": "此备忘录定义了用于在主机上执行ping、traceroute和查找操作的管理信息库（MIB）。在管理网络时，在远程主机上执行ping或traceroute操作时，能够启动和检索这些操作的结果非常有用。定义查找功能是为了在远程主机上将IP地址解析为DNS名称或将DNS名称解析为IP地址。"
    },
    {
      "indent": 3,
      "text": "Currently, there are several enterprise-specific MIBs for performing remote ping or traceroute operations. The purpose of this memo is to define a standards-based solution to enable interoperability.",
      "zh-CHS": "目前，有几个特定于企业的MIB用于执行远程ping或traceroute操作。本备忘录旨在定义基于标准的解决方案，以实现互操作性。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Ping .......................................................3\n   1.2. Traceroute .................................................4\n   1.3. Lookup .....................................................5\n   1.4. Remote Operations ..........................................5\n2. The Internet-Standard Management Framework ......................5\n3. Structure of the MIBs ...........................................6\n   3.1. Ping MIB ...................................................6\n        3.1.1. pingMaxConcurrentRequests ...........................7\n        3.1.2. pingCtlTable ........................................7\n        3.1.3. pingResultsTable ....................................7\n        3.1.4. pingProbeHistoryTable ...............................8\n   3.2. Traceroute MIB .............................................8\n        3.2.1. traceRouteMaxConcurrentRequests .....................8\n        3.2.2. traceRouteCtlTable ..................................8\n        3.2.3. traceRouteResultsTable ..............................9\n        3.2.4. traceRouteProbeHistoryTable ........................10\n        3.2.5. traceRouteHopsTable ................................10\n   3.3. Lookup MIB ................................................10\n        3.3.1. lookupMaxConcurrentRequests and lookupPurgeTime ....11\n        3.3.2. lookupCtlTable .....................................11\n        3.3.3. lookupResultsTable .................................12\n   3.4. Conformance ...............................................12\n4. Definitions ....................................................13\n   4.1. DISMAN-PING-MIB ...........................................13\n   4.2. DISMAN-TRACEROUTE-MIB .....................................46\n   4.3. DISMAN-NSLOOKUP-MIB .......................................84\n5. Security Considerations ........................................95\n6. Acknowledgements ...............................................97\n7. References .....................................................97\n   7.1. Normative References ......................................97\n   7.2. Informative References ....................................98",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document defines standards-based MIB modules for performing specific remote operations. The remote operations defined by this document consist of the ping, traceroute, and lookup functions.",
      "zh-CHS": "本文档定义了用于执行特定远程操作的基于标准的MIB模块。本文档定义的远程操作包括ping、traceroute和lookup函数。"
    },
    {
      "indent": 3,
      "text": "Ping and traceroute are two very useful functions for managing networks. Ping is typically used to determine whether a path exists between two hosts, whereas traceroute shows an actual path.",
      "zh-CHS": "Ping和traceroute是管理网络的两个非常有用的功能。Ping通常用于确定两台主机之间是否存在路径，而traceroute显示实际路径。"
    },
    {
      "indent": 3,
      "text": "Both ping and traceroute yield round-trip times measured in milliseconds. These times can be used as a rough approximation for network transit time.",
      "zh-CHS": "ping和traceroute都产生以毫秒为单位的往返时间。这些时间可用作网络传输时间的粗略近似值。"
    },
    {
      "indent": 3,
      "text": "The lookup functions considered in this document are the equivalents of name to address conversion functions such as gethostbyname()/gethostbyaddr() and getaddrinfo()/getnameinfo().",
      "zh-CHS": "本文档中考虑的查找函数等效于名称到地址的转换函数，如gethostbyname（）/gethostbyaddr（）和getaddrinfo（）/getnameinfo（）。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "1.1. Ping",
      "section_title": true,
      "zh-CHS": "1.1. 发出砰的声响"
    },
    {
      "indent": 3,
      "text": "Ping is usually implemented using the Internet Control Message Protocol (ICMP) \"ECHO\" facility. It is also possible to implement a ping capability using alternate methods, including the following:",
      "zh-CHS": "Ping通常使用Internet控制消息协议（ICMP）“ECHO”功能实现。还可以使用替代方法实现ping功能，包括以下方法："
    },
    {
      "indent": 6,
      "text": "o Using the UDP echo port (7), if supported.",
      "zh-CHS": "o 如果支持，请使用UDP回显端口（7）。"
    },
    {
      "indent": 10,
      "text": "This is defined by RFC 862 [RFC862].",
      "zh-CHS": "这是由RFC 862[RFC862]定义的。"
    },
    {
      "indent": 6,
      "text": "o Timing a Simple Network Management Protocol (SNMP) query.",
      "zh-CHS": "o 为简单网络管理协议（SNMP）查询计时。"
    },
    {
      "indent": 6,
      "text": "o Timing a TCP connect attempt.",
      "zh-CHS": "o 为TCP连接尝试计时。"
    },
    {
      "indent": 3,
      "text": "In general, almost any request/response flow can be used to generate a round-trip time. Often, many of the non-ICMP ECHO facility methods stand a better chance of yielding a good response (not timing out, for example) since some routers don't honor Echo Requests (timeout situation) or are handled at lower priority, thus possibly giving false indications of round trip times.",
      "zh-CHS": "通常，几乎任何请求/响应流都可以用来生成往返时间。通常，许多非ICMP ECHO facility方法有更好的机会产生良好的响应（例如，不超时），因为一些路由器不接受ECHO请求（超时情况）或以较低的优先级处理，因此可能给出错误的往返时间指示。"
    },
    {
      "indent": 3,
      "text": "Note that almost any of the various methods used for generating a round-trip time can be considered a form of system attack when used excessively. Sending a system request too often can negatively effect its performance. Attempting to connect to what is supposed to be an unused port can be very unpredictable. There are tools that attempt to connect to a range of TCP ports to test that any receiving server can handle erroneous connection attempts.",
      "zh-CHS": "请注意，当过度使用时，几乎所有用于生成往返时间的方法都可以被视为系统攻击的一种形式。过于频繁地发送系统请求可能会对其性能产生负面影响。尝试连接到本应未使用的端口可能非常不可预测。有一些工具尝试连接到一系列TCP端口，以测试任何接收服务器是否可以处理错误的连接尝试。"
    },
    {
      "indent": 3,
      "text": "It is also important to a management application using a remote ping capability to know which method is being used. Different methods will yield different response times, since the protocol and resulting processing will be different. It is RECOMMENDED that the ping capability defined within this memo be implemented using the ICMP Echo Facility.",
      "zh-CHS": "对于使用远程ping功能的管理应用程序来说，了解所使用的方法也很重要。不同的方法将产生不同的响应时间，因为协议和结果处理将不同。建议使用ICMP回显设施实现本备忘录中定义的ping功能。"
    },
    {
      "indent": 0,
      "text": "1.2. Traceroute",
      "section_title": true,
      "zh-CHS": "1.2. 追踪路线"
    },
    {
      "indent": 3,
      "text": "Traceroute is usually implemented by transmitting a series of probe packets with increasing time-to-live values. A probe packet is a UDP datagram encapsulated into an IP packet. Each hop in a path to the target (destination) host rejects the probe packet (probe's TTL too small) until its time-to-live value becomes large enough for the probe to be forwarded. Each hop in a traceroute path returns an ICMP message that is used to discover the hop and to calculate a round trip time. Some systems use ICMP probes (ICMP Echo request packets) instead of UDP ones to implement traceroute. In both cases traceroute relies on the probes being rejected via an ICMP message to discover the hops taken along a path to the final destination. Both probe types, UDP and ICMP, are encapsulated into an IP packet and thus have a TTL field that can be used to cause a path rejection.",
      "zh-CHS": "Traceroute通常是通过发送一系列探测包来实现的，探测包的生存时间值不断增加。探测数据包是封装在IP数据包中的UDP数据报。到达目标（目的地）主机的路径中的每个跃点都会拒绝探测数据包（探测的TTL太小），直到其生存时间值变大，足以转发探测。跟踪路由路径中的每个跃点返回一条ICMP消息，该消息用于发现跃点和计算往返时间。一些系统使用ICMP探测（ICMP回显请求包）而不是UDP探测来实现跟踪路由。在这两种情况下，跟踪路由都依赖于通过ICMP消息拒绝的探测来发现沿路径到达最终目的地的跳数。UDP和ICMP这两种探测类型都封装在IP数据包中，因此具有一个TTL字段，可用于导致路径拒绝。"
    },
    {
      "indent": 3,
      "text": "Implementations of the remote traceroute capability as defined within this memo SHOULD be done using UDP packets to a (hopefully) unused port. ICMP probes (ICMP Echo Request packets) SHOULD NOT be used. Many PC implementations of traceroute use the ICMP probe method, which they should not, since this implementation method has been known to have a high probability of failure. Intermediate hops become invisible when a router either refuses to send an ICMP TTL expired message in response to an incoming ICMP packet or simply tosses ICMP echo requests altogether.",
      "zh-CHS": "本备忘录中定义的远程跟踪路由功能的实现应该使用UDP数据包（希望是）未使用的端口来完成。不应使用ICMP探测（ICMP回显请求数据包）。跟踪路由的许多PC实现都使用ICMP探测方法，但它们不应该使用这种方法，因为已知这种实现方法有很高的失败概率。当路由器拒绝发送ICMP TTL过期消息以响应传入的ICMP数据包或干脆完全抛出ICMP回显请求时，中间跳变为不可见。"
    },
    {
      "indent": 3,
      "text": "The behavior of some routers not to return a TTL expired message in response to an ICMP Echo request is due in part to the following text extracted from RFC 792 [RFC792]:",
      "zh-CHS": "某些路由器在响应ICMP回送请求时不返回TTL过期消息的行为部分是由于从RFC 792[RFC792]提取的以下文本："
    },
    {
      "indent": 3,
      "text": "\"The ICMP messages typically report errors in the processing of datagrams. To avoid the infinite regress of messages about messages etc., no ICMP messages are sent about ICMP messages.\"",
      "zh-CHS": "ICMP消息通常报告数据报处理过程中的错误。为了避免消息等的无限回归，不发送关于ICMP消息的ICMP消息"
    },
    {
      "indent": 0,
      "text": "1.3. Lookup",
      "section_title": true,
      "zh-CHS": "1.3. 查找"
    },
    {
      "indent": 3,
      "text": "The Lookup operation enables remote lookup of addresses for a symbolic name as it is, for example, performed by functions getnameinfo() or gethostbyaddr() and lookup of symbolic names for an address as it is, for example, performed by functions getaddrinfo() or gethostbyname(). Note that whatever lookup function is chosen, results are not necessarily consistent with the results of a pure Domain Name Service (DNS) lookup, but may be influenced by local lookup tables or other sources of information. The lookup capability can be used to determine the symbolic name of a hop in a traceroute path. Also, the reverse lookup can be used, for example, for analyzing name lookup problems.",
      "zh-CHS": "查找操作允许远程查找符号名称的地址（例如，由函数getnameinfo（）或gethostbyaddr（）执行），以及查找地址的符号名称（例如，由函数getaddrinfo（）或gethostbyname（）执行）。请注意，无论选择何种查找功能，结果都不一定与纯域名服务（DNS）查找的结果一致，但可能会受到本地查找表或其他信息源的影响。查找功能可用于确定跟踪路由路径中跃点的符号名称。此外，例如，可以使用反向查找来分析名称查找问题。"
    },
    {
      "indent": 0,
      "text": "1.4. Remote Operations",
      "section_title": true,
      "zh-CHS": "1.4. 远程操作"
    },
    {
      "indent": 3,
      "text": "The MIB modules defined in this document allow a management station to initiate ping, traceroute, and lookup operations remotely. The basic scenario is illustrated by the following diagram.",
      "zh-CHS": "本文档中定义的MIB模块允许管理站远程启动ping、traceroute和查找操作。下图说明了基本场景。"
    },
    {
      "indent": 9,
      "text": "+-------+           +-------+           +-------+\n|       |---------->|       |           |       |\n|       | initiate  |       |---------->|       |\n| Mgmt. | operation |Managed|  perform  |Target |\n|Station| remotely  | Node  | operation | Host  |\n|       |           |       |           |       |\n|       |<----------|       |           |       |\n+-------+  receive  +-------+           +-------+\n          result of\n          operation",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "A management station is the local host from which the remote ping, traceroute, or Lookup operation is initiated using an SNMP request. The managed node is a remote host where the MIBs defined by this memo are implemented. It receives the remote operation via SNMP and performs the actual ping, traceroute, or lookup function.",
      "zh-CHS": "管理站是使用SNMP请求启动远程ping、traceroute或查找操作的本地主机。托管节点是一个远程主机，在此主机上实现此备忘录定义的MIB。它通过SNMP接收远程操作，并执行实际的ping、traceroute或查找功能。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "2. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了符合SMIv2的MIB模块，如STD 58、RFC 2578[RFC2578]、STD 58、RFC 2579[RFC2579]和STD 58、RFC 2580[RFC2580]所述。"
    },
    {
      "indent": 0,
      "text": "3. Structure of the MIBs",
      "section_title": true,
      "zh-CHS": "3. MIB的结构"
    },
    {
      "indent": 3,
      "text": "This document defines three MIB modules:",
      "zh-CHS": "本文档定义了三个MIB模块："
    },
    {
      "indent": 6,
      "text": "o DISMAN-PING-MIB",
      "zh-CHS": "o DISMAN-PING-MIB"
    },
    {
      "indent": 10,
      "text": "Defines a ping MIB.",
      "zh-CHS": "定义ping MIB。"
    },
    {
      "indent": 6,
      "text": "o DISMAN-TRACEROUTE-MIB",
      "zh-CHS": "o DISMAN-TRACEROUTE-MIB"
    },
    {
      "indent": 10,
      "text": "Defines a traceroute MIB.",
      "zh-CHS": "定义跟踪路由MIB。"
    },
    {
      "indent": 6,
      "text": "o DISMAN-NSLOOKUP-MIB",
      "zh-CHS": "o DISMAN-NSLOOKUP-MIB"
    },
    {
      "indent": 3,
      "text": "Provides access to lookup functions for symbolic names and addresses at a remote host provided, for example, by functions getaddrinfo()/getnameinfo() and gethostbyname()/gethostbyaddr().",
      "zh-CHS": "提供对远程主机上符号名和地址的查找函数的访问，例如，由函数getaddrinfo（）/getnameinfo（）和gethostbyname（）/gethostbyaddr（）提供。"
    },
    {
      "indent": 3,
      "text": "The ping and traceroute MIBs are structured to allow creation of ping or traceroute tests that can be set up to issue a series of operations periodically and to generate NOTIFICATIONs to report on test results. Many network administrators have in the past written UNIX shell scripts or command batch files to operate in a fashion similar to the functionality provided by the ping and traceroute MIBs defined within this memo. The intent of this document is to acknowledge the importance of these functions and to provide a standards-based solution.",
      "zh-CHS": "ping和traceroute mib的结构允许创建ping或traceroute测试，这些测试可以设置为定期发出一系列操作，并生成报告测试结果的通知。许多网络管理员过去编写过UNIX shell脚本或命令批处理文件，以类似于本备忘录中定义的ping和traceroute MIB提供的功能的方式进行操作。本文件旨在确认这些功能的重要性，并提供基于标准的解决方案。"
    },
    {
      "indent": 0,
      "text": "3.1. Ping MIB",
      "section_title": true,
      "zh-CHS": "3.1. Ping MIB"
    },
    {
      "indent": 3,
      "text": "The DISMAN-PING-MIB consists of the following components:",
      "zh-CHS": "DISAN-PING-MIB由以下组件组成："
    },
    {
      "indent": 6,
      "text": "o pingMaxConcurrentRequests",
      "zh-CHS": "o pingMaxConcurrentRequests"
    },
    {
      "indent": 6,
      "text": "o pingCtlTable",
      "zh-CHS": "o PingCtlable"
    },
    {
      "indent": 6,
      "text": "o pingResultsTable",
      "zh-CHS": "o pingResultsTable"
    },
    {
      "indent": 6,
      "text": "o pingProbeHistoryTable",
      "zh-CHS": "o pingProbeHistoryTable"
    },
    {
      "indent": 0,
      "text": "3.1.1. pingMaxConcurrentRequests",
      "section_title": true,
      "zh-CHS": "3.1.1. pingMaxConcurrentRequests"
    },
    {
      "indent": 3,
      "text": "The object pingMaxConcurrentRequests enables control of the maximum number of concurrent active requests that an agent implementation supports. It is permissible for an agent either to limit the maximum upper range allowed for this object or to implement this object as read-only with an implementation limit expressed as its value.",
      "zh-CHS": "对象pingMaxConcurrentRequests允许控制代理实现支持的最大并发活动请求数。允许代理限制此对象允许的最大上限范围，或者以只读方式实现此对象，实现限制以其值表示。"
    },
    {
      "indent": 0,
      "text": "3.1.2. pingCtlTable",
      "section_title": true,
      "zh-CHS": "3.1.2. PingCtlable"
    },
    {
      "indent": 3,
      "text": "A remote ping test is started by setting pingCtlAdminStatus to enabled(1). The corresponding pingCtlEntry MUST have been created, and its pingCtlRowStatus set to active(1), prior to starting the test. A single SNMP PDU can be used to create and start a remote ping test. Within the PDU, pingCtlTargetAddress should be set to the target host's address (pingCtlTargetAddressType will default to ipv4(1)), pingCtlAdminStatus to enabled(1), and pingCtlRowStatus to createAndGo(4).",
      "zh-CHS": "通过将pingCtlAdminStatus设置为enabled（1），可以启动远程ping测试。在开始测试之前，必须创建相应的pingCtlEntry，并将其pingCtlRowStatus设置为active（1）。单个SNMP PDU可用于创建和启动远程ping测试。在PDU中，pingCtlTargetAddress应设置为目标主机的地址（pingCtlTargetAddressType默认为ipv4（1）），pingCtlAdminStatus设置为enabled（1），pingCtlRowStatus设置为createAndGo（4）。"
    },
    {
      "indent": 3,
      "text": "The first index element, pingCtlOwnerIndex, is of type SnmpAdminString, a textual convention that allows for use of the SNMPv3 View-Based Access Control Model (RFC 3415 [RFC3415], VACM) and that allows a management application to identify its entries. The second index, pingCtlTestName (also an SnmpAdminString), enables the same management application to have multiple requests outstanding.",
      "zh-CHS": "第一个索引元素pingCtlOwnerIndex属于SnmpAdminString类型，这是一种文本约定，允许使用基于SNMPv3视图的访问控制模型（RFC 3415[RFC3415]，VACM），并允许管理应用程序识别其条目。第二个索引pingCtlTestName（也是一个SnmpAdminString）允许同一管理应用程序有多个未完成的请求。"
    },
    {
      "indent": 3,
      "text": "Using the maximum value for the parameters defined within a pingEntry can result in a single remote ping test's taking at most 15 minutes (pingCtlTimeOut times pingCtlProbeCount), plus whatever time it takes to send the ping request and to receive its response over the network from the target host. Use of the defaults for pingCtlTimeOut and pingCtlProbeCount yields a maximum of 3 seconds to perform a \"normal\" ping test.",
      "zh-CHS": "使用pingEntry中定义的参数的最大值可能导致单个远程ping测试最多需要15分钟（pingCtlTimeOut times pingCtlProbeCount），加上发送ping请求和通过网络从目标主机接收响应所需的时间。使用pingCtlTimeOut和pingCtlProbeCount的默认值会产生最多3秒的时间来执行“正常”ping测试。"
    },
    {
      "indent": 3,
      "text": "A management application can delete an active remote ping request by setting the corresponding pingCtlRowStatus object to destroy(6).",
      "zh-CHS": "管理应用程序可以通过将相应的pingCtlRowStatus对象设置为destroy（6），删除活动的远程ping请求。"
    },
    {
      "indent": 3,
      "text": "The contents of the pingCtlTable are preserved across reIPLs (Initial Program Loads) of its agent according the values of each of the pingCtlStorageType objects.",
      "zh-CHS": "pingCtlTable的内容根据每个pingCtlStorageType对象的值在其代理的reIPLs（初始程序加载）中保留。"
    },
    {
      "indent": 0,
      "text": "3.1.3. pingResultsTable",
      "section_title": true,
      "zh-CHS": "3.1.3. pingResultsTable"
    },
    {
      "indent": 3,
      "text": "An entry in the pingResultsTable is created for a corresponding pingCtlEntry once the test defined by this entry is started.",
      "zh-CHS": "启动由该条目定义的测试后，将为相应的pingCtlEntry创建pingResultsTable中的条目。"
    },
    {
      "indent": 0,
      "text": "3.1.4. pingProbeHistoryTable",
      "section_title": true,
      "zh-CHS": "3.1.4. pingProbeHistoryTable"
    },
    {
      "indent": 3,
      "text": "The results of past ping probes are stored in this table on a per-pingCtlEntry basis. This table is initially indexed by pingCtlOwnerIndex and pingCtlTestName so that the results of a probe relate to the pingCtlEntry that caused it. The maximum number of entries stored in this table per pingCtlEntry is determined by the value of pingCtlMaxRows.",
      "zh-CHS": "过去ping探测的结果按每个pingCtlEntry存储在此表中。此表最初由pingCtlOwnerIndex和pingCtlTestName索引，以便探测结果与导致它的pingCtlEntry相关。每个pingCtlEntry在此表中存储的最大条目数由pingCtlMaxRows的值确定。"
    },
    {
      "indent": 3,
      "text": "An implementation of this MIB will remove the oldest entry in the pingProbeHistoryTable of the corresponding entry in the pingCtlTable to allow the addition of a new entry once the number of rows in the pingProbeHistoryTable reaches the value specified by pingCtlMaxRows for the corresponding entry in the pingCtlTable. An implementation MUST start assigning pingProbeHistoryIndex values at 1 and wrap after exceeding the maximum possible value, as defined by the limit of this object ('ffffffff'h).",
      "zh-CHS": "此MIB的实现将删除pingProbeHistoryTable中对应项的pingProbeHistoryTable中最早的项，以允许在pingProbeHistoryTable中的行数达到pingCtlMaxRows为pingCtlTable中对应项指定的值时添加新项。实现必须开始将pingProbeHistoryIndex值赋值为1，并在超出此对象的限制（'ffffffffffh'h）定义的最大可能值后换行。"
    },
    {
      "indent": 0,
      "text": "3.2. Traceroute MIB",
      "section_title": true,
      "zh-CHS": "3.2. 跟踪路由MIB"
    },
    {
      "indent": 3,
      "text": "The DISMAN-TRACEROUTE-MIB consists of the following components:",
      "zh-CHS": "DISAN-TRACEROUTE-MIB由以下组件组成："
    },
    {
      "indent": 6,
      "text": "o traceRouteMaxConcurrentRequests",
      "zh-CHS": "o traceRouteMaxConcurrentRequests"
    },
    {
      "indent": 6,
      "text": "o traceRouteCtlTable",
      "zh-CHS": "o 跟踪表"
    },
    {
      "indent": 6,
      "text": "o traceRouteResultsTable",
      "zh-CHS": "o 跟踪结果表"
    },
    {
      "indent": 6,
      "text": "o traceRouteProbeHistoryTable",
      "zh-CHS": "o 跟踪路由ProbeHistorytable"
    },
    {
      "indent": 6,
      "text": "o traceRouteHopsTable",
      "zh-CHS": "o 示踪剂"
    },
    {
      "indent": 0,
      "text": "3.2.1. traceRouteMaxConcurrentRequests",
      "section_title": true,
      "zh-CHS": "3.2.1. traceRouteMaxConcurrentRequests"
    },
    {
      "indent": 3,
      "text": "The object traceRouteMaxConcurrentRequests enables control of the maximum number of concurrent active requests that an agent implementation supports. It is permissible for an agent either to limit the maximum upper range allowed for this object or to implement this object as read-only with an implementation limit expressed as its value.",
      "zh-CHS": "对象traceRouteMaxConcurrentRequests允许控制代理实现支持的最大并发活动请求数。允许代理限制此对象允许的最大上限范围，或者以只读方式实现此对象，实现限制以其值表示。"
    },
    {
      "indent": 0,
      "text": "3.2.2. traceRouteCtlTable",
      "section_title": true,
      "zh-CHS": "3.2.2. 跟踪表"
    },
    {
      "indent": 3,
      "text": "A remote traceroute test is started by setting traceRouteCtlAdminStatus to enabled(1). The corresponding traceRouteCtlEntry MUST have been created, and its traceRouteCtlRowStatus set to active(1), prior to starting the test. A single SNMP PDU can be used to create and start a remote traceroute",
      "zh-CHS": "通过将TracerOuteClAdminStatus设置为enabled（1），可以启动远程跟踪路由测试。在开始测试之前，必须已创建相应的traceRouteCtlEntry，并将其traceRouteCtlRowStatus设置为active（1）。单个SNMP PDU可用于创建和启动远程跟踪路由"
    },
    {
      "indent": 3,
      "text": "test. Within the PDU, traceRouteCtlTargetAddress should be set to the target host's address (traceRouteCtlTargetAddressType will default to ipv4(1)), traceRouteCtlAdminStatus to enabled(1), and traceRouteCtlRowStatus to createAndGo(4).",
      "zh-CHS": "测验在PDU中，traceRouteCtlTargetAddress应设置为目标主机的地址（traceRouteCtlTargetAddressType默认为ipv4（1）），traceRouteCtlAdminStatus设置为enabled（1），traceRouteCtlRowStatus设置为createAndGo（4）。"
    },
    {
      "indent": 3,
      "text": "The first index element, traceRouteCtlOwnerIndex, is of type SnmpAdminString, a textual convention that allows for use of the SNMPv3 View-Based Access Control Model (RFC 3415 [RFC3415], VACM) and that allows a management application to identify its entries. The second index, traceRouteCtlTestName (also an SnmpAdminString), enables the same management application to have multiple requests outstanding.",
      "zh-CHS": "第一个索引元素tracerouteClownerIndex的类型为SNMPAdministring，这是一种文本约定，允许使用基于SNMPv3视图的访问控制模型（RFC 3415[RFC3415]，VACM），并允许管理应用程序识别其条目。第二个索引TRACEROUTCTLTESTNAME（也是一个SNMPAdministring）允许同一管理应用程序有多个未完成的请求。"
    },
    {
      "indent": 3,
      "text": "Traceroute has a much longer theoretical maximum time for completion than ping: basically, 42 hours and 30 minutes (the product of traceRouteCtlTimeOut, traceRouteCtlProbesPerHop, and traceRouteCtlMaxTtl) plus some network transit time! Use of the defaults defined within an traceRouteCtlEntry yields a maximum of 4 minutes and 30 seconds for a default traceroute operation. Clearly, 42 plus hours is too long to wait for a traceroute operation to be completed.",
      "zh-CHS": "Traceroute的理论最长完成时间比ping长得多：基本上是42小时30分钟（traceRouteCtlTimeOut、traceRouteCtlProbesPerHop和traceRouteCtlMaxTtl的乘积）加上一些网络传输时间！使用traceRouteCtlEntry中定义的默认值，默认traceroute操作的最大时间为4分30秒。显然，等待traceroute操作完成42个多小时太长了。"
    },
    {
      "indent": 3,
      "text": "The maximum Time to Live (TTL) value in effect for traceroute determines how long the traceroute function will keep increasing the TTL value in the probe it transmits, hoping to reach the target host. The function ends whenever the maximum TTL is exceeded or the target host is reached. The object traceRouteCtlMaxFailures was created in order to impose a throttle for how long traceroute continues to increase the TTL field in a probe without receiving any kind of response (timeouts). It is RECOMMENDED that agent implementations impose a time limit for how long it allows a traceroute operation to take, relative to how the function is implemented. For example, an implementation that can't process multiple traceroute operations at the same time SHOULD impose a shorter maximum allowed time period.",
      "zh-CHS": "traceroute有效的最大生存时间（TTL）值决定了traceroute函数将持续增加其传输的探测器中的TTL值，以期到达目标主机的时间。当超过最大TTL或达到目标主机时，该函数结束。创建对象traceRouteCtlMaxFailures是为了限制traceroute在不接收任何响应（超时）的情况下继续增加探测中的TTL字段的时间。建议代理实现对允许跟踪路由操作的时间（相对于函数的实现方式）施加一个时间限制。例如，不能同时处理多个跟踪路由操作的实现应该施加较短的最大允许时间段。"
    },
    {
      "indent": 3,
      "text": "A management application can delete an active remote traceroute request by setting the corresponding traceRouteCtlRowStatus object to destroy(6).",
      "zh-CHS": "管理应用程序可以通过将相应的traceRouteCtlRowStatus对象设置为destroy（6），删除活动的远程跟踪路由请求。"
    },
    {
      "indent": 3,
      "text": "The contents of the traceRouteCtlTable are preserved across reIPLs (Initial Program Loads) of its agent according to the values of each of the traceRouteCtlStorageType objects.",
      "zh-CHS": "traceRouteCtlTable的内容根据每个traceRouteCtlStorageType对象的值在其代理的REIPL（初始程序加载）中保留。"
    },
    {
      "indent": 0,
      "text": "3.2.3. traceRouteResultsTable",
      "section_title": true,
      "zh-CHS": "3.2.3. 跟踪结果表"
    },
    {
      "indent": 3,
      "text": "An entry in the traceRouteResultsTable is created upon determining the results of a specific traceroute operation. Entries in this table relate back to the traceRouteCtlEntry that caused the",
      "zh-CHS": "在确定特定跟踪路由操作的结果时，将创建跟踪路由结果表中的条目。此表中的条目与导致"
    },
    {
      "indent": 3,
      "text": "corresponding traceroute operation to occur. The objects traceRouteResultsCurHopCount and traceRouteResultsCurProbeCount can be examined to determine how far the current remote traceroute operation has reached.",
      "zh-CHS": "将发生相应的跟踪路由操作。可以检查对象TracerOutResultsCurhopCount和TracerOutResultsCurProbeCount，以确定当前远程跟踪路由操作已达到的程度。"
    },
    {
      "indent": 0,
      "text": "3.2.4. traceRouteProbeHistoryTable",
      "section_title": true,
      "zh-CHS": "3.2.4. 跟踪路由ProbeHistorytable"
    },
    {
      "indent": 3,
      "text": "The results of past traceroute probes can be stored in this table on a per-traceRouteCtlEntry basis. This table is initially indexed by traceRouteCtlOwnerIndex and traceRouteCtlTestName so that the results of a probe relate to the traceRouteCtlEntry that caused it. The number of entries stored in this table per traceRouteCtlEntry is determined by the value of traceRouteCtlMaxRows.",
      "zh-CHS": "过去跟踪路由探测的结果可以按每个跟踪路由条目存储在此表中。此表最初由traceRouteCtlOwnerIndex和traceRouteCtlTestName索引，以便探测结果与导致它的traceRouteCtlEntry相关。每个traceRouteCtlEntry在此表中存储的条目数由traceRouteCtlMaxRows的值确定。"
    },
    {
      "indent": 3,
      "text": "An implementation of this MIB will remove the oldest entry in the traceRouteProbeHistoryTable of the corresponding entry in the traceRouteCtlTable to allow the addition of an new entry once the number of rows in the traceRouteProbeHistoryTable reaches the value of traceRouteCtlMaxRows for the corresponding entry in the traceRouteCtlTable. An implementation MUST start assigning traceRouteProbeHistoryIndex values at 1 and wrap after exceeding the maximum possible value, as defined by the limit of this object ('ffffffff'h).",
      "zh-CHS": "此MIB的实现将删除traceRouteProbeHistoryTable中对应项的traceRouteProbeHistoryTable中最早的项，以允许在traceRouteProbeHistoryTable中的行数达到traceRouteCtlTable中对应项的traceRouteCtlMaxRows值时添加新项。实现必须开始将traceRouteProbeHistoryIndex值指定为1，并在超过此对象的限制（'FFFFFFFFFF'h）定义的最大可能值后进行换行。"
    },
    {
      "indent": 0,
      "text": "3.2.5. traceRouteHopsTable",
      "section_title": true,
      "zh-CHS": "3.2.5. 示踪剂"
    },
    {
      "indent": 3,
      "text": "The current traceroute path can be stored in this table on a per-traceRouteCtlEntry basis. This table is initially indexed by traceRouteCtlOwnerIndex and traceRouteCtlTestName so that a traceroute path relates to the traceRouteCtlEntry that caused it. A third index, traceRouteHopsHopIndex, enables keeping one traceRouteHopsEntry per traceroute hop. Creation of traceRouteHopsTable entries is enabled by setting the corresponding traceRouteCtlCreateHopsEntries object to true(1).",
      "zh-CHS": "当前跟踪路由路径可以按每个跟踪路由条目存储在此表中。此表最初由traceRouteCtlOwnerIndex和traceRouteCtlTestName索引，以便traceroute路径与导致它的traceRouteCtlEntry相关。第三个索引tracerouthopshopIndex允许每个traceroute跃点保留一个tracerouthopsentry。通过将相应的traceRouteCtlCreateHopsEntries对象设置为true（1），可以启用traceRouteHopsTable项的创建。"
    },
    {
      "indent": 0,
      "text": "3.3. Lookup MIB",
      "section_title": true,
      "zh-CHS": "3.3. 查找MIB"
    },
    {
      "indent": 3,
      "text": "The DISMAN-NSLOOKUP-MIB consists of the following components:",
      "zh-CHS": "DISAN-NSLOOKUP-MIB由以下组件组成："
    },
    {
      "indent": 6,
      "text": "o lookupMaxConcurrentRequests and lookupPurgeTime",
      "zh-CHS": "o lookupMaxConcurrentRequests和lookupPurgeTime"
    },
    {
      "indent": 6,
      "text": "o lookupCtlTable",
      "zh-CHS": "o 查找表"
    },
    {
      "indent": 6,
      "text": "o lookupResultsTable",
      "zh-CHS": "o 查找结果稳定"
    },
    {
      "indent": 0,
      "text": "3.3.1. lookupMaxConcurrentRequests and lookupPurgeTime",
      "section_title": true,
      "zh-CHS": "3.3.1. lookupMaxConcurrentRequests和lookupPurgeTime"
    },
    {
      "indent": 3,
      "text": "The object lookupMaxConcurrentRequests enables control of the maximum number of concurrent active requests that an agent implementation is structured to support. It is permissible for an agent either to limit the maximum upper range allowed for this object or to implement this object as read-only with an implementation limit expressed as its value.",
      "zh-CHS": "对象lookupMaxConcurrentRequests允许控制代理实现结构化支持的最大并发活动请求数。允许代理限制此对象允许的最大上限范围，或者以只读方式实现此对象，实现限制以其值表示。"
    },
    {
      "indent": 3,
      "text": "The object lookupPurgeTime provides a method for entries in the lookupCtlTable and lookupResultsTable to be automatically deleted after the corresponding operation is completed.",
      "zh-CHS": "对象lookupPurgeTime为lookupCtlTable和lookupResultsTable中的条目提供了一种方法，以便在相应操作完成后自动删除。"
    },
    {
      "indent": 0,
      "text": "3.3.2. lookupCtlTable",
      "section_title": true,
      "zh-CHS": "3.3.2. 查找表"
    },
    {
      "indent": 3,
      "text": "A remote lookup operation is initiated by performing an SNMP SET request on lookupCtlRowStatus. A single SNMP PDU can be used to create and start a remote lookup operation. Within the PDU, lookupCtlTargetAddress should be set to the entity to be resolved (lookupCtlTargetAddressType will default to ipv4(1)) and lookupCtlRowStatus to createAndGo(4). The object lookupCtlOperStatus can be examined to determine the state of a lookup operation. A management application can delete an active remote lookup request by setting the corresponding lookupCtlRowStatus object to destroy(6).",
      "zh-CHS": "远程查找操作是通过对lookupCtlRowStatus执行SNMP设置请求来启动的。单个SNMP PDU可用于创建和启动远程查找操作。在PDU中，lookupCtlTargetAddress应设置为要解析的实体（lookupCtlTargetAddressType将默认为ipv4（1）），lookupCtlRowStatus应设置为createAndGo（4）。可以检查对象lookupCtlOperStatus以确定查找操作的状态。管理应用程序可以通过将相应的lookupCtlRowStatus对象设置为destroy（6），删除活动的远程查找请求。"
    },
    {
      "indent": 3,
      "text": "An lookupCtlEntry is initially indexed by lookupCtlOwnerIndex, which is a type of SnmpAdminString, a textual convention that allows for use of the SNMPv3 View-Based Access Control Model (RFC 3415 [RFC3415],",
      "zh-CHS": "lookupCtlEntry最初由lookupCtlOwnerIndex编制索引，lookupCtlOwnerIndex是一种SNMPAdministring，一种允许使用基于SNMPv3视图的访问控制模型（RFC 3415[RFC3415]）的文本约定，"
    },
    {
      "indent": 3,
      "text": "VACM) and that also allows for a management application to identify its entries. The lookupCtlOwnerIndex portion of the index is then followed by lookupCtlOperationName. The lookupCtlOperationName index enables the same lookupCtlOwnerIndex entity to have multiple outstanding requests.",
      "zh-CHS": "这也允许管理应用程序识别其条目。然后，索引的lookupCtlOwnerIndex部分后跟lookupCtlOperationName。lookupCtlOperationName索引允许同一lookupCtlOwnerIndex实体具有多个未完成的请求。"
    },
    {
      "indent": 3,
      "text": "The value of lookupCtlTargetAddressType determines which lookup function to perform. Specification of dns(16) as the value of this index implies that a function such as getaddrinfo() or gethostbyname() should be performed to determine the numeric addresses associated with a symbolic name via lookupResultsTable entries. Use of a value of either ipv4(1) or ipv6(2) implies that a function such as getnameinfo() or gethostbyaddr() should be performed to determine the symbolic name(s) associated with a numeric address at a remote host.",
      "zh-CHS": "lookupCtlTargetAddressType的值确定要执行的查找函数。将dns（16）指定为该索引的值意味着应执行诸如getaddrinfo（）或gethostbyname（）之类的函数，以通过lookupResultsTable条目确定与符号名关联的数字地址。使用ipv4（1）或ipv6（2）的值意味着应该执行诸如getnameinfo（）或gethostbyaddr（）之类的函数来确定与远程主机上的数字地址关联的符号名。"
    },
    {
      "indent": 0,
      "text": "3.3.3. lookupResultsTable",
      "section_title": true,
      "zh-CHS": "3.3.3. 查找结果稳定"
    },
    {
      "indent": 3,
      "text": "The lookupResultsTable is used to store the results of lookup operations. Results to be reported here SHOULD be results of a lookup function that is commonly used by applications at the managed node. This implies that results are not necessarily consistent with the results of a pure DNS lookup at the managed node, but may be influenced by local lookup tables or other sources of information, depending on the configuration of the managed node.",
      "zh-CHS": "lookupResultsTable用于存储查找操作的结果。此处要报告的结果应该是托管节点上的应用程序常用的查找函数的结果。这意味着结果不一定与托管节点上的纯DNS查找结果一致，但可能受本地查找表或其他信息源的影响，具体取决于托管节点的配置。"
    },
    {
      "indent": 3,
      "text": "The lookupResultsTable is initially indexed by the same index elements that the lookupCtlTable contains (lookupCtlOwnerIndex and lookupCtlOperationName) but has a third index element, lookupResultsIndex (Unsigned32 textual convention), in order to associate multiple results with the same lookupCtlEntry.",
      "zh-CHS": "lookupResultsTable最初由lookupCtlTable包含的相同索引元素（lookupCtlOwnerIndex和lookupCtlOperationName）索引，但有第三个索引元素lookupResultsIndex（Unsigned32文本约定），以便将多个结果与同一lookupCtlEntry关联。"
    },
    {
      "indent": 3,
      "text": "A remote host can be multi-homed and can have multiple symbolic (DNS) names. Therefore, a lookup operation can return multiple IP addresses and multiple symbolic names.",
      "zh-CHS": "远程主机可以是多主机，并且可以有多个符号（DNS）名称。因此，查找操作可以返回多个IP地址和多个符号名。"
    },
    {
      "indent": 3,
      "text": "If the lookup operation was performed for a certain address by using getnameinfo() or gethostbyaddr(), for example, then entries in the lookupResultsTable MUST be made for each host name returned. If the lookup operation identifies one hostname as the host's 'official host name', then this name MUST be assigned a lookupResultsIndex of 1.",
      "zh-CHS": "例如，如果使用getnameinfo（）或gethostbyaddr（）对特定地址执行查找操作，则必须为返回的每个主机名在lookupResultsTable中创建条目。如果查找操作将一个主机名标识为主机的“正式主机名”，则必须为该名称分配lookupResultsIndex 1。"
    },
    {
      "indent": 3,
      "text": "If a lookup operation was performed for a certain symbolic name by using getaddrinfo() or gethostbyname(), for example, then entries in the lookupResultsTable MUST be made for each address returned. The entries MUST be stored in the order that they are retrieved. Values assigned to lookupResultsIndex MUST start at 1 and increase in order.",
      "zh-CHS": "例如，如果使用getaddrinfo（）或gethostbyname（）对某个符号名执行查找操作，则必须为返回的每个地址创建lookupResultsTable中的条目。条目必须按检索顺序存储。分配给lookupResultsIndex的值必须从1开始，并按顺序递增。"
    },
    {
      "indent": 3,
      "text": "An implementation SHOULD NOT retain SNMP-created entries in the lookupResultsTable across reIPLs (Initial Program Loads) of its agent, since management applications need to see consistent behavior with respect to the persistence of the table entries that they create.",
      "zh-CHS": "实现不应在其代理的REIPL（初始程序加载）中的lookupResultsTable中保留SNMP创建的条目，因为管理应用程序需要看到它们创建的表条目的持久性的一致行为。"
    },
    {
      "indent": 0,
      "text": "3.4. Conformance",
      "section_title": true,
      "zh-CHS": "3.4. 一致性"
    },
    {
      "indent": 3,
      "text": "Each of the three MIB modules defined in this document has two current compliance statements, one for full compliance and one for minimum compliance. The minimum compliance statements are intended to be applied to implementation for devices with very limited resources. The main difference between full and minimum compliance is that for minimum compliance, dynamic creation and deletion of table entries is not required, whereas it is required for full compliance.",
      "zh-CHS": "本文档中定义的三个MIB模块中的每一个都有两个当前合规性声明，一个用于完全合规性，另一个用于最低合规性。最低合规性声明旨在适用于资源非常有限的设备的实施。完全遵从性和最小遵从性之间的主要区别在于，对于最小遵从性，不需要动态创建和删除表项，而对于完全遵从性则需要动态创建和删除表项。"
    },
    {
      "indent": 3,
      "text": "In addition, the DISMAN-PING-MIB module and the DISMAN-TRACEROUTE-MIB modules each have a deprecated compliance statement that was current in RFC 2925. Semantically, the new full compliance statements are identical to the deprecated ones. But some of the object groups used in the old compliance statements needed to be split in order to support the new minimal compliance statements.",
      "zh-CHS": "此外，DISAN-PING-MIB模块和DISAN-TRACEROUTE-MIB模块都有一个在RFC 2925中最新的弃用合规性声明。从语义上讲，新的完全符合性声明与不推荐的完全符合性声明相同。但是，为了支持新的最低合规性声明，需要拆分旧合规性声明中使用的一些对象组。"
    },
    {
      "indent": 0,
      "text": "4. Definitions",
      "section_title": true,
      "zh-CHS": "4. 定义"
    },
    {
      "indent": 3,
      "text": "The following MIB modules import from [RFC2863], [RFC3411], and [RFC4001]. They also use the REFERENCE clause to reference [RFC1812], [RFC2474], and [RFC3260].",
      "zh-CHS": "以下MIB模块从[RFC2863]、[RFC3411]和[RFC4001]导入。他们还使用REFERENCE子句来引用[RFC1812]、[RFC2474]和[RFC3260]。"
    },
    {
      "indent": 0,
      "text": "4.1. DISMAN-PING-MIB",
      "section_title": true,
      "zh-CHS": "4.1. DISMAN-PING-MIB"
    },
    {
      "indent": 3,
      "text": "DISMAN-PING-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Integer32, Unsigned32, Gauge32, mib-2, NOTIFICATION-TYPE, OBJECT-IDENTITY FROM SNMPv2-SMI -- RFC2578 TEXTUAL-CONVENTION, RowStatus, StorageType, DateAndTime, TruthValue FROM SNMPv2-TC -- RFC2579 MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF -- RFC2580 InterfaceIndexOrZero -- RFC2863 FROM IF-MIB SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC3411 InetAddressType, InetAddress FROM INET-ADDRESS-MIB; -- RFC4001",
      "zh-CHS": "从SNMPv2 SMI导入模块标识、对象类型、整数32、无符号32、仪表32、mib-2、通知类型、对象标识--RFC2578文本约定、行状态、存储类型、日期和时间、SNMPv2 TC的TruthValue--RFC2579模块符合性、对象组、，SNMPv2 CONF中的通知组--RFC2580 InterfaceIndexOrZero--IF-MIB中的RFC2863 SNMPAdminInstalling FROM SNMP-FRAMEWORK-MIB--RFC3411 InetAddressType，InetAddress FROM INET-ADDRESS-MIB；--RFC4001"
    },
    {
      "indent": 4,
      "text": "pingMIB MODULE-IDENTITY LAST-UPDATED \"200606130000Z\" -- 13 June 2006 ORGANIZATION \"IETF Distributed Management Working Group\" CONTACT-INFO \"Juergen Quittek",
      "zh-CHS": "pingMIB模块标识最后一次更新“200606130000Z”-2006年6月13日组织“IETF分布式管理工作组”联系方式“Juergen Quitek”"
    },
    {
      "indent": 11,
      "text": "NEC Europe Ltd. Network Laboratories Kurfuersten-Anlage 36 69115 Heidelberg Germany",
      "zh-CHS": "NEC欧洲有限公司网络实验室Kurfuersten Anlage 36 69115德国海德堡"
    },
    {
      "indent": 11,
      "text": "Phone: +49 6221 4342-115",
      "zh-CHS": "电话：+4962214342-115"
    },
    {
      "indent": 7,
      "text": " Email: quittek@netlab.nec.de\" DESCRIPTION \"The Ping MIB (DISMAN-PING-MIB) provides the capability of controlling the use of the ping function at a remote host.",
      "zh-CHS": "电邮：quittek@netlab.nec.de“说明”Ping MIB（DISMAN-Ping-MIB）提供了在远程主机上控制Ping功能使用的功能。"
    },
    {
      "indent": 11,
      "text": "Copyright (C) The Internet Society (2006). This version of this MIB module is part of RFC 4560; see the RFC itself for full legal notices.\"",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。此版本的MIB模块是RFC 4560的一部分；有关完整的法律通知，请参见RFC本身。”"
    },
    {
      "indent": 8,
      "text": "-- Revision history",
      "zh-CHS": "--修订历史"
    },
    {
      "indent": 8,
      "text": "REVISION     \"200606130000Z\"         -- 13 June 2006\nDESCRIPTION\n    \"Updated version, published as RFC 4560.\n        - Correctly considered IPv6 in DESCRIPTION\n          clause of pingCtlDataSize\n        - Replaced references to RFC 2575 by RFC 3415\n        - Replaced references to RFC 2571 by RFC 3411\n        - Replaced references to RFC 2851 by RFC 4001\n        - Added DEFVAL { {} } to definition of\n          pingCtlTrapGeneration\n        - Changed DEFVAL of object pingCtlDescr from\n          DEFVAL { '00'H } to DEFVAL { ''H }\n        - Changed DEFVAL of object pingCtlSourceAddressType\n          from DEFVAL { ipv4 } to DEFVAL { unknown }\n        - Extended DESCRIPTION clause of pingResultsTable\n          describing re-initialization of entries\n        - Changed SYNTAX of pingResultsProbeResponses and\n          pingResultsSentProbes from Unsigned32 to Gauge32\n        - Changed status of pingCompliance to deprecated\n        - Added pingFullCompliance and pingMinimumCompliance\n        - Changed status of pingGroup and pingTimeStampGroup\n          to deprecated\n        - Added pingMinimumGroup, pingCtlRowStatusGroup,\n          and pingHistoryGroup\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "REVISION \"200009210000Z\" -- 21 September 2000 DESCRIPTION \"Initial version, published as RFC 2925.\"",
      "zh-CHS": "修订版“2000092100Z”-2000年9月21日描述“初始版本，发布为RFC 2925。”"
    },
    {
      "indent": 7,
      "text": "::= { mib-2 80 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Textual Conventions",
      "zh-CHS": "--文本约定"
    },
    {
      "indent": 5,
      "text": "OperationResponseStatus ::= TEXTUAL-CONVENTION\n  STATUS  current\n  DESCRIPTION",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "\"Used to report the result of an operation:",
      "zh-CHS": "“用于报告操作结果："
    },
    {
      "indent": 7,
      "text": "     responseReceived(1) - Operation is completed successfully.\n     unknown(2) - Operation failed due to unknown error.\n     internalError(3) - An implementation detected an error\n          in its own processing that caused an operation\n          to fail.\n     requestTimedOut(4) - Operation failed to receive a\n          valid reply within the time limit imposed on it.\n     unknownDestinationAddress(5) - Invalid destination\n          address.\n     noRouteToTarget(6) - Could not find a route to target.\n     interfaceInactiveToTarget(7) - The interface to be\n          used in sending a probe is inactive, and an\n          alternate route does not exist.\n     arpFailure(8) - Unable to resolve a target address to a\n          media-specific address.\n     maxConcurrentLimitReached(9) - The maximum number of\n          concurrent active operations would have been exceeded\n          if the corresponding operation was allowed.\n     unableToResolveDnsName(10) - The DNS name specified was\n          unable to be mapped to an IP address.\n     invalidHostAddress(11) - The IP address for a host\n          has been determined to be invalid.  Examples of this\n          are broadcast or multicast addresses.\"\nSYNTAX INTEGER {\n             responseReceived(1),\n             unknown(2),\n             internalError(3),\n             requestTimedOut(4),\n             unknownDestinationAddress(5),\n             noRouteToTarget(6),\n             interfaceInactiveToTarget(7),\n             arpFailure(8),\n             maxConcurrentLimitReached(9),\n             unableToResolveDnsName(10),\n             invalidHostAddress(11)\n          }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Top level structure of the MIB",
      "zh-CHS": "--MIB的顶层结构"
    },
    {
      "indent": 4,
      "text": "pingNotifications              OBJECT IDENTIFIER ::= { pingMIB 0 }\npingObjects                    OBJECT IDENTIFIER ::= { pingMIB 1 }\npingConformance                OBJECT IDENTIFIER ::= { pingMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- The registration node (point) for ping implementation types",
      "zh-CHS": "--ping实现类型的注册节点（点）"
    },
    {
      "indent": 4,
      "text": "pingImplementationTypeDomains  OBJECT IDENTIFIER ::= { pingMIB 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingIcmpEcho OBJECT-IDENTITY\n   STATUS      current\n   DESCRIPTION\n       \"Indicates that an implementation is using the Internet\n       Control Message Protocol (ICMP) 'ECHO' facility.\"\n   ::= { pingImplementationTypeDomains 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingUdpEcho OBJECT-IDENTITY STATUS current DESCRIPTION \"Indicates that an implementation is using the UDP echo port (7).\"",
      "zh-CHS": "pingUdpEcho OBJECT-IDENTITY STATUS current DESCRIPTION“表示实现正在使用UDP回显端口（7）”"
    },
    {
      "indent": 7,
      "text": "REFERENCE\n    \"RFC 862, 'Echo Protocol'.\"\n::= { pingImplementationTypeDomains 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingSnmpQuery OBJECT-IDENTITY\n   STATUS      current\n   DESCRIPTION\n       \"Indicates that an implementation is using an SNMP query\n        to calculate a round trip time.\"\n   ::= { pingImplementationTypeDomains 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingTcpConnectionAttempt OBJECT-IDENTITY\n   STATUS      current\n   DESCRIPTION\n       \"Indicates that an implementation is attempting to\n       connect to a TCP port in order to calculate a round\n       trip time.\"\n   ::= { pingImplementationTypeDomains 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Simple Object Definitions",
      "zh-CHS": "--简单对象定义"
    },
    {
      "indent": 4,
      "text": "pingMaxConcurrentRequests OBJECT-TYPE SYNTAX Unsigned32 UNITS \"requests\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The maximum number of concurrent active ping requests that are allowed within an agent implementation. A value of 0 for this object implies that there is no limit for the number of concurrent active requests in effect.",
      "zh-CHS": "pingMaxConcurrentRequests对象类型语法Unsigned32 UNITS“requests”MAX-ACCESS read-write STATUS current DESCRIPTION“代理实现中允许的最大并发活动ping请求数。此对象的值为0表示对有效的并发活动请求数没有限制。"
    },
    {
      "indent": 7,
      "text": "   The limit applies only to new requests being activated.\n   When a new value is set, the agent will continue processing\n   all the requests already active, even if their number\n   exceeds the limit just imposed.\"\nDEFVAL { 10 }\n::= { pingObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Ping Control Table",
      "zh-CHS": "--Ping控制表"
    },
    {
      "indent": 4,
      "text": "pingCtlTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF PingCtlEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines the ping Control Table for providing, via SNMP,\n       the capability of performing ping operations at\n       a remote host.  The results of these operations are\n       stored in the pingResultsTable and the\n       pingProbeHistoryTable.\"\n  ::= { pingObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlEntry OBJECT-TYPE\n   SYNTAX      PingCtlEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines an entry in the pingCtlTable.  The first index\n       element, pingCtlOwnerIndex, is of type SnmpAdminString,\n       a textual convention that allows for use of the SNMPv3\n       View-Based Access Control Model (RFC 3415, VACM)\n       and that allows a management application to identify its\n       entries.  The second index, pingCtlTestName (also an\n       SnmpAdminString), enables the same management\n       application to have multiple outstanding requests.\"\n   INDEX {\n            pingCtlOwnerIndex,\n            pingCtlTestName\n         }\n   ::= { pingCtlTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "PingCtlEntry ::=\n   SEQUENCE {\n       pingCtlOwnerIndex             SnmpAdminString,\n       pingCtlTestName               SnmpAdminString,\n       pingCtlTargetAddressType      InetAddressType,\n       pingCtlTargetAddress          InetAddress,\n       pingCtlDataSize               Unsigned32,\n       pingCtlTimeOut                Unsigned32,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": " pingCtlProbeCount Unsigned32, pingCtlAdminStatus INTEGER, pingCtlDataFill OCTET STRING, pingCtlFrequency Unsigned32, pingCtlMaxRows Unsigned32, pingCtlStorageType StorageType, pingCtlTrapGeneration BITS, pingCtlTrapProbeFailureFilter Unsigned32, pingCtlTrapTestFailureFilter Unsigned32, pingCtlType OBJECT IDENTIFIER, pingCtlDescr SnmpAdminString, pingCtlSourceAddressType InetAddressType, pingCtlSourceAddress InetAddress, pingCtlIfIndex InterfaceIndexOrZero, pingCtlByPassRouteTable TruthValue, pingCtlDSField Unsigned32, pingCtlRowStatus RowStatus }",
      "zh-CHS": "pingCtlProbeCount Unsigned32、pingCtlAdminStatus整数、pingCtlDataFill八位字符串、pingCtlFrequency Unsigned32、pingCtlMaxRows Unsigned32、pingCtlStorageType StorageType、pingCtlTrapGeneration位、pingCtlTrapProbeFailureFilter Unsigned32、pingCtlTrapTestFailureFilter Unsigned32、pingCtlType对象标识符、PingCtlDestr SNMPAdminInstalling、，pingCtlSourceAddressType InetAddressType、pingCtlSourceAddress InetAddress、PingCtliIndex InterfaceIndexOrZero、pingCtlByPassRouteTable TruthValue、PingCtldField Unsigned32、pingCtlRowStatus RowStatus}"
    },
    {
      "indent": 4,
      "text": "pingCtlOwnerIndex OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"To facilitate the provisioning of access control by a security administrator using the View-Based Access Control Model (RFC 2575, VACM) for tables in which multiple users may need to create or modify entries independently, the initial index is used as an 'owner index'. Such an initial index has a syntax of SnmpAdminString and can thus be trivially mapped to a securityName or groupName defined in VACM, in accordance with a security policy.",
      "zh-CHS": "pingCtlOwnerIndex对象类型语法SNMPAdministring（大小（0..32））MAX-ACCESS not accessible STATUS current DESCRIPTION“以便于安全管理员使用基于视图的访问控制模型（RFC 2575，VACM）提供访问控制对于多个用户可能需要独立创建或修改条目的表，初始索引用作“所有者索引”。此类初始索引具有SNMPAdministring语法，因此可以根据安全策略轻松映射到VACM中定义的securityName或groupName。"
    },
    {
      "indent": 7,
      "text": "   When used in conjunction with such a security policy, all\n   entries in the table belonging to a particular user (or\n   group) will have the same value for this initial index.\n   For a given user's entries in a particular table, the\n   object identifiers for the information in these entries\n   will have the same subidentifiers (except for the 'column'\n   subidentifier) up to the end of the encoded owner index.\n   To configure VACM to permit access to this portion of the\n   table, one would create vacmViewTreeFamilyTable entries\n   with the value of vacmViewTreeFamilySubtree including\n   the owner index portion, and vacmViewTreeFamilyMask\n   'wildcarding' the column subidentifier.  More elaborate\n   configurations are possible.\"\n::= { pingCtlEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlTestName OBJECT-TYPE\n   SYNTAX      SnmpAdminString (SIZE(0..32))\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"The name of the ping test.  This is locally unique, within\n       the scope of a pingCtlOwnerIndex.\"\n   ::= { pingCtlEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlTargetAddressType OBJECT-TYPE\n   SYNTAX      InetAddressType\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the type of host address to be used at a remote\n       host for performing a ping operation.\"\n   DEFVAL { unknown }\n   ::= { pingCtlEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlTargetAddress OBJECT-TYPE",
      "zh-CHS": "pingCtlTargetAddress对象类型"
    },
    {
      "indent": 7,
      "text": "SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"Specifies the host address to be used at a remote host for performing a ping operation. The host address type is determined by the value of the corresponding pingCtlTargetAddressType.",
      "zh-CHS": "语法InetAddress MAX-ACCESS read create STATUS current DESCRIPTION“指定要在远程主机上用于执行ping操作的主机地址。主机地址类型由相应的pingCtlTargetAddressType的值确定。"
    },
    {
      "indent": 7,
      "text": "    A value for this object MUST be set prior to transitioning\n    its corresponding pingCtlEntry to active(1) via\n    pingCtlRowStatus.\"\nDEFVAL { ''H }\n::= { pingCtlEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlDataSize OBJECT-TYPE SYNTAX Unsigned32 (0..65507) UNITS \"octets\" MAX-ACCESS read-create STATUS current DESCRIPTION \"Specifies the size of the data portion to be transmitted in a ping operation, in octets. Whether this value can be applied depends on the selected implementation method for performing a ping operation, indicated by pingCtlType in the same conceptual row. If the method used allows applying the value contained",
      "zh-CHS": "pingCtlDataSize对象类型语法无符号32（0..65507）单位“八位字节”最大访问读取创建状态当前说明指定在ping操作中要传输的数据部分的大小，以八位字节为单位。是否可以应用此值取决于执行ping操作所选的实现方法，由同一概念行中的pingCtlType指示。如果使用的方法允许应用包含的值"
    },
    {
      "indent": 11,
      "text": "in this object, then it MUST be applied. If the specified size is not appropriate for the chosen ping method, the implementation SHOULD use whatever size (appropriate to the method) is closest to the specified size.",
      "zh-CHS": "在此对象中，则必须应用它。如果指定的大小不适合所选的ping方法，则实现应使用最接近指定大小的大小（适合该方法）。"
    },
    {
      "indent": 7,
      "text": "    The maximum value for this object was computed by\n    subtracting the smallest possible IP header size of\n    20 octets (IPv4 header with no options) and the UDP\n    header size of 8 octets from the maximum IP packet size.\n    An IP packet has a maximum size of 65535 octets\n    (excluding IPv6 Jumbograms).\"\nDEFVAL { 0 }\n::= { pingCtlEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlTimeOut OBJECT-TYPE SYNTAX Unsigned32 (1..60) UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"Specifies the time-out value, in seconds, for a remote ping operation.\" DEFVAL { 3 }",
      "zh-CHS": "pingCtlTimeOut对象类型语法Unsigned32（1..60）单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“指定远程ping操作的超时值（以秒为单位）。”"
    },
    {
      "indent": 7,
      "text": "::= { pingCtlEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlProbeCount OBJECT-TYPE\n   SYNTAX      Unsigned32 (1..15)\n   UNITS       \"probes\"\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the number of times to perform a ping\n       operation at a remote host as part of a single ping test.\"\n   DEFVAL { 1 }\n   ::= { pingCtlEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlAdminStatus OBJECT-TYPE\n   SYNTAX      INTEGER {\n                         enabled(1), -- test should be started\n                         disabled(2) -- test should be stopped\n                       }\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Reflects the desired state that a pingCtlEntry should be\n       in:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "enabled(1) - Attempt to activate the test as defined by this pingCtlEntry. disabled(2) - Deactivate the test as defined by this pingCtlEntry.",
      "zh-CHS": "已启用（1）-尝试激活此条目定义的测试。禁用（2）-根据此条目定义停用测试。"
    },
    {
      "indent": 7,
      "text": "    Refer to the corresponding pingResultsOperStatus to\n    determine the operational state of the test defined by\n    this entry.\"\n DEFVAL { disabled }\n::= { pingCtlEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlDataFill  OBJECT-TYPE\n   SYNTAX      OCTET STRING (SIZE(0..1024))\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"The content of this object is used together with the\n       corresponding pingCtlDataSize value to determine how to\n       fill the data portion of a probe packet.  The option of\n       selecting a data fill pattern can be useful when links\n       are compressed or have data pattern sensitivities.  The\n       contents of pingCtlDataFill should be repeated in a ping\n       packet when the size of the data portion of the ping\n       packet is greater than the size of pingCtlDataFill.\"\n   DEFVAL { '00'H }\n   ::= { pingCtlEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlFrequency OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The number of seconds to wait before repeating a ping test as defined by the value of the various objects in the corresponding row.",
      "zh-CHS": "pingCtlFrequency对象类型语法Unsigned32单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“重复ping测试之前等待的秒数，由相应行中各种对象的值定义。"
    },
    {
      "indent": 11,
      "text": "A single ping test consists of a series of ping probes. The number of probes is determined by the value of the corresponding pingCtlProbeCount object. After a single test is completed the number of seconds as defined by the value of pingCtlFrequency MUST elapse before the next ping test is started.",
      "zh-CHS": "单个ping测试由一系列ping探针组成。探测的数量由相应pingCtlProbeCount对象的值确定。完成单个测试后，在开始下一个ping测试之前，pingCtlFrequency值定义的秒数必须经过。"
    },
    {
      "indent": 7,
      "text": " A value of 0 for this object implies that the test as defined by the corresponding entry will not be repeated.\" DEFVAL { 0 }",
      "zh-CHS": "此对象的值为0表示将不会重复由相应项定义的测试。“deffal{0}"
    },
    {
      "indent": 7,
      "text": "::= { pingCtlEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlMaxRows OBJECT-TYPE SYNTAX Unsigned32 UNITS \"rows\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The maximum number of corresponding entries allowed in the pingProbeHistoryTable. An implementation of this MIB will remove the oldest corresponding entry in the pingProbeHistoryTable to allow the addition of an new entry once the number of corresponding rows in the pingProbeHistoryTable reaches this value.",
      "zh-CHS": "pingCtlMaxRows对象类型语法无符号32个单位“行”最大访问读取创建状态当前描述“pingProbeHistoryTable中允许的最大对应条目数。此MIB的实现将删除pingProbeHistoryTable中最旧的对应条目，以便在pingProbeHistoryTable中的对应行数达到此值时，允许添加新条目。"
    },
    {
      "indent": 11,
      "text": "Old entries are not removed when a new test is started. Entries are added to the pingProbeHistoryTable until pingCtlMaxRows is reached before entries begin to be removed.",
      "zh-CHS": "启动新测试时，不会删除旧条目。条目被添加到pingProbeHistoryTable中，直到到达pingCtlMaxRows后才开始删除条目。"
    },
    {
      "indent": 7,
      "text": "    A value of 0 for this object disables creation of\n    pingProbeHistoryTable entries.\"\nDEFVAL      { 50 }\n::= { pingCtlEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current",
      "zh-CHS": "pingCtlStorageType对象类型语法StorageType MAX-ACCESS读取创建状态当前"
    },
    {
      "indent": 7,
      "text": "DESCRIPTION\n    \"The storage type for this conceptual row.\n    Conceptual rows having the value 'permanent' need not\n    allow write-access to any columnar objects in the row.\"\nDEFVAL { nonVolatile }\n::= { pingCtlEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlTrapGeneration OBJECT-TYPE\n   SYNTAX      BITS {\n                  probeFailure(0),\n                  testFailure(1),\n                  testCompletion(2)\n                 }\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"The value of this object determines when and whether\n       to generate a notification for this entry:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "probeFailure(0) - Generate a pingProbeFailed notification subject to the value of pingCtlTrapProbeFailureFilter. The object pingCtlTrapProbeFailureFilter can be used to specify the number of consecutive probe failures that are required before a pingProbeFailed notification can be generated. testFailure(1) - Generate a pingTestFailed notification. In this instance the object pingCtlTrapTestFailureFilter can be used to determine the number of probe failures that signal when a test fails. testCompletion(2) - Generate a pingTestCompleted notification.",
      "zh-CHS": "probeFailure（0）-根据PingCtlTrappProbeFailureFilter的值生成pingProbeFailed通知。对象pingCtlTrapProbeFailureFilter可用于指定生成pingProbeFailed通知之前所需的连续探测失败数。testFailure（1）-生成pingTestFailed通知。在本例中，对象pingCtlTrapTestFailureFilter可用于确定测试失败时发出信号的探针故障数。testCompletion（2）-生成pingTestCompleted通知。"
    },
    {
      "indent": 7,
      "text": "    By default, no bits are set, indicating that\n    none of the above options is selected.\"\nDEFVAL { {} }  -- no bits set.\n::= { pingCtlEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlTrapProbeFailureFilter OBJECT-TYPE SYNTAX Unsigned32 (0..15) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is used to determine when to generate a pingProbeFailed NOTIFICATION.",
      "zh-CHS": "pingCtlTrapProbeFailureFilter对象类型语法Unsigned32（0..15）MAX-ACCESS read create STATUS current DESCRIPTION“此对象的值用于确定何时生成pingProbeFailed通知。"
    },
    {
      "indent": 11,
      "text": "Setting BIT probeFailure(0) of object pingCtlTrapGeneration to '1' implies that a pingProbeFailed NOTIFICATION is generated only when",
      "zh-CHS": "将对象pingCtlTrapGeneration的位probeFailure（0）设置为“1”意味着仅当"
    },
    {
      "indent": 7,
      "text": "    a number of consecutive ping probes equal to the\n    value of pingCtlTrapProbeFailureFilter fail within\n    a given ping test.  After triggering the notification,\n    the probe failure counter is reset to zero.\"\nDEFVAL { 1 }\n::= { pingCtlEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlTrapTestFailureFilter OBJECT-TYPE SYNTAX Unsigned32 (0..15) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is used to determine when to generate a pingTestFailed NOTIFICATION.",
      "zh-CHS": "pingCtlTrapTestFailureFilter对象类型语法Unsigned32（0..15）MAX-ACCESS read create STATUS current DESCRIPTION“此对象的值用于确定何时生成pingTestFailed通知。"
    },
    {
      "indent": 11,
      "text": "Setting BIT testFailure(1) of object",
      "zh-CHS": "设置对象的位testFailure（1）"
    },
    {
      "indent": 7,
      "text": "    pingCtlTrapGeneration to '1' implies that a\n    pingTestFailed NOTIFICATION is generated only when\n    a number of consecutive ping tests equal to the\n    value of pingCtlTrapProbeFailureFilter fail.\n    After triggering the notification, the test failure\n    counter is reset to zero.\"\nDEFVAL { 1 }\n::= { pingCtlEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlType OBJECT-TYPE SYNTAX OBJECT IDENTIFIER MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is used either to report or to select the implementation method to be used for calculating a ping response time. The value of this object MAY be selected from pingImplementationTypeDomains.",
      "zh-CHS": "pingCtlType对象类型语法对象标识符MAX-ACCESS读取创建状态当前描述“此对象的值用于报告或选择用于计算ping响应时间的实现方法。此对象的值可以从pingImplementationTypeDomains中选择。"
    },
    {
      "indent": 7,
      "text": "    Additional implementation types SHOULD be allocated as\n    required by implementers of the DISMAN-PING-MIB under\n    their enterprise-specific registration point and not\n    beneath pingImplementationTypeDomains.\"\nDEFVAL { pingIcmpEcho }\n::= { pingCtlEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlDescr OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-create STATUS current DESCRIPTION \"The purpose of this object is to provide a descriptive name of the remote ping test.\" DEFVAL { ''H }",
      "zh-CHS": "pingCtlDescr对象类型语法SNMPAdministring MAX-ACCESS read create STATUS current DESCRIPTION“此对象的目的是提供远程ping测试的描述性名称。”DEFVAL{“H}"
    },
    {
      "indent": 7,
      "text": "::= { pingCtlEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlSourceAddressType OBJECT-TYPE\n   SYNTAX      InetAddressType\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the type of the source address,\n       pingCtlSourceAddress, to be used at a remote host\n       when a ping operation is performed.\"\n   DEFVAL { unknown }\n   ::= { pingCtlEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "pingCtlSourceAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"Use the specified IP address (which must be given in numeric form, not as a hostname) as the source address in outgoing probe packets. On hosts with more than one IP address, this option can be used to select the address to be used. If the IP address is not one of this machine's interface addresses, an error is returned and nothing is sent. A zero-length octet string value for this object disables source address specification.",
      "zh-CHS": "pingCtlSourceAddress对象类型语法InetAddress MAX-ACCESS read create STATUS current DESCRIPTION“使用指定的IP地址（必须以数字形式提供，而不是作为主机名提供）作为传出探测数据包中的源地址。在具有多个IP地址的主机上，此选项可用于选择要使用的地址。如果IP地址不是此计算机的接口地址之一，则返回错误且不发送任何内容。此对象的零长度八位字节字符串值将禁用源地址规范。"
    },
    {
      "indent": 7,
      "text": "    The address type (InetAddressType) that relates to\n    this object is specified by the corresponding value\n    of pingCtlSourceAddressType.\"\nDEFVAL { ''H }\n::= { pingCtlEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlIfIndex OBJECT-TYPE\n   SYNTAX      InterfaceIndexOrZero\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Setting this object to an interface's ifIndex prior\n       to starting a remote ping operation directs\n       the ping probes to be transmitted over the\n       specified interface.  A value of zero for this object\n       means that this option is not enabled.\"\n   DEFVAL { 0 }\n   ::= { pingCtlEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlByPassRouteTable OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-create STATUS current",
      "zh-CHS": "pingCtlByPassRouteTable对象类型语法TruthValue MAX-ACCESS读取创建状态当前"
    },
    {
      "indent": 7,
      "text": "DESCRIPTION \"The purpose of this object is to enable optional bypassing the route table. If enabled, the remote host will bypass the normal routing tables and send directly to a host on an attached network. If the host is not on a directly attached network, an error is returned. This option can be used to perform the ping operation to a local host through an interface that has no route defined (e.g., after the interface was dropped by the routing daemon at the host).\"",
      "zh-CHS": "描述“此对象的目的是启用可选的绕过路由表。如果启用，远程主机将绕过正常路由表，直接发送到连接网络上的主机。如果主机不在直接连接的网络上，则返回错误。此选项可用于通过未定义路由的接口对本地主机执行ping操作（例如，在主机上的路由守护程序删除该接口之后）。”"
    },
    {
      "indent": 7,
      "text": "DEFVAL { false }\n::= { pingCtlEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlDSField OBJECT-TYPE SYNTAX Unsigned32 (0..255) MAX-ACCESS read-create STATUS current DESCRIPTION \"Specifies the value to store in the Type of Service (TOS) octet in the IPv4 header or in the Traffic Class octet in the IPv6 header, respectively, of the IP packet used to encapsulate the ping probe.",
      "zh-CHS": "PingCtldField对象类型语法Unsigned32（0..255）MAX-ACCESS read create STATUS current DESCRIPTION“指定分别存储在用于封装ping探测的IP数据包的IPv4报头中的服务类型（TOS）八位字节或IPv6报头中的流量类八位字节中的值。"
    },
    {
      "indent": 11,
      "text": "The octet to be set in the IP header contains the Differentiated Services (DS) Field in the six most significant bits.",
      "zh-CHS": "要在IP报头中设置的八位字节在六个最高有效位中包含区分服务（DS）字段。"
    },
    {
      "indent": 7,
      "text": "    This option can be used to determine what effect an\n    explicit DS Field setting has on a ping response.\n    Not all values are legal or meaningful.  A value of 0\n    means that the function represented by this option is\n    not supported.  DS Field usage is often not supported\n    by IP implementations, and not all values are supported.\n    Refer to RFC 2474 and RFC 3260 for guidance on usage of\n    this field.\"\nREFERENCE\n    \"Refer to RFC 1812 for the definition of the IPv4 TOS\n    octet and to RFC 2460 for the definition of the IPv6\n    Traffic Class octet.  Refer to RFC 2474 and RFC 3260\n    for the definition of the Differentiated Services Field.\"\nDEFVAL { 0 }\n::= { pingCtlEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted in the pingCtlTable. Deletion of an entry in this table results in the deletion of all corresponding (same pingCtlOwnerIndex and pingCtlTestName index values) pingResultsTable and pingProbeHistoryTable entries.",
      "zh-CHS": "pingCtlRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此对象允许在pingCtlTable中创建和删除条目。删除此表中的条目会导致删除所有相应的（相同的pingCtlOwnerIndex和pingCtlTestName索引值）pingResultsTable和pingProbeHistoryTable条目。"
    },
    {
      "indent": 11,
      "text": "A value MUST be specified for pingCtlTargetAddress prior to acceptance of a transition to active(1) state.",
      "zh-CHS": "在接受转换到活动（1）状态之前，必须为pingCtlTargetAddress指定一个值。"
    },
    {
      "indent": 11,
      "text": "When a value for pingCtlTargetAddress is set,",
      "zh-CHS": "设置pingCtlTargetAddress的值时，"
    },
    {
      "indent": 11,
      "text": "the value of object pingCtlRowStatus changes from notReady(3) to notInService(2).",
      "zh-CHS": "对象pingCtlRowStatus的值从notReady（3）更改为notInService（2）。"
    },
    {
      "indent": 11,
      "text": "Activation of a remote ping operation is controlled via pingCtlAdminStatus, not by changing this object's value to active(1).",
      "zh-CHS": "远程ping操作的激活是通过pingCtlAdminStatus控制的，而不是通过将此对象的值更改为active（1）。"
    },
    {
      "indent": 11,
      "text": "Transitions in and out of active(1) state are not allowed while an entry's pingResultsOperStatus is active(1), with the exception that deletion of an entry in this table by setting its RowStatus object to destroy(6) will stop an active ping operation.",
      "zh-CHS": "当条目的PingResultsOperatStatus处于活动状态（1）时，不允许进入和退出活动（1）状态，除非通过将其RowStatus对象设置为destroy（6）删除此表中的条目将停止活动的ping操作。"
    },
    {
      "indent": 7,
      "text": "    The operational state of a ping operation\n    can be determined by examination of its\n    pingResultsOperStatus object.\"\nREFERENCE\n    \"See definition of RowStatus in RFC 2579, 'Textual\n    Conventions for SMIv2.'\"\n::= { pingCtlEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- Ping Results Table",
      "zh-CHS": "--Ping结果表"
    },
    {
      "indent": 4,
      "text": "pingResultsTable OBJECT-TYPE SYNTAX SEQUENCE OF PingResultsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines the Ping Results Table for providing the capability of performing ping operations at a remote host. The results of these operations are stored in the pingResultsTable and the pingProbeHistoryTable.",
      "zh-CHS": "pingResultsTable PingResultsEntry MAX-ACCESS不可访问状态当前描述的对象类型语法序列“定义Ping结果表，用于提供在远程主机上执行Ping操作的功能。这些操作的结果存储在pingResultsTable和pingProbeHistoryTable中。"
    },
    {
      "indent": 11,
      "text": "An entry is added to the pingResultsTable when an pingCtlEntry is started by successful transition of its pingCtlAdminStatus object to enabled(1).",
      "zh-CHS": "当通过将pingCtlAdminStatus对象成功转换为enabled（1）启动pingCtlEntry时，将向pingResultsTable添加一个条目。"
    },
    {
      "indent": 11,
      "text": "If the object pingCtlAdminStatus already has the value enabled(1), and if the corresponding pingResultsOperStatus object has the value completed(3), then successfully writing enabled(1) to object pingCtlAdminStatus re-initializes the already existing entry in the pingResultsTable. The values of objects in the re-initialized entry are the same as the values of objects in a new entry would be.",
      "zh-CHS": "如果对象pingCtlAdminStatus的值已启用（1），并且对应的PingResultsOperatStatus对象的值已完成（3），则成功将启用（1）写入对象pingCtlAdminStatus将重新初始化pingResultsTable中已存在的条目。重新初始化的条目中的对象值与新条目中的对象值相同。"
    },
    {
      "indent": 11,
      "text": "An entry is removed from the pingResultsTable when its corresponding pingCtlEntry is deleted.\"",
      "zh-CHS": "删除相应的pingCtlEntry时，将从pingResultsTable中删除条目。“"
    },
    {
      "indent": 6,
      "text": "::= { pingObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingResultsEntry OBJECT-TYPE\n   SYNTAX      PingResultsEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines an entry in the pingResultsTable.  The\n       pingResultsTable has the same indexing as the\n       pingCtlTable so that a pingResultsEntry\n       corresponds to the pingCtlEntry that caused it to\n       be created.\"\n   INDEX {\n            pingCtlOwnerIndex,\n            pingCtlTestName\n         }\n   ::= { pingResultsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "PingResultsEntry ::=\n   SEQUENCE {\n       pingResultsOperStatus          INTEGER,\n       pingResultsIpTargetAddressType InetAddressType,\n       pingResultsIpTargetAddress     InetAddress,\n       pingResultsMinRtt              Unsigned32,\n       pingResultsMaxRtt              Unsigned32,\n       pingResultsAverageRtt          Unsigned32,\n       pingResultsProbeResponses      Gauge32,\n       pingResultsSentProbes          Gauge32,\n       pingResultsRttSumOfSquares     Unsigned32,\n       pingResultsLastGoodProbe       DateAndTime\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingResultsOperStatus OBJECT-TYPE\n   SYNTAX      INTEGER {\n                         enabled(1),   -- test is in progress\n                         disabled(2),  -- test has stopped\n                         completed(3)  -- test is completed\n                       }\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Reflects the operational state of a pingCtlEntry:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "       enabled(1)    - Test is active.\n       disabled(2)   - Test has stopped.\n       completed(3)  - Test is completed.\"\n::= { pingResultsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingResultsIpTargetAddressType OBJECT-TYPE\n   SYNTAX      InetAddressType\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"This object indicates the type of address stored\n       in the corresponding pingResultsIpTargetAddress\n       object.\"\n   DEFVAL { unknown }\n   ::= { pingResultsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingResultsIpTargetAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reports the IP address associated with a pingCtlTargetAddress value when the destination address is specified as a DNS name. The value of this object should be a zero-length octet string when a DNS name is not specified or when a specified DNS name fails to resolve.",
      "zh-CHS": "pingResultsIpTargetAddress对象类型语法InetAddress MAX-ACCESS只读状态当前说明“当目标地址指定为DNS名称时，此对象报告与pingCtlTargetAddress值关联的IP地址。当未指定DNS名称或指定的DNS名称解析失败时，此对象的值应为零长度八位字符串。"
    },
    {
      "indent": 7,
      "text": "    The address type (InetAddressType) that relates to\n    this object is specified by the corresponding value\n    of pingResultsIpTargetAddressType.\"\nDEFVAL { ''H }\n::= { pingResultsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingResultsMinRtt OBJECT-TYPE\n   SYNTAX      Unsigned32\n   UNITS       \"milliseconds\"\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The minimum ping round-trip-time (RTT) received.  A value\n       of 0 for this object implies that no RTT has been received.\"\n   ::= { pingResultsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingResultsMaxRtt OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "pingResultsMaxRtt对象类型语法无符号32单位“毫秒”最大访问只读状态当前说明"
    },
    {
      "indent": 11,
      "text": "\"The maximum ping round-trip-time (RTT) received. A value of 0 for this object implies that no RTT has been received.\"",
      "zh-CHS": "“收到的最大ping往返时间（RTT）。此对象的值为0表示未收到RTT。”"
    },
    {
      "indent": 7,
      "text": "::= { pingResultsEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "pingResultsAverageRtt OBJECT-TYPE\n  SYNTAX      Unsigned32\n  UNITS       \"milliseconds\"\n  MAX-ACCESS  read-only\n  STATUS      current\n  DESCRIPTION\n      \"The current average ping round-trip-time (RTT).\"\n  ::= { pingResultsEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "pingResultsProbeResponses OBJECT-TYPE\n  SYNTAX      Gauge32\n  UNITS       \"responses\"\n  MAX-ACCESS  read-only\n  STATUS      current\n  DESCRIPTION\n      \"Number of responses received for the corresponding\n      pingCtlEntry and pingResultsEntry.  The value of this object\n      MUST be reported as 0 when no probe responses have been\n      received.\"\n  ::= { pingResultsEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "pingResultsSentProbes OBJECT-TYPE\n  SYNTAX      Gauge32\n  UNITS       \"probes\"\n  MAX-ACCESS  read-only\n  STATUS      current\n  DESCRIPTION\n      \"The value of this object reflects the number of probes sent\n      for the corresponding pingCtlEntry and pingResultsEntry.\n      The value of this object MUST be reported as 0 when no probes\n      have been sent.\"\n  ::= { pingResultsEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "pingResultsRttSumOfSquares OBJECT-TYPE\n  SYNTAX      Unsigned32\n  UNITS       \"milliseconds\"\n  MAX-ACCESS  read-only\n  STATUS      current\n  DESCRIPTION\n      \"This object contains the sum of the squares for all ping\n      responses received.  Its purpose is to enable standard\n      deviation calculation.  The value of this object MUST\n      be reported as 0 when no ping responses have been\n      received.\"\n  ::= { pingResultsEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingResultsLastGoodProbe OBJECT-TYPE\n   SYNTAX      DateAndTime\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Date and time when the last response was received for\n       a probe.\"\n   ::= { pingResultsEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Ping Probe History Table",
      "zh-CHS": "--Ping探针历史记录表"
    },
    {
      "indent": 4,
      "text": "pingProbeHistoryTable OBJECT-TYPE SYNTAX SEQUENCE OF PingProbeHistoryEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines a table for storing the results of ping operations. The number of entries in this table is limited per entry in the pingCtlTable by the value of the corresponding pingCtlMaxRows object.",
      "zh-CHS": "pingProbeHistoryTable对象类型PingProbeHistoryEntry MAX-ACCESS不可访问状态当前描述”的语法序列定义了一个用于存储ping操作结果的表。此表中的条目数受pingCtlMaxRows对象对应值的限制。"
    },
    {
      "indent": 11,
      "text": "An entry in this table is created when the result of a ping probe is determined. The initial 2 instance identifier index values identify the pingCtlEntry that a probe result (pingProbeHistoryEntry) belongs to. An entry is removed from this table when its corresponding pingCtlEntry is deleted.",
      "zh-CHS": "此表中的一个条目是在确定ping探测结果时创建的。初始的2个实例标识符索引值标识探测结果（pingProbeHistoryEntry）所属的pingCtlEntry。删除相应的pingCtlEntry时，将从此表中删除条目。"
    },
    {
      "indent": 6,
      "text": "     An implementation of this MIB will remove the oldest\n     entry in the pingProbeHistoryTable of the\n     corresponding entry in the pingCtlTable to allow\n     the addition of an new entry once the number of rows\n     in the pingProbeHistoryTable reaches the value\n     specified by pingCtlMaxRows for the corresponding\n     entry in the pingCtlTable.\"\n::= { pingObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingProbeHistoryEntry OBJECT-TYPE SYNTAX PingProbeHistoryEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines an entry in the pingProbeHistoryTable. The first two index elements identify the pingCtlEntry that a pingProbeHistoryEntry belongs to. The third index element selects a single probe result.\" INDEX {",
      "zh-CHS": "pingProbeHistoryEntry对象类型语法pingProbeHistoryEntry MAX-ACCESS不可访问状态当前描述“定义pingProbeHistoryTable中的条目。前两个索引元素标识pingProbeHistoryEntry所属的pingCtlEntry。第三个索引元素选择单个探测结果。”索引{"
    },
    {
      "indent": 7,
      "text": "         pingCtlOwnerIndex,\n         pingCtlTestName,\n         pingProbeHistoryIndex\n       }\n::= { pingProbeHistoryTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "PingProbeHistoryEntry ::=\n   SEQUENCE {\n       pingProbeHistoryIndex         Unsigned32,\n       pingProbeHistoryResponse      Unsigned32,\n       pingProbeHistoryStatus        OperationResponseStatus,\n       pingProbeHistoryLastRC        Integer32,\n       pingProbeHistoryTime          DateAndTime\n   }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingProbeHistoryIndex OBJECT-TYPE SYNTAX Unsigned32 (1..'ffffffff'h) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An entry in this table is created when the result of a ping probe is determined. The initial 2 instance identifier index values identify the pingCtlEntry that a probe result (pingProbeHistoryEntry) belongs to.",
      "zh-CHS": "pingProbeHistoryIndex对象类型语法Unsigned32（1..'ffffffff'h）MAX-ACCESS不可访问状态当前描述“当确定ping探测的结果时，将创建此表中的一个条目。初始的2个实例标识符索引值标识探测结果（pingProbeHistoryEntry）所属的pingCtlEntry。"
    },
    {
      "indent": 7,
      "text": "    An implementation MUST start assigning\n    pingProbeHistoryIndex values at 1 and wrap after\n    exceeding the maximum possible value as defined by\n    the limit of this object ('ffffffff'h).\"\n::= { pingProbeHistoryEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingProbeHistoryResponse OBJECT-TYPE\n   SYNTAX      Unsigned32\n   UNITS       \"milliseconds\"\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The amount of time measured in milliseconds from when\n       a probe was sent to when its response was received or\n       when it timed out.  The value of this object is reported\n       as 0 when it is not possible to transmit a probe.\"\n   ::= { pingProbeHistoryEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingProbeHistoryStatus OBJECT-TYPE SYNTAX OperationResponseStatus MAX-ACCESS read-only STATUS current",
      "zh-CHS": "pingProbeHistoryStatus对象类型语法操作ResponseStatus MAX-ACCESS只读状态当前"
    },
    {
      "indent": 7,
      "text": "DESCRIPTION\n    \"The result of a particular probe done by a remote host.\"\n::= { pingProbeHistoryEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingProbeHistoryLastRC        OBJECT-TYPE\n   SYNTAX      Integer32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The last implementation-method-specific reply code received.\n       If the ICMP Echo capability is being used, then a successful\n       probe ends when an ICMP response is received that contains\n       the code ICMP_ECHOREPLY(0).  The ICMP codes are maintained\n       by IANA.  Standardized ICMP codes are listed at\n       http://www.iana.org/assignments/icmp-parameters.\n       The ICMPv6 codes are listed at\n       http://www.iana.org/assignments/icmpv6-parameters.\"\n   ::= { pingProbeHistoryEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingProbeHistoryTime OBJECT-TYPE\n   SYNTAX      DateAndTime\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Timestamp for when this probe result was determined.\"\n   ::= { pingProbeHistoryEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Notification Definition section",
      "zh-CHS": "--通知定义部分"
    },
    {
      "indent": 4,
      "text": "pingProbeFailed NOTIFICATION-TYPE\n     OBJECTS {\n       pingCtlTargetAddressType,\n       pingCtlTargetAddress,\n       pingResultsOperStatus,\n       pingResultsIpTargetAddressType,\n       pingResultsIpTargetAddress,\n       pingResultsMinRtt,\n       pingResultsMaxRtt,\n       pingResultsAverageRtt,\n       pingResultsProbeResponses,\n       pingResultsSentProbes,\n       pingResultsRttSumOfSquares,\n       pingResultsLastGoodProbe\n     }\n     STATUS  current\n     DESCRIPTION\n         \"Generated when a probe failure is detected, when the",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "corresponding pingCtlTrapGeneration object is set to probeFailure(0), subject to the value of pingCtlTrapProbeFailureFilter. The object pingCtlTrapProbeFailureFilter can be used to specify the number of consecutive probe failures that are required before this notification can be generated.\"",
      "zh-CHS": "对应的pingCtlTrapGeneration对象设置为ProbeFiure（0），取决于pingCtlTrapProbeFailureFilter的值。对象pingCtlTrapProbeFailureFilter可用于指定生成此通知之前所需的连续探测失败数。”"
    },
    {
      "indent": 9,
      "text": "::= { pingNotifications 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingTestFailed NOTIFICATION-TYPE\n     OBJECTS {\n       pingCtlTargetAddressType,\n       pingCtlTargetAddress,\n       pingResultsOperStatus,\n       pingResultsIpTargetAddressType,\n       pingResultsIpTargetAddress,\n       pingResultsMinRtt,\n       pingResultsMaxRtt,\n       pingResultsAverageRtt,\n       pingResultsProbeResponses,\n       pingResultsSentProbes,\n       pingResultsRttSumOfSquares,\n       pingResultsLastGoodProbe\n     }\n     STATUS  current\n     DESCRIPTION\n         \"Generated when a ping test is determined to have failed,\n         when the corresponding pingCtlTrapGeneration object is\n         set to testFailure(1).  In this instance,\n         pingCtlTrapTestFailureFilter should specify the number of\n         probes in a test required to have failed in order to\n         consider the test failed.\"\n     ::= { pingNotifications 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingTestCompleted NOTIFICATION-TYPE OBJECTS { pingCtlTargetAddressType, pingCtlTargetAddress, pingResultsOperStatus, pingResultsIpTargetAddressType, pingResultsIpTargetAddress, pingResultsMinRtt, pingResultsMaxRtt, pingResultsAverageRtt, pingResultsProbeResponses, pingResultsSentProbes, pingResultsRttSumOfSquares, pingResultsLastGoodProbe",
      "zh-CHS": "pingTestCompleted通知类型对象{PingCttTargetAddressType，PingCttTargetAddress，PingResultsOperatStatus，pingResultsIpTargetAddressType，pingResultsIpTargetAddress，pingResultsMinRtt，pingResultsMaxRtt，pingResultsAverageRtt，PingResultsProberResponse，PingResultsSentProbesProbesSquares，pingResultsLastGoodProbe"
    },
    {
      "indent": 9,
      "text": "}\nSTATUS  current\nDESCRIPTION\n    \"Generated at the completion of a ping test when the\n    corresponding pingCtlTrapGeneration object has the\n    testCompletion(2) bit set.\"\n::= { pingNotifications 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Conformance information",
      "zh-CHS": "--一致性信息"
    },
    {
      "indent": 4,
      "text": "-- Compliance statements",
      "zh-CHS": "--合规声明"
    },
    {
      "indent": 4,
      "text": "pingCompliances OBJECT IDENTIFIER ::= { pingConformance 1 }\npingGroups      OBJECT IDENTIFIER ::= { pingConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Compliance statements",
      "zh-CHS": "--合规声明"
    },
    {
      "indent": 4,
      "text": "pingFullCompliance MODULE-COMPLIANCE\n   STATUS  current\n   DESCRIPTION\n           \"The compliance statement for SNMP entities that\n           fully implement the DISMAN-PING-MIB.\"\n   MODULE  -- this module\n       MANDATORY-GROUPS {\n                           pingMinimumGroup,\n                           pingCtlRowStatusGroup,\n                           pingHistoryGroup,\n                           pingNotificationsGroup\n                         }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "OBJECT pingMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "对象pingMaxConcurrentRequests最小访问只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象pingCtlStorageType MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. In addition, the only value that MUST be supported by an implementation is pingIcmpEcho.\"",
      "zh-CHS": "对象pingCtlType MIN-ACCESS只读说明“不需要写访问权限。此外，实现必须支持的唯一值是pingIcmpEcho。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlSourceAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "对象pingCtlSourceAddressType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}MIN-ACCESS只读说明“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持ipv4和ipv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlSourceAddress SYNTAX InetAddress (SIZE(0|4|16)) MIN-ACCESS read-only",
      "zh-CHS": "对象pingCtlSourceAddress语法InetAddress（大小（0 | 4 | 16））最小访问只读"
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "DESCRIPTION“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持IPv4和IPv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlIfIndex MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 means that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT PingCtliIndex MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlByPassRouteTable MIN-ACCESS read-only DESCRIPTION \"Write access to this object is not required by implementations that are not capable of its implementation. The function represented by this object is implementable if the setsockopt SOL_SOCKET SO_DONTROUTE option is supported.\"",
      "zh-CHS": "OBJECT pingCtlByPassRouteTable MIN-ACCESS只读描述“无法实现此对象的实现不需要对此对象的写访问权限。如果支持setsockopt SOL_SOCKET SO_DONTROUTE选项，则可以实现此对象表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlDSField MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 means that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT PingCtldField MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingResultsIpTargetAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is only required to",
      "zh-CHS": "对象PingResultSiptTargetAddressType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现只需要"
    },
    {
      "indent": 15,
      "text": "support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "支持IPv4和IPv6地址。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingResultsIpTargetAddress SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation is only required to support IPv4 and globally unique IPv6 addresses.\"",
      "zh-CHS": "对象PingResultSiptTargetAddress语法InetAddress（大小（0 | 4 | 16））说明“仅支持IPv4和全局唯一IPv6地址才需要实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingResultsLastGoodProbe DESCRIPTION \"This object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "OBJECT pingResultsLastGoodProbe DESCRIPTION“对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。”"
    },
    {
      "indent": 7,
      "text": "    OBJECT pingProbeHistoryTime\n    DESCRIPTION\n        \"This object is mandatory for implementations that have\n        access to a system clock and that are capable of setting\n        the values for DateAndTime objects.  It is RECOMMENDED\n        that when this object is not supported its values\n        be reported as '0000000000000000'H.\"\n::= { pingCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingMinimumCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The minimum compliance statement for SNMP entities that implement the minimal subset of the DISMAN-PING-MIB. Implementors might choose this subset for small devices with limited resources.\" MODULE -- this module MANDATORY-GROUPS { pingMinimumGroup }",
      "zh-CHS": "pingMinimumCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION“实现DISAN-PING-MIB最小子集的SNMP实体的最小符合性声明。实现者可以为资源有限的小型设备选择此子集。”模块--此模块为必填项-GROUPS{pingMinimumGroup}"
    },
    {
      "indent": 11,
      "text": "GROUP pingCtlRowStatusGroup DESCRIPTION \"A compliant implementation does not have to implement the pingCtlRowStatusGroup.\"",
      "zh-CHS": "GROUP pingCtlRowStatusGroup DESCRIPTION“符合要求的实现不必实现pingCtlRowStatusGroup。”"
    },
    {
      "indent": 11,
      "text": "GROUP pingHistoryGroup DESCRIPTION \"A compliant implementation does not have to implement the pingHistoryGroup.\"",
      "zh-CHS": "GROUP pingHistoryGroup DESCRIPTION“兼容的实现不必实现pingHistoryGroup。”"
    },
    {
      "indent": 11,
      "text": "GROUP pingNotificationsGroup DESCRIPTION \"A compliant implementation does not have to implement",
      "zh-CHS": "GROUP pingNotificationsGroup DESCRIPTION“兼容的实现不必实现"
    },
    {
      "indent": 15,
      "text": "the pingNotificationsGroup.\"",
      "zh-CHS": "pingNotificationsGroup。“"
    },
    {
      "indent": 11,
      "text": "OBJECT pingMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "对象pingMaxConcurrentRequests最小访问只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlDataFill MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "对象pingCtlDataFill MIN-ACCESS只读说明“代理不需要支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlFrequency MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 means that the function represented by this option is not supported.\"",
      "zh-CHS": "对象pingCtlFrequency MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlMaxRows MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If the pingHistoryGroup is not implemented, then write access to this object MUST be disabled, and the object MUST return a value of 0 when retrieved.\"",
      "zh-CHS": "对象pingCtlMaxRows MIN-ACCESS只读说明“不需要写访问权限。如果未实现pingHistoryGroup，则必须禁用对此对象的写访问权限，并且检索对象时必须返回值0。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "zh-CHS": "对象pingCtlStorageType MIN-ACCESS只读说明“不需要写访问。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlTrapGeneration MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If the pingNotificationsGroup is not implemented, then write access to this object MUST be disabled, and the object MUST return a value with no bit set when retrieved. No bit set indicates that not notification is generated.\"",
      "zh-CHS": "对象pingCtlTrapGeneration MIN-ACCESS只读说明“不需要写访问。如果未实现pingNotificationsGroup，则必须禁用对此对象的写访问，并且检索对象时必须返回未设置位的值。未设置位表示未生成通知。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlTrapProbeFailureFilter MIN-ACCESS read-only DESCRIPTION",
      "zh-CHS": "对象pingCtlTrapProbeFailureFilter最小访问只读说明"
    },
    {
      "indent": 15,
      "text": "\"If write access to pingCtlTrapGeneration is not supported, then write access to this object must also not be supported. In this case, return 0 as the value of this object.\"",
      "zh-CHS": "如果不支持对pingCtlTrapGeneration的写入访问，则也必须不支持对此对象的写入访问。在这种情况下，请将0作为此对象的值返回"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlTrapTestFailureFilter MIN-ACCESS read-only DESCRIPTION \"If write access to pingCtlTrapGeneration is not supported, then write access to this object must also not be supported. In this case, return 0 as the value of this object.\"",
      "zh-CHS": "对象pingCtlTrapTestFailureFilter最小访问只读说明“如果不支持对pingCtlTrapGeneration的写入访问，则也必须不支持对此对象的写入访问。在这种情况下，请将0作为此对象的值返回。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. In addition, the only value that MUST be supported by an implementation is pingIcmpEcho.\"",
      "zh-CHS": "对象pingCtlType MIN-ACCESS只读说明“不需要写访问权限。此外，实现必须支持的唯一值是pingIcmpEcho。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlDescr MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "对象pingCtlDescr MIN-ACCESS只读说明“代理不需要支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlSourceAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "对象pingCtlSourceAddressType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}MIN-ACCESS只读说明“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持ipv4和ipv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlSourceAddress SYNTAX InetAddress (SIZE(0|4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "对象pingCtlSourceAddress语法InetAddress（大小（0 | 4 | 16））MIN-ACCESS只读说明“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持IPv4和IPv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlIfIndex MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is",
      "zh-CHS": "对象PingCtliIndex MIN-ACCESS只读说明“不需要写访问。如果需要写访问"
    },
    {
      "indent": 15,
      "text": "not supported, return a 0 as the value of this object. A value of 0 means that the function represented by this option is not supported.\"",
      "zh-CHS": "不支持，返回0作为此对象的值。值为0表示不支持此选项表示的函数。“"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlByPassRouteTable MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return false(2) as the value of this object. A value of false(2) means that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT pingCtlByPassRouteTable MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回false（2）作为此对象的值。false（2）表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlDSField MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 means that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT PingCtldField MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingResultsIpTargetAddressType\nSYNTAX  InetAddressType { unknown(0), ipv4(1), ipv6(2) }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "DESCRIPTION“实现仅需要支持IPv4和IPv6地址。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingResultsIpTargetAddress SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation is only required to support IPv4 and globally unique IPv6 addresses.\"",
      "zh-CHS": "对象PingResultSiptTargetAddress语法InetAddress（大小（0 | 4 | 16））说明“仅支持IPv4和全局唯一IPv6地址才需要实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingResultsLastGoodProbe DESCRIPTION \"This object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "OBJECT pingResultsLastGoodProbe DESCRIPTION“对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingProbeHistoryTime DESCRIPTION \"If the pingHistoryGroup is implemented, then this object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values",
      "zh-CHS": "OBJECT pingProbeHistoryTime DESCRIPTION“如果实现了pingHistoryGroup，那么对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，使用其值"
    },
    {
      "indent": 15,
      "text": "be reported as '0000000000000000'H.\"",
      "zh-CHS": "报告为“0000000000000000”小时。”"
    },
    {
      "indent": 7,
      "text": "::= { pingCompliances 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCompliance MODULE-COMPLIANCE STATUS deprecated DESCRIPTION \"The compliance statement for the DISMAN-PING-MIB. This compliance statement has been deprecated because the group pingGroup and the pingTimeStampGroup have been split and deprecated. The pingFullCompliance statement is semantically identical to the deprecated pingCompliance statement.\"",
      "zh-CHS": "pingCompliance MODULE-COMPLIANCE STATUS已弃用描述“DISMAN-PING-MIB的符合性声明。此符合性声明已弃用，因为组pingGroup和pingTimeStampGroup已拆分并弃用。pingFullCompliance声明在语义上与弃用的pingCompliance声明相同。”"
    },
    {
      "indent": 7,
      "text": "MODULE  -- this module\n    MANDATORY-GROUPS {\n                        pingGroup,\n                        pingNotificationsGroup\n                      }\n    GROUP pingTimeStampGroup\n    DESCRIPTION\n        \"This group is mandatory for implementations that have\n        access to a system clock and that are capable of setting\n        the values for DateAndTime objects.  It is RECOMMENDED\n        that when this group is not supported the values\n        for the objects in this group be reported as\n        '0000000000000000'H.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "OBJECT pingMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "对象pingMaxConcurrentRequests最小访问只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. It is also allowed that implementations support only the volatile StorageType enumeration.\"",
      "zh-CHS": "对象pingCtlStorageType MIN-ACCESS只读说明“不需要写访问权限。还允许实现仅支持volatile StorageType枚举。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. In addition, the only value that MUST be supported by an implementation is pingIcmpEcho.\"",
      "zh-CHS": "对象pingCtlType MIN-ACCESS只读说明“不需要写访问权限。此外，实现必须支持的唯一值是pingIcmpEcho。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlByPassRouteTable MIN-ACCESS read-only DESCRIPTION \"This object is not required by implementations that are not capable of its implementation. The function represented by this object is implementable if the setsockopt SOL_SOCKET SO_DONTROUTE option is supported.\"",
      "zh-CHS": "OBJECT pingCtlByPassRouteTable MIN-ACCESS只读说明“无法实现此对象的实现不需要此对象。如果支持setsockopt SOL_SOCKET SO_DONTROUTE选项，则可实现此对象表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlSourceAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"This object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "对象pingCtlSourceAddressType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}MIN-ACCESS只读说明“无法将发送套接字与源地址绑定的实现不需要此对象。只需要支持ipv4和ipv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlSourceAddress SYNTAX InetAddress (SIZE(0|4|16)) MIN-ACCESS read-only DESCRIPTION \"This object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and globally unique IPv6 addresses.\"",
      "zh-CHS": "对象pingCtlSourceAddress语法InetAddress（大小（0 | 4 | 16））MIN-ACCESS只读说明“无法将发送套接字与源地址绑定的实现不需要此对象。仅支持IPv4和全局唯一IPv6地址的实现才需要此实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlIfIndex MIN-ACCESS read-only DESCRIPTION \"Write access is not required. When write access is not supported, return a 0 as the value of this object. A value of 0 means that the function represented by this option is not supported.\"",
      "zh-CHS": "对象PingCtliIndex MIN-ACCESS只读说明“不需要写访问。当不支持写访问时，返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingCtlDSField MIN-ACCESS read-only DESCRIPTION \"Write access is not required. When write access is not supported, return a 0 as the value of this object. A value of 0 means that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT PingCtldField MIN-ACCESS只读说明“不需要写访问。当不支持写访问时，返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT pingResultsIpTargetAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "对象PingResultSiptTargetAddressType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“仅支持ipv4和ipv6地址才需要实现。”"
    },
    {
      "indent": 7,
      "text": "    OBJECT pingResultsIpTargetAddress\n    SYNTAX  InetAddress (SIZE(0|4|16))\n    DESCRIPTION\n        \"An implementation is only required to\n        support IPv4 and globally unique IPv6 addresses.\"\n::= { pingCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- MIB groupings",
      "zh-CHS": "--MIB分组"
    },
    {
      "indent": 4,
      "text": "pingMinimumGroup OBJECT-GROUP OBJECTS { pingMaxConcurrentRequests, pingCtlTargetAddressType, pingCtlTargetAddress, pingCtlDataSize, pingCtlTimeOut, pingCtlProbeCount, pingCtlAdminStatus, pingCtlDataFill, pingCtlFrequency, pingCtlMaxRows, pingCtlStorageType, pingCtlTrapGeneration, pingCtlTrapProbeFailureFilter, pingCtlTrapTestFailureFilter, pingCtlType, pingCtlDescr,",
      "zh-CHS": "pingMinimumGroup对象组对象{pingMaxConcurrentRequests、pingCtlTargetAddressType、pingCtlTargetAddress、pingCtlDataSize、pingCtlTimeOut、pingCtlProbeCount、pingCtlAdminStatus、pingCtlDataFill、pingCtlFrequency、pingCtlMaxRows、pingCtlStorageType、pingCtlTrapProbeFailureFilter、pingCtlTrapTestFailureFilter、PingCtldDescr、，"
    },
    {
      "indent": 6,
      "text": " pingCtlByPassRouteTable, pingCtlSourceAddressType, pingCtlSourceAddress, pingCtlIfIndex, pingCtlDSField, pingResultsOperStatus, pingResultsIpTargetAddressType, pingResultsIpTargetAddress, pingResultsMinRtt, pingResultsMaxRtt, pingResultsAverageRtt, pingResultsProbeResponses, pingResultsSentProbes, pingResultsRttSumOfSquares, pingResultsLastGoodProbe } STATUS current DESCRIPTION \"The group of objects that constitute the remote ping capability.\"",
      "zh-CHS": "pingCtlByPassRouteTable、pingCtlSourceAddressType、pingCtlSourceAddress、PingCtliIndex、PingCtldField、PingResultsOperatStatus、pingResultsIpTargetAddressType、pingResultsMinRtt、pingResultsMaxRtt、pingResultsAverageRtt、PingResultsProberResponses、pingResultsSentProbes、pingResultsRttSumOfSquares、，pingResultsLastGoodProbe}状态当前描述“构成远程ping功能的对象组。”"
    },
    {
      "indent": 7,
      "text": "::= { pingGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingCtlRowStatusGroup OBJECT-GROUP\n  OBJECTS {\n            pingCtlRowStatus\n          }\n  STATUS  current\n  DESCRIPTION\n      \"The RowStatus object of the pingCtlTable.\"\n   ::= { pingGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingHistoryGroup OBJECT-GROUP\n  OBJECTS {\n            pingProbeHistoryResponse,\n            pingProbeHistoryStatus,\n            pingProbeHistoryLastRC,\n            pingProbeHistoryTime\n          }\n  STATUS  current\n  DESCRIPTION\n      \"The group of objects that constitute the history\n      capability.\"\n   ::= { pingGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingNotificationsGroup NOTIFICATION-GROUP\n  NOTIFICATIONS {\n            pingProbeFailed,\n            pingTestFailed,\n            pingTestCompleted\n         }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "STATUS        current\nDESCRIPTION\n    \"The notification that are required to be supported by\n    implementations of this MIB.\"\n::= { pingGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingGroup OBJECT-GROUP OBJECTS { pingMaxConcurrentRequests, pingCtlTargetAddressType, pingCtlTargetAddress, pingCtlDataSize, pingCtlTimeOut, pingCtlProbeCount, pingCtlAdminStatus, pingCtlDataFill, pingCtlFrequency,",
      "zh-CHS": "pingGroup对象组对象{pingMaxConcurrentRequests，pingCtlTargetAddressType，pingCtlTargetAddress，pingCtlDataSize，pingCtlTimeOut，pingCtlProbeCount，pingCtlAdminStatus，pingCtlDataFill，pingCtlFrequency，"
    },
    {
      "indent": 6,
      "text": "          pingCtlMaxRows,\n          pingCtlStorageType,\n          pingCtlTrapGeneration,\n          pingCtlTrapProbeFailureFilter,\n          pingCtlTrapTestFailureFilter,\n          pingCtlType,\n          pingCtlDescr,\n          pingCtlByPassRouteTable,\n          pingCtlSourceAddressType,\n          pingCtlSourceAddress,\n          pingCtlIfIndex,\n          pingCtlDSField,\n          pingCtlRowStatus,\n          pingResultsOperStatus,\n          pingResultsIpTargetAddressType,\n          pingResultsIpTargetAddress,\n          pingResultsMinRtt,\n          pingResultsMaxRtt,\n          pingResultsAverageRtt,\n          pingResultsProbeResponses,\n          pingResultsSentProbes,\n          pingResultsRttSumOfSquares,\n          pingProbeHistoryResponse,\n          pingProbeHistoryStatus,\n          pingProbeHistoryLastRC\n        }\nSTATUS  deprecated\nDESCRIPTION\n    \"The group of objects that constitute the remote ping\n    capability.\"\n ::= { pingGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pingTimeStampGroup OBJECT-GROUP",
      "zh-CHS": "PingGroup对象组"
    },
    {
      "indent": 6,
      "text": "OBJECTS {\n          pingResultsLastGoodProbe,\n          pingProbeHistoryTime\n        }\nSTATUS  deprecated\nDESCRIPTION\n    \"The group of DateAndTime objects.\"\n ::= { pingGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "4.2. DISMAN-TRACEROUTE-MIB",
      "section_title": true,
      "zh-CHS": "4.2. DISMAN-TRACEROUTE-MIB"
    },
    {
      "indent": 3,
      "text": "DISMAN-TRACEROUTE-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Integer32, Gauge32, Unsigned32, mib-2, NOTIFICATION-TYPE, OBJECT-IDENTITY FROM SNMPv2-SMI -- RFC2578 RowStatus, StorageType, TruthValue, DateAndTime FROM SNMPv2-TC -- RFC2579 MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF -- RFC2580 SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC3411 InterfaceIndexOrZero -- RFC2863 FROM IF-MIB InetAddressType, InetAddress FROM INET-ADDRESS-MIB -- RFC4001 OperationResponseStatus FROM DISMAN-PING-MIB; -- RFC4560",
      "zh-CHS": "从SNMPv2 SMI--RFC2578 RowStatus、StorageType、TruthValue、DateAndTime和SNMPv2 TC--RFC2579 MODULE-COMPLIANCE、OBJECT-GROUP、，SNMPv2 CONF中的通知组——SNMP-FRAMEWORK-MIB中的RFC2580 SNMPAdministring——RFC3411接口索引零——IF-MIB中的RFC2863 InetAddressType，INET-ADDRESS-MIB中的InetAddress——DISMAN-PING-MIB中的RFC4001操作响应状态；——RFC4560"
    },
    {
      "indent": 4,
      "text": "traceRouteMIB MODULE-IDENTITY LAST-UPDATED \"200606130000Z\" -- 13 June 2006 ORGANIZATION \"IETF Distributed Management Working Group\" CONTACT-INFO \"Juergen Quittek",
      "zh-CHS": "TRACEROTEMIB模块标识最后一次更新“200606130000Z”-2006年6月13日组织“IETF分布式管理工作组”联系方式“Juergen Quitek”"
    },
    {
      "indent": 11,
      "text": "NEC Europe Ltd. Network Laboratories Kurfuersten-Anlage 36 69115 Heidelberg Germany",
      "zh-CHS": "NEC欧洲有限公司网络实验室Kurfuersten Anlage 36 69115德国海德堡"
    },
    {
      "indent": 7,
      "text": " Phone: +49 6221 4342-115 Email: quittek@netlab.nec.de\" DESCRIPTION \"The Traceroute MIB (DISMAN-TRACEROUTE-MIB) provides access to the traceroute capability at a remote host.",
      "zh-CHS": "电话：+49 6221 4342-115电子邮件：quittek@netlab.nec.de“说明”跟踪路由MIB（DISAN-Traceroute-MIB）提供对远程主机上跟踪路由功能的访问。"
    },
    {
      "indent": 11,
      "text": "Copyright (C) The Internet Society (2006). This version of this MIB module is part of RFC 4560; see the RFC itself for full legal notices.\"",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。此版本的MIB模块是RFC 4560的一部分；有关完整的法律通知，请参见RFC本身。”"
    },
    {
      "indent": 8,
      "text": "-- Revision history",
      "zh-CHS": "--修订历史"
    },
    {
      "indent": 8,
      "text": "REVISION     \"200606130000Z\"         -- 13 June 2006\nDESCRIPTION\n    \"Updated version, published as RFC 4560.\n        - Correctly considered IPv6 in DESCRIPTION clause of\n          object traceRouteCtlDataSize\n        - Replaced references to RFC 2575 by RFC 3415\n        - Replaced references to RFC 2571 by RFC 3411\n        - Replaced references to RFC 2851 by RFC 4001\n        - Clarified DESCRIPTION clause of object\n          traceRouteResultsLastGoodPath\n        - Changed range of object traceRouteCtlInitialTtl\n          from (0..255) to (1..255)\n        - Extended DESCRIPTION clause of traceRouteResultsTable\n          describing re-initialization of entries\n        - Changed SYNTAX of traceRouteResultsTestAttempts and\n          traceRouteResultsTestSuccesses from Unsigned32 to\n          Gauge32\n        - Changed status of traceRouteCompliance to deprecated\n        - Added traceRouteFullCompliance and\n          traceRouteMinimumCompliance\n        - Changed status of traceRouteGroup and\n          traceRouteTimeStampGroup to deprecated\n        - Added traceRouteMinimumGroup,\n          traceRouteCtlRowStatusGroup, and\n          traceRouteHistoryGroup\n        - Changed DEFVAL of object\n          traceRouteCtlTargetAddressType from { ipv4 }\n          to { unknown }\n        - Changed DEFVAL of object traceRouteCtlDescr\n          from { '00'H } to { ''H }\n        - Added DEFVAL for object traceRouteCtlTrapGeneration\n          of DEFVAL { { } }\"\nREVISION     \"200009210000Z\"         -- 21 September 2000\nDESCRIPTION\n    \"Initial version, published as RFC 2925.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "::= { mib-2 81 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Top level structure of the MIB",
      "zh-CHS": "--MIB的顶层结构"
    },
    {
      "indent": 4,
      "text": "traceRouteNotifications  OBJECT IDENTIFIER ::= { traceRouteMIB 0 }\ntraceRouteObjects        OBJECT IDENTIFIER ::= { traceRouteMIB 1 }\ntraceRouteConformance    OBJECT IDENTIFIER ::= { traceRouteMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- The registration node (point) for traceroute implementation types",
      "zh-CHS": "--跟踪路由实现类型的注册节点（点）"
    },
    {
      "indent": 4,
      "text": "traceRouteImplementationTypeDomains OBJECT IDENTIFIER\n::= { traceRouteMIB 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteUsingUdpProbes OBJECT-IDENTITY\n   STATUS      current\n   DESCRIPTION\n       \"Indicates that an implementation is using UDP probes to\n       perform the traceroute operation.\"\n   ::= { traceRouteImplementationTypeDomains 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Simple Object Definitions",
      "zh-CHS": "--简单对象定义"
    },
    {
      "indent": 4,
      "text": "traceRouteMaxConcurrentRequests OBJECT-TYPE SYNTAX Unsigned32 UNITS \"requests\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The maximum number of concurrent active traceroute requests that are allowed within an agent implementation. A value of 0 for this object implies that there is no limit for the number of concurrent active requests in effect.",
      "zh-CHS": "traceRouteMaxConcurrentRequests对象类型语法无符号32个单元“请求”最大访问读写状态当前说明“代理实现中允许的最大并发活动跟踪路由请求数。此对象的值为0表示有效的并发活动请求数没有限制。"
    },
    {
      "indent": 7,
      "text": "   The limit applies only to new requests being activated.\n   When a new value is set, the agent will continue processing\n   all the requests already active, even if their number\n   exceeds the limit just imposed.\"\nDEFVAL { 10 }\n::= { traceRouteObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "-- Traceroute Control Table",
      "zh-CHS": "--跟踪路由控制表"
    },
    {
      "indent": 4,
      "text": "traceRouteCtlTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF TraceRouteCtlEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines the Remote Operations Traceroute Control Table for\n       providing the capability of invoking traceroute from a remote\n       host.  The results of traceroute operations can be stored in\n       the traceRouteResultsTable, traceRouteProbeHistoryTable, and\n       the traceRouteHopsTable.\"\n  ::= { traceRouteObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlEntry OBJECT-TYPE SYNTAX TraceRouteCtlEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "zh-CHS": "traceRouteCtlEntry对象类型语法traceRouteCtlEntry MAX-ACCESS不可访问状态当前描述"
    },
    {
      "indent": 7,
      "text": "    \"Defines an entry in the traceRouteCtlTable.  The first\n    index element, traceRouteCtlOwnerIndex, is of type\n    SnmpAdminString, a textual convention that allows for\n    use of the SNMPv3 View-Based Access Control Model\n    (RFC 3415, VACM) and that allows a management\n    application to identify its entries.  The second index,\n    traceRouteCtlTestName (also an SnmpAdminString),\n    enables the same management application to have\n    multiple requests outstanding.\"\nINDEX {\n        traceRouteCtlOwnerIndex,\n        traceRouteCtlTestName\n      }\n::= { traceRouteCtlTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "TraceRouteCtlEntry ::=\n   SEQUENCE {\n     traceRouteCtlOwnerIndex         SnmpAdminString,\n     traceRouteCtlTestName           SnmpAdminString,\n     traceRouteCtlTargetAddressType  InetAddressType,\n     traceRouteCtlTargetAddress      InetAddress,\n     traceRouteCtlByPassRouteTable   TruthValue,\n     traceRouteCtlDataSize           Unsigned32,\n     traceRouteCtlTimeOut            Unsigned32,\n     traceRouteCtlProbesPerHop       Unsigned32,\n     traceRouteCtlPort               Unsigned32,\n     traceRouteCtlMaxTtl             Unsigned32,\n     traceRouteCtlDSField            Unsigned32,\n     traceRouteCtlSourceAddressType  InetAddressType,\n     traceRouteCtlSourceAddress      InetAddress,\n     traceRouteCtlIfIndex            InterfaceIndexOrZero,\n     traceRouteCtlMiscOptions        SnmpAdminString,\n     traceRouteCtlMaxFailures        Unsigned32,\n     traceRouteCtlDontFragment       TruthValue,\n     traceRouteCtlInitialTtl         Unsigned32,\n     traceRouteCtlFrequency          Unsigned32,\n     traceRouteCtlStorageType        StorageType,\n     traceRouteCtlAdminStatus        INTEGER,\n     traceRouteCtlDescr              SnmpAdminString,\n     traceRouteCtlMaxRows            Unsigned32,\n     traceRouteCtlTrapGeneration     BITS,\n     traceRouteCtlCreateHopsEntries  TruthValue,\n     traceRouteCtlType               OBJECT IDENTIFIER,\n     traceRouteCtlRowStatus          RowStatus\n   }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlOwnerIndex OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32))",
      "zh-CHS": "traceRouteCtlOwnerIndex对象类型语法SnmpAdminString（大小（0..32））"
    },
    {
      "indent": 7,
      "text": "MAX-ACCESS not-accessible STATUS current DESCRIPTION \"To facilitate the provisioning of access control by a security administrator using the View-Based Access Control Model (RFC 3415, VACM) for tables in which multiple users may need to create or modify entries independently, the initial index is used as an 'owner index'. Such an initial index has a syntax of SnmpAdminString and can thus be trivially mapped to a securityName or groupName defined in VACM, in accordance with a security policy.",
      "zh-CHS": "MAX-ACCESS not ACCESS STATUS current DESCRIPTION“帮助安全管理员使用基于视图的访问控制模型（RFC 3415，VACM）设置访问控制对于多个用户可能需要独立创建或修改条目的表，初始索引用作“所有者索引”。此类初始索引具有SNMPAdministring语法，因此可以根据安全策略轻松映射到VACM中定义的securityName或groupName。"
    },
    {
      "indent": 7,
      "text": "   When used in conjunction with such a security policy,\n   all entries in the table belonging to a particular user\n   (or group) will have the same value for this initial\n   index.  For a given user's entries in a particular\n   table, the object identifiers for the information in\n   these entries will have the same subidentifiers (except\n   for the 'column' subidentifier) up to the end of the\n   encoded owner index. To configure VACM to permit access\n   to this portion of the table, one would create\n   vacmViewTreeFamilyTable entries with the value of\n   vacmViewTreeFamilySubtree including the owner index\n   portion, and vacmViewTreeFamilyMask 'wildcarding' the\n   column subidentifier.  More elaborate configurations\n   are possible.\"\n::= { traceRouteCtlEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "traceRouteCtlTestName OBJECT-TYPE\n  SYNTAX      SnmpAdminString (SIZE(0..32))\n  MAX-ACCESS  not-accessible\n  STATUS      current\n  DESCRIPTION\n      \"The name of a traceroute test.  This is locally unique,\n      within the scope of a traceRouteCtlOwnerIndex.\"\n  ::= { traceRouteCtlEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlTargetAddressType OBJECT-TYPE\n   SYNTAX      InetAddressType\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the type of host address to be used on the\n       traceroute request at the remote host.\"\n   DEFVAL { unknown }\n   ::= { traceRouteCtlEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlTargetAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"Specifies the host address used on the traceroute request at the remote host. The host address type can be determined by examining the value of the corresponding traceRouteCtlTargetAddressType.",
      "zh-CHS": "traceRouteCtlTargetAddress对象类型语法InetAddress MAX-ACCESS read create STATUS current DESCRIPTION“指定在远程主机的跟踪路由请求上使用的主机地址。可以通过检查相应的跟踪路由CtlTargetAddressType的值来确定主机地址类型。"
    },
    {
      "indent": 7,
      "text": "    A value for this object MUST be set prior to\n    transitioning its corresponding traceRouteCtlEntry to\n    active(1) via traceRouteCtlRowStatus.\"\n::= { traceRouteCtlEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlByPassRouteTable OBJECT-TYPE\n   SYNTAX TruthValue\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"The purpose of this object is to enable optional\n      bypassing the route table.  If enabled, the remote\n      host will bypass the normal routing tables and send\n      directly to a host on an attached network.  If the\n      host is not on a directly attached network, an\n      error is returned.  This option can be used to perform\n      the traceroute operation to a local host through an\n      interface that has no route defined (e.g., after the\n      interface was dropped by the routing daemon at the host).\"\n   DEFVAL { false }\n   ::= { traceRouteCtlEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlDataSize OBJECT-TYPE SYNTAX Unsigned32 (0..65507) UNITS \"octets\" MAX-ACCESS read-create STATUS current DESCRIPTION \"Specifies the size of the data portion of a traceroute request, in octets. If the RECOMMENDED traceroute method (UDP datagrams as probes) is used, then the value contained in this object MUST be applied. If another traceroute method is used for which the specified size is not appropriate, then the implementation SHOULD use whatever size (appropriate to the method) is closest to the specified size.",
      "zh-CHS": "traceRouteCtlDataSize对象类型语法Unsigned32（0..65507）单位“八位字节”MAX-ACCESS read create STATUS current DESCRIPTION“指定跟踪路由请求的数据部分大小，以八位字节为单位。如果推荐的跟踪路由方法（UDP数据报作为探测）则必须应用此对象中包含的值。如果使用了另一个traceroute方法，但指定的大小不适合该方法，则实现应使用与指定大小最接近的大小（适合该方法）。"
    },
    {
      "indent": 7,
      "text": "    The maximum value for this object was computed by\n    subtracting the smallest possible IP header size of\n    20 octets (IPv4 header with no options) and the UDP\n    header size of 8 octets from the maximum IP packet size.\n    An IP packet has a maximum size of 65535 octets\n    (excluding IPv6 Jumbograms).\"\nDEFVAL { 0 }\n::= { traceRouteCtlEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlTimeOut OBJECT-TYPE\n   SYNTAX      Unsigned32 (1..60)\n   UNITS       \"seconds\"\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the time-out value, in seconds, for\n       a traceroute request.\"\n   DEFVAL { 3 }\n   ::= { traceRouteCtlEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlProbesPerHop OBJECT-TYPE\n   SYNTAX      Unsigned32 (1..10)\n   UNITS       \"probes\"\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the number of times to reissue a traceroute\n       request with the same time-to-live (TTL) value.\"\n   DEFVAL { 3 }\n   ::= { traceRouteCtlEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlPort OBJECT-TYPE\n   SYNTAX      Unsigned32 (1..65535)\n   UNITS       \"UDP Port\"\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the (initial) UDP port to send the traceroute\n       request to.  A port needs to be specified that is not in\n       use at the destination (target) host.  The default\n       value for this object is the IANA assigned port,\n       33434, for the traceroute function.\"\n   DEFVAL { 33434 }\n   ::= { traceRouteCtlEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlMaxTtl OBJECT-TYPE SYNTAX Unsigned32 (1..255) UNITS \"time-to-live value\"",
      "zh-CHS": "traceRouteCtlMaxTtl对象类型语法Unsigned32（1..255）单位“生存时间值”"
    },
    {
      "indent": 7,
      "text": "MAX-ACCESS  read-create\nSTATUS      current\nDESCRIPTION\n    \"Specifies the maximum time-to-live value.\"\nDEFVAL { 30 }\n::= { traceRouteCtlEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlDSField OBJECT-TYPE SYNTAX Unsigned32 (0..255) MAX-ACCESS read-create STATUS current",
      "zh-CHS": "traceRouteCtlDSField对象类型语法Unsigned32（0..255）MAX-ACCESS读取创建状态当前"
    },
    {
      "indent": 7,
      "text": "DESCRIPTION \"Specifies the value to store in the Type of Service (TOS) octet in the IPv4 header or in the Traffic Class octet in the IPv6 header, respectively, of the IP packet used to encapsulate the traceroute probe.",
      "zh-CHS": "DESCRIPTION“指定分别存储在用于封装跟踪路由探测的IP数据包的IPv4报头中的服务类型（TOS）八位字节或IPv6报头中的流量类八位字节中的值。"
    },
    {
      "indent": 11,
      "text": "The octet to be set in the IP header contains the Differentiated Services (DS) Field in the six most significant bits.",
      "zh-CHS": "要在IP报头中设置的八位字节在六个最高有效位中包含区分服务（DS）字段。"
    },
    {
      "indent": 7,
      "text": "    This option can be used to determine what effect an\n    explicit DS Field setting has on a traceroute response.\n    Not all values are legal or meaningful.  A value of 0\n    means that the function represented by this option is\n    not supported.  DS Field usage is often not supported\n    by IP implementations, and not all values are supported.\n    Refer to RFC 2474 and RFC 3260 for guidance on usage of\n    this field.\"\nREFERENCE\n    \"Refer to RFC 1812 for the definition of the IPv4 TOS\n    octet and to RFC 2460 for the definition of the IPv6\n    Traffic Class octet.  Refer to RFC 2474 and RFC 3260\n    for the definition of the Differentiated Services Field.\"\nDEFVAL { 0 }\n::= { traceRouteCtlEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlSourceAddressType OBJECT-TYPE\n   SYNTAX      InetAddressType\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Specifies the type of the source address,\n       traceRouteCtlSourceAddress, to be used at a remote host\n       when a traceroute operation is performed.\"\n   DEFVAL { unknown }\n   ::= { traceRouteCtlEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlSourceAddress OBJECT-TYPE\n   SYNTAX      InetAddress\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Use the specified IP address (which must be given as an\n       IP number, not a hostname) as the source address in\n       outgoing probe packets.  On hosts with more than one IP\n       address, this option can be used to select the address\n       to be used.  If the IP address is not one of this\n       machine's interface addresses, an error is returned, and\n       nothing is sent.  A zero-length octet string value for\n       this object disables source address specification.\n       The address type (InetAddressType) that relates to\n       this object is specified by the corresponding value\n       of traceRouteCtlSourceAddressType.\"\n   DEFVAL { ''H }\n   ::= { traceRouteCtlEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlIfIndex OBJECT-TYPE\n   SYNTAX      InterfaceIndexOrZero\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Setting this object to an interface's ifIndex prior\n       to starting a remote traceroute operation directs\n       the traceroute probes to be transmitted over the\n       specified interface.  A value of zero for this object\n       implies that this option is not enabled.\"\n   DEFVAL { 0 }\n   ::= { traceRouteCtlEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlMiscOptions OBJECT-TYPE\n   SYNTAX      SnmpAdminString\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"Enables an application to specify implementation-dependent\n       options.\"\n   DEFVAL { ''H }\n   ::= { traceRouteCtlEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlMaxFailures OBJECT-TYPE SYNTAX Unsigned32 (0..255) UNITS \"timeouts\" MAX-ACCESS read-create STATUS current DESCRIPTION",
      "zh-CHS": "traceRouteCtlMaxFailures对象类型语法Unsigned32（0..255）单位“超时”最大访问读取创建状态当前描述"
    },
    {
      "indent": 7,
      "text": "    \"The value of this object indicates the maximum number\n    of consecutive timeouts allowed before a remote traceroute\n    request is terminated.  A value of either 255 (maximum\n    hop count/possible TTL value) or 0 indicates that the\n    function of terminating a remote traceroute request when a\n    specific number of consecutive timeouts are detected is\n    disabled.\"\nDEFVAL { 5 }\n::= { traceRouteCtlEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlDontFragment OBJECT-TYPE\n   SYNTAX         TruthValue\n   MAX-ACCESS     read-create\n   STATUS         current\n   DESCRIPTION\n       \"This object enables setting of the don't fragment flag (DF)\n       in the IP header for a probe.  Use of this object enables\n       a manual PATH MTU test is performed.\"\n   DEFVAL  { false }\n   ::= { traceRouteCtlEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlInitialTtl OBJECT-TYPE\n   SYNTAX         Unsigned32 (1..255)\n   MAX-ACCESS     read-create\n   STATUS         current\n   DESCRIPTION\n       \"The value of this object specifies the initial TTL value to\n       use.  This enables bypassing the initial (often well known)\n       portion of a path.\"\n   DEFVAL { 1 }\n   ::= { traceRouteCtlEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlFrequency OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The number of seconds to wait before repeating a traceroute test, as defined by the value of the various objects in the corresponding row.",
      "zh-CHS": "traceRouteCtlFrequency对象类型语法Unsigned32个单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“重复跟踪路由测试之前等待的秒数，由相应行中各种对象的值定义。"
    },
    {
      "indent": 11,
      "text": "After a single test is completed the number of seconds as defined by the value of traceRouteCtlFrequency MUST elapse before the next traceroute test is started.",
      "zh-CHS": "单个测试完成后，在开始下一个跟踪路由测试之前，必须经过由traceRouteCtlFrequency值定义的秒数。"
    },
    {
      "indent": 11,
      "text": "A value of 0 for this object implies that the test as defined by the corresponding entry will not be",
      "zh-CHS": "此对象的值为0意味着由相应条目定义的测试将不会被执行"
    },
    {
      "indent": 7,
      "text": "    repeated.\"\nDEFVAL { 0 }\n::= { traceRouteCtlEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlStorageType OBJECT-TYPE\n   SYNTAX      StorageType\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"The storage type for this conceptual row.\n       Conceptual rows having the value 'permanent' need not\n       allow write-access to any columnar objects in the row.\"\n   DEFVAL { nonVolatile }\n   ::= { traceRouteCtlEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlAdminStatus OBJECT-TYPE SYNTAX INTEGER {",
      "zh-CHS": "traceRouteCtlAdminStatus对象类型语法整数{"
    },
    {
      "indent": 7,
      "text": " enabled(1), -- operation should be started disabled(2) -- operation should be stopped } MAX-ACCESS read-create STATUS current DESCRIPTION \"Reflects the desired state that an traceRouteCtlEntry should be in:",
      "zh-CHS": "已启用（1），--应启动操作已禁用（2）--应停止操作}MAX-ACCESS read create STATUS current DESCRIPTION“反映了traceRouteCtlEntry应处于的所需状态："
    },
    {
      "indent": 14,
      "text": "enabled(1) - Attempt to activate the test as defined by this traceRouteCtlEntry. disabled(2) - Deactivate the test as defined by this traceRouteCtlEntry.",
      "zh-CHS": "已启用（1）-尝试激活此项定义的测试。已禁用（2）-根据此条目的定义停用测试。"
    },
    {
      "indent": 7,
      "text": "    Refer to the corresponding traceRouteResultsOperStatus to\n    determine the operational state of the test defined by\n    this entry.\"\n DEFVAL { disabled }\n::= { traceRouteCtlEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlDescr OBJECT-TYPE\n   SYNTAX      SnmpAdminString\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"The purpose of this object is to provide a\n       descriptive name of the remote traceroute\n       test.\"\n   DEFVAL { ''H }\n   ::= { traceRouteCtlEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlMaxRows OBJECT-TYPE SYNTAX Unsigned32 UNITS \"rows\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The maximum number of corresponding entries allowed in the traceRouteProbeHistoryTable. An implementation of this MIB will remove the oldest corresponding entry in the traceRouteProbeHistoryTable to allow the addition of an new entry once the number of corresponding rows in the traceRouteProbeHistoryTable reaches this value.",
      "zh-CHS": "traceRouteCtlMaxRows对象类型语法无符号32个单位“行”最大访问读取创建状态当前描述“traceRouteProbeHistoryTable中允许的最大对应条目数。此MIB的实现将删除traceRouteProbeHistoryTable中最旧的对应条目，以便在traceRouteProbeHistoryTable中的对应行数达到此值时，允许添加新条目。"
    },
    {
      "indent": 7,
      "text": "    Old entries are not removed when a new test is\n    started.  Entries are added to the\n    traceRouteProbeHistoryTable until traceRouteCtlMaxRows\n    is reached before entries begin to be removed.\n    A value of 0 for this object disables creation of\n    traceRouteProbeHistoryTable entries.\"\nDEFVAL      { 50 }\n::= { traceRouteCtlEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlTrapGeneration OBJECT-TYPE\n   SYNTAX      BITS {\n                 pathChange(0),\n                 testFailure(1),\n                 testCompletion(2)\n               }\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"The value of this object determines when and whether to\n       generate a notification for this entry:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "pathChange(0) - Generate a traceRoutePathChange notification when the current path varies from a previously determined path. testFailure(1) - Generate a traceRouteTestFailed notification when the full path to a target can't be determined. testCompletion(2) - Generate a traceRouteTestCompleted notification when the path to a target has been determined.",
      "zh-CHS": "pathChange（0）-当当前路径与以前确定的路径不同时，生成TracerOutPathChange通知。testFailure（1）-当无法确定目标的完整路径时，生成TracerOutTestFailed通知。testCompletion（2）-确定目标路径后，生成跟踪路由TestCompleted通知。"
    },
    {
      "indent": 11,
      "text": "The value of this object defaults to an empty set, indicating that none of the above options has been selected.\"",
      "zh-CHS": "此对象的值默认为空集，表示未选择任何上述选项。”"
    },
    {
      "indent": 7,
      "text": "DEFVAL { { } }\n::= { traceRouteCtlEntry 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlCreateHopsEntries OBJECT-TYPE\n   SYNTAX      TruthValue\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n       \"The current path for a traceroute test is kept in the\n       traceRouteHopsTable on a per-hop basis when the value of\n       this object is true(1).\"\n   DEFVAL { false }\n   ::= { traceRouteCtlEntry 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlType OBJECT-TYPE SYNTAX OBJECT IDENTIFIER MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object is used either to report or to select the implementation method to be used for performing a traceroute operation. The value of this object may be selected from traceRouteImplementationTypeDomains.",
      "zh-CHS": "TracerOuteCltType对象类型语法对象标识符MAX-ACCESS read create STATUS current DESCRIPTION“此对象的值用于报告或选择用于执行跟踪路由操作的实现方法。此对象的值可以从traceRouteImplementationTypeDomains中选择。"
    },
    {
      "indent": 7,
      "text": "    Additional implementation types should be allocated as\n    required by implementers of the DISMAN-TRACEROUTE-MIB\n    under their enterprise specific registration point,\n    not beneath traceRouteImplementationTypeDomains.\"\nDEFVAL { traceRouteUsingUdpProbes }\n::= { traceRouteCtlEntry 26 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted in the traceRouteCtlTable. Deletion of an entry in this table results in a deletion of all corresponding (same traceRouteCtlOwnerIndex and traceRouteCtlTestName index values) traceRouteResultsTable, traceRouteProbeHistoryTable, and traceRouteHopsTable entries.",
      "zh-CHS": "traceRouteCtlRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此对象允许在traceRouteCtlTable中创建和删除条目。删除此表中的条目会导致删除所有相应的（相同的traceRouteCtlOwnerIndex和traceRouteCtlTestName索引值）traceRouteResultsTable、traceRouteProbeHistoryTable和traceRouteHopsTable条目。"
    },
    {
      "indent": 11,
      "text": "A value MUST be specified for traceRouteCtlTargetAddress prior to acceptance of a transition to active(1) state.",
      "zh-CHS": "在接受转换到活动（1）状态之前，必须为TracerOuteCtTargetAddress指定一个值。"
    },
    {
      "indent": 11,
      "text": "When a value for pingCtlTargetAddress is set, the value of object pingCtlRowStatus changes from notReady(3) to notInService(2).",
      "zh-CHS": "设置pingCtlTargetAddress的值时，对象pingCtlRowStatus的值将从notReady（3）更改为notInService（2）。"
    },
    {
      "indent": 11,
      "text": "Activation of a remote traceroute operation is controlled via traceRouteCtlAdminStatus, and not by transitioning of this object's value to active(1).",
      "zh-CHS": "远程跟踪路由操作的激活是通过跟踪路由CTLAMINSTATUS控制的，而不是通过将此对象的值转换为active（1）来控制的。"
    },
    {
      "indent": 11,
      "text": "Transitions in and out of active(1) state are not allowed while an entry's traceRouteResultsOperStatus is active(1), with the exception that deletion of an entry in this table by setting its RowStatus object to destroy(6) will stop an active traceroute operation.",
      "zh-CHS": "当条目的跟踪路由ResultsOperatStatus处于活动状态（1）时，不允许进入和退出活动（1）状态，除非通过将其RowStatus对象设置为destroy（6）删除此表中的条目将停止活动跟踪路由操作。"
    },
    {
      "indent": 7,
      "text": "    The operational state of an traceroute operation\n    can be determined by examination of the corresponding\n    traceRouteResultsOperStatus object.\"\nREFERENCE\n    \"See definition of RowStatus in RFC 2579, 'Textual\n    Conventions for SMIv2.'\"\n::= { traceRouteCtlEntry 27 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Traceroute Results Table",
      "zh-CHS": "--跟踪路由结果表"
    },
    {
      "indent": 4,
      "text": "traceRouteResultsTable OBJECT-TYPE SYNTAX SEQUENCE OF TraceRouteResultsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines the Remote Operations Traceroute Results Table for keeping track of the status of a traceRouteCtlEntry.",
      "zh-CHS": "TracerOutResultsTable对象类型TracerOutResultsEntry MAX-ACCESS的语法序列不可访问状态当前描述”定义远程操作Traceroute结果表，用于跟踪traceRouteCtlEntry的状态。"
    },
    {
      "indent": 11,
      "text": "An entry is added to the traceRouteResultsTable when an traceRouteCtlEntry is started by successful transition of its traceRouteCtlAdminStatus object to enabled(1).",
      "zh-CHS": "当通过将traceRouteCtlAdminStatus对象成功转换为enabled（1）启动traceRouteCtlEntry时，将向TracerOutResultsTable添加一个条目。"
    },
    {
      "indent": 11,
      "text": "If the object traceRouteCtlAdminStatus already has the value enabled(1), and if the corresponding traceRouteResultsOperStatus object has the value completed(3), then successfully writing enabled(1) to the object traceRouteCtlAdminStatus re-initializes the already existing entry in the traceRouteResultsTable. The values of objects in the re-initialized entry are the same as the values of objects in a new entry would be.",
      "zh-CHS": "如果对象traceRouteCtlAdminStatus已启用值（1），并且相应的TracerOutResultsOperatStatus对象已完成值（3），则成功将启用值（1）写入对象traceRouteCtlAdminStatus将重新初始化TracerOutResultsTable中已存在的条目。重新初始化的条目中的对象值与新条目中的对象值相同。"
    },
    {
      "indent": 11,
      "text": "An entry is removed from the traceRouteResultsTable when",
      "zh-CHS": "当发生以下情况时，将从traceroutResultsTable中删除一个条目："
    },
    {
      "indent": 6,
      "text": "     its corresponding traceRouteCtlEntry is deleted.\"\n::= { traceRouteObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsEntry OBJECT-TYPE\n   SYNTAX      TraceRouteResultsEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines an entry in the traceRouteResultsTable.  The\n       traceRouteResultsTable has the same indexing as the\n       traceRouteCtlTable so that a traceRouteResultsEntry\n       corresponds to the traceRouteCtlEntry that caused it to\n       be created.\"\n   INDEX {\n           traceRouteCtlOwnerIndex,\n           traceRouteCtlTestName\n         }\n   ::= { traceRouteResultsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "TraceRouteResultsEntry ::=\n   SEQUENCE {\n     traceRouteResultsOperStatus       INTEGER,\n     traceRouteResultsCurHopCount      Gauge32,\n     traceRouteResultsCurProbeCount    Gauge32,\n     traceRouteResultsIpTgtAddrType    InetAddressType,\n     traceRouteResultsIpTgtAddr        InetAddress,\n     traceRouteResultsTestAttempts     Gauge32,\n     traceRouteResultsTestSuccesses    Gauge32,\n     traceRouteResultsLastGoodPath     DateAndTime\n   }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsOperStatus OBJECT-TYPE\n   SYNTAX      INTEGER {\n                         enabled(1),  -- test is in progress\n                         disabled(2), -- test has stopped\n                         completed(3) -- test is completed\n                       }\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Reflects the operational state of an traceRouteCtlEntry:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "       enabled(1)   - Test is active.\n       disabled(2)  - Test has stopped.\n       completed(3) - Test is completed.\"\n::= { traceRouteResultsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsCurHopCount OBJECT-TYPE",
      "zh-CHS": "TracerOutResultsCurhopCount对象类型"
    },
    {
      "indent": 7,
      "text": "SYNTAX      Gauge32\nUNITS       \"hops\"\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n    \"Reflects the current TTL value (from 1 to\n    255) for a remote traceroute operation.\n    Maximum TTL value is determined by\n    traceRouteCtlMaxTtl.\"\n::= { traceRouteResultsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsCurProbeCount OBJECT-TYPE\n   SYNTAX      Gauge32\n   UNITS       \"probes\"\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Reflects the current probe count (1..10) for\n       a remote traceroute operation.  The maximum\n       probe count is determined by\n       traceRouteCtlProbesPerHop.\"\n   ::= { traceRouteResultsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsIpTgtAddrType OBJECT-TYPE SYNTAX InetAddressType",
      "zh-CHS": "TracerOutResultsIPTGTADDRTYPE对象类型语法InetAddressType"
    },
    {
      "indent": 7,
      "text": "MAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n    \"This object indicates the type of address stored\n    in the corresponding traceRouteResultsIpTgtAddr\n    object.\"\n::= { traceRouteResultsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsIpTgtAddr OBJECT-TYPE\n   SYNTAX      InetAddress\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"This object reports the IP address associated\n       with a traceRouteCtlTargetAddress value when the\n       destination address is specified as a DNS name.\n       The value of this object should be a zero-length\n       octet string when a DNS name is not specified or\n       when a specified DNS name fails to resolve.\"\n   ::= { traceRouteResultsEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsTestAttempts OBJECT-TYPE",
      "zh-CHS": "TracerOutResultsTestAttempts对象类型"
    },
    {
      "indent": 7,
      "text": "SYNTAX      Gauge32\nUNITS       \"tests\"\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n    \"The current number of attempts to determine a path\n    to a target.  The value of this object MUST be started\n    at 0.\"\n::= { traceRouteResultsEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsTestSuccesses OBJECT-TYPE\n   SYNTAX      Gauge32\n   UNITS       \"tests\"\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The current number of attempts to determine a path\n       to a target that have succeeded.  The value of this\n       object MUST be reported as 0 when no attempts have\n       succeeded.\"\n   ::= { traceRouteResultsEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteResultsLastGoodPath OBJECT-TYPE\n   SYNTAX      DateAndTime\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The date and time when the last complete path\n       was determined.  A path is complete if responses\n       were received or timeout occurred for each hop on\n       the path; i.e., for each TTL value from the value\n       of the corresponding traceRouteCtlInitialTtl object\n       up to the end of the path or (if no reply from the\n       target IP address was received) up to the value of\n       the corresponding traceRouteCtlMaxTtl object.\"\n   ::= { traceRouteResultsEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Trace Route Probe History Table",
      "zh-CHS": "--跟踪路由探测历史记录表"
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryTable OBJECT-TYPE SYNTAX SEQUENCE OF TraceRouteProbeHistoryEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines the Remote Operations Traceroute Results Table for storing the results of a traceroute operation.",
      "zh-CHS": "traceRouteProbeHistoryTable对象类型TraceRouteProbeHistoryEntry MAX-ACCESS的语法序列不可访问状态当前描述”定义远程操作Traceroute结果表，用于存储跟踪路由操作的结果。"
    },
    {
      "indent": 11,
      "text": "An implementation of this MIB will remove the oldest",
      "zh-CHS": "此MIB的实现将删除最旧的"
    },
    {
      "indent": 6,
      "text": "     entry in the traceRouteProbeHistoryTable of the\n     corresponding entry in the traceRouteCtlTable to allow\n     the addition of a new entry once the number of rows in\n     the traceRouteProbeHistoryTable reaches the value specified\n     by traceRouteCtlMaxRows for the corresponding entry in the\n     traceRouteCtlTable.\"\n::= { traceRouteObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryEntry OBJECT-TYPE SYNTAX TraceRouteProbeHistoryEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines a table for storing the results of a traceroute operation. Entries in this table are limited by the value of the corresponding traceRouteCtlMaxRows object.",
      "zh-CHS": "traceRouteProbeHistoryEntry对象类型语法traceRouteProbeHistoryEntry MAX-ACCESS不可访问状态当前描述”定义用于存储跟踪路由操作结果的表。此表中的条目受相应traceRouteCtlMaxRows对象的值限制。"
    },
    {
      "indent": 7,
      "text": "    The first two index elements identify the\n    traceRouteCtlEntry that a traceRouteProbeHistoryEntry\n    belongs to.  The third index element selects a single\n    traceroute operation result.  The fourth and fifth indexes\n    select the hop and the probe for a particular\n    traceroute operation.\"\nINDEX {\n         traceRouteCtlOwnerIndex,\n         traceRouteCtlTestName,\n         traceRouteProbeHistoryIndex,\n         traceRouteProbeHistoryHopIndex,\n         traceRouteProbeHistoryProbeIndex",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "      }\n::= { traceRouteProbeHistoryTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "TraceRouteProbeHistoryEntry ::=\n   SEQUENCE {\n     traceRouteProbeHistoryIndex         Unsigned32,\n     traceRouteProbeHistoryHopIndex      Unsigned32,\n     traceRouteProbeHistoryProbeIndex    Unsigned32,\n     traceRouteProbeHistoryHAddrType     InetAddressType,\n     traceRouteProbeHistoryHAddr         InetAddress,\n     traceRouteProbeHistoryResponse      Unsigned32,\n     traceRouteProbeHistoryStatus        OperationResponseStatus,\n     traceRouteProbeHistoryLastRC        Integer32,\n     traceRouteProbeHistoryTime          DateAndTime\n   }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryIndex OBJECT-TYPE",
      "zh-CHS": "traceRouteProbeHistoryIndex对象类型"
    },
    {
      "indent": 7,
      "text": "SYNTAX Unsigned32 (1..'ffffffff'h) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An entry in this table is created when the result of a traceroute probe is determined. The initial 2 instance identifier index values identify the traceRouteCtlEntry that a probe result (traceRouteProbeHistoryEntry) belongs to. An entry is removed from this table when its corresponding traceRouteCtlEntry is deleted.",
      "zh-CHS": "语法Unsigned32（1..'ffffffff'h）MAX-ACCESS不可访问状态当前描述“当确定跟踪路由探测的结果时，将创建此表中的一个条目。初始的2个实例标识符索引值标识探测结果（traceRouteProbeHistoryEntry）的跟踪路由Ctlentry属于。删除相应的跟踪项时，将从此表中删除该项。"
    },
    {
      "indent": 7,
      "text": "    An implementation MUST start assigning\n    traceRouteProbeHistoryIndex values at 1 and wrap after\n    exceeding the maximum possible value, as defined by the\n    limit of this object ('ffffffff'h).\"\n::= { traceRouteProbeHistoryEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryHopIndex OBJECT-TYPE\n   SYNTAX      Unsigned32 (1..255)\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"Indicates which hop in a traceroute path the probe's\n      results are for.  The value of this object is initially\n      determined by the value of traceRouteCtlInitialTtl.\"\n   ::= { traceRouteProbeHistoryEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryProbeIndex OBJECT-TYPE\n   SYNTAX      Unsigned32 (1..10)\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"Indicates the index of a probe for a particular\n      hop in a traceroute path.  The number of probes per\n      hop is determined by the value of the corresponding\n      traceRouteCtlProbesPerHop object.\"\n   ::= { traceRouteProbeHistoryEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryHAddrType OBJECT-TYPE\n   SYNTAX      InetAddressType\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"This objects indicates the type of address stored\n       in the corresponding traceRouteProbeHistoryHAddr\n       object.\"\n   ::= { traceRouteProbeHistoryEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryHAddr OBJECT-TYPE\n   SYNTAX      InetAddress\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The address of a hop in a traceroute path.  This object\n      is not allowed to be a DNS name.  The value of the\n      corresponding object, traceRouteProbeHistoryHAddrType,\n      indicates this object's IP address type.\"\n   ::= { traceRouteProbeHistoryEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryResponse OBJECT-TYPE\n   SYNTAX      Unsigned32\n   UNITS       \"milliseconds\"\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The amount of time measured in milliseconds from when\n       a probe was sent to when its response was received or\n       when it timed out.  The value of this object is reported\n       as 0 when it is not possible to transmit a probe.\"\n   ::= { traceRouteProbeHistoryEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryStatus OBJECT-TYPE\n   SYNTAX      OperationResponseStatus\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The result of a traceroute operation made by a remote\n       host for a particular probe.\"\n   ::= { traceRouteProbeHistoryEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryLastRC OBJECT-TYPE SYNTAX Integer32 MAX-ACCESS read-only",
      "zh-CHS": "traceRouteProbeHistoryLastRC对象类型语法整数32 MAX-ACCESS只读"
    },
    {
      "indent": 7,
      "text": "STATUS current DESCRIPTION \"The last implementation-method-specific reply code received.",
      "zh-CHS": "STATUS current DESCRIPTION“收到的最后一个特定于实施方法的回复代码。"
    },
    {
      "indent": 7,
      "text": "    Traceroute is usually implemented by transmitting a series of\n    probe packets with increasing time-to-live values.  A probe\n    packet is a UDP datagram encapsulated into an IP packet.\n    Each hop in a path to the target (destination) host rejects\n    the probe packets (probe's TTL too small, ICMP reply) until\n    either the maximum TTL is exceeded or the target host is\n    received.\"\n::= { traceRouteProbeHistoryEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteProbeHistoryTime OBJECT-TYPE\n   SYNTAX      DateAndTime\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Timestamp for when this probe's results were determined.\"\n   ::= { traceRouteProbeHistoryEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Traceroute Hop Results Table",
      "zh-CHS": "--跟踪路由跃点结果表"
    },
    {
      "indent": 4,
      "text": "traceRouteHopsTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF TraceRouteHopsEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines the Remote Operations Traceroute Hop Table for\n       keeping track of the results of traceroute tests on a\n       per-hop basis.\"\n   ::= { traceRouteObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsEntry OBJECT-TYPE\n   SYNTAX      TraceRouteHopsEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines an entry in the traceRouteHopsTable.\n       The first two index elements identify the\n       traceRouteCtlEntry that a traceRouteHopsEntry\n       belongs to.  The third index element,\n       traceRouteHopsHopIndex, selects a\n       hop in a traceroute path.\"\n   INDEX {\n           traceRouteCtlOwnerIndex,\n           traceRouteCtlTestName,\n           traceRouteHopsHopIndex\n         }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "::= { traceRouteHopsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "TraceRouteHopsEntry ::=\n   SEQUENCE {\n       traceRouteHopsHopIndex         Unsigned32,\n       traceRouteHopsIpTgtAddressType InetAddressType,\n       traceRouteHopsIpTgtAddress     InetAddress,\n       traceRouteHopsMinRtt           Unsigned32,\n       traceRouteHopsMaxRtt           Unsigned32,\n       traceRouteHopsAverageRtt       Unsigned32,\n       traceRouteHopsRttSumOfSquares  Unsigned32,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": " traceRouteHopsSentProbes Unsigned32, traceRouteHopsProbeResponses Unsigned32, traceRouteHopsLastGoodProbe DateAndTime }",
      "zh-CHS": "tracerouthopsentprobes Unsigned32，tracerouthopsproberesponses Unsigned32，tracerouthopsslastgoodprobe DateAndTime}"
    },
    {
      "indent": 4,
      "text": "traceRouteHopsHopIndex OBJECT-TYPE SYNTAX Unsigned32 (1..'ffffffff'h) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Specifies the hop index for a traceroute hop. Values for this object with respect to the same traceRouteCtlOwnerIndex and traceRouteCtlTestName MUST start at 1 and be given increasing values for subsequent hops. The value of traceRouteHopsHopIndex is not necessarily the number of the hop on the traced path.",
      "zh-CHS": "traceRouteHopsHopIndex对象类型语法Unsigned32（1..'ffffffff'h）MAX-ACCESS不可访问状态当前描述“指定跟踪路由跃点的跃点索引。对于相同的traceRouteCtlOwnerIndex和traceRouteCtlTestName，此对象的值必须从1开始，并为后续跃点提供递增的值。traceRouteHopsHopIndex的值不一定是跟踪路径上的跃点数。"
    },
    {
      "indent": 11,
      "text": "The traceRouteHopsTable keeps the current traceroute path per traceRouteCtlEntry if enabled by setting the corresponding traceRouteCtlCreateHopsEntries to true(1).",
      "zh-CHS": "如果通过将相应的TracerOuteClCreateHopSenters设置为true（1）启用，则traceRouteHopsTable将保持每个TracerOuteClEntry的当前traceroute路径。"
    },
    {
      "indent": 7,
      "text": "    All hops (traceRouteHopsTable entries) in a traceroute\n    path MUST be updated at the same time when a traceroute\n    operation is completed.  Care needs to be applied when a path\n    either changes or can't be determined.  The initial portion\n    of the path, up to the first hop change, MUST retain the\n    same traceRouteHopsHopIndex values.  The remaining portion\n    of the path SHOULD be assigned new traceRouteHopsHopIndex\n    values.\"\n::= { traceRouteHopsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsIpTgtAddressType OBJECT-TYPE\n   SYNTAX      InetAddressType\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"This object indicates the type of address stored\n       in the corresponding traceRouteHopsIpTgtAddress\n       object.\"\n   ::= { traceRouteHopsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsIpTgtAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reports the IP address associated with",
      "zh-CHS": "traceRouteHopsIpTgtAddress对象类型语法InetAddress MAX-ACCESS只读状态当前描述“此对象报告与"
    },
    {
      "indent": 11,
      "text": "the hop. A value for this object should be reported as a numeric IP address, not as a DNS name.",
      "zh-CHS": "跳跃。此对象的值应报告为数字IP地址，而不是DNS名称。"
    },
    {
      "indent": 7,
      "text": "    The address type (InetAddressType) that relates to\n    this object is specified by the corresponding value\n    of pingCtlSourceAddressType.\"\n::= { traceRouteHopsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsMinRtt OBJECT-TYPE\n   SYNTAX      Unsigned32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The minimum traceroute round-trip-time (RTT) received for\n       this hop.  A value of 0 for this object implies that no\n       RTT has been received.\"\n   ::= { traceRouteHopsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsMaxRtt OBJECT-TYPE\n   SYNTAX      Unsigned32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The maximum traceroute round-trip-time (RTT) received for\n       this hop.  A value of 0 for this object implies that no\n       RTT has been received.\"\n   ::= { traceRouteHopsEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsAverageRtt OBJECT-TYPE\n   SYNTAX      Unsigned32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The current average traceroute round-trip-time (RTT) for\n       this hop.\"\n   ::= { traceRouteHopsEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsRttSumOfSquares OBJECT-TYPE\n   SYNTAX      Unsigned32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"This object contains the sum of the squares of all\n       round-trip-times received for this hop.  Its purpose is\n       to enable standard deviation calculation.\"\n   ::= { traceRouteHopsEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsSentProbes OBJECT-TYPE",
      "zh-CHS": "tracerouthopsentprobe对象类型"
    },
    {
      "indent": 7,
      "text": "SYNTAX      Unsigned32\nMAX-ACCESS  read-only\nSTATUS      current\nDESCRIPTION\n    \"The value of this object reflects the number of probes sent\n    for this hop during this traceroute test.  The value of this\n    object should start at 0.\"\n::= { traceRouteHopsEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsProbeResponses OBJECT-TYPE\n   SYNTAX      Unsigned32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Number of responses received for this hop during this\n       traceroute test.  This value of this object should start\n       at 0.\"\n   ::= { traceRouteHopsEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsLastGoodProbe OBJECT-TYPE\n   SYNTAX      DateAndTime\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Date and time at which the last response was received for a\n        probe for this hop during this traceroute test.\"\n   ::= { traceRouteHopsEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Notification Definition section",
      "zh-CHS": "--通知定义部分"
    },
    {
      "indent": 4,
      "text": "traceRoutePathChange NOTIFICATION-TYPE\n     OBJECTS {\n       traceRouteCtlTargetAddressType,\n       traceRouteCtlTargetAddress,\n       traceRouteResultsIpTgtAddrType,\n       traceRouteResultsIpTgtAddr\n     }\n     STATUS  current\n     DESCRIPTION\n         \"The path to a target has changed.\"\n     ::= { traceRouteNotifications 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteTestFailed NOTIFICATION-TYPE OBJECTS { traceRouteCtlTargetAddressType, traceRouteCtlTargetAddress, traceRouteResultsIpTgtAddrType, traceRouteResultsIpTgtAddr",
      "zh-CHS": "traceRouteTestFailed通知类型对象{TracerOuteTlTargetAddressType，TracerOuteTlTargetAddress，traceRouteResultsIpTgtAddrType，traceRouteResultsIpTgtAddr"
    },
    {
      "indent": 9,
      "text": "}\nSTATUS  current\nDESCRIPTION\n    \"Could not determine the path to a target.\"\n::= { traceRouteNotifications 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteTestCompleted NOTIFICATION-TYPE\n     OBJECTS {\n       traceRouteCtlTargetAddressType,\n       traceRouteCtlTargetAddress,\n       traceRouteResultsIpTgtAddrType,\n       traceRouteResultsIpTgtAddr\n     }\n     STATUS  current\n     DESCRIPTION\n         \"The path to a target has just been determined.\"\n     ::= { traceRouteNotifications 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Conformance information\n-- Compliance statements",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCompliances OBJECT IDENTIFIER\n     ::= { traceRouteConformance 1 }\ntraceRouteGroups      OBJECT IDENTIFIER\n     ::= { traceRouteConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Compliance statements",
      "zh-CHS": "--合规声明"
    },
    {
      "indent": 4,
      "text": "traceRouteFullCompliance MODULE-COMPLIANCE\n   STATUS  current\n   DESCRIPTION\n           \"The compliance statement for SNMP entities that\n           fully implement the DISMAN-TRACEROUTE-MIB.\"\n   MODULE  -- this module\n       MANDATORY-GROUPS {\n                           traceRouteMinimumGroup,\n                           traceRouteCtlRowStatusGroup,\n                           traceRouteHistoryGroup\n                        }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteHopsTableGroup DESCRIPTION \"This group lists the objects that make up a traceRouteHopsEntry. Support of the traceRouteHopsTable is optional.\"",
      "zh-CHS": "GROUP traceRouteHopsTableGroup DESCRIPTION“此组列出组成traceRouteHopsEntry的对象。对traceRouteHopsTable的支持是可选的。”"
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteNotificationsGroup DESCRIPTION",
      "zh-CHS": "组跟踪路由通知组描述"
    },
    {
      "indent": 15,
      "text": "\"This group defines a collection of optional notifications.\"",
      "zh-CHS": "“此组定义可选通知的集合。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support SET operations to this object.\"",
      "zh-CHS": "对象跟踪路由MaxConcurrentRequests最小访问只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlByPassRouteTable MIN-ACCESS read-only DESCRIPTION \"Write access to this object is not required by implementations that are not capable of its implementation. The function represented by this object is implementable if the setsockopt SOL_SOCKET SO_DONTROUTE option is supported.\"",
      "zh-CHS": "OBJECT TraceRouteTable MIN-ACCESS只读描述“无法实现此对象的实现不需要对此对象的写入访问权限。如果支持setsockopt SOL_SOCKET SO_DONTROUTE选项，则可以实现此对象表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlDSField MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 implies that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT traceRouteCtlDSField MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlSourceAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "对象TracerOuteClSourceAddressType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}MIN-ACCESS只读说明“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持ipv4和ipv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlSourceAddress SYNTAX InetAddress (SIZE(0|4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "OBJECT TracerOuteClSourceAddress语法InetAddress（大小（0 | 4 | 16））MIN-ACCESS只读说明“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持IPv4和IPv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlIfIndex MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is",
      "zh-CHS": "对象traceRouteCtlIfIndex最小访问只读描述“不需要写访问。如果需要写访问"
    },
    {
      "indent": 15,
      "text": "not supported, return a 0 as the value of this object. A value of 0 implies that the function represented by this option is not supported.\"",
      "zh-CHS": "不支持，返回0作为此对象的值。值为0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlMiscOptions MIN-ACCESS read-only DESCRIPTION \"Support of this object is optional. If not supporting, do not allow write access and return a zero-length octet string as the value of the object.\"",
      "zh-CHS": "OBJECT traceRouteCtlMiscOptions MIN-ACCESS只读说明“此对象的支持是可选的。如果不支持，则不允许写访问，并返回长度为零的八位字节字符串作为对象的值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. It is also allowed that implementations support only the volatile(2) StorageType enumeration.\"",
      "zh-CHS": "对象跟踪路由CTLStorageType MIN-ACCESS只读描述“不需要写访问。还允许实现仅支持volatile（2）StorageType枚举。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. In addition, the only value that is RECOMMENDED to be supported by an implementation is traceRouteUsingUdpProbes.\"",
      "zh-CHS": "对象tracerouteclttype MIN-ACCESS只读说明“不需要写访问权限。此外，建议实现支持的唯一值是tracerouteusingudpprobe。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsIpTgtAddrType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由结果IPTGTADDRTYPE语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现应仅支持此对象的ipv4和全局唯一ipv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsIpTgtAddr SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由结果iptgtaddr语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsLastGoodPath DESCRIPTION \"If the traceRouteHopsTableGroup is implemented, then this object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "对象traceroutResultsLastGoodPath描述“如果实现了TracerOutshopStableGroup，那么对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。“"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryHAddrType\nSYNTAX  InetAddressType { unknown(0), ipv4(1), ipv6(2) }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "描述“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryHAddr SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由ProbeHistoryAddr语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryTime DESCRIPTION \"This object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "OBJECT TracerOutProbeHistorytime DESCRIPTION“对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteHopsIpTgtAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由SIPTGTADDressType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现应仅支持此对象的ipv4和全局唯一ipv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteHopsIpTgtAddress SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由SIPTGTAddress语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteHopsLastGoodProbe DESCRIPTION \"This object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "OBJECT TracerOutHopSlastGoodProbe DESCRIPTION“对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。”"
    },
    {
      "indent": 7,
      "text": "::= { traceRouteCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteMinimumCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The minimum compliance statement for SNMP entities which implement the minimal subset of the DISMAN-TRACEROUTE-MIB. Implementors might choose this subset for small devices with limited resources.\" MODULE -- this module",
      "zh-CHS": "TracerOuteMimumCompliance MODULE-COMPLIANCE STATUS当前描述“实现DISAN-TRACEROUTE-MIB最小子集的SNMP实体的最小符合性声明。实现者可以为资源有限的小型设备选择此子集。”模块--此模块"
    },
    {
      "indent": 11,
      "text": "MANDATORY-GROUPS { traceRouteMinimumGroup }",
      "zh-CHS": "强制组{traceroutemimumgroup}"
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteCtlRowStatusGroup DESCRIPTION \"A compliant implementation does not have to implement the traceRouteCtlRowStatusGroup.\"",
      "zh-CHS": "GROUP TracerOuteClRowStatusGroup DESCRIPTION“符合要求的实现不必实现TracerOuteClRowStatusGroup。”"
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteHistoryGroup DESCRIPTION \"A compliant implementation does not have to implement the traceRouteHistoryGroup.\"",
      "zh-CHS": "GROUP traceRouteHistoryGroup DESCRIPTION“符合要求的实现不必实现traceRouteHistoryGroup。”"
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteHopsTableGroup DESCRIPTION \"This group lists the objects that make up a traceRouteHopsEntry. Support of the traceRouteHopsTable is optional.\"",
      "zh-CHS": "GROUP traceRouteHopsTableGroup DESCRIPTION“此组列出组成traceRouteHopsEntry的对象。对traceRouteHopsTable的支持是可选的。”"
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteNotificationsGroup DESCRIPTION \"This group defines a collection of optional notifications.\"",
      "zh-CHS": "GROUP TracerOutNotificationsGroup DESCRIPTION“此组定义可选通知的集合。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support SET operations to this object.\"",
      "zh-CHS": "对象跟踪路由MaxConcurrentRequests最小访问只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlByPassRouteTable MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a false(2) as the value of this object. A value of false(2) means that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT TraceRouteTable MIN-ACCESS只读描述“不需要写访问权限。如果不支持写访问权限，则返回false（2）作为此对象的值。false（2）表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlDSField MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 implies that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT traceRouteCtlDSField MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlSourceAddressType\nSYNTAX  InetAddressType { unknown(0), ipv4(1), ipv6(2) }\nMIN-ACCESS  read-only",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "DESCRIPTION“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持IPv4和IPv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlSourceAddress SYNTAX InetAddress (SIZE(0|4|16)) MIN-ACCESS read-only",
      "zh-CHS": "对象TracerOuteClSourceAddress语法InetAddress（大小（0 | 4 | 16））最小访问只读"
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"Write access to this object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "DESCRIPTION“无法将发送套接字与源地址绑定的实现不需要对此对象的写访问权限。只需要支持IPv4和IPv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlIfIndex MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 implies that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT TracerOuteCtliIndex MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlMiscOptions MIN-ACCESS read-only DESCRIPTION \"Support of this object is optional. If not supporting, do not allow write access, and return a zero-length octet string as the value of the object.\"",
      "zh-CHS": "OBJECT traceRouteCtlMiscOptions MIN-ACCESS只读说明“此对象的支持是可选的。如果不支持，则不允许写访问，并返回长度为零的八位字节字符串作为对象的值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlDontFragment MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a false(2) as the value of this object. A value of false(2) means that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT TracerOuteCltDontFragment MIN-ACCESS只读描述“不需要写访问。如果不支持写访问，则返回false（2）作为此对象的值。false（2）表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlInitialTtl MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If write access is not supported, return a 1 as the value of this object.\"",
      "zh-CHS": "对象traceRouteCtlInitialTtl MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，请将1作为此对象的值返回。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlFrequency MIN-ACCESS read-only DESCRIPTION",
      "zh-CHS": "对象跟踪器最小访问频率只读描述"
    },
    {
      "indent": 15,
      "text": "\"Write access is not required. If write access is not supported, return a 0 as the value of this object. A value of 0 implies that the function represented by this option is not supported.\"",
      "zh-CHS": "不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. It is also allowed that implementations support only the volatile(2) StorageType enumeration.\"",
      "zh-CHS": "对象跟踪路由CTLStorageType MIN-ACCESS只读描述“不需要写访问。还允许实现仅支持volatile（2）StorageType枚举。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlDescr MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "OBJECT traceRouteCtlDescr MIN-ACCESS只读说明“代理不需要支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlMaxRows MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If the traceRouteHistoryGroup is not implemented, then write access to this object MUST be disabled, and the object MUST return a value of 0 when retrieved.\"",
      "zh-CHS": "对象traceRouteCtlMaxRows MIN-ACCESS只读说明“不需要写访问。如果未实现traceRouteHistoryGroup，则必须禁用对此对象的写访问，并且检索对象时必须返回值0。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlTrapGeneration MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If the traceRouteNotificationsGroup is not implemented, then write access to this object MUST be disabled, and the object MUST return a value with no bit set when retrieved. No bit set indicates that no notification is generated.\"",
      "zh-CHS": "对象TracerOuteCttrapGeneration MIN-ACCESS只读说明“不需要写访问。如果没有实现TracerOutNotificationsGroup，则必须禁用对此对象的写访问，并且检索对象时必须返回一个未设置位的值。未设置位表示未生成通知。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlCreateHopsEntries MIN-ACCESS read-only DESCRIPTION \"Write access is not required. If the traceRouteHopsTableGroup is not implemented, then write access to this object MUST be disabled, and the object MUST return a value of false(2) when retrieved.\"",
      "zh-CHS": "对象TracerOuteClCreateHopSentries MIN-ACCESS只读描述“不需要写访问权限。如果没有实现traceRouteHopsTableGroup，则必须禁用对此对象的写访问权限，并且检索对象时必须返回false（2）值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. In addition, the only",
      "zh-CHS": "对象traceRouteCtlType MIN-ACCESS只读说明“不需要写访问权限。此外，只有"
    },
    {
      "indent": 15,
      "text": "value that is RECOMMENDED to be supported by an implementation is traceRouteUsingUdpProbes.\"",
      "zh-CHS": "建议实现支持的值是TracerOutUsingUpProbe。“"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsIpTgtAddrType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由结果IPTGTADDRTYPE语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现应仅支持此对象的ipv4和全局唯一ipv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsIpTgtAddr SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由结果iptgtaddr语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsLastGoodPath DESCRIPTION \"This object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "OBJECT TracerOutResultsLastGoodPath DESCRIPTION“对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryHAddrType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由ProbeHistoryHaddrType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现应仅支持此对象的ipv4和全局唯一ipv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryHAddr SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由ProbeHistoryAddr语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryTime DESCRIPTION \"If the traceRouteHistoryGroup is implemented, then this object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "OBJECT traceRouteProbeHistoryTime DESCRIPTION“如果实现了traceRouteHistoryGroup，则此对象对于能够访问系统时钟并能够设置DateAndTime对象值的实现是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteHopsIpTgtAddressType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation should only support IPv4 and",
      "zh-CHS": "对象跟踪路由SIPTGTADDessType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现应仅支持ipv4和ipv6"
    },
    {
      "indent": 15,
      "text": "globally unique IPv6 address values for this object.\"",
      "zh-CHS": "此对象的全局唯一IPv6地址值。“"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteHopsIpTgtAddress SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由SIPTGTAddress语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteHopsLastGoodProbe DESCRIPTION \"If the traceRouteHopsTableGroup is implemented, then this object is mandatory for implementations that have access to a system clock and that are capable of setting the values for DateAndTime objects. It is RECOMMENDED that when this object is not supported its values be reported as '0000000000000000'H.\"",
      "zh-CHS": "对象跟踪outHopSlastGoodProbe描述“如果实现了TracerOutshopStableGroup，那么对于能够访问系统时钟并能够设置DateAndTime对象值的实现，此对象是必需的。建议在不支持此对象时，将其值报告为“0000000000000000”H。“"
    },
    {
      "indent": 7,
      "text": "::= { traceRouteCompliances 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCompliance MODULE-COMPLIANCE\n   STATUS  deprecated\n   DESCRIPTION\n           \"The compliance statement for the DISMAN-TRACEROUTE-MIB.\n           This compliance statement has been deprecated because\n           the traceRouteGroup and the traceRouteTimeStampGroup\n           have been split and deprecated. The\n           traceRouteFullCompliance is semantically identical to the\n           deprecated traceRouteCompliance statement.\"\n   MODULE  -- this module\n       MANDATORY-GROUPS {\n                           traceRouteGroup\n                         }\n       GROUP traceRouteTimeStampGroup\n       DESCRIPTION\n           \"This group is mandatory for implementations that have\n           access to a system clock and that are capable of setting\n           the values for DateAndTime objects.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteNotificationsGroup DESCRIPTION \"This group defines a collection of optional notifications.\"",
      "zh-CHS": "GROUP TracerOutNotificationsGroup DESCRIPTION“此组定义可选通知的集合。”"
    },
    {
      "indent": 11,
      "text": "GROUP traceRouteHopsTableGroup DESCRIPTION \"This group lists the objects that make up a traceRouteHopsEntry. Support of the traceRouteHopsTable is optional.\"",
      "zh-CHS": "GROUP traceRouteHopsTableGroup DESCRIPTION“此组列出组成traceRouteHopsEntry的对象。对traceRouteHopsTable的支持是可选的。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support SET operations to this object.\"",
      "zh-CHS": "对象跟踪路由MaxConcurrentRequests最小访问只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlByPassRouteTable MIN-ACCESS read-only DESCRIPTION \"This object is not required by implementations that are not capable of its implementation. The function represented by this object is implementable if the setsockopt SOL_SOCKET SO_DONTROUTE option is supported.\"",
      "zh-CHS": "OBJECT TraceRouteTable MIN-ACCESS只读说明“无法实现此对象的实现不需要此对象。如果支持setsockopt SOL_SOCKET SO_DONTROUTE选项，则此对象表示的函数是可实现的。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlSourceAddressType\nSYNTAX  InetAddressType { unknown(0), ipv4(1), ipv6(2) }\nMIN-ACCESS  read-only",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"This object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and IPv6 addresses.\"",
      "zh-CHS": "DESCRIPTION“无法将发送套接字与源地址绑定的实现不需要此对象。只需要支持IPv4和IPv6地址的实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlSourceAddress SYNTAX InetAddress (SIZE(0|4|16)) MIN-ACCESS read-only DESCRIPTION \"This object is not required by implementations that are not capable of binding the send socket with a source address. An implementation is only required to support IPv4 and globally unique IPv6 addresses.\"",
      "zh-CHS": "OBJECT TracerOuteClSourceAddress语法InetAddress（大小（0 | 4 | 16））MIN-ACCESS只读说明“无法将发送套接字绑定到源地址的实现不需要此对象。仅支持IPv4和全局唯一IPv6地址的实现才需要此实现。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlIfIndex MIN-ACCESS read-only DESCRIPTION \"Write access is not required. When write access is not supported, return a 0 as the value of this object. A value of 0 implies that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT TracerOuteCtLiIndex MIN-ACCESS只读描述“不需要写访问。当不支持写访问时，返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlMiscOptions MIN-ACCESS read-only DESCRIPTION \"Support of this object is optional. When not supporting, do not allow write access, and return a zero-length octet string as the value of the object.\"",
      "zh-CHS": "OBJECT traceRouteCtlMiscOptions MIN-ACCESS只读说明“此对象的支持是可选的。不支持时，不允许写访问，并返回长度为零的八位字节字符串作为对象的值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. It is also allowed that implementations support only the volatile StorageType enumeration.\"",
      "zh-CHS": "对象跟踪路由CTLStorageType MIN-ACCESS只读描述“不需要写访问权限。还允许实现仅支持volatile StorageType枚举。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlDSField MIN-ACCESS read-only DESCRIPTION \"Write access is not required. When write access is not supported, return a 0 as the value of this object. A value of 0 implies that the function represented by this option is not supported.\"",
      "zh-CHS": "OBJECT traceRouteCtlDSField MIN-ACCESS只读说明“不需要写访问。如果不支持写访问，则返回0作为此对象的值。值0表示不支持此选项表示的函数。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteCtlType MIN-ACCESS read-only DESCRIPTION \"Write access is not required. In addition, the only value that is RECOMMENDED to be supported by an implementation is traceRouteUsingUdpProbes.\"",
      "zh-CHS": "对象tracerouteclttype MIN-ACCESS只读说明“不需要写访问权限。此外，建议实现支持的唯一值是tracerouteusingudpprobe。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsIpTgtAddrType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由结果IPTGTADDRTYPE语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现应仅支持此对象的ipv4和全局唯一ipv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteResultsIpTgtAddr SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由结果iptgtaddr语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryHAddrType SYNTAX InetAddressType { unknown(0), ipv4(1), ipv6(2) } DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由ProbeHistoryHaddrType语法InetAddressType{unknown（0）、ipv4（1）、ipv6（2）}说明“实现应仅支持此对象的ipv4和全局唯一ipv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteProbeHistoryHAddr SYNTAX InetAddress (SIZE(0|4|16)) DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "对象跟踪路由ProbeHistoryAddr语法InetAddress（大小（0 | 4 | 16））说明“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 11,
      "text": "OBJECT traceRouteHopsIpTgtAddressType\nSYNTAX  InetAddressType { unknown(0), ipv4(1), ipv6(2) }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "DESCRIPTION \"An implementation should only support IPv4 and globally unique IPv6 address values for this object.\"",
      "zh-CHS": "描述“实现应仅支持此对象的IPv4和全局唯一IPv6地址值。”"
    },
    {
      "indent": 7,
      "text": "    OBJECT traceRouteHopsIpTgtAddress\n    SYNTAX  InetAddress (SIZE(0|4|16))\n    DESCRIPTION\n        \"An implementation should only support IPv4 and\n        globally unique IPv6 address values for this object.\"\n::= { traceRouteCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- MIB groupings",
      "zh-CHS": "--MIB分组"
    },
    {
      "indent": 4,
      "text": "traceRouteMinimumGroup OBJECT-GROUP OBJECTS { traceRouteMaxConcurrentRequests, traceRouteCtlTargetAddressType, traceRouteCtlTargetAddress, traceRouteCtlByPassRouteTable, traceRouteCtlDataSize, traceRouteCtlTimeOut, traceRouteCtlProbesPerHop, traceRouteCtlPort, traceRouteCtlMaxTtl, traceRouteCtlDSField, traceRouteCtlSourceAddressType, traceRouteCtlSourceAddress, traceRouteCtlIfIndex, traceRouteCtlMiscOptions, traceRouteCtlMaxFailures, traceRouteCtlDontFragment, traceRouteCtlInitialTtl, traceRouteCtlFrequency, traceRouteCtlStorageType, traceRouteCtlAdminStatus, traceRouteCtlMaxRows, traceRouteCtlTrapGeneration, traceRouteCtlDescr, traceRouteCtlCreateHopsEntries, traceRouteCtlType, traceRouteResultsOperStatus, traceRouteResultsCurHopCount, traceRouteResultsCurProbeCount, traceRouteResultsIpTgtAddrType, traceRouteResultsIpTgtAddr, traceRouteResultsTestAttempts, traceRouteResultsTestSuccesses, traceRouteResultsLastGoodPath",
      "zh-CHS": "TracerOuteMimumGroup对象组对象{traceRouteMaxConcurrentRequests、tracerouteCtTargetAddressType、tracerouteCtTargetAddress、tracerouteCtBypassRouteTable、tracerouteCtDataSize、tracerouteCtTimeout、tracerouteCtProbesPerhop、tracerouteCtPort、tracerouteCtMaxTTL、tracerouteCtLdField、tracerouteCtSourceAddressType、traceRouteCtlSourceAddress、tracerouteCtIfindex、traceRoUTECTLMISCHOPTIONS、TRACETROUTECTLMAXFAILURES、TRACETROUTECTLDONTFRAPTENT、TRACETROUTECTLinitialTTL、TRACETROUTECTLFORCENCE、TRACETROUTECTLSTOAGENT、TRACETROUTECTLMAXROWS、TRACETROUTECTLTRAPGGENERATION、TRACETROUTECTLDESCREATEHOPSENTRIES、TRACERTOUTECTLROUTECTRESULTSCURCHOPCOunt，traceroutResultsCurProbeCount，traceroutResultsIPTGTAddrType，traceroutResultsIPTGTAddr，traceroutResultsTestAttempts，traceroutResultsTestSuccessfulls，traceroutResultsLastGoodPath"
    },
    {
      "indent": 6,
      "text": "       }\nSTATUS  current\nDESCRIPTION\n    \"The group of objects that constitute the remote traceroute\n    operation.\"\n::= { traceRouteGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteCtlRowStatusGroup OBJECT-GROUP\n  OBJECTS {\n            traceRouteCtlRowStatus\n         }\n  STATUS  current\n  DESCRIPTION\n      \"The RowStatus object of the traceRouteCtlTable.\"\n  ::= { traceRouteGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHistoryGroup OBJECT-GROUP\n  OBJECTS {\n            traceRouteProbeHistoryHAddrType,\n            traceRouteProbeHistoryHAddr,\n            traceRouteProbeHistoryResponse,\n            traceRouteProbeHistoryStatus,\n            traceRouteProbeHistoryLastRC,\n            traceRouteProbeHistoryTime\n          }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "STATUS  current\nDESCRIPTION\n    \"The group of objects that constitute the history\n    capability.\"\n ::= { traceRouteGroups 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteNotificationsGroup NOTIFICATION-GROUP\n  NOTIFICATIONS {\n            traceRoutePathChange,\n            traceRouteTestFailed,\n            traceRouteTestCompleted\n         }\n  STATUS   current\n  DESCRIPTION\n      \"The notifications that are required to be supported by\n      implementations of this MIB.\"\n  ::= { traceRouteGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteHopsTableGroup OBJECT-GROUP OBJECTS { traceRouteHopsIpTgtAddressType, traceRouteHopsIpTgtAddress,",
      "zh-CHS": "traceRouteHopsTableGroup对象组对象{traceRouteHopsIpTgtAddressType，traceRouteHopsIpTgtAddress，"
    },
    {
      "indent": 5,
      "text": "           traceRouteHopsMinRtt,\n           traceRouteHopsMaxRtt,\n           traceRouteHopsAverageRtt,\n           traceRouteHopsRttSumOfSquares,\n           traceRouteHopsSentProbes,\n           traceRouteHopsProbeResponses,\n           traceRouteHopsLastGoodProbe\n         }\n  STATUS   current\n  DESCRIPTION\n      \"The group of objects that constitute the\n      traceRouteHopsTable.\"\n::= { traceRouteGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteGroup OBJECT-GROUP OBJECTS { traceRouteMaxConcurrentRequests, traceRouteCtlTargetAddressType, traceRouteCtlTargetAddress, traceRouteCtlByPassRouteTable, traceRouteCtlDataSize, traceRouteCtlTimeOut, traceRouteCtlProbesPerHop, traceRouteCtlPort, traceRouteCtlMaxTtl, traceRouteCtlDSField, traceRouteCtlSourceAddressType, traceRouteCtlSourceAddress, traceRouteCtlIfIndex, traceRouteCtlMiscOptions, traceRouteCtlMaxFailures, traceRouteCtlDontFragment, traceRouteCtlInitialTtl, traceRouteCtlFrequency, traceRouteCtlStorageType, traceRouteCtlAdminStatus, traceRouteCtlMaxRows, traceRouteCtlTrapGeneration, traceRouteCtlDescr, traceRouteCtlCreateHopsEntries, traceRouteCtlType, traceRouteCtlRowStatus, traceRouteResultsOperStatus, traceRouteResultsCurHopCount, traceRouteResultsCurProbeCount, traceRouteResultsIpTgtAddrType, traceRouteResultsIpTgtAddr, traceRouteResultsTestAttempts,",
      "zh-CHS": "traceRouteGroup对象组对象{traceRouteMaxConcurrentRequests、tracerouteCtTargetAddressType、tracerouteCtTargetAddress、tracerouteCtBypassRouteTable、tracerouteCtDataSize、tracerouteCtTimeout、tracerouteCtProbesPerhop、tracerouteCtPort、tracerouteCtMaxTTL、tracerouteCtLdField、tracerouteCtSourceAddressType、traceRouteCtlSourceAddress、tracerouteCtIfindex、traceRoUTECTLMISCHOPTIONS、TRACETROUTECTLMAXFAILURES、TRACETROUTECTLDONTFRAPTENT、TRACETROUTECTLinitialTTL、TRACETROUTECTLFORCENCE、TRACETROUTECTL存储类型、TRACETROUTECTLAdminStatus、TRACETROUTECTLMAXROWS、TRACETROUTECTLTRAPGGENERATION、TRACETROUTECTLDESCR、TRACECTLCCreateHopSentries、TRACETROUTECTLTYPE、TRACETROURaceRouteResultsCrhopCount、traceRouteResultsCurProbeCount、TraceRouteResultsIPTGAddRtype、TraceRouteResultsIPTGAddR、traceRouteResultsTestAttempts、，"
    },
    {
      "indent": 6,
      "text": "          traceRouteResultsTestSuccesses,\n          traceRouteProbeHistoryHAddrType,\n          traceRouteProbeHistoryHAddr,\n          traceRouteProbeHistoryResponse,\n          traceRouteProbeHistoryStatus,\n          traceRouteProbeHistoryLastRC\n       }\nSTATUS  deprecated\nDESCRIPTION\n    \"The group of objects that constitute the remote traceroute\n    operation.\"\n::= { traceRouteGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "traceRouteTimeStampGroup OBJECT-GROUP\n  OBJECTS {\n            traceRouteResultsLastGoodPath,\n            traceRouteProbeHistoryTime\n          }\n  STATUS  deprecated\n  DESCRIPTION\n      \"The group of DateAndTime objects.\"\n   ::= { traceRouteGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "4.3. DISMAN-NSLOOKUP-MIB",
      "section_title": true,
      "zh-CHS": "4.3. DISMAN-NSLOOKUP-MIB"
    },
    {
      "indent": 3,
      "text": "DISMAN-NSLOOKUP-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Unsigned32, mib-2, Integer32 FROM SNMPv2-SMI -- RFC2578 RowStatus FROM SNMPv2-TC -- RFC2579 MODULE-COMPLIANCE, OBJECT-GROUP FROM SNMPv2-CONF -- RFC2580 SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC3411 InetAddressType, InetAddress FROM INET-ADDRESS-MIB; -- RFC4001",
      "zh-CHS": "从SNMPv2 SMI导入模块标识、对象类型、未签名32、mib-2、整数32——从SNMPv2 TC导入RFC2578行状态——从SNMPv2 CONF导入RFC2579模块符合性、对象组——从SNMP-FRAMEWORK-mib导入RFC2580 SNMPAdministring——从INET-ADDRESS-mib导入RFC3411 InetAddressType、从INET-ADDRESS-mib导入InetAddress；——RFC4001"
    },
    {
      "indent": 4,
      "text": "lookupMIB MODULE-IDENTITY LAST-UPDATED \"200606130000Z\" -- 13 June 2006 ORGANIZATION \"IETF Distributed Management Working Group\" CONTACT-INFO \"Juergen Quittek",
      "zh-CHS": "lookupMIB模块标识最后更新“200606130000Z”-2006年6月13日组织“IETF分布式管理工作组”联系方式“Juergen Quitek”"
    },
    {
      "indent": 11,
      "text": "NEC Europe Ltd. Network Laboratories Kurfuersten-Anlage 36 69115 Heidelberg Germany",
      "zh-CHS": "NEC欧洲有限公司网络实验室Kurfuersten Anlage 36 69115德国海德堡"
    },
    {
      "indent": 7,
      "text": " Phone: +49 6221 4342-115 Email: quittek@netlab.nec.de\" DESCRIPTION \"The Lookup MIB (DISMAN-NSLOOKUP-MIB) enables determination of either the name(s) corresponding to a host address or of the address(es) associated with a host name at a remote host.",
      "zh-CHS": "电话：+49 6221 4342-115电子邮件：quittek@netlab.nec.de“说明”查找MIB（DISAN-NSLOOKUP-MIB）允许确定与主机地址对应的名称或与远程主机上的主机名关联的地址。"
    },
    {
      "indent": 11,
      "text": "Copyright (C) The Internet Society (2006). This version of this MIB module is part of RFC 4560; see the RFC itself for full legal notices.\"",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。此版本的MIB模块是RFC 4560的一部分；有关完整的法律通知，请参见RFC本身。”"
    },
    {
      "indent": 8,
      "text": "-- Revision history",
      "zh-CHS": "--修订历史"
    },
    {
      "indent": 8,
      "text": "REVISION \"200606130000Z\" -- 13 June 2006 DESCRIPTION \"Updated version, published as RFC 4560. - Replaced references to RFC 2575 by RFC 3415 - Replaced references to RFC 2571 by RFC 3411 - Replaced references to RFC 2851 by RFC 4001 - Added value enabled(1) to SYNTAX clause of lookupCtlOperStatus - Added lookupMinimumCompliance - Defined semantics of value 0 for object lookupPurgeTime - Added DEFVAL { unknown } to object lookupCtlTargetAddressType OBJECT-TYPE\"",
      "zh-CHS": "修订版“200606130000Z”-2006年6月13日描述“更新版本，发布为RFC 4560。-将RFC 2575的参考替换为RFC 3415-将RFC 2571的参考替换为RFC 3411-将RFC 2851的参考替换为RFC 4001-启用增值（1）to lookupCtlOperStatus的语法子句-添加lookupMinimumCompliance-为对象lookupPurgeTime定义值0的语义-向对象lookupCtlTargetAddressType object-TYPE添加DEFVAL{unknown}”"
    },
    {
      "indent": 8,
      "text": "REVISION \"200009210000Z\" -- 21 September 2000 DESCRIPTION \"Initial version, published as RFC 2925.\"",
      "zh-CHS": "修订版“2000092100Z”-2000年9月21日描述“初始版本，发布为RFC 2925。”"
    },
    {
      "indent": 7,
      "text": "::= { mib-2 82 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Top level structure of the MIB",
      "zh-CHS": "--MIB的顶层结构"
    },
    {
      "indent": 4,
      "text": "lookupObjects        OBJECT IDENTIFIER ::= { lookupMIB 1 }\nlookupConformance    OBJECT IDENTIFIER ::= { lookupMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Simple Object Definitions",
      "zh-CHS": "--简单对象定义"
    },
    {
      "indent": 4,
      "text": "lookupMaxConcurrentRequests OBJECT-TYPE",
      "zh-CHS": "lookupMaxConcurrentRequests对象类型"
    },
    {
      "indent": 7,
      "text": "SYNTAX Unsigned32 UNITS \"requests\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The maximum number of concurrent active lookup requests that are allowed within an agent implementation. A value of 0 for this object implies that there is no limit for the number of concurrent active requests in effect.",
      "zh-CHS": "SYNTAX Unsigned32 UNITS“requests”MAX-ACCESS read-write STATUS current DESCRIPTION“代理实现中允许的最大并发活动查找请求数。此对象的值为0表示对有效的并发活动请求数没有限制。"
    },
    {
      "indent": 7,
      "text": "   The limit applies only to new requests being activated.\n   When a new value is set, the agent will continue processing\n   all the requests already active, even if their number\n   exceed the limit just imposed.\"\nDEFVAL { 10 }\n::= { lookupObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupPurgeTime OBJECT-TYPE SYNTAX Unsigned32 (0..86400) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The amount of time to wait before automatically deleting an entry in the lookupCtlTable and any dependent lookupResultsTable entries after the lookup operation represented by a lookupCtlEntry has been completed. A lookupCtEntry is considered complete when its lookupCtlOperStatus object has a value of completed(3).",
      "zh-CHS": "lookupPurgeTime对象类型语法无符号32（0..86400）单位“秒”最大访问读写状态当前说明“lookupCtlEntry表示的查找操作完成后，自动删除lookupCtlTable中的条目和任何相关lookupResultsTable条目之前等待的时间量。lookupCtEntry的LookupCtOperStatus对象的值为completed（3）时，它被视为已完成。"
    },
    {
      "indent": 7,
      "text": "   A value of 0 indicates that automatic deletion\n   of entries is disabled.\"\nDEFVAL { 900 }  -- 15 minutes as default\n::= { lookupObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Lookup Control Table",
      "zh-CHS": "--查找控制表"
    },
    {
      "indent": 4,
      "text": "lookupCtlTable OBJECT-TYPE SYNTAX SEQUENCE OF LookupCtlEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines the Lookup Control Table for providing the capability of performing a lookup operation for a symbolic host name or for a host address from a remote host.\"",
      "zh-CHS": "lookupCtlTable对象类型LookupCtlEntry MAX-ACCESS不可访问状态的语法序列当前描述“定义查找控制表，用于提供对符号主机名或远程主机的主机地址执行查找操作的功能。”"
    },
    {
      "indent": 6,
      "text": "::= { lookupObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlEntry OBJECT-TYPE\n   SYNTAX      LookupCtlEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines an entry in the lookupCtlTable.  A\n       lookupCtlEntry is initially indexed by\n       lookupCtlOwnerIndex, which is a type of SnmpAdminString,\n       a textual convention that allows for the use of the SNMPv3\n       View-Based Access Control Model (RFC 3415, VACM)\n       and that also allows a management application to identify\n       its entries.  The second index element,\n       lookupCtlOperationName, enables the same\n       lookupCtlOwnerIndex entity to have multiple outstanding\n       requests.  The value of lookupCtlTargetAddressType\n       determines which lookup function to perform.\"\n   INDEX {\n            lookupCtlOwnerIndex,\n            lookupCtlOperationName\n         }\n   ::= { lookupCtlTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "LookupCtlEntry ::=\n   SEQUENCE {\n       lookupCtlOwnerIndex         SnmpAdminString,\n       lookupCtlOperationName      SnmpAdminString,\n       lookupCtlTargetAddressType  InetAddressType,\n       lookupCtlTargetAddress      InetAddress,\n       lookupCtlOperStatus         INTEGER,\n       lookupCtlTime               Unsigned32,\n       lookupCtlRc                 Integer32,\n       lookupCtlRowStatus          RowStatus\n   }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlOwnerIndex OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"To facilitate the provisioning of access control by a security administrator using the View-Based Access Control Model (RFC 2575, VACM) for tables in which multiple users may need to create or modify entries independently, the initial index is used as an 'owner index'. Such an initial index has a syntax of SnmpAdminString and can thus be trivially mapped to a",
      "zh-CHS": "lookupCtlOwnerIndex对象类型语法SnmpAdminString（大小（0..32））MAX-ACCESS not accessible STATUS current DESCRIPTION“帮助安全管理员使用基于视图的访问控制模型（RFC 2575，VACM）设置访问控制对于多个用户可能需要独立创建或修改条目的表，初始索引用作“所有者索引”。此类初始索引的语法为SnmpAdminString，因此可以简单地映射到"
    },
    {
      "indent": 10,
      "text": "securityName or groupName defined in VACM, in accordance with a security policy.",
      "zh-CHS": "根据安全策略在VACM中定义的securityName或groupName。"
    },
    {
      "indent": 7,
      "text": "   When used in conjunction with such a security policy all\n   entries in the table belonging to a particular user (or\n   group) will have the same value for this initial index.\n   For a given user's entries in a particular table, the\n   object identifiers for the information in these entries\n   will have the same subidentifiers (except for the\n   'column' subidentifier) up to the end of the encoded\n   owner index.  To configure VACM to permit access to this\n   portion of the table, one would create\n   vacmViewTreeFamilyTable entries with the value of\n   vacmViewTreeFamilySubtree including the owner index\n   portion, and vacmViewTreeFamilyMask 'wildcarding' the\n   column subidentifier.  More elaborate configurations\n   are possible.\"\n::= { lookupCtlEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlOperationName OBJECT-TYPE\n   SYNTAX      SnmpAdminString (SIZE(0..32))\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"The name of a lookup operation.  This is locally unique,\n       within the scope of an lookupCtlOwnerIndex.\"\n   ::= { lookupCtlEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlTargetAddressType OBJECT-TYPE SYNTAX InetAddressType MAX-ACCESS read-create STATUS current",
      "zh-CHS": "lookupCtlTargetAddressType对象类型语法InetAddressType MAX-ACCESS读取创建状态当前"
    },
    {
      "indent": 7,
      "text": "DESCRIPTION \"Specifies the type of address for performing a lookup operation for a symbolic host name or for a host address from a remote host.",
      "zh-CHS": "DESCRIPTION“指定用于对符号主机名或远程主机的主机地址执行查找操作的地址类型。"
    },
    {
      "indent": 7,
      "text": "    Specification of dns(16) as the value for this object\n    means that a function such as, for example, getaddrinfo()\n    or gethostbyname() should be performed to return one or\n    more numeric addresses.  Use of a value of either ipv4(1)\n    or ipv6(2) means that a functions such as, for example,\n    getnameinfo() or gethostbyaddr() should be used to return\n    the symbolic names associated with a host.\"\nDEFVAL { unknown }\n::= { lookupCtlEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlTargetAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"Specifies the address used for a resolver lookup at a remote host. The corresponding lookupCtlTargetAddressType objects determines its type, as well as the function that can be requested.",
      "zh-CHS": "lookupCtlTargetAddress对象类型语法InetAddress MAX-ACCESS read create STATUS current DESCRIPTION“指定用于远程主机上解析程序查找的地址。相应的lookupCtlTargetAddressType对象确定其类型以及可以请求的函数。"
    },
    {
      "indent": 7,
      "text": "    A value for this object MUST be set prior to\n    transitioning its corresponding lookupCtlEntry to\n    active(1) via lookupCtlRowStatus.\"\n::= { lookupCtlEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlOperStatus OBJECT-TYPE\n   SYNTAX      INTEGER {\n                  enabled(1),    -- operation is active\n                  notStarted(2), -- operation has not started\n                  completed(3)   -- operation is done\n               }\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"Reflects the operational state of an lookupCtlEntry:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "enabled(1) - Operation is active. notStarted(2) - Operation has not been enabled. completed(3) - Operation has been completed.",
      "zh-CHS": "已启用（1）-操作处于激活状态。notStarted（2）-尚未启用操作。已完成（3）-操作已完成。"
    },
    {
      "indent": 7,
      "text": "     An operation is automatically enabled(1) when its\n     lookupCtlRowStatus object is transitioned to active(1)\n     status.  Until this occurs, lookupCtlOperStatus MUST\n     report a value of notStarted(2).  After the lookup\n     operation is completed (success or failure), the value\n     for lookupCtlOperStatus MUST be transitioned to\n     completed(3).\"\n::= { lookupCtlEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"Reports the number of milliseconds that a lookup operation required to be completed at a remote host. Completed means operation failure as well as",
      "zh-CHS": "lookupCtlTime对象类型语法Unsigned32单位“毫秒”最大访问只读状态当前描述“报告在远程主机上完成查找操作所需的毫秒数。完成意味着操作失败以及"
    },
    {
      "indent": 7,
      "text": "    success.\"\n::= { lookupCtlEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlRc OBJECT-TYPE\n   SYNTAX      Integer32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n       \"The system-specific return code from a lookup\n       operation.  All implementations MUST return a value\n       of 0 for this object when the remote lookup\n       operation succeeds.  A non-zero value for this\n       objects indicates failure.  It is recommended that\n       implementations return the error codes that are\n       generated by the lookup function used.\"\n   ::= { lookupCtlEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCtlRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This object allows entries to be created and deleted in the lookupCtlTable.",
      "zh-CHS": "lookupCtlRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此对象允许在lookupCtlTable中创建和删除条目。"
    },
    {
      "indent": 11,
      "text": "A remote lookup operation is started when an entry in this table is created via an SNMP set request and the entry is activated. This occurs by setting the value of this object to CreateAndGo(4) during row creation or by setting this object to active(1) after the row is created.",
      "zh-CHS": "通过SNMP set请求创建此表中的条目并激活该条目时，将启动远程查找操作。通过在创建行期间将此对象的值设置为CreateAndGo（4），或在创建行后将此对象设置为active（1），可以实现此目的。"
    },
    {
      "indent": 11,
      "text": "A value MUST be specified for lookupCtlTargetAddress prior to the acceptance of a transition to active(1) state. A remote lookup operation starts when its entry first becomes active(1). Transitions in and out of active(1) state have no effect on the operational behavior of a remote lookup operation, with the exception that deletion of an entry in this table by setting its RowStatus object to destroy(6) will stop an active remote lookup operation.",
      "zh-CHS": "在接受转换到活动（1）状态之前，必须为lookupCtlTargetAddress指定一个值。远程查找操作在其条目第一次变为活动状态时开始（1）。进入和退出活动（1）状态的转换对远程查找操作的操作行为没有影响，但通过将该表的RowStatus对象设置为destroy（6）删除该表中的条目将停止活动的远程查找操作。"
    },
    {
      "indent": 7,
      "text": " The operational state of a remote lookup operation can be determined by examination of its lookupCtlOperStatus object.\" REFERENCE",
      "zh-CHS": "远程查找操作的操作状态可以通过检查其lookupCtlOperStatus对象来确定。“参考"
    },
    {
      "indent": 7,
      "text": "    \"See definition of RowStatus in RFC 2579,\n    'Textual Conventions for SMIv2.'\"\n::= { lookupCtlEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- Lookup Results Table",
      "zh-CHS": "--查找结果表"
    },
    {
      "indent": 4,
      "text": "lookupResultsTable OBJECT-TYPE SYNTAX SEQUENCE OF LookupResultsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Defines the Lookup Results Table for providing the capability of determining the results of a operation at a remote host.",
      "zh-CHS": "lookupResultsTable对象类型LookupResultsEntry MAX-ACCESS不可访问状态当前描述的语法序列“定义查找结果表，以提供在远程主机上确定操作结果的功能。"
    },
    {
      "indent": 11,
      "text": "One or more entries are added to the lookupResultsTable when a lookup operation, as reflected by an lookupCtlEntry, is completed successfully. All entries related to a successful lookup operation MUST be added to the lookupResultsTable at the same time that the associating lookupCtlOperStatus object is transitioned to completed(2).",
      "zh-CHS": "当lookupCtlEntry所反映的查找操作成功完成时，将向lookupResultsTable添加一个或多个条目。必须在关联的lookupCtlOperStatus对象转换为completed（2）的同时，将与成功查找操作相关的所有条目添加到lookupResultsTable。"
    },
    {
      "indent": 11,
      "text": "The number of entries added depends on the results determined for a particular lookup operation. All entries associated with an lookupCtlEntry are removed when the lookupCtlEntry is deleted.",
      "zh-CHS": "添加的条目数取决于为特定查找操作确定的结果。删除lookupCtlEntry时，将删除与lookupCtlEntry关联的所有条目。"
    },
    {
      "indent": 11,
      "text": "A remote host can be multi-homed and have more than one IP address associated with it (returned by lookup function), or it can have more than one symbolic name (returned by lookup function).",
      "zh-CHS": "远程主机可以是多主机，并且具有多个与其关联的IP地址（由查找函数返回），也可以具有多个符号名（由查找函数返回）。"
    },
    {
      "indent": 11,
      "text": "A function such as, for example, getnameinfo() or gethostbyaddr() is called with a host address as its parameter and is used primarily to determine a symbolic name to associate with the host address. Entries in the lookupResultsTable MUST be made for each host name returned. If the function identifies an 'official host name,' then this symbolic name MUST be assigned a lookupResultsIndex of 1.",
      "zh-CHS": "以主机地址作为参数调用函数，例如getnameinfo（）或gethostbyaddr（），主要用于确定要与主机地址关联的符号名。必须为返回的每个主机名创建lookupResultsTable中的条目。如果函数标识“正式主机名”，则必须为该符号名分配lookupResultsIndex 1。"
    },
    {
      "indent": 11,
      "text": "A function such as, for example, getaddrinfo() or gethostbyname() is called with a symbolic host name and is used primarily to retrieve a host address. The entries",
      "zh-CHS": "例如，使用符号主机名调用getaddrinfo（）或gethostbyname（）等函数，主要用于检索主机地址。参赛作品"
    },
    {
      "indent": 6,
      "text": "     MUST be stored in the order that they are retrieved from\n     the lookup function.  lookupResultsIndex 1 MUST be\n     assigned to the first entry.\"\n::= { lookupObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupResultsEntry OBJECT-TYPE\n   SYNTAX      LookupResultsEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n       \"Defines an entry in the lookupResultsTable.  The\n       first two index elements identify the\n       lookupCtlEntry that a lookupResultsEntry belongs\n       to.  The third index element selects a single\n       lookup operation result.\"\n   INDEX {\n            lookupCtlOwnerIndex,\n            lookupCtlOperationName,\n            lookupResultsIndex\n         }\n   ::= { lookupResultsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "LookupResultsEntry ::=\n   SEQUENCE {\n       lookupResultsIndex        Unsigned32,\n       lookupResultsAddressType  InetAddressType,\n       lookupResultsAddress      InetAddress\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupResultsIndex OBJECT-TYPE SYNTAX Unsigned32 (1..'ffffffff'h) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Entries in the lookupResultsTable are created when the result of a lookup operation is determined.",
      "zh-CHS": "lookupResultsIndex对象类型语法Unsigned32（1..'ffffffff'h）MAX-ACCESS not accessible STATUS current DESCRIPTION“在确定查找操作的结果时，将创建lookupResultsTable中的条目。"
    },
    {
      "indent": 7,
      "text": "    Entries MUST be stored in the lookupResultsTable in\n    the order that they are retrieved.  Values assigned\n    to lookupResultsIndex MUST start at 1 and increase\n    consecutively.\"\n::= { lookupResultsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupResultsAddressType OBJECT-TYPE SYNTAX InetAddressType MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "LookupResultsAdressType对象类型语法InetAddressType MAX-ACCESS只读状态当前说明"
    },
    {
      "indent": 7,
      "text": "    \"Indicates the type of result of a remote lookup\n    operation.  A value of unknown(0) implies either that\n    the operation hasn't been started or that\n    it has failed.\"\n::= { lookupResultsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupResultsAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"Reflects a result for a remote lookup operation as per the value of lookupResultsAddressType.",
      "zh-CHS": "lookupResultsAddress对象类型语法InetAddress MAX-ACCESS只读状态当前描述”根据lookupResultsAddressType的值反映远程查找操作的结果。"
    },
    {
      "indent": 11,
      "text": "The address type (InetAddressType) that relates to this object is specified by the corresponding value of lookupResultsAddress.\"",
      "zh-CHS": "与此对象相关的地址类型（InetAddressType）由lookupResultsAddress的相应值指定。“"
    },
    {
      "indent": 7,
      "text": "::= { lookupResultsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Conformance information\n-- Compliance statements",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupCompliances OBJECT IDENTIFIER ::= { lookupConformance 1 }\nlookupGroups      OBJECT IDENTIFIER ::= { lookupConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- Compliance statements",
      "zh-CHS": "--合规声明"
    },
    {
      "indent": 4,
      "text": "lookupCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for SNMP entities that fully implement the DISMAN-NSLOOKUP-MIB.\" MODULE -- this module MANDATORY-GROUPS { lookupGroup }",
      "zh-CHS": "lookupCompliance MODULE-COMPLIANCE STATUS当前描述“完全实现DISMAN-NSLOOKUP-MIB的SNMP实体的符合性声明。”模块--此模块为必填模块-GROUPS{lookupGroup}"
    },
    {
      "indent": 11,
      "text": "OBJECT lookupMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "对象查找MaxConcurrentRequests MIN-ACCESS只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT lookupPurgeTime MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support a set operation to this object.\"",
      "zh-CHS": "OBJECT lookupPurgeTime MIN-ACCESS只读说明“代理不需要支持此对象的设置操作。”"
    },
    {
      "indent": 7,
      "text": "::= { lookupCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "lookupMinimumCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The minimum compliance statement for SNMP entities that implement the minimal subset of the DISMAN-NSLOOKUP-MIB. Implementors might choose this subset for small devices with limited resources.\" MODULE -- this module MANDATORY-GROUPS { lookupGroup }",
      "zh-CHS": "lookupMinimumCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION“实现DISAN-NSLOOKUP-MIB最小子集的SNMP实体的最小符合性声明。实现者可以为资源有限的小型设备选择此子集。”MODULE--此模块为必填项-GROUPS{lookupGroup}"
    },
    {
      "indent": 11,
      "text": "OBJECT lookupMaxConcurrentRequests MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support set operations to this object.\"",
      "zh-CHS": "对象查找MaxConcurrentRequests MIN-ACCESS只读说明“不需要代理来支持对此对象的设置操作。”"
    },
    {
      "indent": 11,
      "text": "OBJECT lookupPurgeTime MIN-ACCESS read-only DESCRIPTION \"The agent is not required to support a set operation to this object.\"",
      "zh-CHS": "OBJECT lookupPurgeTime MIN-ACCESS只读说明“代理不需要支持此对象的设置操作。”"
    },
    {
      "indent": 7,
      "text": "    OBJECT lookupCtlRowStatus\n    MIN-ACCESS  read-only\n    DESCRIPTION\n        \"Write access is not required.  If write access is\n        not supported, then at least one entry in the\n        lookupCtlTable MUST be established already when the SNMP\n        agent starts offering access to the NSLOOKUP-MIB module.\n        If, in such a case, only a single entry is offered, then\n        it is RECOMMENDED that this entry use strings with a\n        length of 0 for both of its two index objects.\"\n::= { lookupCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "-- MIB groupings",
      "zh-CHS": "--MIB分组"
    },
    {
      "indent": 4,
      "text": "lookupGroup OBJECT-GROUP OBJECTS { lookupMaxConcurrentRequests, lookupPurgeTime, lookupCtlOperStatus, lookupCtlTargetAddressType, lookupCtlTargetAddress, lookupCtlTime, lookupCtlRc, lookupCtlRowStatus,",
      "zh-CHS": "lookupGroup对象组对象{lookupMaxConcurrentRequests，lookupPurgeTime，LookupCtlOpertStatus，lookupCtlTargetAddressType，lookupCtlTargetAddress，lookupCtlTime，lookupCtlRc，lookupCtlRowStatus，"
    },
    {
      "indent": 6,
      "text": "          lookupResultsAddressType,\n          lookupResultsAddress\n        }\nSTATUS  current\nDESCRIPTION\n    \"The group of objects that constitute the remote\n    Lookup operation.\"\n ::= { lookupGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in the three MIB modules with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations. These are the tables and objects and their sensitivity/vulnerability:",
      "zh-CHS": "在三个MIB模块中定义了许多管理对象，其中MAX-ACCESS子句为read-write和/或read-create。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作可能会对网络操作产生负面影响。以下是表和对象及其敏感度/漏洞："
    },
    {
      "indent": 3,
      "text": "o pingMaxConcurrentRequests o traceRouteMaxConcurrentRequests o lookupMaxConcurrentRequests The MIB modules limit their maximum numbers of concurrent requests by the values of these objects. Unauthorized access to them may lead to an overload of the managed node and to a disruption of other functions of the managed node.",
      "zh-CHS": "o pingMaxConcurrentRequests o TracerOutMaxConcurrentRequests o lookupMaxConcurrentRequests MIB模块通过这些对象的值限制其最大并发请求数。未经授权的访问可能会导致受管节点过载，并中断受管节点的其他功能。"
    },
    {
      "indent": 3,
      "text": "o pingCtlTable o traceRouteCtlTable o lookupCtlTable All objects in entries of these tables (except index objects) have a MAX-ACCESS clause of read-create. Unauthorized access to these objects can disturb the measurements controlled by the tables. Also, the functions offered by the MIB modules can be misused for illegal data retrieval and for attacking other systems by floods of ping probes, traceroute probes or lookup requests, respectively.",
      "zh-CHS": "o pingCtlTable o traceroutectlable o lookupCtlTable这些表的条目中的所有对象（索引对象除外）都具有read create的MAX-ACCESS子句。未经授权访问这些对象可能会干扰由表格控制的测量。此外，MIB模块提供的功能可能被误用于非法数据检索，以及分别通过大量ping探测、traceroute探测或查找请求攻击其他系统。"
    },
    {
      "indent": 3,
      "text": "In general, all three, the ping, traceroute, and lookup functions, when used excessively are considered a form of system attack. In the case of ping, sending a system request too often can negatively effect its performance and attempting to connect to what is supposed to be an unused port can be very unpredictable. Excessive use of the traceroute capability can, like ping, negatively affect system performance. The same applies to excessive use of the lookup service, particularly if the lookup cannot be resolved locally. In",
      "zh-CHS": "通常，ping、traceroute和lookup这三个函数在过度使用时都被认为是一种系统攻击。在ping的情况下，过于频繁地发送系统请求可能会对其性能产生负面影响，并且尝试连接到假定为未使用的端口可能非常不可预测。过度使用traceroute功能会像ping一样对系统性能产生负面影响。这同样适用于过度使用查找服务，尤其是当无法在本地解析查找时。在里面"
    },
    {
      "indent": 3,
      "text": "insecure environments, it is RECOMMENDED that the MIBs defined within this memo not be supported.",
      "zh-CHS": "如果环境不安全，建议不支持此备忘录中定义的MIB。"
    },
    {
      "indent": 3,
      "text": "o lookupPurgeTime Unauthorized access to this object can lead to the deletion of results of lookup operations before they are read by a management system, if the object is set to 0 or small values close to 0. If the object is set to very high values, unauthorized access can lead to a high consumption of resources for storing lookup results.",
      "zh-CHS": "o lookupPurgeTime未经授权访问此对象可能会导致在管理系统读取查找操作的结果之前删除这些结果（如果对象设置为0或接近0的小值）。如果将对象设置为非常高的值，则未经授权的访问可能会导致存储查找结果的资源消耗过高。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. However, the only information that can be disclosed without encryption is the configuration and results of measurements that are performed by implementations of the MIB modules.",
      "zh-CHS": "在某些网络环境中，此MIB模块中的某些可读对象（即具有MAX-ACCESS而非not ACCESS的对象）可能被视为敏感或易受攻击。因此，在通过SNMP通过网络发送这些对象时，控制甚至获取和/或通知对这些对象的访问，甚至可能加密这些对象的值，这一点非常重要。然而，在没有加密的情况下可以公开的唯一信息是由MIB模块的实现执行的测量的配置和结果。"
    },
    {
      "indent": 3,
      "text": "To facilitate the provisioning of access control by a security administrator using the View-Based Access Control Model (VACM), defined in RFC 3415 [RFC3415], for tables in which multiple users may need to create or modify entries independently, the initial index is used as an \"owner index.\" Such an initial index has a syntax of SnmpAdminString and can thus be trivially mapped to a securityName or groupName defined in VACM, in accordance with a security policy.",
      "zh-CHS": "为了便于安全管理员使用RFC 3415[RFC3415]中定义的基于视图的访问控制模型（VACM）提供访问控制，对于多个用户可能需要独立创建或修改条目的表，初始索引用作“所有者索引”这样的初始索引具有snmpadmin语法，因此可以根据安全策略简单地映射到VACM中定义的securityName或groupName。"
    },
    {
      "indent": 3,
      "text": "All entries in related tables belonging to a particular user will have the same value for this initial index. For a given user's entries in a particular table, the object identifiers for the information in these entries will have the same subidentifiers (except for the \"column\" subidentifier) up to the end of the encoded owner index. To configure VACM to permit access to this portion of the table, one would create vacmViewTreeFamilyTable entries with the value of vacmViewTreeFamilySubtree including the owner index portion, and vacmViewTreeFamilyMask 'wildcarding' the column subidentifier. More elaborate configurations are possible. The VACM access control mechanism described above provides control.",
      "zh-CHS": "相关表中属于特定用户的所有条目对此初始索引具有相同的值。对于特定表中的给定用户项，这些项中信息的对象标识符在编码的所有者索引结束之前将具有相同的子标识符（除了“列”子标识符）。要将VACM配置为允许访问表的这一部分，可以创建vacmViewTreeFamilyTable条目，其值为vacmViewTreeFamilySubtree，包括所有者索引部分，以及VACMVIEWTREEFAMILYMAK“通配符”列子标识符。更复杂的配置是可能的。上述VACM访问控制机制提供控制。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is",
      "zh-CHS": "SNMPv3之前的SNMP版本未包含足够的安全性。即使网络本身是安全的（例如通过使用IPSec），也无法控制安全网络上的用户"
    },
    {
      "indent": 3,
      "text": "allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "zh-CHS": "允许访问和获取/设置（读取/更改/创建/删除）此MIB模块中的对象。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "zh-CHS": "建议实施者考虑SNMPv3框架所提供的安全特性（参见[RCFC310]，第8节），包括对SNMPv3加密机制的完全支持（用于身份验证和隐私）。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "此外，不建议部署SNMPv3之前的SNMP版本。相反，建议部署SNMPv3并启用加密安全性。然后，客户/运营商应负责确保授予访问此MIB模块实例权限的SNMP实体已正确配置为仅授予那些拥有确实获取或设置（更改/创建/删除）对象的合法权限的主体（用户）访问对象。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "This document is a product of the DISMAN Working Group. Thanks to Eduardo Cardona for suggesting the minimum compliance statements and to Juergen Schoenwaelder for the very detailed and constructive MIB review.",
      "zh-CHS": "本文件是DEMAN工作组的成果。感谢Eduardo Cardona提出最低合规性声明，感谢Juergen Schoenwaeld进行非常详细和建设性的MIB审查。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M., and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.，和S.Waldbusser，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M., and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.，和S.Waldbusser，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M., and S. Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Perkins，D.，Schoenwaeld，J.，Case，J.，Rose，M.，和S.Waldbusser，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "zh-CHS": "[RFC2863]McCloghrie，K.和F.Kastenholz，“接口组MIB”，RFC 28632000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "zh-CHS": "[RFC3411]Harrington，D.，Presohn，R.，和B.Wijnen，“描述简单网络管理协议（SNMP）管理框架的体系结构”，STD 62，RFC 3411，2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., and J. Schoenwaelder, \"Textual Conventions for Internet Network Addresses\", RFC 4001, February 2005.",
      "zh-CHS": "[RFC4001]Daniele，M.，Haberman，B.，Routhier，S.，和J.Schoenwaeld，“互联网网络地址的文本约定”，RFC 4001，2005年2月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC792] Postel, J., \"Internet Control Message Protocol\", STD 5, RFC 792, September 1981.",
      "zh-CHS": "[RFC792]Postel，J.，“互联网控制消息协议”，STD 5，RFC 792，1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC862] Postel, J., \"Echo Protocol\", STD 20, RFC 862, May 1983.",
      "zh-CHS": "[RFC862]Postel，J.，“回波协议”，STD 20，RFC 862，1983年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1812] Baker, F., \"Requirements for IP Version 4 Routers\", RFC 1812, June 1995.",
      "zh-CHS": "[RFC1812]Baker，F.，“IP版本4路由器的要求”，RFC1812，1995年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2474] Nichols, K., Blake, S., Baker, F., and D. Black, \"Definition of the Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998.",
      "zh-CHS": "[RFC2474]Nichols，K.，Blake，S.，Baker，F.，和D.Black，“IPv4和IPv6头中区分服务字段（DS字段）的定义”，RFC 2474，1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3260] Grossman, D., \"New Terminology and Clarifications for Diffserv\", RFC 3260, April 2002.",
      "zh-CHS": "[RFC3260]Grossman，D.“区分服务的新术语和澄清”，RFC 3260，2002年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D. and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 34102002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3415] Wijnen, B., Presuhn, R., and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", STD 62, RFC 3415, December 2002.",
      "zh-CHS": "[RFC3415]Wijnen，B.，Presuhn，R.，和K.McCloghrie，“用于简单网络管理协议（SNMP）的基于视图的访问控制模型（VACM）”，STD 62，RFC 3415，2002年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Juergen Quittek NEC Europe Ltd. Network Laboratories Kurfuersten-Anlage 36 69115 Heidelberg Germany",
      "zh-CHS": "德国海德堡Juergen Quittek NEC欧洲有限公司网络实验室Kurfuersten Anlage 36 69115"
    },
    {
      "indent": 3,
      "text": "Phone: +49 6221 4342-115\nEMail: quittek@netlab.nec.de",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Kenneth D. White Dept. BRQA/Bldg. 501/G114 IBM Corporation P.O.Box 12195 3039 Cornwallis Research Triangle Park, NC 27709, USA",
      "zh-CHS": "Kenneth D.White部门BRQA/Bldg.501/G114 IBM公司邮箱12195 3039美国北卡罗来纳州康沃利斯三角研究园，邮编27709"
    },
    {
      "indent": 3,
      "text": "EMail: wkenneth@us.ibm.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}