{
  "title": {
    "text": "RFC 4350: A Uniform Resource Name (URN) Formal Namespace for the New Zealand Government",
    "zh-CHS": "RFC 4350"
  },
  "number": 4350,
  "created_at": "2021-11-13 16:25:53.054162+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        F. Hendrikx\nRequest for Comments: 4350                                     C. Wallis\nCategory: Informational                           New Zealand Government\n                                                           February 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "A Uniform Resource Name (URN) Formal Namespace for the New Zealand Government",
      "zh-CHS": "新西兰政府的统一资源名（URN）正式名称空间"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) Namespace Identification (NID)convention as prescribed by the World Wide Web Consortium (W3C) for identifying, naming, assigning, and managing persistent resources and XML artefacts for the New Zealand Government.",
      "zh-CHS": "本文档描述了由万维网联盟（W3C）规定的统一资源名称（URN）命名空间标识（NID）约定，用于为新西兰政府标识、命名、分配和管理持久资源和XML人工制品。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The New Zealand Government has already adopted XML as its primary means of storing and exchanging data. The New Zealand Government publishes documents, schemas, and other government artefacts.",
      "zh-CHS": "新西兰政府已经采用XML作为其存储和交换数据的主要手段。新西兰政府发布文档、模式和其他政府人工制品。"
    },
    {
      "indent": 3,
      "text": "The New Zealand Government now wishes to define a namespace convention and structure for its agencies by creating and managing globally unique, persistent, location-independent identifiers for their schema resources and XML artefacts.",
      "zh-CHS": "新西兰政府现在希望通过为其架构资源和XML人工制品创建和管理全球唯一、持久、位置独立的标识符，为其机构定义名称空间约定和结构。"
    },
    {
      "indent": 3,
      "text": "This is a natural extension of the development of the Dublin Core based New Zealand Government metadata standard (New Zealand Government Locator Service, or NZGLS) used by government agencies to create metadata and made operational to the public through an all-of-government portal.",
      "zh-CHS": "这是基于都柏林核心的新西兰政府元数据标准（新西兰政府定位服务，简称NZGLS）开发的自然延伸，政府机构使用该标准创建元数据，并通过政府门户向公众开放。"
    },
    {
      "indent": 3,
      "text": "The New Zealand Government wishes to provide guidance on namespaces to its agencies so that they use a portion of the adopted namespace to minimise the risk of their creating different (and potentially conflicting) namespace structures. This issue potentially extends to",
      "zh-CHS": "新西兰政府希望向其机构提供有关名称空间的指导，以便它们使用所采用名称空间的一部分，以最大限度地降低创建不同（且可能冲突）名称空间结构的风险。这一问题可能延伸到"
    },
    {
      "indent": 3,
      "text": "data exchange beyond government into the private sector of New Zealand, thus placing the government under an obligation to provide guidance in the assignment and management of additional namespaces.",
      "zh-CHS": "将政府以外的数据交换到新西兰私营部门，从而使政府有义务在分配和管理其他名称空间方面提供指导。"
    },
    {
      "indent": 3,
      "text": "The New Zealand Government wishes to register the country NID, NZL, with the Name Specific String (NSS) split into two parts; the first part being a specific sub-type <nz-specifier> and the second part as a <nz-specifier defined string>.",
      "zh-CHS": "新西兰政府希望注册国家NID，NZL，名称特定字符串（NSS）分为两部分；第一部分是特定的子类型<nz说明符>，第二部分是<nz说明符定义的字符串>。"
    },
    {
      "indent": 3,
      "text": "As part of the URN structure, the New Zealand Government wishes to define and subsequently manage the \"govt\" specifier. It will also assign additional specifiers requested by other New Zealand organisations in accordance with the rules and processes proposed herein.",
      "zh-CHS": "作为URN结构的一部分，新西兰政府希望定义并随后管理“政府”说明符。它还将根据本文提出的规则和流程，指定其他新西兰组织要求的其他规范。"
    },
    {
      "indent": 3,
      "text": "The New Zealand Government hoped to make use of the two-letter Namespace Identifier (NID) combination for its ubiquitous country code, NZ. But since there is as yet no process to register these (see RFC 3406 [1]) the government has opted to request its well-known alternative three-letter country code (see ISO 3166 [3]).",
      "zh-CHS": "新西兰政府希望将两个字母的名称空间标识符（NID）组合用于其无处不在的国家代码新西兰。但由于目前还没有注册这些国家代码的程序（见RFC 3406[1]），政府选择了申请其著名的三字母国家代码替代方案（见ISO 3166[3]）。"
    },
    {
      "indent": 3,
      "text": "This namespace specification requests a formal namespace (see [6] for more information about formal namespaces).",
      "zh-CHS": "此名称空间规范请求一个正式名称空间（有关正式名称空间的更多信息，请参见[6]）。"
    },
    {
      "indent": 3,
      "text": "Please note that this paper includes a discussion on the use of diacritic marks, in particular, Maori macrons. Maori is an official language of New Zealand. In recognition of the established practice of publishing RFCs for a global audience in ASCII text where diacritic marks are unable to be recognised, the text has been presented without macrons.",
      "zh-CHS": "请注意，本文讨论了变音符号的使用，特别是毛利马克龙。毛利语是新西兰的官方语言。鉴于在无法识别变音符号的ASCII文本中为全球受众发布RFC的既定实践，文本已在不使用宏字符的情况下呈现。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "zh-CHS": "2. 规范模板"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 6,
      "text": "\"NZL\".",
      "zh-CHS": "“NZL”。"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "Version Number: 1 Date: 2005-03-31",
      "zh-CHS": "版本号：1日期：2005-03-31"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "State Services Commission New Zealand Government 100 Molesworth Street Wellington, New Zealand",
      "zh-CHS": "新西兰国家服务委员会新西兰政府惠灵顿莫尔斯沃思街100号"
    },
    {
      "indent": 6,
      "text": "Email: e-GIF@ssc.govt.nz",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "zh-CHS": "结构声明："
    },
    {
      "indent": 6,
      "text": "The identifier has a hierarchical structure as follows:",
      "zh-CHS": "标识符具有如下层次结构："
    },
    {
      "indent": 6,
      "text": "urn:nzl:<nz-specifier>[:<nz-specifier defined string>]+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "+ denotes one or more occurrences of nz-specifier defined strings all delimited by a colon.",
      "zh-CHS": "+ 表示所有由冒号分隔的nz说明符定义的字符串的一个或多个实例。"
    },
    {
      "indent": 6,
      "text": "For example:",
      "zh-CHS": "例如："
    },
    {
      "indent": 6,
      "text": "urn:nzl:govt:registering:dogs:registration:1-0\nurn:nzl:govt:registering:firearms:form:1-3\nurn:nzl:govt:registering:recreational_fishing:form:1-0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "The <nz-specifier> and <nz-specifier defined string> can comprise any UTF-8 characters compliant with URI syntax and must not contain the \":\" character (see STD 66, RFC 3986 [2]). The exclusion of the colon from the list of other characters means that the colon can only occur as a delimiter between string values. The values come from the terms listed in the NZGLS.",
      "zh-CHS": "<nz说明符>和<nz说明符定义的字符串>可以包含任何符合URI语法的UTF-8字符，并且不能包含“：”字符（请参阅STD 66，RFC 3986[2]）。从其他字符列表中排除冒号意味着冒号只能作为字符串值之间的分隔符出现。这些值来自NZGLS中列出的术语。"
    },
    {
      "indent": 6,
      "text": "The State Services Commission (SSC) will take responsibility for the <nz-specifier> \"govt\" and its sub level <nz-specifier defined string> terms; e.g., \"registering\".",
      "zh-CHS": "国家服务委员会（SSC）将负责<nz说明符>“政府”及其下级<nz说明符定义字符串>术语；e、 例如，“登记”。"
    },
    {
      "indent": 6,
      "text": "The SSC will take responsibility to assign other <nz-specifiers> to organisations who apply and can satisfy the SSC that they have the capability to manage the sub level and its applicable <nz-specifier defined string(s)>.",
      "zh-CHS": "SSC将负责将其他<nz说明符>分配给申请的组织，并使SSC确信他们有能力管理下级及其适用的<nz说明符定义字符串>。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "The function and noun syntax used in the <nz-specifier defined string> is based on and taken from the NZGLS (http://www.e.govt.nz/standards/nzgls/thesauri/).",
      "zh-CHS": "<nz specifier defined string>中使用的函数和名词语法基于并取自NZGLS(http://www.e.govt.nz/standards/nzgls/thesauri/)."
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "Identifiers in the <nz-specifier> \"govt\" are defined and assigned in the requested namespace by the SSC after ensuring that the URNs to be assigned are unique. Uniqueness is achieved by checking against the registry of previously assigned names.",
      "zh-CHS": "SSC在确保要分配的URN是唯一的后，在请求的命名空间中定义并分配<nz specifier>“govt”中的标识符。唯一性是通过检查以前分配的名称的注册表来实现的。"
    },
    {
      "indent": 6,
      "text": "The SSC will ensure that the URNs to be assigned to other organisations applying for other <nz-specifier(s)> (e.g., mil, co, org) are unique by checking against the registry of previously assigned names.",
      "zh-CHS": "SSC将确保分配给申请其他<新西兰规范者>（如mil、co、org）的其他组织的URN是唯一的，方法是对照先前分配的名称登记簿进行检查。"
    },
    {
      "indent": 6,
      "text": "The SSC will develop and publish the process for doing this, which, where applicable, is consistent with the process it uses for moderating the .govt.nz Top Level Domain (TLD).",
      "zh-CHS": "SSC将制定并公布相关流程，适用时，该流程应与其用于调节.govt.nz顶级域名（TLD）的流程一致。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 6,
      "text": "The New Zealand Government is committed to maintaining uniqueness and persistence of all resources identified by assigned URNs.",
      "zh-CHS": "新西兰政府致力于保持指定骨灰盒确定的所有资源的独特性和持久性。"
    },
    {
      "indent": 6,
      "text": "Given that the URN sought is NZL (the long-held ISO 3166 Alpha-3 representation of the country) and that the country's independence from any other jurisdiction expected to continue indefinitely, the URN should also persist indefinitely.",
      "zh-CHS": "鉴于所寻求的URN为NZL（该国长期持有的ISO 3166 Alpha-3代表），且该国独立于任何其他司法管辖区的情况预计将无限期持续下去，URN也应无限期持续下去。"
    },
    {
      "indent": 6,
      "text": "Likewise, the <nz-specifier> \"govt\" has a very long life expectancy and can be expected to remain unique for the foreseeable future. The assignment process guarantees that names are not reassigned. The binding between the name and its resource is permanent.",
      "zh-CHS": "同样地，<nz specifier>“govt”的预期寿命很长，在可预见的未来仍将是独一无二的。分配过程保证不会重新分配名称。名称与其资源之间的绑定是永久的。"
    },
    {
      "indent": 6,
      "text": "The SSC will ensure that other organisations applying to manage other <nz-specifier> Second Level Name (2LN) sub-levels of the NZL URN namespace (e.g., mil, co, org) uniquely assign the namespace at this level.",
      "zh-CHS": "SSC将确保申请管理NZL URN名称空间（如mil、co、org）的其他<nz specifier>二级名称（2LN）子级别的其他组织在该级别唯一分配名称空间。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 6,
      "text": "Under the \"NZL\" NID, the New Zealand Government will manage the <nz-specifier> \"govt\" and leverage the existing NZGLS thesaurus for identifier resources to maintain uniqueness.",
      "zh-CHS": "根据“NZL”NID，新西兰政府将管理<nz specifier>“govt”，并利用现有的NZGLS同义词表获取标识符资源，以保持唯一性。"
    },
    {
      "indent": 6,
      "text": "The process of assigning URNs at the <nz-specifier> sub-level will be managed by the SSC of the New Zealand Government. (The SSC has managed and maintained the NZGLS thesauri since its inception in 2002 and has moderated the TLD .govt.nz).",
      "zh-CHS": "在<nz specifier>子级别分配URN的过程将由新西兰政府的SSC管理。（自2002年NZGLS同义词表成立以来，SSC一直在管理和维护该同义词表，并主持了TLD.govt.nz）。"
    },
    {
      "indent": 6,
      "text": "The SSC will develop and publish the process for doing this, which is consistent with the process it uses for moderating the .govt.nz TLD, where applicable. The process for marketing the \".govt.nz\" TLD can be found at these links:",
      "zh-CHS": "SSC将制定并公布相关流程，该流程与其用于调节.govt.nz TLD的流程一致（如适用）。可通过以下链接找到“.govt.nz”TLD的营销流程："
    },
    {
      "indent": 9,
      "text": "http://www.e.govt.nz/moderation/mod-policy/chapter1.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "and",
      "zh-CHS": "和"
    },
    {
      "indent": 9,
      "text": "http://www.e.govt.nz/moderation/mod-policy/chapter2.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "The process is drawn from the 2LD policies and procedures of the New Zealand Office of the Domain Name Commissioner, http://dnc.org.nz (and specifically http://www.dnc.org.nz/story/30043-35-1.html).",
      "zh-CHS": "该流程源自新西兰域名专员办公室的2LD政策和程序，http://dnc.org.nz （具体而言http://www.dnc.org.nz/story/30043-35-1.html)."
    },
    {
      "indent": 6,
      "text": "Other New Zealand organisations may apply to the SSC to delegate specifiers for resolution and management assigned by them. Delegation of this responsibility will not be unreasonably withheld provided that the processes for their resolution and management are robust and are followed.",
      "zh-CHS": "其他新西兰组织可向SSC提出申请，委托指定人员进行其指定的处置和管理。如果处置和管理流程健全且得到遵守，则不会无理拒绝该责任的授权。"
    },
    {
      "indent": 6,
      "text": "Organisations who apply to have a <nz-specifier> assigned to them must satisfy the SSC that they have the capability to manage the 2LN sub-level and its applicable <nz-specifier defined string(s)> responsibly. The policies and procedures in the links above will be provided to applicants as a guide and will be used by the SSC to determine the applicant's capability.",
      "zh-CHS": "申请分配<nz说明符>的组织必须满足SSC的要求，即他们有能力负责任地管理2LN子级别及其适用的<nz说明符定义字符串>。上述链接中的政策和程序将作为指南提供给申请人，SSC将使用这些政策和程序确定申请人的能力。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 6,
      "text": "For the <nz-specifier> \"govt\", the SSC will maintain lists of assigned identifiers on its web pages at http://www.e.govt.nz/.",
      "zh-CHS": "对于<nz说明符>“政府”，SSC将在其网页上维护指定标识符列表，网址为http://www.e.govt.nz/."
    },
    {
      "indent": 6,
      "text": "The SSC will require other organisations that apply to manage other <nz-specifier> sub-levels to follow this practice unless there are specific reasons (e.g., security) not to do so.",
      "zh-CHS": "SSC将要求申请管理其他<nz specifier>子级别的其他组织遵循此做法，除非有特殊原因（如安全）不这样做。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "The lexical equivalence of the NZL namespace-specific strings (NSSs) is defined as an exact, but not case-sensitive, string match. Best Practice guidelines will specify:",
      "zh-CHS": "NZL命名空间特定字符串（NSSs）的词汇等价性定义为精确的、但不区分大小写的字符串匹配。最佳做法准则将具体规定："
    },
    {
      "indent": 6,
      "text": "a) NZL in either uppercase or lowercase (The New Zealand government will assign names as case-insensitive, to ensure that there will not be two NZL URNs differing only by case.)",
      "zh-CHS": "a) NZL大写或小写（新西兰政府将名称指定为不区分大小写，以确保不会有两个NZL URN只区分大小写。）"
    },
    {
      "indent": 6,
      "text": "b) The first letter of each <nz-specifier> and <nz specifier defined string> in uppercase or the whole value in lowercase.",
      "zh-CHS": "b) 每个<nz说明符>和<nz说明符定义的字符串>的第一个字母为大写，或整个值为小写。"
    },
    {
      "indent": 6,
      "text": "c) Any identifier in NZL namespaces can be compared using the normal mechanisms for percent-encoded UTF-8 strings.",
      "zh-CHS": "c) NZL名称空间中的任何标识符都可以使用百分比编码UTF-8字符串的正常机制进行比较。"
    },
    {
      "indent": 6,
      "text": "Note that textual data containing diacritic marks (such as Maori macrons) will not be treated as lexically equivalent to textual data without diacritic marks; i.e., a distinction will be made. It is important to note that a macron can change the meaning of a word in the Maori language.",
      "zh-CHS": "请注意，包含变音符号的文本数据（如毛利语长音符）在词汇上不会被视为等同于没有变音符号的文本数据；i、 例如，将进行区分。需要注意的是，长音符可以改变毛利语中单词的含义。"
    },
    {
      "indent": 6,
      "text": "The following explanation provides guidance in this respect.",
      "zh-CHS": "以下说明提供了这方面的指导。"
    },
    {
      "indent": 6,
      "text": "NSS is any UTF-8-encoded string that is compliant with the URN syntax (i.e., following the encoding rules for 8-bit characters). Since Maori is an official language in New Zealand and its use of diacritic marks (in this case macrons) invokes the requirement to percent-encode reserved characters, the following extract from RFC 3986 [4] is applicable.",
      "zh-CHS": "NSS是任何符合URN语法（即遵循8位字符的编码规则）的UTF-8编码字符串。由于毛利语是新西兰的一种官方语言，其使用的变音符号（在本例中为长音符）要求对保留字符进行百分比编码，因此以下摘自RFC 3986[4]的摘录适用。"
    },
    {
      "indent": 9,
      "text": "When a new URI scheme defines a component that represents textual data consisting of characters from the Universal Character Set [UCS], the data should first be encoded as octets according to the UTF-8 character encoding [STD63]; then only those octets that do not correspond to characters in the unreserved set should be percent-encoded. For example, the character A would be represented as \"A\", the character LATIN CAPITAL LETTER A WITH GRAVE would be represented as \"%C3%80\", and the character KATAKANA LETTER A would be represented as \"%E3%82%A2\".",
      "zh-CHS": "当一个新的URI方案定义了一个表示由通用字符集[UCS]中的字符组成的文本数据的组件时，应首先根据UTF-8字符编码[STD63]将数据编码为八位字节；然后，只有那些与未保留集中的字符不对应的八位字节才应进行百分比编码。例如，字符A将表示为“A”，带有坟墓的拉丁大写字母A将表示为“%C3%80”，而片假名字母A将表示为“%E3%82%A2”。"
    },
    {
      "indent": 6,
      "text": "As described above, UTF-8 allows the use of diacritic marks such as New Zealand Maori macrons.",
      "zh-CHS": "如上所述，UTF-8允许使用变音标记，如新西兰毛利马克龙。"
    },
    {
      "indent": 6,
      "text": "In the New Zealand context, the word \"Maori\" carries a diacritic mark over the \"a\". A URI including the macronised word \"Maori\" would be percent-encoded as M%C4%81ori.",
      "zh-CHS": "在新西兰的上下文中，“毛利”一词在“a”上带有变音符号。包含宏化单词“毛利”的URI将被百分比编码为M%C4%81ori。"
    },
    {
      "indent": 6,
      "text": "Given that the \"govt\" namespaces will draw from the NZGLS thesaurus (which does not at present utilise diacritic marks), the \"govt\" <nz-specifier> will not utilise UTF-8's percent-encoding convention for diacritic marks. An \"a\" with a diacritic mark will be presented simply as an \"a\". There is no mapping or equivalence table. Therefore, the requirement to distinguish between terms that have diacritic marks and those that do not will not arise in the <nz-specifier> \"govt\".",
      "zh-CHS": "鉴于“政府”名称空间将取自NZGLS同义词表（目前不使用变音符号），“政府”<nz specifier>将不使用UTF-8的变音符号百分比编码约定。带有变音符号的“a”将简单地表示为“a”。没有映射或等价表。因此，<nz specifier>“govt”中不会出现区分有变音符号的术语和没有变音符号的术语的要求。"
    },
    {
      "indent": 6,
      "text": "Other organisations may use diacritic marks with certain conditions. Organisations that apply to manage other <nz-specifier> sub-levels of the NZL URN namespace could utilise UTF-8's diacritic functionality provided that they have the applicable processes to separate Maori language terms using macrons from those that do not, in order to ensure uniqueness in accordance with rule c) above.",
      "zh-CHS": "其他组织可能会在特定条件下使用变音符号。申请管理NZL URN名称空间的其他<nz specifier>子级别的组织可以使用UTF-8的变音功能，前提是他们有适用的流程来区分使用宏字符的毛利语术语和不使用宏字符的毛利语术语，以确保根据上述规则c）的唯一性。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "zh-CHS": "没有特别考虑。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "None other than names being derived from the NZGLS thesaurus \"dictionary\".",
      "zh-CHS": "只有来自NZGLS同义词表“字典”的名称。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "Global, but primarily of national interest.",
      "zh-CHS": "全球，但主要是国家利益。"
    },
    {
      "indent": 0,
      "text": "3. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "3. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "The SSC undertook a preliminary study of the URI alternatives against the key requirements. The options were narrowed down to five. These were a private URI scheme, URL, PURL, IRI, and URN. URN was considered the most appropriate URI against the criteria.",
      "zh-CHS": "SSC针对关键需求对URI备选方案进行了初步研究。选择范围缩小到五个。这些是私有URI方案、URL、PURL、IRI和URN。URN被认为是符合标准的最合适的URI。"
    },
    {
      "indent": 3,
      "text": "Consultation on the preliminary study was actively sought from the Internet Society of NZ (InternetNZ), the NZ Computer Society, applicable vendors, and government agencies. Publication on the e-government web site allowed for public participation.",
      "zh-CHS": "积极征求新西兰互联网协会（InternetNZ）、新西兰计算机协会、适用供应商和政府机构对初步研究的意见。电子政府网站上的出版物允许公众参与。"
    },
    {
      "indent": 3,
      "text": "Points that should be noted are:",
      "zh-CHS": "应注意的要点是："
    },
    {
      "indent": 3,
      "text": "a) With respect to the NID, the New Zealand Government is the first known jurisdiction to apply its globally known ISO 3166 Alpha-3 country code to become a URN. One objective of the ISO 3166 Alpha-2 and 3-letter country codes was to provide uniqueness.",
      "zh-CHS": "a) 关于NID，新西兰政府是第一个将其全球知名的ISO 3166 Alpha-3国家代码应用为URN的司法管辖区。ISO 3166 Alpha-2和3字母国家代码的一个目标是提供唯一性。"
    },
    {
      "indent": 3,
      "text": "b) The namespace follows the logical structure of the NZGLS as shown in the examples above.",
      "zh-CHS": "b) 名称空间遵循NZGLS的逻辑结构，如上面的示例所示。"
    },
    {
      "indent": 0,
      "text": "4. Community Considerations",
      "section_title": true,
      "zh-CHS": "4. 社区考虑"
    },
    {
      "indent": 3,
      "text": "Providers of government information for data exchange benefit by the publication of the namespace because it provides much-needed guidance on generating target namespaces for schema development using a process that reflects what they already know; namely, metadata creation in NZGLS. The identifiers under the \"govt\" specifier will track the terms used in the New Zealand government thesaurus.",
      "zh-CHS": "用于数据交换的政府信息提供者受益于名称空间的发布，因为它提供了非常需要的指导，用于使用反映他们已经知道的过程生成模式开发的目标名称空间；即，在NZGLS中创建元数据。“政府”说明符下的标识符将跟踪新西兰政府同义词库中使用的术语。"
    },
    {
      "indent": 3,
      "text": "Consequently, New Zealanders will ultimately benefit since the exchange of more structured information will potentially improve online experiences in areas such as forms design.",
      "zh-CHS": "因此，新西兰人最终将从中受益，因为更多结构化信息的交流将有可能改善表单设计等领域的在线体验。"
    },
    {
      "indent": 3,
      "text": "Any citizen or organisation with Internet web browser capability will be entitled to access the namespace and its associated application, registration, and resolution services. While the assignment of identifiers will be managed by the SSC, additional specifiers (such as mil, co, org, and their <nz-specifier defined string(s)>) can be openly applied for and registered by anyone following an approved namespace governance process and proof of the applicant's bona fide association with the intended specifier (i.e., no squatting or hoarding).",
      "zh-CHS": "任何具有Internet web浏览器功能的公民或组织都有权访问命名空间及其相关应用程序、注册和解析服务。虽然标识符的分配将由SSC管理，但其他说明符（如mil、co、org及其<nz说明符定义的字符串）可由任何人在批准的名称空间管理流程和申请人与预期说明符的真实关联证明后公开申请和注册（即，禁止蹲下或囤积）。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document includes a URN NID registration for NZL for entry in the IANA registry of URN NIDs (see RFC 2434 [5] for more information).",
      "zh-CHS": "本文件包括NZL的URN NID注册，用于输入URN NID的IANA注册（有关更多信息，请参阅RFC 2434[5]）。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "No serious security implications are envisaged beyond the potential threat of spoofing. The application, registration and assignment of subsequent specifiers will leverage existing government processes to authenticate the applicants and their association with the proposed specifier application.",
      "zh-CHS": "除了潜在的欺骗威胁外，预计不会产生严重的安全影响。后续指定人的申请、注册和分配将利用现有的政府流程来认证申请人及其与拟议指定人申请的关联。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "Since the specification described in this document is derived from STD 66, RFC 3986 and RFC 3406, the acknowledgements in those documents still apply. In addition, the authors wish to acknowledge Leslie Daigle and Ted Hardie for their suggestions and review.",
      "zh-CHS": "由于本文件中描述的规范源自STD 66、RFC 3986和RFC 3406，因此这些文件中的确认仍然适用。此外，作者希望感谢Leslie Daigle和Ted Hardie的建议和评论。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "zh-CHS": "[1] Daigle，L.，van Gulik，D.，Iannella，R.，和P.Faltstrom，“统一资源名（URN）命名空间定义机制”，BCP 66，RFC 3406，2002年10月。"
    },
    {
      "indent": 3,
      "text": "[2] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifiers (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "zh-CHS": "[2] Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[3] ISO 3166, \"Country name codes\", ISO 3166-1:1997.",
      "zh-CHS": "[3] ISO 3166，“国家名称代码”，ISO 3166-1:1997。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[4] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "zh-CHS": "[4] Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[5] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "zh-CHS": "[5] Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 2434，1998年10月。"
    },
    {
      "indent": 3,
      "text": "[6] URI Planning Interest Group, W3C/IETF (See acknowledgments) September 2001, <http://www.w3.org/TR/2001/NOTE-uri-clarification-20010921/>.",
      "zh-CHS": "[6] URI规划利益集团，W3C/IETF（见致谢），2001年9月<http://www.w3.org/TR/2001/NOTE-uri-clarification-20010921/>."
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Ferry Hendrikx Information & Communications Technology (ICT) Branch State Services Commission PO Box 329 Wellington New Zealand",
      "zh-CHS": "Ferry Hendrikx信息和通信技术（ICT）分公司国家服务委员会邮箱329新西兰惠灵顿"
    },
    {
      "indent": 3,
      "text": "Phone: +64 4 495 6600\nEMail: ferry.hendrikx@ssc.govt.nz",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Colin Wallis Information & Communications Technology (ICT) Branch State Services Commission PO Box 329 Wellington New Zealand",
      "zh-CHS": "科林·沃利斯信息和通信技术（ICT）分公司国家服务委员会信箱329新西兰惠灵顿"
    },
    {
      "indent": 3,
      "text": "Phone: +64 4 495 6600\nEMail: colin.wallis@ssc.govt.nz",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}