{
  "title": {
    "text": "RFC 4652: Evaluation of Existing Routing Protocols against Automatic Switched Optical Network (ASON) Routing Requirements",
    "zh-CHS": "RFC 4652"
  },
  "number": 4652,
  "created_at": "2021-11-14 13:44:05.418078+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                              D. Papadimitriou, Ed.\nRequest for Comments: 4652                                       Alcatel\nCategory: Informational                                            L.Ong\n                                                                   Ciena\n                                                               J. Sadler\n                                                                 Tellabs\n                                                                 S. Shew\n                                                                  Nortel\n                                                                 D. Ward\n                                                                   Cisco\n                                                            October 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": " Evaluation of Existing Routing Protocols against Automatic Switched Optical Network (ASON) Routing Requirements",
      "zh-CHS": "根据自动交换光网络（ASON）路由要求评估现有路由协议"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Generalized MPLS (GMPLS) suite of protocols has been defined to control different switching technologies as well as different applications. These include support for requesting TDM connections including Synchronous Optical Network/Synchronous Digital Hierarchy (SONET/SDH) and Optical Transport Networks (OTNs).",
      "zh-CHS": "通用MPLS（GMPLS）协议套件已定义用于控制不同的交换技术以及不同的应用。其中包括支持请求TDM连接，包括同步光网络/同步数字体系（SONET/SDH）和光传输网络（OTN）。"
    },
    {
      "indent": 3,
      "text": "This document provides an evaluation of the IETF Routing Protocols against the routing requirements for an Automatically Switched Optical Network (ASON) as defined by ITU-T.",
      "zh-CHS": "本文件针对ITU-T定义的自动交换光网络（ASON）的路由要求，对IETF路由协议进行了评估。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Certain capabilities are needed to support the ITU-T Automatically Switched Optical Network (ASON) control plane architecture as defined in [G.8080].",
      "zh-CHS": "需要某些功能来支持[G.8080]中定义的ITU-T自动交换光网络（ASON）控制平面架构。"
    },
    {
      "indent": 3,
      "text": "[RFC4258] details the routing requirements for the GMPLS routing suite of protocols to support the capabilities and functionality of ASON control planes identified in [G.7715] and in [G.7715.1]. The ASON routing architecture provides for a conceptual reference architecture, with definition of functional components and common information elements to enable end-to-end routing in the case of protocol heterogeneity and to facilitate management of ASON networks. This description is only conceptual: no physical partitioning of these functions is implied.",
      "zh-CHS": "[RFC4258]详细说明了GMPLS路由协议套件的路由要求，以支持[G.7715]和[G.7715.1]中确定的ASON控制平面的能力和功能。ASON路由体系结构提供了一个概念参考体系结构，定义了功能组件和公共信息元素，以在协议异构的情况下实现端到端路由，并促进ASON网络的管理。这个描述只是概念性的：没有暗示这些函数的物理分区。"
    },
    {
      "indent": 3,
      "text": "However, [RFC4258] does not address GMPLS routing protocol applicability or capabilities. This document evaluates the IETF Routing Protocols against the requirements identified in [RFC4258]. The result of this evaluation is detailed in Section 5. Close examination of applicability scenarios and the result of the evaluation of these scenarios are provided in Section 6.",
      "zh-CHS": "然而，[RFC4258]并未说明GMPLS路由协议的适用性或功能。本文件根据[RFC4258]中确定的要求评估IETF路由协议。评估结果详见第5节。第6节提供了适用性场景的详细检查和这些场景的评估结果。"
    },
    {
      "indent": 3,
      "text": "ASON (Routing) terminology sections are provided in Appendices A and B.",
      "zh-CHS": "ASON（路由）术语部分见附录A和B。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "2. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "The reader is expected to be familiar with the terminology introduced in [RFC4258].",
      "zh-CHS": "读者应熟悉[RFC4258]中介绍的术语。"
    },
    {
      "indent": 0,
      "text": "3. Contributors",
      "section_title": true,
      "zh-CHS": "3. 贡献者"
    },
    {
      "indent": 3,
      "text": "This document is the result of the CCAMP Working Group ASON Routing Solution design team's joint effort.",
      "zh-CHS": "本文档是CCAMP工作组ASON路由解决方案设计团队共同努力的结果。"
    },
    {
      "indent": 6,
      "text": "Dimitri Papadimitriou (Alcatel, Team Leader and Editor) EMail: dimitri.papadimitriou@alcatel.be Chris Hopps (Cisco) EMail: chopps@rawdofmt.org Lyndon Ong (Ciena Corporation) EMail: lyong@ciena.com Jonathan Sadler (Tellabs) EMail: jonathan.sadler@tellabs.com",
      "zh-CHS": "Dimitri Papadimitriou（阿尔卡特，团队负责人和编辑）电子邮件：Dimitri。papadimitriou@alcatel.beChris Hopps（Cisco）电子邮件：chopps@rawdofmt.orgLyndon Ong（Ciena公司）电子邮件：lyong@ciena.com乔纳森·萨德勒（Tellabs）电子邮件：乔纳森。sadler@tellabs.com"
    },
    {
      "indent": 6,
      "text": "Stephen Shew (Nortel Networks) EMail: sdshew@nortel.com Dave Ward (Cisco) EMail: dward@cisco.com",
      "zh-CHS": "Stephen Shew（北电网络）电子邮件：sdshew@nortel.com戴夫·沃德（思科）电子邮件：dward@cisco.com"
    },
    {
      "indent": 0,
      "text": "4. Requirements: Overview",
      "section_title": true,
      "zh-CHS": "4. 要求：概述"
    },
    {
      "indent": 3,
      "text": "The following functionality is expected from GMPLS routing protocols to instantiate the ASON hierarchical routing architecture realization (see [G.7715] and [G.7715.1]):",
      "zh-CHS": "GMPLS路由协议应具有以下功能，以实例化ASON分层路由架构实现（见[G.7715]和[G.7715.1]）："
    },
    {
      "indent": 3,
      "text": "- Routing Areas (RAs) shall be uniquely identifiable within a carrier's network, each having a unique RA Identifier (RA ID) within the carrier's network.",
      "zh-CHS": "- 路由区域（RAs）应在运营商网络内唯一可识别，每个区域在运营商网络内具有唯一的RA标识符（RA ID）。"
    },
    {
      "indent": 3,
      "text": "- Within a RA (one level), the routing protocol shall support dissemination of hierarchical routing information (including summarized routing information for other levels) in support of an architecture of multiple hierarchical levels of RAs; the number of hierarchical RA levels to be supported by a routing protocol is implementation specific.",
      "zh-CHS": "- 在RA（一个级别）内，路由协议应支持分层路由信息（包括其他级别的汇总路由信息）的传播，以支持RAs的多层次架构；路由协议的具体实现级别是RA支持的。"
    },
    {
      "indent": 3,
      "text": "- The routing protocol shall support routing information based on a common set of information elements as defined in [G.7715] and [G.7715.1], divided between attributes pertaining to links and abstract nodes (each representing either a sub-network or simply a node). [G.7715] recognizes that the manner in which the routing information is represented and exchanged will vary with the routing protocol used.",
      "zh-CHS": "- 路由协议应支持基于[G.7715]和[G.7715.1]中定义的公共信息元素集的路由信息，这些信息元素分为与链路和抽象节点有关的属性（每个属性代表一个子网或仅代表一个节点）。[G.7715]认识到路由信息的表示和交换方式将随所使用的路由协议而变化。"
    },
    {
      "indent": 3,
      "text": "- The routing protocol shall converge such that the distributed Routing DataBases (RDB) become synchronized after a period of time.",
      "zh-CHS": "- 路由协议应聚合，以便分布式路由数据库（RDB）在一段时间后变得同步。"
    },
    {
      "indent": 3,
      "text": "To support dissemination of hierarchical routing information, the routing protocol must deliver:",
      "zh-CHS": "为了支持分层路由信息的传播，路由协议必须提供："
    },
    {
      "indent": 3,
      "text": "- Processing of routing information exchanged between adjacent levels of the hierarchy (i.e., Level N+1 and N), including reachability and (upon policy decision) summarized topology information.",
      "zh-CHS": "- 在层次结构的相邻级别（即，级别N+1和N）之间交换的路由信息的处理，包括可达性和（根据策略决策）总结的拓扑信息。"
    },
    {
      "indent": 3,
      "text": "- Self-consistent information at the receiving level resulting from any transformation (filter, summarize, etc.) and forwarding of information from one Routing Controller (RC) to RC(s) at different levels when multiple RCs are bound to a single RA.",
      "zh-CHS": "- 当多个RCs绑定到单个RA时，任何转换（过滤、汇总等）以及从一个路由控制器（RC）到不同级别的RC的信息转发产生的接收级别上的自一致信息。"
    },
    {
      "indent": 3,
      "text": "- A mechanism to prevent re-introduction of information propagated into the Level N RA's RC back to the adjacent level RA's RC from which this information has been initially received.",
      "zh-CHS": "- 一种机制，用于防止将传播到N层RA的RC中的信息重新引入最初接收到该信息的相邻RA的RC。"
    },
    {
      "indent": 3,
      "text": "Note: The number of hierarchical levels to be supported is routing protocol specific and reflects a containment relationship.",
      "zh-CHS": "注意：要支持的层次结构级别的数量是特定于路由协议的，并且反映了包含关系。"
    },
    {
      "indent": 3,
      "text": "Reachability information may be advertised either as a set of UNI Transport Resource address prefixes, or as a set of associated Subnetwork Point Pool (SNPP) link IDs/SNPP link ID prefixes, assigned and selected consistently in their applicability scope. The formats of the control plane identifiers in a protocol realization are implementation specific. Use of a routing protocol within a RA should not restrict the choice of routing protocols for use in other RAs (child or parent).",
      "zh-CHS": "可达性信息可以作为一组UNI传输资源地址前缀，或者作为一组相关联的子网点池（SNPP）链路ID/SNPP链路ID前缀来公布，并在其适用范围内一致地分配和选择。协议实现中的控制平面标识符的格式是特定于实现的。在RA中使用路由协议不应限制在其他RA（子级或父级）中使用的路由协议的选择。"
    },
    {
      "indent": 3,
      "text": "As ASON does not restrict the control plane architecture choice, either a co-located architecture or a physically separated architecture may be used. A collection of links and nodes, such as a sub-network or RA, must be able to represent itself to the wider network as a single logical entity with only its external links visible to the topology database.",
      "zh-CHS": "由于ASON不限制控制平面架构的选择，因此可以使用共址架构或物理上分离的架构。链路和节点的集合（如子网络或RA）必须能够将自身作为单个逻辑实体向更广泛的网络表示，并且拓扑数据库只能看到其外部链路。"
    },
    {
      "indent": 0,
      "text": "5. Evaluation",
      "section_title": true,
      "zh-CHS": "5. 评价"
    },
    {
      "indent": 3,
      "text": "This section evaluates support of existing IETF routing protocols with respect to the requirements summarized from [RFC4258] in Section 4. Candidate routing protocols are Interior Gateway Protocol (IGP) (OSPF and Intermediate System to Intermediate System (IS-IS)) and BGP. The latter is not addressed in the current version of this document. BGP is not considered a candidate protocol mainly because of the following reasons:",
      "zh-CHS": "本节根据第4节[RFC4258]中总结的要求，评估现有IETF路由协议的支持。候选路由协议有内部网关协议（IGP）（OSPF和中间系统到中间系统（IS-IS））和BGP。本文件当前版本未涉及后者。BGP不被视为候选协议，主要原因如下："
    },
    {
      "indent": 3,
      "text": "- Non-support of TE information exchange. Each BGP router advertises only its path to each destination in its vector for loop avoidance, with no costs or hop counts; each BGP router knows little about network topology.",
      "zh-CHS": "- 不支持TE信息交换。每个BGP路由器在其向量中仅播发其到每个目的地的路径，以避免环路，无成本或跳数；每个BGP路由器对网络拓扑知之甚少。"
    },
    {
      "indent": 3,
      "text": "- BGP can only advertise routes that are eligible for use (local RIB) or routing loops can occur; there is one best route per prefix, and that is the route that is advertised.",
      "zh-CHS": "- BGP只能公布符合使用条件的路由（本地RIB），或者可能出现路由环路；每个前缀有一个最佳路由，这就是播发的路由。"
    },
    {
      "indent": 3,
      "text": "- BGP is not widely deployed in optical equipment and networks.",
      "zh-CHS": "- BGP在光设备和网络中的应用并不广泛。"
    },
    {
      "indent": 0,
      "text": "5.1. Terminology and Identification",
      "section_title": true,
      "zh-CHS": "5.1. 术语和识别"
    },
    {
      "indent": 3,
      "text": "- Pi is a physical (bearer/data/transport plane) node.",
      "zh-CHS": "- Pi是一个物理（承载/数据/传输平面）节点。"
    },
    {
      "indent": 3,
      "text": "- Li is a logical control plane entity that is associated to a single data plane (abstract) node. The Li is identified by the TE Router_ID. The latter is a control plane identifier defined as follows:",
      "zh-CHS": "- Li是与单个数据平面（抽象）节点关联的逻辑控制平面实体。Li由TE路由器_ID标识。后者是一个控制平面标识符，定义如下："
    },
    {
      "indent": 8,
      "text": "[RFC3630]: Router_Address (top level) TLV of the Type 1 TE LSA [RFC3784]: Traffic Engineering Router ID TLV (Type 134)",
      "zh-CHS": "[RFC3630]：类型1 TE LSA的路由器地址（顶层）TLV[RFC3784]：流量工程路由器ID TLV（类型134）"
    },
    {
      "indent": 5,
      "text": "Note: This document does not define what the TE Router ID is. This document simply states the use of the TE Router ID to identify Li. [RFC3630] and [RFC3784] provide the definitions.",
      "zh-CHS": "注意：本文档没有定义TE路由器ID是什么。本文档仅说明使用TE路由器ID识别Li。[RFC3630]和[RFC3784]提供了定义。"
    },
    {
      "indent": 3,
      "text": "- Ri is a logical control plane entity that is associated to a control plane \"router\". The latter is the source for topology information that it generates and shares with other control plane \"routers\". The Ri is identified by the (advertising) Router_ID",
      "zh-CHS": "- Ri是与控制平面“路由器”关联的逻辑控制平面实体。后者是拓扑信息的来源，它生成拓扑信息并与其他控制平面“路由器”共享。Ri由（广告）路由器_ID标识"
    },
    {
      "indent": 8,
      "text": "[RFC2328]: Router ID (32-bit) [RFC1195]: IS-IS System ID (48-bit)",
      "zh-CHS": "[RFC2328]：路由器ID（32位）[RFC1195]：IS-IS系统ID（48位）"
    },
    {
      "indent": 5,
      "text": "The Router_ID, which is represented by Ri and which corresponds to the RC_ID [RFC4258], does not enter into the identification of the logical entities representing the data plane resources such as links. The Routing DataBase (RDB) is associated to the Ri. Note that, in the ASON context, an arrangement consisting of multiple Ris announcing routing information related to a single Li is under evaluation.",
      "zh-CHS": "由Ri表示且对应于RC_ID[RFC4258]的路由器_ID不进入表示数据平面资源（例如链路）的逻辑实体的标识。路由数据库（RDB）与Ri关联。请注意，在ASON上下文中，正在评估由多个Ris组成的安排，这些Ris宣布与单个Li相关的路由信息。"
    },
    {
      "indent": 3,
      "text": "Aside from the Li/Pi mappings, these identifiers are not assumed to be in a particular entity relationship except that the Ri may have multiple Lis in its scope. The relationship between Ri and Li is simple at any moment in time: an Li may be advertised by only one Ri at any time. However, an Ri may advertise a set of one or more Lis. Thus, the routing protocol MUST be able to advertise multiple TE Router IDs (see Section 5.7).",
      "zh-CHS": "除了Li/Pi映射之外，这些标识符不被假定在特定的实体关系中，除非Ri在其范围内可能有多个Li。Ri和Li之间的关系在任何时候都很简单：一个Li在任何时候都只能由一个Ri发布广告。然而，Ri可以公布一组一个或多个li。因此，路由协议必须能够公布多个TE路由器ID（见第5.7节）。"
    },
    {
      "indent": 3,
      "text": "Note: Si is a control plane signaling function associated with one or more Lis. This document does not assume any specific constraint on the relationship between Si and Li. This document does not discuss issues of control plane accessibility for the signaling function, and it makes no assumptions about how control plane accessibility to the Si is achieved.",
      "zh-CHS": "注：Si是与一个或多个Lis相关联的控制平面信令功能。本文件对Si和Li之间的关系没有任何特定约束。本文件未讨论信令功能的控制平面可访问性问题，也未对如何实现Si的控制平面可访问性做出任何假设。"
    },
    {
      "indent": 0,
      "text": "5.2. RA Identification",
      "section_title": true,
      "zh-CHS": "5.2. RA识别"
    },
    {
      "indent": 3,
      "text": "G.7715.1 notes some necessary characteristics for RA identifiers, e.g., that they may provide scope for the Ri, and that they must be provisioned to be unique within an administrative domain. The RA ID format itself is allowed to be derived from any global address space. Provisioning of RA IDs for uniqueness is outside the scope of this document.",
      "zh-CHS": "G.7715.1注意到RA标识符的一些必要特征，例如，它们可能为Ri提供范围，并且它们必须在管理域内设置为唯一。RA ID格式本身允许从任何全局地址空间派生。为唯一性提供RA ID超出了本文档的范围。"
    },
    {
      "indent": 3,
      "text": "Under these conditions, GMPLS link state routing protocols provide the capability for RA Identification without further modification.",
      "zh-CHS": "在这些条件下，GMPLS链路状态路由协议提供了RA识别能力，无需进一步修改。"
    },
    {
      "indent": 0,
      "text": "5.3. Routing Information Exchange",
      "section_title": true,
      "zh-CHS": "5.3. 路由信息交换"
    },
    {
      "indent": 3,
      "text": "In this section, the focus is on routing information exchange Ri entities (through routing adjacencies) within a single hierarchical level. Routing information mapping between levels require specific processing (see Section 5.5).",
      "zh-CHS": "在本节中，重点介绍单个层次结构级别内的路由信息交换Ri实体（通过路由邻接）。级别之间的路由信息映射需要特定的处理（见第5.5节）。"
    },
    {
      "indent": 3,
      "text": "The control plane does not transport Pi identifiers, as these are data plane addresses for which the Li/Pi mapping is kept (link) local; see, for instance the transport LMP document [RFC4394] where such an exchange is described. Example: The transport plane identifier is the Pi (the identifier assigned to the physical element) that could be, for instance, \"666B.F999.AF10.222C\", whereas the control plane identifier is the Li (the identifier assigned by the control plane), which could be, for instance, \"192.0.2.1\".",
      "zh-CHS": "控制平面不传输Pi标识符，因为这些是Li/Pi映射保持（链路）本地的数据平面地址；例如，参见运输LMP文件[RFC4394]，其中描述了此类交换。示例：传输平面标识符是Pi（分配给物理元素的标识符），例如可以是“666B.F999.AF10.222C”，而控制平面标识符是Li（由控制平面分配的标识符），例如可以是“192.0.2.1”。"
    },
    {
      "indent": 3,
      "text": "The control plane exchanges the control plane identifier information, but not the transport plane identifier information (i.e., not \"666B.F999.AF10.222C\", but only \"192.0.2.1\"). The mapping Li/Pi is kept local. So, when the Si receives a control plane message requesting the use of \"192.0.2.1\", Si knows locally that this information refers to the data plane entity identified by the transport plane identifier \"666B.F999.AF10.222C\".",
      "zh-CHS": "控制平面交换控制平面标识符信息，但不交换传输平面标识符信息（即，不交换“666B.F999.AF10.222C”，而仅交换“192.0.2.1”）。映射Li/Pi保持在本地。因此，当Si接收到请求使用“192.0.2.1”的控制平面消息时，Si本地知道该信息是指由传输平面标识符“666B.F999.AF10.222C”标识的数据平面实体。"
    },
    {
      "indent": 3,
      "text": "Note also that the Li and Pi addressing spaces may be identical.",
      "zh-CHS": "还要注意，Li和Pi寻址空间可能相同。"
    },
    {
      "indent": 3,
      "text": "The control plane carries:",
      "zh-CHS": "控制飞机携带："
    },
    {
      "indent": 3,
      "text": "1) its view of the data plane link end-points and other link connection end-points.",
      "zh-CHS": "1) 其数据平面链接端点和其他链接连接端点的视图。"
    },
    {
      "indent": 3,
      "text": "2) the identifiers scoped by the Lis, i.e., referred to as an associated IPv4/IPv6 addressing space. Note that these identifiers may be either bundled TE link addresses or component link addresses.",
      "zh-CHS": "2) 由Lis限定范围的标识符，即称为关联的IPv4/IPv6寻址空间。注意，这些标识符可以是捆绑的TE链路地址或组件链路地址。"
    },
    {
      "indent": 3,
      "text": "3) when using OSPF or ISIS as the IGP in support of traffic engineering, [RFC3477] RECOMMENDS that the Li value (referred to the \"LSR Router ID\") be set to the TE Router ID value.",
      "zh-CHS": "3) 当使用OSPF或ISIS作为IGP以支持流量工程时，[RFC3477]建议将Li值（称为“LSR路由器ID”）设置为TE路由器ID值。"
    },
    {
      "indent": 3,
      "text": "Therefore, OSPF and IS-IS carry sufficient node identification information without further modification.",
      "zh-CHS": "因此，OSPF和IS-IS携带足够的节点标识信息，无需进一步修改。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Link Attributes",
      "section_title": true,
      "zh-CHS": "5.3.1. 链接属性"
    },
    {
      "indent": 3,
      "text": "[RFC4258] provides a list of link attributes and characteristics that need to be advertised by a routing protocol. All TE link attributes and characteristics are currently handled by OSPF and IS-IS (see Table 1) with the exception of Local Adaptation support. Indeed, GMPLS routing does not currently consider the use of dedicated TE link attribute(s) to describe the cross/inter-layer relationships.",
      "zh-CHS": "[RFC4258]提供路由协议需要公布的链路属性和特性的列表。除本地适配支持外，所有TE链路属性和特性目前由OSPF和IS-IS（见表1）处理。事实上，GMPLS路由目前不考虑使用专用TE链路属性来描述交叉/层间关系。"
    },
    {
      "indent": 3,
      "text": "In addition, the representation of bandwidth requires further consideration. GMPLS Routing defines an Interface Switching Capability Descriptor (ISCD) that delivers information about the (maximum/ minimum) bandwidth per priority of which an LSP can make use. This information is usually used in combination with the Unreserved Bandwidth sub-TLV that provides the amount of bandwidth not yet reserved on a TE link.",
      "zh-CHS": "此外，带宽的表示需要进一步考虑。GMPLS路由定义了一个接口交换能力描述符（ISCD），它提供关于LSP可以使用的每个优先级的（最大/最小）带宽的信息。此信息通常与未保留带宽子TLV结合使用，该子TLV提供TE链路上尚未保留的带宽量。"
    },
    {
      "indent": 3,
      "text": "In the ASON context, other bandwidth accounting representations are possible, e.g., in terms of a set of tuples <signal_type; number of unallocated timeslots>. The latter representation may also require definition of additional signal types (from those defined in [RFC3946]) to represent support of contiguously concatenated signals, i.e., STS-(3xN)c SPE / VC-4-Nc, N = 4, 16, 64, 256.",
      "zh-CHS": "在ASON上下文中，其他带宽计费表示是可能的，例如，根据一组元组<信号类型；未分配的时隙数>。后一种表示可能还需要定义额外的信号类型（来自[RFC3946]中定义的信号类型），以表示对连续级联信号的支持，即STS-（3xN）c SPE/VC-4-Nc，N=4、16、64、256。"
    },
    {
      "indent": 3,
      "text": "However, the method proposed in [RFC4202] is the most straightforward without requiring any bandwidth accounting change from an LSR perspective (in particular, when the ISCD sub-TLV information is combined with the information provided by the Unreserved Bandwidth sub-TLV).",
      "zh-CHS": "然而，[RFC4202]中提出的方法是最直接的，不需要从LSR角度进行任何带宽计费更改（特别是，当ISCD子TLV信息与无保留带宽子TLV提供的信息相结合时）。"
    },
    {
      "indent": 3,
      "text": "Link Characteristics     GMPLS OSPF\n-----------------------  ----------\nLocal SNPP link ID       Link-local part of the TE link identifier\n                         sub-TLV [RFC4203]\nRemote SNPP link ID      Link remote part of the TE link identifier\n                         sub-TLV [RFC4203]\nSignal Type              Technology specific part of the Interface\n                         Switching Capability Descriptor sub-TLV\n                         [RFC4203]\nLink Weight              TE metric sub-TLV [RFC3630]\nResource Class           Administrative Group sub-TLV [RFC3630]\nLocal Connection Types   Switching Capability field part of the\n                         Interface Switching Capability Descriptor\n                         sub-TLV [RFC4203]\nLink Capacity            Unreserved bandwidth sub-TLV [RFC3630]\n                         Max LSP Bandwidth part of the Interface\n                         Switching Capability Descriptor sub-TLV\n                         [RFC4203]\nLink Availability        Link Protection sub-TLV [RFC4203]\nDiversity Support        SRLG sub-TLV [RFC4203]\nLocal Adaptation support See above",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Table 1. TE link attributes in GMPLS OSPF-TE",
      "zh-CHS": "表1。GMPLS OSPF-TE中的TE链路属性"
    },
    {
      "indent": 3,
      "text": "Link Characteristics     GMPLS IS-IS\n-----------------------  -----------\nLocal SNPP link ID       Link-local part of the TE link identifier\n                         sub-TLV [RFC4205]\nRemote SNPP link ID      Link-remote part of the TE link identifier\n                         sub-TLV [RFC4205]\nSignal Type              Technology specific part of the Interface\n                         Switching Capability Descriptor sub-TLV\n                         [RFC4205]\nLink Weight              TE Default metric [RFC3784]\nResource Class           Administrative Group sub-TLV [RFC3784]\nLocal Connection Types   Switching Capability field part of the\n                         Interface Switching Capability Descriptor\n                         sub-TLV [RFC4205]\nLink Capacity            Unreserved bandwidth sub-TLV [RFC3784]\n                         Max LSP Bandwidth part of the Interface\n                         Switching Capability Descriptor sub-TLV\n                         [RFC4205]\nLink Availability        Link Protection sub-TLV [RFC4205]\nDiversity Support        SRLG sub-TLV [RFC4205]\nLocal Adaptation support See above",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Table 2. TE link attributes in GMPLS IS-IS-TE",
      "zh-CHS": "表2。GMPLS IS-IS-TE中的TE链接属性"
    },
    {
      "indent": 3,
      "text": "Note: Link Attributes represent layer resource capabilities and their utilization i.e. the IGP should be able to advertise these attributes on a per-layer basis.",
      "zh-CHS": "注：链路属性表示层资源能力及其利用率，即IGP应能够在每层的基础上公布这些属性。"
    },
    {
      "indent": 0,
      "text": "5.3.2. Node Attributes",
      "section_title": true,
      "zh-CHS": "5.3.2. 节点属性"
    },
    {
      "indent": 3,
      "text": "Node attributes are the \"Logical Node ID\" (described in Section 5.1) and the reachability information described in Section 5.3.3.",
      "zh-CHS": "节点属性是“逻辑节点ID”（如第5.1节所述）和第5.3.3节所述的可达性信息。"
    },
    {
      "indent": 0,
      "text": "5.3.3. Reachability Information",
      "section_title": true,
      "zh-CHS": "5.3.3. 可达性信息"
    },
    {
      "indent": 3,
      "text": "Advertisement of reachability can be achieved using the techniques described in [OSPF-NODE], where the set of local addresses are carried in an OSPF TE LSA node attribute TLV (a specific sub-TLV is defined per address family, e.g., IPv4 and IPv6). However, [OSPF-NODE] is restricted to advertisement of Host addresses and not prefixes, and therefore it requires enhancement (see below). Thus, in order to advertise blocks of reachable address prefixes a summarization mechanism is additionally required. This mechanism may take the form of a prefix length (which indicates the number of significant bits in the prefix) or a network mask.",
      "zh-CHS": "可以使用[OSPF-NODE]中描述的技术来实现可达性的通告，其中本地地址集在OSPF TE LSA节点属性TLV中携带（特定子TLV根据地址族定义，例如IPv4和IPv6）。然而，[OSPF-NODE]仅限于公布主机地址而非前缀，因此需要增强（见下文）。因此，为了公布可到达地址前缀块，还需要一种摘要机制。该机制可以采用前缀长度（表示前缀中有效位的数量）或网络掩码的形式。"
    },
    {
      "indent": 3,
      "text": "A similar mechanism does not exist for IS-IS. Moreover, the Extended IP Reachability TLV [RFC3784] focuses on IP reachable end-points (terminating points), as its name indicates.",
      "zh-CHS": "IS-IS不存在类似的机制。此外，如其名称所示，扩展IP可达性TLV[RFC3784]关注IP可达端点（终止点）。"
    },
    {
      "indent": 0,
      "text": "5.4. Routing Information Abstraction",
      "section_title": true,
      "zh-CHS": "5.4. 路由信息抽象"
    },
    {
      "indent": 3,
      "text": "G.7715.1 describes both static and dynamic methods for abstraction of routing information for advertisement at a different level of the routing hierarchy. However, the information that is advertised continues to be in the form of link and node advertisements consistent with the link state routing protocol used at that level. Hence, no specific capabilities need to be added to the routing protocol beyond the ability to locally identify when routing information originates outside of a particular RA.",
      "zh-CHS": "G.7715.1描述了静态和动态方法，用于在路由层次结构的不同层次上提取广告的路由信息。然而，所通告的信息继续以与在该级别使用的链路状态路由协议一致的链路和节点通告的形式存在。因此，除了本地识别路由信息何时起源于特定RA之外，不需要向路由协议添加任何特定功能。"
    },
    {
      "indent": 3,
      "text": "The methods used for abstraction of routing information are outside the scope of GMPLS routing protocols.",
      "zh-CHS": "用于提取路由信息的方法超出了GMPLS路由协议的范围。"
    },
    {
      "indent": 0,
      "text": "5.5. Dissemination of Routing Information in Support of Multiple Hierarchal Levels of RAs",
      "zh-CHS": "5.5. 传播路由信息以支持多层次的RAs"
    },
    {
      "indent": 3,
      "text": "G.7715.1 does not define specific mechanisms to support multiple hierarchical levels of RAs beyond the ability to support abstraction as discussed above. However, if RCs bound to adjacent levels of the RA hierarchy are allowed to redistribute routing information in both",
      "zh-CHS": "G.7715.1没有定义特定的机制来支持RAs的多层次级别，除了支持上述抽象的能力之外。然而，若绑定到RA层次结构的相邻级别的RCs被允许在这两个层次中重新分配路由信息"
    },
    {
      "indent": 3,
      "text": "directions between adjacent levels of the hierarchy without any additional mechanisms, they would not be able to determine looping of routing information.",
      "zh-CHS": "如果没有任何附加机制，相邻层次之间的方向将无法确定路由信息的循环。"
    },
    {
      "indent": 3,
      "text": "To prevent this looping of routing information between levels, IS-IS [RFC1195] allows only advertising routing information upward in the level hierarchy and disallows the advertising of routing information downward in the hierarchy. [RFC2966] defines the up/down bit to allow advertising downward in the hierarchy the \"IP Internal Reachability Information\" TLV (Type 128) and \"IP External Reachability Information\" TLV (Type 130). [RFC3784] extends its applicability for the \"Extended IP Reachability\" TLV (Type 135). Using this mechanism, the up/down bit is set to 0 when routing information is first injected into IS-IS. If routing information is advertised from a higher level to a lower level, the up/down bit is set to 1, indicating that it has traveled down the hierarchy. Routing information that has the up/down bit set to 1 may only be advertised down the hierarchy, i.e., to lower levels. This mechanism applies independently of the number of levels. However, this mechanism does not apply to the \"Extended IS Reachability\" TLV (Type 22) used to propagate the summarized topology (see Section 5.3), traffic engineering information as listed in Table 1, as well as reachability information (see Section 5.3.3).",
      "zh-CHS": "为了防止路由信息在级别之间循环，IS-IS[RFC1195]只允许在级别层次结构中向上发布路由信息，而不允许在层次结构中向下发布路由信息。[RFC2966]定义向上/向下位，以允许在层次结构中向下发布“IP内部可达性信息”TLV（类型128）和“IP外部可达性信息”TLV（类型130）。[RFC3784]扩展了其对“扩展IP可达性”TLV（135型）的适用性。使用此机制，当路由信息首次注入is-is时，向上/向下位设置为0。如果路由信息从较高级别播发到较低级别，则向上/向下位设置为1，表示它已沿层次结构向下移动。向上/向下位设置为1的路由信息只能在层次结构中向下播发，即向较低级别播发。该机制的应用与级别数无关。但是，该机制不适用于“扩展IS可达性”TLV（类型22），该TLV用于传播汇总拓扑（见第5.3节）、表1中列出的交通工程信息以及可达性信息（见第5.3.3节）。"
    },
    {
      "indent": 3,
      "text": "OSPFv2 [RFC2328] prevents inter-area routes (which are learned from area 0) from being passed back to area 0. However, GMPLS makes use of Type 10 (area-local scope) LSAs to propagate TE information [RFC3630], [RFC4202]. Type 10 Opaque LSAs are not flooded beyond the borders of their associated area. It is therefore necessary to have a means by which Type 10 Opaque LSA may carry the information that a particular piece of routing information has been learned from a higher-level RC when propagated to a lower-level RC. Any downward RC from this level, which receives an LSA with this information would omit the information in this LSA and thus not re-introduce this information back into a higher-level RC.",
      "zh-CHS": "OSPFv2[RFC2328]防止区域间路由（从区域0学习）传回区域0。然而，GMPLS利用类型10（区域局部范围）LSA来传播TE信息[RFC3630]、[RFC4202]。类型10不透明LSA不会淹没在其相关区域的边界之外。因此，有必要有一种方法，通过该方法，类型10不透明LSA可以携带当传播到较低级别RC时已从较高级别RC学习到特定路由信息的信息。来自该级别的任何向下RC，如果接收到带有此信息的LSA，将忽略此LSA中的信息，因此不会将此信息重新引入到更高级别的RC中。"
    },
    {
      "indent": 0,
      "text": "5.6. Routing Protocol Convergence",
      "section_title": true,
      "zh-CHS": "5.6. 路由协议收敛"
    },
    {
      "indent": 3,
      "text": "Link state protocols have been designed to propagate detected topological changes (such as interface failures and link attributes modification). The convergence period is short and involves a minimum of routing information exchange.",
      "zh-CHS": "链路状态协议设计用于传播检测到的拓扑变化（如接口故障和链路属性修改）。收敛期短，涉及的路由信息交换最少。"
    },
    {
      "indent": 3,
      "text": "Therefore, existing routing protocol convergence involves mechanisms that are sufficient for ASON applications.",
      "zh-CHS": "因此，现有的路由协议融合涉及的机制足以满足ASON应用。"
    },
    {
      "indent": 0,
      "text": "5.7. Routing Information Scoping",
      "section_title": true,
      "zh-CHS": "5.7. 路由信息作用域"
    },
    {
      "indent": 3,
      "text": "The routing protocol MUST support a single Ri advertising on behalf of more than one Li. Since each Li is identified by a unique TE Router ID, the routing protocol MUST be able to advertise multiple TE Router IDs. That is, for [RFC3630], multiple Router Addresses and for [RFC3784] multiple Traffic Engineering Router Ids.",
      "zh-CHS": "路由协议必须支持代表多个Li的单个Ri广告。由于每个Li由唯一的TE路由器ID标识，因此路由协议必须能够公布多个TE路由器ID。也就是说，对于[RFC3630]，多个路由器地址和[RFC3784]多个流量工程路由器ID。"
    },
    {
      "indent": 3,
      "text": "The Link sub-TLV that is currently part of the top level Link TLV associates the link to the Router_ID. However, having the Ri advertising on behalf of multiple Lis creates the following issue, as there is no longer a 1:1 relationship between the Router_ID and the TE Router_ID, but a 1:N relationship is possible (see Section 5.1). As the link-local and link-remote (unnumbered) ID association may not be unique per abstract node (per Li unicity), the advertisement needs to indicate the remote Lj value and rely on the initial discovery process to retrieve the {Li;Lj} relationship(s). In brief, as unnumbered links have their ID defined on per Li bases, the remote Lj needs to be identified to scope the link remote ID to the local Li. Therefore, the routing protocol MUST be able to disambiguate the advertised TE links so that they can be associated with the correct TE Router ID.",
      "zh-CHS": "当前作为顶级链路TLV一部分的链路子TLV将链路与路由器ID相关联。但是，代表多个Lis发布Ri广告会产生以下问题，因为路由器ID和TE路由器ID之间不再存在1:1的关系，而是可能存在1:N的关系（见第5.1节）。由于链路本地和链路远程（未编号）ID关联可能不是每个抽象节点（每个Li唯一性）唯一的，因此播发需要指示远程Lj值，并依赖初始发现过程来检索{Li；Lj}关系。简言之，由于未编号的链路在每个Li的基础上定义了它们的ID，因此需要识别远程Lj以将链路远程ID限定到本地Li。因此，路由协议必须能够消除播发的TE链路的歧义，以便它们能够与正确的TE路由器ID相关联。"
    },
    {
      "indent": 3,
      "text": "Moreover, when the Ri advertises on behalf multiple Lis, the routing protocol MUST be able to disambiguate the advertised reachability information (see Section 5.3.3) so that it can be associated with the correct TE Router ID.",
      "zh-CHS": "此外，当Ri代表多个Lis播发时，路由协议必须能够消除播发的可达性信息的歧义（参见第5.3.3节），以便它能够与正确的TE路由器ID相关联。"
    },
    {
      "indent": 0,
      "text": "6. Evaluation Scenarios",
      "section_title": true,
      "zh-CHS": "6. 评估情景"
    },
    {
      "indent": 3,
      "text": "The evaluation scenarios are the following; they are respectively referred to as cases 1, 2, 3, and 4.",
      "zh-CHS": "评估场景如下：；它们分别称为情况1、2、3和4。"
    },
    {
      "indent": 3,
      "text": "In Figure 1, below,",
      "zh-CHS": "在下面的图1中，"
    },
    {
      "indent": 3,
      "text": "- R3 represents an LSR with all components collocated. - R2 shows how the \"router\" component may be disjoint from the node. - R1 shows how a single \"router\" may manage multiple nodes.",
      "zh-CHS": "- R3表示所有组件并置的LSR。-R2显示了“路由器”组件如何与节点分离。-R1显示了单个“路由器”如何管理多个节点。"
    },
    {
      "indent": 3,
      "text": "             -------------------     -------\n            |R1                 |   |R2     |\n            |                   |   |       |    ------\n            |  L1    L2    L3   |   |   L4  |   |R3    |\n            |   :     :     :   |   |   :   |   |      |\n            |   :     :     :   |   |   :   |   |  L5  |\nControl      ---+-----+-----+---     ---+---    |   :  |\nPlane           :     :     :           :       |   :  |\n----------------+-----+-----+-----------+-------+---+--+-\nData            :     :     :           :       |   :  |\nPlane          --     :    --          --       |  --  |\n          ----|P1|--------|P3|--------|P4|------+-|P5|-+-\n               -- \\   :  / --          --       |  --  |\n                   \\ -- /                       |      |\n                    |P2|                         ------\n                     --",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Figure 1. Evaluation Cases 1, 2, and 3",
      "zh-CHS": "图1。评估案例1、2和3"
    },
    {
      "indent": 3,
      "text": "Case 1 as represented refers either to direct links between edges or to \"logical links\" as shown in Figure 2 (or any combination of them).",
      "zh-CHS": "如图所示，情况1指的是边缘之间的直接链接或如图2所示的“逻辑链接”（或它们的任意组合）。"
    },
    {
      "indent": 3,
      "text": "                ------                        ------\n               |      |                      |      |\n               |  L1  |                      |  L2  |\n               |  :   |                      |  :   |\n               |  : R1|                      |  : R2|\nControl Plane   --+---                        --+---\nElements          :                             :\n------------------+-----------------------------+------------------\nData Plane        :                             :\nElements          :                             :\n              ----+-----------------------------+-----\n             |    :                             :     |\n             |   ---            ---            ---    |\n             |  |   |----------| P |----------|   |   |\n          ---+--|   |           ---           |   |---+---\n             |  |   |                         |   |   |\n             |  | P1|-------------------------| P2|   |\n             |   ---                           ---    |\n              ----------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 2. Case 1 with Logical Links",
      "zh-CHS": "图2。案例1带有逻辑链接"
    },
    {
      "indent": 3,
      "text": "Another case (referred to as Case 4) is constituted by the Abstract Node as represented in Figure 3. There is no internal structure associated (externally) to the abstract node.",
      "zh-CHS": "另一种情况（称为情况4）由抽象节点构成，如图3所示。没有与抽象节点（外部）关联的内部结构。"
    },
    {
      "indent": 3,
      "text": "                    --------------\n                   |R4            |\n                   |              |\n                   |      L6      |\n                   |       :      |\n                   |    ......    |\n                    ---:------:---\nControl Plane          :      :\n                +------+------+------+\nData Plane             :      :\n                    ---:------:---\n                   |P8 :      :   |\n                   |  --      --  |\n                 --+-|P |----|P |-+--\n                   |  --      --  |\n                    --------------",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "Figure 3. Case 4: Abstract Node",
      "zh-CHS": "图3。案例4：抽象节点"
    },
    {
      "indent": 3,
      "text": "Note: the \"signaling function\" referred to as Si, i.e., the control plane entity that processes the signaling messages, is not represented in these figures.",
      "zh-CHS": "注：这些图中未表示被称为Si的“信令功能”，即处理信令消息的控制平面实体。"
    },
    {
      "indent": 0,
      "text": "7. Summary of Necessary Additions to OSPF and IS-IS",
      "section_title": true,
      "zh-CHS": "7. OSPF和IS-IS的必要补充汇总"
    },
    {
      "indent": 3,
      "text": "The following sections summarize the additions to be provided to OSPF and IS-IS in support of ASON routing.",
      "zh-CHS": "以下各节总结了为支持ASON路由而向OSPF和IS-IS提供的补充。"
    },
    {
      "indent": 0,
      "text": "7.1. OSPFv2",
      "section_title": true,
      "zh-CHS": "7.1. OSPFv2"
    },
    {
      "indent": 3,
      "text": "Reachability Extend Node Attribute sub-TLVs to support address prefixes (see Section 5.3.3).",
      "zh-CHS": "可达性扩展节点属性子TLV以支持地址前缀（见第5.3.3节）。"
    },
    {
      "indent": 3,
      "text": "Link Attributes Representation of cross/inter-layer relationships in link top-level link TLV (see Section 5.3.1).",
      "zh-CHS": "链路顶层链路TLV中跨层/层间关系的链路属性表示（见第5.3.1节）。"
    },
    {
      "indent": 21,
      "text": "Optionally, provide for per-signal-type bandwidth accounting (see Section 5.3.1).",
      "zh-CHS": "可选地，提供每种信号类型的带宽核算（见第5.3.1节）。"
    },
    {
      "indent": 3,
      "text": "Scoping TE link advertisements to allow for retrieving their respective local-remote TE Router_ID relationship(s) (see Section 5.7).",
      "zh-CHS": "确定TE链接广告的范围，以允许检索其各自的本地远程TE路由器ID关系（见第5.7节）。"
    },
    {
      "indent": 21,
      "text": "Prefixes part of the reachability advertisement (using Node Attribute top-level TLV) needs to be associated to its respective local TE Router_ID (see Section 5.7).",
      "zh-CHS": "可达性广告的前缀部分（使用节点属性顶级TLV）需要与其各自的本地TE路由器ID关联（参见第5.7节）。"
    },
    {
      "indent": 3,
      "text": "Hierarchy Provide a mechanism by which Type 10 Opaque LSA may carry the information that a particular piece of routing information has been learned from a higher-level RC when propagated to a lower-level RC (so as not to re-introduce this information into a higher-level RC).",
      "zh-CHS": "层次结构提供了一种机制，通过该机制，类型10不透明LSA可以携带当传播到较低级别RC时已从较高级别RC学习到特定路由信息的信息（以便不将该信息重新引入较高级别RC）。"
    },
    {
      "indent": 0,
      "text": "7.2. IS-IS",
      "section_title": true,
      "zh-CHS": "7.2. IS-IS"
    },
    {
      "indent": 3,
      "text": "Reachability Provide for reachability advertisement (in the form of reachable TE prefixes).",
      "zh-CHS": "可达性提供可达性广告（以可达TE前缀的形式）。"
    },
    {
      "indent": 3,
      "text": "Link Attributes Representation of cross/inter-layer relationships in Extended IS Reachability TLV (see Section 5.3.1).",
      "zh-CHS": "扩展IS可达性TLV中跨层/层间关系的链路属性表示（见第5.3.1节）。"
    },
    {
      "indent": 21,
      "text": "Optionally, provide for per-signal-type bandwidth accounting (see Section 5.3.1).",
      "zh-CHS": "可选地，提供每种信号类型的带宽核算（见第5.3.1节）。"
    },
    {
      "indent": 3,
      "text": "Scoping Extended IS Reachability TLVs to allow for retrieving their respective local-remote TE Router_ID relationship(s) (see Section 5.7).",
      "zh-CHS": "范围扩展是可访问性TLV，允许检索其各自的本地远程TE路由器ID关系（见第5.7节）。"
    },
    {
      "indent": 21,
      "text": "Prefixes part of the reachability advertisement needs to be associated to its respective local TE Router_ID (see Section 5.7).",
      "zh-CHS": "可达性广告的前缀部分需要与其各自的本地TE路由器ID相关联（参见第5.7节）。"
    },
    {
      "indent": 3,
      "text": "Hierarchy Extend the up/down bit mechanisms to propagate the summarized topology (see Section 5.3) and traffic engineering information as listed in Table 1, as well as reachability information (see Section 5.3.3).",
      "zh-CHS": "层次结构扩展向上/向下位机制，以传播汇总拓扑（见第5.3节）和表1中列出的流量工程信息，以及可达性信息（见第5.3.3节）。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The introduction of a dynamic control plane to an ASON network exposes it to additional security risks that may have been controlled or limited by the use of management plane solutions. The routing protocols play a part in the control plane and may be attacked so that they become unstable or provide incorrect information for use in path computation or by the signaling protocols.",
      "zh-CHS": "向ASON网络引入动态控制平面会使其面临额外的安全风险，这些风险可能已通过使用管理平面解决方案得到控制或限制。路由协议在控制平面中起作用，并且可能受到攻击，从而使其变得不稳定，或者提供不正确的信息以用于路径计算或由信令协议使用。"
    },
    {
      "indent": 3,
      "text": "Nevertheless, there is no reason why the control plane components cannot be secured, and the security mechanisms developed for the routing protocol and used within the Internet are equally applicable within an ASON context.",
      "zh-CHS": "然而，没有理由不能保护控制平面组件，并且为路由协议开发并在互联网中使用的安全机制同样适用于ASON上下文。"
    },
    {
      "indent": 3,
      "text": "[RFC4258] describes the requirements for security of routing protocols for the Automatically Switched Optical Network. Reference is made to [M.3016], which lays out the overall security objectives of confidentiality, integrity, and accountability. These are well discussed for the Internet routing protocols in [THREATS].",
      "zh-CHS": "[RFC4258]描述了自动交换光网络路由协议的安全要求。参考[M.3016]，其中列出了保密性、完整性和问责制的总体安全目标。这些都在[THREATS]中针对Internet路由协议进行了详细讨论。"
    },
    {
      "indent": 3,
      "text": "A detailed discussion of routing threats and mechanisms that are currently deployed in operational networks to counter these threats is found in [OPSECPRACTICES]. A detailed listing of the device capabilities that can be used to support these practices can be found in [RFC3871].",
      "zh-CHS": "[OPSECPRACTICES]中详细讨论了路由威胁和目前部署在作战网络中以应对这些威胁的机制。[RFC3871]中详细列出了可用于支持这些实践的设备功能。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "zh-CHS": "9. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Adrian Farrel for having initiated the proposal of an ASON Routing Solution Design Team and the ITU-T SG15/Q14 for their careful review and input.",
      "zh-CHS": "作者要感谢Adrian Farrel发起了ASON路由解决方案设计团队的提案，并感谢ITU-T SG15/Q14的仔细审查和投入。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC1195] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990.",
      "zh-CHS": "[RFC1195]Callon，R.，“OSI IS-IS在TCP/IP和双环境中的路由使用”，RFC 11951990年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2966] Li, T., Przygienda, T., and H. Smit, \"Domain-wide Prefix Distribution with Two-Level IS-IS\", RFC 2966, October 2000.",
      "zh-CHS": "[RFC2966]Li，T.，Przygienda，T.，和H.Smit，“具有两级IS-IS的域范围前缀分布”，RFC 2966，2000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "zh-CHS": "[RFC2328]Moy，J.，“OSPF版本2”，STD 54，RFC 2328，1998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3477] Kompella, K. and Y. Rekhter, \"Signalling Unnumbered Links in Resource ReSerVation Protocol - Traffic Engineering (RSVP-TE)\", RFC 3477, January 2003.",
      "zh-CHS": "[RFC3477]Kompella，K.和Y.Rekhter，“资源预留协议中未编号链路的信令-流量工程（RSVP-TE）”，RFC 3477，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3630] Katz, D., Kompella, K., and D. Yeung, \"Traffic Engineering (TE) Extensions to OSPF Version 2\", RFC 3630, September 2003.",
      "zh-CHS": "[RFC3630]Katz，D.，Kompella，K.，和D.Yeung，“OSPF版本2的交通工程（TE）扩展”，RFC 3630，2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3784] Smit, H. and T. Li, \"Intermediate System to Intermediate System (IS-IS) Extensions for Traffic Engineering (TE)\", RFC 3784, June 2004.",
      "zh-CHS": "[RFC3784]Smit，H.和T.Li，“交通工程（TE）的中间系统到中间系统（IS-IS）扩展”，RFC 37842004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3871] Jones, G., Ed., \"Operational Security Requirements for Large Internet Service Provider (ISP) IP Network Infrastructure\", RFC 3871, September 2004.",
      "zh-CHS": "[RFC3871]Jones，G.，Ed.“大型互联网服务提供商（ISP）IP网络基础设施的运营安全要求”，RFC 3871，2004年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3946] Mannie, E. and D. Papadimitriou, \"Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control\", RFC 3946, October 2004.",
      "zh-CHS": "[RFC3946]Mannie，E.和D.Papadimitriou，“同步光网络（SONET）和同步数字体系（SDH）控制的通用多协议标签交换（GMPLS）扩展”，RFC 3946，2004年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4202] Kompella, K., Ed., and Y. Rekhter, Ed., \"Routing Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4202, October 2005.",
      "zh-CHS": "[RFC4202]Kompella，K.，Ed.，和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的路由扩展”，RFC 4202，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4203] Kompella, K., Ed., and Y. Rekhter, Ed., \"OSPF Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4203, October 2005.",
      "zh-CHS": "[RFC4203]Kompella，K.，Ed.，和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的OSPF扩展”，RFC 4203，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4205] Kompella, K., Ed., and Y. Rekhter, Ed., \"Intermediate System to Intermediate System (IS-IS) Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4205, October 2005.",
      "zh-CHS": "[RFC4205]Kompella，K.，Ed.，和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的中间系统到中间系统（IS-IS）扩展”，RFC 4205，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4258] Brungard, D., \"Requirements for Generalized Multi-Protocol Label Switching (GMPLS) Routing for the Automatically Switched Optical Network (ASON)\", RFC 4258, November 2005.",
      "zh-CHS": "[RFC4258]Brungard，D.“自动交换光网络（ASON）的通用多协议标签交换（GMPLS）路由要求”，RFC 4258，2005年11月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC4394] Fedyk, D., Aboul-Magd, O., Brungard, D., Lang, J., and D. Papadimitriou, \"A Transport Network View of the Link Management Protocol (LMP)\", RFC 4394, February 2006.",
      "zh-CHS": "[RFC4394]Fedyk，D.，Aboul Magd，O.，Brungard，D.，Lang，J.，和D.Papadimitriou，“链路管理协议（LMP）的传输网络视图”，RFC 4394，2006年2月。"
    },
    {
      "indent": 3,
      "text": "[OPSECPRACTICES] Kaeo, M., \"Operational Security Current Practices\", Work in Progress, July 2006.",
      "zh-CHS": "[OPSECPRACTICES]Kaeo，M.，“运营安全当前实践”，正在进行的工作，2006年7月。"
    },
    {
      "indent": 3,
      "text": "[OSPF-NODE] Aggarwal, R. and K. Kompella, \"Advertising a Router's Local Addresses in OSPF TE Extensions\", Work in Progress, June 2006.",
      "zh-CHS": "[OSPF-NODE]Aggarwal，R.和K.Kompella，“在OSPF TE扩展中宣传路由器的本地地址”，正在进行的工作，2006年6月。"
    },
    {
      "indent": 3,
      "text": "[THREATS] Barbir, A., Murphy, S., and Y. Yang, \"Generic Threats to Routing Protocols\", RFC 4593, October 2006.",
      "zh-CHS": "[威胁]Barbir，A.，Murphy，S.，和Y.Yang，“路由协议的一般威胁”，RFC 4593，2006年10月。"
    },
    {
      "indent": 3,
      "text": "For information on the availability of ITU Documents, please see http://www.itu.int",
      "zh-CHS": "有关国际电联文件可用性的信息，请参见http://www.itu.int"
    },
    {
      "indent": 3,
      "text": "[G.7715] ITU-T Rec. G.7715/Y.1306, \"Architecture and Requirements for the Automatically Switched Optical Network (ASON)\", June 2002.",
      "zh-CHS": "[G.7715]ITU-T Rec.G.7715/Y.1306，“自动交换光网络（ASON）的体系结构和要求”，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[G.7715.1] ITU-T Draft Rec. G.7715.1/Y.1706.1, \"ASON Routing Architecture and Requirements for Link State Protocols\", November 2003.",
      "zh-CHS": "[G.7715.1]ITU-T建议草案G.7715.1/Y.1706.1，“ASON路由体系结构和链路状态协议要求”，2003年11月。"
    },
    {
      "indent": 3,
      "text": "[G.8080] ITU-T Rec. G.8080/Y.1304, \"Architecture for the Automatically Switched Optical Network (ASON)\", June 2006.",
      "zh-CHS": "[G.8080]ITU-T Rec.G.8080/Y.1304，“自动交换光网络（ASON）的体系结构”，2006年6月。"
    },
    {
      "indent": 3,
      "text": "[M.3016] ITU-T Rec. M.3016.0, \"Security for the Management Plane: Overview\", May 2005.",
      "zh-CHS": "[M.3016]ITU-T Rec.M.3016.0，“管理层的安全：概述”，2005年5月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. ASON Terminology",
      "section_title": true,
      "zh-CHS": "附录A.ASON术语"
    },
    {
      "indent": 3,
      "text": "This document makes use of the following terms:",
      "zh-CHS": "本文件使用了以下术语："
    },
    {
      "indent": 3,
      "text": "Administrative domain (see Recommendation G.805): For the purposes of [G.7715.1], an administrative domain represents the extent of resources that belong to a single player such as a network operator, a service provider, or an end-user. Administrative domains of different players do not overlap amongst themselves.",
      "zh-CHS": "管理域（见建议G.805）：就[G.7715.1]而言，管理域表示属于单个参与者（如网络运营商、服务提供商或最终用户）的资源范围。不同参与者的管理域之间不会重叠。"
    },
    {
      "indent": 3,
      "text": "Control plane: Performs the call control and connection control functions. Through signaling, the control plane sets up and releases connections and may restore a connection in case of a failure.",
      "zh-CHS": "控制平面：执行呼叫控制和连接控制功能。通过信令，控制平面建立和释放连接，并在发生故障时恢复连接。"
    },
    {
      "indent": 3,
      "text": "(Control) Domain: Represents a collection of (control) entities that are grouped for a particular purpose. The control plane is subdivided into domains matching administrative domains. Within an administrative domain, further subdivisions of the control plane are recursively applied. A routing control domain is an abstract entity that hides the details of the RC distribution.",
      "zh-CHS": "（控制）域：表示为特定目的分组的（控制）实体的集合。控制平面细分为与管理域匹配的域。在管理域内，递归地应用控制平面的进一步细分。路由控制域是隐藏RC分发详细信息的抽象实体。"
    },
    {
      "indent": 3,
      "text": "External NNI (E-NNI): Interfaces are located between protocol controllers between control domains.",
      "zh-CHS": "外部NNI（E-NNI）：接口位于控制域之间的协议控制器之间。"
    },
    {
      "indent": 3,
      "text": "Internal NNI (I-NNI): Interfaces are located between protocol controllers within control domains.",
      "zh-CHS": "内部NNI（I-NNI）：接口位于控制域内的协议控制器之间。"
    },
    {
      "indent": 3,
      "text": "Link (see Recommendation G.805): A \"topological component\" that describes a fixed relationship between a \"subnetwork\" or \"access group\" and another \"subnetwork\" or \"access group\". Links are not limited to being provided by a single server trail.",
      "zh-CHS": "链路（见建议G.805）：描述“子网”或“接入组”与另一“子网”或“接入组”之间固定关系的“拓扑组件”。链接不限于由单个服务器提供。"
    },
    {
      "indent": 3,
      "text": "Management plane: Performs management functions for the Transport Plane, the control plane, and the system as a whole. It also provides coordination between all the planes. The following management functional areas are performed in the management plane: performance, fault, configuration, accounting, and security management",
      "zh-CHS": "管理平面：对运输平面、控制平面和整个系统执行管理功能。它还提供所有平面之间的协调。在管理平面中执行以下管理功能区域：性能、故障、配置、记帐和安全管理"
    },
    {
      "indent": 3,
      "text": "Management domain (see Recommendation G.805): A management domain defines a collection of managed objects that are grouped to meet organizational requirements according to geography, technology, policy, or other structure, and for a number of functional areas such as fault, configuration, accounting, performance, and security (FCAPS), for the purpose of providing control in a consistent manner. Management domains can be disjoint, contained, or overlapping. As such, the resources within an administrative domain can be distributed into several possible overlapping management domains.",
      "zh-CHS": "管理域（见建议G.805）：管理域定义了一组管理对象，这些对象根据地理位置、技术、策略或其他结构进行分组，以满足组织需求，并用于故障、配置、记帐、性能和安全（FCAP）等多个功能领域，为了以一致的方式提供控制。管理域可以是不相交的、包含的或重叠的。因此，管理域中的资源可以分布到几个可能重叠的管理域中。"
    },
    {
      "indent": 3,
      "text": "The same resource can therefore belong to several management domains simultaneously, but a management domain shall not cross the border of an administrative domain.",
      "zh-CHS": "因此，同一资源可以同时属于多个管理域，但管理域不得跨越管理域的边界。"
    },
    {
      "indent": 3,
      "text": "Subnetwork Point (SNP): The SNP is a control plane abstraction that represents an actual or potential transport plane resource. SNPs (in different subnetwork partitions) may represent the same transport resource. A one-to-one correspondence should not be assumed.",
      "zh-CHS": "子网点（SNP）：SNP是表示实际或潜在传输平面资源的控制平面抽象。SNP（在不同的子网分区中）可以表示相同的传输资源。不应假设一对一的对应关系。"
    },
    {
      "indent": 3,
      "text": "Subnetwork Point Pool (SNPP): A set of SNPs that are grouped together for the purposes of routing.",
      "zh-CHS": "子网点池（SNPP）：为路由目的而分组在一起的一组SNP。"
    },
    {
      "indent": 3,
      "text": "Termination Connection Point (TCP): A TCP represents the output of a Trail Termination function or the input to a Trail Termination Sink function.",
      "zh-CHS": "终端连接点（TCP）：TCP表示跟踪终端功能的输出或跟踪终端接收器功能的输入。"
    },
    {
      "indent": 3,
      "text": "Transport plane: Provides bi-directional or unidirectional transfer of user information, from one location to another. It can also provide transfer of some control and network management information. The Transport Plane is layered; it is equivalent to the Transport Network defined in G.805 Recommendation.",
      "zh-CHS": "传输平面：提供用户信息从一个位置到另一个位置的双向或单向传输。它还可以提供一些控制和网络管理信息的传输。运输机是分层的,；它相当于G.805建议中定义的传输网络。"
    },
    {
      "indent": 3,
      "text": "User Network Interface (UNI): Interfaces are located between protocol controllers between a user and a control domain. Note: There is no routing function associated with a UNI reference point.",
      "zh-CHS": "用户网络接口（UNI）：接口位于用户和控制域之间的协议控制器之间。注：没有与UNI参考点关联的路由功能。"
    },
    {
      "indent": 0,
      "text": "Appendix B. ASON Routing Terminology",
      "section_title": true,
      "zh-CHS": "附录B.ASON路由术语"
    },
    {
      "indent": 3,
      "text": "This document makes use of the following terms:",
      "zh-CHS": "本文件使用了以下术语："
    },
    {
      "indent": 3,
      "text": "Routing Area (RA): An RA represents a partition of the data plane, and its identifier is used within the control plane as the representation of this partition. Per [G.8080], an RA is defined by a set of sub-networks, the links that interconnect them, and the interfaces representing the ends of the links exiting that RA. An RA may contain smaller RAs inter-connected by links. The limit of subdivision results in an RA that contains two sub-networks interconnected by a single link.",
      "zh-CHS": "路由区域（RA）：RA表示数据平面的分区，其标识符在控制平面内用作此分区的表示。根据[G.8080]，RA由一组子网络、互连它们的链路以及代表退出RA的链路端部的接口定义。RA可以包含通过链路相互连接的较小RA。细分的限制导致RA包含由单个链路互连的两个子网络。"
    },
    {
      "indent": 3,
      "text": "Routing Database (RDB): Repository for the local topology, network topology, reachability, and other routing information that is updated as part of the routing information exchange and that may additionally contain information that is configured. The RDB may contain routing information for more than one Routing Area (RA).",
      "zh-CHS": "路由数据库（RDB）：本地拓扑、网络拓扑、可达性和其他路由信息的存储库，这些信息作为路由信息交换的一部分进行更新，还可能包含已配置的信息。RDB可能包含多个路由区域（RA）的路由信息。"
    },
    {
      "indent": 3,
      "text": "Routing Components: ASON routing architecture functions. These functions can be classified as being protocol independent (Link Resource Manager or LRM, Routing Controller or RC) and protocol specific (Protocol Controller or PC).",
      "zh-CHS": "路由组件：ASON路由架构功能。这些功能可分为协议独立（链路资源管理器或LRM、路由控制器或RC）和协议特定（协议控制器或PC）。"
    },
    {
      "indent": 3,
      "text": "Routing Controller (RC): Handles (abstract) information needed for routing and the routing information exchange with peering RCs by operating on the RDB. The RC has access to a view of the RDB. The RC is protocol independent.",
      "zh-CHS": "路由控制器（RC）：通过在RDB上操作，处理路由所需的（抽象）信息以及与对等RCs的路由信息交换。RC可以访问RDB的视图。RC是独立于协议的。"
    },
    {
      "indent": 3,
      "text": "Note: Since the RDB may contain routing information pertaining to multiple RAs (and possibly to multiple layer networks), the RCs accessing the RDB may share the routing information.",
      "zh-CHS": "注意：由于RDB可能包含与多个RAs（以及可能与多层网络）相关的路由信息，因此访问RDB的RCs可能共享路由信息。"
    },
    {
      "indent": 3,
      "text": "Link Resource Manager (LRM): Supplies all the relevant component and TE link information to the RC. It informs the RC about any state changes of the link resources it controls.",
      "zh-CHS": "链路资源管理器（LRM）：向RC提供所有相关组件和TE链路信息。它将通知RC其控制的链路资源的任何状态更改。"
    },
    {
      "indent": 3,
      "text": "Protocol Controller (PC): Handles protocol-specific message exchanges according to the reference point over which the information is exchanged (e.g., E-NNI, I-NNI) and internal exchanges with the RC. The PC function is protocol dependent.",
      "zh-CHS": "协议控制器（PC）：根据交换信息的参考点（如e-NNI、I-NNI）和与RC的内部交换，处理特定于协议的消息交换。PC功能取决于协议。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Dimitri Papadimitriou, Ed. Alcatel Francis Wellensplein 1, B-2018 Antwerpen, Belgium Phone: +32 3 2408491 EMail: dimitri.papadimitriou@alcatel.be",
      "zh-CHS": "Dimitri Papadimitriou，Ed.Alcatel Francis Wellensplein 1，B-2018比利时安特卫普电话：+32 3 2408491电子邮件：Dimitri。papadimitriou@alcatel.be"
    },
    {
      "indent": 3,
      "text": "Lyndon Ong Ciena Corporation PO Box 308 Cupertino, CA 95015 , USA Phone: +1 408 705 2978 EMail: lyong@ciena.com",
      "zh-CHS": "Lyndon Ong Ciena Corporation美国加利福尼亚州库珀蒂诺市邮政信箱308邮编95015电话：+1408 705 2978电子邮件：lyong@ciena.com"
    },
    {
      "indent": 3,
      "text": "Jonathan Sadler Tellabs 1415 W. Diehl Rd Naperville, IL 60563 EMail: jonathan.sadler@tellabs.com",
      "zh-CHS": "Jonathan Sadler Tellabs 1415 W.Diehl Rd Naperville，IL 60563电子邮件：Jonathan。sadler@tellabs.com"
    },
    {
      "indent": 3,
      "text": "Stephen Shew Nortel Networks 3500 Carling Ave. Ottawa, Ontario, CANADA K2H 8E9 Phone: +1 613 7632462 EMail: sdshew@nortel.com",
      "zh-CHS": "Stephen Shew Nortel Networks加拿大安大略省渥太华卡林大道3500号K2H 8E9电话：+1 613 7632462电子邮件：sdshew@nortel.com"
    },
    {
      "indent": 3,
      "text": "Dave Ward Cisco Systems 170 W. Tasman Dr. San Jose, CA 95134 USA Phone: +1-408-526-4000 EMail: dward@cisco.com",
      "zh-CHS": "Dave Ward Cisco Systems 170 W.Tasman Dr.San Jose，CA 95134美国电话：+1-408-526-4000电子邮件：dward@cisco.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}