{
  "title": {
    "text": "RFC 4062: OSPF Benchmarking Terminology and Concepts",
    "zh-CHS": "RFC 4062"
  },
  "number": 4062,
  "created_at": "2021-11-12 16:55:33.478304+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          V. Manral\nRequest for Comments: 4062                                  SiNett Corp.\nCategory: Informational                                         R. White\n                                                           Cisco Systems\n                                                               A. Shaikh\n                                                    AT&T Labs (Research)\n                                                              April 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "OSPF Benchmarking Terminology and Concepts",
      "zh-CHS": "OSPF基准术语和概念"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document explains the terminology and concepts used in OSPF benchmarking. Although some of these terms may be defined elsewhere (and we will refer the reader to those definitions in some cases) we include discussions concerning these terms, as they relate specifically to the tasks involved in benchmarking the OSPF protocol.",
      "zh-CHS": "本文档解释了OSPF基准测试中使用的术语和概念。尽管其中一些术语可能在其他地方定义（在某些情况下，我们会让读者参考这些定义），但我们将包括关于这些术语的讨论，因为它们特别涉及到OSPF协议基准测试中涉及的任务。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document is a companion to [BENCHMARK], which describes basic Open Shortest Path First [OSPF] testing methods. This document explains terminology and concepts used in OSPF Testing Framework Documents, such as [BENCHMARK].",
      "zh-CHS": "本文档是[BENCHMARK]的补充，它描述了基本的开放最短路径优先[OSPF]测试方法。本文档解释了OSPF测试框架文档中使用的术语和概念，如[BENCHMARK]。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "zh-CHS": "2. 需求说明"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119]. [RFC2119] key words in this document are used to ensure methodological control, which is very important in the specification of benchmarks. This document does not specify a network-related protocol.",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。[RFC2119]本文件中的关键词用于确保方法控制，这在基准规范中非常重要。本文档未指定与网络相关的协议。"
    },
    {
      "indent": 0,
      "text": "3. Common Definitions",
      "section_title": true,
      "zh-CHS": "3. 共同定义"
    },
    {
      "indent": 3,
      "text": "Definitions in this section are well-known industry and benchmarking terms that may be defined elsewhere.",
      "zh-CHS": "本节中的定义是其他地方可能定义的著名行业和基准术语。"
    },
    {
      "indent": 3,
      "text": "o White Box (Internal) Measurements",
      "zh-CHS": "o 白盒（内部）测量值"
    },
    {
      "indent": 8,
      "text": "- Definition",
      "zh-CHS": "- 释义"
    },
    {
      "indent": 13,
      "text": "White box measurements are those reported and collected on the Device Under Test (DUT) itself.",
      "zh-CHS": "白盒测量是指在被测设备（DUT）上报告和收集的测量值。"
    },
    {
      "indent": 8,
      "text": "- Discussion",
      "zh-CHS": "- 讨论"
    },
    {
      "indent": 13,
      "text": "These measurements rely on output and event recording, along with the clocking and time stamping available on the DUT itself. Taking measurements on the DUT may impact the actual outcome of the test, since it can increase processor loading, memory utilization, and timing factors. Some devices may not have the required output readily available for taking internal measurements.",
      "zh-CHS": "这些测量依赖于输出和事件记录，以及DUT本身可用的时钟和时间戳。在DUT上进行测量可能会影响测试的实际结果，因为它会增加处理器负载、内存利用率和定时因素。一些设备可能没有所需的输出，无法随时进行内部测量。"
    },
    {
      "indent": 13,
      "text": "Note: White box measurements can be influenced by the vendor's implementation of various timers and processing models. Whenever possible, internal measurements should be compared to external measurements to verify and validate them.",
      "zh-CHS": "注：白盒测量值可能会受到供应商实施各种定时器和处理模型的影响。只要可能，应将内部测量值与外部测量值进行比较，以验证和验证它们。"
    },
    {
      "indent": 13,
      "text": "Because of the potential for variations in collection and presentation methods across different DUTs, white box measurements MUST NOT be used as a basis for comparison in benchmarks. This has been a guiding principle of the Benchmarking Methodology Working Group.",
      "zh-CHS": "由于不同DUT的收集和表示方法可能存在差异，白盒测量值不得用作基准比较的基础。这一直是基准方法工作组的指导原则。"
    },
    {
      "indent": 3,
      "text": "o Black Box (External) Measurements",
      "zh-CHS": "o 黑盒（外部）测量"
    },
    {
      "indent": 8,
      "text": "- Definition",
      "zh-CHS": "- 释义"
    },
    {
      "indent": 13,
      "text": "Black box measurements infer the performance of the DUT through observation of its communications with other devices.",
      "zh-CHS": "黑盒测量通过观察DUT与其他设备的通信来推断DUT的性能。"
    },
    {
      "indent": 8,
      "text": "- Discussion",
      "zh-CHS": "- 讨论"
    },
    {
      "indent": 13,
      "text": "One example of a black box measurement is when a downstream device receives complete routing information from the DUT, it can be inferred that the DUT has transmitted all the routing information available. External measurements of",
      "zh-CHS": "黑盒测量的一个示例是，当下游设备从DUT接收到完整的路由信息时，可以推断DUT已经发送了所有可用的路由信息。外部测量"
    },
    {
      "indent": 13,
      "text": "internal operations may suffer in that they include not just the protocol action times, but also propagation delays, queuing delays, and other such factors.",
      "zh-CHS": "内部操作可能会受到影响，因为它们不仅包括协议操作时间，还包括传播延迟、排队延迟和其他此类因素。"
    },
    {
      "indent": 13,
      "text": "For the purposes of [BENCHMARK], external techniques are more readily applicable.",
      "zh-CHS": "为了[基准测试]的目的，外部技术更容易应用。"
    },
    {
      "indent": 3,
      "text": "o Multi-device Measurements",
      "zh-CHS": "o 多设备测量"
    },
    {
      "indent": 8,
      "text": "- Measurements assessing communications (usually in combination with internal operations) between two or more DUTs. Multi-device measurements may be internal or external.",
      "zh-CHS": "- 评估两个或多个DUT之间通信（通常与内部操作相结合）的测量。多设备测量可以是内部测量，也可以是外部测量。"
    },
    {
      "indent": 0,
      "text": "4. Terms Defined Elsewhere",
      "section_title": true,
      "zh-CHS": "4. 其他地方定义的术语"
    },
    {
      "indent": 3,
      "text": "Terms in this section are defined elsewhere and are included only as they apply to [BENCHMARK].",
      "zh-CHS": "本节中的术语在其他地方有定义，仅适用于[基准]。"
    },
    {
      "indent": 3,
      "text": "o Point-to-Point Links",
      "zh-CHS": "o 点对点链接"
    },
    {
      "indent": 8,
      "text": "- Definition",
      "zh-CHS": "- 释义"
    },
    {
      "indent": 13,
      "text": "See [OSPF], Section 1.2.",
      "zh-CHS": "见[OSPF]，第1.2节。"
    },
    {
      "indent": 8,
      "text": "- Discussion",
      "zh-CHS": "- 讨论"
    },
    {
      "indent": 13,
      "text": "A point-to-point link can take less time to converge than a broadcast link of the same speed because it does not have the overhead of DR election. Point-to-point links can be either numbered or unnumbered. However, in the context of [BENCHMARK] and [OSPF], the two can be regarded as the same.",
      "zh-CHS": "点到点链路的收敛时间比相同速度的广播链路要短，因为它没有DR选举的开销。点到点链接可以编号，也可以不编号。然而，在[BENCHMARK]和[OSPF]的上下文中，这两者可以被视为相同的。"
    },
    {
      "indent": 3,
      "text": "o Broadcast Link",
      "zh-CHS": "o 广播链路"
    },
    {
      "indent": 8,
      "text": "- Definition",
      "zh-CHS": "- 释义"
    },
    {
      "indent": 13,
      "text": "See [OSPF], Section 1.2.",
      "zh-CHS": "见[OSPF]，第1.2节。"
    },
    {
      "indent": 8,
      "text": "- Discussion",
      "zh-CHS": "- 讨论"
    },
    {
      "indent": 13,
      "text": "The adjacency formation time on a broadcast link can be greater than that on a point-to-point link of the same speed because DR election has to take place. All routers on a broadcast network form adjacency with the DR and BDR.",
      "zh-CHS": "广播链路上的邻接形成时间可能大于相同速度的点到点链路上的邻接形成时间，因为必须进行DR选举。广播网络上的所有路由器都和DR和BDR相邻。"
    },
    {
      "indent": 13,
      "text": "Asynchronous flooding also takes place through the DR. In the context of convergence, it may take more time for an LSA to be flooded from one DR-other router to another because the LSA first has to be processed at the DR.",
      "zh-CHS": "异步泛洪也通过DR发生。在收敛的上下文中，LSA从一个DR路由器泛洪到另一个路由器可能需要更多的时间，因为LSA首先必须在DR处处理。"
    },
    {
      "indent": 3,
      "text": "o Shortest Path First Execution Time",
      "zh-CHS": "o 最短路径首次执行时间"
    },
    {
      "indent": 8,
      "text": "- Definition",
      "zh-CHS": "- 释义"
    },
    {
      "indent": 13,
      "text": "The time taken by a router to complete the SPF process, as described in [OSPF].",
      "zh-CHS": "路由器完成SPF过程所花费的时间，如[OSPF]中所述。"
    },
    {
      "indent": 8,
      "text": "- Discussion",
      "zh-CHS": "- 讨论"
    },
    {
      "indent": 13,
      "text": "This does not include the time taken by the router to install routes in the forwarding engine.",
      "zh-CHS": "这不包括路由器在转发引擎中安装路由所花费的时间。"
    },
    {
      "indent": 13,
      "text": "Some implementations may force two intervals, the SPF hold time and the SPF delay, between successive SPF calculations. If an SPF hold time exists, it should be subtracted from the total SPF execution time. If an SPF delay exists, it should be noted in the test results.",
      "zh-CHS": "一些实现可能会在连续的SPF计算之间强制两个间隔，即SPF保持时间和SPF延迟。如果存在SPF保持时间，则应从总SPF执行时间中减去该时间。如果存在SPF延迟，则应在测试结果中注明。"
    },
    {
      "indent": 8,
      "text": "- Measurement Units",
      "zh-CHS": "- 计量单位"
    },
    {
      "indent": 13,
      "text": "The SPF time is generally measured in milliseconds.",
      "zh-CHS": "SPF时间通常以毫秒为单位。"
    },
    {
      "indent": 3,
      "text": "o Hello Interval",
      "zh-CHS": "o 你好间隔"
    },
    {
      "indent": 8,
      "text": "- Definition",
      "zh-CHS": "- 释义"
    },
    {
      "indent": 13,
      "text": "See [OSPF], Section 7.1.",
      "zh-CHS": "见[OSPF]，第7.1节。"
    },
    {
      "indent": 8,
      "text": "- Discussion",
      "zh-CHS": "- 讨论"
    },
    {
      "indent": 13,
      "text": "The hello interval must be the same for all routers on a network.",
      "zh-CHS": "网络上所有路由器的hello间隔必须相同。"
    },
    {
      "indent": 13,
      "text": "Decreasing the hello interval can allow the router dead interval (below) to be reduced, thus reducing convergence times in those situations where the router dead interval's timing out causes an OSPF process to notice an adjacency failure. Further discussion of small hello intervals is given in [OSPF-SCALING].",
      "zh-CHS": "减少hello间隔可以减少路由器死区间隔（如下），从而在路由器死区间隔超时导致OSPF进程注意到邻接故障的情况下减少收敛时间。[OSPF-SCALING]中给出了关于小hello间隔的进一步讨论。"
    },
    {
      "indent": 3,
      "text": "o Router Dead Interval",
      "zh-CHS": "o 等于路由器无效间隔"
    },
    {
      "indent": 8,
      "text": "- Definition",
      "zh-CHS": "- 释义"
    },
    {
      "indent": 13,
      "text": "See [OSPF], Section 7.1.",
      "zh-CHS": "见[OSPF]，第7.1节。"
    },
    {
      "indent": 8,
      "text": "- Discussion",
      "zh-CHS": "- 讨论"
    },
    {
      "indent": 13,
      "text": "This is advertised in the router's Hello Packets in the Router-DeadInterval field. The router dead interval should be some multiple of the HelloInterval (perhaps 4 times the hello interval) and must be the same for all routers attached to a common network.",
      "zh-CHS": "这将在路由器的Hello数据包中的路由器死区间隔字段中公布。路由器死区间隔应该是HelloInterval的几倍（可能是hello间隔的4倍），并且对于连接到公共网络的所有路由器，死区间隔必须相同。"
    },
    {
      "indent": 0,
      "text": "5. Concepts",
      "section_title": true,
      "zh-CHS": "5. 概念"
    },
    {
      "indent": 0,
      "text": "5.1. The Meaning of Single Router Control Plane Convergence",
      "section_title": true,
      "zh-CHS": "5.1. 单路由器控制平面收敛的意义"
    },
    {
      "indent": 3,
      "text": "A network is termed as converged when all the devices within the network have a loop-free path to each possible destination. However, because we are not testing network convergence but testing performance for a particular device within a network, this definition needs to be streamlined to fit within a single device view.",
      "zh-CHS": "当网络中的所有设备都有到每个可能目的地的无环路路径时，网络被称为聚合网络。但是，由于我们不是在测试网络融合，而是在测试网络中特定设备的性能，因此需要简化此定义，以适合单个设备视图。"
    },
    {
      "indent": 3,
      "text": "In this case, convergence will mean the point in time when the DUT has performed all actions needed in order to react to the change in the topology represented by the test condition. For instance, an OSPF device must flood any new information it has received, rebuild its shortest path first (SPF) tree, and install any new paths or destinations in the local routing information base (RIB, or routing table).",
      "zh-CHS": "在这种情况下，收敛将意味着DUT已执行所有所需操作的时间点，以便对测试条件表示的拓扑变化作出反应。例如，OSPF设备必须向其接收到的任何新信息发送洪水，重建其最短路径优先（SPF）树，并在本地路由信息库（RIB或路由表）中安装任何新路径或目的地。"
    },
    {
      "indent": 3,
      "text": "Note that the word \"convergence\" has two distinct meanings: the process of a group of individuals meeting at the same place, and the process of an individual coming to the same place as an existing group. This work focuses on the second meaning of the word, so we consider the time required for a single device to adapt to a network change to be Single Router Convergence.",
      "zh-CHS": "请注意，“汇聚”一词有两种不同的含义：一群人在同一地点相遇的过程，以及一个人来到与现有群体相同地点的过程。这项工作集中在单词的第二个意义上，因此我们考虑单个设备适应网络变化为单个路由器收敛所需的时间。"
    },
    {
      "indent": 3,
      "text": "This concept does not include the time required for the control plane of the device to transfer the information required to forward packets to the data plane. It also does not include the amount of time between when the data plane receives that information and when it is able to forward traffic.",
      "zh-CHS": "该概念不包括设备的控制平面传输将分组转发到数据平面所需的信息所需的时间。它也不包括从数据平面接收到该信息到它能够转发流量之间的时间量。"
    },
    {
      "indent": 0,
      "text": "5.2. Measuring Convergence",
      "section_title": true,
      "zh-CHS": "5.2. 度量收敛性"
    },
    {
      "indent": 3,
      "text": "Obviously, there are several elements to convergence, even under the definition given above for a single device, including (but not limited to) the following:",
      "zh-CHS": "显然，即使在上述单个设备的定义下，也有几个要素需要融合，包括（但不限于）以下内容："
    },
    {
      "indent": 3,
      "text": "o The time it takes for the DUT to pass the information about a network event on to its neighbors.",
      "zh-CHS": "o DUT将有关网络事件的信息传递给其邻居所需的时间。"
    },
    {
      "indent": 3,
      "text": "o The time it takes for the DUT to process information about a network event and to calculate a new Shortest Path Tree (SPT).",
      "zh-CHS": "o DUT处理网络事件信息和计算新的最短路径树（SPT）所需的时间。"
    },
    {
      "indent": 3,
      "text": "o The time it takes for the DUT to make changes in its local RIB reflecting the new shortest path tree.",
      "zh-CHS": "o DUT在反映新最短路径树的局部RIB中进行更改所需的时间。"
    },
    {
      "indent": 0,
      "text": "5.3. Types of Network Events",
      "section_title": true,
      "zh-CHS": "5.3. 网络事件的类型"
    },
    {
      "indent": 3,
      "text": "A network event is an event that causes a change in the network topology.",
      "zh-CHS": "网络事件是导致网络拓扑发生更改的事件。"
    },
    {
      "indent": 3,
      "text": "o Link or Neighbor Device Up",
      "zh-CHS": "o 连接或连接相邻设备"
    },
    {
      "indent": 8,
      "text": "The time needed for an OSPF implementation to recognize a new link coming up on the device, to build any necessary adjacencies, to synchronize its database, and to perform all other actions necessary to converge.",
      "zh-CHS": "OSPF实现识别设备上出现的新链路、建立任何必要的邻接、同步其数据库以及执行聚合所需的所有其他操作所需的时间。"
    },
    {
      "indent": 3,
      "text": "o Initialization",
      "zh-CHS": "o 初始化"
    },
    {
      "indent": 8,
      "text": "The time needed for an OSPF implementation to be initialized, to recognize any links across which OSPF must run, to build any needed adjacencies, to synchronize its database, and to perform other actions necessary to converge.",
      "zh-CHS": "初始化OSPF实现、识别OSPF必须运行的任何链路、构建任何所需的邻接、同步其数据库以及执行收敛所需的其他操作所需的时间。"
    },
    {
      "indent": 3,
      "text": "o Adjacency Down",
      "zh-CHS": "o 邻接向下"
    },
    {
      "indent": 8,
      "text": "The time needed for an OSPF implementation to recognize a link down/adjacency loss based on hello timers alone, to propagate any information as necessary to its remaining adjacencies, and to perform other actions necessary to converge.",
      "zh-CHS": "OSPF实现仅基于hello定时器识别链路断开/邻接丢失、将任何必要信息传播到其剩余邻接以及执行收敛所需的其他操作所需的时间。"
    },
    {
      "indent": 3,
      "text": "o Link Down",
      "zh-CHS": "o 链接"
    },
    {
      "indent": 8,
      "text": "The time needed for an OSPF implementation to recognize a link down based on layer 2-provided information, to propagate any information as needed to its remaining adjacencies, and to perform other actions necessary to converge.",
      "zh-CHS": "OSPF实现基于第2层提供的信息识别链路断开、将所需的任何信息传播到其剩余邻接以及执行收敛所需的其他操作所需的时间。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not modify the underlying security considerations in [OSPF].",
      "zh-CHS": "本文档不修改[OSPF]中的基本安全注意事项。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Howard Berkowitz (hcb@clark.net), Kevin Dubray (kdubray@juniper.net), Scott Poretsky (sporetsky@avici.com), and Randy Bush (randy@psg.com) for their discussion, ideas, and support.",
      "zh-CHS": "作者要感谢霍华德·伯克维茨(hcb@clark.net)，凯文·杜布雷(kdubray@juniper.net)，斯科特·波雷茨基(sporetsky@avici.com)和兰迪·布什(randy@psg.com)感谢他们的讨论、想法和支持。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "zh-CHS": "8. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[BENCHMARK] Manral, V., White, R., and A. Shaikh, \"Benchmarking Basic OSPF Single Router Control Plane Convergence\", RFC 4061, April 2005.",
      "zh-CHS": "[基准测试]Manral，V.，White，R.，和A.Shaikh，“基准测试基本OSPF单路由器控制平面收敛”，RFC 4061，2005年4月。"
    },
    {
      "indent": 3,
      "text": "[OSPF] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "zh-CHS": "[OSPF]Moy，J.，“OSPF版本2”，STD 54，RFC 23281998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 0,
      "text": "9. Informative References",
      "section_title": true,
      "zh-CHS": "9. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[OSPF-SCALING] Choudhury, Gagan L., Editor, \"Prioritized Treatment of Specific OSPF Packets and Congestion Avoidance\", Work in Progress, August 2003.",
      "zh-CHS": "[OSPF-SCALING]Choudhury，Gagan L.，编辑，“特定OSPF数据包的优先处理和拥塞避免”，正在进行的工作，2003年8月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Vishwas Manral, SiNett Corp, Ground Floor, Embassy Icon Annexe, 2/1, Infantry Road, Bangalore, India",
      "zh-CHS": "印度班加罗尔步兵路2/1号大使馆图标附件一楼SiNett公司Vishwas Manral"
    },
    {
      "indent": 3,
      "text": "EMail: vishwas@sinett.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Russ White Cisco Systems, Inc. 7025 Kit Creek Rd. Research Triangle Park, NC 27709",
      "zh-CHS": "Russ White Cisco Systems，Inc.地址：北卡罗来纳州三角研究公园Kit Creek路7025号，邮编：27709"
    },
    {
      "indent": 3,
      "text": "EMail: riw@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Aman Shaikh AT&T Labs (Research) 180 Park Av, PO Box 971 Florham Park, NJ 07932",
      "zh-CHS": "Aman Shaikh AT&T实验室（研究）180 Park Av，邮政信箱971 Florham Park，NJ 07932"
    },
    {
      "indent": 3,
      "text": "EMail: ashaikh@research.att.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}