{
  "title": {
    "text": "RFC 4557: Online Certificate Status Protocol (OCSP) Support for Public Key Cryptography for Initial Authentication in Kerberos (PKINIT)",
    "zh-CHS": "RFC 4557"
  },
  "number": 4557,
  "created_at": "2021-11-14 07:14:57.890498+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                             L. Zhu\nRequest for Comments: 4557                                 K. Jaganathan\nCategory: Standards Track                          Microsoft Corporation\n                                                             N. Williams\n                                                        Sun Microsystems\n                                                               June 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Online Certificate Status Protocol (OCSP) Support for Public Key Cryptography for Initial Authentication in Kerberos (PKINIT)",
      "zh-CHS": "在线证书状态协议（OCSP）支持Kerberos（PKINIT）中初始身份验证的公钥加密"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a mechanism to enable in-band transmission of Online Certificate Status Protocol (OCSP) responses in the Kerberos network authentication protocol. These responses are used to verify the validity of the certificates used in Public Key Cryptography for Initial Authentication in Kerberos (PKINIT), which is the Kerberos Version 5 extension that provides for the use of public key cryptography.",
      "zh-CHS": "本文档定义了一种机制，用于在Kerberos网络身份验证协议中启用联机证书状态协议（OCSP）响应的带内传输。这些响应用于验证Kerberos（PKINIT）中用于初始身份验证的公钥加密中使用的证书的有效性，PKINIT是提供公钥加密使用的Kerberos版本5扩展。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions Used in This Document ...............................2\n3. Message Definition ..............................................2\n4. Security Considerations .........................................3\n5. Acknowledgements ................................................4\n6. References ......................................................4\n   6.1. Normative References .......................................4\n   6.2. Informative References .....................................4",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Online Certificate Status Protocol (OCSP) [RFC2560] enables applications to obtain timely information regarding the revocation status of a certificate. Because OCSP responses are well bounded and small in size, constrained clients may wish to use OCSP to check the validity of the certificates for Kerberos Key Distribution Center (KDC) in order to avoid transmission of large Certificate Revocation Lists (CRLs) and therefore save bandwidth on constrained networks [OCSP-PROFILE].",
      "zh-CHS": "在线证书状态协议（OCSP）[RFC2560]使应用程序能够及时获取有关证书吊销状态的信息。由于OCSP响应具有良好的边界且大小较小，受约束的客户端可能希望使用OCSP检查Kerberos密钥分发中心（KDC）证书的有效性，以避免传输大型证书吊销列表（CRL），从而节省受约束网络上的带宽[OCSP-PROFILE]。"
    },
    {
      "indent": 3,
      "text": "This document defines a pre-authentication type [RFC4120], where the client and the KDC MAY piggyback OCSP responses for certificates used in authentication exchanges, as defined in [RFC4556].",
      "zh-CHS": "本文档定义了预认证类型[RFC4120]，其中客户机和KDC可以根据[RFC4556]中的定义，将OCSP响应用于认证交换中使用的证书。"
    },
    {
      "indent": 3,
      "text": "By using this OPTIONAL extension, PKINIT clients and the KDC can maximize the reuse of cached OCSP responses.",
      "zh-CHS": "通过使用此可选扩展，PKINIT客户端和KDC可以最大限度地重用缓存的OCSP响应。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "2. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Message Definition",
      "section_title": true,
      "zh-CHS": "3. 消息定义"
    },
    {
      "indent": 3,
      "text": "A pre-authentication type identifier is defined for this mechanism:",
      "zh-CHS": "为此机制定义了预身份验证类型标识符："
    },
    {
      "indent": 14,
      "text": "PA-PK-OCSP-RESPONSE 18",
      "zh-CHS": "PA-PK-OCSP-18响应"
    },
    {
      "indent": 3,
      "text": "The corresponding padata-value field [RFC4120] contains the DER [X60] encoding of the following ASN.1 type:",
      "zh-CHS": "对应的padata值字段[RFC4120]包含以下ASN.1类型的DER[X60]编码："
    },
    {
      "indent": 10,
      "text": "PKOcspData ::= SEQUENCE OF OcspResponse\n               -- If more than one OcspResponse is\n               -- included, the first OcspResponse\n               -- MUST contain the OCSP response\n               -- for the signer's certificate.\n               -- The signer refers to the client for\n               -- AS-REQ, and the KDC for the AS-REP,\n               -- respectively.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "OcspResponse ::= OCTET STRING\n               -- Contains a complete OCSP response,\n               -- as defined in [RFC2560].",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The client MAY send OCSP responses for certificates used in PA-PK-AS-REQ [RFC4556] via a PA-PK-OCSP-RESPONSE.",
      "zh-CHS": "客户机可以通过PA-PK-OCSP-RESPONSE为PA-PK-AS-REQ[RFC4556]中使用的证书发送OCSP响应。"
    },
    {
      "indent": 3,
      "text": "The KDC that receives a PA-PK-OCSP-RESPONSE SHOULD send a PA-PK-OCSP-RESPONSE containing OCSP responses for certificates used in the KDC's PA-PK-AS-REP. The client can request a PA-PK-OCSP-RESPONSE by using a PKOcspData containing an empty sequence.",
      "zh-CHS": "接收PA-PK-OCSP-RESPONSE的KDC应发送PA-PK-OCSP-RESPONSE，其中包含KDC的PA-PK-AS-REP中使用的证书的OCSP响应。客户端可以使用包含空序列的PKOcspData请求PA-PK-OCSP-RESPONSE。"
    },
    {
      "indent": 3,
      "text": "The KDC MAY send a PA-PK-OCSP-RESPONSE when it does not receive a PA-PK-OCSP-RESPONSE from the client.",
      "zh-CHS": "当KDC没有从客户端接收到PA-PK-OCSP-RESPONSE时，KDC可以发送PA-PK-OCSP-RESPONSE。"
    },
    {
      "indent": 3,
      "text": "The PA-PK-OCSP-RESPONSE sent by the KDC contains OCSP responses for certificates used in PA-PK-AS-REP [RFC4556].",
      "zh-CHS": "KDC发送的PA-PK-OCSP-RESPONSE包含PA-PK-AS-REP[RFC4556]中使用的证书的OCSP响应。"
    },
    {
      "indent": 3,
      "text": "Note the lack of integrity protection for the empty or missing OCSP response; lack of an expected OCSP response from the KDC for the KDC's certificates SHOULD be treated as an error by the client, unless it is configured otherwise.",
      "zh-CHS": "注意空的或缺失的OCSP响应缺乏完整性保护；客户端应将KDC对KDC证书缺少预期OCSP响应视为错误，除非另行配置。"
    },
    {
      "indent": 3,
      "text": "When using OCSP, the response is signed by the OCSP server, which is trusted by the receiver. Depending on local policy, further verification of the validity of the OCSP servers may be needed",
      "zh-CHS": "使用OCSP时，响应由OCSP服务器签名，该服务器受接收方信任。根据本地策略，可能需要进一步验证OCSP服务器的有效性"
    },
    {
      "indent": 3,
      "text": "The client and the KDC SHOULD ignore invalid OCSP responses received via this mechanism, and they MAY implement CRL processing logic as a fall-back position, if the OCSP responses received via this mechanism alone are not sufficient for the verification of certificate validity. The client and/or the KDC MAY ignore a valid OCSP response and perform its own revocation status verification independently.",
      "zh-CHS": "客户端和KDC应忽略通过该机制接收到的无效OCSP响应，如果仅通过该机制接收到的OCSP响应不足以验证证书有效性，则客户端和KDC可将CRL处理逻辑作为一个后备位置。客户端和/或KDC可能会忽略有效的OCSP响应，并独立执行其自己的吊销状态验证。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The pre-authentication data in this document do not actually authenticate any principals, but are designed to be used in conjunction with PKINIT.",
      "zh-CHS": "本文档中的预身份验证数据实际上并不验证任何主体，而是设计用于与PKINIT结合使用。"
    },
    {
      "indent": 3,
      "text": "There is no binding between PA-PK-OCSP-RESPONSE pre-authentication data and PKINIT pre-authentication data other than a given OCSP response corresponding to a certificate used in a PKINIT pre-authentication data element. Attacks involving removal or replacement of PA-PK-OCSP-RESPONSE pre-authentication data elements are, at worst, downgrade attacks, where a PKINIT client or KDC would proceed without use of CRLs or OCSP for certificate validation, or denial-of-service attacks, where a PKINIT client or KDC that cannot validate the other's certificate without an accompanying OCSP response might reject the AS exchange or might have to download very large CRLs in order to continue. Kerberos V does not protect against denial-of-service attacks; therefore, the denial-of-service aspect of these attacks is acceptable.",
      "zh-CHS": "PA-PK-OCSP-RESPONSE预认证数据和PKINIT预认证数据之间没有绑定，但与PKINIT预认证数据元素中使用的证书相对应的给定OCSP响应除外。涉及移除或替换PA-PK-OCSP-RESPONSE预认证数据元素的攻击在最坏情况下是降级攻击，其中PKINIT客户端或KDC将在不使用CRL或OCSP进行证书验证的情况下继续进行，或拒绝服务攻击，如果PKINIT客户端或KDC在没有附带OCSP响应的情况下无法验证另一方的证书，则可能会拒绝AS exchange，或者可能必须下载非常大的CRL才能继续。Kerberos V不能防止拒绝服务攻击；因此，这些攻击的拒绝服务方面是可以接受的。"
    },
    {
      "indent": 3,
      "text": "If a PKINIT client or KDC cannot validate certificates without the aid of a valid PA-PK-OCSP-RESPONSE, then it SHOULD fail the AS exchange, possibly according to local configuration.",
      "zh-CHS": "如果没有有效的PA-PK-OCSP-RESPONSE的帮助，PKINIT客户端或KDC无法验证证书，则可能会根据本地配置使AS交换失败。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "This document was based on conversations among the authors, Jeffrey Altman, Sam Hartman, Martin Rex, and other members of the Kerberos working group.",
      "zh-CHS": "本文档基于作者Jeffrey Altman、Sam Hartman、Martin Rex和Kerberos工作组其他成员之间的对话。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2560] Myers, M., Ankney, R., Malpani, A., Galperin, S., and C. Adams, \"X.509 Internet Public Key Infrastructure Online Certificate Status Protocol - OCSP\", RFC 2560, June 1999.",
      "zh-CHS": "[RFC2560]Myers，M.，Ankney，R.，Malpani，A.，Galperin，S.，和C.Adams，“X.509互联网公钥基础设施在线证书状态协议-OCSP”，RFC 25601999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4120] Neuman, C., Yu, T., Hartman, S., and K. Raeburn, \"The Kerberos Network Authentication Service (V5)\", RFC 4120, July 2005.",
      "zh-CHS": "[RFC4120]Neuman，C.，Yu，T.，Hartman，S.，和K.Raeburn，“Kerberos网络身份验证服务（V5）”，RFC41202005年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4556] Zhu, L. and B. Tung, \"Public Key Cryptography for Initial Authentication in Kerberos (PKINIT)\", RFC 4556, June 2006.",
      "zh-CHS": "[RFC4556]Zhu，L.和B.Tung，“Kerberos中初始身份验证的公钥加密（PKINIT）”，RFC 45562006年6月。"
    },
    {
      "indent": 3,
      "text": "[X690] ASN.1 encoding rules: Specification of Basic Encoding Rules (BER), Canonical Encoding Rules (CER) and Distinguished Encoding Rules (DER), ITU-T Recommendation X.690 (1997) | ISO/IEC International Standard 8825-1:1998.",
      "zh-CHS": "[X690]ASN.1编码规则：基本编码规则（BER）、规范编码规则（CER）和区分编码规则（DER）的规范，ITU-T建议X.690（1997）| ISO/IEC国际标准8825-1:1998。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[OCSP-PROFILE] Deacon, A. and R. Hurst, \"Lightweight OCSP Profile for High Volume Environments\", Work in Progress, May 2006.",
      "zh-CHS": "[OCSP-PROFILE]Deacon，A.和R.Hurst，“高容量环境下的轻型OCSP配置文件”，正在进行的工作，2006年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Larry Zhu Microsoft Corporation One Microsoft Way Redmond, WA 98052 US",
      "zh-CHS": "Larry Zhu微软公司美国华盛顿州雷德蒙微软大道一号，邮编：98052"
    },
    {
      "indent": 3,
      "text": "EMail: lzhu@microsoft.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Karthik Jaganathan Microsoft Corporation One Microsoft Way Redmond, WA 98052 US",
      "zh-CHS": "Karthik Jaganathan微软公司美国华盛顿州雷德蒙微软大道一号，邮编：98052"
    },
    {
      "indent": 3,
      "text": "EMail: karthikj@microsoft.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Nicolas Williams Sun Microsystems 5300 Riata Trace Ct Austin, TX 78727 US",
      "zh-CHS": "Nicolas Williams Sun Microsystems 5300 Riata Trace Ct德克萨斯州奥斯汀78727美国"
    },
    {
      "indent": 3,
      "text": "EMail: Nicolas.Williams@sun.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}