{
  "title": {
    "text": "RFC 4008:  Definitions of Managed Objects for Network Address Translators (NAT) ",
    "zh-CHS": "RFC 4008"
  },
  "number": 4008,
  "created_at": "2021-11-12 12:56:01.431526+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           R. Rohit\nRequest for Comments: 4008                         Mascon Global Limited\nCategory: Standards Track                                   P. Srisuresh\n                                                    Caymas Systems, Inc.\n                                                         R. Raghunarayan\n                                                                  N. Pai\n                                                     Cisco Systems, Inc.\n                                                                 C. Wang\n                                                           Bank One Corp\n                                                              March 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "Definitions of Managed Objects for Network Address Translators (NAT)",
      "zh-CHS": "网络地址转换器（NAT）的托管对象定义"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for devices implementing Network Address Translator (NAT) function. This MIB module may be used for configuration as well as monitoring of a device capable of NAT function.",
      "zh-CHS": "本备忘录为实现网络地址转换器（NAT）功能的设备定义了管理信息库（MIB）的一部分。该MIB模块可用于配置以及监控能够实现NAT功能的设备。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction .................................................  2\n2.  The Internet-Standard Management Framework ...................  2\n3.  Terminology ..................................................  3\n4.  Overview .....................................................  4\n    4.1.  natInterfaceTable.......................................  4\n    4.2.  natAddrMapTable.........................................  5\n    4.3.  Default Timeouts, Protocol Table, and Other Scalars.....  6\n    4.4.  natAddrBindTable and natAddrPortBindTable...............  6\n    4.5.  natSessionTable.........................................  6\n    4.6.  RFC 3489 NAPT Variations, NAT Session and Bind Tables...  7\n    4.7.  Notifications...........................................  7\n    4.8.  Relation Among Tables...................................  8\n    4.9.  Configuration via the MIB...............................  8\n    4.10. Relationship to Interface MIB...........................  9\n5.  Definitions ..................................................  9\n6.  Acknowledgements ............................................. 59\n7.  Security Considerations ...................................... 59\n8.  References ................................................... 60\nAuthors' Addresses ............................................... 62\nFull Copyright Statement.......................................... 64",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for devices implementing NAT function. This MIB module may be used for configuration and monitoring of a device capable of NAT function. NAT types and their characteristics are defined in[RFC2663]. Traditional NAT function, in particular is defined in [RFC3022]. This MIB does not address the firewall functions and must not be used for configuring or monitoring these. Section 2 provides references to the SNMP management framework, which was used as the basis for the MIB module definition. Section 3 describes the terms used throughout the document. Section 4 provides an overview of the key objects, their inter-relationship, and how the MIB module may be used to configure and monitor a NAT device. Lastly, section 5 has the complete NAT MIB definition.",
      "zh-CHS": "本备忘录为实现NAT功能的设备定义了管理信息库（MIB）的一部分。该MIB模块可用于配置和监控能够实现NAT功能的设备。[RFC2663]中定义了NAT类型及其特征。[RFC3022]中定义了传统的NAT功能。此MIB不处理防火墙功能，不得用于配置或监视这些功能。第2节提供了SNMP管理框架的参考资料，该框架用作MIB模块定义的基础。第3节描述了本文件中使用的术语。第4节概述了关键对象及其相互关系，以及如何使用MIB模块配置和监视NAT设备。最后，第5节给出了完整的NAT MIB定义。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "2. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP).",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。"
    },
    {
      "indent": 3,
      "text": "Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "zh-CHS": "MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了符合SMIv2的MIB模块，如STD 58、RFC 2578[RFC2578]、STD 58、RFC 2579[RFC2579]和STD 58、RFC 2580[RFC2580]所述。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "zh-CHS": "3. 术语"
    },
    {
      "indent": 3,
      "text": "Definitions for a majority of the terms used throughout the document may be found in RFC 2663 [RFC2663]. Additional terms that further classify NAPT implementations are defined in RFC 3489 [RFC3489]. Listed below are terms used in this document.",
      "zh-CHS": "本文件中使用的大多数术语的定义见RFC 2663[RFC2663]。RFC 3489[RFC3489]中定义了进一步分类NAPT实现的附加术语。下面列出了本文件中使用的术语。"
    },
    {
      "indent": 3,
      "text": "Address realm - An address realm is a realm of unique network addresses that are routable within the realm. For example, an enterprise address realm could be constituted of private IP addresses in the ranges specified in RFC 1918 [RFC1918], which are routable within the enterprise, but not across the Internet. A public realm is constituted of globally unique network addresses.",
      "zh-CHS": "地址域-地址域是域内可路由的唯一网络地址的域。例如，企业地址域可以由RFC 1918[RFC1918]中指定范围内的私有IP地址构成，这些地址可以在企业内路由，但不能跨Internet路由。公共域由全局唯一的网络地址组成。"
    },
    {
      "indent": 3,
      "text": "Symmetric NAT - Symmetric NAT, as defined in RFC 3489 [RFC3489], is a variation of Network Address Port Translator (NAPT). Symmetric NAT does not use port bind for translation across all sessions originating from the same private host. Instead, it assigns a new public port to each new session, irrespective of whether the new session used the same private end-point as before.",
      "zh-CHS": "对称NAT——RFC 3489[RFC3489]中定义的对称NAT是网络地址端口转换器（NAPT）的一种变体。对称NAT不使用端口绑定在源自同一个专用主机的所有会话之间进行转换。相反，它为每个新会话分配一个新的公共端口，而不管新会话是否使用与以前相同的私有端点。"
    },
    {
      "indent": 3,
      "text": "Bind or Binding - Several variations of the term 'Bind' (or 'Binding') are used throughout the document. Address Bind (or Address Binding) is a tuple of (Private IP address, Public IP Address) used for translating an IP address end-point in IP packets. Port Bind (or, Port Binding, or Address Port Bind, or Address Port Binding) is a tuple of (transport protocol, Private IP address, Private port, Public IP Address, Public port) used for translating a port end-point tuple of (transport protocol, IP address, port). Bind is used to refer to either Address Bind or Port Bind. Bind Mode identifies whether a bind is Address Bind or Port Bind.",
      "zh-CHS": "绑定或绑定-在整个文档中使用术语“绑定”（或“绑定”）的几种变体。地址绑定（或地址绑定）是（私有IP地址、公共IP地址）的元组，用于转换IP数据包中的IP地址端点。端口绑定（或，端口绑定，或地址端口绑定，或地址端口绑定）是（传输协议、专用IP地址、专用端口、公用IP地址、公用端口）的元组，用于转换（传输协议、IP地址、端口）的端口端点元组。绑定用于指地址绑定或端口绑定。绑定模式标识绑定是地址绑定还是端口绑定。"
    },
    {
      "indent": 3,
      "text": "NAT Session - A NAT session is an association between a session as seen in the private realm and a session as seen in the public realm, by virtue of NAT translation. If a session in the private realm were to be represented as (PrivateSrcAddr, PrivateDstAddr, TransportProtocol, PrivateSrcPort, PrivateDstPort) and the same session in the public realm were to be represented as (PublicSrcAddr,",
      "zh-CHS": "NAT会话-NAT会话是通过NAT转换在私有领域中看到的会话和公共领域中看到的会话之间的关联。如果私有领域中的会话表示为（PrivateScAddr、PrivateStAddr、TransportProtocol、PrivateScPort、PrivateStPort），而公共领域中的同一会话表示为（PublicSrcAddr，"
    },
    {
      "indent": 3,
      "text": "PublicDstAddr, TransportProtocol, PublicSrcPort, PublicDstPort), the NAT session will provide the translation glue between the two session representations. NAT sessions in the document are restricted to sessions based on TCP and UDP only. In the future, NAT sessions may be extended to be based on other transport protocols such as SCTP, UDP-lite and DCCP.",
      "zh-CHS": "NAT会话将在两个会话表示之间提供转换粘合剂。文档中的NAT会话仅限于基于TCP和UDP的会话。将来，NAT会话可以扩展为基于其他传输协议，如SCTP、UDP-lite和DCCP。"
    },
    {
      "indent": 3,
      "text": "The terms 'local' and 'private' are used interchangeably throughout the document when referring to private networks, IP addresses, and ports. Likewise, the terms 'global' and 'public' are used interchangeably when referring to public networks, IP addresses, and ports.",
      "zh-CHS": "当提及专用网络、IP地址和端口时，“本地”和“专用”这两个术语在整个文档中交替使用。同样，当提及公共网络、IP地址和端口时，术语“全局”和“公共”可以互换使用。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "zh-CHS": "4. 概述"
    },
    {
      "indent": 3,
      "text": "NAT MIB is configurable on a per-interface basis and depends in several parts on the IF-MIB [RFC2863].",
      "zh-CHS": "NAT MIB可在每个接口的基础上进行配置，并在几个部分依赖于IF-MIB[RFC2863]。"
    },
    {
      "indent": 3,
      "text": "NAT MIB requires that an interface for which NAT is configured be connected to either a private or a public realm. The realm association of the interface plays an important role in the definition of address maps for the interface. An address map entry identifies the orientation of the session (inbound or outbound to the interface) for which the entry may be used for NAT translation. The address map entry also identifies the end-point of the session that must be subject to translation. An SNMP Textual-Convention 'NatTranslationEntity' is defined to capture this important characteristic that combines session orientation and applicable session endpoint for translation.",
      "zh-CHS": "NAT MIB要求为其配置NAT的接口连接到私有或公共领域。接口的领域关联在接口地址映射的定义中起着重要作用。地址映射条目标识会话的方向（接口的入站或出站），该条目可用于NAT转换。地址映射条目还标识必须进行转换的会话的端点。SNMP文本约定“NatTranslationEntity”被定义为捕获这一重要特征，该特征结合了会话定向和适用的会话端点进行转换。"
    },
    {
      "indent": 3,
      "text": "An address map may consist of static or dynamic entries. NAT creates static binds from a static address map entry. Each static bind has a direct one-to-one relationship with a static address map entry. NAT creates dynamic binds from a dynamic address map entry upon seeing the first packet of a new session.",
      "zh-CHS": "地址映射可以由静态或动态条目组成。NAT从静态地址映射条目创建静态绑定。每个静态绑定都与静态地址映射条目有直接的一对一关系。NAT在看到新会话的第一个数据包时从动态地址映射条目创建动态绑定。"
    },
    {
      "indent": 3,
      "text": "The following subsections define the key objects used in NAT MIB, their inter-relationship, and how to configure a NAT device using the MIB module.",
      "zh-CHS": "以下小节定义NAT MIB中使用的关键对象、它们之间的关系以及如何使用MIB模块配置NAT设备。"
    },
    {
      "indent": 0,
      "text": "4.1. natInterfaceTable",
      "section_title": true,
      "zh-CHS": "4.1. 自然可介入"
    },
    {
      "indent": 3,
      "text": "natInterfaceTable is defined in the MIB module to configure interface specific realm type and the NAT services enabled for the interface. natInterfaceTable is indexed by ifIndex and also includes interface specific NAT statistics.",
      "zh-CHS": "NATInteractable在MIB模块中定义，用于配置特定于接口的领域类型以及为接口启用的NAT服务。Natinteractable由ifIndex编制索引，还包括特定于接口的NAT统计信息。"
    },
    {
      "indent": 3,
      "text": "The first step for an operator in configuring a NAT device is determining the interface over which NAT service is to be configured. When NAT service is operational, translated packets traverse the NAT device by ingressing on a private interface and egressing on a public interface or vice versa. An operator may configure the NAT service on either the public interface or the private interface in the traversal path.",
      "zh-CHS": "操作员配置NAT设备的第一步是确定要在其上配置NAT服务的接口。当NAT服务可操作时，经过翻译的数据包通过在专用接口上进入和在公共接口上退出来穿越NAT设备，反之亦然。操作员可以在遍历路径中的公共接口或私有接口上配置NAT服务。"
    },
    {
      "indent": 3,
      "text": "As the next step, the operator must identify the NAT service(s) desired for the interface. The operator may configure one or more NAT services on the same interface. The MIB module identifies four types of NAT services: Basic NAT, NAPT, twice NAT and bidirectional NAT. These are NAT varieties as defined in RFC 2663 [RFC2663]. Note that RFC 3489 [RFC3489] further classifies NAPT implementations based on the behavior exhibited by the NAPT devices from different vendors. However, the MIB module does not explicitly distinguish between the NAPT implementations. NAPT implementations may be distinguished between one another by monitoring the BIND and NAT Session objects generated by the NAT device as described in section 4.6.",
      "zh-CHS": "作为下一步，操作员必须识别接口所需的NAT服务。操作员可以在同一接口上配置一个或多个NAT服务。MIB模块识别四种类型的NAT服务：基本NAT、NAPT、两次NAT和双向NAT。这些是RFC 2663[RFC2663]中定义的NAT品种。请注意，RFC 3489[RFC3489]根据不同供应商的NAPT设备所显示的行为，进一步对NAPT实现进行分类。但是，MIB模块没有明确区分NAPT实现。如第4.6节所述，可以通过监视NAT设备生成的绑定和NAT会话对象来区分NAPT实现。"
    },
    {
      "indent": 0,
      "text": "4.2. natAddrMapTable",
      "section_title": true,
      "zh-CHS": "4.2. NataddrMatable"
    },
    {
      "indent": 3,
      "text": "natAddrMapTable is defined in the MIB module to configure address maps on a per-interface basis. natAddrMapTable is indexed by the tuple of (ifIndex, natAddrMapIndex). The same table is also used to collect Statistics for the address map entries. Address maps are key to NAT configuration. An operator may configure one or more address map entries per interface. NAT looks up address map entries in the order in which they are defined to determine the translation function at the start of each new session traversing the interface. An address map may consist of static or dynamic entries. A static address map entry has a direct one-to-one relationship with binds. NAT will dynamically create binds from a dynamic address map entry.",
      "zh-CHS": "natAddrMapTable在MIB模块中定义，用于在每个接口的基础上配置地址映射。natAddrMapTable由（ifIndex，natAddrMapIndex）的元组索引。该表还用于收集地址映射项的统计信息。地址映射是NAT配置的关键。操作员可以为每个接口配置一个或多个地址映射条目。NAT按照地址映射项的定义顺序查找地址映射项，以确定在穿越接口的每个新会话开始时的转换函数。地址映射可以由静态或动态条目组成。静态地址映射项与绑定具有直接的一对一关系。NAT将从动态地址映射条目动态创建绑定。"
    },
    {
      "indent": 3,
      "text": "The operator must be careful in selecting address map entries for an interface based on the interface realm-type and the type of NAT service desired. The operator can be amiss in the selection of address map entries when not paying attention to the associated interface characteristics defined in natInterfaceTable (described in section 4.1). For example, say the operator wishes to configure a NAPT map entry on an interface of a NAT device. If the operator chooses to configure the NAPT map entry on a public interface (i.e., interface realm-type is public), the operator should set the TranslationEntity of the NAPT address map entry to be outboundSrcEndPoint. On the other hand, if the operator chooses to configure the NAPT map entry on a private interface (i.e., interface realm-type is private), the operator should set the TranslationEntity of the NAPT address map entry to be InboundSrcEndPoint.",
      "zh-CHS": "操作员在根据接口域类型和所需NAT服务类型为接口选择地址映射条目时必须小心。操作员在选择地址映射条目时，如果不注意Natinteractable中定义的相关接口特征（如第4.1节所述），可能会出错。例如，假设操作员希望在NAT设备的接口上配置NAPT映射条目。如果操作员选择在公共接口上配置NAPT映射项（即，接口领域类型为public），则应将NAPT地址映射项的TranslationEntity设置为outboundSrcEndPoint。另一方面，如果操作员选择在私有接口上配置NAPT映射项（即，接口领域类型为私有），则操作员应将NAPT地址映射项的TranslationEntity设置为InboundSrcEndPoint。"
    },
    {
      "indent": 0,
      "text": "4.3. Default Timeouts, Protocol Table, and Other Scalars",
      "section_title": true,
      "zh-CHS": "4.3. 默认超时、协议表和其他标量"
    },
    {
      "indent": 3,
      "text": "DefTimeouts is defined in the MIB module to configure idle Bind timeout and IP protocol specific idle NAT session timeouts. The timeouts defined are global to the system and are not interface specific.",
      "zh-CHS": "DefTimeouts在MIB模块中定义，用于配置空闲绑定超时和IP协议特定的空闲NAT会话超时。定义的超时是系统的全局超时，不是特定于接口的超时。"
    },
    {
      "indent": 3,
      "text": "Protocol specific statistics are maintained in natProtocolTable, which is indexed by the protocol type.",
      "zh-CHS": "特定于协议的统计信息保存在natProtocolTable中，该表由协议类型索引。"
    },
    {
      "indent": 3,
      "text": "The scalars natAddrBindNumberOfEntries and natAddrPortBindNumberOfEntries hold the number of entries that currently exist in the Address Bind and the Address Port Bind tables, respectively.",
      "zh-CHS": "标量natAddrBindNumberOfEntries和natAddrPortBindNumberOfEntries分别保存地址绑定表和地址端口绑定表中当前存在的条目数。"
    },
    {
      "indent": 3,
      "text": "The generation of natPacketDiscard notifications can be configured by using the natNotifThrottlingInterval scalar MIB object.",
      "zh-CHS": "可以使用natNotifThrottlingInterval标量MIB对象配置natPacketDiscard通知的生成。"
    },
    {
      "indent": 0,
      "text": "4.4. natAddrBindTable and natAddrPortBindTable",
      "section_title": true,
      "zh-CHS": "4.4. natAddrBindTable和natAddrPortBindTable"
    },
    {
      "indent": 3,
      "text": "Two Bind tables, natAddrBindTable and natAddrPortBindTable, are defined to hold the bind entries. Entries are derived from the address map table and are not configurable. natAddrBindTable contains Address Binds, and natAddrPortBindTable contains Address Port Binds. natAddrBindTable is indexed by the tuple of (ifIndex, LocalAddrType, LocalAddr). natAddrPortBindTable is indexed by the tuple of (ifIndex, LocalAddrType, LocalAddr, LocalPort, Protocol). These tables also maintain bind specific statistics. A Symmetric NAT will have no entries in the Bind tables.",
      "zh-CHS": "定义了两个绑定表natAddrBindTable和natAddrPortBindTable来保存绑定项。条目来自地址映射表，不可配置。natAddrBindTable包含地址绑定，natAddrPortBindTable包含地址端口绑定。natAddrBindTable由（ifIndex、LocalAddrType、LocalAddr）的元组索引。natAddrPortBindTable由（iIndex、LocalAddrType、LocalAddr、LocalPort、Protocol）的元组索引。这些表还维护绑定特定的统计信息。对称NAT在绑定表中没有条目。"
    },
    {
      "indent": 0,
      "text": "4.5. natSessionTable",
      "section_title": true,
      "zh-CHS": "4.5. 不可讨论"
    },
    {
      "indent": 3,
      "text": "natSessionTable is defined to hold NAT session entries. NAT session entries are derived from NAT Binds (except in the case of Symmetric NAT) and are not configurable.",
      "zh-CHS": "natSessionTable定义为保存NAT会话条目。NAT会话项是从NAT绑定派生的（对称NAT的情况除外），不可配置。"
    },
    {
      "indent": 3,
      "text": "The NAT session provides the necessary translation glue between two session representations of the same end-to-end session; that is, a session as seen in the private realm and in the public realm. Session orientation (inbound or outbound) is determined from the orientation of the first packet traversing the NAT interface. Address map entries and bind entries on the interface determine whether a session is subject to NAT translation. One or both endpoints of a session may be subject to translation.",
      "zh-CHS": "NAT会话在同一个端到端会话的两个会话表示之间提供了必要的转换粘合剂；也就是说，在私有领域和公共领域中都可以看到会话。会话方向（入站或出站）由穿过NAT接口的第一个数据包的方向确定。接口上的地址映射项和绑定项确定会话是否要进行NAT转换。会话的一个或两个端点可能需要转换。"
    },
    {
      "indent": 3,
      "text": "With the exception of symmetric NAT, all other NAT functions use end-point specific bind to perform individual end-point translations. Multiple NAT sessions would use the same bind as long as they share",
      "zh-CHS": "除了对称NAT之外，所有其他NAT函数都使用特定于端点的bind来执行单独的端点转换。多个NAT会话将使用相同的绑定，只要它们共享"
    },
    {
      "indent": 3,
      "text": "the same endpoint. Symmetric NAT does not retain a consistent port bind across multiple sessions using the same endpoint. For this reason, the bind identifier for a NAT session in symmetric NAT is set to zero. natSessionTable is indexed by the tuple of (ifIndex, natSessionIndex). Statistics for NAT sessions are also maintained in the same table.",
      "zh-CHS": "相同的端点。对称NAT不会在使用同一端点的多个会话之间保留一致的端口绑定。因此，对称NAT中NAT会话的绑定标识符设置为零。natSessionTable由（ifIndex，natSessionIndex）的元组索引。NAT会话的统计信息也保存在同一个表中。"
    },
    {
      "indent": 0,
      "text": "4.6. RFC 3489 NAPT Variations, NAT Session and Bind Tables",
      "section_title": true,
      "zh-CHS": "4.6. RFC 3489 NAPT变体、NAT会话和绑定表"
    },
    {
      "indent": 3,
      "text": "[RFC3489] defines four variations of NAPT - Full Cone, Restricted Cone, Port Restricted Cone, and Symmetric NAT. These can be differentiated in the NAT MIB based on different values for the objects in the session and the bind tables, as indicated below.",
      "zh-CHS": "[RFC3489]定义了NAPT的四种变体-全锥、限制锥、端口限制锥和对称NAT。可以根据会话和绑定表中对象的不同值在NAT MIB中区分这些值，如下所示。"
    },
    {
      "indent": 3,
      "text": "In a Port Restricted Cone NAT, NAT Session objects will contain a non-zero PrivateSrcEPBindId object. Further, all address and port objects within a NAT session will have non-zero values (i.e., no wildcard matches).",
      "zh-CHS": "在端口受限的Cone NAT中，NAT会话对象将包含非零PrivateScepBindId对象。此外，NAT会话中的所有地址和端口对象都将具有非零值（即，没有通配符匹配）。"
    },
    {
      "indent": 3,
      "text": "An Address Restricted Cone NAT may have been implemented in the same way as a Port Restricted Cone NAT, except that the UDP NAT Sessions may use ANY match on PrivateDstPort and PublicDstPort objects; i.e., PrivateDstPort and PublicDstPort objects within a NAT session may be set to zero.",
      "zh-CHS": "地址受限Cone NAT的实现方式可能与端口受限Cone NAT相同，但UDP NAT会话可能在PrivatedsPort和PublicdsPort对象上使用任何匹配；i、 例如，NAT会话中的PrivatedSport和PublicdSport对象可以设置为零。"
    },
    {
      "indent": 3,
      "text": "A Full Cone NAT may have also been implemented in the same way as a Port Restricted Cone NAT, except that the UDP NAT Sessions may use ANY match on PrivateDstAddr, PrivateDstPort, PublicDstAddr, and PublicDstPort objects. Within a NAT Session, all four of these objects may be set to zero. Alternately, all address and port objects within a NAT Session may have non-zero values, yet the TranslationEntity of the PrivateSrcEPBindId for the NAT Sessions may be set bi-directionally, i.e., as a bit mask of (outboundSrcEndPoint and inboundDstEndPoint) or (inboundSrcEndPoint and outboundDstEndPoint), depending on the interface realm type. Lastly, a Symmetric NAT does not maintain Port Bindings. As such, the NAT Session objects will have the PrivateSrcEPBindId set to zero.",
      "zh-CHS": "除了UDP NAT会话可以在PrivatedStatdr、PrivatedStatport、PublicdStatdr和PublicdStatport对象上使用任何匹配项外，完整Cone NAT的实现方式也可能与端口受限Cone NAT相同。在NAT会话中，所有四个对象都可以设置为零。或者，NAT会话中的所有地址和端口对象可能具有非零值，但是NAT会话的私有SRCEPBindId的TranslationEntity可以双向设置，即，根据接口域类型，设置为（OutboundSrceEndpoint和InboundDsEndpoint）或（InboundSrceEndpoint和OutboundDsEndpoint）的位掩码。最后，对称NAT不维护端口绑定。因此，NAT会话对象的privateScepBindId将设置为零。"
    },
    {
      "indent": 0,
      "text": "4.7. Notifications",
      "section_title": true,
      "zh-CHS": "4.7. 通知"
    },
    {
      "indent": 3,
      "text": "natPacketDiscard notifies the end user/manager of packets being discarded due to lack of address mappings.",
      "zh-CHS": "natPacketDiscard通知最终用户/管理员由于缺少地址映射而丢弃的数据包。"
    },
    {
      "indent": 0,
      "text": "4.8. Relation Among Tables",
      "section_title": true,
      "zh-CHS": "4.8. 表之间的关系"
    },
    {
      "indent": 3,
      "text": "The association between the various NAT tables can be represented as follows:",
      "zh-CHS": "各种NAT表之间的关联可以表示为："
    },
    {
      "indent": 3,
      "text": "                      Interface\n                          |\n                          |\n                          |\n                     Address map\n                          |\n                          |\n                          |\n     ----------------------------------------------\n    |                                              |\n    |                                              |\n    |                                              |\nAddress Bind                                   Port Bind\n    |                                              |\n    |                                              |\n    |                                              |\n     ----------------------------------------------\n                          |\n                          |\n                          |\n                      NAT Session",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "All NAT functions, with the exception of Symmetric NAT, use Bind(s) to provide the glue necessary for a NAT Session. natSessionPrivateSrcEPBindId and natSessionPrivateDstEPBindId objects represent the endpoint Binds used by NAT Sessions.",
      "zh-CHS": "除对称NAT外，所有NAT函数都使用Bind提供NAT会话所需的粘合。NatSessionPrivateScepBindId和natSessionPrivateDstEPBindId对象表示NAT会话使用的端点绑定。"
    },
    {
      "indent": 0,
      "text": "4.9. Configuration via the MIB",
      "section_title": true,
      "zh-CHS": "4.9. 通过MIB进行配置"
    },
    {
      "indent": 3,
      "text": "Sections 4.1 and 4.2 and part of section 4.3 refer to objects that are configurable on a NAT device. NAT derives Address Bind and Address Port Bind entries from the Address Map table. Hence, an Address Bind or an Address Port Bind entry must not exist without an associated entry in the Address Map table.",
      "zh-CHS": "第4.1节和第4.2节以及第4.3节的一部分涉及NAT设备上可配置的对象。NAT从地址映射表派生地址绑定和地址端口绑定项。因此，如果地址映射表中没有关联的条目，地址绑定或地址端口绑定条目就不能存在。"
    },
    {
      "indent": 3,
      "text": "Further, NAT derives NAT session entries from NAT Binds, except in the case of symmetric NAT, which derives translation parameters for a NAT session directly from an address map entry. Hence, with the exception of Symmetric NAT, a NAT session entry must not exist in the NAT Session table without a corresponding bind.",
      "zh-CHS": "此外，NAT从NAT绑定派生NAT会话项，但对称NAT的情况除外，对称NAT直接从地址映射项派生NAT会话的转换参数。因此，除了对称NAT之外，NAT会话条目在NAT会话表中必须没有相应的绑定。"
    },
    {
      "indent": 3,
      "text": "A Management station may use the following steps to configure entries in the NAT-MIB:",
      "zh-CHS": "管理站可以使用以下步骤来配置NAT-MIB中的条目："
    },
    {
      "indent": 3,
      "text": "- Create an entry in the natInterfaceTable specifying the value of ifIndex as the interface index of the interface on which NAT is being configured. Specify appropriate values, as applicable, for the other objects (e.g., natInterfaceRealm, natInterfaceServiceType) in the table (refer to Section 4.1).",
      "zh-CHS": "- 在Natinteractable中创建一个条目，指定ifIndex的值作为配置NAT的接口的接口索引。为表中的其他对象（如natInterfaceRealm、natInterfaceServiceType）指定适当的值（如适用）（参考第4.1节）。"
    },
    {
      "indent": 3,
      "text": "- Create one or more address map entries sequentially in reduced order of priority in the natAddrMapTable, specifying the value of ifIndex to be the same for all entries. The ifIndex specified would be the same as that specified for natInterfaceTable (refer to Section 4.2).",
      "zh-CHS": "- 在natAddrMapTable中按优先级降序顺序创建一个或多个地址映射项，并将ifIndex的值指定为与所有项相同。指定的ifIndex与为Natinteractable指定的ifIndex相同（请参阅第4.2节）。"
    },
    {
      "indent": 3,
      "text": "- Configure the maximum permitted idle time duration for BINDs and TCP, UDP, and ICMP protocol sessions by setting the relevant scalars in natDefTimeouts object (refer to Section 4.3).",
      "zh-CHS": "- 通过在natDefTimeouts对象中设置相关标量，为绑定和TCP、UDP和ICMP协议会话配置允许的最大空闲时间（请参阅第4.3节）。"
    },
    {
      "indent": 0,
      "text": "4.10. Relationship to Interface MIB",
      "section_title": true,
      "zh-CHS": "4.10. 与接口MIB的关系"
    },
    {
      "indent": 3,
      "text": "The natInterfaceTable specifies the NAT configuration attributes on each interface. The concept of \"interface\" is as defined by InterfaceIndex/ifIndex of the IETF Interfaces MIB [RFC2863].",
      "zh-CHS": "Natinteractable指定每个接口上的NAT配置属性。“接口”的概念由IETF接口MIB[RFC2863]的InterfaceIndex/ifIndex定义。"
    },
    {
      "indent": 0,
      "text": "5. Definitions",
      "section_title": true,
      "zh-CHS": "5. 定义"
    },
    {
      "indent": 3,
      "text": "This MIB module IMPORTs objects from RFCs 2578 [RFC2578], 2579\n[RFC2579], 2580 [RFC2580], 2863 [RFC2863], 3411 [RFC3411], and 4001\n[RFC4001].  It also refers to information in RFCs 792 [RFC792], 2463\n[RFC2463], and 3413 [RFC3413].",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NAT-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Integer32, Unsigned32, Gauge32, Counter64, TimeTicks, mib-2, NOTIFICATION-TYPE FROM SNMPv2-SMI TEXTUAL-CONVENTION, StorageType, RowStatus",
      "zh-CHS": "从SNMPv2 SMI文本约定、存储类型、行状态导入模块标识、对象类型、整数32、无符号32、计量器32、计数器64、时间刻度、mib-2、通知类型"
    },
    {
      "indent": 5,
      "text": " FROM SNMPv2-TC MODULE-COMPLIANCE, NOTIFICATION-GROUP, OBJECT-GROUP FROM SNMPv2-CONF ifIndex, ifCounterDiscontinuityGroup FROM IF-MIB SnmpAdminString FROM SNMP-FRAMEWORK-MIB InetAddressType, InetAddress, InetPortNumber FROM INET-ADDRESS-MIB;",
      "zh-CHS": "来自SNMPv2 TC MODULE-COMPLIANCE，来自SNMPv2 CONF iIndex的通知组，来自IF-MIB的对象组，来自SNMP-FRAMEWORK-MIB的iFcounterinteractionyGroup，来自SNMP-FRAMEWORK-MIB的InetAddressType，InetAddress，来自INET-ADDRESS-MIB的InetPortNumber；"
    },
    {
      "indent": 0,
      "text": "natMIB MODULE-IDENTITY LAST-UPDATED \"200503210000Z\" ORGANIZATION \"IETF Transport Area\" CONTACT-INFO \" Rohit Mascon Global Limited #59/2 100 ft Ring Road Banashankari II Stage Bangalore 560 070 India Phone: +91 80 2679 6227 Email: rrohit74@hotmail.com",
      "zh-CHS": "natMIB模块标识最后更新的“200503210000Z”组织“IETF运输区”联系方式“Rohit Mascon Global Limited#59/2 100 ft环路Banashankari II期班加罗尔560070印度电话：+91 80 2679 6227电子邮件：rrohit74@hotmail.com"
    },
    {
      "indent": 15,
      "text": "P. Srisuresh Caymas Systems, Inc. 1179-A North McDowell Blvd. Petaluma, CA 94954 Tel: (707) 283-5063 Email: srisuresh@yahoo.com",
      "zh-CHS": "P.Srisuresh Caymas Systems，Inc.1179-A北麦克道尔大道。加利福尼亚州佩塔卢马94954电话：（707）283-5063电子邮件：srisuresh@yahoo.com"
    },
    {
      "indent": 15,
      "text": "Rajiv Raghunarayan Cisco Systems Inc. 170 West Tasman Drive San Jose, CA 95134 Phone: +1 408 853 9612 Email: raraghun@cisco.com",
      "zh-CHS": "Rajiv Raghunarayan Cisco Systems Inc.位于加利福尼亚州圣何塞市西塔斯曼大道170号，邮编95134电话：+1 408 853 9612电子邮件：raraghun@cisco.com"
    },
    {
      "indent": 15,
      "text": "Nalinaksh Pai Cisco Systems, Inc. Prestige Waterford No. 9, Brunton Road Bangalore - 560 025",
      "zh-CHS": "Nalinaksh Pai Cisco Systems，Inc.班加罗尔布伦顿路9号威望沃特福德-560 025"
    },
    {
      "indent": 15,
      "text": "India Phone: +91 80 532 1300 Email: npai@cisco.com",
      "zh-CHS": "印度电话：+91 80 532 1300电子邮件：npai@cisco.com"
    },
    {
      "indent": 5,
      "text": " Cliff Wang Information Security Bank One Corp 1111 Polaris Pkwy Columbus, OH 43240 Phone: +1 614 213 6117 Email: cliffwang2000@yahoo.com \" DESCRIPTION \"This MIB module defines the generic managed objects for NAT.",
      "zh-CHS": "Cliff Wang信息安全银行一号公司1111 Polaris Pkwy俄亥俄州哥伦布43240电话：+1 614 213 6117电子邮件：cliffwang2000@yahoo.com“说明”此MIB模块定义NAT的通用托管对象。"
    },
    {
      "indent": 5,
      "text": "         Copyright (C) The Internet Society (2005).  This version\n         of this MIB module is part of RFC 4008;  see the RFC\n         itself for full legal notices.\"\nREVISION     \"200503210000Z\"  -- 21th March 2005\nDESCRIPTION\n        \"Initial version, published as RFC 4008.\"\n::= { mib-2 123 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natMIBObjects OBJECT IDENTIFIER ::= { natMIB 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatProtocolType ::= TEXTUAL-CONVENTION\n       STATUS       current\n       DESCRIPTION\n               \"A list of protocols that support the network\n                address translation.  Inclusion of the values is\n                not intended to imply that those protocols\n                need to be supported.  Any change in this\n                TEXTUAL-CONVENTION should also be reflected in\n                the definition of NatProtocolMap, which is a\n                BITS representation of this.\"\n       SYNTAX   INTEGER {\n                     none (1),  -- not specified\n                     other (2), -- none of the following\n                     icmp (3),\n                     udp (4),\n                     tcp (5)\n                  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatProtocolMap ::= TEXTUAL-CONVENTION\n       STATUS       current\n       DESCRIPTION\n               \"A bitmap of protocol identifiers that support",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "         the network address translation.  Any change\n         in this TEXTUAL-CONVENTION should also be\n         reflected in the definition of NatProtocolType.\"\nSYNTAX   BITS {\n           other (0),\n           icmp (1),\n           udp (2),\n           tcp (3)\n         }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatAddrMapId ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each address map\n                by a NAT enabled device.\"\n       SYNTAX   Unsigned32 (1..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatBindIdOrZero ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each bind by\n                a NAT enabled device.  The bind id will be zero\n                in the case of a Symmetric NAT.\"\n       SYNTAX   Unsigned32 (0..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatBindId ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each bind by\n                a NAT enabled device.\"\n       SYNTAX   Unsigned32 (1..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatSessionId ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each session by\n                a NAT enabled device.\"\n       SYNTAX   Unsigned32 (1..4294967295)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatBindMode ::= TEXTUAL-CONVENTION\n       STATUS current\n       DESCRIPTION\n               \"An indication of whether the bind is\n                an address bind or an address port bind.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "SYNTAX   INTEGER {\n              addressBind (1),\n              addressPortBind (2)\n         }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatAssociationType ::= TEXTUAL-CONVENTION\n       STATUS current\n       DESCRIPTION\n               \"An indication of whether the association is\n                static or dynamic.\"\n       SYNTAX   INTEGER {\n                     static (1),\n                     dynamic (2)\n                }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatTranslationEntity ::= TEXTUAL-CONVENTION\n       STATUS       current\n       DESCRIPTION\n               \"An indication of a) the direction of a session for\n                which an address map entry, address bind or port\n                bind is applicable, and b) the entity (source or\n                destination) within the session that is subject to\n                translation.\"\n       SYNTAX   BITS {\n                  inboundSrcEndPoint (0),\n                  outboundDstEndPoint(1),\n                  inboundDstEndPoint (2),\n                  outboundSrcEndPoint(3)\n                }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Default Values for the Bind and NAT Protocol Timers --",
      "zh-CHS": "----绑定和NAT协议计时器的默认值--"
    },
    {
      "indent": 0,
      "text": "natDefTimeouts OBJECT IDENTIFIER ::= { natMIBObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natNotifCtrl OBJECT IDENTIFIER ::= { natMIBObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Address Bind and Port Bind related NAT configuration --",
      "zh-CHS": "-- -- Address Bind and Port Bind related NAT configuration --translate error, please retry"
    },
    {
      "indent": 0,
      "text": "natBindDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (0..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION",
      "zh-CHS": "NatbindDefdleTimeout对象类型语法Unsigned32（0..4294967295）单位“秒”最大访问读写状态当前说明"
    },
    {
      "indent": 12,
      "text": "\"The default Bind (Address Bind or Port Bind) idle timeout parameter.",
      "zh-CHS": "“默认绑定（地址绑定或端口绑定）空闲超时参数。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 0 }\n::= { natDefTimeouts 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- UDP related NAT configuration --",
      "zh-CHS": "----UDP相关NAT配置--"
    },
    {
      "indent": 0,
      "text": "natUdpDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default UDP idle timeout parameter.",
      "zh-CHS": "NatudpDefileTimeout对象类型语法Unsigned32（1..4294967295）单位“秒”最大访问读写状态当前描述“默认UDP空闲超时参数。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 300 }\n::= { natDefTimeouts 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- ICMP related NAT configuration --",
      "zh-CHS": "----与ICMP相关的NAT配置--"
    },
    {
      "indent": 0,
      "text": "natIcmpDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default ICMP idle timeout parameter.",
      "zh-CHS": "NaticMPDefileTimeout对象类型语法Unsigned32（1..4294967295）单位“秒”最大访问读写状态当前描述“默认ICMP空闲超时参数。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 300 }\n::= { natDefTimeouts 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Other protocol parameters --",
      "zh-CHS": "----其他协议参数--"
    },
    {
      "indent": 0,
      "text": "natOtherDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default idle timeout parameter for protocols represented by the value other (2) in NatProtocolType.",
      "zh-CHS": "natOtherDefIdleTimeout对象类型语法Unsigned32（1..4294967295）单位“秒”最大访问读写状态当前描述“协议的默认空闲超时参数，由NatProtocolType中的值other（2）表示。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 60 }\n::= { natDefTimeouts 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- TCP related NAT Timers --",
      "zh-CHS": "----与TCP相关的NAT计时器--"
    },
    {
      "indent": 0,
      "text": "natTcpDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default time interval that a NAT session for an established TCP connection is allowed to remain valid without any activity on the TCP connection.",
      "zh-CHS": "natTcpDefIdleTimeout对象类型语法Unsigned32（1..4294967295）单位“秒”最大访问读写状态当前描述“允许已建立TCP连接的NAT会话在TCP连接上不进行任何活动的情况下保持有效的默认时间间隔。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 86400 }\n::= { natDefTimeouts 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natTcpDefNegTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION",
      "zh-CHS": "natTcpDefNegTimeout对象类型语法Unsigned32（1..4294967295）单位“秒”最大访问读写状态当前说明"
    },
    {
      "indent": 12,
      "text": "\"The default time interval that a NAT session for a TCP connection that is not in the established state is allowed to remain valid without any activity on the TCP connection.",
      "zh-CHS": "“允许未处于已建立状态的TCP连接的NAT会话在TCP连接上没有任何活动的情况下保持有效的默认时间间隔。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 60 }\n::= { natDefTimeouts 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natNotifThrottlingInterval OBJECT-TYPE SYNTAX Integer32 (0 | 5..3600) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object controls the generation of the natPacketDiscard notification.",
      "zh-CHS": "natNotifThrottlingInterval对象类型语法整数32（0 | 5..3600）单位“秒”最大访问读写状态当前描述“此对象控制natPacketDiscard通知的生成。"
    },
    {
      "indent": 13,
      "text": "If this object has a value of zero, then no natPacketDiscard notifications will be transmitted by the agent.",
      "zh-CHS": "如果此对象的值为零，则代理不会传输任何natPacketDiscard通知。"
    },
    {
      "indent": 13,
      "text": "If this object has a non-zero value, then the agent must not generate more than one natPacketDiscard 'notification-event' in the indicated period, where a 'notification-event' is the generation of a single notification PDU type to a list of notification destinations. If additional NAT packets are discarded within the throttling period, then notification-events for these changes must be suppressed by the agent until the current throttling period expires.",
      "zh-CHS": "如果此对象具有非零值，则代理在指定的时间段内不得生成多个natPacketDiscard“通知事件”，其中“通知事件”是向通知目标列表生成单个通知PDU类型。如果在限制期内丢弃了其他NAT数据包，则代理必须抑制这些更改的通知事件，直到当前限制期到期。"
    },
    {
      "indent": 13,
      "text": "If natNotifThrottlingInterval notification generation is enabled, the suggested default throttling period is 60 seconds, but generation of the natPacketDiscard notification should be disabled by default.",
      "zh-CHS": "如果启用了natNotifThrottlingInterval通知生成，则建议的默认调节周期为60秒，但默认情况下应禁用natPacketDiscard通知的生成。"
    },
    {
      "indent": 13,
      "text": "If the agent is capable of storing non-volatile configuration, then the value of this object must be restored after a re-initialization of the management system.",
      "zh-CHS": "如果代理能够存储非易失性配置，则必须在管理系统重新初始化后恢复此对象的值。"
    },
    {
      "indent": 4,
      "text": " The actual transmission of notifications is controlled via the MIB modules in RFC 3413.\" DEFVAL { 0 }",
      "zh-CHS": "通知的实际传输通过RFC 3413中的MIB模块进行控制。“deffal{0}”"
    },
    {
      "indent": 4,
      "text": "::= { natNotifCtrl 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- The NAT Interface Table --",
      "zh-CHS": "----NAT接口表--"
    },
    {
      "indent": 0,
      "text": "natInterfaceTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF NatInterfaceEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This table specifies the attributes for interfaces on a\n             device supporting NAT function.\"\n    ::= { natMIBObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceEntry OBJECT-TYPE SYNTAX NatInterfaceEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Each entry in the natInterfaceTable holds a set of parameters for an interface, instantiated by ifIndex. Therefore, the interface index must have been assigned, according to the applicable procedures, before it can be meaningfully used. Generally, this means that the interface must exist.",
      "zh-CHS": "natInterfaceEntry对象类型语法natInterfaceEntry MAX-ACCESS不可访问状态当前描述“Natinteractable中的每个条目都包含一组接口参数，由ifIndex实例化。因此，必须根据适用程序分配接口索引，然后才能有意义地使用它。通常，这意味着接口必须存在。"
    },
    {
      "indent": 4,
      "text": "         When natStorageType is of type nonVolatile, however,\n         this may reflect the configuration for an interface whose\n         ifIndex has been assigned but for which the supporting\n         implementation is not currently present.\"\nINDEX   { ifIndex }\n::= { natInterfaceTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatInterfaceEntry ::= SEQUENCE {\n    natInterfaceRealm            INTEGER,\n    natInterfaceServiceType      BITS,\n    natInterfaceInTranslates     Counter64,\n    natInterfaceOutTranslates    Counter64,\n    natInterfaceDiscards         Counter64,\n    natInterfaceStorageType      StorageType,\n    natInterfaceRowStatus        RowStatus\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceRealm OBJECT-TYPE SYNTAX INTEGER { private (1), public (2)",
      "zh-CHS": "natInterfaceRealm对象类型语法整数{private（1），public（2）"
    },
    {
      "indent": 4,
      "text": "           }\nMAX-ACCESS read-create\nSTATUS     current\nDESCRIPTION\n        \"This object identifies whether this interface is\n         connected to the private or the public realm.\"\nDEFVAL  { public }\n::= { natInterfaceEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceServiceType OBJECT-TYPE\n    SYNTAX  BITS {\n                basicNat (0),\n                napt (1),\n                bidirectionalNat (2),\n                twiceNat (3)\n            }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"An indication of the direction in which new sessions\n             are permitted and the extent of translation done within\n             the IP and transport headers.\"\n    ::= { natInterfaceEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceInTranslates OBJECT-TYPE\n    SYNTAX     Counter64\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"Number of packets received on this interface that\n             were translated.\n             Discontinuities in the value of this counter can occur at\n             reinitialization of the management system and at other\n             times as indicated by the value of\n             ifCounterDiscontinuityTime on the relevant interface.\"\n    ::= { natInterfaceEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"Number of translated packets that were sent out this interface.",
      "zh-CHS": "natInterfaceOutTranslates对象类型语法计数器64 MAX-ACCESS只读状态当前描述“发送到此接口的已翻译数据包数。"
    },
    {
      "indent": 13,
      "text": "Discontinuities in the value of this counter can occur at reinitialization of the management system and at other times as indicated by the value of",
      "zh-CHS": "在管理系统重新初始化时，以及在管理系统值指示的其他时间，该计数器的值可能出现不连续"
    },
    {
      "indent": 4,
      "text": "         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natInterfaceEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"Number of packets that had to be rejected/dropped due to a lack of resources for this interface.",
      "zh-CHS": "natInterfaceDiscards对象类型语法计数器64 MAX-ACCESS只读状态当前描述“由于缺少此接口的资源而必须拒绝/丢弃的数据包数”。"
    },
    {
      "indent": 5,
      "text": "        Discontinuities in the value of this counter can occur at\n        reinitialization of the management system and at other\n        times as indicated by the value of\n        ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natInterfaceEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceStorageType OBJECT-TYPE\n    SYNTAX      StorageType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"The storage type for this conceptual row.\n             Conceptual rows having the value 'permanent'\n             need not allow write-access to any columnar objects\n             in the row.\"\n    REFERENCE\n            \"Textual Conventions for SMIv2, Section 2.\"\n    DEFVAL { nonVolatile }\n    ::= { natInterfaceEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natInterfaceRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The status of this conceptual row.",
      "zh-CHS": "natInterfaceRowStatus对象类型语法RowStatus MAX-ACCESS读取创建状态当前描述“此概念行的状态。"
    },
    {
      "indent": 13,
      "text": "Until instances of all corresponding columns are appropriately configured, the value of the corresponding instance of the natInterfaceRowStatus column is 'notReady'.",
      "zh-CHS": "在正确配置所有对应列的实例之前，natInterfaceRowStatus列的对应实例的值为“notReady”。"
    },
    {
      "indent": 13,
      "text": "In particular, a newly created row cannot be made active until the corresponding instance of natInterfaceServiceType has been set.",
      "zh-CHS": "特别是，在设置相应的natInterfaceServiceType实例之前，新创建的行不能被激活。"
    },
    {
      "indent": 4,
      "text": "         None of the objects in this row may be modified\n         while the value of this object is active(1).\"\nREFERENCE\n        \"Textual Conventions for SMIv2, Section 2.\"\n::= { natInterfaceEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- The Address Map Table --",
      "zh-CHS": "----地址映射表--"
    },
    {
      "indent": 0,
      "text": "natAddrMapTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF NatAddrMapEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This table lists address map parameters for NAT.\"\n    ::= { natMIBObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapEntry OBJECT-TYPE\n    SYNTAX      NatAddrMapEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This entry represents an address map to be used for\n             NAT and contributes to the dynamic and/or static\n             address mapping tables of the NAT device.\"\n    INDEX   { ifIndex, natAddrMapIndex }\n    ::= { natAddrMapTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatAddrMapEntry ::= SEQUENCE {\n    natAddrMapIndex                 NatAddrMapId,\n    natAddrMapName                  SnmpAdminString,\n    natAddrMapEntryType             NatAssociationType,\n    natAddrMapTranslationEntity     NatTranslationEntity,\n    natAddrMapLocalAddrType         InetAddressType,\n    natAddrMapLocalAddrFrom         InetAddress,\n    natAddrMapLocalAddrTo           InetAddress,\n    natAddrMapLocalPortFrom         InetPortNumber,\n    natAddrMapLocalPortTo           InetPortNumber,\n    natAddrMapGlobalAddrType        InetAddressType,\n    natAddrMapGlobalAddrFrom        InetAddress,\n    natAddrMapGlobalAddrTo          InetAddress,\n    natAddrMapGlobalPortFrom        InetPortNumber,\n    natAddrMapGlobalPortTo          InetPortNumber,\n    natAddrMapProtocol              NatProtocolMap,\n    natAddrMapInTranslates          Counter64,\n    natAddrMapOutTranslates         Counter64,\n    natAddrMapDiscards              Counter64,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": " natAddrMapAddrUsed Gauge32, natAddrMapStorageType StorageType, natAddrMapRowStatus RowStatus }",
      "zh-CHS": "NATADDRMAPDRUSED量表32，natAddrMapStorageType存储类型，natAddrMapRowStatus RowStatus}"
    },
    {
      "indent": 0,
      "text": "natAddrMapIndex  OBJECT-TYPE\n    SYNTAX      NatAddrMapId\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"Along with ifIndex, this object uniquely\n             identifies an entry in the natAddrMapTable.\n             Address map entries are applied in the order\n             specified by natAddrMapIndex.\"\n    ::= { natAddrMapEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapName OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE(1..32))\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"Name identifying all map entries in the table associated\n             with the same interface.  All map entries with the same\n             ifIndex MUST have the same map name.\"\n    ::= { natAddrMapEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapEntryType OBJECT-TYPE\n    SYNTAX      NatAssociationType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This parameter can be used to set up static\n             or dynamic address maps.\"\n    ::= { natAddrMapEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapTranslationEntity OBJECT-TYPE SYNTAX NatTranslationEntity MAX-ACCESS read-create STATUS current DESCRIPTION \"The end-point entity (source or destination) in inbound or outbound sessions (i.e., first packets) that may be translated by an address map entry.",
      "zh-CHS": "natAddrMapTranslationEntity对象类型语法NatTranslationEntity MAX-ACCESS read create STATUS current DESCRIPTION“入站或出站会话（即第一个数据包）中可由地址映射条目翻译的端点实体（源或目标）。"
    },
    {
      "indent": 13,
      "text": "Session direction (inbound or outbound) is derived from the direction of the first packet of a session traversing a NAT interface. NAT address (and Transport-ID) maps may be defined",
      "zh-CHS": "会话方向（入站或出站）源自会话的第一个数据包穿过NAT接口的方向。可以定义NAT地址（和传输ID）映射"
    },
    {
      "indent": 13,
      "text": "to effect inbound or outbound sessions.",
      "zh-CHS": "执行入站或出站会话。"
    },
    {
      "indent": 13,
      "text": "Traditionally, address maps for Basic NAT and NAPT are configured on a public interface for outbound sessions, effecting translation of source end-point. The value of this object must be set to outboundSrcEndPoint for those interfaces.",
      "zh-CHS": "传统上，基本NAT和NAPT的地址映射配置在出站会话的公共接口上，从而影响源端点的转换。对于这些接口，此对象的值必须设置为outboundSrcEndPoint。"
    },
    {
      "indent": 13,
      "text": "Alternately, if address maps for Basic NAT and NAPT were to be configured on a private interface, the desired value for this object for the map entries would be inboundSrcEndPoint (i.e., effecting translation of source end-point for inbound sessions).",
      "zh-CHS": "或者，如果要在专用接口上配置基本NAT和NAPT的地址映射，则映射项的此对象所需值将为inboundSrcEndPoint（即，影响入站会话的源端点转换）。"
    },
    {
      "indent": 4,
      "text": "         If TwiceNAT were to be configured on a private interface,\n         the desired value for this object for the map entries\n         would be a bitmask of inboundSrcEndPoint and\n         inboundDstEndPoint.\"\n::= { natAddrMapEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrMapLocalAddrFrom and natAddrMapLocalAddrTo.\"\n    ::= { natAddrMapEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalAddrFrom OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"This object specifies the first IP address of the range of IP addresses mapped by this translation entry. The value of this object must be less than or equal to the value of the natAddrMapLocalAddrTo object.",
      "zh-CHS": "NataddrMapLocalAddressFrom对象类型语法InetAddress MAX-ACCESS读取创建状态当前描述“此对象指定此转换项映射的IP地址范围的第一个IP地址。此对象的值必须小于或等于NataddrMapLocalAddressTo对象的值。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapLocalAddrType object.\"\n::= { natAddrMapEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalAddrTo OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION",
      "zh-CHS": "NATADDRMAPPLOCALADDRTO对象类型语法InetAddress MAX-ACCESS读取创建状态当前描述"
    },
    {
      "indent": 12,
      "text": "\"This object specifies the last IP address of the range of IP addresses mapped by this translation entry. If only a single address is being mapped, the value of this object is equal to the value of natAddrMapLocalAddrFrom. For a static NAT, the number of addresses in the range defined by natAddrMapLocalAddrFrom and natAddrMapLocalAddrTo must be equal to the number of addresses in the range defined by natAddrMapGlobalAddrFrom and natAddrMapGlobalAddrTo. The value of this object must be greater than or equal to the value of the natAddrMapLocalAddrFrom object.",
      "zh-CHS": "此对象指定此转换项映射的IP地址范围的最后一个IP地址。如果只映射一个地址，此对象的值等于NatAddrMapLocalAddressFrom的值。对于静态NAT，NatAddrMapLocalAddressFrom和NatAddrMapLocalAddressTo定义的范围内的地址数必须相等指定NataddrMapgLobalAddressFrom和NataddrMapgLobalAddressTo定义的范围内的地址数。此对象的值必须大于或等于NataddrMaplobalAddressFrom对象的值。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapLocalAddrType object.\"\n::= { natAddrMapEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalPortFrom OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS current DESCRIPTION \"If this conceptual row describes a Basic NAT address mapping, then the value of this object must be zero. If this conceptual row describes NAPT, then the value of this object specifies the first port number in the range of ports being mapped.",
      "zh-CHS": "natAddrMapLocalPortFrom对象类型语法InetPortNumber MAX-ACCESS读取创建状态当前描述如果此概念行描述基本NAT地址映射，则此对象的值必须为零。如果此概念行描述NAPT，则此对象的值指定要映射的端口范围内的第一个端口号。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be less than or equal to the\n         value of the natAddrMapLocalPortTo object.  If the\n         translation specifies a single port, then the value of this\n         object is equal to the value of natAddrMapLocalPortTo.\"\nDEFVAL { 0 }\n::= { natAddrMapEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalPortTo OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS current DESCRIPTION \"If this conceptual row describes a Basic NAT address mapping, then the value of this object must be zero. If this conceptual row describes NAPT, then the value of this object specifies the last port number in the range of ports being mapped.",
      "zh-CHS": "NATADDRMAPPLOCALPORTTO对象类型语法INETPORTNAMER MAX-ACCESS read create STATUS current DESCRIPTION“如果此概念行描述基本NAT地址映射，则此对象的值必须为零。如果此概念行描述NAPT，则此对象的值指定要映射的端口范围内的最后一个端口号。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be greater than or equal to the value of the natAddrMapLocalPortFrom object. If the translation specifies a single port, then the value of this object is equal to the value of natAddrMapLocalPortFrom.\"",
      "zh-CHS": "此对象的值必须大于或等于natAddrMapLocalPortFrom对象的值。如果转换指定了单个端口，则此对象的值等于natAddrMapLocalPortFrom的值。“"
    },
    {
      "indent": 4,
      "text": "DEFVAL { 0 }\n::= { natAddrMapEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrMapGlobalAddrFrom and natAddrMapGlobalAddrTo.\"\n    ::= { natAddrMapEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalAddrFrom OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"This object specifies the first IP address of the range of IP addresses being mapped to. The value of this object must be less than or equal to the value of the natAddrMapGlobalAddrTo object.",
      "zh-CHS": "NATADDRMAPGLOBALADDROM对象类型语法InetAddress MAX-ACCESS read create STATUS current DESCRIPTION“此对象指定要映射到的IP地址范围的第一个IP地址。此对象的值必须小于或等于natAddrMapGlobalAddrTo对象的值。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapGlobalAddrType object.\"\n::= { natAddrMapEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalAddrTo OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"This object specifies the last IP address of the range of IP addresses being mapped to. If only a single address is being mapped to, the value of this object is equal to the value of natAddrMapGlobalAddrFrom. For a static NAT, the number of addresses in the range defined by natAddrMapGlobalAddrFrom and natAddrMapGlobalAddrTo must be equal to the number of addresses in the range defined by natAddrMapLocalAddrFrom and natAddrMapLocalAddrTo. The value of this object must be greater than or equal to the value of the natAddrMapGlobalAddrFrom object.",
      "zh-CHS": "natAddrMapGlobalAddrTo对象类型语法InetAddress MAX-ACCESS读取创建状态当前描述“此对象指定要映射到的IP地址范围的最后一个IP地址。如果只映射到一个地址，则此对象的值等于NATADDRMAPGLOBALADDROM的值。对于静态NAT，NATADDRMAPGLOBALADDROM和natAddrMapGlobalAddrTo定义的范围内的地址数必须等于NATADDRMAPPLOCALADDROM和NATADDRMAPPLOCALADDRTO定义的范围内的地址数。此对象的值必须大于或等于NataddrMapGlobalAddressFrom对象的值。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapGlobalAddrType object.\"\n::= { natAddrMapEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalPortFrom OBJECT-TYPE SYNTAX InetPortNumber",
      "zh-CHS": "natAddrMapGlobalPortFrom对象类型语法InetPortNumber"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS read-create STATUS current DESCRIPTION \"If this conceptual row describes a Basic NAT address mapping, then the value of this object must be zero. If this conceptual row describes NAPT, then the value of this object specifies the first port number in the range of ports being mapped to.",
      "zh-CHS": "MAX-ACCESS read create STATUS current DESCRIPTION“如果此概念行描述基本NAT地址映射，则此对象的值必须为零。如果此概念行描述NAPT，则此对象的值指定要映射到的端口范围内的第一个端口号。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be less than or equal to the\n         value of the natAddrMapGlobalPortTo object.  If the\n         translation specifies a single port, then the value of this\n         object is equal to the value natAddrMapGlobalPortTo.\"\nDEFVAL { 0 }\n::= { natAddrMapEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalPortTo OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS current DESCRIPTION \"If this conceptual row describes a Basic NAT address mapping, then the value of this object must be zero. If this conceptual row describes NAPT, then the value of this object specifies the last port number in the range of ports being mapped to.",
      "zh-CHS": "natAddrMapGlobalPortTo对象类型语法InetPortNumber MAX-ACCESS读取创建状态当前描述如果此概念行描述基本NAT地址映射，则此对象的值必须为零。如果此概念行描述NAPT，则此对象的值指定要映射到的端口范围内的最后一个端口号。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be greater than or equal to\n         the value of the natAddrMapGlobalPortFrom object.  If the\n         translation specifies a single port, then the value of this\n         object is equal to the value of natAddrMapGlobalPortFrom.\"\nDEFVAL { 0 }\n::= { natAddrMapEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapProtocol OBJECT-TYPE\n    SYNTAX      NatProtocolMap\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies a bitmap of protocol identifiers.\"\n    ::= { natAddrMapEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "NATADDRMAPINTRANSTESS对象类型语法计数器64 MAX-ACCESS只读状态当前说明"
    },
    {
      "indent": 12,
      "text": "\"The number of inbound packets pertaining to this address map entry that were translated.",
      "zh-CHS": "“已翻译的与此地址映射项相关的入站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrMapEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets pertaining to this address map entry that were translated.",
      "zh-CHS": "NATADDRMAPOUTTRATES对象类型语法计数器64 MAX-ACCESS只读状态当前描述“与此地址映射项相关的已翻译出站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrMapEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of packets pertaining to this address map entry that were dropped due to lack of addresses in the address pool identified by this address map. The value of this object must always be zero in case of static address map.",
      "zh-CHS": "natAddrMapDiscards对象类型语法计数器64 MAX-ACCESS只读状态当前描述“由于此地址映射标识的地址池中缺少地址而丢弃的与此地址映射项相关的数据包数。对于静态地址映射，此对象的值必须始终为零。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrMapEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapAddrUsed OBJECT-TYPE SYNTAX Gauge32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of addresses pertaining to this address map that are currently being used from the NAT pool. The value of this object must always be zero in the case",
      "zh-CHS": "NATADDRMAPDRUSED对象类型语法量表32 MAX-ACCESS只读状态当前描述“与此地址映射相关的、当前正在从NAT池使用的地址数。在这种情况下，此对象的值必须始终为零"
    },
    {
      "indent": 4,
      "text": "         of a static address map.\"\n::= { natAddrMapEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapStorageType OBJECT-TYPE\n    SYNTAX      StorageType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"The storage type for this conceptual row.\n             Conceptual rows having the value 'permanent'\n             need not allow write-access to any columnar objects\n             in the row.\"\n    REFERENCE\n            \"Textual Conventions for SMIv2, Section 2.\"\n    DEFVAL { nonVolatile }\n    ::= { natAddrMapEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrMapRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The status of this conceptual row.",
      "zh-CHS": "natAddrMapRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“此概念行的状态。"
    },
    {
      "indent": 13,
      "text": "Until instances of all corresponding columns are appropriately configured, the value of the corresponding instance of the natAddrMapRowStatus column is 'notReady'.",
      "zh-CHS": "在正确配置所有相应列的实例之前，natAddrMapRowStatus列的相应实例的值为“notReady”。"
    },
    {
      "indent": 4,
      "text": "         None of the objects in this row may be modified\n         while the value of this object is active(1).\"\nREFERENCE\n        \"Textual Conventions for SMIv2, Section 2.\"\n::= { natAddrMapEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Address Bind section --",
      "zh-CHS": "----地址绑定部分--"
    },
    {
      "indent": 0,
      "text": "natAddrBindNumberOfEntries OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object maintains a count of the number of entries\n             that currently exist in the natAddrBindTable.\"\n    ::= { natMIBObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- The NAT Address BIND Table --",
      "zh-CHS": "----NAT地址绑定表--"
    },
    {
      "indent": 0,
      "text": "natAddrBindTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatAddrBindEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"This table holds information about the currently\n             active NAT BINDs.\"\n    ::= { natMIBObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindEntry OBJECT-TYPE SYNTAX NatAddrBindEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Each entry in this table holds information about an active address BIND. These entries are lost upon agent restart.",
      "zh-CHS": "NATADDRBINDETRY对象类型语法NATADDRBINDETRY MAX-ACCESS not ACCESS not ACCESS STATUS current DESCRIPTION“此表中的每个条目都包含有关活动地址绑定的信息。这些条目在代理重新启动时丢失。"
    },
    {
      "indent": 13,
      "text": "This row has indexing which may create variables with more than 128 subidentifiers. Implementers of this table must be careful not to create entries that would result in OIDs which exceed the 128 subidentifier limit. Otherwise, the information cannot be accessed using SNMPv1, SNMPv2c or SNMPv3.\"",
      "zh-CHS": "此行具有索引，可创建具有128个以上子标识符的变量。此表的实现者必须小心，不要创建会导致OID超过128子标识符限制的条目。否则，无法使用SNMPv1、SNMPv2c或SNMPv3访问信息。”"
    },
    {
      "indent": 4,
      "text": "INDEX   { ifIndex, natAddrBindLocalAddrType, natAddrBindLocalAddr }\n::= { natAddrBindTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatAddrBindEntry ::= SEQUENCE {\n    natAddrBindLocalAddrType        InetAddressType,\n    natAddrBindLocalAddr            InetAddress,\n    natAddrBindGlobalAddrType       InetAddressType,\n    natAddrBindGlobalAddr           InetAddress,\n    natAddrBindId                   NatBindId,\n    natAddrBindTranslationEntity    NatTranslationEntity,\n    natAddrBindType                 NatAssociationType,\n    natAddrBindMapIndex             NatAddrMapId,\n    natAddrBindSessions             Gauge32,\n    natAddrBindMaxIdleTime          TimeTicks,\n    natAddrBindCurrentIdleTime      TimeTicks,\n    natAddrBindInTranslates         Counter64,\n    natAddrBindOutTranslates        Counter64\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindLocalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrBindLocalAddr.\"\n    ::= { natAddrBindEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindLocalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This object represents the private-realm specific network layer address, which maps to the public-realm address represented by natAddrBindGlobalAddr.",
      "zh-CHS": "NATADDRBINDLOCALADR对象类型语法InetAddress MAX-ACCESS not ACCESS STATUS current DESCRIPTION“此对象表示专用领域特定的网络层地址，它映射到NATADDRBINDLOBALADDR表示的公共领域地址。"
    },
    {
      "indent": 3,
      "text": "          The type of this address is determined by the value of\n          the natAddrBindLocalAddrType object.\"\n::= { natAddrBindEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindGlobalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrBindGlobalAddr.\"\n    ::= { natAddrBindEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindGlobalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the public-realm network layer address that maps to the private-realm network layer address represented by natAddrBindLocalAddr.",
      "zh-CHS": "natAddrBindGlobalAddr对象类型语法InetAddress MAX-ACCESS只读状态当前描述“此对象表示映射到natAddrBindLocalAddr表示的私有域网络层地址的公共域网络层地址。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrBindGlobalAddrType object.\"\n::= { natAddrBindEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindId OBJECT-TYPE SYNTAX NatBindId MAX-ACCESS read-only STATUS current",
      "zh-CHS": "natAddrBindId对象类型语法NatBindId MAX-ACCESS只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"This object represents a bind id that is dynamically\n         assigned to each bind by a NAT enabled device.  Each\n         bind is represented by a bind id that is\n         unique across both, the natAddrBindTable and the\n         natAddrPortBindTable.\"\n::= { natAddrBindEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindTranslationEntity OBJECT-TYPE SYNTAX NatTranslationEntity MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the direction of sessions for which this bind is applicable and the endpoint entity (source or destination) within the sessions that is subject to translation using the BIND.",
      "zh-CHS": "natAddrBindTranslationEntity对象类型语法NatTranslationEntity MAX-ACCESS只读状态当前描述“此对象表示此绑定适用的会话的方向，以及会话中要使用绑定进行转换的端点实体（源或目标）。"
    },
    {
      "indent": 13,
      "text": "Orientation of the bind can be a superset of translationEntity of the address map entry which forms the basis for this bind.",
      "zh-CHS": "绑定的方向可以是地址映射项的translationEntity的超集，地址映射项构成此绑定的基础。"
    },
    {
      "indent": 4,
      "text": "         For example, if the translationEntity of an\n         address map entry is outboundSrcEndPoint, the\n         translationEntity of a bind derived from this\n         map entry may either be outboundSrcEndPoint or\n         it may be bidirectional (a bitmask of\n         outboundSrcEndPoint and inboundDstEndPoint).\"\n::= { natAddrBindEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindType OBJECT-TYPE\n    SYNTAX     NatAssociationType\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object indicates whether the bind is static or\n             dynamic.\"\n    ::= { natAddrBindEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindMapIndex OBJECT-TYPE SYNTAX NatAddrMapId MAX-ACCESS read-only STATUS current DESCRIPTION \"This object is a pointer to the natAddrMapTable entry (and the parameters of that entry) which was used in creating this BIND. This object, in conjunction with the ifIndex (which identifies a unique addrMapName) points to",
      "zh-CHS": "natAddrBindMapIndex对象类型语法NatAddrMapId MAX-ACCESS只读状态当前描述“此对象是指向创建此绑定时使用的natAddrMapTable项（以及该项的参数）的指针。此对象与ifIndex（标识唯一的addrMapName）一起指向"
    },
    {
      "indent": 4,
      "text": "         a unique entry in the natAddrMapTable.\"\n::= { natAddrBindEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindSessions OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"Number of sessions currently using this BIND.\"\n    ::= { natAddrBindEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindMaxIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates the maximum time for which this bind can be idle with no sessions attached to it.",
      "zh-CHS": "natAddrBindMaxIdleTime对象类型语法TimeTicks MAX-ACCESS只读状态当前描述“此对象表示此绑定在未连接会话的情况下可以空闲的最长时间。"
    },
    {
      "indent": 4,
      "text": "         The value of this object is of relevance only for\n         dynamic NAT.\"\n::= { natAddrBindEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindCurrentIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"At any given instance, this object indicates the time that this bind has been idle without any sessions attached to it.",
      "zh-CHS": "natAddrBindCurrentIdleTime对象类型语法TimeTicks MAX-ACCESS只读状态当前描述“在任何给定实例上，此对象表示此绑定在未连接任何会话的情况下处于空闲状态的时间。"
    },
    {
      "indent": 4,
      "text": "         The value of this object is of relevance only for\n         dynamic NAT.\"\n::= { natAddrBindEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of inbound packets that were successfully translated by using this bind entry.",
      "zh-CHS": "NATADDRBINDINTRATES对象类型语法计数器64 MAX-ACCESS只读状态当前描述“使用此绑定条目成功转换的入站数据包数。"
    },
    {
      "indent": 13,
      "text": "Discontinuities in the value of this counter can occur at reinitialization of the management system and at other times, as indicated by the value of",
      "zh-CHS": "该计数器值的不连续性可在管理系统重新初始化时出现，也可在其他时间出现，如"
    },
    {
      "indent": 4,
      "text": "         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrBindEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrBindOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets that were successfully translated using this bind entry.",
      "zh-CHS": "natAddrBindOutTranslates对象类型语法计数器64 MAX-ACCESS只读状态当前描述“使用此绑定条目成功转换的出站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrBindEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Address Port Bind section --",
      "zh-CHS": "----地址端口绑定部分--"
    },
    {
      "indent": 0,
      "text": "natAddrPortBindNumberOfEntries OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object maintains a count of the number of entries\n             that currently exist in the natAddrPortBindTable.\"\n    ::= { natMIBObjects 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- The NAT Address Port Bind Table --",
      "zh-CHS": "----NAT地址端口绑定表--"
    },
    {
      "indent": 0,
      "text": "natAddrPortBindTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatAddrPortBindEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"This table holds information about the currently\n             active NAPT BINDs.\"\n    ::= { natMIBObjects 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindEntry OBJECT-TYPE SYNTAX NatAddrPortBindEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "zh-CHS": "natAddrPortBindEntry对象类型语法natAddrPortBindEntry MAX-ACCESS不可访问状态当前说明"
    },
    {
      "indent": 12,
      "text": "\"Each entry in the this table holds information about a NAPT bind that is currently active. These entries are lost upon agent restart.",
      "zh-CHS": "“此表中的每个条目都包含有关当前活动的NAPT绑定的信息。这些条目在代理重新启动时丢失。"
    },
    {
      "indent": 4,
      "text": "         This row has indexing which may create variables with\n         more than 128 subidentifiers.  Implementers of this table\n         must be careful not to create entries which would result\n         in OIDs that exceed the 128 subidentifier limit.\n         Otherwise, the information cannot be accessed using\n         SNMPv1, SNMPv2c or SNMPv3.\"\nINDEX   { ifIndex, natAddrPortBindLocalAddrType,\n          natAddrPortBindLocalAddr, natAddrPortBindLocalPort,\n          natAddrPortBindProtocol }\n::= { natAddrPortBindTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatAddrPortBindEntry ::= SEQUENCE {\n    natAddrPortBindLocalAddrType        InetAddressType,\n    natAddrPortBindLocalAddr            InetAddress,\n    natAddrPortBindLocalPort            InetPortNumber,\n    natAddrPortBindProtocol             NatProtocolType,\n    natAddrPortBindGlobalAddrType       InetAddressType,\n    natAddrPortBindGlobalAddr           InetAddress,\n    natAddrPortBindGlobalPort           InetPortNumber,\n    natAddrPortBindId                   NatBindId,\n    natAddrPortBindTranslationEntity    NatTranslationEntity,\n    natAddrPortBindType                 NatAssociationType,\n    natAddrPortBindMapIndex             NatAddrMapId,\n    natAddrPortBindSessions             Gauge32,\n    natAddrPortBindMaxIdleTime          TimeTicks,\n    natAddrPortBindCurrentIdleTime      TimeTicks,\n    natAddrPortBindInTranslates         Counter64,\n    natAddrPortBindOutTranslates        Counter64\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindLocalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrPortBindLocalAddr.\"\n    ::= { natAddrPortBindEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindLocalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "zh-CHS": "natAddrPortBindLocalAddr对象类型语法InetAddress MAX-ACCESS不可访问状态当前描述"
    },
    {
      "indent": 12,
      "text": "\"This object represents the private-realm specific network layer address which, in conjunction with natAddrPortBindLocalPort, maps to the public-realm network layer address and transport id represented by natAddrPortBindGlobalAddr and natAddrPortBindGlobalPort respectively.",
      "zh-CHS": "“此对象表示特定于私有领域的网络层地址，该地址与natAddrPortBindLocalPort一起映射到分别由NataddrPortBindGlobalAddress和natAddrPortBindGlobalPort表示的公共领域网络层地址和传输id。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrPortBindLocalAddrType object.\"\n::= { natAddrPortBindEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindLocalPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS not-accessible STATUS current DESCRIPTION \"For a protocol value TCP or UDP, this object represents the private-realm specific port number. On the other hand, for ICMP a bind is created only for query/response type ICMP messages such as ICMP echo, Timestamp, and Information request messages, and this object represents the private-realm specific identifier in the ICMP message, as defined in RFC 792 for ICMPv4 and in RFC 2463 for ICMPv6.",
      "zh-CHS": "natAddrPortBindLocalPort对象类型语法InetPortNumber MAX-ACCESS不可访问状态当前描述对于协议值TCP或UDP，此对象表示专用领域特定的端口号。另一方面，对于ICMP，仅为查询/响应类型的ICMP消息（如ICMP回显、时间戳和信息请求消息）创建绑定，该对象表示ICMP消息中的专用领域特定标识符，如RFC 792中针对ICMPv4的定义和RFC 2463中针对ICMPv6的定义。"
    },
    {
      "indent": 3,
      "text": "          This object, together with natAddrPortBindProtocol,\n          natAddrPortBindLocalAddrType, and natAddrPortBindLocalAddr,\n          constitutes a session endpoint in the private realm.  A\n          bind entry binds a private realm specific endpoint to a\n          public realm specific endpoint, as represented by the\n          tuple of (natAddrPortBindGlobalPort,\n          natAddrPortBindProtocol, natAddrPortBindGlobalAddrType,\n          and natAddrPortBindGlobalAddr).\"\n::= { natAddrPortBindEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindProtocol OBJECT-TYPE\n    SYNTAX      NatProtocolType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies a protocol identifier.  If the\n             value of this object is none(1), then this bind entry\n             applies to all IP traffic.  Any other value of this object\n             specifies the class of IP traffic to which this BIND\n             applies.\"\n    ::= { natAddrPortBindEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindGlobalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrPortBindGlobalAddr.\"\n    ::= { natAddrPortBindEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindGlobalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the public-realm specific network layer address that, in conjunction with natAddrPortBindGlobalPort, maps to the private-realm",
      "zh-CHS": "NataddrPortBindGlobalAddress对象类型语法InetAddress MAX-ACCESS只读状态当前描述“此对象表示特定于公共领域的网络层地址，该地址与natAddrPortBindGlobalPort一起映射到私有领域"
    },
    {
      "indent": 13,
      "text": "network layer address and transport id represented by natAddrPortBindLocalAddr and natAddrPortBindLocalPort, respectively.",
      "zh-CHS": "网络层地址和传输id分别由natAddrPortBindLocalAddr和natAddrPortBindLocalPort表示。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrPortBindGlobalAddrType object.\"\n::= { natAddrPortBindEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindGlobalPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current DESCRIPTION \"For a protocol value TCP or UDP, this object represents the public-realm specific port number. On the other hand, for ICMP a bind is created only for query/response type ICMP messages such as ICMP echo, Timestamp, and Information request messages, and this object represents the public-realm specific identifier in the ICMP message, as defined in RFC 792 for ICMPv4 and in RFC 2463 for ICMPv6.",
      "zh-CHS": "natAddrPortBindGlobalPort对象类型语法InetPortNumber MAX-ACCESS只读状态当前说明对于协议值TCP或UDP，此对象表示特定于公共领域的端口号。另一方面，对于ICMP，仅为查询/响应类型ICMP消息（如ICMP回显、时间戳和信息请求消息）创建绑定，并且此对象表示ICMP消息中的公共领域特定标识符，如RFC 792中针对ICMPv4的定义和RFC 2463中针对ICMPv6的定义。"
    },
    {
      "indent": 13,
      "text": "This object, together with natAddrPortBindProtocol, natAddrPortBindGlobalAddrType, and natAddrPortBindGlobalAddr, constitutes a session endpoint in the public realm. A bind entry binds a public realm specific endpoint to a private realm specific endpoint, as represented by the tuple of (natAddrPortBindLocalPort, natAddrPortBindProtocol, natAddrPortBindLocalAddrType, and",
      "zh-CHS": "此对象与natAddrPortBindProtocol、NataddrPortBindGlobalAddType和natAddrPortBindGlobalAddr一起构成公共领域中的会话端点。绑定条目将特定于公共领域的终结点绑定到特定于私有领域的终结点，如（natAddrPortBindLocalPort、natAddrPortBindProtocol、natAddrPortBindLocalAddrType和）的元组所示"
    },
    {
      "indent": 4,
      "text": "           natAddrPortBindLocalAddr).\"\n::= { natAddrPortBindEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindId OBJECT-TYPE\n    SYNTAX     NatBindId\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object represents a bind id that is dynamically\n             assigned to each bind by a NAT enabled device.  Each\n             bind is represented by a unique bind id across both\n             the natAddrBindTable and the natAddrPortBindTable.\"\n    ::= { natAddrPortBindEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindTranslationEntity OBJECT-TYPE SYNTAX NatTranslationEntity MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the direction of sessions for which this bind is applicable and the entity (source or destination) within the sessions that is subject to translation with the BIND.",
      "zh-CHS": "natAddrPortBindTranslationEntity对象类型语法NatTranslationEntity MAX-ACCESS只读状态当前描述“此对象表示此绑定适用的会话的方向以及会话中受绑定转换的实体（源或目标）。"
    },
    {
      "indent": 13,
      "text": "Orientation of the bind can be a superset of the translationEntity of the address map entry that forms the basis for this bind.",
      "zh-CHS": "绑定的方向可以是构成此绑定基础的地址映射项translationEntity的超集。"
    },
    {
      "indent": 4,
      "text": "         For example, if the translationEntity of an\n         address map entry is outboundSrcEndPoint, the\n         translationEntity of a bind derived from this\n         map entry may either be outboundSrcEndPoint or\n         may be bidirectional (a bitmask of\n         outboundSrcEndPoint and inboundDstEndPoint).\"\n::= { natAddrPortBindEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindType OBJECT-TYPE\n    SYNTAX     NatAssociationType\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object indicates whether the bind is static or\n             dynamic.\"\n    ::= { natAddrPortBindEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindMapIndex OBJECT-TYPE SYNTAX NatAddrMapId MAX-ACCESS read-only",
      "zh-CHS": "natAddrPortBindMapIndex对象类型语法NatAddrMapId MAX-ACCESS只读"
    },
    {
      "indent": 4,
      "text": "STATUS     current\nDESCRIPTION\n        \"This object is a pointer to the natAddrMapTable entry\n         (and the parameters of that entry) used in\n         creating this BIND.  This object, in conjunction with the\n         ifIndex (which identifies a unique addrMapName), points\n         to a unique entry in the natAddrMapTable.\"\n::= { natAddrPortBindEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindSessions OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"Number of sessions currently using this BIND.\"\n    ::= { natAddrPortBindEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindMaxIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current",
      "zh-CHS": "natAddrPortBindMaxIdleTime对象类型语法TimeTicks MAX-ACCESS只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"This object indicates the maximum time for\n         which this bind can be idle without any sessions\n         attached to it.\n         The value of this object is of relevance\n         only for dynamic NAT.\"\n::= { natAddrPortBindEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindCurrentIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"At any given instance, this object indicates the time that this bind has been idle without any sessions attached to it.",
      "zh-CHS": "natAddrPortBindCurrentIdleTime对象类型语法TimeTicks MAX-ACCESS只读状态当前描述“在任何给定实例上，此对象表示此绑定在未连接任何会话的情况下处于空闲状态的时间。"
    },
    {
      "indent": 4,
      "text": "         The value of this object is of relevance\n         only for dynamic NAT.\"\n::= { natAddrPortBindEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "natAddrPortBindInTranslates对象类型语法计数器64 MAX-ACCESS只读状态当前说明"
    },
    {
      "indent": 12,
      "text": "\"The number of inbound packets that were translated as per this bind entry.",
      "zh-CHS": "“根据此绑定条目翻译的入站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrPortBindEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natAddrPortBindOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets that were translated as per this bind entry.",
      "zh-CHS": "NataddrPortBindOutTranslations对象类型语法计数器64 MAX-ACCESS只读状态当前描述“根据此绑定条目翻译的出站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrPortBindEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- The Session Table --",
      "zh-CHS": "----会议桌--"
    },
    {
      "indent": 0,
      "text": "natSessionTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatSessionEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"The (conceptual) table containing one entry for each\n             NAT session currently active on this NAT device.\"\n    ::= { natMIBObjects 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionEntry OBJECT-TYPE\n    SYNTAX     NatSessionEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"An entry (conceptual row) containing information\n             about an active NAT session on this NAT device.\n             These entries are lost upon agent restart.\"\n    INDEX   { ifIndex, natSessionIndex }\n    ::= { natSessionTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatSessionEntry ::= SEQUENCE {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": " natSessionIndex NatSessionId, natSessionPrivateSrcEPBindId NatBindIdOrZero, natSessionPrivateSrcEPBindMode NatBindMode, natSessionPrivateDstEPBindId NatBindIdOrZero, natSessionPrivateDstEPBindMode NatBindMode, natSessionDirection INTEGER, natSessionUpTime TimeTicks, natSessionAddrMapIndex NatAddrMapId, natSessionProtocolType NatProtocolType, natSessionPrivateAddrType InetAddressType, natSessionPrivateSrcAddr InetAddress, natSessionPrivateSrcPort InetPortNumber, natSessionPrivateDstAddr InetAddress, natSessionPrivateDstPort InetPortNumber, natSessionPublicAddrType InetAddressType, natSessionPublicSrcAddr InetAddress, natSessionPublicSrcPort InetPortNumber, natSessionPublicDstAddr InetAddress, natSessionPublicDstPort InetPortNumber, natSessionMaxIdleTime TimeTicks, natSessionCurrentIdleTime TimeTicks, natSessionInTranslates Counter64, natSessionOutTranslates Counter64 }",
      "zh-CHS": "natSessionIndex NatSessionId、NatSessionPrivateScepBindId NatBindOrzero、NatSessionPrivateScepBindMode NatBindMode、NatSessionPrivateScepBindId NatBindOrzero、NatSessionPrivateScepBindMode NatBindMode、NatSessionPrivateScedStepBindMode NatBindMode、natSessionDirection INTEGER、NatSessionOptime时间刻度、NatSessionAddressMapIndex NatAddrMapId、natSessionProtocolType，natSessionPrivateAddrType InetAddressType、NatSessionPrivateScAddr InetAddress、NatSessionPrivateScPort InetPortNumber、NatSessionPrivateStaddr InetAddress、natSessionPublicAddrType InetAddressType、natSessionPublicSrcAddr InetAddress、natSessionPublicSrcPort InetPortNumber、，NatSessionPublicdStatdr InetAddress、NatSessionPublicdStatport InetPortNumber、natSessionMaxIdleTime时间标记、natSessionCurrentIdleTime时间标记、natSessionInTranslates计数器64、natSessionOutTranslates计数器64}"
    },
    {
      "indent": 0,
      "text": "natSessionIndex OBJECT-TYPE\n    SYNTAX     NatSessionId\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"The session ID for this NAT session.\"\n    ::= { natSessionEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcEPBindId OBJECT-TYPE\n    SYNTAX     NatBindIdOrZero\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The bind id associated between private and public\n             source end points.  In the case of Symmetric-NAT,\n             this should be set to zero.\"\n    ::= { natSessionEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcEPBindMode OBJECT-TYPE SYNTAX NatBindMode MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "NatSessionPrivateScepBindMode对象类型语法NatBindMode MAX-ACCESS只读状态当前说明"
    },
    {
      "indent": 4,
      "text": "        \"This object indicates whether the bind indicated\n         by the object natSessionPrivateSrcEPBindId\n         is an address bind or an address port bind.\"\n::= { natSessionEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstEPBindId OBJECT-TYPE\n    SYNTAX     NatBindIdOrZero\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The bind id associated between private and public\n             destination end points.\"\n    ::= { natSessionEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstEPBindMode OBJECT-TYPE\n    SYNTAX     NatBindMode\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object indicates whether the bind indicated\n             by the object natSessionPrivateDstEPBindId\n             is an address bind or an address port bind.\"\n    ::= { natSessionEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionDirection OBJECT-TYPE\n    SYNTAX     INTEGER {\n                   inbound (1),\n                   outbound (2)\n               }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS read-only\nSTATUS     current\nDESCRIPTION\n        \"The direction of this session with respect to the\n         local network.  'inbound' indicates that this session\n         was initiated from the public network into the private\n         network.  'outbound' indicates that this session was\n         initiated from the private network into the public\n         network.\"\n::= { natSessionEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionUpTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"The up time of this session in one-hundredths of a second.\"",
      "zh-CHS": "NatSessionOptime对象类型语法TimeTicks MAX-ACCESS只读状态当前描述“此会话的启动时间为百分之一秒。”"
    },
    {
      "indent": 4,
      "text": "::= { natSessionEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionAddrMapIndex OBJECT-TYPE\n    SYNTAX     NatAddrMapId\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object is a pointer to the natAddrMapTable entry\n             (and the parameters of that entry) used in\n             creating this session.  This object, in conjunction with\n             the ifIndex (which identifies a unique addrMapName), points\n             to a unique entry in the natAddrMapTable.\"\n    ::= { natSessionEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionProtocolType OBJECT-TYPE\n    SYNTAX     NatProtocolType\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The protocol type of this session.\"\n    ::= { natSessionEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natSessionPrivateSrcAddr and natSessionPrivateDstAddr.\"\n    ::= { natSessionEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The source IP address of the session endpoint that lies in the private network.",
      "zh-CHS": "NatSessionPrivateScAddr对象类型语法InetAddress MAX-ACCESS只读状态当前描述“位于专用网络中的会话终结点的源IP地址。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero only when the natSessionPrivateSrcEPBindId object has a zero value. When the value of this object is zero, the NAT session lookup will match any IP address to this field.",
      "zh-CHS": "仅当NatSessionPrivateScepBindId对象的值为零时，此对象的值才必须为零。当此对象的值为零时，NAT会话查找将匹配此字段的任何IP地址。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPrivateAddrType object.\"\n::= { natSessionEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current DESCRIPTION \"When the value of protocol is TCP or UDP, this object represents the source port in the first packet of session while in private-realm. On the other hand, when the protocol is ICMP, a NAT session is created only for query/response type ICMP messages such as ICMP echo, Timestamp, and Information request messages, and this object represents the private-realm specific identifier in the ICMP message, as defined in RFC 792 for ICMPv4 and in RFC 2463 for ICMPv6.",
      "zh-CHS": "natSessionPrivateSrcPort对象类型语法InetPortNumber MAX-ACCESS只读状态当前说明“当协议的值为TCP或UDP时，此对象表示在私有领域中会话的第一个数据包中的源端口。另一方面，当协议为ICMP时，仅为查询/响应类型ICMP消息（如ICMP回显、时间戳和信息请求消息）创建NAT会话，该对象表示ICMP消息中的专用领域特定标识符，如RFC 792中针对ICMPv4的定义和RFC 2463中针对ICMPv6的定义。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the natSessionPrivateSrcEPBindId object has zero value and value of natSessionPrivateSrcEPBindMode is addressPortBind(2). In such a case, the NAT session lookup will match any port number to this field.",
      "zh-CHS": "当NatSessionPrivateScepBindId对象具有零值且NatSessionPrivateScepBindMode的值为addressPortBind（2）时，此对象的值必须为零。在这种情况下，NAT会话查找会将任何端口号匹配到此字段。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort, or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The destination IP address of the session endpoint that lies in the private network.",
      "zh-CHS": "natSessionPrivateDstAddr对象类型语法InetAddress MAX-ACCESS只读状态当前描述“位于专用网络中的会话端点的目标IP地址。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the natSessionPrivateDstEPBindId object has a zero value. In such a scenario, the NAT session lookup will match any IP address to this field.",
      "zh-CHS": "当natSessionPrivateDstEPBindId对象的值为零时，此对象的值必须为零。在这种情况下，NAT会话查找会将任何IP地址匹配到此字段。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPrivateAddrType object.\"\n::= { natSessionEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current",
      "zh-CHS": "NatSessionPrivatedSport对象类型语法InetPortNumber MAX-ACCESS只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"When the value of protocol is TCP or UDP, this object represents the destination port in the first packet of session while in private-realm. On the other hand, when the protocol is ICMP, this object is not relevant and should be set to zero.",
      "zh-CHS": "DESCRIPTION“当协议的值为TCP或UDP时，此对象表示在私有领域中会话的第一个数据包中的目标端口。另一方面，当协议为ICMP时，此对象不相关，应设置为零。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the natSessionPrivateDstEPBindId object has a zero value and natSessionPrivateDstEPBindMode is set to addressPortBind(2). In such a case, the NAT session lookup will match any port number to this field.",
      "zh-CHS": "当natSessionPrivateDstEPBindId对象具有零值且natSessionPrivateDstEPBindMode设置为addressPortBind（2）时，此对象的值必须为零。在这种情况下，NAT会话查找会将任何端口号匹配到此字段。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort, or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPublicAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natSessionPublicSrcAddr and natSessionPublicDstAddr.\"\n    ::= { natSessionEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPublicSrcAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The source IP address of the session endpoint that lies in the public network.",
      "zh-CHS": "natSessionPublicSrcAddr对象类型语法InetAddress MAX-ACCESS只读状态当前描述“位于公共网络中的会话终结点的源IP地址。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the natSessionPrivateSrcEPBindId object has a zero value. In such a scenario, the NAT session lookup will match any IP address to this field.",
      "zh-CHS": "当NatSessionPrivateScepBindId对象的值为零时，此对象的值必须为零。在这种情况下，NAT会话查找会将任何IP地址匹配到此字段。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPublicAddrType object.\"\n::= { natSessionEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPublicSrcPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only",
      "zh-CHS": "natSessionPublicSrcPort对象类型语法InetPortNumber MAX-ACCESS只读"
    },
    {
      "indent": 4,
      "text": "STATUS current DESCRIPTION \"When the value of protocol is TCP or UDP, this object represents the source port in the first packet of session while in public-realm. On the other hand, when protocol is ICMP, a NAT session is created only for query/response type ICMP messages such as ICMP echo, Timestamp, and Information request messages, and this object represents the public-realm specific identifier in the ICMP message, as defined in RFC 792 for ICMPv4 and in RFC 2463 for ICMPv6.",
      "zh-CHS": "状态当前描述“当协议的值为TCP或UDP时，此对象表示在公共域中会话的第一个数据包中的源端口。另一方面，当协议为ICMP时，仅为查询/响应类型ICMP消息（如ICMP回显、时间戳和信息请求消息）创建NAT会话，该对象表示ICMP消息中的公共领域特定标识符，如RFC 792中针对ICMPv4的定义和RFC 2463中针对ICMPv6的定义。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the natSessionPrivateSrcEPBindId object has a zero value and natSessionPrivateSrcEPBindMode is set to addressPortBind(2). In such a scenario, the NAT session lookup will match any port number to this field.",
      "zh-CHS": "当NatSessionPrivateScepBindId对象具有零值且NatSessionPrivateScepBindMode设置为addressPortBind（2）时，此对象的值必须为零。在这种情况下，NAT会话查找会将任何端口号匹配到此字段。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPublicDstAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The destination IP address of the session endpoint that lies in the public network.",
      "zh-CHS": "natSessionPublicDstAddr对象类型语法InetAddress MAX-ACCESS只读状态当前描述“位于公共网络中的会话终结点的目标IP地址。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be non-zero when the natSessionPrivateDstEPBindId object has a non-zero value. If the value of this object and the corresponding natSessionPrivateDstEPBindId object value is zero, then the NAT session lookup will match any IP address to this field.",
      "zh-CHS": "当natSessionPrivateDstEPBindId对象具有非零值时，此对象的值必须为非零。如果此对象的值和相应的natSessionPrivateDstEPBindId对象值为零，则NAT会话查找将使任何IP地址与此字段匹配。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPublicAddrType object.\"\n::= { natSessionEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionPublicDstPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current",
      "zh-CHS": "NatSessionPublicdSport对象类型语法InetPortNumber MAX-ACCESS只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"When the value of protocol is TCP or UDP, this object represents the destination port in the first packet of session while in public-realm. On the other hand, when the protocol is ICMP, this object is not relevant for translation and should be zero.",
      "zh-CHS": "DESCRIPTION“当协议的值为TCP或UDP时，此对象表示在公共域中会话的第一个数据包中的目标端口。另一方面，当协议为ICMP时，此对象与转换无关，应为零。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the natSessionPrivateDstEPBindId object has a zero value and natSessionPrivateDstEPBindMode is addressPortBind(2). In such a scenario, the NAT session lookup will match any port number to this field.",
      "zh-CHS": "当natSessionPrivateDstEPBindId对象具有零值且natSessionPrivateDstEPBindMode为addressPortBind（2）时，此对象的值必须为零。在这种情况下，NAT会话查找会将任何端口号匹配到此字段。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort, or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionMaxIdleTime OBJECT-TYPE\n    SYNTAX     TimeTicks\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The max time for which this session can be idle\n             without detecting a packet.\"\n    ::= { natSessionEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionCurrentIdleTime OBJECT-TYPE\n    SYNTAX     TimeTicks\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The time since a packet belonging to this session was\n            last detected.\"\n    ::= { natSessionEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of inbound packets that were translated for this session.",
      "zh-CHS": "natSessionInTranslates对象类型语法计数器64 MAX-ACCESS只读状态当前描述“为此会话翻译的入站数据包数。"
    },
    {
      "indent": 13,
      "text": "Discontinuities in the value of this counter can occur at reinitialization of the management system and at other",
      "zh-CHS": "在管理系统重新初始化时以及在其他情况下，可能会出现此计数器值的不连续性"
    },
    {
      "indent": 4,
      "text": "         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natSessionEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natSessionOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets that were translated for this session.",
      "zh-CHS": "natSessionOutTranslates对象类型语法计数器64 MAX-ACCESS只读状态当前描述“为此会话翻译的出站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natSessionEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- The Protocol table --",
      "zh-CHS": "----协议表--"
    },
    {
      "indent": 0,
      "text": "natProtocolTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatProtocolEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"The (conceptual) table containing per protocol NAT\n             statistics.\"\n    ::= { natMIBObjects 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natProtocolEntry OBJECT-TYPE\n    SYNTAX     NatProtocolEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"An entry (conceptual row) containing NAT statistics\n             pertaining to a particular protocol.\"\n    INDEX   { natProtocol }\n    ::= { natProtocolTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "NatProtocolEntry ::= SEQUENCE {\n    natProtocol                 NatProtocolType,\n    natProtocolInTranslates     Counter64,\n    natProtocolOutTranslates    Counter64,\n    natProtocolDiscards         Counter64\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natProtocol    OBJECT-TYPE\n    SYNTAX     NatProtocolType\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"This object represents the protocol pertaining to which\n             parameters are reported.\"\n    ::= { natProtocolEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natProtocolInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of inbound packets pertaining to the protocol identified by natProtocol that underwent NAT.",
      "zh-CHS": "natProtocolInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS只读状态current DESCRIPTION“与经过NAT的NAT协议标识的协议相关的入站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natProtocolEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natProtocolOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets pertaining to the protocol identified by natProtocol that underwent NAT.",
      "zh-CHS": "natProtocolOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS只读状态current DESCRIPTION“与经过NAT的NAT协议标识的协议相关的出站数据包数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natProtocolEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natProtocolDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of packets pertaining to the protocol identified by natProtocol that had to be rejected/dropped due to lack of resources. These rejections could be due to session timeout, resource unavailability, lack of address space, etc.",
      "zh-CHS": "natProtocolDiscards对象类型语法计数器64 MAX-ACCESS只读状态当前描述“与natProtocol标识的协议相关的、由于资源不足而必须拒绝/丢弃的数据包数。这些拒绝可能是由于会话超时、资源不可用、地址空间不足等原因。"
    },
    {
      "indent": 5,
      "text": "        Discontinuities in the value of this counter can occur at\n        reinitialization of the management system and at other\n        times, as indicated by the value of\n        ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natProtocolEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Notifications section --",
      "zh-CHS": "----通知组--"
    },
    {
      "indent": 0,
      "text": "natMIBNotifications OBJECT IDENTIFIER ::= { natMIB 0 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Notifications --",
      "zh-CHS": "----通知--"
    },
    {
      "indent": 0,
      "text": "natPacketDiscard NOTIFICATION-TYPE OBJECTS { ifIndex } STATUS current DESCRIPTION \"This notification is generated when IP packets are discarded by the NAT function; e.g., due to lack of mapping space when NAT is out of addresses or ports.",
      "zh-CHS": "NatpackeDiscard NOTIFICATION-TYPE对象{ifIndex}状态当前描述“当NAT函数丢弃IP数据包时，会生成此通知；例如，当NAT没有地址或端口时，由于缺少映射空间。"
    },
    {
      "indent": 4,
      "text": "         Note that the generation of natPacketDiscard\n         notifications is throttled by the agent, as specified\n         by the 'natNotifThrottlingInterval' object.\"\n::= { natMIBNotifications 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Conformance information. --",
      "zh-CHS": "----一致性信息--"
    },
    {
      "indent": 0,
      "text": "natMIBConformance OBJECT IDENTIFIER ::= { natMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natMIBGroups      OBJECT IDENTIFIER ::= { natMIBConformance 1 }\nnatMIBCompliances OBJECT IDENTIFIER ::= { natMIBConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Units of conformance --",
      "zh-CHS": "----一致性单位--"
    },
    {
      "indent": 0,
      "text": "natConfigGroup OBJECT-GROUP OBJECTS { natInterfaceRealm, natInterfaceServiceType, natInterfaceStorageType, natInterfaceRowStatus, natAddrMapName,",
      "zh-CHS": "natConfigGroup对象组对象{natInterfaceRealm，natInterfaceServiceType，natInterfaceStorageType，natInterfaceRowStatus，natAddrMapName，"
    },
    {
      "indent": 4,
      "text": "          natAddrMapEntryType,\n          natAddrMapTranslationEntity,\n          natAddrMapLocalAddrType,\n          natAddrMapLocalAddrFrom,\n          natAddrMapLocalAddrTo,\n          natAddrMapLocalPortFrom,\n          natAddrMapLocalPortTo,\n          natAddrMapGlobalAddrType,\n          natAddrMapGlobalAddrFrom,\n          natAddrMapGlobalAddrTo,\n          natAddrMapGlobalPortFrom,\n          natAddrMapGlobalPortTo,\n          natAddrMapProtocol,\n          natAddrMapStorageType,\n          natAddrMapRowStatus,\n          natBindDefIdleTimeout,\n          natUdpDefIdleTimeout,\n          natIcmpDefIdleTimeout,\n          natOtherDefIdleTimeout,\n          natTcpDefIdleTimeout,\n          natTcpDefNegTimeout,\n          natNotifThrottlingInterval }\nSTATUS  current\nDESCRIPTION\n        \"A collection of configuration-related information\n         required to support management of devices supporting\n         NAT.\"\n::= { natMIBGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natTranslationGroup OBJECT-GROUP OBJECTS { natAddrBindNumberOfEntries, natAddrBindGlobalAddrType, natAddrBindGlobalAddr, natAddrBindId, natAddrBindTranslationEntity, natAddrBindType, natAddrBindMapIndex, natAddrBindSessions, natAddrBindMaxIdleTime, natAddrBindCurrentIdleTime, natAddrBindInTranslates, natAddrBindOutTranslates, natAddrPortBindNumberOfEntries, natAddrPortBindGlobalAddrType, natAddrPortBindGlobalAddr, natAddrPortBindGlobalPort, natAddrPortBindId, natAddrPortBindTranslationEntity,",
      "zh-CHS": "natTranslationGroup OBJECT-GROUP OBJECTS { natAddrBindNumberOfEntries, natAddrBindGlobalAddrType, natAddrBindGlobalAddr, natAddrBindId, natAddrBindTranslationEntity, natAddrBindType, natAddrBindMapIndex, natAddrBindSessions, natAddrBindMaxIdleTime, natAddrBindCurrentIdleTime, natAddrBindInTranslates, natAddrBindOutTranslates, natAddrPortBindNumberOfEntries, natAddrPortBindGlobalAddrType, natAddrPortBindGlobalAddr, natAddrPortBindGlobalPort, natAddrPortBindId, natAddrPortBindTranslationEntity,translate error, please retry"
    },
    {
      "indent": 4,
      "text": " natAddrPortBindType, natAddrPortBindMapIndex, natAddrPortBindSessions, natAddrPortBindMaxIdleTime, natAddrPortBindCurrentIdleTime, natAddrPortBindInTranslates, natAddrPortBindOutTranslates, natSessionPrivateSrcEPBindId, natSessionPrivateSrcEPBindMode, natSessionPrivateDstEPBindId, natSessionPrivateDstEPBindMode, natSessionDirection, natSessionUpTime, natSessionAddrMapIndex, natSessionProtocolType, natSessionPrivateAddrType, natSessionPrivateSrcAddr, natSessionPrivateSrcPort, natSessionPrivateDstAddr, natSessionPrivateDstPort, natSessionPublicAddrType, natSessionPublicSrcAddr, natSessionPublicSrcPort, natSessionPublicDstAddr, natSessionPublicDstPort, natSessionMaxIdleTime, natSessionCurrentIdleTime, natSessionInTranslates, natSessionOutTranslates } STATUS current",
      "zh-CHS": "natAddrPortBindType、natAddrPortBindMapIndex、natAddrPortBindSessions、natAddrPortBindMaxIdleTime、natAddrPortBindCurrentIdleTime、natAddrPortBindInTranslates、NataddrPortBindOutTranslations、NatSessionPrivateScePbindId、natSessionPrivateDstEPBindMode、natSessionDirection、，NatSessionOptime、NatSessionAddressMapIndex、natSessionProtocolType、natSessionPrivateAddrType、NatSessionPrivateScAddr、NatSessionPrivateScPort、NatSessionPrivateStaddr、NatSessionPrivateSPort、NatSessionPubliceScAddr、natSessionPublicSrcPort、NatSessionMaxidTime、，NatSessionCurrentDLTime，natSessionInTranslates，natSessionOutTranslates}当前状态"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"A collection of BIND-related objects required to support\n         management of devices supporting NAT.\"\n::= { natMIBGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natStatsInterfaceGroup OBJECT-GROUP\n    OBJECTS { natInterfaceInTranslates,\n              natInterfaceOutTranslates,\n              natInterfaceDiscards }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of NAT statistics associated with the\n             interface on which NAT is configured, to aid\n             troubleshooting/monitoring of the NAT operation.\"\n    ::= { natMIBGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natStatsProtocolGroup OBJECT-GROUP",
      "zh-CHS": "natStatsProtocolGroup对象组"
    },
    {
      "indent": 4,
      "text": "OBJECTS { natProtocolInTranslates,\n          natProtocolOutTranslates,\n          natProtocolDiscards }\nSTATUS  current\nDESCRIPTION\n        \"A collection of protocol specific NAT statistics,\n         to aid troubleshooting/monitoring of NAT operation.\"\n::= { natMIBGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natStatsAddrMapGroup OBJECT-GROUP\n    OBJECTS { natAddrMapInTranslates,\n              natAddrMapOutTranslates,\n              natAddrMapDiscards,\n              natAddrMapAddrUsed }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of address map specific NAT statistics,\n             to aid troubleshooting/monitoring of NAT operation.\"\n    ::= { natMIBGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natMIBNotificationGroup NOTIFICATION-GROUP\n    NOTIFICATIONS { natPacketDiscard }\n    STATUS        current\n    DESCRIPTION\n            \"A collection of notifications generated by\n            devices supporting this MIB.\"\n    ::= { natMIBGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Compliance statements --",
      "zh-CHS": "----合规声明--"
    },
    {
      "indent": 0,
      "text": "natMIBFullCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"When this MIB is implemented with support for read-create, then such an implementation can claim full compliance. Such devices can then be both monitored and configured with this MIB.",
      "zh-CHS": "natMIBFullCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION“当此MIB在支持读创建的情况下实现时，这样的实现可以声明完全符合要求。然后可以使用此MIB监视和配置此类设备。"
    },
    {
      "indent": 13,
      "text": "The following index objects cannot be added as OBJECT\nclauses but nevertheless have the compliance\nrequirements:\n    \"\n-- OBJECT  natAddrBindLocalAddrType\n-- SYNTAX  InetAddressType { ipv4(1), ipv6(2) }\n-- DESCRIPTION\n--         \"An implementation is required to support",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "-- OBJECT  natAddrBindLocalAddr\n-- SYNTAX  InetAddress (SIZE(4|16))\n-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "-- OBJECT  natAddrPortBindLocalAddrType\n-- SYNTAX  InetAddressType { ipv4(1), ipv6(2) }\n-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "-- OBJECT  natAddrPortBindLocalAddr\n-- SYNTAX  InetAddress (SIZE(4|16))\n-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "MODULE IF-MIB -- The interfaces MIB, RFC2863\n  MANDATORY-GROUPS {\n    ifCounterDiscontinuityGroup\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "MODULE -- this module MANDATORY-GROUPS { natConfigGroup, natTranslationGroup, natStatsInterfaceGroup }",
      "zh-CHS": "MODULE--此模块是必需的组{natConfigGroup，natTranslationGroup，NatStatintInterfaceGroup}"
    },
    {
      "indent": 6,
      "text": "GROUP natStatsProtocolGroup DESCRIPTION \"This group is optional.\" GROUP natStatsAddrMapGroup DESCRIPTION \"This group is optional.\" GROUP natMIBNotificationGroup DESCRIPTION \"This group is optional.\"",
      "zh-CHS": "组natStatsProtocolGroup DESCRIPTION“此组是可选的。”组NatStatsAddressMapGroup DESCRIPTION“此组是可选的。”组natMIBNotificationGroup DESCRIPTION“此组是可选的。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support",
      "zh-CHS": "对象NataddrMapLocalAddressType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于其支持程度"
    },
    {
      "indent": 15,
      "text": "for IPv4 and IPv6.\"",
      "zh-CHS": "用于IPv4和IPv6。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrFrom SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrMaplocalAddressFrom语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrTo SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natAddrMapLocalAddrTo语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NATADDRMAPGLOBALADDRYPE语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrFrom SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natAddrMapGlobalAddrFrom语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrTo SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natAddrMapGlobalAddrTo语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrBindGlobalAddressType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4",
      "zh-CHS": "对象NataddrBindGlobalAddress语法InetAddress（大小（4 | 16））说明“支持全局IPv4需要一个实现"
    },
    {
      "indent": 15,
      "text": "and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "和/或IPv6地址，具体取决于其对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrPortBindGlobalAddressType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrPortBindGlobalAddress语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPrivateAddrType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateSrcAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NatSessionPrivateScAddr语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPrivateDstAddr语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPublicAddrType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicSrcAddr SYNTAX InetAddress (SIZE(4|16))",
      "zh-CHS": "对象natSessionPublicSrcAddr语法InetAddress（大小（4 | 16））"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "描述“需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPublicDstAddr语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 4,
      "text": "::= { natMIBCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "natMIBReadOnlyCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"When this MIB is implemented without support for read-create (i.e., in read-only mode), then such an implementation can claim read-only compliance. Such a device can then be monitored but cannot be configured with this MIB.",
      "zh-CHS": "natMIBReadOnlyCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION“当此MIB在不支持读创建的情况下实现时（即，在只读模式下），则此类实现可以声明只读符合性。这样的设备可以进行监视，但不能使用此MIB进行配置。"
    },
    {
      "indent": 13,
      "text": "The following index objects cannot be added as OBJECT\nclauses but nevertheless have the compliance\nrequirements:\n\"\n-- OBJECT  natAddrBindLocalAddrType\n-- SYNTAX  InetAddressType { ipv4(1), ipv6(2) }\n-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "-- OBJECT  natAddrBindLocalAddr\n-- SYNTAX  InetAddress (SIZE(4|16))",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "-- OBJECT  natAddrPortBindLocalAddrType\n-- SYNTAX  InetAddressType { ipv4(1), ipv6(2) }\n-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "-- OBJECT  natAddrPortBindLocalAddr\n-- SYNTAX  InetAddress (SIZE(4|16))\n-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "MODULE IF-MIB -- The interfaces MIB, RFC2863\n  MANDATORY-GROUPS {\n    ifCounterDiscontinuityGroup\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "MODULE -- this module MANDATORY-GROUPS { natConfigGroup, natTranslationGroup, natStatsInterfaceGroup }",
      "zh-CHS": "MODULE--此模块是必需的组{natConfigGroup，natTranslationGroup，NatStatintInterfaceGroup}"
    },
    {
      "indent": 6,
      "text": "GROUP natStatsProtocolGroup DESCRIPTION \"This group is optional.\" GROUP natStatsAddrMapGroup DESCRIPTION \"This group is optional.\" GROUP natMIBNotificationGroup DESCRIPTION \"This group is optional.\" OBJECT natInterfaceRowStatus SYNTAX RowStatus { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required, and active is the only status that needs to be supported.\"",
      "zh-CHS": "组natStatsProtocolGroup DESCRIPTION“此组是可选的。”组NatStatsAddressMapGroup DESCRIPTION“此组是可选的。”组natMIBNotificationGroup DESCRIPTION“此组是可选的。”对象natInterfaceRowStatus语法RowStatus{active（1）}MIN-ACCESS只读说明不需要写访问权限，active是唯一需要支持的状态"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrMapLocalAddressType语法InetAddressType{ipv4（1），ipv6（2）}MIN-ACCESS只读说明“不需要写访问。需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrFrom SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrMaplocalAddressFrom语法InetAddress（大小（4 | 16））MIN-ACCESS只读说明“不需要写访问。需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrTo SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natAddrMapLocalAddrTo语法InetAddress（大小（4 | 16））MIN-ACCESS只读说明“不需要写访问。需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NATADDRMAPGLOBALADDRYPE语法InetAddressType{ipv4（1），ipv6（2）}MIN-ACCESS只读说明“不需要写访问。需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrFrom SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natAddrMapGlobalAddrFrom语法InetAddress（大小（4 | 16））MIN-ACCESS只读说明“不需要写访问。需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrTo SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natAddrMapGlobalAddrTo语法InetAddress（大小（4 | 16））MIN-ACCESS只读说明“不需要写访问。需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapRowStatus SYNTAX RowStatus { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required, and active is the only status that needs to be supported.\"",
      "zh-CHS": "对象natAddrMapRowStatus语法RowStatus{active（1）}MIN-ACCESS只读说明“不需要写访问，并且active是需要支持的唯一状态。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrBindGlobalAddressType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddr SYNTAX InetAddress (SIZE(4|16))",
      "zh-CHS": "对象NataddrBindGlobalAddress语法InetAddress（大小（4 | 16））"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "描述“需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrPortBindGlobalAddressType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NataddrPortBindGlobalAddress语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，具体取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPrivateAddrType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateSrcAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象NatSessionPrivateScAddr语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPrivateDstAddr语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPublicAddrType语法InetAddressType{ipv4（1），ipv6（2）}说明“需要一个实现来支持全局ipv4和/或ipv6地址，具体取决于它对ipv4和ipv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicSrcAddr",
      "zh-CHS": "对象natSessionPublicSrcAddr"
    },
    {
      "indent": 6,
      "text": "SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "语法InetAddress（SIZE（4 | 16））DESCRIPTION“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "zh-CHS": "对象natSessionPublicDstAddr语法InetAddress（大小（4 | 16））说明“需要一个实现来支持全局IPv4和/或IPv6地址，这取决于它对IPv4和IPv6的支持。”"
    },
    {
      "indent": 4,
      "text": "::= { natMIBCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors of the document would like to thank Randy Turner, Ashwini S.T., Kevin Luehrs, Sam Sankoorikal, and Juergen Quittek for their valuable feedback.",
      "zh-CHS": "本文件的作者感谢Randy Turner、Ashwini S.T、Kevin Luehrs、Sam Sankoorikal和Juergen Quitek的宝贵反馈。"
    },
    {
      "indent": 3,
      "text": "The authors would like to especially thank Juergen Schoenwaelder for his patient and fine-combed review and detailed comments as a MIB doctor. The NAT MIB is much clearer and flatter as a result of Juergen's suggestions.",
      "zh-CHS": "作者特别感谢Juergen Schoenwaeld作为MIB医生的耐心、细致的回顾和详细的评论。由于Juergen的建议，NAT MIB更加清晰和平坦。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "It is clear that this MIB can potentially be useful for configuration. Unauthorized access to the write-able objects could cause a denial of service and/or widespread network disturbance. Hence, the support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "zh-CHS": "很明显，此MIB可能对配置有用。未经授权访问可写对象可能导致拒绝服务和/或广泛的网络干扰。因此，在没有适当保护的非安全环境中支持SET操作可能会对网络操作产生负面影响。"
    },
    {
      "indent": 3,
      "text": "At this writing, no security holes have been identified beyond those that SNMP Security is itself intended to address. These relate primarily to controlled access to sensitive information and the ability to configure a device - or which might result from operator error, which is beyond the scope of any security architecture.",
      "zh-CHS": "在撰写本文时，除了SNMP安全性本身打算解决的安全漏洞之外，还没有发现任何其他安全漏洞。这些主要涉及对敏感信息的受控访问和配置设备的能力，或者可能由操作员错误导致的，这超出了任何安全体系结构的范围。"
    },
    {
      "indent": 3,
      "text": "There are a number of managed objects in this MIB that may contain information that may be sensitive from a business perspective, in that they may represent NAT bind and session information. The NAT bind and session objects reveal the identity of private hosts that are engaged in a session with external end nodes. A curious outsider",
      "zh-CHS": "此MIB中有许多托管对象可能包含从业务角度看可能敏感的信息，因为它们可能表示NAT绑定和会话信息。NAT绑定和会话对象显示与外部终端节点进行会话的专用主机的标识。好奇的局外人"
    },
    {
      "indent": 3,
      "text": "could monitor these two objects to assess the number of private hosts being supported by the NAT device. Further, a disgruntled former employee of an enterprise could use the NAT bind and session information to break into specific private hosts by intercepting the existing sessions or originating new sessions into the host. There are no objects that are sensitive in their own right, such as passwords or monetary amounts. It may even be important to control GET access to these objects and possibly to encrypt the values of these objects when they are sent over the network via SNMP. Not all versions of SNMP provide features for such a secure environment.",
      "zh-CHS": "可以监视这两个对象，以评估NAT设备支持的专用主机的数量。此外，不满的企业前员工可以使用NAT绑定和会话信息，通过拦截现有会话或向主机发起新会话，进入特定的私有主机。没有任何对象本身是敏感的，例如密码或货币金额。在通过SNMP通过网络发送这些对象时，控制对这些对象的访问，并可能加密这些对象的值，这甚至可能很重要。并非所有版本的SNMP都为这种安全环境提供功能。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB.",
      "zh-CHS": "SNMPv3之前的SNMP版本未包含足够的安全性。即使网络本身是安全的（例如通过使用IPSec），即使如此，也无法控制安全网络上的谁可以访问和获取/设置（读取/更改/创建/删除）此MIB中的对象。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "zh-CHS": "建议实施者考虑SNMPv3框架提供的安全特性（参见[RCFC310]，第8节），包括对SNMPv3加密机制的完全支持（用于身份验证和隐私）。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "此外，不建议部署SNMPv3之前的SNMP版本。相反，建议部署SNMPv3并启用加密安全性。然后，客户/运营商应负责确保授予访问此MIB模块实例权限的SNMP实体已正确配置为仅授予那些拥有确实获取或设置（更改/创建/删除）对象的合法权限的主体（用户）访问对象。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, January 2001.",
      "zh-CHS": "[RFC3022]Srisuresh，P.和K.Egevang，“传统IP网络地址转换器（传统NAT）”，RFC 3022，2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2663] Srisuresh, P. and M. Holdrege, \"IP Network Address Translator (NAT) Terminology and Considerations\", RFC 2663, August 1999.",
      "zh-CHS": "[RFC2663]Srisuresh，P.和M.Holdrege，“IP网络地址转换器（NAT）术语和注意事项”，RFC 2663，1999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., Schoenwaelder, J., \"Textual Conventions for Internet Network Addresses\", RFC 4001, February 2005.",
      "zh-CHS": "[RFC4001]Daniele，M.，Haberman，B.，Routhier，S.，Schoenwaeld，J.，“互联网网络地址的文本约定”，RFC 4001，2005年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC792] Postel, J., \"Internet Control Message Protocol\", STD 5, RFC 792, September 1981.",
      "zh-CHS": "[RFC792]Postel，J.，“互联网控制消息协议”，STD 5，RFC 792，1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3489] Rosenberg, J., Weinberger, J., Huitema, C., and R. Mahy, \"STUN - Simple Traversal of User Datagram Protocol (UDP) Through Network Address Translators (NATs)\", RFC 3489, March 2003.",
      "zh-CHS": "[RFC3489]Rosenberg，J.，Weinberger，J.，Huitema，C.，和R.Mahy，“STUN-通过网络地址转换器（NAT）简单遍历用户数据报协议（UDP）”，RFC 3489，2003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "zh-CHS": "[RFC2863]McCloghrie，K.和F.Kastenholz，“接口组MIB”，RFC 28632000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2463] Conta, A. and S. Deering, \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 2463, December 1998.",
      "zh-CHS": "[RFC2463]Conta，A.和S.Deering，“互联网协议版本6（IPv6）规范的互联网控制消息协议（ICMPv6）”，RFC2463，1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "zh-CHS": "[RFC3411]Harrington，D.，Presohn，R.，和B.Wijnen，“描述简单网络管理协议（SNMP）管理框架的体系结构”，STD 62，RFC 3411，2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3413] Levi, D., Meyer, P., and B. Stewart, \"Simple Network Management Protocol (SNMP) Applications\", STD 62, RFC 3413, December 2002.",
      "zh-CHS": "[RFC3413]Levi，D.，Meyer，P.，和B.Stewart，“简单网络管理协议（SNMP）应用”，STD 62，RFC 3413，2002年12月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "zh-CHS": "[RFC1918]Rekhter，Y.，Moskowitz，B.，Karrenberg，D.，de Groot，G.，和E.Lear，“私人互联网地址分配”，BCP 5，RFC 1918，1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.，和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 34102002年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "R. Rohit Mascon Global Limited #59/2 100 ft Ring Road Banashankari II Stage Bangalore 560 070 India",
      "zh-CHS": "R.Rohit Mascon Global Limited#59/2 100英尺环线Banashankari II期班加罗尔560070印度"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 679 6227\nEMail: rrohit74@hotmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "P. Srisuresh Caymas Systems, Inc. 1179-A North McDowell Blvd. Petaluma, CA 94954",
      "zh-CHS": "P.Srisuresh Caymas Systems，Inc.1179-A北麦克道尔大道。佩塔卢马，加利福尼亚州94954"
    },
    {
      "indent": 3,
      "text": "Phone: (707) 283-5063 EMail: srisuresh@yahoo.com",
      "zh-CHS": "电话：（707）283-5063电子邮件：srisuresh@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Rajiv Raghunarayan Cisco Systems Inc. 170 West Tasman Drive San Jose, CA 95134",
      "zh-CHS": "Rajiv Raghunarayan思科系统公司，加利福尼亚州圣何塞西塔斯曼大道170号，邮编95134"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 853 9612\nEMail: raraghun@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Nalinaksh Pai Cisco Systems, Inc. Prestige Waterford No. 9, Brunton Road Bangalore - 560 025 India",
      "zh-CHS": "Nalinaksh Pai Cisco Systems，Inc.印度班加罗尔布伦顿路9号威望沃特福德-560025"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 532 1300 extn. 6354\nEMail: npai@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Cliff Wang Information Security Bank One Corp 1111 Polaris Pkwy Columbus, OH 43240",
      "zh-CHS": "Cliff Wang信息安全银行一号公司1111 Polaris Pkwy俄亥俄州哥伦布市43240"
    },
    {
      "indent": 3,
      "text": "Phone: +1 614 213 6117\nEMail: cliffwang2000@yahoo.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}