{
  "title": {
    "text": "RFC 4257: Framework for Generalized Multi-Protocol Label Switching (GMPLS)-based Control of Synchronous Digital Hierarchy/Synchronous Optical Networking (SDH/SONET) Networks",
    "zh-CHS": "RFC 4257"
  },
  "number": 4257,
  "created_at": "2021-11-13 08:24:30.402741+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       G. Bernstein\nRequest for Comments: 4257                             Grotto Networking\nCategory: Informational                                        E. Mannie\n                                                                Perceval\n                                                               V. Sharma\n                                                          Metanoia, Inc.\n                                                                 E. Gray\n                                                Marconi Corporation, plc\n                                                           December 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": " Framework for Generalized Multi-Protocol Label Switching (GMPLS)-based Control of Synchronous Digital Hierarchy/Synchronous Optical Networking (SDH/SONET) Networks",
      "zh-CHS": "基于通用多协议标签交换（GMPLS）的同步数字体系/同步光网络（SDH/SONET）控制框架"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Generalized Multi-Protocol Label Switching (GMPLS) is a suite of protocol extensions to MPLS to make it generally applicable, to include, for example, control of non packet-based switching, and particularly, optical switching. One consideration is to use GMPLS protocols to upgrade the control plane of optical transport networks. This document illustrates this process by describing those extensions to GMPLS protocols that are aimed at controlling Synchronous Digital Hierarchy (SDH) or Synchronous Optical Networking (SONET) networks. SDH/SONET networks make good examples of this process for a variety of reasons. This document highlights extensions to GMPLS-related routing protocols to disseminate information needed in transport path computation and network operations, together with (G)MPLS protocol extensions required for the provisioning of transport circuits. New capabilities that an GMPLS control plane would bring to SDH/SONET networks, such as new restoration methods and multi-layer circuit establishment, are also discussed.",
      "zh-CHS": "广义多协议标签交换（GMPLS）是MPLS的一套协议扩展，以使其普遍适用，例如包括对非分组交换的控制，特别是光交换。一个考虑因素是使用GMPLS协议升级光传输网络的控制平面。本文件通过描述旨在控制同步数字体系（SDH）或同步光网络（SONET）网络的GMPLS协议扩展来说明这一过程。由于各种原因，SDH/SONET网络就是这一过程的好例子。本文档重点介绍了GMPLS相关路由协议的扩展，以传播传输路径计算和网络操作所需的信息，以及传输电路供应所需的（G）MPLS协议扩展。还讨论了GMPLS控制平面将给SDH/SONET网络带来的新功能，如新的恢复方法和多层电路的建立。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. MPLS Overview ..............................................3\n   1.2. SDH/SONET Overview .........................................5\n   1.3. The Current State of Circuit Establishment in\n        SDH/SONET Networks .........................................7\n        1.3.1. Administrative Tasks ................................8\n        1.3.2. Manual Operations ...................................8\n        1.3.3. Planning Tool Operation .............................8\n        1.3.4. Circuit Provisioning ................................8\n   1.4. Centralized Approach versus Distributed Approach ...........9\n        1.4.1. Topology Discovery and Resource Dissemination ......10\n        1.4.2. Path Computation (Route Determination) .............10\n        1.4.3. Connection Establishment (Provisioning) ............10\n   1.5. Why SDH/SONET Will Not Disappear Tomorrow .................12\n2. GMPLS Applied to SDH/SONET .....................................13\n   2.1. Controlling the SDH/SONET Multiplex .......................13\n   2.2. SDH/SONET LSR and LSP Terminology .........................14\n3. Decomposition of the GMPLS Circuit-Switching Problem Space .....14\n4. GMPLS Routing for SDH/SONET ....................................15\n   4.1. Switching Capabilities ....................................16\n        4.1.1. Switching Granularity ..............................16\n        4.1.2. Signal Concatenation Capabilities ..................17\n        4.1.3. SDH/SONET Transparency .............................19\n   4.2. Protection ................................................20\n   4.3. Available Capacity Advertisement ..........................23\n   4.4. Path Computation ..........................................24\n5. LSP Provisioning/Signaling for SDH/SONET .......................25\n   5.1. What Do We Label in SDH/SONET?  Frames or Circuits? .......25\n   5.2. Label Structure in SDH/SONET ..............................26\n   5.3. Signaling Elements ........................................27\n6. Summary and Conclusions ........................................29\n7. Security Considerations ........................................29\n8. Acknowledgements ...............................................30\n9. Informative References .........................................31\n10. Acronyms ......................................................33",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The CCAMP Working Group of the IETF has the goal of extending MPLS [1] protocols to support multiple network layers and new services. This extended MPLS, which was initially known as Multi-Protocol Lambda Switching, is now better referred to as Generalized MPLS (or GMPLS).",
      "zh-CHS": "IETF的CCAMP工作组的目标是扩展MPLS[1]协议，以支持多个网络层和新服务。这种扩展的MPLS最初被称为多协议Lambda交换，现在更好地称为广义MPLS（或GMPLS）。"
    },
    {
      "indent": 3,
      "text": "The GMPLS effort is, in effect, extending IP/MPLS technology to control and manage lower layers. Using the same framework and similar signaling and routing protocols to control multiple layers can not only reduce the overall complexity of designing, deploying, and maintaining networks, but can also make it possible to operate two contiguous layers by using either an overlay model, a peer model, or an integrated model. The benefits of using a peer or an overlay model between the IP layer and its underlying layer(s) will have to be clarified and evaluated in the future. In the mean time, GMPLS could be used for controlling each layer independently.",
      "zh-CHS": "GMPLS的工作实际上是扩展IP/MPLS技术以控制和管理较低层。使用相同的框架和类似的信令和路由协议来控制多层，不仅可以降低设计、部署和维护网络的总体复杂性，而且还可以通过使用覆盖模型、对等模型或集成模型来操作两个相邻的层。在IP层及其底层之间使用对等或覆盖模型的好处将在将来得到澄清和评估。同时，GMPLS可用于独立控制各层。"
    },
    {
      "indent": 3,
      "text": "The goal of this work is to highlight how GMPLS could be used to dynamically establish, maintain, and tear down SDH/SONET circuits. The objective of using these extended IP/MPLS protocols is to provide at least the same kinds of SDH/SONET services as are provided today, but using signaling instead of provisioning via centralized management to establish those services. This will allow operators to propose new services, and will allow clients to create SDH/SONET paths on-demand, in real-time, through the provider network. We first review the essential properties of SDH/SONET networks and their operations, and we show how the label concept in GMPLS can be extended to the SDH/SONET case. We then look at important information to be disseminated by a link state routing protocol and look at the important signal attributes that need to be conveyed by a label distribution protocol. Finally, we look at some outstanding issues and future possibilities.",
      "zh-CHS": "这项工作的目标是强调如何使用GMPLS动态建立、维护和拆除SDH/SONET电路。使用这些扩展IP/MPLS协议的目的是提供至少与当前提供的SDH/SONET服务相同的服务，但使用信令而不是通过集中管理来提供这些服务。这将允许运营商提出新的服务，并允许客户通过提供商网络按需实时创建SDH/SONET路径。我们首先回顾了SDH/SONET网络及其操作的基本特性，并展示了如何将GMPLS中的标签概念扩展到SDH/SONET情况。然后，我们查看链路状态路由协议要传播的重要信息，以及标签分发协议需要传递的重要信号属性。最后，我们看一些悬而未决的问题和未来的可能性。"
    },
    {
      "indent": 0,
      "text": "1.1. MPLS Overview",
      "section_title": true,
      "zh-CHS": "1.1. MPLS概述"
    },
    {
      "indent": 3,
      "text": "A major advantage of the MPLS architecture [1] for use as a general network control plane is its clear separation between the forwarding (or data) plane, the signaling (or connection control) plane, and the routing (or topology discovery/resource status) plane. This allows the work on MPLS extensions to focus on the forwarding and signaling planes, while allowing well-known IP routing protocols to be reused in the routing plane. This clear separation also allows for MPLS to be used to control networks that do not have a packet-based forwarding plane.",
      "zh-CHS": "用作一般网络控制平面的MPLS架构[1]的一个主要优点是其在转发（或数据）平面、信令（或连接控制）平面和路由（或拓扑发现/资源状态）平面之间的清晰分离。这使得MPLS扩展的工作集中在转发和信令平面上，同时允许在路由平面中重用众所周知的IP路由协议。这种清晰的分离还允许MPLS用于控制没有基于分组的转发平面的网络。"
    },
    {
      "indent": 3,
      "text": "An MPLS network consists of MPLS nodes called Label Switch Routers (LSRs) connected via Label Switched Paths (LSPs). An LSP is uni-directional and could be of several different types such as point-to-point, point-to-multipoint, and multipoint-to-point. Border LSRs in an MPLS network act as either ingress or egress LSRs, depending on the direction of the traffic being forwarded.",
      "zh-CHS": "MPLS网络由称为标签交换路由器（LSR）的MPLS节点组成，这些节点通过标签交换路径（LSP）连接。LSP是单向的，可以有几种不同的类型，如点对点、点对多点和多点对点。MPLS网络中的边界LSR充当入口或出口LSR，具体取决于转发的流量方向。"
    },
    {
      "indent": 3,
      "text": "Each LSP is associated with a Forwarding Equivalence Class (FEC), which may be thought of as a set of packets that receive identical forwarding treatment at an LSR. The simplest example of an FEC might be the set of destination addresses lying in a given address range. All packets that have a destination address lying within this address range are forwarded identically at each LSR configured with that FEC.",
      "zh-CHS": "每个LSP与转发等价类（FEC）相关联，其可被认为是在LSR处接收相同转发处理的一组分组。FEC的最简单示例可能是位于给定地址范围内的一组目标地址。具有位于该地址范围内的目的地地址的所有数据包在使用该FEC配置的每个LSR处被相同地转发。"
    },
    {
      "indent": 3,
      "text": "To establish an LSP, a signaling protocol (or label distribution protocol) such as LDP or RSVP-TE is required. Between two adjacent LSRs, an LSP is locally identified by a fixed length identifier called a label, which is only significant between those two LSRs. A signaling protocol is used for inter-node communication to assign and maintain these labels.",
      "zh-CHS": "为了建立LSP，需要信令协议（或标签分发协议），例如LDP或RSVP-TE。在两个相邻的LSR之间，LSP由称为标签的固定长度标识符在本地标识，该标识符仅在这两个LSR之间有效。信令协议用于节点间通信，以分配和维护这些标签。"
    },
    {
      "indent": 3,
      "text": "When a packet enters an MPLS-based packet network, it is classified according to its FEC and, possibly, additional rules, which together determine the LSP along which the packet must be sent. For this purpose, the ingress LSR attaches an appropriate label to the packet, and forwards the packet to the next hop. The label may be attached to a packet in different ways. For example, it may be in the form of a header encapsulating the packet (the \"shim\" header) or it may be written in the VPI/VCI field (or DLCI field) of the layer 2 encapsulation of the packet. In case of SDH/SONET networks, we will see that a label is simply associated with a segment of a circuit, and is mainly used in the signaling plane to identify this segment (e.g., a time-slot) between two adjacent nodes.",
      "zh-CHS": "当分组进入基于MPLS的分组网络时，根据其FEC和可能的附加规则对其进行分类，附加规则共同确定分组必须沿其发送的LSP。为此，入口LSR将适当的标签附加到分组，并将分组转发到下一跳。标签可以以不同的方式附在包上。例如，它可以是封装分组的报头（“垫片”报头）的形式，或者可以写入分组的第2层封装的VPI/VCI字段（或DLCI字段）中。在SDH/SONET网络的情况下，我们将看到标签仅与电路的一段相关联，并且主要在信令平面中用于标识两个相邻节点之间的该段（例如，时隙）。"
    },
    {
      "indent": 3,
      "text": "When a packet reaches a packet LSR, this LSR uses the label as an index into a forwarding table to determine the next hop and the corresponding outgoing label (and, possibly, the QoS treatment to be given to the packet), writes the new label into the packet, and forwards the packet to the next hop. When the packet reaches the egress LSR, the label is removed and the packet is forwarded using appropriate forwarding, such as normal IP forwarding. We will see that for an SDH/SONET network these operations do not occur in quite the same way.",
      "zh-CHS": "当分组到达分组LSR时，该LSR将标签用作转发表的索引，以确定下一跳和对应的传出标签（以及可能对分组进行的QoS处理），将新标签写入分组，并将分组转发到下一跳。当分组到达出口LSR时，移除标签，并使用适当的转发（例如正常IP转发）转发分组。我们将看到，对于SDH/SONET网络，这些操作不会以完全相同的方式发生。"
    },
    {
      "indent": 0,
      "text": "1.2. SDH/SONET Overview",
      "section_title": true,
      "zh-CHS": "1.2. SDH/SONET概述"
    },
    {
      "indent": 3,
      "text": "There are currently two different multiplexing technologies in use in optical networks: wavelength-division multiplexing (WDM) and time division multiplexing (TDM). This work focuses on TDM technology.",
      "zh-CHS": "目前在光网络中有两种不同的复用技术：波分复用（WDM）和时分复用（TDM）。这项工作的重点是TDM技术。"
    },
    {
      "indent": 3,
      "text": "SDH and SONET are two TDM standards widely used by operators to transport and multiplex different tributary signals over optical links, thus creating a multiplexing structure, which we call the SDH/SONET multiplex.",
      "zh-CHS": "SDH和SONET是运营商广泛使用的两种TDM标准，用于通过光链路传输和多路复用不同的支路信号，从而创建多路复用结构，我们称之为SDH/SONET多路复用。"
    },
    {
      "indent": 3,
      "text": "ITU-T (G.707) [2] includes both the European Telecommunications Standards Institute (ETSI) SDH hierarchy and the USA ANSI SONET hierarchy [3]. The ETSI SDH and SONET standards regarding frame structures and higher-order multiplexing are the same. There are some regional differences in terminology, on the use of some overhead bytes, and lower-order multiplexing. Interworking between the two lower-order hierarchies is possible using gateways.",
      "zh-CHS": "ITU-T（G.707）[2]包括欧洲电信标准协会（ETSI）SDH层次结构和美国ANSI SONET层次结构[3]。关于帧结构和高阶复用的ETSI SDH和SONET标准是相同的。在术语、一些开销字节的使用和低阶多路复用方面存在一些地区差异。使用网关，两个低阶层次结构之间的互通是可能的。"
    },
    {
      "indent": 3,
      "text": "The fundamental signal in SDH is the STM-1 that operates at a rate of about 155 Mbps, while the fundamental signal in SONET is the STS-1 that operates at a rate of about 51 Mbps. These two signals are made of contiguous frames that consist of transport overhead (header) and payload. To solve synchronization issues, the actual data is not transported directly in the payload, but rather in another internal frame that is allowed to float over two successive SDH/SONET payloads. This internal frame is named a Virtual Container (VC) in SDH and a SONET Payload Envelope (SPE) in SONET.",
      "zh-CHS": "SDH中的基本信号是以约155 Mbps的速率运行的STM-1，而SONET中的基本信号是以约51 Mbps的速率运行的STS-1。这两个信号由连续的帧组成，这些帧由传输开销（报头）和有效负载组成。为了解决同步问题，实际数据不是直接在有效载荷中传输，而是在另一个允许浮动在两个连续SDH/SONET有效载荷上的内部帧中传输。该内部帧在SDH中称为虚拟容器（VC），在SONET中称为SONET有效负载信封（SPE）。"
    },
    {
      "indent": 3,
      "text": "The SDH/SONET architecture identifies three different layers, each of which corresponds to one level of communication between SDH/SONET equipment. These are, starting with the lowest, the regenerator section/section layer, the multiplex section/line layer, and (at the top) the path layer. Each of these layers, in turn, has its own overhead (header). The transport overhead of an SDH/SONET frame is mainly sub-divided in two parts that contain the regenerator section/section overhead and the multiplex section/line overhead. In addition, a pointer (in the form of the H1, H2, and H3 bytes) indicates the beginning of the VC/SPE in the payload of the overall STM/STS frame.",
      "zh-CHS": "SDH/SONET体系结构确定了三个不同的层，每个层对应于SDH/SONET设备之间的一个通信级别。从最低层开始，再生器段/段层、多路复用段/线层和（顶部）路径层。这些层中的每一层都有自己的开销（头）。SDH/SONET帧的传输开销主要分为两部分，包括再生器部分/部分开销和多路复用部分/线路开销。此外，指针（以H1、H2和H3字节的形式）指示整个STM/STS帧的有效负载中VC/SPE的开始。"
    },
    {
      "indent": 3,
      "text": "The VC/SPE itself is made up of a header (the path overhead) and a payload. This payload can be further subdivided into sub-elements (signals) in a fairly complex way. In the case of SDH, the STM-1 frame may contain either one VC-4 or three multiplexed VC-3s. The SONET multiplex is a pure tree, while the SDH multiplex is not a pure tree, since it contains a node that can be attached to two parent",
      "zh-CHS": "VC/SPE本身由一个报头（路径开销）和一个负载组成。该有效载荷可以以相当复杂的方式进一步细分为子元素（信号）。在SDH的情况下，STM-1帧可以包含一个VC-4或三个多路复用的VC-3。SONET多路复用是一个纯树，而SDH多路复用不是一个纯树，因为它包含一个可以连接到两个父节点的节点"
    },
    {
      "indent": 3,
      "text": "nodes. The structure of the SDH/SONET multiplex is shown in Figure 1. In addition, we show reference points in this figure that are explained in later sections.",
      "zh-CHS": "节点。SDH/SONET多路复用的结构如图1所示。此外，我们在本图中显示了参考点，这些参考点将在后面的章节中解释。"
    },
    {
      "indent": 3,
      "text": "The leaves of these multiplex structures are time slots (positions) of different sizes that can contain tributary signals. These tributary signals (e.g., E1, E3, etc) are mapped into the leaves using standardized mapping rules. In general, a tributary signal does not fill a time slot completely, and the mapping rules define precisely how to fill it.",
      "zh-CHS": "这些复用结构的叶子是不同大小的时隙（位置），可以包含支路信号。这些支路信号（例如E1、E3等）使用标准化映射规则映射到叶子中。一般来说，支路信号不会完全填满一个时隙，映射规则精确地定义了如何填充它。"
    },
    {
      "indent": 3,
      "text": "What is important for the GMPLS-based control of SDH/SONET circuits is to identify the elements that can be switched from an input multiplex on one interface to an output multiplex on another interface. The only elements that can be switched are those that can be re-aligned via a pointer, i.e., a VC-x in the case of SDH and a SPE in the case of SONET.",
      "zh-CHS": "对于SDH/SONET电路的基于GMPLS的控制来说，重要的是识别可以从一个接口上的输入多路复用切换到另一个接口上的输出多路复用的元件。唯一可以切换的元件是那些可以通过指针重新对齐的元件，即SDH情况下的VC-x和SONET情况下的SPE。"
    },
    {
      "indent": 3,
      "text": "          xN       x1\nSTM-N<----AUG<----AU-4<--VC4<------------------------------C-4  E4\n           ^              ^\n           Ix3            Ix3\n           I              I           x1\n           I              -----TUG-3<----TU-3<---VC-3<---I\n           I                      ^                       C-3 DS3/E3\nSTM-0<------------AU-3<---VC-3<-- I ---------------------I\n                           ^      I\n                           Ix7    Ix7\n                           I      I    x1\n                           -----TUG-2<---TU-2<---VC-2<---C-2 DS2/T2\n                                ^  ^\n                                I  I   x3\n                                I  I----TU-12<---VC-12<--C-12 E1\n                                I\n                                I      x4\n                                I-------TU-11<---VC-11<--C-11 DS1/T1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "         xN\nSTS-N<-------------------SPE<------------------------------DS3/T3\n                          ^\n                          Ix7\n                          I            x1\n                          I---VT-Group<---VT-6<----SPE DS2/T2\n                              ^  ^  ^\n                              I  I  I  x2\n                              I  I  I-----VT-3<----SPE DS1C\n                              I  I\n                              I  I     x3\n                              I  I--------VT-2<----SPE E1\n                              I\n                              I        x4\n                              I-----------VT-1.5<--SPE DS1/T1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Figure 1. SDH and SONET multiplexing structure and typical Plesiochronous Digital Hierarchy (PDH) payload signals.",
      "zh-CHS": "图1。SDH和SONET复用结构以及典型的准同步数字体系（PDH）有效载荷信号。"
    },
    {
      "indent": 3,
      "text": "An STM-N/STS-N signal is formed from N x STM-1/STS-1 signals via byte interleaving. The VCs/SPEs in the N interleaved frames are independent and float according to their own clocking. To transport tributary signals in excess of the basic STM-1/STS-1 signal rates, the VCs/SPEs can be concatenated, i.e., glued together. In this case, their relationship with respect to each other is fixed in time; hence, this relieves, when possible, an end system of any inverse multiplexing bonding processes. Different types of concatenations are defined in SDH/SONET.",
      "zh-CHS": "STM-N/STS-N信号由N x STM-1/STS-1信号通过字节交织形成。N个交织帧中的VCs/spe是独立的，并且根据它们自己的时钟浮动。为了传输超过基本STM-1/STS-1信号速率的支路信号，VCs/SPE可以连接在一起，即粘合在一起。在这种情况下，他们之间的关系在时间上是固定的；因此，在可能的情况下，这解除了任何反向多路复用键合过程的终端系统。SDH/SONET中定义了不同类型的级联。"
    },
    {
      "indent": 3,
      "text": "For example, standard SONET concatenation allows the concatenation of\nM x STS-1 signals within an STS-N signal with M <= N, and M = 3, 12,\n48, 192, .... The SPEs of these M x STS-1s can be concatenated to\nform an STS-Mc.  The STS-Mc notation is short hand for describing an\nSTS-M signal whose SPEs have been concatenated.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1.3. The Current State of Circuit Establishment in SDH/SONET Networks",
      "section_title": true,
      "zh-CHS": "1.3. SDH/SONET网络中电路建立的现状"
    },
    {
      "indent": 3,
      "text": "In present day SDH and SONET networks, the networks are primarily statically configured. When a client of an operator requests a point-to-point circuit, the request sets in motion a process that can last for several weeks or more. This process is composed of a chain of shorter administrative and technical tasks, some of which can be fully automated, resulting in significant improvements in provisioning time and in operational savings. In the best case, the entire process can be fully automated allowing, for example, customer premise equipment (CPE) to contact an SDH/SONET switch to request a circuit. Currently, the provisioning process involves the following tasks.",
      "zh-CHS": "在当今的SDH和SONET网络中，网络主要是静态配置的。当操作员的客户机请求点对点电路时，该请求会启动一个可能持续数周或更长时间的进程。此过程由一系列较短的管理和技术任务组成，其中一些任务可以完全自动化，从而显著缩短资源调配时间并节省运营成本。在最佳情况下，整个过程可以完全自动化，例如，允许客户前提设备（CPE）联系SDH/SONET交换机请求电路。目前，资源调配过程涉及以下任务。"
    },
    {
      "indent": 0,
      "text": "1.3.1. Administrative Tasks",
      "section_title": true,
      "zh-CHS": "1.3.1. 行政任务"
    },
    {
      "indent": 3,
      "text": "The administrative tasks represent a significant part of the provisioning time. Most of them can be automated using IT applications, e.g., a client still has to fill a form to request a circuit. This form can be filled via a Web-based application and can be automatically processed by the operator. A further enhancement is to allow the client's equipment to coordinate with the operator's network directly and request the desired circuit. This could be achieved through a signaling protocol at the interface between the client equipment and an operator switch, i.e., at the UNI, where GMPLS signaling [4], [5] can be used.",
      "zh-CHS": "管理任务占资源调配时间的很大一部分。其中大多数都可以使用IT应用程序实现自动化，例如，客户仍然需要填写表格才能请求电路。此表格可通过基于Web的应用程序填写，并可由操作员自动处理。进一步的增强是允许客户设备直接与运营商的网络协调，并请求所需的电路。这可以通过客户端设备和操作员交换机之间接口处的信令协议实现，即，在UNI处，可以使用GMPLS信令[4]、[5]。"
    },
    {
      "indent": 0,
      "text": "1.3.2. Manual Operations",
      "section_title": true,
      "zh-CHS": "1.3.2. 人工操作"
    },
    {
      "indent": 3,
      "text": "Another significant part of the time may be consumed by manual operations that involve installing the right interface in the CPE and installing the right cable or fiber between the CPE and the operator switch. This time can be especially significant when a client is in a different time zone than the operator's main office. This first-time connection time is frequently accounted for in the overall establishment time.",
      "zh-CHS": "另一个重要的时间部分可能被手动操作所消耗，这些操作涉及在CPE中安装正确的接口以及在CPE和操作员交换机之间安装正确的电缆或光纤。当客户位于与运营商主办公室不同的时区时，此时间可能特别重要。这种首次连接时间通常会计入整个建立时间。"
    },
    {
      "indent": 0,
      "text": "1.3.3. Planning Tool Operation",
      "section_title": true,
      "zh-CHS": "1.3.3. 计划工具操作"
    },
    {
      "indent": 3,
      "text": "Another portion of the time is consumed by planning tools that run simulations using heuristic algorithms to find an optimized placement for the required circuits. These planning tools can require a significant running time, sometimes on the order of days.",
      "zh-CHS": "另一部分时间被规划工具消耗，这些工具使用启发式算法运行模拟，以找到所需电路的优化布局。这些计划工具可能需要大量的运行时间，有时需要几天。"
    },
    {
      "indent": 3,
      "text": "These simulations are, in general, executed for a set of demands for circuits, i.e., a batch mode, to improve the optimality of network resource usage and other parameters. Today, we do not really have a means to reduce this simulation time. On the contrary, to support fast, on-line, circuit establishment, this phase may be invoked more frequently, i.e., we will not \"batch up\" as many connection requests before we plan out the corresponding circuits. This means that the network may need to be re-optimized periodically, implying that the signaling should support re-optimization with minimum impact to existing services.",
      "zh-CHS": "这些模拟通常针对一组电路需求执行，即批处理模式，以提高网络资源使用和其他参数的最佳性。今天，我们并没有真正的方法来减少这种模拟时间。相反，为了支持快速、在线的电路建立，可以更频繁地调用此阶段，也就是说，在规划相应电路之前，我们不会“批量处理”太多的连接请求。这意味着网络可能需要周期性地重新优化，这意味着信令应该支持对现有服务影响最小的重新优化。"
    },
    {
      "indent": 0,
      "text": "1.3.4. Circuit Provisioning",
      "section_title": true,
      "zh-CHS": "1.3.4. 电路供应"
    },
    {
      "indent": 3,
      "text": "Once the first three steps discussed above have been completed, the operator must provision the circuits using the outputs of the planning process. The time required for provisioning varies greatly. It can be fairly short, on the order of a few minutes, if the operators already have tools that help them to do the provisioning",
      "zh-CHS": "完成上述前三个步骤后，操作员必须使用规划过程的输出提供电路。资源调配所需的时间差别很大。如果运营商已经有了帮助他们进行资源调配的工具，那么时间可能相当短，大约几分钟"
    },
    {
      "indent": 3,
      "text": "over heterogeneous equipment. Otherwise, the process can take days. Developing these tools for each new piece of equipment and each vendor is a significant burden on the service provider. A standardized interface for provisioning, such as GMPLS signaling, could significantly reduce or eliminate this development burden. In general, provisioning is a batched activity, i.e., a few times per week an operator provisions a set of circuits. GMPLS will reduce this provisioning time from a few minutes to a few seconds and could help to transform this periodic process into a real-time process.",
      "zh-CHS": "在异构设备上。否则，该过程可能需要几天时间。为每个新设备和每个供应商开发这些工具是服务提供商的一个重大负担。用于供应的标准化接口（如GMPLS信令）可以显著减少或消除这种开发负担。一般来说，供应是一项分批活动，即操作员每周几次供应一组电路。GMPLS将把这个资源调配时间从几分钟减少到几秒钟，并有助于将这个周期性过程转变为实时过程。"
    },
    {
      "indent": 3,
      "text": "When a circuit is provisioned, it is not delivered directly to a client. Rather, the operator first tests its performance and behavior and, if successful, delivers the circuit to the client. This testing phase lasts, in general, up to 24 hours. The operator installs test equipment at each end and uses pre-defined test streams to verify performance. If successful, the circuit is officially accepted by the client. To speed up the verification (sometimes known as \"proving\") process, it would be necessary to support some form of automated performance testing.",
      "zh-CHS": "配置电路时，它不会直接传送到客户端。相反，操作员首先测试其性能和行为，如果成功，则将电路交付给客户。该测试阶段通常持续24小时。操作员在每一端安装测试设备，并使用预定义的测试流验证性能。如果成功，客户将正式接受电路。为了加快验证（有时称为“证明”）过程，有必要支持某种形式的自动化性能测试。"
    },
    {
      "indent": 0,
      "text": "1.4. Centralized Approach versus Distributed Approach",
      "section_title": true,
      "zh-CHS": "1.4. 集中式方法与分布式方法"
    },
    {
      "indent": 3,
      "text": "Whether a centralized approach or a distributed approach will be used to control SDH/SONET networks is an open question, since each approach has its merits. The application of GMPLS to SDH/SONET networks does not preclude either model, although GMPLS is itself a distributed technology.",
      "zh-CHS": "控制SDH/SONET网络将采用集中式方法还是分布式方法是一个开放的问题，因为每种方法都有其优点。GMPLS在SDH/SONET网络中的应用并不排除这两种模式，尽管GMPLS本身是一种分布式技术。"
    },
    {
      "indent": 3,
      "text": "The basic tradeoff between the centralized and distributed approaches is that of complexity of the network elements versus that of the network management system (NMS). Since adding functionality to existing SDH/SONET network elements may not be possible, a centralized approach may be needed in some cases. The main issue facing centralized control via an NMS is one of scalability. For instance, this approach may be limited in the number of network elements that can be managed (e.g., one thousand). It is, therefore, quite common for operators to deploy several NMS in parallel at the Network Management Layer, each managing a different zone. In that case, however, a Service Management Layer must be built on the top of several individual NMS to take care of end-to-end on-demand services. On the other hand, in a complex and/or dense network, restoration could be faster with a distributed approach than with a centralized approach.",
      "zh-CHS": "集中式和分布式方法之间的基本权衡是网元的复杂性与网络管理系统（NMS）的复杂性。由于不可能向现有SDH/SONET网络元件添加功能，因此在某些情况下可能需要采用集中式方法。通过NMS进行集中控制面临的主要问题是可伸缩性。例如，这种方法可能在可管理的网元数量上受到限制（例如，一千个）。因此，运营商通常在网络管理层并行部署多个NM，每个NM管理一个不同的区域。但是，在这种情况下，必须在几个单独的NMS上构建服务管理层，以处理端到端的按需服务。另一方面，在复杂和/或密集的网络中，分布式方法的恢复速度可能比集中式方法更快。"
    },
    {
      "indent": 3,
      "text": "Let's now look at how the major control plane functional components are handled via the centralized and distributed approaches:",
      "zh-CHS": "现在让我们看看主要控制平面功能组件是如何通过集中式和分布式方法处理的："
    },
    {
      "indent": 0,
      "text": "1.4.1. Topology Discovery and Resource Dissemination",
      "section_title": true,
      "zh-CHS": "1.4.1. 拓扑发现与资源分发"
    },
    {
      "indent": 3,
      "text": "Currently, an NMS maintains a consistent view of all the networking layers under its purview. This can include the physical topology, such as information about fibers and ducts. Since most of this information is entered manually, it remains error prone.",
      "zh-CHS": "目前，NMS维护其权限下所有网络层的一致视图。这可能包括物理拓扑，例如有关光纤和风管的信息。由于大多数信息都是手动输入的，因此很容易出错。"
    },
    {
      "indent": 3,
      "text": "A link state GMPLS routing protocol, on the other hand, could perform automatic topology discovery and disseminate the topology as well as resource status. This information would be available to all nodes in the network, and hence also the NMS. Hence, one can look at a continuum of functionality between manually provisioned topology information (of which there will always be some) and fully automated discovery and dissemination (as in a link state protocol). Note that, unlike the IP datagram case, a link state routing protocol applied to the SDH/SONET network does not have any service impacting implications. This is because in the SDH/SONET case, the circuit is source-routed (so there can be no loops), and no traffic is transmitted until a circuit has been established and an acknowledgement received at the source.",
      "zh-CHS": "另一方面，链路状态GMPLS路由协议可以执行自动拓扑发现并传播拓扑以及资源状态。该信息将可用于网络中的所有节点，因此也可用于NMS。因此，可以看到手动提供的拓扑信息（其中总会有一些）和完全自动的发现和分发（如链路状态协议）之间的连续功能。请注意，与IP数据报不同，应用于SDH/SONET网络的链路状态路由协议没有任何影响服务的影响。这是因为在SDH/SONET情况下，电路是源路由的（因此可能没有环路），在电路建立并在源接收到确认之前，不会传输任何通信量。"
    },
    {
      "indent": 0,
      "text": "1.4.2. Path Computation (Route Determination)",
      "section_title": true,
      "zh-CHS": "1.4.2. 路径计算（路线确定）"
    },
    {
      "indent": 3,
      "text": "In the SDH/SONET case, unlike the IP datagram case, there is no need for network elements to all perform the same path calculation [6]. In addition, path determination is an area for vendors to provide a potentially significant value addition in terms of network efficiency, reliability, and service differentiation. In this sense, a centralized approach to path computation may be easier to operate and upgrade. For example, new features such as new types of path diversity or new optimization algorithms can be introduced with a simple NMS software upgrade. On the other hand, updating switches with new path computation software is a more complicated task. In addition, many of the algorithms can be fairly computationally intensive and may be completely unsuitable for the embedded processing environment available on most switches. In restoration scenarios, the ability to perform a reasonably sophisticated level of path computation on the network element can be particularly useful for restoring traffic during major network faults.",
      "zh-CHS": "在SDH/SONET情况下，与IP数据报情况不同，不需要所有网元都执行相同的路径计算[6]。此外，路径确定是供应商在网络效率、可靠性和服务差异化方面提供潜在重要附加值的一个领域。从这个意义上讲，集中式路径计算方法可能更易于操作和升级。例如，可以通过简单的NMS软件升级引入新功能，例如新类型的路径分集或新的优化算法。另一方面，使用新的路径计算软件更新交换机是一项更复杂的任务。此外，许多算法的计算量相当大，可能完全不适合大多数交换机上可用的嵌入式处理环境。在恢复场景中，在网元上执行合理复杂级别的路径计算的能力对于在重大网络故障期间恢复流量特别有用。"
    },
    {
      "indent": 0,
      "text": "1.4.3. Connection Establishment (Provisioning)",
      "section_title": true,
      "zh-CHS": "1.4.3. 连接建立（资源调配）"
    },
    {
      "indent": 3,
      "text": "The actual setting up of circuits, i.e., a coupled collection of cross connects across a network, can be done either via the NMS setting up individual cross connects or via a \"soft permanent LSP\" (SPLSP) type approach. In the SPLSP approach, the NMS may just kick off the connection at the \"ingress\" switch with GMPLS signaling setting up the connection from that point onward. Connection",
      "zh-CHS": "电路的实际设置，即跨网络交叉连接的耦合集合，可以通过NMS设置单个交叉连接或通过“软永久LSP”（SPLSP）类型的方法完成。在SPLSP方法中，NMS可能只是在“入口”开关处启动连接，GMPLS信令从该点开始建立连接。联系"
    },
    {
      "indent": 3,
      "text": "establishment is the trickiest part to distribute, however, since errors in the connection setup/tear down process are service impacting.",
      "zh-CHS": "然而，建立是最难分发的部分，因为连接设置/断开过程中的错误会影响服务。"
    },
    {
      "indent": 3,
      "text": "The table below compares the two approaches to connection establishment.",
      "zh-CHS": "下表比较了建立连接的两种方法。"
    },
    {
      "indent": 3,
      "text": "Table 1. Qualitative comparison between centralized and distributed approaches.",
      "zh-CHS": "表1。集中式和分布式方法之间的定性比较。"
    },
    {
      "indent": 7,
      "text": "Distributed approach Centralized approach",
      "zh-CHS": "分布式方法集中式方法"
    },
    {
      "indent": 7,
      "text": "Packet-based control plane Management plane like TMN or (like GMPLS or PNNI) useful? SNMP Do we really need it? Being Always needed! Already there, added/specified by several proven and understood. standardization bodies",
      "zh-CHS": "基于包的控制平面管理平面，如TMN或（如GMPLS或PNNI）有用吗？我们真的需要它吗？永远被需要！已存在，由多个经验证和理解的公司添加/指定。标准化机构"
    },
    {
      "indent": 7,
      "text": "High survivability (e.g., in Potential single point(s) of case of partition) failure",
      "zh-CHS": "高生存能力（例如，在分区情况下的潜在单点）故障"
    },
    {
      "indent": 7,
      "text": "Distributed load Bottleneck: #requests and actions to/from NMS",
      "zh-CHS": "分布式负载瓶颈：#向/来自NMS的请求和操作"
    },
    {
      "indent": 7,
      "text": "Individual local routing Centralized routing decision, decision can be done per block of requests Routing scalable as for the Assumes a few big Internet administrative domains",
      "zh-CHS": "单个本地路由集中式路由决策，决策可以按请求块进行，路由可扩展为几个大型Internet管理域"
    },
    {
      "indent": 7,
      "text": "Complex to change routing Very easy local upgrade (non-protocol/algorithm intrusive)",
      "zh-CHS": "复杂的路由更改非常容易本地升级（非协议/算法侵入）"
    },
    {
      "indent": 7,
      "text": "Requires enhanced routing Better consistency protocol (traffic engineering)",
      "zh-CHS": "需要增强的路由和更好的一致性协议（流量工程）"
    },
    {
      "indent": 7,
      "text": "Ideal for inter-domain Not inter-domain friendly",
      "zh-CHS": "非常适合域间而非域间友好型"
    },
    {
      "indent": 7,
      "text": "Suitable for very dynamic For less dynamic demands demands (longer lived)",
      "zh-CHS": "适用于动态性很强，但动态性要求较低（寿命较长）"
    },
    {
      "indent": 7,
      "text": "Probably faster to restore, Probably slower to restore,but but more difficult to have could effect reliable reliable restoration. restoration.",
      "zh-CHS": "恢复速度可能更快，恢复速度可能较慢，但更困难的恢复可能会影响可靠的恢复。恢复"
    },
    {
      "indent": 7,
      "text": "High scalability Limited scalability: #nodes, (hierarchical) links, circuits, messages",
      "zh-CHS": "高可扩展性有限的可扩展性：#节点，（分层）链路、电路、消息"
    },
    {
      "indent": 7,
      "text": "Planning (optimization) Planning is a background harder to achieve centralized activity",
      "zh-CHS": "计划（优化）计划是一种较难实现集中化活动的背景"
    },
    {
      "indent": 7,
      "text": "Easier future integration with other control plane layers",
      "zh-CHS": "将来更容易与其他控制平面层集成"
    },
    {
      "indent": 0,
      "text": "1.5. Why SDH/SONET Will Not Disappear Tomorrow",
      "section_title": true,
      "zh-CHS": "1.5. 为什么SDH/SONET明天不会消失"
    },
    {
      "indent": 3,
      "text": "As IP traffic becomes the dominant traffic transported over the transport infrastructure, it is useful to compare the statistical multiplexing of IP with the time division multiplexing of SDH and SONET.",
      "zh-CHS": "由于IP流量成为通过传输基础设施传输的主要流量，因此比较IP的统计多路复用与SDH和SONET的时分多路复用非常有用。"
    },
    {
      "indent": 3,
      "text": "Consider, for instance, a scenario where IP over WDM is used everywhere and lambdas are optically switched. In such a case, a carrier's carrier would sell dynamically controlled lambdas with each customers building their own IP backbones over these lambdas.",
      "zh-CHS": "例如，考虑IP over WDM无处不在的场景，光交换LAMBDAS。在这种情况下，运营商的运营商将销售动态控制的lambda，每个客户在这些lambda上构建自己的IP主干。"
    },
    {
      "indent": 3,
      "text": "This simple model implies that a carrier would sell lambdas instead of bandwidth. The carrier's goal will be to maximize the number of wavelengths/lambdas per fiber, with each customer having to fully support the cost for each end-to-end lambda whether or not the wavelength is fully utilized. Although, in the near future, we may have technology to support up to several hundred lambdas per fiber, a world where lambdas are so cheap and abundant that every individual customer buys them, from one point to any other point, appears an unlikely scenario today.",
      "zh-CHS": "这个简单的模型意味着运营商将出售lambda而不是带宽。运营商的目标将是最大限度地增加每根光纤的波长数/λ数，无论波长是否得到充分利用，每个客户都必须完全支持每个端到端λ数的成本。尽管在不久的将来，我们的技术可能支持每根光纤多达数百个Lambda，但在一个如此便宜和丰富的世界里，Lambda从一点到另一点，每个客户都会购买，这在今天看来是不太可能的。"
    },
    {
      "indent": 3,
      "text": "More realistically, there is still room for a multiplexing technology that provides circuits with a lower granularity than a wavelength. (Not everyone needs a minimum of 10 Gbps or 40 Gbps per circuit, and IP does not yet support all telecom applications in bulk efficiently.)",
      "zh-CHS": "更现实地说，提供比波长更低粒度电路的多路复用技术仍有发展空间。（并非每个电路都至少需要10 Gbps或40 Gbps，IP还不能有效地支持所有的批量电信应用。）"
    },
    {
      "indent": 3,
      "text": "SDH and SONET possess a rich multiplexing hierarchy that permits fairly fine granularity and that provides a very cheap and simple physical separation of the transported traffic between circuits, i.e., QoS. Moreover, even IP datagrams cannot be transported directly over a wavelength. A framing or encapsulation is always required to delimit IP datagrams. The Total Length field of an IP header cannot be trusted to find the start of a new datagram, since it could be corrupted and would result in a loss of synchronization. The typical framing used today for IP over Dense WDM (DWDM) is defined in RFC1619/RFC2615 and is known as POS (Packet Over SDH/SONET), i.e., IP over PPP (in High-Level Data Link Control (HDLC)-like format) over SDH/SONET. SDH and SONET are actually efficient encapsulations for IP. For instance, with an average IP",
      "zh-CHS": "SDH和SONET具有丰富的多路复用层次结构，允许相当精细的粒度，并提供电路之间传输流量的非常便宜和简单的物理分离，即QoS。此外，即使是IP数据报也不能直接在波长上传输。对IP数据报进行定界总是需要一个帧或封装。无法信任IP报头的Total Length字段来查找新数据报的开头，因为它可能已损坏并导致同步丢失。目前用于IP over density WDM（DWDM）的典型帧在RFC1619/RFC2615中定义，称为POS（SDH/SONET上的数据包），即SDH/SONET上的IP over PPP（采用类似HDLC的高级数据链路控制格式）。SDH和SONET实际上是IP的有效封装。例如，平均IP"
    },
    {
      "indent": 3,
      "text": "datagram length of 350 octets, an IP over Gigabit Ethernet (GbE) encapsulation using an 8B/10B encoding results in 28% overhead, an IP/ATM/SDH encapsulation results in 22% overhead, and an IP/PPP/SDH encapsulation results in only 6% overhead.",
      "zh-CHS": "数据报长度为350个八位字节，使用8B/10B编码的IP over Gigabit Ethernet（GbE）封装导致28%的开销，IP/ATM/SDH封装导致22%的开销，IP/PPP/SDH封装仅导致6%的开销。"
    },
    {
      "indent": 3,
      "text": "Any encapsulation of IP over WDM should, in the data plane, at least provide the following: error monitoring capabilities (to detect signal degradation); error correction capabilities, such as FEC (Forward Error Correction) that are particularly needed for ultra long haul transmission; and sufficient timing information, to allow robust synchronization (that is, to detect the beginning of a packet). In the case where associated signaling is used (that is, where the control and data plane topologies are congruent), the encapsulation should also provide the capacity to transport signaling, routing, and management messages, in order to control the optical switches. Rather, SDH and SONET cover all these aspects natively, except FEC, which tends to be supported in a proprietary way. (We note, however, that associated signaling is not a requirement for the GMPLS-based control of SDH/SONET networks. Rather, it is just one option. Non associated signaling, as would happen with an out-of-band control plane network is another equally valid option.)",
      "zh-CHS": "在数据平面上，IP over WDM的任何封装应至少提供以下功能：错误监测能力（检测信号退化）；纠错能力，例如超长距离传输特别需要的FEC（前向纠错）；以及足够的定时信息，以允许鲁棒同步（即，检测分组的开始）。在使用相关信令的情况下（即，在控制和数据平面拓扑一致的情况下），封装还应提供传输信令、路由和管理消息的能力，以便控制光交换机。相反，SDH和SONET本机涵盖所有这些方面，FEC除外，FEC往往以专有方式支持。（然而，我们注意到，相关信令不是基于GMPLS的SDH/SONET网络控制的要求。相反，它只是一个选项。非相关信令，就像带外控制平面网络一样，是另一个同样有效的选项。）"
    },
    {
      "indent": 3,
      "text": "Since IP encapsulated in SDH/SONET is efficient and widely used, the only real difference between an IP over WDM network and an IP over SDH over WDM network is the layers at which the switching or forwarding can take place. In the first case, it can take place at the IP and optical layers. In the second case, it can take place at the IP, SDH/SONET, and optical layers.",
      "zh-CHS": "由于封装在SDH/SONET中的IP是高效且广泛使用的，因此IP over WDM网络和IP over SDH over WDM网络之间唯一的真正区别在于可以进行交换或转发的层。在第一种情况下，它可以发生在IP和光学层。在第二种情况下，它可以发生在IP、SDH/SONET和光学层。"
    },
    {
      "indent": 3,
      "text": "Almost all transmission networks today are based on SDH or SONET. A client is connected either directly through an SDH or SONET interface or through a PDH interface, the PDH signal being transported between the ingress and the egress interfaces over SDH or SONET. What we are arguing here is that it makes sense to do switching or forwarding at all these layers.",
      "zh-CHS": "今天几乎所有的传输网络都基于SDH或SONET。客户机通过SDH或SONET接口或PDH接口直接连接，PDH信号通过SDH或SONET在入口和出口接口之间传输。我们在这里争论的是，在所有这些层进行切换或转发是有意义的。"
    },
    {
      "indent": 0,
      "text": "2. GMPLS Applied to SDH/SONET",
      "section_title": true,
      "zh-CHS": "2. GMPLS在SDH/SONET中的应用"
    },
    {
      "indent": 0,
      "text": "2.1. Controlling the SDH/SONET Multiplex",
      "section_title": true,
      "zh-CHS": "2.1. 控制SDH/SONET多路复用"
    },
    {
      "indent": 3,
      "text": "Controlling the SDH/SONET multiplex implies deciding which of the different switchable components of the SDH/SONET multiplex we wish to control using GMPLS. Essentially, every SDH/SONET element that is referenced by a pointer can be switched. These component signals are the VC-4, VC-3, VC-2, VC-12, and VC-11 in the SDH case; and the VT and STS SPEs in the SONET case. The SPEs in SONET do not have",
      "zh-CHS": "控制SDH/SONET多路复用意味着决定我们希望使用GMPLS控制SDH/SONET多路复用的哪些不同可切换组件。基本上，指针引用的每个SDH/SONET元素都可以切换。这些分量信号是SDH情况下的VC-4、VC-3、VC-2、VC-12和VC-11；在SONET的情况下，VT和STS速度。SONET中的SPE没有"
    },
    {
      "indent": 3,
      "text": "individual names, although they can be referred to simply as VT-N SPEs. We will refer to them by identifying the structure that contains them, namely STS-1, VT-6, VT-3, VT-2, and VT-1.5.",
      "zh-CHS": "单个名称，尽管它们可以简单地称为VT-N SPE。我们将通过识别包含它们的结构来引用它们，即STS-1、VT-6、VT-3、VT-2和VT-1.5。"
    },
    {
      "indent": 3,
      "text": "The STS-1 SPE corresponds to a VC-3, a VT-6 SPE corresponds to a VC-2, a VT-2 SPE corresponds to a VC-12, and a VT-1.5 SPE corresponds to a VC-11. The SONET VT-3 SPE has no correspondence in SDH, however SDH's VC-4 corresponds to SONET's STS-3c SPE.",
      "zh-CHS": "STS-1 SPE对应于VC-3，VT-6 SPE对应于VC-2，VT-2 SPE对应于VC-12，VT-1.5 SPE对应于VC-11。SONET VT-3 SPE在SDH中没有对应关系，但SDH的VC-4对应于SONET的STS-3c SPE。"
    },
    {
      "indent": 3,
      "text": "In addition, it is possible to concatenate some of the structures that contain these elements to build larger elements. For instance, SDH allows the concatenation of X contiguous AU-4s to build a VC-4-Xc and of m contiguous TU-2s to build a VC-2-mc. In that case, a VC-4- Xc or a VC-2-mc can be switched and controlled by GMPLS. SDH also defines virtual (non-contiguous) concatenation of TU-2s; however, in that case, each constituent VC-2 is switched individually.",
      "zh-CHS": "此外，可以将包含这些元素的某些结构连接起来以构建更大的元素。例如，SDH允许将X个相邻的AU-4串联起来构建VC-4-Xc，将m个相邻的TU-2串联起来构建VC-2-mc。在这种情况下，VC-4-Xc或VC-2-mc可以通过GMPLS进行切换和控制。SDH还定义了TU-2的虚拟（非连续）级联；然而，在这种情况下，每个成分VC-2单独切换。"
    },
    {
      "indent": 0,
      "text": "2.2. SDH/SONET LSR and LSP Terminology",
      "section_title": true,
      "zh-CHS": "2.2. SDH/SONET LSR和LSP术语"
    },
    {
      "indent": 3,
      "text": "Let an SDH or SONET Terminal Multiplexer (TM), Add-Drop Multiplexer (ADM), or cross-connect (i.e., a switch) be called an SDH/SONET LSR. An SDH/SONET path or circuit between two SDH/SONET LSRs now becomes a GMPLS LSP. An SDH/SONET LSP is a logical connection between the point at which a tributary signal (client layer) is adapted into its virtual container, and the point at which it is extracted from its virtual container.",
      "zh-CHS": "将SDH或SONET终端多路复用器（TM）、分插多路复用器（ADM）或交叉连接（即交换机）称为SDH/SONET LSR。两个SDH/SONET LSR之间的SDH/SONET路径或电路现在成为GMPLS LSP。SDH/SONET LSP是支路信号（客户端层）适配到其虚拟容器中的点与从其虚拟容器中提取支路信号的点之间的逻辑连接。"
    },
    {
      "indent": 3,
      "text": "To establish such an LSP, a signaling protocol is required to configure the input interface, switch fabric, and output interface of each SDH/SONET LSR along the path. An SDH/SONET LSP can be point-to-point or point-to-multipoint, but not multipoint-to-point, since no merging is possible with SDH/SONET signals.",
      "zh-CHS": "为了建立这样的LSP，需要一个信令协议来配置路径上每个SDH/SONET LSR的输入接口、交换结构和输出接口。SDH/SONET LSP可以是点对点或点对多点，但不能是多点对点，因为SDH/SONET信号不可能合并。"
    },
    {
      "indent": 3,
      "text": "To facilitate the signaling and setup of SDH/SONET circuits, an SDH/SONET LSR must, therefore, identify each possible signal individually per interface, since each signal corresponds to a potential LSP that can be established through the SDH/SONET LSR. It turns out, however, that not all SDH signals correspond to an LSP and therefore not all of them need be identified. In fact, only those signals that can be switched need identification.",
      "zh-CHS": "因此，为了便于SDH/SONET电路的信令和设置，SDH/SONET LSR必须在每个接口上单独识别每个可能的信号，因为每个信号对应于可通过SDH/SONET LSR建立的潜在LSP。然而，事实证明，并非所有SDH信号都对应于LSP，因此并非所有SDH信号都需要识别。事实上，只有那些可以切换的信号才需要识别。"
    },
    {
      "indent": 0,
      "text": "3. Decomposition of the GMPLS Circuit-Switching Problem Space",
      "section_title": true,
      "zh-CHS": "3. GMPLS电路切换问题空间的分解"
    },
    {
      "indent": 3,
      "text": "Although those familiar with GMPLS may be familiar with its application in a variety of application areas (e.g., ATM, Frame Relay, and so on), here we quickly review its decomposition when applied to the optical switching problem space.",
      "zh-CHS": "尽管熟悉GMPLS的人可能熟悉其在各种应用领域（如ATM、帧中继等）中的应用，但在这里，我们将快速回顾其应用于光交换问题空间时的分解。"
    },
    {
      "indent": 3,
      "text": "(i) Information needed to compute paths must be made globally available throughout the network. Since this is done via the link state routing protocol, any information of this nature must either be in the existing link state advertisements (LSAs) or the LSAs must be supplemented to convey this information. For example, if it is desirable to offer different levels of service in a network, based on whether a circuit is routed over SDH/SONET lines that are ring protected versus being routed over those that are not ring protected (differentiation based on reliability), the type of protection on a SDH/SONET line would be an important topological parameter that would have to be distributed via the link state routing protocol.",
      "zh-CHS": "(i) 计算路径所需的信息必须在整个网络中全局可用。由于这是通过链路状态路由协议完成的，因此这种性质的任何信息都必须存在于现有的链路状态公告（lsa）中，或者必须补充lsa以传递该信息。例如，如果希望在网络中提供不同级别的服务，则基于电路是否在环保护的SDH/SONET线路上路由而不是在非环保护的SDH/SONET线路上路由（基于可靠性的区分），SDH/SONET线路上的保护类型将是一个重要的拓扑参数，必须通过链路状态路由协议进行分配。"
    },
    {
      "indent": 3,
      "text": "(ii) Information that is only needed between two \"adjacent\" switches for the purposes of connection establishment is appropriate for distribution via one of the label distribution protocols. In fact, this information can be thought of as the \"virtual\" label. For example, in SONET networks, when distributing information to switches concerning an end-to-end STS-1 path traversing a network, it is critical that adjacent switches agree on the multiplex entry used by this STS-1 (but this information is only of local significance between those two switches). Hence, the multiplex entry number in this case can be used as a virtual label. Note that the label is virtual, in that it is not appended to the payload in any way, but it is still a label in the sense that it uniquely identifies the signal locally on the link between the two switches.",
      "zh-CHS": "（ii）仅为建立连接而在两个“相邻”交换机之间需要的信息适用于通过其中一个标签分发协议进行分发。事实上，这些信息可以被视为“虚拟”标签。例如，在SONET网络中，当向交换机分发有关穿越网络的端到端STS-1路径的信息时，相邻交换机必须同意该STS-1使用的多路复用入口（但该信息仅在这两个交换机之间具有局部意义）。因此，在这种情况下，多路复用条目号可以用作虚拟标签。请注意，标签是虚拟的，因为它没有以任何方式附加到有效负载，但它仍然是一个标签，因为它唯一地标识了两个交换机之间链路上的本地信号。"
    },
    {
      "indent": 3,
      "text": "(iii) Information that all switches in the path need to know about a circuit will also be distributed via the label distribution protocol. Examples of such information include bandwidth, priority, and preemption.",
      "zh-CHS": "（iii）路径中所有交换机需要了解的电路信息也将通过标签分发协议分发。此类信息的示例包括带宽、优先级和抢占。"
    },
    {
      "indent": 3,
      "text": "(iv) Information intended only for end systems of the connection. Some of the payload type information may fall into this category.",
      "zh-CHS": "（iv）仅用于连接终端系统的信息。一些有效负载类型信息可能属于此类。"
    },
    {
      "indent": 0,
      "text": "4. GMPLS Routing for SDH/SONET",
      "section_title": true,
      "zh-CHS": "4. SDH/SONET的GMPLS路由"
    },
    {
      "indent": 3,
      "text": "Modern SDH/SONET transport networks excel at interoperability in the performance monitoring (PM) and fault management (FM) areas [7], [8]. They do not, however, interoperate in the areas of topology discovery or resource status. Although link state routing protocols, such as IS-IS and OSPF, have been used for some time in the IP world to compute destination-based next hops for routes (without routing loops), they are particularly valuable for providing timely topology and network status information in a distributed manner, i.e., at any network node. If resource utilization information is disseminated along with the link status (as done in ATM's PNNI routing protocol), then a very complete picture of network status is available to a network operator for use in planning, provisioning, and operations.",
      "zh-CHS": "现代SDH/SONET传输网络在性能监控（PM）和故障管理（FM）领域的互操作性方面表现出色[7]，[8]。但是，它们在拓扑发现或资源状态方面不进行互操作。尽管链路状态路由协议（如IS-IS和OSPF）在IP世界中已被用于计算基于目的地的路由下一跳（无路由循环），但它们对于以分布式方式（即在任何网络节点上）提供及时的拓扑和网络状态信息特别有价值。如果资源利用率信息与链路状态一起传播（如ATM的PNNI路由协议中所做的），则网络运营商可以获得网络状态的完整图片，用于规划、供应和操作。"
    },
    {
      "indent": 3,
      "text": "The information needed to compute the path a connection will take through a network is important to distribute via the routing protocol. In the TDM case, this information includes, but is not limited to: the available capacity of the network links, the switching and termination capabilities of the nodes and interfaces, and the protection properties of the link. This is what is being proposed in the GMPLS extensions to IP routing protocols [9], [10], [11].",
      "zh-CHS": "计算连接将通过网络的路径所需的信息对于通过路由协议分发非常重要。在TDM情况下，该信息包括但不限于：网络链路的可用容量、节点和接口的交换和终止能力以及链路的保护属性。这就是GMPLS对IP路由协议的扩展[9]、[10]、[11]中提出的内容。"
    },
    {
      "indent": 3,
      "text": "When applying routing to circuit switched networks, it is useful to compare and contrast this situation with the datagram routing case [12]. In the case of routing datagrams, all routes on all nodes must be calculated exactly the same to avoid loops and \"black holes\". In circuit switching, this is not the case since routes are established per circuit and are fixed for that circuit. Hence, unlike the datagram case, routing is not service impacting in the circuit switched case. This is helpful because, to accommodate the optical layer, routing protocols need to be supplemented with new information, as compared to the datagram case. This information is also likely to be used in different ways for implementing different user services. Due to the increase in information transferred in the routing protocol, it may be useful to separate the relatively static parameters concerning a link from those that may be subject to frequent changes. However, the current GMPLS routing extensions [9], [10], [11] do not make such a separation.",
      "zh-CHS": "当将路由应用于电路交换网络时，将这种情况与数据报路由情况进行比较和对比非常有用[12]。在路由数据报的情况下，所有节点上的所有路由计算必须完全相同，以避免循环和“黑洞”。在电路切换中，情况并非如此，因为路由是针对每个电路建立的，并且针对该电路是固定的。因此，与数据报情况不同，在电路交换情况下，路由不会影响服务。这是有帮助的，因为与数据报情况相比，为了适应光学层，路由协议需要补充新的信息。这些信息也可能以不同的方式用于实现不同的用户服务。由于在路由协议中传输的信息的增加，将关于链路的相对静态参数与可能频繁改变的参数分离可能是有用的。然而，当前的GMPLS路由扩展[9]、[10]、[11]没有进行这样的分离。"
    },
    {
      "indent": 3,
      "text": "Indeed, from the carriers' perspective, the up-to-date dissemination of all link properties is essential and desired, and the use of a link-state routing protocol to distribute this information provides timely and efficient delivery. If GMPLS-based networks got to the point that bandwidth updates happen very frequently, it makes sense, from an efficiency point of view, to separate them out for update. This situation is not yet seen in actual networks; however, if GMPLS signaling is put into widespread use then the need could arise.",
      "zh-CHS": "事实上，从运营商的角度来看，所有链路属性的最新传播是必要和需要的，并且使用链路状态路由协议来分发这些信息提供了及时和高效的交付。如果基于GMPLS的网络的带宽更新非常频繁，那么从效率的角度来看，将它们分离出来进行更新是有意义的。这种情况在实际网络中还没有出现；然而，如果GMPLS信号被广泛使用，则可能会出现这种需求。"
    },
    {
      "indent": 0,
      "text": "4.1. Switching Capabilities",
      "section_title": true,
      "zh-CHS": "4.1. 交换能力"
    },
    {
      "indent": 3,
      "text": "The main switching capabilities that characterize an SDH/SONET end system and thus need to be advertised via the link state routing protocol are: the switching granularity, supported forms of concatenation, and the level of transparency.",
      "zh-CHS": "SDH/SONET终端系统的主要交换能力是：交换粒度、支持的连接形式和透明度水平，因此需要通过链路状态路由协议进行宣传。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Switching Granularity",
      "section_title": true,
      "zh-CHS": "4.1.1. 交换粒度"
    },
    {
      "indent": 3,
      "text": "From references [2], [3], and the overview section on SDH/SONET we see that there are a number of different signals that compose the SDH/SONET hierarchies. Those signals that are referenced via a pointer (i.e., the VCs in SDH and the SPEs in SONET) will actually be",
      "zh-CHS": "从参考文献[2]、[3]和SDH/SONET概述部分中，我们可以看到，构成SDH/SONET层次结构的有许多不同的信号。通过指针引用的那些信号（即SDH中的VCs和SONET中的SPE）实际上是"
    },
    {
      "indent": 3,
      "text": "switched within an SDH/SONET network. These signals are subdivided into lower order signals and higher order signals as shown in Table 2.",
      "zh-CHS": "在SDH/SONET网络内交换。这些信号细分为低阶信号和高阶信号，如表2所示。"
    },
    {
      "indent": 3,
      "text": "Table 2. SDH/SONET switched signal groupings.",
      "zh-CHS": "表2。SDH/SONET交换信号分组。"
    },
    {
      "indent": 9,
      "text": "Signal Type SDH SONET",
      "zh-CHS": "信号型SDH SONET"
    },
    {
      "indent": 9,
      "text": "Lower Order VC-11, VC-12, VC-2 VT-1.5 SPE, VT-2 SPE, VT-3 SPE, VT-6 SPE",
      "zh-CHS": "低阶VC-11、VC-12、VC-2 VT-1.5 SPE、VT-2 SPE、VT-3 SPE、VT-6 SPE"
    },
    {
      "indent": 9,
      "text": "Higher VC-3, VC-4 STS-1 SPE, STS-3c SPE Order",
      "zh-CHS": "更高的VC-3、VC-4 STS-1 SPE、STS-3c SPE顺序"
    },
    {
      "indent": 3,
      "text": "Manufacturers today differ in the types of switching capabilities their systems support. Many manufacturers today switch signals starting at VC-4 for SDH or STS-1 for SONET (i.e., down the basic frame) and above (see Section 5.1.2 on concatenation), but they do not switch lower order signals. Some of them only allow the switching of entire aggregates (concatenated or not) of signals such as 16 VC-4s, i.e., a complete STM-16, and nothing finer. Some go down to the VC-3 level for SDH. Finally, some offer highly integrated switches that switch at the VC-3/STS-1 level down to lower order signals such as VC-12s. In order to cover the needs of all manufacturers and operators, GMPLS signaling ([4], [5]) covers both higher order and lower order signals.",
      "zh-CHS": "今天的制造商在其系统支持的交换能力类型上有所不同。如今，许多制造商切换SDH从VC-4开始的信号，或SONET从STS-1开始的信号（即基本帧下）及以上（参见第5.1.2节“级联”），但他们不切换低阶信号。其中一些仅允许切换信号的整个聚合（连接或不连接），如16 VC-4s，即完整的STM-16，没有更精细的。对于SDH，有些降到VC-3级。最后，有些提供高度集成的交换机，可以在VC-3/STS-1级别向下切换到低阶信号，如VC-12s。为了满足所有制造商和运营商的需求，GMPLS信号（[4]、[5]）同时涵盖高阶和低阶信号。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Signal Concatenation Capabilities",
      "section_title": true,
      "zh-CHS": "4.1.2. 信号级联能力"
    },
    {
      "indent": 3,
      "text": "As stated in the SDH/SONET overview, to transport tributary signals with rates in excess of the basic STM-1/STS-1 signal, the VCs/SPEs can be concatenated, i.e., glued together. Different types of concatenations are defined: contiguous standard concatenation, arbitrary concatenation, and virtual concatenation with different rules concerning their size, placement, and binding.",
      "zh-CHS": "如SDH/SONET概述中所述，为了传输速率超过基本STM-1/STS-1信号的支路信号，可以将VCs/SPE串联在一起，即粘合在一起。定义了不同类型的连接：连续标准连接、任意连接和虚拟连接，它们的大小、位置和绑定规则不同。"
    },
    {
      "indent": 3,
      "text": "Standard SONET concatenation allows the concatenation of M x STS-1 signals within an STS-N signal with M <= N, and M = 3, 12, 48, 192, STS-Mc. The STS-Mc notation is shorthand for describing an STS-M signal whose SPEs have been concatenated. The multiplexing procedures for SDH and SONET are given in references [2] and [3], respectively. Constraints are imposed on the size of STS-Mc signals, i.e., they must be a multiple of 3, and on their starting location and interleaving.",
      "zh-CHS": "标准SONET级联允许在一个STS-N信号中串联M x STS-1信号，其中M<=N，M=3,12,48,192，STS Mc。STS Mc表示法是描述其SPE已串联的STS-M信号的简写。参考文献[2]和[3]分别给出了SDH和SONET的复用过程。STS Mc信号的大小受到限制，即它们必须是3的倍数，以及它们的起始位置和交织。"
    },
    {
      "indent": 3,
      "text": "This has the following advantages: (a) restriction to multiples of 3 helps with SDH compatibility (there is no STS-1 equivalent signal in SDH); (b) the restriction to multiples of 3 reduces the number of connection types; (c) the restriction on the placement and interleaving could allow more compact representation of the \"label\";",
      "zh-CHS": "这具有以下优点：（a）限制3的倍数有助于SDH兼容性（SDH中没有STS-1等效信号）；（b） 对3的倍数的限制减少了连接类型的数量；（c） 对放置和交错的限制可以使“标签”的表示更加紧凑；"
    },
    {
      "indent": 3,
      "text": "The major disadvantages of these restrictions are: (a) Limited flexibility in bandwidth assignment (somewhat inhibits finer grained traffic engineering). (b) The lack of flexibility in starting time slots for STS-Mc signals and in their interleaving (where the rest of the signal gets put in terms of STS-1 slot numbers) leads to the requirement for re-grooming (due to bandwidth fragmentation).",
      "zh-CHS": "这些限制的主要缺点是：（a）带宽分配的灵活性有限（在一定程度上抑制了细粒度流量工程）。（b） STS-Mc信号的开始时隙及其交织（信号的其余部分按照STS-1时隙编号放置）缺乏灵活性，导致需要重新整理（由于带宽碎片）。"
    },
    {
      "indent": 3,
      "text": "Due to these disadvantages, some SONET framer manufacturers now support \"flexible\" or arbitrary concatenation. That is, they support concatenation with no restrictions on the size of an STS-Mc (as long as M <= N) and no constraints on the STS-1 timeslots used to convey it, i.e., the signals can use any combination of available time slots.",
      "zh-CHS": "由于这些缺点，一些SONET成帧器制造商现在支持“灵活”或任意连接。也就是说，它们支持级联，对STS Mc的大小没有限制（只要M≤N），对用于传输它的STS-1时隙没有限制，即，信号可以使用可用时隙的任何组合。"
    },
    {
      "indent": 3,
      "text": "Standard and flexible concatenations are network services, while virtual concatenation is an SDH/SONET end-system service approved by the Committee T1 of ANSI [3] and the ITU-T [2]. The essence of this service is to have SDH/SONET end systems \"glue\" together the VCs or SPEs of separate signals, rather than requiring that the signals be carried through the network as a single unit. In one example of virtual concatenation, two end systems supporting this feature could essentially \"inverse multiplex\" two STS-1s into an STS-1-2v for the efficient transport of 100 Mbps Ethernet traffic. Note that this inverse multiplexing process (or virtual concatenation) can be significantly easier to implement with SDH/SONET than packet switched circuits, because ensuring that timing and in-order frame delivery is preserved may be simpler to establish using SDH/SONET, rather than packet switched circuits, where more sophisticated techniques may be needed.",
      "zh-CHS": "标准和灵活连接是网络服务，而虚拟连接是由ANSI[3]的T1委员会和ITU-T[2]批准的SDH/SONET终端系统服务。这项服务的本质是让SDH/SONET终端系统将单独信号的VCs或SPE“粘合”在一起，而不是要求信号作为单个单元通过网络传输。在虚拟连接的一个示例中，支持此功能的两个终端系统基本上可以将两个STS-1“反向多路复用”为一个STS-1-2v，以高效传输100 Mbps以太网流量。注意，使用SDH/SONET比使用分组交换电路更容易实现这种反向复用过程（或虚拟级联），因为使用SDH/SONET比使用分组交换电路更容易确保定时和按序帧传送得到保留，可能需要更复杂的技术。"
    },
    {
      "indent": 3,
      "text": "Since virtual concatenation is provided by end systems, it is compatible with existing SDH/SONET networks. Virtual concatenation is defined for both higher order signals and low order signals. Table 3 shows the nomenclature and capacity for several lower-order virtually concatenated signals contained within different higher-order signals.",
      "zh-CHS": "由于虚拟级联由终端系统提供，因此它与现有SDH/SONET网络兼容。虚级联是为高阶信号和低阶信号定义的。表3显示了包含在不同高阶信号中的几个低阶虚拟级联信号的术语和容量。"
    },
    {
      "indent": 6,
      "text": "Table 3. Capacity of Virtually Concatenated VTn-Xv (9/G.707)",
      "zh-CHS": "表3。虚拟连接VTn Xv的容量（9/G.707）"
    },
    {
      "indent": 18,
      "text": "Carried In X Capacity In steps of",
      "zh-CHS": "以X为单位，以步数进行"
    },
    {
      "indent": 5,
      "text": "VT1.5/       STS-1/VC-3      1 to 28     1600kbit/s to  1600kbit/s\nVC-11-Xv                                 44800kbit/s",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "VT2/         STS-1/VC-3      1 to 21     2176kbit/s to  2176kbit/s\nVC-12-Xv                                 45696kbit/s",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "VT1.5/       STS-3c/VC-4     1 to 64     1600kbit/s to  1600kbit/s\nVC-11-Xv                                 102400kbit/s",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "VT2/         STS-3c/VC-4     1 to 63     2176kbit/s to  2176kbit/s\nVC-12-Xv                                 137088kbit/s",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4.1.3. SDH/SONET Transparency",
      "section_title": true,
      "zh-CHS": "4.1.3. SDH/SONET透明"
    },
    {
      "indent": 3,
      "text": "The purposed of SDH/SONET is to carry its payload signals in a transparent manner. This can include some of the layers of SONET itself. An example of this is a situation where the path overhead can never be touched, since it actually belongs to the client. This was another reason for not coding an explicit label in the SDH/SONET path overhead. It may be useful to transport, multiplex and/or switch lower layers of the SONET signal transparently.",
      "zh-CHS": "SDH/SONET的目的是以透明的方式传输有效负载信号。这可能包括SONET本身的一些层。这方面的一个例子是，路径开销永远无法触及，因为它实际上属于客户机。这是SDH/SONET路径开销中未编码显式标签的另一个原因。透明地传输、复用和/或切换SONET信号的较低层可能是有用的。"
    },
    {
      "indent": 3,
      "text": "As mentioned in the introduction, SONET overhead is broken into three layers: Section, Line, and Path. Each of these layers is concerned with fault and performance monitoring. The Section overhead is primarily concerned with framing, while the Line overhead is primarily concerned with multiplexing and protection. To perform pipe multiplexing (that is, multiplexing of 50 Mbps or 150 Mbps chunks), a SONET network element should be line terminating. However, not all SONET multiplexers/switches perform SONET pointer adjustments on all the STS-1s contained within a higher order SONET signal passing through them. Alternatively, if they perform pointer adjustments, they do not terminate the line overhead. For example, a multiplexer may take four SONET STS-48 signals and multiplex them onto an STS-192 without performing standard line pointer adjustments on the individual STS-1s. This can be looked at as a service since it may be desirable to pass SONET signals, like an STS-12 or STS-48, with some level of transparency through a network and still take advantage of TDM technology. Transparent multiplexing and switching can also be viewed as a constraint, since some multiplexers and switches may not switch with as fine a granularity as others. Table 4 summarizes the levels of SDH/SONET transparency.",
      "zh-CHS": "正如引言中提到的，SONET开销被分为三层：区段、线路和路径。这些层中的每一层都与故障和性能监控有关。区段开销主要与成帧有关，而线路开销主要与多路复用和保护有关。要执行管道多路复用（即，50 Mbps或150 Mbps块的多路复用），SONET网元应为线端接。然而，并非所有SONET多路复用器/开关都对通过它们的高阶SONET信号中包含的所有STS-1执行SONET指针调整。或者，如果它们执行指针调整，则不会终止架空线路。例如，多路复用器可获取四个SONET STS-48信号并将其多路复用到STS-192上，而无需对单个STS-1执行标准线路指针调整。这可以看作是一种服务，因为可能希望通过网络以一定程度的透明度传递SONET信号，如STS-12或STS-48，并且仍然利用TDM技术。透明多路复用和交换也可以被视为一种约束，因为某些多路复用器和交换机的切换粒度可能不如其他多路复用器和交换机那么细。表4总结了SDH/SONET的透明度水平。"
    },
    {
      "indent": 6,
      "text": "Table 4. SDH/SONET transparency types and their properties.",
      "zh-CHS": "表4。SDH/SONET透明类型及其特性。"
    },
    {
      "indent": 6,
      "text": "Transparency Type Comments",
      "zh-CHS": "透明度类型注释"
    },
    {
      "indent": 6,
      "text": "Path Layer (or Line Standard higher order SONET path Terminating) switching. Line overhead is terminated or modified.",
      "zh-CHS": "路径层（或线路标准高阶SONET路径终止）交换。线路架空被终止或修改。"
    },
    {
      "indent": 6,
      "text": "Line Level (or Section Preserves line overhead and switches Terminating) the entire line multiplex as a whole. Section overhead is terminated or modified.",
      "zh-CHS": "线路级（或区段保留线路架空和交换机端接）将整个线路多路复用作为一个整体。区段开销被终止或修改。"
    },
    {
      "indent": 6,
      "text": "Section layer Preserves all section overhead, Basically does not modify/terminate any of the SDH/SONET overhead bits.",
      "zh-CHS": "区段层保留所有区段开销，基本上不修改/终止任何SDH/SONET开销位。"
    },
    {
      "indent": 0,
      "text": "4.2. Protection",
      "section_title": true,
      "zh-CHS": "4.2. 保护"
    },
    {
      "indent": 3,
      "text": "SONET and SDH networks offer a variety of protection options at both the SONET line (SDH multiplex section) and SDH/SONET path level [7], [8]. Standardized SONET line level protection techniques include: Linear 1+1 and linear 1:N automatic protection switching (APS) and both two-fiber and four-fiber bi-directional line switched rings (BLSRs). At the path layer, SONET offers uni-directional path switched ring protection. Likewise, standardized SDH multiplex section protection techniques include linear 1+1 and 1:N automatic p protection switching and both two-fiber and four-fiber bi-directional MS-SPRings (Multiplex Section-Shared Protection Rings).",
      "zh-CHS": "SONET和SDH网络在SONET线路（SDH多路复用部分）和SDH/SONET路径级别提供多种保护选项[7]，[8]。标准化SONET线路级保护技术包括：线性1+1和线性1:N自动保护切换（APS）以及两光纤和四光纤双向线路切换环（BLSR）。在路径层，SONET提供单向路径交换环保护。同样，标准化SDH复用段保护技术包括线性1+1和1:N自动p保护切换以及两个光纤和四个光纤双向MS弹簧（复用段共享保护环）。"
    },
    {
      "indent": 3,
      "text": "At the path layer, SDH offers SNCP (sub-network connection protection) ring protection.",
      "zh-CHS": "在路径层，SDH提供SNCP（子网连接保护）环保护。"
    },
    {
      "indent": 3,
      "text": "Both ring and 1:N line protection also allow for \"extra traffic\" to be carried over the protection line when that line is not being used, i.e., when it is not carrying traffic for a failed working line. These protection methods are summarized in Table 5. It should be noted that these protection methods are completely separate from any GMPLS layer protection or restoration mechanisms.",
      "zh-CHS": "环网和1:N线路保护还允许在未使用该线路时，即未为故障工作线路承载流量时，通过保护线路承载“额外流量”。表5总结了这些保护方法。应注意，这些保护方法与任何GMPLS层保护或恢复机制完全分离。"
    },
    {
      "indent": 6,
      "text": "Table 5. Common SDH/SONET protection mechanisms.",
      "zh-CHS": "表5。常见的SDH/SONET保护机制。"
    },
    {
      "indent": 7,
      "text": "Protection Type Extra Comments Traffic Optionally Supported",
      "zh-CHS": "可选支持的保护类型额外注释流量"
    },
    {
      "indent": 7,
      "text": "1+1 No Requires no coordination Unidirectional between the two ends of the circuit. Dedicated protection line.",
      "zh-CHS": "1+1 No不需要电路两端之间的单向协调。专用保护线。"
    },
    {
      "indent": 7,
      "text": "1+1 Bi- No Coordination via K byte directional protocol. Lines must be consistently configured. Dedicated protection line.",
      "zh-CHS": "1+1双向-不通过K字节定向协议进行协调。线路的配置必须一致。专用保护线。"
    },
    {
      "indent": 7,
      "text": "1:1 Yes Dedicated protection.",
      "zh-CHS": "1:1是专用保护。"
    },
    {
      "indent": 7,
      "text": "1:N Yes One Protection line shared by N working lines",
      "zh-CHS": "1:N是N条工作线共用一条保护线"
    },
    {
      "indent": 7,
      "text": "4F-BLSR (4 Yes Dedicated protection, with fiber bi- alternative ring path. directional line switched ring)",
      "zh-CHS": "4F-BLSR（4是专用保护，带光纤双可选环路。定向线路交换环）"
    },
    {
      "indent": 7,
      "text": "2F-BLSR (2 Yes Dedicated protection, with fiber bi- alternative ring path directional line switched ring)",
      "zh-CHS": "2F-BLSR（2个是专用保护，带光纤双可选环形路径定向线路交换环）"
    },
    {
      "indent": 7,
      "text": "UPSR (uni- No Dedicated protection via directional alternative ring path. path switched Typically used in access ring) networks.",
      "zh-CHS": "UPSR（uni-通过定向备用环路径无专用保护。路径交换通常用于接入环）网络。"
    },
    {
      "indent": 3,
      "text": "It may be desirable to route some connections over lines that support protection of a given type, while others may be routed over unprotected lines, or as \"extra traffic\" over protection lines. Also, to assist in the configuration of these various protection methods, it can be extremely valuable to advertise the link protection attributes in the routing protocol, as is done in the current GMPLS routing protocols. For example, suppose that a 1:N protection group is being configured via two nodes. One must make",
      "zh-CHS": "可能需要在支持给定类型保护的线路上路由一些连接，而其他连接可以在未受保护的线路上路由，或者作为保护线路上的“额外流量”。此外，为了帮助配置这些不同的保护方法，在路由协议中公布链路保护属性是非常有价值的，正如在当前的GMPLS路由协议中所做的那样。例如，假设通过两个节点配置1:N保护组。一个人必须做出决定"
    },
    {
      "indent": 3,
      "text": "sure that the lines are \"numbered the same\" with respect to both ends of the connection, or else the APS (K1/K2 byte) protocol will not correctly operate.",
      "zh-CHS": "确保线路在连接两端“编号相同”，否则APS（K1/K2字节）协议将无法正确运行。"
    },
    {
      "indent": 6,
      "text": "Table 6. Parameters defining protection mechanisms.",
      "zh-CHS": "表6。定义保护机制的参数。"
    },
    {
      "indent": 7,
      "text": "Protection Comments Related Link Information",
      "zh-CHS": "保护注释相关链接信息"
    },
    {
      "indent": 7,
      "text": "Protection Type Indicates which of the protection types delineated in Table 5.",
      "zh-CHS": "保护类型表示表5中描述的保护类型。"
    },
    {
      "indent": 7,
      "text": "Protection Indicates which of several protection Group Id groups (linear or ring) that a node belongs to. Must be unique for all groups that a node participates in",
      "zh-CHS": "保护指示节点所属的几个保护组Id组（线性或环形）中的哪一个。对于节点参与的所有组，必须是唯一的"
    },
    {
      "indent": 7,
      "text": "Working line Important in 1:N case and to differentiate number between working and protection lines",
      "zh-CHS": "工作线在1:N情况下很重要，并区分工作线和保护线的编号"
    },
    {
      "indent": 7,
      "text": "Protection line Used to indicate if the line is a number protection line.",
      "zh-CHS": "保护线用于指示线路是否为数字保护线。"
    },
    {
      "indent": 7,
      "text": "Extra Traffic Yes or No Supported",
      "zh-CHS": "额外流量支持是或否"
    },
    {
      "indent": 7,
      "text": "Layer If this protection parameter is specific to SONET then this parameter is unneeded, otherwise it would indicate the signal layer that the protection is applied.",
      "zh-CHS": "层如果此保护参数特定于SONET，则不需要此参数，否则它将指示应用保护的信号层。"
    },
    {
      "indent": 3,
      "text": "An open issue concerning protection is the extent of information regarding protection that must be disseminated. The contents of Table 6 represent one extreme, while a simple enumerated list (Extra-Traffic/Protection line, Unprotected, Shared (1:N)/Working line, Dedicated (1:1, 1+1)/Working Line, Enhanced (Ring) /Working Line) represents the other.",
      "zh-CHS": "关于保护的一个公开问题是必须传播的保护信息的范围。表6的内容代表一个极端，而简单的枚举列表（额外交通/保护线、无保护、共享（1:N）/工作线、专用（1:1，1+1）/工作线、增强（环形）/工作线）代表另一个极端。"
    },
    {
      "indent": 3,
      "text": "There is also a potential implication for link bundling [13], [15] that is, for each link, the routing protocol could advertise whether that link is a working or protection link and possibly some parameters from Table 6. A possible drawback of this scheme is that the routing protocol would be burdened with advertising properties even for those protection links in the network that could not, in fact, be used for routing working traffic, e.g., dedicated protection links. An alternative method would be to bundle the working and",
      "zh-CHS": "链路捆绑[13]、[15]还有一个潜在的含义，即对于每个链路，路由协议可以公布该链路是工作链路还是保护链路，以及表6中可能的一些参数。该方案的一个可能缺点是，即使对于网络中实际上不能用于路由工作业务的那些保护链路（例如，专用保护链路），路由协议也将承受广告属性的负担。另一种方法是将工作和"
    },
    {
      "indent": 3,
      "text": "protection links together, and advertise the bundle instead. Now, for each bundled link, the protocol would have to advertise the amount of bandwidth available on its working links, as well as the amount of bandwidth available on those protection links within the bundle that were capable of carrying \"extra traffic\". This would reduce the amount of information to be advertised. An issue here would be to decide which types of working and protection links to bundle together. For instance, it might be preferable to bundle working links (and their corresponding protection links) that are \"shared\" protected separately from working links that are \"dedicated\" protected.",
      "zh-CHS": "保护将链接在一起，并代之以发布捆绑包。现在，对于每个捆绑链路，协议必须公布其工作链路上的可用带宽量，以及捆绑内能够承载“额外流量”的保护链路上的可用带宽量。这将减少要发布的信息量。这里的一个问题是决定将哪些类型的工作和保护链接捆绑在一起。例如，最好将受“共享”保护的工作链接（及其相应的保护链接）与受“专用”保护的工作链接分开捆绑。"
    },
    {
      "indent": 0,
      "text": "4.3. Available Capacity Advertisement",
      "section_title": true,
      "zh-CHS": "4.3. 可用容量广告"
    },
    {
      "indent": 3,
      "text": "Each SDH/SONET LSR must maintain an internal table per interface that indicates each signal in the multiplex structure that is allocated at that interface. This internal table is the most complete and accurate view of the link usage and available capacity.",
      "zh-CHS": "每个SDH/SONET LSR必须为每个接口维护一个内部表，该表指示在该接口分配的多路复用结构中的每个信号。此内部表格是链路使用情况和可用容量的最完整、最准确的视图。"
    },
    {
      "indent": 3,
      "text": "For use in path computation, this information needs to be advertised in some way to all other SDH/SONET LSRs in the same domain. There is a trade off to be reached concerning: the amount of detail in the available capacity information to be reported via a link state routing protocol, the frequency or conditions under which this information is updated, the percentage of connection establishments that are unsuccessful on their first attempt due to the granularity of the advertised information, and the extent to which network resources can be optimized. There are different levels of summarization that are being considered today for the available capacity information. At one extreme, all signals that are allocated on an interface could be advertised; while at the other extreme, a single aggregated value of the available bandwidth per link could be advertised.",
      "zh-CHS": "为了在路径计算中使用，需要以某种方式将此信息通告给同一域中的所有其他SDH/SONET LSR。在以下方面需要权衡：通过链路状态路由协议报告的可用容量信息的详细程度、更新此信息的频率或条件，由于广告信息的粒度以及网络资源可以优化的程度，第一次尝试失败的连接建立的百分比。目前正在考虑对可用容量信息进行不同级别的汇总。在一个极端情况下，可以公布在接口上分配的所有信号；而在另一个极端，可以公布每个链路可用带宽的单个聚合值。"
    },
    {
      "indent": 3,
      "text": "Consider first the relatively simple structure of SONET and its most common current and planned usage. DS1s and DS3s are the signals most often carried within a SONET STS-1. Either a single DS3 occupies the STS-1 or up to 28 DS1s (4 each within the 7 VT groups) are carried within the STS-1. With a reasonable VT1.5 placement algorithm within each node, it may be possible to just report on aggregate bandwidth usage in terms of number of whole STS-1s (dedicated to DS3s) used and the number of STS-1s dedicated to carrying DS1s allocated for this purpose. This way, a network optimization program could try to determine the optimal placement of DS3s and DS1s to minimize wasted bandwidth due to half-empty STS-1s at various places within the transport network. Similarly consider the set of super rate SONET signals (STS-Nc). If the links between the two switches support flexible concatenation, then the reporting is particularly",
      "zh-CHS": "首先考虑SONET的相对简单的结构及其最常用的电流和计划用途。DS1和DS3是SONET STS-1中最常携带的信号。单个DS3占用STS-1或STS-1中最多携带28个DS1（7个VT组中各4个）。通过在每个节点内采用合理的VT1.5布局算法，可以根据使用的整个STS-1（专用于DS3）的数量和专用于承载为此目的分配的DS1的STS-1的数量来报告总带宽使用情况。通过这种方式，网络优化程序可以尝试确定DS3和DS1的最佳位置，以最大限度地减少由于传输网络中不同位置的半空STS-1而造成的带宽浪费。同样地考虑一组超速率SONET信号（STS NC）。如果两个交换机之间的链路支持灵活的连接，那么报告尤其重要"
    },
    {
      "indent": 3,
      "text": "straightforward since any of the STS-1s within an STS-M can be used to comprise the transported STS-Nc. However, if only standard concatenation is supported, then reporting gets trickier since there are constraints on where the STS-1s can be placed. SDH has still more options and constraints, hence it is not yet clear which is the best way to advertise bandwidth resource availability/usage in SDH/SONET. At present, the GMPLS routing protocol extensions define minimum and maximum values for available bandwidth, which allows a remote node to make some deductions about the amount of capacity available at a remote link and the types of signals it can accommodate. However, due to the multiplexed nature of the signals, reporting of bandwidth particular to signal types, rather than as a single aggregate bit rate, may be desirable. For details on why this may be the case, we refer the reader to ITU-T publications G.7715.1 [16] and to Chapter 12 of [17].",
      "zh-CHS": "简单，因为STS-M中的任何STS-1都可用于构成传输的STS Nc。然而，如果只支持标准连接，那么报告会变得更加棘手，因为STS-1的放置位置受到限制。SDH还有更多的选择和限制，因此还不清楚哪种方式是在SDH/SONET中公布带宽资源可用性/使用情况的最佳方式。目前，GMPLS路由协议扩展定义了可用带宽的最小值和最大值，这允许远程节点对远程链路的可用容量及其可容纳的信号类型进行一些扣除。然而，由于信号的多路复用性质，可能需要报告特定于信号类型的带宽，而不是作为单个聚合比特率。有关原因的详细信息，请读者参考ITU-T出版物G.7715.1[16]和[17]的第12章。"
    },
    {
      "indent": 0,
      "text": "4.4. Path Computation",
      "section_title": true,
      "zh-CHS": "4.4. 路径计算"
    },
    {
      "indent": 3,
      "text": "Although a link state routing protocol can be used to obtain network topology and resource information, this does not imply the use of an \"open shortest path first\" route [6]. The path must be open in the sense that the links must be capable of supporting the desired signal type and that capacity must be available to carry the signal. Other constraints may include hop count, total delay (mostly propagation), and underlying protection. In addition, it may be desirable to route traffic in order to optimize overall network capacity, or reliability, or some combination of the two. Dikstra's algorithm computes the shortest path with respect to link weights for a single connection at a time. This can be much different than the paths that would be selected in response to a request to set up a batch of connections between a set of endpoints in order to optimize network link utilization. One can think of this along the lines of global or local optimization of the network in time.",
      "zh-CHS": "虽然链路状态路由协议可用于获取网络拓扑和资源信息，但这并不意味着使用“开放最短路径优先”路由[6]。路径必须是开放的，即链路必须能够支持所需的信号类型，并且必须具有承载信号的能力。其他约束可能包括跳数、总延迟（主要是传播）和底层保护。此外，为了优化总体网络容量、可靠性或两者的某种组合，可能需要路由业务。Dikstra的算法一次针对单个连接的链接权重计算最短路径。这可能与响应在一组端点之间建立一批连接以优化网络链路利用率的请求而选择的路径大不相同。人们可以按照网络的全局或局部优化的思路来考虑这一点。"
    },
    {
      "indent": 3,
      "text": "Due to the complexity of some of the connection routing algorithms (high dimensionality, non-linear integer programming problems) and various criteria by which one may optimize a network, it may not be possible or desirable to run these algorithms on network nodes. However, it may still be desirable to have some basic path computation ability running on the network nodes, particularly for use during restoration situations. Such an approach is in line with the use of GMPLS for traffic engineering, but is much different than typical OSPF or IS-IS usage where all nodes must run the same routing algorithm.",
      "zh-CHS": "由于某些连接路由算法（高维、非线性整数规划问题）的复杂性和优化网络的各种标准，在网络节点上运行这些算法可能是不可能的，也不可取的。然而，可能仍然希望在网络节点上运行一些基本的路径计算能力，特别是在恢复情况下使用。这种方法与GMPLS在流量工程中的使用是一致的，但与典型的OSPF或is-is使用有很大不同，在OSPF或is-is使用中，所有节点都必须运行相同的路由算法。"
    },
    {
      "indent": 0,
      "text": "5. LSP Provisioning/Signaling for SDH/SONET",
      "section_title": true,
      "zh-CHS": "5. SDH/SONET的LSP供应/信令"
    },
    {
      "indent": 2,
      "text": "Traditionally, end-to-end circuit connections in SDH/SONET networks have been set up via network management systems (NMSs), which issue commands (usually under the control of a human operator) to the various network elements involved in the circuit, via an equipment vendor's element management system (EMS). Very little multi-vendor interoperability has been achieved via management systems. Hence, end-to-end circuits in a multi-vendor environment typically require the use of multiple management systems and the infamous configuration via \"yellow sticky notes\". As discussed in Section 3, a common signaling protocol -- such as RSVP with TE extensions or CR-LDP -- appropriately extended for circuit switching applications, could therefore help to solve these interoperability problems. In this section, we examine the various components involved in the automated provisioning of SDH/SONET LSPs.",
      "zh-CHS": "传统上，SDH/SONET网络中的端到端电路连接是通过网络管理系统（NMS）建立的，该系统通过设备供应商的元件管理系统（EMS）向电路中涉及的各种网络元件发出命令（通常在人工操作员的控制下）。通过管理系统实现的多供应商互操作性非常少。因此，多供应商环境中的端到端电路通常需要使用多个管理系统，并通过“黄色便笺”进行臭名昭著的配置。如第3节所讨论的，一个通用的信令协议——如带有TE扩展的RSVP或CR-LDP——适当地扩展用于电路交换应用，因此可以帮助解决这些互操作性问题。在本节中，我们将研究SDH/SONET LSP自动供应中涉及的各种组件。"
    },
    {
      "indent": 0,
      "text": "5.1. What Do We Label in SDH/SONET? Frames or Circuits?",
      "section_title": true,
      "zh-CHS": "5.1. 我们在SDH/SONET中标记什么？帧还是电路？"
    },
    {
      "indent": 3,
      "text": "GMPLS was initially introduced to control asynchronous technologies like IP, where a label was attached to each individual block of data, such as an IP packet or a Frame Relay frame. SONET and SDH, however, are synchronous technologies that define a multiplexing structure (see Section 3), which we referred to as the SDH (or SONET) multiplex. This multiplex involves a hierarchy of signals, lower order signals embedded within successive higher order ones (see Fig. 1). Thus, depending on its level in the hierarchy, each signal consists of frames that repeat periodically, with a certain number of byte time slots per frame.",
      "zh-CHS": "GMPLS最初用于控制IP等异步技术，其中每个单独的数据块（如IP数据包或帧中继帧）都附有一个标签。然而，SONET和SDH是定义复用结构的同步技术（见第3节），我们称之为SDH（或SONET）复用。这种多路复用涉及信号的层次结构，低阶信号嵌入到连续的高阶信号中（见图1）。因此，根据其在层次结构中的级别，每个信号由周期性重复的帧组成，每个帧具有一定数量的字节时隙。"
    },
    {
      "indent": 3,
      "text": "The question then arises: is it these frames that we label in GMPLS? It will be seen in what follows that each SONET or SDH \"frame\" need not have its own label, nor is it necessary to switch frames individually. Rather, the unit that is switched is a \"flow\" comprised of a continuous sequence of time slots that appear at a given position in a frame. That is, we switch an individual SONET or SDH signal, and a label associated with each given signal.",
      "zh-CHS": "接下来的问题是：我们在GMPLS中标记的是这些帧吗？从下文中可以看出，每个SONET或SDH“帧”不需要有自己的标签，也不需要单独切换帧。相反，被切换的单元是由出现在帧中给定位置的连续时隙序列组成的“流”。也就是说，我们切换单个SONET或SDH信号，以及与每个给定信号关联的标签。"
    },
    {
      "indent": 3,
      "text": "For instance, the payload of an SDH STM-1 frame does not fully contain a complete unit of user data. In fact, the user data is contained in a virtual container (VC) that is allowed to float over two contiguous frames for synchronization purposes. The H1-H2-H3 Au-n pointer bytes in the SDH overhead indicates the beginning of the VC in the payload. Thus, frames are now inter-related, since each consecutive pair may share a common virtual container. From the point of view of GMPLS, therefore, it is not the successive frames that are treated independently or labeled, but rather the entire user signal. An identical argument applies to SONET.",
      "zh-CHS": "例如，SDH STM-1帧的有效负载不完全包含完整的用户数据单元。事实上，用户数据包含在一个虚拟容器（VC）中，该虚拟容器允许在两个连续帧上浮动以实现同步。SDH开销中的H1-H2-H3 Au-n指针字节表示有效负载中VC的开始。因此，帧现在是相互关联的，因为每个连续对可以共享一个公共虚拟容器。因此，从GMPLS的角度来看，独立处理或标记的不是连续帧，而是整个用户信号。同样的论点也适用于索奈。"
    },
    {
      "indent": 3,
      "text": "Observe also that the GMPLS signaling used to control the SDH/SONET multiplex must honor its hierarchy. In other words, the SDH/SONET layer should not be viewed as homogeneous and flat, because this would limit the scope of the services that SDH/SONET can provide. Instead, GMPLS tunnels should be used to dynamically and hierarchically control the SDH/SONET multiplex. For example, one unstructured VC-4 LSP may be established between two nodes, and later lower order LSPs (e.g., VC-12) may be created within that higher order LSP. This VC-4 LSP can, in fact, be established between two non-adjacent internal nodes in an SDH network, and later advertised by a routing protocol as a new (virtual) link called a Forwarding Adjacency (FA) [14].",
      "zh-CHS": "还要注意，用于控制SDH/SONET多路复用的GMPLS信令必须遵守其层次结构。换句话说，SDH/SONET层不应被视为同质和平坦，因为这将限制SDH/SONET可以提供的服务范围。相反，应使用GMPLS隧道动态和分层地控制SDH/SONET多路复用。例如，可以在两个节点之间建立一个非结构化VC-4 LSP，并且可以在该高阶LSP内创建稍后的低阶LSP（例如VC-12）。实际上，该VC-4 LSP可以在SDH网络中的两个非相邻内部节点之间建立，然后通过路由协议作为称为转发邻接（FA）的新（虚拟）链路进行广告[14]。"
    },
    {
      "indent": 3,
      "text": "An SDH/SONET-LSR will have to identify each possible signal individually per interface to fulfill the GMPLS operations. In order to stay transparent, the LSR obviously should not touch the SDH/SONET overheads; this is why an explicit label is not encoded in the SDH/SONET overheads. Rather, a label is associated with each individual signal. This approach is similar to the one considered for lambda switching, except that it is more complex, since SONET and SDH define a richer multiplexing structure. Therefore, a label is associated with each signal, and is locally unique for each signal at each interface. This signal could, and will most probably, occupy different time-slots at different interfaces.",
      "zh-CHS": "SDH/SONET-LSR必须针对每个接口分别识别每个可能的信号，以完成GMPLS操作。为了保持透明，LSR显然不应接触SDH/SONET开销；这就是SDH/SONET开销中不编码显式标签的原因。相反，标签与每个单独的信号相关联。这种方法与lambda交换所考虑的方法类似，只是更复杂，因为SONET和SDH定义了更丰富的复用结构。因此，标签与每个信号相关联，并且对于每个接口处的每个信号都是本地唯一的。这个信号可能，也很可能，在不同的接口上占据不同的时隙。"
    },
    {
      "indent": 0,
      "text": "5.2. Label Structure in SDH/SONET",
      "section_title": true,
      "zh-CHS": "5.2. SDH/SONET中的标签结构"
    },
    {
      "indent": 3,
      "text": "The signaling protocol used to establish an SDH/SONET LSP must have specific information elements in it to map a label to the particular signal type that it represents, and to the position of that signal in the SDH/SONET multiplex. As we will see shortly, with a carefully chosen label structure, the label itself can be made to function as this information element.",
      "zh-CHS": "用于建立SDH/SONET LSP的信令协议中必须包含特定的信息元素，以便将标签映射到它所表示的特定信号类型以及该信号在SDH/SONET多路复用中的位置。我们将很快看到，通过精心选择的标签结构，标签本身可以作为该信息元素发挥作用。"
    },
    {
      "indent": 3,
      "text": "In general, there are two ways to assign labels for signals between neighboring SDH/SONET LSRs. One way is for the labels to be allocated completely independently of any SDH/SONET semantics; e.g., labels could just be unstructured 16 or 32 bit numbers. In that case, in the absence of appropriate binding information, a label gives no visible information about the flow that it represents. From a management and debugging point of view, therefore, it becomes difficult to match a label with the corresponding signal, since , as we saw in Section 6.1, the label is not coded in the SDH/SONET overhead of the signal.",
      "zh-CHS": "通常，有两种方法为相邻SDH/SONET LSR之间的信号分配标签。一种方法是完全独立于任何SDH/SONET语义分配标签；e、 例如，标签可以是非结构化的16位或32位数字。在这种情况下，如果没有适当的绑定信息，标签就不会给出关于它所表示的流的可见信息。因此，从管理和调试的角度来看，很难将标签与相应的信号进行匹配，因为正如我们在第6.1节中所看到的，标签没有编码在信号的SDH/SONET开销中。"
    },
    {
      "indent": 3,
      "text": "Another way is to use the well-defined and finite structure of the SDH/SONET multiplexing tree to devise a signal numbering scheme that makes use of the multiplex as a naming tree, and assigns each",
      "zh-CHS": "另一种方法是使用SDH/SONET多路复用树的定义良好且有限的结构来设计一种信号编号方案，该方案将多路复用用作命名树，并分配每个树"
    },
    {
      "indent": 3,
      "text": "multiplex entry a unique associated value. This allows the unique identification of each multiplex entry (signal) in terms of its type and position in the multiplex tree. By using this multiplex entry value itself as the label, we automatically add SDH/SONET semantics to the label! Thus, simply by examining the label, one can now directly deduce the signal that it represents, as well as its position in the SDH/SONET multiplex. We refer to this as multiplex-based labeling. This is the idea that was incorporated in the GMPLS signaling specifications for SDH/SONET [15].",
      "zh-CHS": "多路输入一个唯一的关联值。这允许根据其在复用树中的类型和位置对每个复用条目（信号）进行唯一标识。通过使用这个多路复用入口值本身作为标签，我们自动将SDH/SONET语义添加到标签中！因此，只需检查标签，就可以直接推断出它所代表的信号，以及它在SDH/SONET多路复用中的位置。我们称之为基于多路复用的标签。这是纳入SDH/SONET的GMPLS信令规范中的想法[15]。"
    },
    {
      "indent": 0,
      "text": "5.3. Signaling Elements",
      "section_title": true,
      "zh-CHS": "5.3. 信号元件"
    },
    {
      "indent": 3,
      "text": "In the preceding sections, we defined the meaning of an SDH/SONET label and specified its structure. A question that arises naturally at this point is the following. In an LSP or connection setup request, how do we specify the signal for which we want to establish a path (and for which we desire a label)?",
      "zh-CHS": "在前面的章节中，我们定义了SDH/SONET标签的含义并指定了其结构。在这一点上自然产生的一个问题如下。在LSP或连接设置请求中，如何指定要为其建立路径（以及需要标签）的信号？"
    },
    {
      "indent": 3,
      "text": "Clearly, information that is required to completely specify the desired signal and its characteristics must be transferred via the label distribution protocol, so that the switches along the path can be configured to correctly handle and switch the signal. This information is specified in three parts [15], each of which refers to a different network layer.",
      "zh-CHS": "显然，必须通过标签分发协议传输完全指定所需信号及其特性所需的信息，以便可以配置路径上的交换机以正确处理和切换信号。该信息在三个部分[15]中规定，每个部分都指不同的网络层。"
    },
    {
      "indent": 3,
      "text": "1. GENERALIZED_LABEL REQUEST (as in [4], [5]), which contains three parts: LSP Encoding Type, Switching Type, and G-PID.",
      "zh-CHS": "1. 广义_标签请求（如[4]、[5]中所述），它包含三个部分：LSP编码类型、切换类型和G-PID。"
    },
    {
      "indent": 3,
      "text": "The first specifies the nature/type of the LSP or the desired SDH/SONET channel, in terms of the particular signal (or collection of signals) within the SDH/SONET multiplex that the LSP represents, and is used by all the nodes along the path of the LSP.",
      "zh-CHS": "第一种方法根据LSP表示的SDH/SONET多路复用内的特定信号（或信号集合），指定LSP或所需SDH/SONET信道的性质/类型，并由LSP路径上的所有节点使用。"
    },
    {
      "indent": 3,
      "text": "The second specifies certain link selection constraints, which control, at each hop, the selection of the underlying link that is used to transport this LSP.",
      "zh-CHS": "第二个指定某些链路选择约束，这些约束在每个跃点控制用于传输此LSP的基础链路的选择。"
    },
    {
      "indent": 3,
      "text": "The third specifies the payload carried by the LSP or SDH/SONET channel, in terms of the termination and adaptation functions required at the end points, and is used by the source and destination nodes of the LSP.",
      "zh-CHS": "第三个指定LSP或SDH/SONET信道承载的有效载荷，根据端点所需的终止和自适应功能，并由LSP的源节点和目的节点使用。"
    },
    {
      "indent": 3,
      "text": "2. SONET/SDH TRAFFIC_PARAMETERS (as in [15], Section 2.1) used as a SENDER_TSPEC/FLOWSPEC, which contains 7 parts: Signal Type, (Requested Contiguous Concatenation (RCC), Number of Contiguous Components (NCC), Number of Virtual Components (NVC)), Multiplier (MT), Transparency, and Profile.",
      "zh-CHS": "2. SONET/SDH通信量参数（如[15]第2.1节）用作发送方TSPEC/FLOWSPEC，包含7个部分：信号类型（请求的连续级联（RCC）、连续组件数（NCC）、虚拟组件数（NVC））、乘法器（MT）、透明度和配置文件。"
    },
    {
      "indent": 3,
      "text": "The Signal Type indicates the type of elementary signal comprising the LSP, while the remaining fields indicate transforms that can be applied to the basic signal to build the final signal that corresponds to the LSP actually being requested. For instance (see [15] for details):",
      "zh-CHS": "信号类型指示组成LSP的基本信号的类型，而剩余字段指示可应用于基本信号的变换，以构建与实际请求的LSP相对应的最终信号。例如（详见[15]："
    },
    {
      "indent": 6,
      "text": "- Contiguous concatenation (by using the RCC and NCC fields) can be optionally applied on the Elementary Signal, resulting in a contiguously concatenated signal.",
      "zh-CHS": "- 连续级联（通过使用RCC和NCC字段）可以选择性地应用于基本信号，从而产生连续级联信号。"
    },
    {
      "indent": 6,
      "text": "- Then, virtual concatenation (by using the NVC field) can be optionally applied on the Elementary Signal, resulting in a virtually concatenated signal.",
      "zh-CHS": "- 然后，虚拟级联（通过使用NVC字段）可以选择性地应用于基本信号，从而产生虚拟级联信号。"
    },
    {
      "indent": 6,
      "text": "- Third, some transparency (by using the Transparency field) can be optionally specified when requesting a frame as a signal rather than an SPE- or VC-based signal.",
      "zh-CHS": "- 第三，当请求帧作为信号而不是基于SPE或VC的信号时，可以选择指定一些透明度（通过使用透明度字段）。"
    },
    {
      "indent": 6,
      "text": "- Fourth, a multiplication (by using the Multiplier field) can be optionally applied either directly on the Elementary Signal or on the contiguously concatenated signal obtained from the first phase, or on the virtually concatenated signal obtained from the second phase, or on these signals combined with some transparency.",
      "zh-CHS": "- 第四，乘法（通过使用乘法器字段）可以任选地直接应用于基本信号或从第一相位获得的连续级联信号，或应用于从第二相位获得的虚拟级联信号，或应用于结合了某种透明度的这些信号。"
    },
    {
      "indent": 3,
      "text": "Transparency indicates precisely which fields in these overheads must be delivered unmodified at the other end of the LSP. An ingress LSR requesting transparency will pass these overhead fields that must be delivered to the egress LSR without any change. From the ingress and egress LSRs point of views, these fields must be seen as unmodified.",
      "zh-CHS": "透明度精确地指示这些开销中的哪些字段必须在LSP的另一端不经修改地交付。请求透明性的入口LSR将传递这些开销字段，这些开销字段必须在没有任何更改的情况下传递给出口LSR。从入口和出口LSR的角度来看，这些字段必须视为未修改。"
    },
    {
      "indent": 3,
      "text": "Transparency is not applied at the interfaces with the initiating and terminating LSRs, but is only applied between intermediate LSRs.",
      "zh-CHS": "透明度不应用于与起始和终止LSR的接口，而仅应用于中间LSR之间。"
    },
    {
      "indent": 3,
      "text": "The transparency field is used to request an LSP that supports the requested transparency type; it may also be used to setup the transparency process to be applied at each intermediate LSR.",
      "zh-CHS": "透明度字段用于请求支持请求的透明度类型的LSP；它还可用于设置将应用于每个中间LSR的透明度过程。"
    },
    {
      "indent": 3,
      "text": "Finally, the profile field is intended to specify particular capabilities that must be supported for the LSP, for example monitoring capabilities. However, no standard profile is currently defined.",
      "zh-CHS": "最后，profile字段用于指定LSP必须支持的特定功能，例如监控功能。但是，目前没有定义标准配置文件。"
    },
    {
      "indent": 3,
      "text": "3. UPSTREAM_LABEL for Bi-directional LSP's (as in [4], [5]).",
      "zh-CHS": "3. 双向LSP的上游_标签（如[4]，[5]）。"
    },
    {
      "indent": 3,
      "text": "4. Local Link Selection, e.g., IF_ID_RSVP_HOP Object (as in [5]).",
      "zh-CHS": "4. 本地链路选择，例如IF_ID_RSVP_HOP对象（如[5]）。"
    },
    {
      "indent": 0,
      "text": "6. Summary and Conclusions",
      "section_title": true,
      "zh-CHS": "6. 摘要和结论"
    },
    {
      "indent": 3,
      "text": "We provided a detailed account of the issues involved in applying generalized GMPLS-based control (GMPLS) to TDM networks.",
      "zh-CHS": "我们详细介绍了将基于广义GMPLS的控制（GMPLS）应用于TDM网络所涉及的问题。"
    },
    {
      "indent": 3,
      "text": "We began with a brief overview of GMPLS and SDH/SONET networks, discussing current circuit establishment in TDM networks, and arguing why SDH/SONET technologies will not be \"outdated\" in the foreseeable future. Next, we looked at IP/MPLS applied to SDH/SONET networks, where we considered why such an application makes sense, and reviewed some GMPLS terminology as applied to TDM networks.",
      "zh-CHS": "我们首先简要概述了GMPLS和SDH/SONET网络，讨论了TDM网络中当前的电路建立，并论证了为什么SDH/SONET技术在可预见的未来不会“过时”。接下来，我们研究了应用于SDH/SONET网络的IP/MPLS，其中我们考虑了为什么这样的应用有意义，并回顾了一些应用于TDM网络的GMPLS术语。"
    },
    {
      "indent": 3,
      "text": "We considered the two main areas of application of IP/MPLS methods to TDM networks, namely routing and signaling, and discussed how Generalized MPLS routing and signaling are used in the context of TDM networks. We reviewed in detail the switching capabilities of TDM equipment, and the requirement to learn about the protection capabilities of underlying links, and how these influence the available capacity advertisement in TDM networks.",
      "zh-CHS": "我们考虑了IP/MPLS方法在TDM网络中的两个主要应用领域，即路由和信令，并讨论了如何在TDM网络中使用广义MPLS路由和信令。我们详细回顾了TDM设备的交换能力，以及了解底层链路保护能力的要求，以及这些能力如何影响TDM网络中的可用容量广告。"
    },
    {
      "indent": 3,
      "text": "We focused briefly on path computation methods, pointing out that these were not subject to standardization. We then examined optical path provisioning or signaling, considering the issue of what constitutes an appropriate label for TDM circuits and how this label should be structured; and we focused on the importance of hierarchical label allocation in a TDM network. Finally, we reviewed the signaling elements involved when setting up a TDM circuit, focusing on the nature of the LSP, the type of payload it carries, and the characteristics of the links that the LSP wishes to use at each hop along its path for achieving a certain reliability.",
      "zh-CHS": "我们简要介绍了路径计算方法，指出这些方法不需要标准化。然后，我们研究了光路供应或信令，考虑了什么构成TDM电路的适当标签以及该标签应如何构造的问题；我们重点讨论了分层标签分配在TDM网络中的重要性。最后，我们回顾了设置TDM电路时涉及的信令元素，重点是LSP的性质、承载的有效负载类型以及LSP希望在其路径上的每个跃点处使用的链路的特性，以实现一定的可靠性。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The use of a control plane to provision connectivity through a SONET/SDH network shifts the security burden significantly from the management plane to the control plane. Before the introduction of a control plane, the communications that had to be secured were between the management stations (Element Management Systems or Network Management Systems) and each network element that participated in the network connection. After the introduction of the control plane, the only management plane communication that needs to be secured is that to the head-end (ingress) network node as the end-to-end service is requested. On the other hand, the control plane introduces a new requirement to secure signaling and routing communications between adjacent nodes in the network plane.",
      "zh-CHS": "使用控制平面通过SONET/SDH网络提供连接将安全负担从管理平面显著转移到控制平面。在引入控制平面之前，必须确保管理站（网元管理系统或网络管理系统）与参与网络连接的每个网元之间的通信安全。引入控制平面后，需要保护的唯一管理平面通信是在请求端到端服务时与前端（入口）网络节点的通信。另一方面，控制平面对网络平面中相邻节点之间的安全信令和路由通信提出了新的要求。"
    },
    {
      "indent": 3,
      "text": "The security risk from impersonated management stations is significantly reduced by the use of a control plane. In particular, where unsecure versions of network management protocols such as SNMP versions 1 and 2 were popular configuration tools in transport networks, the use of a control plane may significantly reduce the security risk of malicious and false assignment of network resources that could cause the interception or disruption of data traffic.",
      "zh-CHS": "通过使用控制平面，模拟管理站的安全风险显著降低。特别是，如果网络管理协议的不安全版本（如SNMP版本1和2）是传输网络中流行的配置工具，则使用控制平面可以显著降低恶意和错误分配网络资源的安全风险，这可能会导致数据通信的截获或中断。"
    },
    {
      "indent": 3,
      "text": "On the other hand, the control plane may increase the number of security relationships that each network node must maintain. Instead of a single security relationship with its management element, each network node must now maintain a security relationship with each of its signaling and routing neighbors in the control plane.",
      "zh-CHS": "另一方面，控制平面可以增加每个网络节点必须维护的安全关系的数量。每个网络节点现在必须与控制平面中的每个信令和路由邻居保持安全关系，而不是与其管理元素的单一安全关系。"
    },
    {
      "indent": 3,
      "text": "There is a strong requirement for signaling and control plane exchanges to be secured, and any protocols proposed for this purpose must be capable of secure message exchanges. This is already the case for the existing GMPLS routing and signaling protocols.",
      "zh-CHS": "对信令和控制平面交换的安全性有着强烈的要求，为此目的提出的任何协议都必须能够进行安全的消息交换。现有的GMPLS路由和信令协议已经是这样了。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "We acknowledge all the participants of the MPLS and CCAMP WGs, whose constant enquiry about GMPLS issues in TDM networks motivated the writing of this document, and whose questions helped shape its contents. Also, thanks to Kireeti Kompella for his careful reading of the last version of this document, and for his helpful comments and feedback, and to Dimitri Papadimitriou for his review on behalf of the Routing Area Directorate, which provided many useful inputs to help update the document to conform to the standards evolutions since this document passed last call.",
      "zh-CHS": "我们感谢MPLS和CCAMP工作组的所有参与者，他们对TDM网络中GMPLS问题的不断询问推动了本文件的编写，他们的问题帮助形成了本文件的内容。此外，感谢Kireeti Kompella仔细阅读了本文件的最后一个版本，并提供了有益的意见和反馈，感谢Dimitri Papadimitriou代表路由区董事会进行审查，它提供了许多有用的输入，以帮助更新文档，使其符合自该文档通过上次调用以来的标准演变。"
    },
    {
      "indent": 0,
      "text": "9. Informative References",
      "section_title": true,
      "zh-CHS": "9. 资料性引用"
    },
    {
      "indent": 3,
      "text": "In the ITU references below, please see http://www.itu.int for availability of ITU documents. For ANSI references, please see the Library available through http://www.ansi.org.",
      "zh-CHS": "在下面的ITU参考资料中，请参见http://www.itu.int 提供国际电联文件。有关ANSI参考，请参阅通过提供的库http://www.ansi.org."
    },
    {
      "indent": 3,
      "text": "[1] Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, January 2001.",
      "zh-CHS": "[1] Rosen，E.，Viswanathan，A.，和R.Callon，“多协议标签交换体系结构”，RFC 30312001年1月。"
    },
    {
      "indent": 3,
      "text": "[2] G.707, Network Node Interface for the Synchronous Digital Hierarchy (SDH), International Telecommunication Union, March 1996.",
      "zh-CHS": "[2] G.707，《同步数字体系（SDH）的网络节点接口》，国际电信联盟，1996年3月。"
    },
    {
      "indent": 3,
      "text": "[3] ANSI T1.105-1995, Synchronous Optical Network (SONET) Basic Description including Multiplex Structure, Rates, and Formats, American National Standards Institute.",
      "zh-CHS": "[3] ANSI T1.105-1995，同步光网络（SONET）基本说明，包括多路复用结构、速率和格式，美国国家标准协会。"
    },
    {
      "indent": 3,
      "text": "[4] Berger, L., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, January 2003.",
      "zh-CHS": "[4] Berger，L.，“通用多协议标签交换（GMPLS）信令功能描述”，RFC 3471，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[5] Berger, L., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003.",
      "zh-CHS": "[5] Berger，L.，“通用多协议标签交换（GMPLS）信令资源预留协议流量工程（RSVP-TE）扩展”，RFC 3473，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Bernstein, G., Yates, J., Saha, D., \"IP-Centric Control and Management of Optical Transport Networks,\" IEEE Communications Mag., Vol. 40, Issue 10, October 2000.",
      "zh-CHS": "[6] Bernstein，G.，Yates，J.，Saha，D.，“以IP为中心的光传输网络控制和管理”，《IEEE通信杂志》，第40卷，第10期，2000年10月。"
    },
    {
      "indent": 3,
      "text": "[7] ANSI T1.105.01-1995, Synchronous Optical Network (SONET) Automatic Protection Switching, American National Standards Institute.",
      "zh-CHS": "[7] ANSI T1.105.01-1995，同步光网络（SONET）自动保护切换，美国国家标准协会。"
    },
    {
      "indent": 3,
      "text": "[8] G.841, Types and Characteristics of SDH Network Protection Architectures, ITU-T, July 1995.",
      "zh-CHS": "[8] G.841，《SDH网络保护体系结构的类型和特点》，ITU-T，1995年7月。"
    },
    {
      "indent": 3,
      "text": "[9] Kompella, K., Ed. and Y. Rekhter, Ed., \"Routing Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4202, October 2005.",
      "zh-CHS": "[9] Kompella，K.，Ed.和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的路由扩展”，RFC 4202，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[10] Kompella, K., Ed. and Y. Rekhter, Ed., \"OSPF Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4203, October 2005.",
      "zh-CHS": "[10] Kompella，K.，Ed.和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的OSPF扩展”，RFC 4203，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[11] Kompella, K., Ed. and Y. Rekhter, Ed., \"Intermediate System to Intermediate System (IS-IS) Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4205, October 2005.",
      "zh-CHS": "[11] Kompella，K.，Ed.和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的中间系统到中间系统（IS-IS）扩展”，RFC 4205，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[12] Bernstein, G., Sharma, V., Ong, L., \"Inter-domain Optical Routing,\" OSA J. of Optical Networking, vol. 1, no. 2, pp. 80- 92.",
      "zh-CHS": "[12] Bernstein，G.，Sharma，V.，Ong，L.，“域间光路由”，光网络OSA J.第1卷，第2期，第80-92页。"
    },
    {
      "indent": 3,
      "text": "[13] Kompella, K., Rekhter, Y. and L. Berger, \"Link Bundling in MPLS Traffic Engineering (TE)\", RFC 4201, October 2005.",
      "zh-CHS": "[13] Kompella，K.，Rekhter，Y.和L.Berger，“MPLS流量工程（TE）中的链路捆绑”，RFC 42012005年10月。"
    },
    {
      "indent": 3,
      "text": "[14] Kompella, K. and Y. Rekhter, \"Label Switched Paths (LSP) Hierarchy with Generalized Multi-Protocol Label Switching (GMPLS) Traffic Engineering (TE)\", RFC 4206, October 2005.",
      "zh-CHS": "[14] Kompella，K.和Y.Rekhter，“具有通用多协议标签交换（GMPLS）流量工程（TE）的标签交换路径（LSP）层次结构”，RFC 4206，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[15] Mannie, E. and D. Papadimitriou, \"Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control\", RFC 3946, October 2004.",
      "zh-CHS": "[15] Mannie，E.和D.Papadimitriou，“同步光网络（SONET）和同步数字体系（SDH）控制的通用多协议标签交换（GMPLS）扩展”，RFC 3946，2004年10月。"
    },
    {
      "indent": 3,
      "text": "[16] G.7715.1, ASON Routing Architecture and Requirements for Link-State Protocols, International Telecommunications Union, February 2004.",
      "zh-CHS": "[16] G.7715.1，《ASON路由体系结构和链路状态协议要求》，国际电信联盟，2004年2月。"
    },
    {
      "indent": 3,
      "text": "[17] Bernstein, G., Rajagopalan, R., and Saha, D., \"Optical Network Control: Protocols, Architectures, and Standards,\" Addison-Wesley, July 2003.",
      "zh-CHS": "[17] Bernstein，G.，Rajagopalan，R.，和Saha，D.，“光网络控制：协议，架构和标准”，Addison-Wesley，2003年7月。"
    },
    {
      "indent": 0,
      "text": "10. Acronyms",
      "section_title": true,
      "zh-CHS": "10. 缩略词"
    },
    {
      "indent": 3,
      "text": "ANSI - American National Standards Institute APS - Automatic Protection Switching ATM - Asynchronous Transfer Mode BLSR - Bi-directional Line Switch Ring CPE - Customer Premise Equipment DLCI - Data Link Connection Identifier ETSI - European Telecommunication Standards Institute FEC - Forwarding Equivalency Class GMPLS - Generalized MPLS IP - Internet Protocol IS-IS - Intermediate System to Intermediate System (RP) LDP - Label Distribution Protocol LSP - Label Switched Path LSR - Label Switching Router MPLS - Multi-Protocol Label Switching NMS - Network Management System OSPF - Open Shortest Path First (RP) PNNI - Private Network Node Interface PPP - Point to Point Protocol QoS - Quality of Service RP - Routing Protocol RSVP - ReSerVation Protocol SDH - Synchronous Digital Hierarchy SNMP - Simple Network Management Protocol SONET - Synchronous Optical NETworking SPE - SONET Payload Envelope STM - Synchronous Transport Module (or Terminal Multiplexer) STS - Synchronous Transport Signal TDM - Time Division Multiplexer TE - Traffic Engineering TMN - Telecommunication Management Network UPSR - Uni-directional Path Switch Ring VC - Virtual Container (SDH) or Virtual Circuit VCI - Virtual Circuit Identifier (ATM) VPI - Virtual Path Identifier (ATM) VT - Virtual Tributary WDM - Wavelength-Division Multiplexing",
      "zh-CHS": "ANSI-美国国家标准协会APS-自动保护交换ATM-异步传输模式BLSR-双向线路交换环CPE-客户场所设备DLCI-数据链路连接标识符ETSI-欧洲电信标准协会FEC-转发等效等级GMPLS-通用MPLS IP-互联网协议IS-IS-中间系统到中间系统（RP）LDP-标签分发协议LSP-标签交换路径LSR-标签交换路由器MPLS-多协议标签交换NMS-网络管理系统OSPF-开放最短路径优先（RP）PNNI-专用网络节点接口PPP-点对点协议QoS-服务质量RP-路由协议RSVP-预留协议SDH-同步数字体系SNMP-简单网络管理协议SONET-同步光网络SPE-SONET有效载荷信封STM-同步传输模块（或终端多路复用器）STS-同步传输信号TDM-时分复用器TE-流量工程TMN-电信管理网络UPSR-单向路径交换环VC-虚拟容器（SDH）或虚拟电路VCI-虚拟电路标识符（ATM）VPI-虚拟路径标识符（ATM）VT-虚拟支路WDM-波分复用"
    },
    {
      "indent": 0,
      "text": "Author's Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Greg Bernstein Grotto Networking",
      "zh-CHS": "格雷格·伯恩斯坦洞穴网络"
    },
    {
      "indent": 3,
      "text": "Phone: +1 510 573-2237\nEMail: gregb@grotto-networking.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Eric Mannie Perceval Rue Tenbosch, 9 1000 Brussels Belgium",
      "zh-CHS": "Eric Mannie Perceval Rue Tenbosch，9 1000比利时布鲁塞尔"
    },
    {
      "indent": 3,
      "text": "Phone: +32-2-6409194\nEMail: eric.mannie@perceval.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Vishal Sharma Metanoia, Inc. 888 Villa Street, Suite 500 Mountain View, CA 94041",
      "zh-CHS": "Vishal Sharma Metanoia，Inc.加利福尼亚州山景城别墅街888号500室，邮编94041"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 641 0082\nEmail: v.sharma@ieee.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Eric Gray Marconi Corporation, plc 900 Chelmsford Street Lowell, MA 01851 USA",
      "zh-CHS": "埃里克·格雷·马可尼公司，美国马萨诸塞州洛厄尔切姆斯福德街900号，邮编01851"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 275 7470\nEMail: Eric.Gray@Marconi.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}