{
  "title": {
    "text": "RFC 4994: DHCPv6 Relay Agent Echo Request Option",
    "zh-CHS": "RFC 4994"
  },
  "number": 4994,
  "created_at": "2021-11-15 20:51:12.317658+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            S. Zeng\nRequest for Comments: 4994                                       B. Volz\nCategory: Standards Track                                     K. Kinnear\n                                                     Cisco Systems, Inc.\n                                                           J. Brzozowski\n                                                           Comcast Cable\n                                                          September 2007",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "DHCPv6 Relay Agent Echo Request Option",
      "zh-CHS": "DHCPv6中继代理回显请求选项"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a Relay Agent Echo Request option for the Dynamic Host Configuration Protocol for IPv6 (DHCPv6). The option allows a DHCPv6 relay agent to request a list of relay agent options that the server echoes back to the relay agent.",
      "zh-CHS": "此备忘录为IPv6（DHCPv6）的动态主机配置协议定义了中继代理回显请求选项。该选项允许DHCPv6中继代理请求服务器向中继代理回显的中继代理选项列表。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Requirements Terminology ........................................2\n3. The Relay Agent Echo Request Option .............................2\n4. DHCPv6 Relay Agent Behavior .....................................3\n5. DHCPv6 Server Behavior ..........................................3\n6. Security Considerations .........................................4\n7. IANA Considerations .............................................4\n8. Acknowledgements ................................................4\n9. References ......................................................4\n   9.1. Normative References .......................................4\n   9.2. Informative References .....................................4",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "DHCPv6 [2] provides a framework for configuring IPv6 clients with addresses and other network parameters. It includes a relay agent capability. A relay agent is an intermediary node that delivers DHCP messages between clients and servers. The relay agent and the server exchange information using options in relay agent messages. The relay agent may add relay agent options to the client DHCP message before forwarding it.",
      "zh-CHS": "DHCPv6[2]提供了一个框架，用于使用地址和其他网络参数配置IPv6客户端。它包括中继代理功能。中继代理是在客户端和服务器之间传递DHCP消息的中间节点。中继代理和服务器使用中继代理消息中的选项交换信息。中继代理可以在转发客户端DHCP消息之前向其添加中继代理选项。"
    },
    {
      "indent": 3,
      "text": "The information that relay agents supply can be used in the server's decision making about the addresses, delegated prefixes, and configuration parameters that the client is to receive. Likewise, the relay may need some of the information to efficiently return replies to clients.",
      "zh-CHS": "中继代理提供的信息可用于服务器关于客户端将接收的地址、委派前缀和配置参数的决策。同样，中继可能需要一些信息来有效地向客户端返回回复。"
    },
    {
      "indent": 3,
      "text": "In DHCPv4, the server generally echoes the relay agent option back verbatim to the relay agent in server-to-client replies [3]. However, DHCPv6 [2] does not require the server to do so. This could be problematic, as the relay agent may need to use some relay options even if the server does not recognize them.",
      "zh-CHS": "在DHCPv4中，服务器通常会将中继代理选项逐字地回显到服务器到客户端答复中的中继代理[3]。但是，DHCPv6[2]不要求服务器这样做。这可能会有问题，因为中继代理可能需要使用某些中继选项，即使服务器无法识别它们。"
    },
    {
      "indent": 3,
      "text": "This memo defines a relay agent echo request option that the relay agent uses to explicitly request a list of options that the server echoes back to the relay agent.",
      "zh-CHS": "此备忘录定义中继代理回显请求选项，中继代理使用该选项显式请求服务器回显到中继代理的选项列表。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Terminology",
      "section_title": true,
      "zh-CHS": "2. 需求术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [1].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[1]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. The Relay Agent Echo Request Option",
      "section_title": true,
      "zh-CHS": "3. 中继代理回显请求选项"
    },
    {
      "indent": 3,
      "text": "The relay agent adds options in the Relay Forward message that the server uses to guide its decision making with regard to address assignment, prefix delegation, and configuration parameters. The relay agent also knows which of these options that it will need to efficiently return replies to the client. It uses the relay agent Echo Request option to inform the server of the list of relay agent options that the server must echo back.",
      "zh-CHS": "中继代理在中继转发消息中添加选项，服务器使用这些选项指导其关于地址分配、前缀委派和配置参数的决策。中继代理还知道它将需要哪些选项来有效地向客户端返回回复。它使用中继代理回显请求选项通知服务器服务器必须回显的中继代理选项列表。"
    },
    {
      "indent": 3,
      "text": "The format of the DHCPv6 Relay Agent Echo Request option is shown below:",
      "zh-CHS": "DHCPv6中继代理回显请求选项的格式如下所示："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           OPTION_ERO          |           option-len          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    requested-option-code-1    |    requested-option-code-2    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "option-code OPTION_ERO (43). option-len 2 * number of requested options. requested-option-code-n The option code for an option requested by the relay agent.",
      "zh-CHS": "选项代码选项（43）。选项len 2*请求的选项数。requested-option-code-n中继代理请求的选项的选项代码。"
    },
    {
      "indent": 0,
      "text": "4. DHCPv6 Relay Agent Behavior",
      "section_title": true,
      "zh-CHS": "4. DHCPv6中继代理行为"
    },
    {
      "indent": 3,
      "text": "A relay agent MAY include an Echo Request option in a Relay Forward message to inform the server about options the relay agent wants the server to echo back to the relay agent. If the relay agent takes different actions based on whether an option is echoed back or not, then the relay agent SHOULD NOT include such an option in the Echo Request option. Note that the relay uses the OPTION_ORO [2] to request the server to return options (e.g., [4]) other than relay agent options in the Relay Forward message.",
      "zh-CHS": "中继代理可以在中继转发消息中包括回显请求选项，以通知服务器中继代理希望服务器回显到中继代理的选项。如果中继代理根据选项是否回显而采取不同的操作，则中继代理不应在回显请求选项中包含此类选项。注意，中继使用选项_ORO[2]请求服务器返回中继转发消息中中继代理选项以外的选项（例如，[4]）。"
    },
    {
      "indent": 0,
      "text": "5. DHCPv6 Server Behavior",
      "section_title": true,
      "zh-CHS": "5. DHCPv6服务器行为"
    },
    {
      "indent": 3,
      "text": "When a server creates a Relay-Reply, it SHOULD perform ERO processing after processing the ORO and other options processing. For each option in the ERO:",
      "zh-CHS": "当服务器创建中继应答时，它应该在处理ORO和其他选项处理之后执行ERO处理。对于ERO中的每个选项："
    },
    {
      "indent": 3,
      "text": "a. If the option is already in the Relay-Reply, the server MUST ignore that option and continue to process any remaining options in the ERO.",
      "zh-CHS": "a. 如果该选项已在中继应答中，则服务器必须忽略该选项并继续处理ERO中的任何剩余选项。"
    },
    {
      "indent": 3,
      "text": "b. If the option was not in the received Relay-Forward, the server MUST ignore that option and continue to process any remaining options in the ERO.",
      "zh-CHS": "b. 如果该选项不在接收到的中继转发中，服务器必须忽略该选项并继续处理ERO中的任何剩余选项。"
    },
    {
      "indent": 3,
      "text": "c. Otherwise, the server MUST copy the option, verbatim, from the received Relay-Forward to the Relay-Reply, even if the server does not otherwise recognize that option.",
      "zh-CHS": "c. 否则，服务器必须将选项逐字复制从接收到的中继转发到中继应答，即使服务器无法识别该选项。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "As the Echo Request option is only exchanged between relay agents and DHCPv6 servers, section 21.1 of [2] provides details on securing DHCPv6 messages sent between servers and relay agents. And, section 23 of [2] provides general DHCPv6 security considerations.",
      "zh-CHS": "由于回送请求选项仅在中继代理和DHCPv6服务器之间交换，因此[2]的第21.1节提供了有关保护服务器和中继代理之间发送的DHCPv6消息的详细信息。[2]第23节提供了DHCPv6的一般安全注意事项。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a DHCPv6 option code for the OPTION_ERO (Relay Agent Echo Request) Option (43).",
      "zh-CHS": "IANA已为选项（中继代理回送请求）选项（43）分配了DHCPv6选项代码。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "Thanks to Ralph Droms, Josh Littlefield, Richard Johnson, and Hemant Singh for their consistent input, ideas, and review during the production of this document.",
      "zh-CHS": "感谢拉尔夫·德罗姆斯、乔什·利特菲尔德、理查德·约翰逊和赫曼特·辛格在本文件制作过程中始终如一的投入、想法和评论。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, July 2003.",
      "zh-CHS": "[2] Droms，R.，Bound，J.，Volz，B.，Lemon，T.，Perkins，C.，和M.Carney，“IPv6的动态主机配置协议（DHCPv6）”，RFC3315，2003年7月。"
    },
    {
      "indent": 3,
      "text": "[3] Patrick, M., \"DHCP Relay Agent Information Option\", RFC 3046, January 2001.",
      "zh-CHS": "[3] Patrick，M.，“DHCP中继代理信息选项”，RFC 3046，2001年1月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[4] Droms, R., Volz, B., and O. Troan, \"DHCPv6 Relay Agent Assignment Notification (RAAN) Option\", Work in Progress, November 2006.",
      "zh-CHS": "[4] Droms，R.，Volz，B.，和O.Troan，“DHCPv6中继代理分配通知（RAAN）选项”，正在进行的工作，2006年11月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Shengyou Zeng Cisco Systems, Inc. 1414 Massachusetts Ave. Boxborough, MA 01719 USA",
      "zh-CHS": "盛友曾思科系统有限公司，美国马萨诸塞州博克斯堡马萨诸塞大道1414号，邮编01719"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 936 0000\nEMail: szeng@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Bernard Volz Cisco Systems, Inc. 1414 Massachusetts Ave. Boxborough, MA 01719 USA",
      "zh-CHS": "伯纳德·沃兹思科系统公司，美国马萨诸塞州博克斯伯勒马萨诸塞大道1414号，邮编01719"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 936 0000\nEMail: volz@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Kim Kinnear Cisco Systems, Inc. 1414 Massachusetts Ave. Boxborough, MA 01719 USA",
      "zh-CHS": "Kim Kinnear Cisco Systems，Inc.美国马萨诸塞州博克斯堡大道1414号，邮编01719"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 936 0000\nEMail: kkinnear@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "John Jason Brzozowski Comcast Cable 1800 Bishops Gate Boulevard Mt. Laurel, NJ 08054 USA",
      "zh-CHS": "美国新泽西州劳雷尔山主教门大道1800号John Jason Brzowski Comcast电缆，邮编：08054"
    },
    {
      "indent": 3,
      "text": "Phone: +1 856 324 2671\nEMail: john_brzozowski@cable.comcast.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    }
  ]
}