{
  "title": {
    "text": "RFC 4041: Requirements for Morality Sections in Routing Area Drafts",
    "zh-CHS": "RFC 4041"
  },
  "number": 4041,
  "created_at": "2021-11-12 15:36:05.859268+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          A. Farrel\nRequest for Comments: 4041                            Old Dog Consulting\nCategory: Informational                                     1 April 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Requirements for Morality Sections in Routing Area Drafts",
      "zh-CHS": "路由区域草稿中各部分的要求"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "It has often been the case that morality has not been given proper consideration in the design and specification of protocols produced within the Routing Area. This has led to a decline in the moral values within the Internet and attempts to retrofit a suitable moral code to implemented and deployed protocols has been shown to be sub-optimal.",
      "zh-CHS": "在路由领域内产生的协议的设计和规范中，道德往往没有得到适当的考虑。这导致了互联网中道德价值观的下降，而为实施和部署的协议修改合适道德规范的尝试被证明是次优的。"
    },
    {
      "indent": 3,
      "text": "This document specifies a requirement for all new Routing Area Internet-Drafts to include a \"Morality Considerations\" section, and gives guidance on what that section should contain.",
      "zh-CHS": "本文件规定了所有新的路由区域互联网草案必须包含“道德考虑”部分的要求，并就该部分应包含的内容提供了指导。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "It is well accepted by popular opinion and other reliable metrics that moral values are declining and that degeneracy is increasing. Young people are particularly at risk from the rising depravity in society and much of the blame can be squarely placed at the door of the Internet. If you do not feel safe on the streets at night, what do you think it is like on the Information Superhighway?",
      "zh-CHS": "大众观点和其他可靠的衡量标准普遍认为，道德价值正在下降，而退化正在增加。年轻人尤其面临社会日益堕落的危险，许多责任可以直接归咎于互联网。如果你晚上在街上感到不安全，你认为在信息高速公路上会是什么样子？"
    },
    {
      "indent": 3,
      "text": "When new protocols or protocol extensions are developed within the Routing Area, it is often the case that not enough consideration is given to the impact of the protocol on the moral fiber of the Internet. The result is that moral consequences are only understood once the protocols have been implemented, and sometimes not until after they have been deployed.",
      "zh-CHS": "当在路由区域内开发新的协议或协议扩展时，通常没有充分考虑协议对Internet道德光纤的影响。其结果是，道德后果只有在协议实施后才被理解，有时直到协议部署后才被理解。"
    },
    {
      "indent": 3,
      "text": "The resultant attempts to restore appropriate behavior and purge the community of improper activities are not always easy or architecturally pleasant. Further, it is possible that certain protocol designs make morality particularly hard to achieve.",
      "zh-CHS": "由此产生的恢复适当行为和清除社区中不适当活动的尝试并不总是容易或在架构上令人愉快的。此外，某些协议设计可能使道德特别难以实现。"
    },
    {
      "indent": 3,
      "text": "Recognising that moral issues are fundamental to the utility and success of protocols designed within the IETF, and that simply making a wishy-washy liberal-minded statement does not necessarily provide adequate guarantees of a correct and proper outcome for society, this document defines requirements for the inclusion of Morality Considerations sections in all Internet-Drafts produced within the Routing Area. Meeting these requirements will ensure that proper consideration is given to moral issues at all stages of the protocol development process, from Requirements and Architecture, through Specification and Applicability.",
      "zh-CHS": "认识到道德问题对于IETF内设计的协议的实用性和成功性至关重要，并且简单地发表一个轻率的自由思想声明并不一定能为社会提供正确和适当结果的充分保证，本文件规定了在路由区域内生成的所有互联网草案中包含道德考虑部分的要求。满足这些要求将确保在协议开发过程的所有阶段，从需求和体系结构到规范和适用性，适当考虑道德问题。"
    },
    {
      "indent": 3,
      "text": "The remainder of this document describes the necessary subsections of the Morality Considerations sections, and gives guidance about what information should be contained in those subsections.",
      "zh-CHS": "本文件的其余部分描述了道德考虑部分的必要小节，并就这些小节应包含哪些信息提供了指导。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "The key words \"SHALT\", \"SHALT NOT\", \"SMITE\", and \"PILLAR OF SALT\" in this document are to be interpreted as expected.",
      "zh-CHS": "本文件中的关键词“应”、“不应”、“重击”和“盐柱”应按预期进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Presence and Placement of Morality Considerations Sections",
      "section_title": true,
      "zh-CHS": "2. 道德考虑部分的存在和放置"
    },
    {
      "indent": 0,
      "text": "2.1. Null Morality Considerations Sections",
      "section_title": true,
      "zh-CHS": "2.1. 零道德考虑部分"
    },
    {
      "indent": 3,
      "text": "It may be the case that the authors of Internet-Drafts have no or few morals. This does not relieve them of their duty to understand the consequences of their actions.",
      "zh-CHS": "网络草稿的作者可能没有道德，或者道德水平很低。这并不能免除他们理解其行为后果的责任。"
    },
    {
      "indent": 3,
      "text": "The more likely an author is to say that a null Morality Considerations section is acceptable, the more pressure must be exerted on him by the Area and the appropriate Working Group to ensure that he gives full consideration to his actions, and reflects long and hard on the consequences of his writing and the value of his life.",
      "zh-CHS": "作者越有可能说一个无效的道德考虑部分是可以接受的，该地区和适当的工作组就必须对他施加更多的压力，以确保他充分考虑自己的行为，并对自己写作的后果和生命的价值进行长期而艰苦的思考。"
    },
    {
      "indent": 3,
      "text": "On the other hand, some authors are well known to have the highest moral pedigree: a fact that is plainly obvious from the company they keep, the Working Groups they attend, and their eligibility for NomCom. It is clearly unnecessary for such esteemed persons to waste",
      "zh-CHS": "另一方面，一些作家众所周知拥有最高的道德血统：这一事实从他们所经营的公司、他们参加的工作组以及他们获得NomCom的资格都是显而易见的。这些受尊敬的人显然没有必要浪费时间"
    },
    {
      "indent": 3,
      "text": "effort on Morality Considerations sections. It is inconceivable that anything that they write would have anything other than a beneficial effect on the Routing Area and the Internet in general.",
      "zh-CHS": "关于道德考虑的努力。不可想象的是，他们所写的任何东西除了对路由区域和整个互联网产生有益的影响之外都会产生其他任何影响。"
    },
    {
      "indent": 0,
      "text": "2.2. Mandatory Subsections",
      "section_title": true,
      "zh-CHS": "2.2. 强制性分节"
    },
    {
      "indent": 3,
      "text": "If the Morality Considerations section is present, it MUST contain at least the following subsections. The content of these subsections is surely self-evident to any right-thinking person. Further guidance can be obtained from your moral guardian, your household gods, or from any member of the IMM (Internet Moral Majority).",
      "zh-CHS": "如果存在道德考虑部分，则必须至少包含以下小节。这些小节的内容对于任何思维正确的人来说都是不言而喻的。进一步的指导可以从您的道德监护人、您的家庭众神或IMM（互联网道德多数）的任何成员处获得。"
    },
    {
      "indent": 3,
      "text": "- Likelihood of misuse by depraved or sick individuals. This subsection must fully address the possibility that the proposed protocols or protocol extensions might be used for the distribution of blue, smutty, or plain disgusting images.",
      "zh-CHS": "- 腐败或患病个人滥用的可能性。本小节必须充分解决提议的协议或协议扩展可能用于分发蓝色、淫秽或普通恶心图像的可能性。"
    },
    {
      "indent": 3,
      "text": "- Likelihood of misuse by misguided individuals. There is an obvious need to protect minors and people with misguided thought processes from utilising the protocols or protocol extensions for purposes that would inevitably do them harm.",
      "zh-CHS": "- 被误导的个人滥用的可能性。显然，有必要保护未成年人和思维过程受到误导的人，使他们不会为了不可避免地伤害他们的目的而使用协议或协议扩展。"
    },
    {
      "indent": 3,
      "text": "- Likelihood of misuse by large, multi-national corporations. Such a thought is, of course, unthinkable.",
      "zh-CHS": "- 大型跨国公司滥用的可能性。当然，这样的想法是不可想象的。"
    },
    {
      "indent": 3,
      "text": "- Availability of oversight facilities. There are those who would corrupt our morals motivated as they are by a hatred of the freedom of Internet access with which we are graced. We place a significant burden of responsibility on those who guard our community from these evil-doers and it is only fitting that we give them as much support as is possible. Therefore, all encryption and obfuscation techniques MUST be excluded - individuals who have nothing to hide need to fear the oversight of those whose morals are beyond doubt.",
      "zh-CHS": "- 监督设施的可用性。有些人会破坏我们的道德，因为他们的动机是对我们所享受的互联网接入自由的仇恨。我们对那些保护我们的社会不受这些作恶者伤害的人负有重大责任，我们给予他们尽可能多的支持才是恰当的。因此，必须排除所有加密和模糊处理技术——没有什么可隐瞒的个人需要害怕那些道德无可置疑的人的监督。"
    },
    {
      "indent": 3,
      "text": "- Inter-SDO impact. We must allow for other moral frameworks and fully respect other people's right to subscribe to other belief systems. Such people are, however, wrong and doomed to spend eternity in a dark corner with only dial-up access. So it has been written.",
      "zh-CHS": "- SDO之间的影响。我们必须允许其他道德框架，并充分尊重其他人支持其他信仰体系的权利。然而，这样的人是错误的，注定要永远呆在一个只有拨号接入的黑暗角落里。所以它被写下来了。"
    },
    {
      "indent": 3,
      "text": "- Care and concern for avian carriers. A duck may be somebody's mother.",
      "zh-CHS": "- 照顾和关注禽鸟携带者。鸭子可能是某人的母亲。"
    },
    {
      "indent": 3,
      "text": "Even if one or more of these subsections are considered irrelevant, they MUST all still be present, and MUST contain a full rebuttal of this deviant thought.",
      "zh-CHS": "即使这些小节中的一个或多个被认为是不相关的，它们都必须仍然存在，并且必须包含对这种不正常思想的完整反驳。"
    },
    {
      "indent": 0,
      "text": "2.3. Optional Subsections",
      "section_title": true,
      "zh-CHS": "2.3. 可选小节"
    },
    {
      "indent": 3,
      "text": "Additional subsections may be added to accommodate zealots.",
      "zh-CHS": "可以添加额外的小节来容纳狂热者。"
    },
    {
      "indent": 0,
      "text": "2.4. Placement of Morality Considerations Sections",
      "section_title": true,
      "zh-CHS": "2.4. 道德考虑部分的位置"
    },
    {
      "indent": 3,
      "text": "The Morality Considerations section MUST be given full prominence in each Internet Draft.",
      "zh-CHS": "在每一份互联网草案中，道德考虑部分必须得到充分的重视。"
    },
    {
      "indent": 0,
      "text": "3. Applicability Scenarios",
      "section_title": true,
      "zh-CHS": "3. 适用场景"
    },
    {
      "indent": 3,
      "text": "This section outlines, by way of example, some particular areas that are in dire need of reform and where a short, sharp shock could make a really big difference.",
      "zh-CHS": "本节举例概述了一些急需改革的特定领域，在这些领域，短暂而剧烈的冲击可能会产生巨大的影响。"
    },
    {
      "indent": 0,
      "text": "3.1. Provision of Services",
      "section_title": true,
      "zh-CHS": "3.1. 提供服务"
    },
    {
      "indent": 3,
      "text": "We must do our utmost to ensure that services are delivered in a timely and reliable way. Emphasis should be placed on Quality of Service (QoS) and meeting the needs of the consumer of the service.",
      "zh-CHS": "我们必须尽最大努力确保及时可靠地提供服务。重点应放在服务质量（QoS）和满足服务消费者的需求上。"
    },
    {
      "indent": 3,
      "text": "Arrangements should be made for regular provision of services, and sermons should be to the point and contain a strong moral message.",
      "zh-CHS": "应安排定期提供服务，布道应切中要害，并包含强烈的道德信息。"
    },
    {
      "indent": 0,
      "text": "3.2. Political Correctness (PC)",
      "section_title": true,
      "zh-CHS": "3.2. 政治正确性（PC）"
    },
    {
      "indent": 3,
      "text": "Political correctness has gone too far. This problem can be traced way back to the 1970s when the desktop PC was invented. It is necessary for Internet-Drafts to observe a form of political correctness, but note that you do not always have to mean what you say.",
      "zh-CHS": "政治正确性走得太远了。这个问题可以追溯到20世纪70年代，当时台式电脑被发明。互联网上的草稿有必要遵守某种形式的政治正确性，但请注意，你并不一定要说话算数。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Differentiated Services",
      "section_title": true,
      "zh-CHS": "3.2.1. 差异化服务"
    },
    {
      "indent": 3,
      "text": "Segregation of packets on the grounds of color is now banned and Internet-Drafts must not make use of this technique.",
      "zh-CHS": "基于颜色的数据包隔离现在被禁止，互联网草稿不得使用这种技术。"
    },
    {
      "indent": 3,
      "text": "If you follow all of the recommendations in this document, you will find that \"packets of color\" (as we must now refer to them) tend to avoid your points of presence, and you will no longer be troubled by them.",
      "zh-CHS": "如果您遵循本文档中的所有建议，您将发现“颜色包”（我们现在必须提及它们）倾向于避开您的存在点，并且您将不再被它们困扰。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Jumbo Packets",
      "section_title": true,
      "zh-CHS": "3.2.2. 特大数据包"
    },
    {
      "indent": 3,
      "text": "It is no longer appropriate to refer to \"jumbo packets\". Please use the term \"capacitorially challenged\".",
      "zh-CHS": "再也不适合提及“巨型数据包”。请使用“能力挑战”一词。"
    },
    {
      "indent": 0,
      "text": "3.2.3. Byte Ordering",
      "section_title": true,
      "zh-CHS": "3.2.3. 字节排序"
    },
    {
      "indent": 3,
      "text": "Note that within Internet-Drafts, bytes (and bits) progress from the left to the right. This is how things should be.",
      "zh-CHS": "请注意，在Internet草稿中，字节（和位）从左到右进行。事情应该是这样的。"
    },
    {
      "indent": 0,
      "text": "3.3. Protection or Abstinence",
      "section_title": true,
      "zh-CHS": "3.3. 保护还是禁欲"
    },
    {
      "indent": 3,
      "text": "Much has been made recently of the need to provide protection within the Internet. It is the role of the IMM to determine when protection is required, and the role of the IESG bulldogs to ensure that we are all protected.",
      "zh-CHS": "最近，人们对在互联网内提供保护的必要性作了大量的讨论。IMM的职责是确定何时需要保护，IESG斗牛犬的职责是确保我们都受到保护。"
    },
    {
      "indent": 3,
      "text": "However, protection is only one way to prevent unplanned outages and, as we all know, the ready availability of protection schemes such as 1:1 (one-on-one) or 1:n (orgy-mode) have lead to a belief that it is acceptable to switch (or swing) at will. It should be noted that protection can fail, and under no circumstances should extra traffic be countenanced.",
      "zh-CHS": "然而，保护只是防止计划外停机的一种方法，而且众所周知，保护方案（如1:1（一对一）或1:n（狂欢模式）的现成可用性使人们相信，随意切换（或摇摆）是可以接受的。需要注意的是，保护可能失效，在任何情况下都不允许额外的流量。"
    },
    {
      "indent": 3,
      "text": "In reality, the only safe way to avoid passing data to your friends is to agree to pledge to have no control plane before marriage. Join our campaign and sign up for the SONET Ring Thing.",
      "zh-CHS": "事实上，避免向朋友传递数据的唯一安全方法是在婚前承诺不拥有控制平面。加入我们的竞选活动，并报名参加SONET戒指活动。"
    },
    {
      "indent": 0,
      "text": "3.4. Promiscuity",
      "section_title": true,
      "zh-CHS": "3.4. 滥交"
    },
    {
      "indent": 3,
      "text": "Various disgusting protocols indulge in promiscuity. This appears to happen most often when an operator is unwilling to select a single partner and wants to play the field.",
      "zh-CHS": "各种令人厌恶的协议纵情于滥交。当运营商不愿意选择单一合作伙伴并希望参与时，这种情况似乎最常见。"
    },
    {
      "indent": 3,
      "text": "Promiscuous modes of operation are an abomination, exceeded only by multicast.",
      "zh-CHS": "混乱的操作模式令人憎恶，只有多播才能超越。"
    },
    {
      "indent": 0,
      "text": "4. Terminology",
      "section_title": true,
      "zh-CHS": "4. 术语"
    },
    {
      "indent": 3,
      "text": "Admission Control The caring investigative arm of the IMM.",
      "zh-CHS": "入境管理处的负责调查的部门。"
    },
    {
      "indent": 3,
      "text": "Doom Port 666. Need we say more?",
      "zh-CHS": "厄运港666号。我们需要说更多吗？"
    },
    {
      "indent": 3,
      "text": "ECMP What is this? Some kind of Communism?",
      "zh-CHS": "这是什么？某种共产主义？"
    },
    {
      "indent": 3,
      "text": "Money The root of all evil.",
      "zh-CHS": "金钱是万恶之源。"
    },
    {
      "indent": 3,
      "text": "MPLS What is with this \"layer two-and-a-half\" nonsense? The world is flat, just accept the fact.",
      "zh-CHS": "MPLS这种“二层半”的废话是怎么回事？世界是平的，接受事实吧。"
    },
    {
      "indent": 3,
      "text": "Packet Switching Sounds like fraud to me.",
      "zh-CHS": "对我来说，数据包交换听起来像是骗局。"
    },
    {
      "indent": 3,
      "text": "Path The route of all LSPs.",
      "zh-CHS": "所有LSP的路径。"
    },
    {
      "indent": 3,
      "text": "Policy Control The administrative arm of the IMM.",
      "zh-CHS": "策略控制IMM的管理部门。"
    },
    {
      "indent": 3,
      "text": "Random Walk Substance abuse is to be avoided.",
      "zh-CHS": "应避免滥用药物。"
    },
    {
      "indent": 3,
      "text": "Rendezvous Point Poorly lit street corner. Not to be confused with the root of all multicast.",
      "zh-CHS": "集合点灯光不好的街角。不要与所有多播的根混淆。"
    },
    {
      "indent": 3,
      "text": "Standard Body What we should all strive for.",
      "zh-CHS": "我们都应该为之奋斗的标准机构。"
    },
    {
      "indent": 3,
      "text": "Strawberry Ice Cream Something that wills the void between rational discussion and all-out thermo nuclear war [SCREAM].",
      "zh-CHS": "草莓冰淇淋——一种能在理性讨论和全面热核战争之间填补空白的东西。"
    },
    {
      "indent": 0,
      "text": "5. Morality Considerations",
      "section_title": true,
      "zh-CHS": "5. 道德考虑"
    },
    {
      "indent": 3,
      "text": "The moral pedigree of the author of this document places him and his writings beyond question.",
      "zh-CHS": "本文作者的道德谱系使他和他的作品毋庸置疑。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA should think carefully about the protection of their immortal souls.",
      "zh-CHS": "伊安娜应该仔细考虑保护他们不朽的灵魂。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Security is of the utmost importance.",
      "zh-CHS": "安全是最重要的。"
    },
    {
      "indent": 3,
      "text": "A secure Internet community will ensure the security of all of its members.",
      "zh-CHS": "一个安全的互联网社区将确保其所有成员的安全。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "I would like to thank my guru Alex Dipandra-Zinin.",
      "zh-CHS": "我要感谢我的导师亚历克斯·迪潘德拉·齐宁。"
    },
    {
      "indent": 3,
      "text": "Jozef Wroblewski, who clearly knows promiscuous behavior when he sees it, pointed out some of the dangers in promiscuous operation.",
      "zh-CHS": "约泽夫·沃布列夫斯基（Jozef Wroblewski）清楚地知道滥交行为，他指出了滥交手术的一些危险。"
    },
    {
      "indent": 3,
      "text": "No avian carriers were harmed in the production of this document.",
      "zh-CHS": "在本文件的制作过程中，没有鸟类携带者受到伤害。"
    },
    {
      "indent": 0,
      "text": "9. Intellectual Property Considerations",
      "section_title": true,
      "zh-CHS": "9. 知识产权考虑"
    },
    {
      "indent": 3,
      "text": "Property is theft. What is yours is mine. What is mine, you keep your hands off.",
      "zh-CHS": "财产就是盗窃。你的是我的。什么是我的，你把手拿开。"
    },
    {
      "indent": 0,
      "text": "10. Normative References",
      "section_title": true,
      "zh-CHS": "10. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "I don't need to be told how to formulate my morals.",
      "zh-CHS": "我不需要别人告诉我如何制定我的道德规范。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 0,
      "text": "11. Informative References",
      "section_title": true,
      "zh-CHS": "11. 资料性引用"
    },
    {
      "indent": 3,
      "text": "To be frank, I don't find many other documents informative.",
      "zh-CHS": "坦率地说，我没有发现许多其他文件提供信息。"
    },
    {
      "indent": 3,
      "text": "[SCREAM] Farrel, A., \"Observations on Proposing Protocol Enhancements that Address Stated Requirements but also go Further by Meeting more General Needs\", Work in Progress, June 2003.",
      "zh-CHS": "[SCREAM]Farrel，A.，“关于提出协议改进的意见，这些改进既能满足规定的要求，又能进一步满足更一般的需要”，进展中的工作，2003年6月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Old Dog Consulting",
      "zh-CHS": "阿德里安·法雷尔老狗咨询公司"
    },
    {
      "indent": 3,
      "text": "Phone: I'm not telling you that. Why do you ask, anyway? EMail: adrian@olddog.co.uk",
      "zh-CHS": "电话：我不会告诉你的。你为什么要问？电邮：adrian@olddog.co.uk"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78 and at www.rfc-editor.org/copyright.html, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78和www.rfc-editor.org/copyright.html中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}