{
  "title": {
    "text": "RFC 4780: Management Information Base for the Session Initiation Protocol (SIP)",
    "zh-CHS": "RFC 4780"
  },
  "number": 4780,
  "created_at": "2021-11-15 01:04:51.609902+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          K. Lingle\nRequest for Comments: 4780                           Cisco Systems, Inc.\nCategory: Standards Track                                      J-F. Mule\n                                                               CableLabs\n                                                                J. Maeng\n                                                               D. Walker\n                                                              April 2007",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": " Management Information Base for the Session Initiation Protocol (SIP)",
      "zh-CHS": "会话启动协议（SIP）的管理信息库"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes a set of managed objects that are used to manage Session Initiation Protocol (SIP) entities, which include User Agents, and Proxy, Redirect and Registrar servers.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别地，它描述了一组用于管理会话发起协议（SIP）实体的托管对象，这些实体包括用户代理以及代理、重定向和注册服务器。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions .....................................................2\n3. The Internet-Standard Management Framework ......................2\n4. Overview ........................................................3\n5. Structure of the SIP MIB ........................................3\n   5.1. Textual Conventions ........................................6\n   5.2. Relationship to the Network Services MIB ...................6\n   5.3. IMPORTed MIB Modules and REFERENCE Clauses ................10\n6. Accommodating SIP Extension Methods ............................11\n7. Definitions ....................................................12\n   7.1. SIP Textual Conventions ...................................12\n   7.2. SIP Common MIB Module .....................................15\n   7.3. SIP User Agent MIB Module .................................55\n   7.4. SIP Server MIB Module (Proxy, Redirect, and\n        Registrar Servers) ........................................59\n8. IANA Considerations ............................................77\n9. Security Considerations ........................................78\n10. Contributor Acknowledgments ...................................80\n11. References ....................................................80\n   11.1. Normative References .....................................80\n   11.2. Informative References ...................................81",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes a set of managed objects that are used to manage Session Initiation Protocol (SIP) entities, which include User Agents, and Proxy, Redirect and Registrar servers. The managed objects defined in this document are intended to provide basic SIP protocol management for SIP entities. The management of application-specific or service-specific SIP configuration is out of scope.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别地，它描述了一组用于管理会话发起协议（SIP）实体的托管对象，这些实体包括用户代理以及代理、重定向和注册服务器。本文档中定义的托管对象旨在为SIP实体提供基本的SIP协议管理。特定于应用程序或特定于服务的SIP配置的管理超出范围。"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "zh-CHS": "2. 习俗"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "3. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a set of MIB modules that are compliant to the SMIv2, which is described in STD 58, comprised of RFC 2578 [RFC2578], RFC 2579 [RFC2579], and RFC 2580 [RFC2580].",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了一组符合SMIv2的MIB模块，如STD 58所述，由RFC 2578[RFC2578]、RFC 2579[RFC2579]和RFC 2580[RFC2580]组成。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "zh-CHS": "4. 概述"
    },
    {
      "indent": 3,
      "text": "SIP [RFC3261] is an application-layer control (signaling) protocol for creating, modifying, and terminating sessions with one or more participants. These sessions include Internet telephone calls, multimedia distribution, and multimedia conferences.",
      "zh-CHS": "SIP[RFC3261]是一种应用层控制（信令）协议，用于创建、修改和终止与一个或多个参与者的会话。这些会议包括互联网电话、多媒体分发和多媒体会议。"
    },
    {
      "indent": 3,
      "text": "This MIB provides some managed objects for SIP entities defined in RFC 3261 [RFC3261] - User Agents (UA), and Proxy, Redirect, and Registrar servers. It is intended to provide management of the basic SIP entities. It provides for monitoring of status and protocol statistics, as well as for configuration of SIP entities.",
      "zh-CHS": "此MIB为RFC 3261[RFC3261]-用户代理（UA）中定义的SIP实体以及代理、重定向和注册服务器提供一些托管对象。它旨在提供对基本SIP实体的管理。它提供状态和协议统计信息的监控，以及SIP实体的配置。"
    },
    {
      "indent": 0,
      "text": "5. Structure of the SIP MIB",
      "section_title": true,
      "zh-CHS": "5. SIP-MIB的结构"
    },
    {
      "indent": 3,
      "text": "Four MIB modules are specified: SIP-COMMON-MIB, SIP-SERVER-MIB, SIP-UA-MIB, and SIP-TC-MIB. SIP-COMMON-MIB contains common MIB objects used in all the SIP entities. SIP-SERVER-MIB contains objects specific to Proxy, Redirect, and Registrar servers. SIP-UA-MIB includes objects specific to User Agents. SIP-TC-MIB defines the textual conventions used throughout the MIB modules.",
      "zh-CHS": "指定了四个MIB模块：SIP-COMMON-MIB、SIP-SERVER-MIB、SIP-UA-MIB和SIP-TC-MIB。SIP-COMMON-MIB包含所有SIP实体中使用的公共MIB对象。SIP-SERVER-MIB包含特定于代理、重定向和注册服务器的对象。SIP-UA-MIB包括特定于用户代理的对象。SIP-TC-MIB定义了整个MIB模块中使用的文本约定。"
    },
    {
      "indent": 3,
      "text": "The MIB modules contain the following groups of objects:",
      "zh-CHS": "MIB模块包含以下对象组："
    },
    {
      "indent": 3,
      "text": "SIP-COMMON-MIB: Management objects common to all the SIP entities",
      "zh-CHS": "SIP-COMMON-MIB：所有SIP实体共有的管理对象"
    },
    {
      "indent": 3,
      "text": "o sipCommonMIBObjects",
      "zh-CHS": "o SipCommonMib对象"
    },
    {
      "indent": 6,
      "text": "* sipCommonCfgBase: This object group defines configuration objects common to all SIP entities, including the SIP protocol version, the type of SIP entity (UA, proxy, redirect, registrar servers), the operational and administrative status, the SIP organization name, the maximum number of SIP transactions an entity can manage, etc.",
      "zh-CHS": "* sipCommonCfgBase：此对象组定义所有SIP实体通用的配置对象，包括SIP协议版本、SIP实体类型（UA、代理、重定向、注册服务器）、操作和管理状态、SIP组织名称、实体可以管理的最大SIP事务数等。"
    },
    {
      "indent": 6,
      "text": "* sipCommonCfgTimer: This object group defines timer configuration objects applicable to SIP user agent and stateful SIP proxy entities.",
      "zh-CHS": "* sipCommonCfgTimer：此对象组定义适用于SIP用户代理和有状态SIP代理实体的计时器配置对象。"
    },
    {
      "indent": 6,
      "text": "* sipCommonSummaryStats: This object group defines a table containing the summary statistics objects applicable to all SIP entities, including the total number of all SIP requests and responses in/out and the total number of transactions.",
      "zh-CHS": "* sipCommonSummaryStats：该对象组定义了一个表，其中包含适用于所有SIP实体的摘要统计对象，包括所有SIP请求和响应输入/输出的总数以及事务的总数。"
    },
    {
      "indent": 6,
      "text": "* sipCommonMethodStats: This object group defines a table containing the SIP method statistics objects applicable to all SIP entities, including the number of outbound and inbound requests on a per method basis. Retransmissions, where appropriate, are also included in these statistics.",
      "zh-CHS": "* sipCommonMethodStats：此对象组定义一个表，其中包含适用于所有SIP实体的SIP方法统计对象，包括每个方法的出站和入站请求数。在适当情况下，重新传输也包括在这些统计数据中。"
    },
    {
      "indent": 6,
      "text": "* sipCommonStatusCode: This object group defines a table indicating the number of SIP responses (in and out) that the SIP entity has been requested to monitor on a per-method basis (100, 200, 302, etc.).",
      "zh-CHS": "* sipCommonStatusCode：此对象组定义了一个表，指示SIP实体已被请求在每个方法（100、200、302等）的基础上监视的SIP响应（输入和输出）的数量。"
    },
    {
      "indent": 6,
      "text": "* sipCommonStatsTrans: This object group defines a table containing a gauge reflecting the number of transactions currently awaiting definitive responses by the managed SIP entity.",
      "zh-CHS": "* sipCommonStatsTrans：该对象组定义了一个表，其中包含一个量表，该量表反映了当前等待托管SIP实体最终响应的事务数。"
    },
    {
      "indent": 6,
      "text": "* sipCommonStatsRetry: This object group defines statistic objects indicating the number of retransmissions sent on a per-method basis.",
      "zh-CHS": "* sipCommonStatsRetry：此对象组定义统计对象，指示每个方法发送的重传次数。"
    },
    {
      "indent": 6,
      "text": "* sipCommonOtherStats: This object group defines additional statistics objects including the number of SIP requests received with unsupported URIs, the number of requests received with unsupported SIP methods, and the number of discarded messages.",
      "zh-CHS": "* sipCommonOtherStats：此对象组定义其他统计对象，包括使用不支持的URI接收的SIP请求数、使用不支持的SIP方法接收的请求数以及丢弃的消息数。"
    },
    {
      "indent": 6,
      "text": "* sipCommonNotifObjects: This object group defines objects accessible only via a notification (MAX ACCESS clause of accessible-for-notify): they are related to the SNMP notifications defined in this MIB module.",
      "zh-CHS": "* sipCommonNotifObjects：此对象组定义只能通过通知访问的对象（可访问的最大访问子句用于通知）：它们与此MIB模块中定义的SNMP通知相关。"
    },
    {
      "indent": 3,
      "text": "The SIP-COMMON-MIB also contains notifications, including:",
      "zh-CHS": "SIP-COMMON-MIB还包含通知，包括："
    },
    {
      "indent": 3,
      "text": "o sipCommonStatusCodeNotif: indicates that a specific status code has been sent or received by the system.",
      "zh-CHS": "o sipCommonStatusCodeNotif：表示系统已发送或接收特定状态代码。"
    },
    {
      "indent": 3,
      "text": "o sipCommonStatusCodeThreshExceededNotif: indicates that a specific status code has been sent or received by the system frequently enough to exceed the configured threshold.",
      "zh-CHS": "o sipCommonStatusCodeThreshExceededNotif：表示系统发送或接收特定状态代码的频率足以超过配置的阈值。"
    },
    {
      "indent": 3,
      "text": "SIP-SERVER-MIB: Groups of objects for SIP Proxy, Redirect, and Registrar servers",
      "zh-CHS": "SIP-SERVER-MIB：SIP代理服务器、重定向服务器和注册服务器的对象组"
    },
    {
      "indent": 3,
      "text": "o sipServerMIBObjects",
      "zh-CHS": "o sipServerMIBObjects"
    },
    {
      "indent": 6,
      "text": "* sipServerCfg: This object group defines common server configuration objects including the SIP server host address.",
      "zh-CHS": "* sipServerCfg：此对象组定义常见的服务器配置对象，包括SIP服务器主机地址。"
    },
    {
      "indent": 6,
      "text": "* sipServerProxyCfg: This object group defines configuration objects for SIP Proxy Servers including the proxy mode of operation (stateless, stateful, call stateful), the proxy authentication method(s), realm, etc.",
      "zh-CHS": "* sipServerProxyCfg：此对象组定义SIP代理服务器的配置对象，包括代理操作模式（无状态、有状态、调用有状态）、代理身份验证方法、领域等。"
    },
    {
      "indent": 6,
      "text": "* sipServerProxyStats: This object group defines a table containing the statistics objects applicable to SIP Proxy Servers. It includes the number of occurrences of unsupported options being specified in received Proxy-Require headers.",
      "zh-CHS": "* sipServerProxyStats：此对象组定义一个包含适用于SIP代理服务器的统计对象的表。它包括在收到的代理请求标头中指定的不受支持选项的出现次数。"
    },
    {
      "indent": 6,
      "text": "* sipServerRegCfg: This object group defines common configuration objects for SIP Registrar servers, including the ability to accept third-party registrations, such as the maximum registration expiry that may be requested by user agents, the maximum number of users the registrar can support, the number of currently registered users, per contact registration information, etc.",
      "zh-CHS": "* sipServerRegCfg：此对象组定义SIP注册服务器的通用配置对象，包括接受第三方注册的能力，例如用户代理可能请求的最大注册到期日、注册器可以支持的最大用户数、当前注册的用户数，每个联系人的注册信息等。"
    },
    {
      "indent": 6,
      "text": "* sipServerRegStats: This object group contains summary statistics objects for SIP Registrar servers. Precisely, it contains the number of REGISTER requests that have been accepted or rejected.",
      "zh-CHS": "* sipServerRegStats：此对象组包含SIP注册服务器的摘要统计数据对象。确切地说，它包含已接受或拒绝的注册请求数。"
    },
    {
      "indent": 3,
      "text": "SIP-UA-MIB: Group of objects for SIP User Agents",
      "zh-CHS": "SIP-UA-MIB：SIP用户代理的对象组"
    },
    {
      "indent": 3,
      "text": "o sipUAMIBObjects",
      "zh-CHS": "o SIPUAMIB对象"
    },
    {
      "indent": 6,
      "text": "* sipUACfgServer: This object group specifies SIP server configuration objects applicable to SIP user agents including the Internet address of the SIP Server the UA uses to register, proxy, or redirect calls.",
      "zh-CHS": "* sipUACfgServer：此对象组指定适用于SIP用户代理的SIP服务器配置对象，包括UA用于注册、代理或重定向呼叫的SIP服务器的Internet地址。"
    },
    {
      "indent": 3,
      "text": "To conform with this specification, an SNMP agent MUST implement the SIP-TC-MIB module, plus the SIP-COMMON-MIB module and one of the SIP entity-type-specific MIB modules (SIP-SERVER-MIB or SIP-UA-MIB) as applicable for each instance of a SIP entity being managed. If a device has more than one SIP entity or multiple instances of the same entity type, it MUST implement multiple SIP modules. Section 5.2 describes handling of multiple instances in detail.",
      "zh-CHS": "为了符合本规范，SNMP代理必须实现SIP-TC-MIB模块、SIP-COMMON-MIB模块和一个SIP实体类型特定的MIB模块（SIP-SERVER-MIB或SIP-UA-MIB），适用于所管理的SIP实体的每个实例。如果设备具有多个SIP实体或相同实体类型的多个实例，则必须实现多个SIP模块。第5.2节详细描述了多个实例的处理。"
    },
    {
      "indent": 0,
      "text": "5.1. Textual Conventions",
      "section_title": true,
      "zh-CHS": "5.1. 文字约定"
    },
    {
      "indent": 3,
      "text": "The data types SipTCTransportProtocol, SipTCEntityRole, SipTCOptionTagHeaders, and SipTCMethodName are defined in the SIP-TC-MIB module and used as Textual Conventions in this document.",
      "zh-CHS": "SipTCTransportProtocol、SipTCEntityRole、SipTCOptionTagHeaders和SipTCMethodName等数据类型在SIP-TC-MIB模块中定义，并在本文档中用作文本约定。"
    },
    {
      "indent": 0,
      "text": "5.2. Relationship to the Network Services MIB",
      "section_title": true,
      "zh-CHS": "5.2. 与网络服务MIB的关系"
    },
    {
      "indent": 3,
      "text": "In the design of the SIP MIB, the authors considered the following requirement: the SIP MIB must allow a single system with a single SNMP agent to support multiple instances of various SIP MIB modules. This requirement is met by using the framework provided by the Network Services Monitoring MIB, NETWORK-SERVICES-MIB, RFC 2788 [RFC2788].",
      "zh-CHS": "在SIP MIB的设计中，作者考虑了以下要求：SIP MIB必须允许具有单个SNMP代理的单个系统支持各种SIP MIB模块的多个实例。通过使用网络服务监控MIB、Network-Services-MIB、RFC 2788[RFC2788]提供的框架，可以满足此要求。"
    },
    {
      "indent": 3,
      "text": "A device implementing the SIP MIB MUST support the NETWORK-SERVICES-MIB and, at a minimum, MUST support the index and name objects (applIndex and applName) in the application table (applTable). In order to allow each instance of a SIP entity to be managed as a separate network service application, a naming convention SHOULD be used to make the application name unique. For example, if a system is running 2 SIP UAs that need to be managed as 2 separate SIP entities, by convention, the application names used in the Network Services Monitoring MIB application table should be \"sip_ua1\" and \"sip_ua2\". This convention allows each instance to have its own row in the application table (applTable).",
      "zh-CHS": "实现SIP MIB的设备必须支持NETWORK-SERVICES-MIB，并且至少必须支持应用程序表（applTable）中的索引和名称对象（applIndex和applName）。为了允许SIP实体的每个实例作为单独的网络服务应用程序进行管理，应使用命名约定使应用程序名称唯一。例如，如果系统正在运行需要作为两个独立SIP实体进行管理的2个SIP UAs，则按照约定，网络服务监控MIB应用程序表中使用的应用程序名称应为“SIP_ua1”和“SIP_ua2”。此约定允许每个实例在应用程序表（applTable）中有自己的行。"
    },
    {
      "indent": 3,
      "text": "It is therefore RECOMMENDED that the following application name conventions be adopted:",
      "zh-CHS": "因此，建议采用以下应用程序名称约定："
    },
    {
      "indent": 3,
      "text": "o for a SIP Proxy entity, the applName value SHOULD be equal to a character string starting with \"sip_proxy\" followed by a unique application instance identifier, for example, \"sip_proxy1\", \"sip_proxy17\".",
      "zh-CHS": "o 对于SIP代理实体，applName值应等于以“SIP_Proxy”开头的字符串，后跟唯一的应用程序实例标识符，例如，“SIP_proxy1”、“SIP_proxy17”。"
    },
    {
      "indent": 3,
      "text": "o for a SIP Registrar entity, the applName value SHOULD be equal to a character string starting with \"sip_registrar\" followed by a unique application instance identifier, for example, \"sip_registrar1\", \"sip_registrar2\".",
      "zh-CHS": "o 对于SIP注册器实体，applName值应等于以“SIP_注册器”开头的字符串，后跟唯一的应用程序实例标识符，例如，“SIP_注册器1”、“SIP_注册器2”。"
    },
    {
      "indent": 3,
      "text": "o for a SIP User Agent entity, the applName value SHOULD be equal to a character string starting with \"sip_ua\" followed by a unique application instance identifier, for example, \"sip_ua1\", \"sip_ua2\".",
      "zh-CHS": "o 对于SIP用户代理实体，applName值应等于以“SIP_ua”开头的字符串，后跟唯一的应用程序实例标识符，例如，“SIP_ua1”、“SIP_ua2”。"
    },
    {
      "indent": 3,
      "text": "o for any combination of Proxy, Registrar, or Redirect Server being managed as a single aggregate entity, the applName value for the combined server entity SHOULD reflect the appropriate combination followed by a unique application instance identifier. In order to facilitate consistent agent behavior and management application expectations, the following order of names is RECOMMENDED:",
      "zh-CHS": "o 对于作为单个聚合实体管理的代理、注册器或重定向服务器的任何组合，组合服务器实体的applName值应反映适当的组合，后跟唯一的应用程序实例标识符。为了促进一致的代理行为和管理应用程序期望，建议按以下名称顺序排列："
    },
    {
      "indent": 9,
      "text": "* if Proxy exists, list first. * if Proxy and Redirect exists, list Redirect second. * if Registrar exists, always list last.",
      "zh-CHS": "* 如果存在代理，请首先列出。*如果存在代理和重定向，请列出第二个重定向。*如果存在注册者，则始终列在最后。"
    },
    {
      "indent": 6,
      "text": "For example \"sip_proxy1\", \"sip_proxy_registrar1\", \"sip_proxy_redirect5\", \"sip_proxy_redirect_registrar2\", or \"sip_registrar1\".",
      "zh-CHS": "例如，“sip_proxy1”、“sip_proxy_registrar1”、“sip_proxy_redirect5”、“sip_proxy_Redirecte_registrar2”或“sip_registrar1”。"
    },
    {
      "indent": 3,
      "text": "o Note: the value of the network service application index (applIndex) may be different from the instance identifier used in the system (the applIndex is dynamically created and is the value assigned by the SNMP agent at the creation of the table entry, whereas the value of the instance identifier to be used in the application name is provided as part of the application name applName by the system administrator or configuration files of the SIP entity). This note is illustrated in the first example provided below.",
      "zh-CHS": "o 注意：网络服务应用程序索引（applIndex）的值可能与系统中使用的实例标识符不同（applIndex是动态创建的，是SNMP代理在创建表项时分配的值，而要在应用程序名称中使用的实例标识符的值由系统管理员或SIP实体的配置文件作为应用程序名称applName的一部分提供）。此注释在下面提供的第一个示例中进行了说明。"
    },
    {
      "indent": 3,
      "text": "Finally, the SNMP agent MAY support any combination of the other attributes in applTable. If supported, the following objects SHOULD have values populated as follows:",
      "zh-CHS": "最后，SNMP代理可以支持applTable中其他属性的任意组合。如果支持，以下对象应按如下方式填充值："
    },
    {
      "indent": 3,
      "text": "o applVersion: version of the SIP application.",
      "zh-CHS": "o applVersion：SIP应用程序的版本。"
    },
    {
      "indent": 3,
      "text": "o applUptime: the value of applUptime MUST be identical to the value of sipCommonCfgServiceStartTime defined in the SIP-COMMON-MIB module.",
      "zh-CHS": "o applUptime：applUptime的值必须与SIP-COMMON-MIB模块中定义的sipCommonCfgServiceStartTime的值相同。"
    },
    {
      "indent": 3,
      "text": "o applOperStatus: the value of applOperStatus SHOULD reflect the operational status of sipCommonCfgServiceOperStatus, at least by means of a mapping.",
      "zh-CHS": "o applOperStatus：applOperStatus的值应至少通过映射反映sipCommonCfgServiceOperStatus的运行状态。"
    },
    {
      "indent": 3,
      "text": "o applLastChange: the value of applLastChange MUST be identical to the value of sipCommonCfgServiceLastChange defined in the SIP-COMMON module.",
      "zh-CHS": "o applLastChange:applLastChange的值必须与SIP-COMMON模块中定义的sipCommonCfgServiceLastChange的值相同。"
    },
    {
      "indent": 3,
      "text": "A number of other objects are defined as part of the applTable. They are not included for the sake of brevity and due to the fact that they do not enhance the concept being presented.",
      "zh-CHS": "许多其他对象被定义为applTable的一部分。为简洁起见，不包括这些内容，因为它们不会增强所提出的概念。"
    },
    {
      "indent": 3,
      "text": "Example 1:",
      "zh-CHS": "例1："
    },
    {
      "indent": 3,
      "text": "The tables below illustrate how a system acting as both Proxy and Registrar server might be configured to maintain separate SIP-COMMON-MIB instances.",
      "zh-CHS": "下表说明了如何将同时充当代理服务器和注册服务器的系统配置为维护单独的SIP-COMMON-MIB实例。"
    },
    {
      "indent": 3,
      "text": "The NETWORK-SERVICES-MIB applTable might be populated as follows:",
      "zh-CHS": "NETWORK-SERVICES-MIB applTable可以按如下方式填充："
    },
    {
      "indent": 12,
      "text": "+-----------+-------------------+----------------------+\n| applIndex |      applName     |    applDescription   |\n+-----------+-------------------+----------------------+\n|     1     |   \"sip_proxy10\"   |   \"ACME SIP Proxy\"   |\n|     2     | \"sip_registrar17\" | \"ACME SIP Registrar\" |\n+-----------+-------------------+----------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The SIP-COMMON-MIB sipCommonCfgTable would have two rows: one for the proxy (applIndex=1) and one for the registrar (applIndex=2). The SIP-SERVER-MIB tables would, however, only be populated with one row indexed by applIndex=1 and applIndex=2, respectively, if the server provides either proxy or registrar.",
      "zh-CHS": "SIP-COMMON-MIB sipCommonCfgTable将有两行：一行用于代理（applIndex=1），另一行用于注册器（applIndex=2）。但是，如果服务器提供代理或注册器，则SIP-SERVER-MIB表将仅填充分别由applIndex=1和applIndex=2索引的一行。"
    },
    {
      "indent": 3,
      "text": "The SIP-COMMON-MIB sipCommonCfgTable might be populated as:",
      "zh-CHS": "SIP-COMMON-MIB sipCommonCfgTable可以填充为："
    },
    {
      "indent": 3,
      "text": "+---------+------------------------+--------------------------+-----+\n|applIndex| sipCommonCfgProtocol   | sipCommonCfgServiceOper  | ... |\n|         | Version                | Status                   |     |\n+---------+------------------------+--------------------------+-----+\n|    1    |        \"SIP/2.0\"       |           up(1)          |     |\n|    2    |        \"SIP/2.0\"       |       restarting(4)      |     |\n+---------+------------------------+--------------------------+-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "while the sipServerProxyCfgTable in SIP-SERVER-MIB might be populated as:",
      "zh-CHS": "而SIP-SERVER-MIB中的sipServerProxyCfgTable可能填充为："
    },
    {
      "indent": 12,
      "text": "+-----------+-------------------------------+-----+\n| applIndex | sipServerCfgProxyStatefulness | ... |\n+-----------+-------------------------------+-----+\n|     1     |          stateless(1)         |     |\n+-----------+-------------------------------+-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "and the sipServerRegUserTable in SIP-SERVER-MIB might be populated as:",
      "zh-CHS": "SIP-SERVER-MIB中的sipServerRegUserTable可以填充为："
    },
    {
      "indent": 6,
      "text": "+-----------+-----------------------+---------------------+-----+\n| applIndex | sipServerRegUserIndex | sipServerRegUserUri | ... |\n+-----------+-----------------------+---------------------+-----+\n|     2     |           1           |   bob@example.com   |     |\n|     2     |           2           |  alice@example.com  |     |\n|     2     |           3           |   jim@example.com   |     |\n|     2     |           4           |   john@example.com  |     |\n+-----------+-----------------------+---------------------+-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example 2:",
      "zh-CHS": "例2："
    },
    {
      "indent": 3,
      "text": "This example illustrates how to represent a system acting as both Proxy and Registrar server, where the two entities share a single instance of SIP-COMMON-MIB.",
      "zh-CHS": "此示例演示了如何表示同时充当代理服务器和注册服务器的系统，其中两个实体共享一个SIP-COMMON-MIB实例。"
    },
    {
      "indent": 3,
      "text": "The NETWORK-SERVICES-MIB applTable might be populated as follows:",
      "zh-CHS": "NETWORK-SERVICES-MIB applTable可以按如下方式填充："
    },
    {
      "indent": 3,
      "text": "+-----------+------------------------+------------------------------+\n| applIndex |        applName        |        applDescription       |\n+-----------+------------------------+------------------------------+\n|     1     | \"sip_proxy_registrar1\" |      \"ACME SIP Proxy and     |\n|           |                        |          Registrar\"          |\n+-----------+------------------------+------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The SIP-COMMON-MIB sipCommonCfgTable would have only one row to cover both the proxy and the registrar.",
      "zh-CHS": "SIP-COMMON-MIB sipCommonCfgTable将只有一行覆盖代理和注册器。"
    },
    {
      "indent": 3,
      "text": "The SIP-COMMON-MIB sipCommonCfgTable might be populated as:",
      "zh-CHS": "SIP-COMMON-MIB sipCommonCfgTable可以填充为："
    },
    {
      "indent": 2,
      "text": "+----------+---------------------------+-----------------------------+\n|applIndex |sipCommonCfgProtocolVersion|sipCommonCfgServiceOperStatus|\n+----------+---------------------------+-----------------------------+\n|     1    |         \"SIP/2.0\"         |            up(1)            |\n+----------+---------------------------+-----------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "while the sipServerRegUserTable in SIP-SERVER-MIB might be populated as:",
      "zh-CHS": "而SIP-SERVER-MIB中的sipServerRegUserTable可能会填充为："
    },
    {
      "indent": 6,
      "text": "+-----------+-----------------------+---------------------+-----+\n| applIndex | sipServerRegUserIndex | sipServerRegUserUri | ... |\n+-----------+-----------------------+---------------------+-----+\n|     2     |           1           |   bob@example.com   |     |\n|     2     |           2           |  alice@example.com  |     |\n|     2     |           3           |  kevin@example.com  |     |\n|     2     |           4           |    jf@example.com   |     |\n+-----------+-----------------------+---------------------+-----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The NETWORK-SERVICES-MIB assocTable is not considered a requirement for SIP systems. It is not a mandatory group for compliance with the NETWORK-SERVICES-MIB module.",
      "zh-CHS": "SIP系统不需要NETWORK-SERVICES-MIB assocTable。它不是遵守NETWORK-SERVICES-MIB模块的强制组。"
    },
    {
      "indent": 3,
      "text": "The relationship between the value of applOperStatus and sipCommonCfgServiceOperStatus is as follows:",
      "zh-CHS": "applOperStatus的值与SIPCommonCfgServicePerstatus的关系如下："
    },
    {
      "indent": 3,
      "text": "+-------------------------------+---------------+-------------------+\n| sipCommonCfgServiceOperStatus |       --      |   applOperStatus  |\n|                               |  corresponds  |                   |\n|                               |     to -->    |                   |\n+-------------------------------+---------------+-------------------+\n|               up              |      -->      |         up        |\n|              down             |      -->      |        down       |\n|           congested           |      -->      |     congested     |\n|           restarting          |      -->      |     restarting    |\n|           quiescing           |      -->      |     quiescing     |\n|            testing            |      -->      |         up        |\n|            unknown            |      -->      | --indeterminate-- |\n+-------------------------------+---------------+-------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "If the sipOperStatus is 'unknown', there is no corresponding value of applOperStatus. Therefore, the last known value of applOperStatus SHOULD be maintained until the sipOperStatus transitions to a value that can be mapped appropriately.",
      "zh-CHS": "如果sipOperStatus为“未知”，则没有对应的applOperStatus值。因此，应保持applOperStatus的最后一个已知值，直到sipOperStatus转换为可以适当映射的值。"
    },
    {
      "indent": 0,
      "text": "5.3. IMPORTed MIB Modules and REFERENCE Clauses",
      "section_title": true,
      "zh-CHS": "5.3. 导入的MIB模块和引用子句"
    },
    {
      "indent": 3,
      "text": "The SIP MIB modules defined in this document IMPORT definitions normatively from the following MIB modules, beyond [RFC2578], [RFC2579], and [RFC2580]: INET-ADDRESS-MIB [RFC4001], NETWORK-SERVICES-MIB [RFC2788], SNMP-FRAMEWORK-MIB [RFC3411].",
      "zh-CHS": "本文档中定义的SIP MIB模块从[RFC2578]、[RFC2579]和[RFC2580]之外的下列MIB模块标准导入定义：INET-ADDRESS-MIB[RFC4001]、NETWORK-SERVICES-MIB[RFC2788]、SNMP-FRAMEWORK-MIB[RFC3411]。"
    },
    {
      "indent": 3,
      "text": "This MIB module also includes REFERENCE clauses that normatively refer to SIP [RFC3261] and INET-ADDRESS-MIB [RFC4001].",
      "zh-CHS": "该MIB模块还包括规范性引用SIP[RFC3261]和INET-ADDRESS-MIB[RFC4001]的参考条款。"
    },
    {
      "indent": 3,
      "text": "Finally, this MIB module makes informative references to several RFCs in some of the examples described in the DESCRIPTION clauses, including Reliability of Provisional Responses in SIP [RFC3262] and SIP over SCTP [RFC4168].",
      "zh-CHS": "最后，该MIB模块对描述条款中描述的一些示例中的几个RFC进行了信息参考，包括SIP[RFC3262]和SIP over SCTP[RFC4168]中临时响应的可靠性。"
    },
    {
      "indent": 0,
      "text": "6. Accommodating SIP Extension Methods",
      "section_title": true,
      "zh-CHS": "6. 适应SIP扩展方法"
    },
    {
      "indent": 3,
      "text": "The core set of SIP methods is defined in RFC 3261 [RFC3261]. Other IETF RFCs define additional methods. In the future, additional methods may be defined. In order to avoid having to update the SIP-COMMON-MIB module to accommodate these extension methods, we use a method identifier name (SipTCMethodName TEXTUAL-CONVENTION) to represent all SIP methods registered with IANA.",
      "zh-CHS": "SIP方法的核心集在RFC 3261[RFC3261]中定义。其他IETF RFC定义了其他方法。将来，可能会定义其他方法。为了避免必须更新SIP-COMMON-MIB模块以适应这些扩展方法，我们使用方法标识符名称（SipTCMethodName-Text-CONVENTION）来表示向IANA注册的所有SIP方法。"
    },
    {
      "indent": 3,
      "text": "For example, the sipCommonMethodSupportedTable is the main table for listing all of the SIP methods supported by a system, including the SIP methods defined in RFC 3261 [RFC3261] and other SIP methods registered with IANA. The table is informational in nature and populated by the system. Entries cannot be added or deleted by an SNMP manager.",
      "zh-CHS": "例如，sipCommonMethodSupportedTable是列出系统支持的所有SIP方法的主表，包括RFC 3261[RFC3261]中定义的SIP方法和IANA注册的其他SIP方法。该表本质上是信息性的，由系统填充。SNMP管理器无法添加或删除条目。"
    },
    {
      "indent": 3,
      "text": "The SIP specification (RFC 3261 [RFC3261], Section 27.4) establishes the sub-registries for SIP Methods and Response Codes under http://www.iana.org/assignments/sip-parameters. This document uses the existing sub-registry for the names of registered SIP methods.",
      "zh-CHS": "SIP规范（RFC 3261[RFC3261]，第27.4节）为以下情况下的SIP方法和响应代码建立子注册表：http://www.iana.org/assignments/sip-parameters. 本文档使用现有的子注册表作为已注册SIP方法的名称。"
    },
    {
      "indent": 3,
      "text": "For example, in the sipCommonMethodSupportedTable of SIP-COMMON-MIB, the sipCommonMethodSupportedName values can be represented as follows:",
      "zh-CHS": "例如，在SIP-COMMON-MIB的sipCommonMethodSupportedTable中，sipCommonMethodSupportedName值可以表示为："
    },
    {
      "indent": 16,
      "text": "+------------------------------+\n| sipCommonMethodSupportedName |\n+------------------------------+\n|             \"ACK\"            |\n|             \"BYE\"            |\n|           \"CANCEL\"           |\n|           \"INVITE\"           |\n|           \"OPTIONS\"          |\n+------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Definitions",
      "section_title": true,
      "zh-CHS": "7. 定义"
    },
    {
      "indent": 0,
      "text": "7.1. SIP Textual Conventions",
      "section_title": true,
      "zh-CHS": "7.1. SIP文本约定"
    },
    {
      "indent": 0,
      "text": "SIP-TC-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, mib-2 FROM SNMPv2-SMI -- RFC 2578",
      "zh-CHS": "从SNMPv2 SMI——RFC 2578导入模块标识mib-2"
    },
    {
      "indent": 4,
      "text": "TEXTUAL-CONVENTION FROM SNMPv2-TC; -- RFC 2579",
      "zh-CHS": "SNMPv2 TC的文本约定；——RFC2579"
    },
    {
      "indent": 0,
      "text": "sipTC MODULE-IDENTITY LAST-UPDATED \"200704200000Z\" ORGANIZATION \"IETF Session Initiation Protocol Working Group\" CONTACT-INFO \"SIP WG email: sip@ietf.org",
      "zh-CHS": "sipTC模块标识最后更新的“200704200000Z”组织“IETF会话启动协议工作组”联系人信息“SIP工作组电子邮件：sip@ietf.org"
    },
    {
      "indent": 14,
      "text": "Co-editor Kevin Lingle Cisco Systems, Inc. postal: 7025 Kit Creek Road P.O. Box 14987 Research Triangle Park, NC 27709 USA email: klingle@cisco.com phone: +1 919 476 2029",
      "zh-CHS": "联合编辑Kevin Lingle Cisco Systems，Inc.邮政编码：美国北卡罗来纳州三角研究公园Kit Creek路7025号邮政信箱14987邮编：27709电子邮件：klingle@cisco.com电话：+19194762029"
    },
    {
      "indent": 14,
      "text": "Co-editor Joon Maeng email: jmaeng@austin.rr.com",
      "zh-CHS": "联合编辑Joon Maeng电子邮件：jmaeng@austin.rr.com"
    },
    {
      "indent": 14,
      "text": "Co-editor Jean-Francois Mule CableLabs postal: 858 Coal Creek Circle Louisville, CO 80027 USA email: jf.mule@cablelabs.com phone: +1 303 661 9100",
      "zh-CHS": "联合编辑Jean-Francois Mule CableLabs邮政编码：858 Coal Creek Circle Louisville，Co 80027美国电子邮件：jf。mule@cablelabs.com电话：+13036619100"
    },
    {
      "indent": 4,
      "text": " Co-editor Dave Walker email: drwalker@rogers.com\" DESCRIPTION \"Session Initiation Protocol (SIP) MIB TEXTUAL-CONVENTION module used by other SIP-related MIB Modules.",
      "zh-CHS": "联合编辑Dave Walker电子邮件：drwalker@rogers.com“描述”会话启动协议（SIP）MIB文本约定模块，由其他SIP相关MIB模块使用。"
    },
    {
      "indent": 8,
      "text": "Copyright (C) The IETF Trust (2007). This version of this MIB module is part of RFC 4780; see the RFC itself for",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。此版本的MIB模块是RFC 4780的一部分；有关详细信息，请参见RFC本身"
    },
    {
      "indent": 4,
      "text": "    full legal notices.\"\nREVISION     \"200704200000Z\"\nDESCRIPTION\n   \"Initial version of the IETF SIP-TC-MIB module.  This version\n    published as part of RFC 4780.\"\n ::= { mib-2 148 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Textual Conventions --",
      "zh-CHS": "----文本约定--"
    },
    {
      "indent": 0,
      "text": "SipTCTransportProtocol ::= TEXTUAL-CONVENTION\n    STATUS      current\n    DESCRIPTION\n       \"This convention is a bit map.  Each bit represents a transport\n        protocol.  If a bit has value 1, then that selected transport\n        protocol is in some way dependent on the context of the object\n        using this convention.  If a bit has value 0, then that\n        transport protocol is not selected.  Combinations of bits can\n        be set when multiple transport protocols are selected.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "    bit 0: a protocol other than those defined here\n    bit 1: User Datagram Protocol\n    bit 2: Transmission Control Protocol\n    bit 3: Stream Control Transmission Protocol\n    bit 4: Transport Layer Security Protocol over TCP\n    bit 5: Transport Layer Security Protocol over SCTP\n   \"\nREFERENCE \"RFC 3261, Section 18 and RFC 4168\"\nSYNTAX      BITS {\n              other(0),  -- none of the following\n              udp(1),\n              tcp(2),\n              sctp(3),   -- RFC4168\n              tlsTcp(4),\n              tlsSctp(5) -- RFC 4168\n            }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipTCEntityRole ::= TEXTUAL-CONVENTION\n    STATUS      current\n    DESCRIPTION\n       \"This convention defines the role of a SIP entity.  Examples of\n        SIP entities are proxies, user agents, redirect servers,\n        registrars, or combinations of the above.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "User Agent (UA): A logical entity that can act as both a user agent client and user agent server.",
      "zh-CHS": "用户代理（UA）：可以同时充当用户代理客户端和用户代理服务器的逻辑实体。"
    },
    {
      "indent": 8,
      "text": "User Agent Client (UAC): A logical entity that creates a new request, and then uses the client transaction state machinery to send it. The role of UAC lasts only for the duration of that transaction. In other words, if a piece of software initiates a request, it acts as a UAC for the duration of that transaction. If it receives a request later, it assumes the role of a user agent server for the processing of that transaction.",
      "zh-CHS": "用户代理客户端（UAC）：创建新请求，然后使用客户端事务状态机制发送请求的逻辑实体。UAC的角色仅在该交易期间有效。换句话说，如果一个软件启动一个请求，它在该事务期间充当UAC。如果稍后收到请求，它将承担处理该事务的用户代理服务器角色。"
    },
    {
      "indent": 8,
      "text": "User Agent Server (UAS): A logical entity that generates a response to a SIP request. The response accepts, rejects, or redirects the request. This role lasts only for the duration of that transaction. In other words, if a piece of software responds to a request, it acts as a UAS for the duration of that transaction. If it generates a request later, it assumes the role of a user agent client for the processing of that transaction.",
      "zh-CHS": "用户代理服务器（UAS）：生成对SIP请求的响应的逻辑实体。响应接受、拒绝或重定向请求。此角色仅在该事务期间有效。换句话说，如果一个软件对一个请求做出响应，它在该事务期间充当UAS。如果它稍后生成请求，它将承担处理该事务的用户代理客户端的角色。"
    },
    {
      "indent": 8,
      "text": "Proxy, Proxy Server: An intermediary entity that acts as both a server and a client for the purpose of making requests on behalf of other clients. A proxy server primarily plays the role of routing, which means its job is to ensure that a request is sent to another entity 'closer' to the targeted user. Proxies are also useful for enforcing policy. A proxy interprets and, if necessary, rewrites specific parts of a request message before forwarding it.",
      "zh-CHS": "代理，代理服务器：作为服务器和客户端的中间实体，用于代表其他客户端发出请求。代理服务器主要扮演路由的角色，这意味着它的任务是确保将请求发送到距离目标用户“更近”的另一个实体。代理对于强制执行策略也很有用。在转发请求消息之前，代理将解释并在必要时重写请求消息的特定部分。"
    },
    {
      "indent": 8,
      "text": "Redirect Server: A redirect server is a user agent server that generates 3xx responses to requests it receives, directing the client to contact an alternate set of URIs.",
      "zh-CHS": "重定向服务器：重定向服务器是一个用户代理服务器，它对接收到的请求生成3xx响应，指示客户端联系一组备用URI。"
    },
    {
      "indent": 4,
      "text": "    Registrar: A registrar is a server that accepts REGISTER\n    requests and places the information it receives in those\n    requests into the location service for the domain it handles.\"\nREFERENCE\n   \"RFC 3261, Section 6\"\nSYNTAX      BITS {\n              other(0),\n              userAgent(1),\n              proxyServer(2),\n              redirectServer(3),\n              registrarServer(4)\n            }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipTCOptionTagHeaders ::= TEXTUAL-CONVENTION\n    STATUS      current\n    DESCRIPTION\n       \"This convention defines the header fields that use the option",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "    tags per Section 19.2 of RFC 3261.  These tags are used in\n    Require (Section 20.32), Proxy-Require (Section 20.29),\n    Supported (Section 20.37), and Unsupported (Section 20.40)\n    header fields.\"\nREFERENCE\n   \"RFC 3261, Sections 19.2, 20.32, 20.29, 20.37, and 20.40\"\nSYNTAX      BITS {\n              require(0),       -- Require header\n              proxyRequire(1),  -- Proxy-Require header\n              supported(2),     -- Supported header\n              unsupported(3)    -- Unsupported header\n            }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipTCMethodName ::= TEXTUAL-CONVENTION\n    STATUS      current\n    DESCRIPTION\n       \"This TEXTUAL-CONVENTION is a string that uniquely identifies a\n        SIP method.  The scope of uniqueness is the context of all\n        defined SIP methods.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Experimental support of extension methods is acceptable and expected. Extension methods are those defined in Internet-Draft documents but not yet allocated and officially sanctioned by IANA.",
      "zh-CHS": "扩展方法的实验支持是可以接受的，也是可以预期的。扩展方法是指互联网草案文件中定义的，但尚未分配和IANA正式批准的方法。"
    },
    {
      "indent": 4,
      "text": " To support experimental extension methods, any object using this TEXTUAL-CONVENTION as syntax MAY return/accept a method identifier value other than those sanctioned by IANA. That system MUST ensure no collisions with officially assigned method names.\" REFERENCE \"RFC 3261, Section 27.4\" SYNTAX OCTET STRING (SIZE (1..100))",
      "zh-CHS": "为了支持实验性扩展方法，任何使用此文本约定作为语法的对象都可以返回/接受IANA认可的方法标识符值以外的方法标识符值。该系统必须确保与官方指定的方法名没有冲突。“参考”RFC 3261，第27.4节“语法八位字符串（大小（1..100））"
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "7.2. SIP Common MIB Module",
      "section_title": true,
      "zh-CHS": "7.2. SIP公共MIB模块"
    },
    {
      "indent": 0,
      "text": "SIP-COMMON-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, NOTIFICATION-TYPE, Counter32, Gauge32, TimeTicks, Unsigned32,",
      "zh-CHS": "导入模块标识、对象类型、通知类型、计数器32、仪表32、时间刻度、无符号32、，"
    },
    {
      "indent": 4,
      "text": "mib-2 FROM SNMPv2-SMI -- RFC 2578",
      "zh-CHS": "来自SNMPv2 SMI的mib-2——RFC 2578"
    },
    {
      "indent": 4,
      "text": "RowStatus, TimeStamp, TruthValue FROM SNMPv2-TC -- RFC 2579",
      "zh-CHS": "来自SNMPv2 TC的RowStatus、TimeStamp、TruthValue--RFC2579"
    },
    {
      "indent": 4,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF -- RFC 2580",
      "zh-CHS": "来自SNMPv2 CONF的MODULE-COMPLIANCE、OBJECT-GROUP、NOTIFICATION-GROUP——RFC2580"
    },
    {
      "indent": 4,
      "text": "SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC 3411",
      "zh-CHS": "SNMP-FRAMEWORK-MIB中的snmpadmin安装——RFC 3411"
    },
    {
      "indent": 4,
      "text": "SipTCTransportProtocol, SipTCMethodName, SipTCEntityRole, SipTCOptionTagHeaders FROM SIP-TC-MIB -- RFC 4780",
      "zh-CHS": "SipTCTransportProtocol、SipTCMethodName、SipTCEntityRole、SIPTCoptionTagHeader来自SIP-TC-MIB——RFC 4780"
    },
    {
      "indent": 4,
      "text": "applIndex FROM NETWORK-SERVICES-MIB -- RFC 2788",
      "zh-CHS": "来自NETWORK-SERVICES-MIB的applIndex--RFC 2788"
    },
    {
      "indent": 4,
      "text": "InetPortNumber FROM INET-ADDRESS-MIB; -- RFC 4001",
      "zh-CHS": "INET-ADDRESS-MIB中的InetPortNumber；--RFC 4001"
    },
    {
      "indent": 0,
      "text": "sipCommonMIB MODULE-IDENTITY LAST-UPDATED \"200704200000Z\" ORGANIZATION \"IETF Session Initiation Protocol Working Group\" CONTACT-INFO \"SIP WG email: sip@ietf.org",
      "zh-CHS": "sipCommonMIB模块标识最后更新的“200704200000Z”组织“IETF会话启动协议工作组”联系人信息“SIP工作组电子邮件：sip@ietf.org"
    },
    {
      "indent": 14,
      "text": "Co-editor Kevin Lingle Cisco Systems, Inc. postal: 7025 Kit Creek Road P.O. Box 14987 Research Triangle Park, NC 27709 USA email: klingle@cisco.com phone: +1 919 476 2029",
      "zh-CHS": "联合编辑Kevin Lingle Cisco Systems，Inc.邮政编码：美国北卡罗来纳州三角研究公园Kit Creek路7025号邮政信箱14987邮编：27709电子邮件：klingle@cisco.com电话：+19194762029"
    },
    {
      "indent": 14,
      "text": "Co-editor Joon Maeng email: jmaeng@austin.rr.com",
      "zh-CHS": "联合编辑Joon Maeng电子邮件：jmaeng@austin.rr.com"
    },
    {
      "indent": 14,
      "text": "Co-editor Jean-Francois Mule CableLabs",
      "zh-CHS": "联合编辑Jean-Francois Mule CableLabs"
    },
    {
      "indent": 14,
      "text": "postal: 858 Coal Creek Circle Louisville, CO 80027 USA email: jf.mule@cablelabs.com phone: +1 303 661 9100",
      "zh-CHS": "邮寄地址：美国科罗拉多州路易斯维尔市煤溪圈858号，邮编80027，电子邮件：jf。mule@cablelabs.com电话：+13036619100"
    },
    {
      "indent": 4,
      "text": " Co-editor Dave Walker email: drwalker@rogers.com\" DESCRIPTION \"Session Initiation Protocol (SIP) Common MIB module. This module defines objects that may be common to all SIP entities.",
      "zh-CHS": "联合编辑Dave Walker电子邮件：drwalker@rogers.com“描述”会话启动协议（SIP）公共MIB模块。此模块定义所有SIP实体可能共有的对象。"
    },
    {
      "indent": 8,
      "text": "SIP is an application-layer signaling protocol for creating, modifying and terminating multimedia sessions with one or more participants. These sessions include Internet multimedia conferences and Internet telephone calls. SIP is defined in RFC 3261 (June 2002).",
      "zh-CHS": "SIP是一种应用层信令协议，用于创建、修改和终止与一个或多个参与者的多媒体会话。这些会议包括互联网多媒体会议和互联网电话。SIP的定义见RFC 3261（2002年6月）。"
    },
    {
      "indent": 8,
      "text": "This MIB is defined for managing objects that are common to SIP User Agents (UAs), Proxy, Redirect, and Registrar servers. Objects specific to each of these entities MAY be managed using entity specific MIBs defined in other modules.",
      "zh-CHS": "此MIB定义用于管理SIP用户代理（UAs）、代理、重定向和注册服务器通用的对象。可以使用在其他模块中定义的特定于实体的MIB来管理特定于这些实体的对象。"
    },
    {
      "indent": 4,
      "text": "    Copyright (C) The IETF Trust (2007).  This version of\n    this MIB module is part of RFC 4780; see the RFC itself for\n    full legal notices.\"\nREVISION     \"200704200000Z\"\nDESCRIPTION\n    \"Initial version of the IETF SIP-COMMON-MIB module.  This\n     version published as part of RFC 4780.\"\n ::= { mib-2 149 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Top-Level Components of this MIB.\nsipCommonMIBNotifications OBJECT IDENTIFIER ::= { sipCommonMIB 0 }\nsipCommonMIBObjects       OBJECT IDENTIFIER ::= { sipCommonMIB 1 }\nsipCommonMIBConformance   OBJECT IDENTIFIER ::= { sipCommonMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- This MIB contains objects that are common to all SIP entities. --",
      "zh-CHS": "----此MIB包含所有SIP实体通用的对象--"
    },
    {
      "indent": 0,
      "text": "-- Common basic configuration\nsipCommonCfgBase       OBJECT IDENTIFIER ::= { sipCommonMIBObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Protocol timer configuration\nsipCommonCfgTimer      OBJECT IDENTIFIER ::= { sipCommonMIBObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- SIP message summary statistics",
      "zh-CHS": "--SIP消息摘要统计信息"
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryStats  OBJECT IDENTIFIER ::= { sipCommonMIBObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Per method statistics\nsipCommonMethodStats   OBJECT IDENTIFIER ::= { sipCommonMIBObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Per Status code or status code class statistics\nsipCommonStatusCode    OBJECT IDENTIFIER ::= { sipCommonMIBObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Transaction statistics\nsipCommonStatsTrans    OBJECT IDENTIFIER ::= { sipCommonMIBObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Method retry statistics\nsipCommonStatsRetry    OBJECT IDENTIFIER ::= { sipCommonMIBObjects 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Other statistics\nsipCommonOtherStats    OBJECT IDENTIFIER ::= { sipCommonMIBObjects 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Accessible-for-notify objects\nsipCommonNotifObjects  OBJECT IDENTIFIER ::= { sipCommonMIBObjects 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Common Configuration Objects\n--\nsipCommonCfgTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonCfgEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains the common configuration objects applicable\n        to all SIP entities.\"\n    ::= { sipCommonCfgBase 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgEntry OBJECT-TYPE SYNTAX SipCommonCfgEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of common configuration.",
      "zh-CHS": "sipCommonCfgEntry对象类型语法sipCommonCfgEntry MAX-ACCESS不可访问状态当前描述“一行通用配置”。"
    },
    {
      "indent": 4,
      "text": "    Each row represents objects for a particular SIP entity\n    instance present in this system.  applIndex is used to uniquely\n    identify these instances of SIP entities and correlate them\n    through the common framework of the NETWORK-SERVICES-MIB (RFC\n    2788).\"\nINDEX { applIndex }\n::= { sipCommonCfgTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonCfgEntry ::= SEQUENCE {",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": " sipCommonCfgProtocolVersion SnmpAdminString, sipCommonCfgServiceOperStatus INTEGER, sipCommonCfgServiceStartTime TimeTicks, sipCommonCfgServiceLastChange TimeTicks, sipCommonCfgOrganization SnmpAdminString, sipCommonCfgMaxTransactions Unsigned32, sipCommonCfgServiceNotifEnable BITS, sipCommonCfgEntityType SipTCEntityRole }",
      "zh-CHS": "sipCommonCfgProtocolVersion SNMPAdministring，SIPCommonCFGServicePerstatus INTEGER，sipCommonCfgServiceStartTime Ticks，sipCommonCfgServiceLastChange Time Ticks，SIPCommonCFG组织SNMPAdministring，sipCommonCfgMaxTransactions Unsigned32，SIPCommonCFGServiceNotify位，SIPCommonCFGenetityType SipTCEntityRole}"
    },
    {
      "indent": 0,
      "text": "sipCommonCfgProtocolVersion OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object will reflect the version of SIP supported by this\n        SIP entity.  It will follow the same format as SIP version\n        information contained in the SIP messages generated by this SIP\n        entity.  For example, entities supporting SIP version 2 will\n        return 'SIP/2.0' as dictated by the standard.\"\n    REFERENCE\n       \"RFC 3261, Section 7.1\"\n    ::= { sipCommonCfgEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgServiceOperStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                  unknown(1),\n                  up(2),\n                  down(3),\n                  congested(4),\n                  restarting(5),\n                  quiescing(6),\n                  testing(7)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the current operational state of\n        the SIP application.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "unknown : The operational status cannot be determined for some reason. up : The application is operating normally and is processing (receiving and possibly issuing) SIP requests and responses. down : The application is currently unable to process SIP messages. congested : The application is operational but no additional",
      "zh-CHS": "未知：由于某种原因无法确定操作状态。up：应用程序运行正常，正在处理（接收并可能发出）SIP请求和响应。关闭：应用程序当前无法处理SIP消息。拥塞：应用程序可以运行，但没有额外的"
    },
    {
      "indent": 8,
      "text": " inbound transactions can be accommodated at the moment. restarting : The application is currently unavailable, but it is in the process of restarting and will presumably, soon be able to process SIP messages. quiescing : The application is currently operational but has been administratively put into quiescence mode. Additional inbound transactions MAY be rejected. testing : The application is currently in test mode and MAY not be able to process SIP messages.",
      "zh-CHS": "目前可以容纳入站交易。重新启动：应用程序当前不可用，但正在重新启动过程中，可能很快就能处理SIP消息。静止：应用程序当前处于运行状态，但已在管理上进入静止模式。可能会拒绝其他入站交易记录。测试：应用程序当前处于测试模式，可能无法处理SIP消息。"
    },
    {
      "indent": 4,
      "text": "    The operational status values defined for this object are not\n    based on any specific information contained in the SIP\n    standard.\"\n::= { sipCommonCfgEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgServiceStartTime OBJECT-TYPE\n    SYNTAX      TimeTicks\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The value of sysUpTime at the time the SIP entity was last\n        started.  If started prior to the last re-initialization of the\n        local network management subsystem, then this object contains a\n        zero value.\"\n    ::= { sipCommonCfgEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgServiceLastChange OBJECT-TYPE\n    SYNTAX      TimeTicks\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The value of sysUpTime at the time the SIP entity entered its\n        current operational state.  If the current state was entered\n        prior to the last re-initialization of the local network\n        management subsystem, then this object contains a zero value.\"\n    ::= { sipCommonCfgEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgOrganization OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains the organization name that the SIP entity inserts into Organization headers of SIP messages processed by this system. If the string is empty, no Organization header is to be generated.\"",
      "zh-CHS": "SIPCommonCfGorOrganization对象类型语法SNMPAdministring MAX-ACCESS只读状态当前描述“此对象包含SIP实体插入到此系统处理的SIP消息的组织标头中的组织名称。如果字符串为空，则不生成组织标头。”"
    },
    {
      "indent": 4,
      "text": "REFERENCE\n   \"RFC 3261, Section 20.25\"\n::= { sipCommonCfgEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgMaxTransactions OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object indicates the maximum number of simultaneous\n        transactions per second that the SIP entity can manage.  In\n        general, the value of this object SHOULD reflect a level of\n        transaction processing per second that is considered high\n        enough to impact the system's CPU and/or memory resources to\n        the point of deteriorating SIP call processing but not high\n        enough to cause catastrophic system failure.\"\n    ::= { sipCommonCfgEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgServiceNotifEnable OBJECT-TYPE\n    SYNTAX      BITS {\n                  sipCommonServiceColdStart(0),\n                  sipCommonServiceWarmStart(1),\n                  sipCommonServiceStatusChanged(2)\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n       \"This object specifies which SIP service related notifications\n        are enabled.  Each bit represents a specific notification.  If\n        a bit has a value 1, the associated notification is enabled and\n        will be generated by the SIP entity at the appropriate time.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Support for these notifications is OPTIONAL: either none or all notification values are supported. If an implementation does not support this object, it should return a 'noSuchObject' exception to an SNMP GET operation. If notifications are supported, this object's default value SHOULD reflect sipCommonServiceColdStart and sipCommonServiceWarmStart enabled and sipCommonServiceStatusChanged disabled.",
      "zh-CHS": "对这些通知的支持是可选的：不支持任何或所有通知值。如果实现不支持此对象，则应向SNMP GET操作返回“noSuchObject”异常。如果支持通知，此对象的默认值应反映sipCommonServiceColdStart和sipCommonServiceWarmStart已启用和sipCommonServiceStatusChanged已禁用。"
    },
    {
      "indent": 4,
      "text": "    This object value SHOULD persist across reboots.\"\nDEFVAL { { sipCommonServiceColdStart,\n           sipCommonServiceWarmStart } }\n::= { sipCommonCfgEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgEntityType OBJECT-TYPE SYNTAX SipTCEntityRole MAX-ACCESS read-only",
      "zh-CHS": "sipCommonCfgEntityType对象类型语法SipTCEntityRole MAX-ACCESS只读"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n   \"This object identifies the list of SIP entities to which this\n    row is related.  It is defined as a bit map.  Each bit\n    represents a type of SIP entity.  If a bit has value 1, the\n    SIP entity represented by this row plays the role of this\n    entity type.  If a bit has value 0, the SIP entity represented\n    by this row does not act as this entity type.  Combinations\n    of bits can be set when the SIP entity plays multiple SIP\n    roles.\"\n::= { sipCommonCfgEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Support for multiple ports\n--\nsipCommonPortTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonPortEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains the list of ports that each SIP entity in\n        this system is allowed to use.  These ports can be advertised\n        using the Contact header in a REGISTER request or response.\"\n    ::= { sipCommonCfgBase 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonPortEntry OBJECT-TYPE SYNTAX SipCommonPortEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Specification of a particular port.",
      "zh-CHS": "sipCommonPortEntry对象类型语法sipCommonPortEntry MAX-ACCESS不可访问状态当前描述“特定端口的规范”。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex, sipCommonPort }\n::= { sipCommonPortTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonPortEntry ::= SEQUENCE {\n        sipCommonPort                 InetPortNumber,\n        sipCommonPortTransportRcv     SipTCTransportProtocol\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonPort OBJECT-TYPE SYNTAX InetPortNumber (1..65535) MAX-ACCESS not-accessible STATUS current",
      "zh-CHS": "sipCommonPort对象类型语法InetPortNumber（1..65535）MAX-ACCESS不可访问状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n   \"This object reflects a particular port that can be used by the\n    SIP application.\"\n::= { sipCommonPortEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonPortTransportRcv OBJECT-TYPE SYNTAX SipTCTransportProtocol MAX-ACCESS read-only STATUS current DESCRIPTION \"This object will specify the transport protocol the SIP entity will use to receive SIP messages.",
      "zh-CHS": "sipCommonPortTransportRcv对象类型语法SipTCTransportProtocol MAX-ACCESS只读状态当前描述“此对象将指定SIP实体将用于接收SIP消息的传输协议。"
    },
    {
      "indent": 4,
      "text": "    This object is a bit map.  Each bit represents a transport\n    protocol.  If a bit has value 1, then that transport protocol\n    is currently being used.  If a bit has value 0, then that\n    transport protocol is currently not being used.\"\n::= { sipCommonPortEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Support for SIP option tags (SIP extensions).\n-- SIP extensions MAY be supported or required by SIP entities.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOptionTagTable OBJECT-TYPE SYNTAX SEQUENCE OF SipCommonOptionTagEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table contains a list of the SIP option tags (SIP extensions) that are either required, supported, or unsupported by the SIP entity. These option tags are used in the Require, Proxy-Require, Supported, and Unsupported header fields.",
      "zh-CHS": "sipCommonOptionTagTable SIPCommonOptionAgentry MAX-ACCESS的对象类型语法序列不可访问状态当前描述“此表包含SIP选项标记（SIP扩展）的列表SIP实体需要、支持或不支持的。这些选项标记用于Require、Proxy Require、supported和unsupported标头字段。"
    },
    {
      "indent": 8,
      "text": "Example: If a user agent client supports, and requires the server to support, reliability of provisional responses (RFC 3262), this table contains a row with the option tag string '100rel' in sipCommonOptionTag and the OCTET STRING value of '1010 0000' or '0xA0' in sipCommonOptionTagHeaderField.",
      "zh-CHS": "示例：如果用户代理客户端支持并要求服务器支持临时响应的可靠性（RFC 3262），则此表包含一行，其中sipCommonOptionTag中的选项标记字符串“100rel”，sipCommonOptionTagHeaderField中的八位字节字符串值为“1010 0000”或“0xA0”。"
    },
    {
      "indent": 8,
      "text": "If a server does not support the required feature (indicated in a Require header to a UAS, or in a Proxy-Require to a Proxy Server), the server returns a 420 Bad Extension listing the feature in an Unsupported header.",
      "zh-CHS": "如果服务器不支持所需功能（在UAS的Require头或代理服务器的Require代理中指示），服务器将返回420 Bad扩展名，在不支持的头中列出该功能。"
    },
    {
      "indent": 8,
      "text": "Normally, the list of such features supported by an entity is static (i.e., will not change over time).\"",
      "zh-CHS": "通常，实体支持的此类功能列表是静态的（即不会随时间而改变）。”"
    },
    {
      "indent": 4,
      "text": "REFERENCE\n   \"RFC 3261, Sections 19.2, 20.32, 20.29, 20.37, and 20.40\"\n::= { sipCommonCfgBase 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOptionTagEntry OBJECT-TYPE SYNTAX SipCommonOptionTagEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A particular SIP option tag (extension) supported or unsupported by the SIP entity, and which may be supported or required by a peer.",
      "zh-CHS": "SIPCommonOptionAgentry对象类型语法SIPCommonOptionAgentry MAX-ACCESS不可访问状态当前描述“SIP实体支持或不支持的特定SIP选项标记（扩展），对等方可能支持或需要该标记。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through the\n    common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex, sipCommonOptionTagIndex }\n::= { sipCommonOptionTagTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonOptionTagEntry ::= SEQUENCE {\n        sipCommonOptionTagIndex        Unsigned32,\n        sipCommonOptionTag             SnmpAdminString,\n        sipCommonOptionTagHeaderField  SipTCOptionTagHeaders\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOptionTagIndex OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This object uniquely identifies a conceptual row in the table.\"\n    ::= { sipCommonOptionTagEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOptionTag OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object indicates the SIP option tag.  The option tag names\n       are registered with IANA and available at http://www.iana.org.\"\n    REFERENCE \"RFC 3261, Section 27.1\"\n    ::= { sipCommonOptionTagEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOptionTagHeaderField OBJECT-TYPE SYNTAX SipTCOptionTagHeaders MAX-ACCESS read-only STATUS current",
      "zh-CHS": "sipCommonOptionTagHeaderField对象类型语法SipTCOptionTagHeaders MAX-ACCESS只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n   \"This object indicates whether the SIP option tag is supported\n    (Supported header), unsupported (Unsupported header), or\n    required (Require or Proxy-Require header) by the SIP entity.\n    A SIP option tag may be both supported and required.\"\n::= { sipCommonOptionTagEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Supported SIP Methods -- sipCommonMethodSupportedTable OBJECT-TYPE SYNTAX SEQUENCE OF SipCommonMethodSupportedEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table contains a list of methods supported by each SIP entity in this system (see the standard set of SIP methods in Section 7.1 of RFC 3261). Any additional methods that may be incorporated into the SIP protocol can be represented by this table without any requirement to update this MIB module.",
      "zh-CHS": "----支持的SIP方法--sipCommonMethodSupportedTable对象类型语法序列SipCommonMethodSupportedEntry MAX-ACCESS不可访问状态当前描述“此表包含此系统中每个SIP实体支持的方法列表（请参阅RFC 3261第7.1节中的标准SIP方法集）。可并入SIP协议的任何附加方法可由该表表示，无需更新该MIB模块。"
    },
    {
      "indent": 8,
      "text": "The table is informational in nature and conveys capabilities of the managed system to the SNMP Manager.",
      "zh-CHS": "该表本质上是信息性的，将受管系统的功能传递给SNMP管理器。"
    },
    {
      "indent": 1,
      "text": "       From a protocol point of view, the list of methods advertised\n       by the SIP entity in the Allow header (Section 20.5 of RFC\n       3261) MUST be consistent with the methods reflected in this\n       table.\"\n::= { sipCommonCfgBase 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonMethodSupportedEntry OBJECT-TYPE SYNTAX SipCommonMethodSupportedEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A particular method supported by the SIP entity.",
      "zh-CHS": "sipCommonMethodSupportedEntry对象类型语法sipCommonMethodSupportedEntry MAX-ACCESS不可访问状态当前描述“SIP实体支持的特定方法。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex, sipCommonMethodSupportedIndex }\n::= { sipCommonMethodSupportedTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonMethodSupportedEntry ::= SEQUENCE {\n        sipCommonMethodSupportedIndex     Unsigned32,\n        sipCommonMethodSupportedName      SipTCMethodName\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonMethodSupportedIndex OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This object uniquely identifies a conceptual row in the table and reflects an assigned number used to identify a specific SIP method.",
      "zh-CHS": "sipCommonMethodSupportedIndex对象类型语法Unsigned32（1..4294967295）MAX-ACCESS不可访问状态当前描述“此对象唯一标识表中的概念行，并反映用于标识特定SIP方法的分配号。"
    },
    {
      "indent": 4,
      "text": "    This identifier is suitable for referencing the associated\n    method throughout this and other MIBs supported by this managed\n    system.\"\n::= { sipCommonMethodSupportedEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonMethodSupportedName OBJECT-TYPE\n    SYNTAX      SipTCMethodName\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the supported method's name.  The method\n        name MUST be all upper case (e.g., 'INVITE').\"\n ::= { sipCommonMethodSupportedEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- SIP Timer Configuration\n--\nsipCommonCfgTimerTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonCfgTimerEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains timer configuration objects applicable to\n        SIP user agent and SIP stateful Proxy Server entities.\"\n    ::= { sipCommonCfgTimer 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerEntry OBJECT-TYPE SYNTAX SipCommonCfgTimerEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of timer configuration.",
      "zh-CHS": "sipCommonCfgTimerEntry对象类型语法sipCommonCfgTimerEntry MAX-ACCESS不可访问状态当前描述“一行计时器配置”。"
    },
    {
      "indent": 8,
      "text": "Each row represents those objects for a particular SIP entity present in this system. applIndex is used to uniquely identify these instances of SIP entities and correlate them through the common framework of the NETWORK-SERVICES-MIB (RFC 2788). The objects in this table entry SHOULD be non-volatile and their value SHOULD be kept at reboot.\"",
      "zh-CHS": "每一行表示该系统中存在的特定SIP实体的对象。applIndex用于唯一标识SIP实体的这些实例，并通过NETWORK-SERVICES-MIB（RFC 2788）的公共框架将它们关联起来。此表项中的对象应是非易失性的，并且应在重新启动时保留其值。”"
    },
    {
      "indent": 4,
      "text": "INDEX { applIndex }\n::= { sipCommonCfgTimerTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonCfgTimerEntry ::= SEQUENCE {\n        sipCommonCfgTimerA               Unsigned32,\n        sipCommonCfgTimerB               Unsigned32,\n        sipCommonCfgTimerC               Unsigned32,\n        sipCommonCfgTimerD               Unsigned32,\n        sipCommonCfgTimerE               Unsigned32,\n        sipCommonCfgTimerF               Unsigned32,\n        sipCommonCfgTimerG               Unsigned32,\n        sipCommonCfgTimerH               Unsigned32,\n        sipCommonCfgTimerI               Unsigned32,\n        sipCommonCfgTimerJ               Unsigned32,\n        sipCommonCfgTimerK               Unsigned32,\n        sipCommonCfgTimerT1              Unsigned32,\n        sipCommonCfgTimerT2              Unsigned32,\n        sipCommonCfgTimerT4              Unsigned32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerA OBJECT-TYPE\n    SYNTAX      Unsigned32 (100..1000)\n    UNITS      \"milliseconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the initial value for the retransmit timer\n        for the INVITE method.  The retransmit timer doubles after each\n        retransmission, ensuring an exponential backoff in network\n        traffic.  This object represents the initial time a SIP entity\n        will wait to receive a provisional response to an INVITE before\n        resending the INVITE request.\"\n    REFERENCE\n       \"RFC 3261, Section 17.1.1.2\"\n    DEFVAL { 500 }\n    ::= { sipCommonCfgTimerEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerB OBJECT-TYPE SYNTAX Unsigned32 (32000..300000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the maximum time a SIP entity will wait to receive a final response to an INVITE. The timer is started upon transmission of the initial INVITE request.\" REFERENCE \"RFC 3261, Section 17.1.1.2\"",
      "zh-CHS": "sipCommonCfgTimerB对象类型语法Unsigned32（32000..300000）单位“毫秒”最大访问只读状态当前描述“此对象反映SIP实体等待接收对INVITE的最终响应的最长时间。计时器在传输初始INVITE请求时启动。”参考“RFC 3261，第17.1.1.2节”"
    },
    {
      "indent": 0,
      "text": "    DEFVAL { 32000 }\n::= { sipCommonCfgTimerEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerC OBJECT-TYPE\n    SYNTAX      Unsigned32 (180000..300000)\n    UNITS      \"milliseconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the maximum time a SIP Proxy Server will\n        wait to receive a provisional response to an INVITE.  The Timer\n        C MUST be set for each client transaction when an INVITE\n        request is proxied.\"\n    REFERENCE\n       \"RFC 3261, Section 16.6\"\n    DEFVAL { 180000 }\n    ::= { sipCommonCfgTimerEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerD OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..300000)\n    UNITS      \"milliseconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the amount of time that the server\n        transaction can remain in the 'Completed' state when unreliable\n        transports are used.  The default value MUST be equal to or\n        greater than 32000 for UDP transport, and its value MUST be 0\n        for TCP/SCTP transport.\"\n    REFERENCE\n       \"RFC 3261, Section 17.1.1.2\"\n    DEFVAL { 32000 }\n    ::= { sipCommonCfgTimerEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerE OBJECT-TYPE SYNTAX Unsigned32 (100..1000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the initial value for the retransmit timer for a non-INVITE method while in 'Trying' state. The retransmit timer doubles after each retransmission until it reaches T2 to ensure an exponential backoff in network traffic. This object represents the initial time a SIP entity will wait to receive a provisional response to the request before resending the non-INVITE request.\" REFERENCE",
      "zh-CHS": "sipCommonCfgTimerE对象类型语法Unsigned32（100..1000）单位“毫秒”最大访问只读状态当前说明“此对象反映处于“尝试”状态的非INVITE方法的重新传输计时器的初始值。重传计时器在每次重传后加倍，直到达到T2，以确保网络流量呈指数衰减。此对象表示SIP实体在重新发送非INVITE请求之前等待接收请求临时响应的初始时间。“参考"
    },
    {
      "indent": 4,
      "text": "   \"RFC 3261, Section 17.1.2.2\"\nDEFVAL { 500 }\n::= { sipCommonCfgTimerEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerF OBJECT-TYPE SYNTAX Unsigned32 (32000..300000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the maximum time a SIP entity will wait to receive a final response to a non-INVITE request. The timer is started upon transmission of the initial request.\" REFERENCE \"RFC 3261, Section 17.1.2.2\" DEFVAL { 32000 }",
      "zh-CHS": "sipCommonCfgTimerF对象类型语法Unsigned32（32000..300000）单位“毫秒”最大访问只读状态当前描述“此对象反映SIP实体等待接收非INVITE请求的最终响应的最长时间。计时器在传输初始请求时启动。”参考“RFC 3261，第17.1.2.2节”定义{32000}"
    },
    {
      "indent": 4,
      "text": "::= { sipCommonCfgTimerEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerG  OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..1000)\n    UNITS      \"milliseconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the initial value for the retransmit timer\n        for final responses to INVITE requests.  If timer G fires, the\n        response is passed to the transport layer again for\n        retransmission, and timer G is set to fire in MIN(2*T1, T2)\n        seconds.  From then on, when timer G fires, the response is\n        passed to the transport again for transmission, and timer G is\n        reset with a value that doubles, unless that value exceeds T2,\n        in which case, it is reset with the value of T2.  The default\n        value MUST be T1 for UDP transport, and its value MUST be 0 for\n        reliable transport like TCP/SCTP.\"\n    REFERENCE\n       \"RFC 3261, Section 17.2.1\"\n    DEFVAL { 500 }\n    ::= { sipCommonCfgTimerEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerH OBJECT-TYPE SYNTAX Unsigned32 (32000..300000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the maximum time a server will wait to receive an ACK before it abandons retransmitting the response.",
      "zh-CHS": "sipCommonCfgTimerH对象类型语法Unsigned32（32000..300000）单位“毫秒”最大访问只读状态当前描述“此对象反映服务器在放弃重新传输响应之前等待接收ACK的最长时间。"
    },
    {
      "indent": 4,
      "text": "    The timer is started upon entering the 'Completed' state.\"\nREFERENCE\n   \"RFC 3261, Section 17.2.1\"\nDEFVAL { 32000 }\n::= { sipCommonCfgTimerEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerI OBJECT-TYPE SYNTAX Unsigned32 (0..10000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the maximum time a SIP entity will wait to receive additional ACK message retransmissions.",
      "zh-CHS": "sipCommonCfgTimerI对象类型语法Unsigned32（0..10000）单位“毫秒”最大访问只读状态当前描述“此对象反映SIP实体等待接收额外ACK消息重传的最长时间。"
    },
    {
      "indent": 4,
      "text": "    The timer is started upon entering the 'Confirmed' state.  The\n    default value MUST be T4 for UDP transport and its value MUST\n    be 0 for reliable transport like TCP/SCTP.\"\nREFERENCE\n   \"RFC 3261, Section 17.2.1\"\nDEFVAL { 5000 }\n::= { sipCommonCfgTimerEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerJ  OBJECT-TYPE\n    SYNTAX      Unsigned32 (32000..300000)\n    UNITS      \"milliseconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the maximum time a SIP server will wait to\n        receive retransmissions of non-INVITE requests.  The timer is\n        started upon entering the 'Completed' state for non-INVITE\n        transactions.  When timer J fires, the server MUST transition to\n        the 'Terminated' state.\"\n    REFERENCE\n       \"RFC 3261, Section 17.2.2\"\n    DEFVAL { 32000 }\n    ::= { sipCommonCfgTimerEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerK OBJECT-TYPE SYNTAX Unsigned32 (0..10000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the maximum time a SIP client will wait to receive retransmissions of responses to non-INVITE requests. The timer is started upon entering the 'Completed' state for",
      "zh-CHS": "sipCommonCfgTimerK对象类型语法Unsigned32（0..10000）单位“毫秒”最大访问只读状态当前描述“此对象反映SIP客户端等待接收对非INVITE请求的响应的重新传输的最长时间。计时器在进入请求的“完成”状态时启动"
    },
    {
      "indent": 4,
      "text": "    non-INVITE transactions.  When timer K fires, the server MUST\n    transition to the 'Terminated' state.  The default value MUST\n    be T4 for UDP transport, and its value MUST be 0 for reliable\n    transport like TCP/SCTP.\"\nREFERENCE\n   \"RFC 3261, Section 17.1.2.2\"\nDEFVAL { 5000 }\n::= { sipCommonCfgTimerEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerT1  OBJECT-TYPE\n    SYNTAX      Unsigned32 (200..10000)\n    UNITS      \"milliseconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the T1 timer for a SIP entity.  T1 is an\n        estimate of the round-trip time (RTT) between the client and\n        server transactions.\"\n    REFERENCE\n       \"RFC 3261, Section 17\"\n    DEFVAL { 500 }\n    ::= { sipCommonCfgTimerEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerT2  OBJECT-TYPE\n    SYNTAX      Unsigned32 (200..10000)\n    UNITS      \"milliseconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the T2 timer for a SIP entity.  T2 is the\n        maximum retransmit interval for non-INVITE requests and INVITE\n        responses.  It's used in various parts of the protocol to reset\n        other Timer* objects to this value.\"\n    REFERENCE\n       \"RFC 3261, Section 17\"\n    DEFVAL { 4000 }\n    ::= { sipCommonCfgTimerEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonCfgTimerT4 OBJECT-TYPE SYNTAX Unsigned32 (200..10000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the T4 timer for a SIP entity. T4 is the maximum duration a message will remain in the network. It represents the amount of time the network will take to clear messages between client and server transactions. It's used in",
      "zh-CHS": "sipCommonCfgTimerT4对象类型语法Unsigned32（200..10000）单位“毫秒”最大访问只读状态当前说明“此对象反映SIP实体的T4计时器。T4是消息在网络中的最长持续时间。它表示网络清除客户端和服务器事务之间的消息所需的时间。它被用在"
    },
    {
      "indent": 4,
      "text": "    various parts of the protocol to reset other Timer* objects to\n    this value.\"\nREFERENCE\n   \"RFC 3261, Section 17\"\nDEFVAL { 5000 }\n::= { sipCommonCfgTimerEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Common Statistics Objects --",
      "zh-CHS": "----通用统计对象--"
    },
    {
      "indent": 0,
      "text": "--\n-- Summary Statistics\n--\nsipCommonSummaryStatsTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonSummaryStatsEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains the summary statistics objects applicable\n        to all SIP entities.  Each row represents those objects for a\n        particular SIP entity present in this system.\"\n    ::= { sipCommonSummaryStats 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryStatsEntry OBJECT-TYPE SYNTAX SipCommonSummaryStatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of summary statistics.",
      "zh-CHS": "SIPCommonSummaryStatEntry对象类型语法SIPCommonSummaryStatEntry MAX-ACCESS不可访问状态当前描述“一行摘要统计信息。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex }\n::= { sipCommonSummaryStatsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonSummaryStatsEntry ::= SEQUENCE {\n        sipCommonSummaryInRequests         Counter32,\n        sipCommonSummaryOutRequests        Counter32,\n        sipCommonSummaryInResponses        Counter32,\n        sipCommonSummaryOutResponses       Counter32,\n        sipCommonSummaryTotalTransactions  Counter32,\n        sipCommonSummaryDisconTime         TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryInRequests OBJECT-TYPE",
      "zh-CHS": "sipCommonSummaryInRequests对象类型"
    },
    {
      "indent": 4,
      "text": "SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates the total number of SIP request messages received by the SIP entity, including retransmissions.",
      "zh-CHS": "语法计数器32 MAX-ACCESS只读状态当前描述“此对象表示SIP实体接收的SIP请求消息总数，包括重传。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonSummaryDisconTime object in the same\n    row.\"\n::= { sipCommonSummaryStatsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryOutRequests OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains the total number of SIP request messages sent out (originated and relayed) by the SIP entity. Where a particular message is sent more than once, for example as a retransmission or as a result of forking, each transmission is counted separately.",
      "zh-CHS": "sipCommonSummaryOutRequests对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含发送（原始和中继）的SIP请求消息总数由SIP实体发送。如果某个特定消息被多次发送，例如作为重传或分叉的结果，则每次传输都被单独计算。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonSummaryDisconTime object in the same\n    row.\"\n::= { sipCommonSummaryStatsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryInResponses OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains the total number of SIP response messages received by the SIP entity, including retransmissions.",
      "zh-CHS": "sipCommonSummaryInResponses对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含SIP实体接收的SIP响应消息总数，包括重传。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonSummaryDisconTime object in the same\n    row.\"\n::= { sipCommonSummaryStatsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryOutResponses OBJECT-TYPE",
      "zh-CHS": "sipCommonSummaryOutResponses对象类型"
    },
    {
      "indent": 4,
      "text": "SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains the total number of SIP response messages sent (originated and relayed) by the SIP entity including retransmissions.",
      "zh-CHS": "语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含SIP实体发送（发起和中继）的SIP响应消息总数，包括重传。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonSummaryDisconTime object in the same\n    row.\"\n::= { sipCommonSummaryStatsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryTotalTransactions OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains a count of the number of transactions that are in progress and transactions that have reached the 'Terminated' state. It is not applicable to stateless SIP Proxy Servers.",
      "zh-CHS": "sipCommonSummaryTotalTransactions对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含正在进行的事务数和已达到“终止”状态的事务数。它不适用于无状态SIP代理服务器。"
    },
    {
      "indent": 8,
      "text": "A SIP transaction occurs between a client and a server, and comprises all messages from the first request sent from the client to the server, up to a final (non-1xx) response sent from the server to the client.",
      "zh-CHS": "SIP事务发生在客户端和服务器之间，包括从客户端发送到服务器的第一个请求到从服务器发送到客户端的最终（非1xx）响应的所有消息。"
    },
    {
      "indent": 8,
      "text": "If the request is INVITE and the final response is a non-2xx, the transaction also include an ACK to the response. The ACK for a 2xx response to an INVITE request is a separate transaction.",
      "zh-CHS": "如果请求为INVITE且最终响应为非2xx，则事务还包括对响应的确认。INVITE请求的2xx响应的ACK是一个单独的事务。"
    },
    {
      "indent": 8,
      "text": "The branch ID parameter in the Via header field values serves as a transaction identifier.",
      "zh-CHS": "Via标头字段值中的分支ID参数用作事务标识符。"
    },
    {
      "indent": 8,
      "text": "A transaction is identified by the CSeq sequence number within a single call leg. The ACK request has the same CSeq number as the corresponding INVITE request, but comprises a transaction of its own.",
      "zh-CHS": "事务由单个呼叫分支内的CSeq序列号标识。ACK请求与相应的INVITE请求具有相同的CSeq号，但包含自己的事务。"
    },
    {
      "indent": 8,
      "text": "In the case of a forked request, each branch counts as a single transaction.",
      "zh-CHS": "在分叉请求的情况下，每个分支都算作一个事务。"
    },
    {
      "indent": 8,
      "text": "For a transaction stateless Proxy Server, this counter is always 0.",
      "zh-CHS": "对于事务无状态代理服务器，此计数器始终为0。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonSummaryDisconTime object in the same\n    row.\"\n::= { sipCommonSummaryStatsEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonSummaryDisconTime  OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The value of the sysUpTime object when the counters for the\n        summary statistics objects in this row last experienced a\n        discontinuity.\"\n    ::= { sipCommonSummaryStatsEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- SIP Method Statistics\n-- Total counts for each SIP method.\n--\nsipCommonMethodStatsTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonMethodStatsEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains the method statistics objects for SIP\n        entities.  Each row represents those objects for a particular\n        SIP entity present in this system.\"\n    ::= { sipCommonMethodStats 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonMethodStatsEntry OBJECT-TYPE SYNTAX SipCommonMethodStatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of per entity method statistics.",
      "zh-CHS": "SIPCommonMethodStatEntry对象类型语法SIPCommonMethodStatEntry MAX-ACCESS不可访问状态当前描述“每个实体的一行方法统计信息。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex, sipCommonMethodStatsName }\n::= { sipCommonMethodStatsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonMethodStatsEntry ::= SEQUENCE {\n        sipCommonMethodStatsName   SipTCMethodName,\n        sipCommonMethodStatsOutbounds    Counter32,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "sipCommonMethodStatsInbounds Counter32, sipCommonMethodStatsDisconTime TimeStamp",
      "zh-CHS": "sipCommonMethodStatsInbounds计数器32，SIPCommonMethodStatsUnstritime时间戳"
    },
    {
      "indent": 4,
      "text": "}",
      "zh-CHS": "}"
    },
    {
      "indent": 0,
      "text": "sipCommonMethodStatsName OBJECT-TYPE\n    SYNTAX      SipTCMethodName\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This object uniquely identifies the SIP method related to the\n        objects in a particular row.\"\n    ::= { sipCommonMethodStatsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonMethodStatsOutbounds OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the total number of requests sent by the\n        SIP entity, excluding retransmissions.  Retransmissions are\n        counted separately and are not reflected in this counter.  A\n        Management Station can detect discontinuities in this counter\n        by monitoring the sipCommonMethodStatsDisconTime object in the\n        same row.\"\n    REFERENCE\n       \"RFC 3261, Section 7.1\"\n    ::= { sipCommonMethodStatsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonMethodStatsInbounds OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the total number of requests received by\n        the SIP entity.  Retransmissions are counted separately and are\n        not reflected in this counter.  A Management Station can detect\n        discontinuities in this counter by monitoring the\n        sipCommonMethodStatsDisconTime object in the same row.\"\n    REFERENCE\n       \"RFC 3261, Section 7.1\"\n    ::= { sipCommonMethodStatsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonMethodStatsDisconTime OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "SIPCommonMethodStatsUncontrime对象类型语法时间戳MAX-ACCESS只读状态当前说明"
    },
    {
      "indent": 4,
      "text": "   \"The value of the sysUpTime object when the counters for the\n    method statistics objects in this row last experienced a\n    discontinuity.\"\n::= { sipCommonMethodStatsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Support for specific status codes\n--\nsipCommonStatusCodeTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonStatusCodeEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains the list of SIP status codes that each SIP\n        entity in this system has been requested to monitor.  It is the\n        mechanism by which specific status codes are monitored.\n        Entries created in this table must not persist across reboots.\"\n    ::= { sipCommonStatusCode 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeEntry OBJECT-TYPE SYNTAX SipCommonStatusCodeEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This row contains information on a particular SIP status code that the SIP entity has been requested to monitor. Entries created in this table must not persist across reboots.",
      "zh-CHS": "sipCommonStatusCodeEntry对象类型语法sipCommonStatusCodeEntry MAX-ACCESS不可访问状态当前描述“此行包含有关已请求SIP实体监视的特定SIP状态代码的信息。此表中创建的条目在重新启动期间不得持久存在。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex, sipCommonStatusCodeMethod,\n        sipCommonStatusCodeValue }\n::= { sipCommonStatusCodeTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonStatusCodeEntry ::= SEQUENCE {\n        sipCommonStatusCodeMethod     SipTCMethodName,\n        sipCommonStatusCodeValue      Unsigned32,\n        sipCommonStatusCodeIns        Counter32,\n        sipCommonStatusCodeOuts       Counter32,\n        sipCommonStatusCodeRowStatus  RowStatus,\n        sipCommonStatusCodeDisconTime TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeMethod OBJECT-TYPE SYNTAX SipTCMethodName MAX-ACCESS not-accessible",
      "zh-CHS": "sipCommonStatusCodeMethod对象类型语法SipTCMethodName MAX-ACCESS不可访问"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n   \"This object uniquely identifies a conceptual row in the\n    table.\"\n::= { sipCommonStatusCodeEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeValue OBJECT-TYPE\n    SYNTAX      Unsigned32 (100..999)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This object contains a SIP status code value that the SIP\n        entity has been requested to monitor.  All of the other\n        information in the row is related to this value.\"\n    ::= { sipCommonStatusCodeEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeIns OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the total number of response messages received by the SIP entity with the status code value contained in the sipCommonStatusCodeValue column.",
      "zh-CHS": "sipCommonStatusCodeIns对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象反映SIP实体接收的响应消息总数，其状态代码值包含在sipCommonStatusCodeValue列中。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service, or when the\n    monitoring of the status code is temporarily disabled.  A\n    Management Station can detect discontinuities in this counter\n    by monitoring the sipCommonStatusCodeDisconTime object in the\n    same row.\"\n::= { sipCommonStatusCodeEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeOuts OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the total number of response messages sent by the SIP entity with the status code value contained in the sipCommonStatusCodeValue column.",
      "zh-CHS": "sipCommonStatusCodeOuts对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象反映SIP实体发送的响应消息总数，状态代码值包含在sipCommonStatusCodeValue列中。"
    },
    {
      "indent": 8,
      "text": "Discontinuities in the value of this counter can occur at re-initialization of the SIP entity or service, or when the monitoring of the Status code is temporarily disabled. A Management Station can detect discontinuities in this counter by monitoring the sipCommonStatusCodeDisconTime object in the same row.\"",
      "zh-CHS": "当SIP实体或服务重新初始化时，或当状态代码的监视被临时禁用时，此计数器的值可能会出现不连续。管理站可以通过监视同一行中的SIPCommonStatusCodeDiscontraction对象来检测此计数器中的不连续性。”"
    },
    {
      "indent": 4,
      "text": "::= { sipCommonStatusCodeEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The row augmentation in sipCommonStatusCodeNotifTable will be governed by the value of this RowStatus.",
      "zh-CHS": "sipCommonStatusCodeRowStatus对象类型语法RowStatus MAX-ACCESS read create STATUS current DESCRIPTION“sipCommonStatusCodeNotifTable中的行扩充将由此RowStatus的值控制。"
    },
    {
      "indent": 4,
      "text": "    The values 'createAndGo' and 'destroy' are the only valid\n    values allowed for this object.  If a row exists, it will\n    reflect a status of 'active' when queried.\"\n::= { sipCommonStatusCodeEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeDisconTime  OBJECT-TYPE\n    SYNTAX TimeStamp\n    MAX-ACCESS read-only\n    STATUS current\n    DESCRIPTION\n       \"The value of the sysUpTime object when the counters for the\n        status code statistics objects in this row last experienced\n        a discontinuity.\"\n    ::= { sipCommonStatusCodeEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Support for specific status code notifications --",
      "zh-CHS": "----支持特定的状态代码通知--"
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifTable OBJECT-TYPE SYNTAX SEQUENCE OF SipCommonStatusCodeNotifEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table contains objects to control notifications related to particular status codes that each SIP entity in this system has been requested to monitor.",
      "zh-CHS": "sipCommonStatusCodeNotifTable对象类型SipCommonStatusCodeNotifEntry MAX-ACCESS的语法序列不可访问状态当前描述“此表包含用于控制与已请求此系统中的每个SIP实体监视的特定状态代码相关的通知的对象。"
    },
    {
      "indent": 8,
      "text": "There is an entry in this table corresponding to each entry in sipCommonStatusCodeTable. Therefore, this table augments sipCommonStatusCodeTable and utilizes the same index methodology.",
      "zh-CHS": "此表中有一个条目对应于sipCommonStatusCodeTable中的每个条目。因此，该表扩充了sipCommonStatusCodeTable，并采用了相同的索引方法。"
    },
    {
      "indent": 4,
      "text": "    The objects in this table are not included directly in the\n    sipCommonStatusCodeTable simply to keep the status code\n    notification control objects separate from the actual status\n    code statistics.\"\n::= { sipCommonStatusCode 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifEntry OBJECT-TYPE\n    SYNTAX      SipCommonStatusCodeNotifEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This row contains information controlling notifications for a\n        particular SIP status code that the SIP entity has been\n        requested to monitor.\"\n    AUGMENTS { sipCommonStatusCodeEntry }\n    ::= { sipCommonStatusCodeNotifTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonStatusCodeNotifEntry ::= SEQUENCE {\n        sipCommonStatusCodeNotifSend         TruthValue,\n        sipCommonStatusCodeNotifEmitMode     INTEGER,\n        sipCommonStatusCodeNotifThresh       Unsigned32,\n        sipCommonStatusCodeNotifInterval     Unsigned32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifSend OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n       \"This object controls whether a sipCommonStatusCodeNotif is\n        emitted when the status code value specified by\n        sipCommonStatusCodeValue is sent or received.  If the value of\n        this object is 'true', then a notification is sent.  If it is\n        'false', no notification is sent.\n        Note well that a notification MAY be emitted for every message\n        sent or received that contains the particular status code.\n        Depending on the status code involved, this can cause a\n        significant number of notification emissions that could be\n        detrimental to network performance.  Managers are forewarned to\n        be prudent in the use of this object to enable notifications.\n        Look to sipCommonStatusCodeNotifEmitMode for alternative\n        controls for sipCommonStatusCodeNotif emissions.\"\n    DEFVAL { false }\n    ::= { sipCommonStatusCodeNotifEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifEmitMode OBJECT-TYPE\n    SYNTAX      INTEGER {\n                  normal(1),\n                  oneShot(2),\n                  triggered(3)  -- read-only\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "\"The object sipCommonStatusCodeNotifSend MUST be set to 'true' for the values of this object to have any effect. It is RECOMMENDED that the desired emit mode be established by this object prior to setting sipCommonStatusCodeNotifSend to 'true'. This object and the sipCommonStatusCodeNotifSend object can obviously be set independently, but their respective values will have a dependency on each other and the resulting notifications.",
      "zh-CHS": "“对象sipCommonStatusCodeNotifSend必须设置为'true'，此对象的值才能生效。建议在将sipCommonStatusCodeNotifSend设置为'true'之前，由此对象建立所需的发射模式。此对象和sipCommonStatusCodeNotifSend对象显然可以单独设置，但它们的spective值将相互依赖，并生成通知。"
    },
    {
      "indent": 8,
      "text": "This object specifies the mode for emissions of sipCommonStatusCodeNotif notifications.",
      "zh-CHS": "此对象指定sipCommonStatusCodeNotif通知的发射模式。"
    },
    {
      "indent": 8,
      "text": "normal : sipCommonStatusCodeNotif notifications will be emitted by the system for each SIP response message sent or received that contains the desired status code.",
      "zh-CHS": "正常：系统将为发送或接收的每个包含所需状态代码的SIP响应消息发出sipCommonStatusCodeNotif通知。"
    },
    {
      "indent": 8,
      "text": "oneShot : Only one sipCommonStatusCodeNotif notification will be emitted. It will be the next SIP response message sent or received that contains the desired status code.",
      "zh-CHS": "一次性：仅发出一个sipCommonStatusCodeNotif通知。它将是下一个发送或接收的包含所需状态代码的SIP响应消息。"
    },
    {
      "indent": 20,
      "text": "No more notifications are emitted until this object is set to 'oneShot' again or set to 'normal'. This option is provided as a means of quelling the potential promiscuous behavior that can be associated with the sipCommonStatusCodeNotif.",
      "zh-CHS": "在再次将此对象设置为“oneShot”或设置为“normal”之前，不会发出更多通知。提供此选项是为了抑制可能与sipCommonStatusCodeNotif相关的潜在滥交行为。"
    },
    {
      "indent": 4,
      "text": "    triggered : This value is only readable and cannot be set.  It\n                reflects that the 'oneShot' case has occurred,\n                and indicates that the mode needs to be reset to\n                get further notifications.  The mode is reset by\n                setting this object to 'oneShot' or 'normal'.\"\nDEFVAL { oneShot }\n::= { sipCommonStatusCodeNotifEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifThresh OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies the number of response messages sent or received by this system that are considered excessive. Based on crossing that threshold, a sipCommonStatusCodeThreshExceededInNotif notification or a sipCommonStatusCodeThreshExceededOutNotif will be sent. The sipCommonStatusCodeThreshExceededInNotif and",
      "zh-CHS": "sipCommonStatusCodeNotifThresh对象类型语法Unsigned32 MAX-ACCESS读写状态当前说明“此对象指定此系统发送或接收的被认为过多的响应消息数。基于超过该阈值，将发送SIPCommonStatusCodeThreshExceedEndNotif通知或SIPCommonStatusCodeThreshExceedEndNotif。SIPCommonStatusCodeThresh超过了Dindenotif和"
    },
    {
      "indent": 8,
      "text": "sipCommonStatusCodeThreshExceededOutNotif notifications can be used as an early warning mechanism in lieu of using sipCommonStatusCodeNotif.",
      "zh-CHS": "sipCommonStatusCodeThreshExceededOutNotif通知可以用作早期预警机制，而不是使用sipCommonStatusCodeNotif。"
    },
    {
      "indent": 4,
      "text": "    Note that the configuration applied by this object will be\n    applied equally to inbound and outbound response messages.\"\nDEFVAL { 500 }\n::= { sipCommonStatusCodeNotifEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifInterval OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies the time interval over which, if sipCommonStatusCodeThresh is exceeded with respect to sent or received messages, a sipCommonStatusCodeThreshExceededInNotif or sipCommonStatusCodeThreshExceededOutNotif notification will be sent.",
      "zh-CHS": "SIPCommonStatusCodeNotifiInterval对象类型语法无符号32单位“秒”最大访问读写状态当前说明“此对象指定一个时间间隔，如果发送或接收的消息超过sipCommonStatusCodeThresh，则将发送sipCommonStatusCodeThreshExceededInNotif或sipCommonStatusCodeThreshExceededOutNotif通知。"
    },
    {
      "indent": 4,
      "text": "    Note that the configuration applied by this object will be\n    applied equally to inbound and outbound response messages.\"\nDEFVAL { 60 }\n::= { sipCommonStatusCodeNotifEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Transaction Statistics -- sipCommonTransCurrentTable OBJECT-TYPE SYNTAX SEQUENCE OF SipCommonTransCurrentEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table contains information on the transactions currently awaiting definitive responses by each SIP entity in this system.",
      "zh-CHS": "----事务统计信息--sipCommonTransCurrentTable SipCommonTransCurrentEntry MAX-ACCESS的对象类型语法序列不可访问状态当前描述“此表包含有关当前等待此系统中每个SIP实体最终响应的事务的信息。"
    },
    {
      "indent": 4,
      "text": "    This table does not apply to transaction stateless Proxy\n    Servers.\"\n::= { sipCommonStatsTrans 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonTransCurrentEntry OBJECT-TYPE SYNTAX SipCommonTransCurrentEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Information on a particular SIP entity's current transactions.",
      "zh-CHS": "sipCommonTransCurrentEntry对象类型语法sipCommonTransCurrentEntry MAX-ACCESS不可访问状态当前描述“特定SIP实体当前事务的信息。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex }\n::= { sipCommonTransCurrentTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonTransCurrentEntry ::= SEQUENCE {\n        sipCommonTransCurrentactions  Gauge32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonTransCurrentactions OBJECT-TYPE\n    SYNTAX      Gauge32 (0..4294967295)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the number of transactions awaiting\n        definitive (non-1xx) response.  In the case of a forked\n        request, each branch counts as a single transaction\n        corresponding to the entity identified by applIndex.\"\n::= { sipCommonTransCurrentEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- SIP Retry Statistics\n--\n-- This group contains various statistics objects about\n-- retransmission counts.\n--\nsipCommonStatsRetryTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonStatsRetryEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains retry statistics objects applicable to each\n        SIP entity in this system.\"\n    ::= { sipCommonStatsRetry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsRetryEntry OBJECT-TYPE SYNTAX SipCommonStatsRetryEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of retry statistics.",
      "zh-CHS": "sipCommonStatsRetryEntry对象类型语法sipCommonStatsRetryEntry MAX-ACCESS不可访问状态当前描述“一行重试统计信息。"
    },
    {
      "indent": 8,
      "text": "Each row represents those objects for a particular SIP entity present in this system. applIndex is used to uniquely identify these instances of SIP entities and correlate them through the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"",
      "zh-CHS": "每一行表示该系统中存在的特定SIP实体的对象。applIndex用于唯一标识SIP实体的这些实例，并通过NETWORK-SERVICES-MIB（RFC 2788）的公共框架将它们关联起来。”"
    },
    {
      "indent": 4,
      "text": "INDEX { applIndex, sipCommonStatsRetryMethod }\n::= { sipCommonStatsRetryTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonStatsRetryEntry ::= SEQUENCE {\n        sipCommonStatsRetryMethod            SipTCMethodName,\n        sipCommonStatsRetries                Counter32,\n        sipCommonStatsRetryFinalResponses    Counter32,\n        sipCommonStatsRetryNonFinalResponses Counter32,\n        sipCommonStatsRetryDisconTime        TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsRetryMethod OBJECT-TYPE\n    SYNTAX      SipTCMethodName\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This object uniquely identifies the SIP method related to the\n        objects in a row.\"\n    ::= { sipCommonStatsRetryEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsRetries OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the total number of request retransmissions that have been sent by the SIP entity. Note that there could be multiple retransmissions per request.",
      "zh-CHS": "sipCommonStatsRetries对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象反映SIP实体已发送的请求重传总数。请注意，每个请求可能有多个重传。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonStatsRetryDisconTime object in the same\n    row.\"\n::= { sipCommonStatsRetryEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsRetryFinalResponses OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the total number of Final Response retries that have been sent by the SIP entity. Note that there could be multiple retransmissions per request.",
      "zh-CHS": "sipCommonStatsRetryFinalResponses对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象反映SIP实体已发送的最终响应重试总数。请注意，每个请求可能有多个重新传输。"
    },
    {
      "indent": 8,
      "text": "Discontinuities in the value of this counter can occur at re-initialization of the SIP entity or service. A Management Station can detect discontinuities in this counter by",
      "zh-CHS": "在SIP实体或服务重新初始化时，此计数器的值可能会出现不连续。管理站可通过以下方式检测此计数器中的不连续性："
    },
    {
      "indent": 4,
      "text": "    monitoring the sipCommonStatsRetryDisconTime object in the same\n    row.\"\n::= { sipCommonStatsRetryEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsRetryNonFinalResponses OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects the total number of non-Final Response retries that have been sent by the SIP entity.",
      "zh-CHS": "SIPCommonStatsRetryOnFinalResponses对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象反映SIP实体已发送的非最终响应重试总数。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonStatsRetryDisconTime object in the same\n    row.\"\n::= { sipCommonStatsRetryEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsRetryDisconTime  OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The value of the sysUpTime object when the counters for the\n        retry statistics objects in this row last experienced a\n        discontinuity.\"\n    ::= { sipCommonStatsRetryEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Other Common Statistics\n--\nsipCommonOtherStatsTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipCommonOtherStatsEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains other common statistics supported by each\n        SIP entity in this system.\"\n    ::= { sipCommonOtherStats 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOtherStatsEntry OBJECT-TYPE SYNTAX SipCommonOtherStatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Information on a particular SIP entity's other common statistics.",
      "zh-CHS": "STANTRY OTHERSTATICS“当前SIPNTRY对象状态统计信息STANTRY OTHERSTATICS特殊语法STANTRY的STANTRY OTHERSTATICS不可访问的STANTRY对象状态STANTRY特殊语法STANTRY OTHERSTATICS。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP entity\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP entities and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\"\nINDEX { applIndex }\n::= { sipCommonOtherStatsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipCommonOtherStatsEntry ::= SEQUENCE {\n        sipCommonOtherStatsNumUnsupportedUris     Counter32,\n        sipCommonOtherStatsNumUnsupportedMethods  Counter32,\n        sipCommonOtherStatsOtherwiseDiscardedMsgs Counter32,\n        sipCommonOtherStatsDisconTime   TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOtherStatsNumUnsupportedUris OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"Number of RequestURIs received with an unsupported scheme. A server normally responds to such requests with a 400 Bad Request status code.",
      "zh-CHS": "sipCommonOtherStatsNumUnsupportedUris对象类型语法计数器32 MAX-ACCESS只读状态当前描述“使用不受支持的方案接收的请求URI的数量。服务器通常使用400错误请求状态代码响应此类请求。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonOtherStatsDisconTime object in the same\n    row.\"\n::= { sipCommonOtherStatsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOtherStatsNumUnsupportedMethods OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"Number of SIP requests received with unsupported methods. A server normally responds to such requests with a 501 (Not Implemented) or 405 (Method Not Allowed).",
      "zh-CHS": "SIPCommonOtherStatsNumSupportedMethods对象类型语法计数器32 MAX-ACCESS只读状态当前描述“使用不支持的方法接收的SIP请求数。服务器通常使用501（未实现）或405（不允许使用方法）响应此类请求。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonOtherStatsDisconTime object in the same\n    row.\"\n::= { sipCommonOtherStatsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOtherStatsOtherwiseDiscardedMsgs OBJECT-TYPE SYNTAX Counter32",
      "zh-CHS": "sipCommonOtherStatsOtherwiseDiscardedMsgs对象类型语法计数器32"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS read-only STATUS current DESCRIPTION \"Number of SIP messages received that, for any number of reasons, was discarded without a response.",
      "zh-CHS": "MAX-ACCESS只读状态当前描述“接收到的SIP消息的数量，这些消息由于各种原因被丢弃而没有响应。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipCommonOtherStatsDisconTime object in the same\n    row.\"\n::= { sipCommonOtherStatsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonOtherStatsDisconTime OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The value of the sysUpTime object when the counters for the\n        statistics objects in this row last experienced a\n        discontinuity.\"\n    ::= { sipCommonOtherStatsEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Notification related objects --",
      "zh-CHS": "----通知相关对象--"
    },
    {
      "indent": 0,
      "text": "--\n-- Status code related notification objects.\n--\nsipCommonStatusCodeNotifTo OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  accessible-for-notify\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the value of the To header in the message\n        containing the status code that caused the notification.  The\n        header name will be part of this object value.  For example,\n        'To: Watson '.\"\n    ::= { sipCommonNotifObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifFrom OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS accessible-for-notify STATUS current DESCRIPTION \"This object contains the value of the From header in the message containing the status code that caused the",
      "zh-CHS": "sipCommonStatusCodeNotifFrom对象类型语法SNMPAdministring MAX-ACCESS可用于notify STATUS current DESCRIPTION“此对象包含消息中From标头的值，该消息包含导致错误的状态代码"
    },
    {
      "indent": 4,
      "text": "    notification.  The header name will be part of this object\n    value.  For example, 'From: Watson '.\"\n::= { sipCommonNotifObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifCallId OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  accessible-for-notify\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the value of the Call-ID in the message\n        containing the status code that caused the notification.  The\n        header name will be part of this object value.  For example,\n        'Call-ID: 5551212@example.com'.\"\n    ::= { sipCommonNotifObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifCSeq OBJECT-TYPE\n    SYNTAX      Unsigned32\n    MAX-ACCESS  accessible-for-notify\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the CSeq value in the message containing\n        the status code that caused the notification.  The header name\n        will be part of this object value.  For example, 'CSeq: 1722\n        INVITE'.\"\n    ::= { sipCommonNotifObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- General notification related objects.\n--\nsipCommonNotifApplIndex OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..2147483647)\n    MAX-ACCESS  accessible-for-notify\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the applIndex as described in RFC 2788.\n        This object is created in order to allow a variable binding\n        containing a value of applIndex in a notification.\"\n    ::= { sipCommonNotifObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonNotifSequenceNumber OBJECT-TYPE SYNTAX Unsigned32 (1..2147483647) MAX-ACCESS accessible-for-notify STATUS current DESCRIPTION \"This object contains a sequence number for each notification generated by this SIP entity. Each notification SHOULD have a unique sequence number. A network manager can use this information to determine whether notifications from a",
      "zh-CHS": "sipCommonNotifSequenceNumber对象类型语法Unsigned32（1..2147483647）MAX-ACCESS可用于通知状态当前描述“此对象包含此SIP实体生成的每个通知的序列号。每个通知应具有唯一的序列号。网络管理器可以使用此信息来确定是否从"
    },
    {
      "indent": 4,
      "text": "    particular SIP entity have been missed.  The value of this\n    object MUST start at 1 and increase by 1 with each generated\n    notification.  If a system restarts, the sequence number MAY\n    start again from 1.\"\n::= { sipCommonNotifObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Notifications\n--\nsipCommonStatusCodeNotif NOTIFICATION-TYPE\n    OBJECTS {\n       sipCommonNotifSequenceNumber,\n       sipCommonNotifApplIndex,\n       sipCommonStatusCodeNotifTo,\n       sipCommonStatusCodeNotifFrom,\n       sipCommonStatusCodeNotifCallId,\n       sipCommonStatusCodeNotifCSeq,\n       sipCommonStatusCodeIns,\n       sipCommonStatusCodeOuts\n    }\n    STATUS      current\n    DESCRIPTION\n       \"Signifies that a specific status code has been sent or received\n        by the system.\"\n    ::= { sipCommonMIBNotifications 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeThreshExceededInNotif NOTIFICATION-TYPE\n    OBJECTS {\n       sipCommonNotifSequenceNumber,\n       sipCommonNotifApplIndex,\n       sipCommonStatusCodeIns\n    }\n    STATUS      current\n    DESCRIPTION\n       \"Signifies that a specific status code was found to have been\n        received by the system frequently enough to exceed the\n        configured threshold.  This notification can be used as\n        an early warning mechanism in lieu of using\n        sipCommonStatusCodeNotif.\"\n    ::= { sipCommonMIBNotifications 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeThreshExceededOutNotif NOTIFICATION-TYPE\n    OBJECTS {\n       sipCommonNotifSequenceNumber,\n       sipCommonNotifApplIndex,\n       sipCommonStatusCodeOuts\n    }\n    STATUS      current",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n   \"Signifies that a specific status code was found to have been\n    sent by the system enough to exceed the configured threshold.\n    This notification can be used as an early warning mechanism in\n    lieu of using sipCommonStatusCodeNotif.\"\n::= { sipCommonMIBNotifications 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonServiceColdStart NOTIFICATION-TYPE\n    OBJECTS {\n       sipCommonNotifSequenceNumber,\n       sipCommonNotifApplIndex,\n       sipCommonCfgServiceStartTime\n    }\n    STATUS      current\n    DESCRIPTION\n       \"Signifies that the SIP service has reinitialized itself or\n        started for the first time.  This SHOULD result from a hard\n        'down' to 'up' administrative status change.  The configuration\n        or behavior of the service MAY be altered.\"\n    ::= { sipCommonMIBNotifications 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonServiceWarmStart NOTIFICATION-TYPE\n    OBJECTS {\n       sipCommonNotifSequenceNumber,\n       sipCommonNotifApplIndex,\n       sipCommonCfgServiceLastChange\n    }\n    STATUS      current\n    DESCRIPTION\n       \"Signifies that the SIP service has reinitialized itself and is\n        restarting after an administrative 'reset'.  The configuration\n        or behavior of the service MAY be altered.\"\n    ::= { sipCommonMIBNotifications 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonServiceStatusChanged NOTIFICATION-TYPE\n    OBJECTS {\n       sipCommonNotifSequenceNumber,\n       sipCommonNotifApplIndex,\n       sipCommonCfgServiceLastChange,\n       sipCommonCfgServiceOperStatus\n    }\n    STATUS      current\n    DESCRIPTION\n       \"Signifies that the SIP service operational status has changed.\"\n    ::= { sipCommonMIBNotifications 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Conformance",
      "zh-CHS": "----一致性"
    },
    {
      "indent": 0,
      "text": "--\nsipCommonMIBCompliances\n    OBJECT IDENTIFIER ::= { sipCommonMIBConformance 1 }\nsipCommonMIBGroups\n    OBJECT IDENTIFIER ::= { sipCommonMIBConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Compliance Statements -- sipCommonCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for SIP entities.\"",
      "zh-CHS": "----合规性声明--sipCommonCompliance MODULE-合规性状态当前描述“SIP实体的合规性声明”"
    },
    {
      "indent": 4,
      "text": "MODULE -- this module MANDATORY-GROUPS { sipCommonConfigGroup, sipCommonStatsGroup }",
      "zh-CHS": "MODULE——此模块为强制组{sipCommonConfigGroup，sipCommonStatsGroup}"
    },
    {
      "indent": 4,
      "text": "OBJECT       sipCommonStatusCodeRowStatus\nSYNTAX       RowStatus { active(1) }\nWRITE-SYNTAX RowStatus { createAndGo(4), destroy(6) }\nDESCRIPTION\n   \"Support for createAndWait and notInService is not required.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "OBJECT sipCommonCfgServiceNotifEnable MIN-ACCESS not-accessible DESCRIPTION \"This object is optional and does not need to be supported.\"",
      "zh-CHS": "对象sipCommonCfgServiceNotifEnable MIN-ACCESS不可访问描述“此对象是可选的，不需要支持。”"
    },
    {
      "indent": 4,
      "text": "GROUP sipCommonInformationalGroup DESCRIPTION \"This group is OPTIONAL. A SIP entity can elect to not provide any support for these objects, as they provide optional information.\"",
      "zh-CHS": "GROUP SIPCommonInformation GROUP DESCRIPTION“此组是可选的。SIP实体可以选择不为这些对象提供任何支持，因为它们提供可选信息。”"
    },
    {
      "indent": 4,
      "text": "GROUP sipCommonConfigTimerGroup DESCRIPTION \"This group is OPTIONAL. A SIP entity can elect to not provide any timer configuration.\"",
      "zh-CHS": "组sipCommonConfigTimerGroup DESCRIPTION“此组是可选的。SIP实体可以选择不提供任何计时器配置。”"
    },
    {
      "indent": 4,
      "text": "GROUP sipCommonStatsRetryGroup DESCRIPTION \"This group is OPTIONAL. A SIP entity can elect to not provide any retry statistics.\"",
      "zh-CHS": "组sipCommonStatsRetryGroup DESCRIPTION“此组是可选的。SIP实体可以选择不提供任何重试统计信息。”"
    },
    {
      "indent": 4,
      "text": "GROUP sipCommonNotifGroup DESCRIPTION",
      "zh-CHS": "组sipCommonNotifGroup描述"
    },
    {
      "indent": 7,
      "text": "\"This group is OPTIONAL. A SIP entity can elect to not provide any notifications. If implemented, the sipCommonStatusCodeNotifGroup and sipCommonNotifObjectsGroup MUST also be implemented.\"",
      "zh-CHS": "此组是可选的。SIP实体可以选择不提供任何通知。如果实现，还必须实现sipCommonStatusCodeNotifGroup和sipCommonNotifObjectsGroup"
    },
    {
      "indent": 4,
      "text": "GROUP sipCommonStatusCodeNotifGroup DESCRIPTION \"This group is OPTIONAL. A SIP entity can elect to not provide any notifications. If implemented, the sipCommonNotifGroup and sipCommonNotifObjectsGroup MUST also be implemented.\"",
      "zh-CHS": "GROUP sipCommonStatusCodeNotifGroup DESCRIPTION“此组是可选的。SIP实体可以选择不提供任何通知。如果实现，还必须实现sipCommonNotifGroup和sipCommonNotifObjectsGroup。”"
    },
    {
      "indent": 4,
      "text": "GROUP sipCommonNotifObjectsGroup DESCRIPTION \"This group is OPTIONAL. A SIP entity can elect to not provide any notifications. If implemented, the sipCommonStatusCodeNotifGroup and sipCommonNotifGroup MUST also be implemented.\"",
      "zh-CHS": "组sipCommonNotifObjectsGroup DESCRIPTION“此组是可选的。SIP实体可以选择不提供任何通知。如果实现，还必须实现sipCommonStatusCodeNotifGroup和sipCommonNotifGroup。”"
    },
    {
      "indent": 4,
      "text": "::= { sipCommonMIBCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Units of Conformance\n--\nsipCommonConfigGroup OBJECT-GROUP\n    OBJECTS {\n            sipCommonCfgProtocolVersion,\n            sipCommonCfgServiceOperStatus,\n            sipCommonCfgServiceStartTime,\n            sipCommonCfgServiceLastChange,\n            sipCommonPortTransportRcv,\n            sipCommonOptionTag,\n            sipCommonOptionTagHeaderField,\n            sipCommonCfgMaxTransactions,\n            sipCommonCfgServiceNotifEnable,\n            sipCommonCfgEntityType,\n            sipCommonMethodSupportedName\n    }\n    STATUS  current\n    DESCRIPTION\n       \"A collection of objects providing configuration common to all\n        SIP entities.\"\n    ::= { sipCommonMIBGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonInformationalGroup OBJECT-GROUP\n    OBJECTS {\n            sipCommonCfgOrganization\n    }\n    STATUS  current",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n   \"A collection of objects providing configuration common to all\n    SIP entities.\"\n::= { sipCommonMIBGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonConfigTimerGroup OBJECT-GROUP\n    OBJECTS {\n            sipCommonCfgTimerA,\n            sipCommonCfgTimerB,\n            sipCommonCfgTimerC,\n            sipCommonCfgTimerD,\n            sipCommonCfgTimerE,\n            sipCommonCfgTimerF,\n            sipCommonCfgTimerG,\n            sipCommonCfgTimerH,\n            sipCommonCfgTimerI,\n            sipCommonCfgTimerJ,\n            sipCommonCfgTimerK,\n            sipCommonCfgTimerT1,\n            sipCommonCfgTimerT2,\n            sipCommonCfgTimerT4\n    }\n    STATUS  current\n    DESCRIPTION\n       \"A collection of objects providing timer configuration common to\n        all SIP entities.\"\n    ::= { sipCommonMIBGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsGroup OBJECT-GROUP OBJECTS { sipCommonSummaryInRequests, sipCommonSummaryOutRequests, sipCommonSummaryInResponses, sipCommonSummaryOutResponses, sipCommonSummaryTotalTransactions, sipCommonSummaryDisconTime, sipCommonMethodStatsOutbounds, sipCommonMethodStatsInbounds, sipCommonMethodStatsDisconTime, sipCommonStatusCodeIns, sipCommonStatusCodeOuts, sipCommonStatusCodeRowStatus, sipCommonStatusCodeDisconTime, sipCommonTransCurrentactions, sipCommonOtherStatsNumUnsupportedUris, sipCommonOtherStatsNumUnsupportedMethods, sipCommonOtherStatsOtherwiseDiscardedMsgs, sipCommonOtherStatsDisconTime",
      "zh-CHS": "sipCommonStatsGroup对象组对象{sipCommonSummaryInRequests、sipCommonSummaryOutRequests、sipCommonSummaryInResponses、sipCommonSummaryOutResponses、sipCommonSummaryTotalTransactions、SIPCommonSummaryDiscontinTime、SIPCommonMethodsStatsOutbounds、SIPCommonMethodsStatsUncontinTime、sipCommonStatusCodeIns、sipCommonStatusCodeOuts、sipCommonStatusCodeRowStat美国，SIPCommonStatusCodeDismittime，SIPCommonTranscurrentations，sipCommonOtherStatsNumUnsupportedUris，sipCommonOtherStatsNumUnsupportedMethods，SIPCommonOtherStatsOtherWiseDiscarteddMsgs，SIPCommonOtherStatsUnmittime"
    },
    {
      "indent": 4,
      "text": "}\nSTATUS  current\nDESCRIPTION\n   \"A collection of objects providing statistics common to all SIP\n    entities.\"\n::= { sipCommonMIBGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatsRetryGroup OBJECT-GROUP\n    OBJECTS {\n             sipCommonStatsRetries,\n             sipCommonStatsRetryFinalResponses,\n             sipCommonStatsRetryNonFinalResponses,\n             sipCommonStatsRetryDisconTime\n    }\n    STATUS  current\n    DESCRIPTION\n       \"A collection of objects providing retry statistics.\"\n    ::= { sipCommonMIBGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonNotifGroup NOTIFICATION-GROUP\n    NOTIFICATIONS {\n            sipCommonStatusCodeNotif,\n            sipCommonStatusCodeThreshExceededInNotif,\n            sipCommonStatusCodeThreshExceededOutNotif,\n            sipCommonServiceColdStart,\n            sipCommonServiceWarmStart,\n            sipCommonServiceStatusChanged\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "STATUS  current\nDESCRIPTION\n   \"A collection of notifications common to all SIP entities.\"\n::= { sipCommonMIBGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonStatusCodeNotifGroup OBJECT-GROUP\n    OBJECTS {\n            sipCommonStatusCodeNotifSend,\n            sipCommonStatusCodeNotifEmitMode,\n            sipCommonStatusCodeNotifThresh,\n            sipCommonStatusCodeNotifInterval\n   }\n    STATUS  current\n    DESCRIPTION\n       \"A collection of objects related to the control and attribution\n        of notifications common to all SIP entities.\"\n    ::= { sipCommonMIBGroups 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipCommonNotifObjectsGroup OBJECT-GROUP",
      "zh-CHS": "sipCommonNotifObjectsGroup对象组"
    },
    {
      "indent": 4,
      "text": "OBJECTS {\n        sipCommonStatusCodeNotifTo,\n        sipCommonStatusCodeNotifFrom,\n        sipCommonStatusCodeNotifCallId,\n        sipCommonStatusCodeNotifCSeq,\n        sipCommonNotifApplIndex,\n        sipCommonNotifSequenceNumber\n}\nSTATUS  current\nDESCRIPTION\n   \"A collection of accessible-for-notify objects related to the\n    notification defined in this MIB module.\"\n::= { sipCommonMIBGroups 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "7.3. SIP User Agent MIB Module",
      "section_title": true,
      "zh-CHS": "7.3. SIP用户代理MIB模块"
    },
    {
      "indent": 0,
      "text": "SIP-UA-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Unsigned32, mib-2 FROM SNMPv2-SMI -- RFC 2578",
      "zh-CHS": "从SNMPv2 SMI--RFC 2578导入模块标识、对象类型、无符号32、mib-2"
    },
    {
      "indent": 4,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP FROM SNMPv2-CONF -- RFC 2580",
      "zh-CHS": "SNMPv2 CONF中的模块遵从性、对象组——RFC 2580"
    },
    {
      "indent": 4,
      "text": "applIndex FROM NETWORK-SERVICES-MIB -- RFC 2788",
      "zh-CHS": "来自NETWORK-SERVICES-MIB的applIndex--RFC 2788"
    },
    {
      "indent": 4,
      "text": "InetAddressType, InetAddress FROM INET-ADDRESS-MIB -- RFC 4001",
      "zh-CHS": "InetAddressType，INET-ADDRESS-MIB中的InetAddress--RFC 4001"
    },
    {
      "indent": 4,
      "text": "SipTCEntityRole FROM SIP-TC-MIB; -- RFC 4780",
      "zh-CHS": "来自SIP-TC-MIB的SIPTCentirole；——RFC 4780"
    },
    {
      "indent": 0,
      "text": "sipUAMIB MODULE-IDENTITY LAST-UPDATED \"200704200000Z\" ORGANIZATION \"IETF Session Initiation Protocol Working Group\" CONTACT-INFO \"SIP WG email: sip@ietf.org",
      "zh-CHS": "sipUAMIB模块标识最后更新的“200704200000Z”组织“IETF会话启动协议工作组”联系人信息“SIP工作组电子邮件：sip@ietf.org"
    },
    {
      "indent": 14,
      "text": "Co-editor Kevin Lingle",
      "zh-CHS": "联合编辑凯文·林格尔"
    },
    {
      "indent": 14,
      "text": " Cisco Systems, Inc. postal: 7025 Kit Creek Road P.O. Box 14987 Research Triangle Park, NC 27709 USA email: klingle@cisco.com phone: +1 919 476 2029",
      "zh-CHS": "思科系统公司邮政：美国北卡罗来纳州三角研究园14987号吉特克里克路7025号邮政信箱27709电子邮件：klingle@cisco.com电话：+19194762029"
    },
    {
      "indent": 14,
      "text": "Co-editor Joon Maeng email: jmaeng@austin.rr.com",
      "zh-CHS": "联合编辑Joon Maeng电子邮件：jmaeng@austin.rr.com"
    },
    {
      "indent": 14,
      "text": "Co-editor Jean-Francois Mule CableLabs postal: 858 Coal Creek Circle Louisville, CO 80027 USA email: jf.mule@cablelabs.com phone: +1 303 661 9100",
      "zh-CHS": "联合编辑Jean-Francois Mule CableLabs邮政编码：858 Coal Creek Circle Louisville，Co 80027美国电子邮件：jf。mule@cablelabs.com电话：+13036619100"
    },
    {
      "indent": 4,
      "text": " Co-editor Dave Walker email: drwalker@rogers.com\" DESCRIPTION \"Session Initiation Protocol (SIP) User Agent (UA) MIB module.",
      "zh-CHS": "联合编辑Dave Walker电子邮件：drwalker@rogers.com“说明”会话启动协议（SIP）用户代理（UA）MIB模块。"
    },
    {
      "indent": 8,
      "text": "SIP is an application-layer signaling protocol for creating, modifying, and terminating multimedia sessions with one or more participants. These sessions include Internet multimedia conferences and Internet telephone calls. SIP is defined in RFC 3261 (June 2002).",
      "zh-CHS": "SIP是一种应用层信令协议，用于创建、修改和终止与一个或多个参与者的多媒体会话。这些会议包括互联网多媒体会议和互联网电话。SIP的定义见RFC 3261（2002年6月）。"
    },
    {
      "indent": 8,
      "text": "A User Agent is an application that contains both a User Agent Client (UAC) and a User Agent Server (UAS). A UAC is an application that initiates a SIP request. A UAS is an application that contacts the user when a SIP request is received and that returns a response on behalf of the user. The response accepts, rejects, or redirects the request.",
      "zh-CHS": "用户代理是同时包含用户代理客户端（UAC）和用户代理服务器（UAS）的应用程序。UAC是启动SIP请求的应用程序。UAS是在收到SIP请求时与用户联系并代表用户返回响应的应用程序。响应接受、拒绝或重定向请求。"
    },
    {
      "indent": 4,
      "text": "    Copyright (C) The IETF Trust (2007).  This version of\n    this MIB module is part of RFC 4780; see the RFC itself for\n    full legal notices.\"\nREVISION        \"200704200000Z\"\nDESCRIPTION\n   \"Initial version of the IETF SIP-UA-MIB module.  This version\n    published as part of RFC 4780.\"\n ::= { mib-2 150 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Top-Level Components of this MIB.\nsipUAMIBObjects        OBJECT IDENTIFIER ::= { sipUAMIB 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipUAMIBConformance    OBJECT IDENTIFIER ::= { sipUAMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- This MIB contains objects related to SIP User Agents.\n--\nsipUACfgServer         OBJECT IDENTIFIER ::= { sipUAMIBObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- SIP Server Configuration\n--\nsipUACfgServerTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipUACfgServerEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains SIP server configuration objects applicable\n        to each SIP user agent in this system.\"\n    ::= { sipUACfgServer 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipUACfgServerEntry OBJECT-TYPE SYNTAX SipUACfgServerEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of server configuration.",
      "zh-CHS": "sipUACfgServerEntry对象类型语法sipUACfgServerEntry MAX-ACCESS不可访问状态当前描述“一行服务器配置”。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP user\n    agent present in this system.  applIndex is used to uniquely\n    identify these instances of SIP user agents and correlate\n    them through the common framework of the NETWORK-SERVICES-MIB\n    (RFC 2788).  The same value of applIndex used in the\n    corresponding SIP-COMMON-MIB is used here.\"\nINDEX { applIndex, sipUACfgServerIndex }\n::= { sipUACfgServerTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipUACfgServerEntry ::= SEQUENCE {\n        sipUACfgServerIndex       Unsigned32,\n        sipUACfgServerAddressType InetAddressType,\n        sipUACfgServerAddress     InetAddress,\n        sipUACfgServerRole        SipTCEntityRole\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipUACfgServerIndex OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A unique identifier of a server address when multiple addresses",
      "zh-CHS": "sipUACfgServerIndex对象类型语法Unsigned32（1..4294967295）MAX-ACCESS不可访问状态当前描述“多个地址时服务器地址的唯一标识符"
    },
    {
      "indent": 4,
      "text": "    are configured by the SIP entity.  If one address isn't\n    reachable, then another can be tried.\"\n::= { sipUACfgServerEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipUACfgServerAddressType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the type of address contained in the\n        associated instance of sipUACfgServerAddress.\"\n    REFERENCE\n       \"INET-ADDRESS-MIB (RFC 4001)\"\n    ::= { sipUACfgServerEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipUACfgServerAddress OBJECT-TYPE\n    SYNTAX      InetAddress\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the address of a SIP server this user\n        agent will use to proxy/redirect calls.  The type of this\n        address is determined by the value of the\n        sipUACfgServerAddressType object.\"\n    REFERENCE \"INET-ADDRESS-MIB (RFC 4001)\"\n    ::= { sipUACfgServerEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipUACfgServerRole OBJECT-TYPE\n    SYNTAX      SipTCEntityRole\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the function of the SIP server this user\n        agent should communicate with: registrar, proxy (outbound\n        proxy), etc.\"\n    ::= { sipUACfgServerEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Conformance\n--\nsipUAMIBCompliances OBJECT IDENTIFIER ::= { sipUAMIBConformance 1 }\nsipUAMIBGroups      OBJECT IDENTIFIER ::= { sipUAMIBConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Compliance Statements -- sipUACompliance MODULE-COMPLIANCE STATUS current",
      "zh-CHS": "----合规性声明--SIPUA合规性模块-合规性状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"The compliance statement for SIP entities that implement the SIP-UA-MIB module.\" MODULE -- this module MANDATORY-GROUPS { sipUAConfigGroup }",
      "zh-CHS": "DESCRIPTION“实现SIP-UA-MIB模块的SIP实体的符合性声明”。模块——此模块必须为-GROUPS{sipUAConfigGroup}"
    },
    {
      "indent": 4,
      "text": "::= { sipUAMIBCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Units of Conformance\n--\nsipUAConfigGroup OBJECT-GROUP\n    OBJECTS {\n            sipUACfgServerAddressType,\n            sipUACfgServerAddress,\n            sipUACfgServerRole\n    }\n    STATUS  current\n    DESCRIPTION\n       \"A collection of objects providing information about the\n        configuration of SIP User Agents.\"\n    ::= { sipUAMIBGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "7.4. SIP Server MIB Module (Proxy, Redirect, and Registrar Servers)",
      "section_title": true,
      "zh-CHS": "7.4. SIP服务器MIB模块（代理服务器、重定向服务器和注册服务器）"
    },
    {
      "indent": 0,
      "text": "SIP-SERVER-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Counter32, Unsigned32, Gauge32, mib-2 FROM SNMPv2-SMI -- RFC 2578",
      "zh-CHS": "从SNMPv2 SMI--RFC 2578导入模块标识、对象类型、计数器32、无符号32、仪表32、mib-2"
    },
    {
      "indent": 4,
      "text": "TruthValue, TimeStamp, DateAndTime FROM SNMPv2-TC -- RFC 2579",
      "zh-CHS": "来自SNMPv2 TC的真实值、时间戳、日期和时间——RFC2579"
    },
    {
      "indent": 4,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP FROM SNMPv2-CONF -- RFC 2580",
      "zh-CHS": "SNMPv2 CONF中的模块遵从性、对象组——RFC 2580"
    },
    {
      "indent": 4,
      "text": "SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC 3411",
      "zh-CHS": "SNMP-FRAMEWORK-MIB中的snmpadmin安装——RFC 3411"
    },
    {
      "indent": 4,
      "text": "applIndex FROM NETWORK-SERVICES-MIB -- RFC 2788",
      "zh-CHS": "来自NETWORK-SERVICES-MIB的applIndex--RFC 2788"
    },
    {
      "indent": 4,
      "text": "InetAddressType, InetAddress FROM INET-ADDRESS-MIB; -- RFC 4001",
      "zh-CHS": "InetAddressType，INET-ADDRESS-MIB中的InetAddress；--RFC 4001"
    },
    {
      "indent": 0,
      "text": "sipServerMIB MODULE-IDENTITY LAST-UPDATED \"200704200000Z\" ORGANIZATION \"IETF Session Initiation Protocol Working Group\" CONTACT-INFO \"SIP WG email: sip@ietf.org",
      "zh-CHS": "sipServerMIB模块标识最后更新的“200704200000Z”组织“IETF会话启动协议工作组”联系人信息“SIP工作组电子邮件：sip@ietf.org"
    },
    {
      "indent": 11,
      "text": "Co-editor: Kevin Lingle Cisco Systems, Inc. postal: 7025 Kit Creek Road P.O. Box 14987 Research Triangle Park, NC 27709 USA email: klingle@cisco.com phone: +1 919 476 2029",
      "zh-CHS": "共同编辑：Kevin Lingle Cisco Systems，Inc.邮政编码：美国北卡罗来纳州三角研究公园Kit Creek路7025号邮政信箱14987邮编：27709电子邮件：klingle@cisco.com电话：+19194762029"
    },
    {
      "indent": 11,
      "text": "Co-editor: Joon Maeng email: jmaeng@austin.rr.com",
      "zh-CHS": "联合编辑：Joon Maeng电子邮件：jmaeng@austin.rr.com"
    },
    {
      "indent": 11,
      "text": "Co-editor: Jean-Francois Mule CableLabs postal: 858 Coal Creek Circle Louisville, CO 80027 USA email: jf.mule@cablelabs.com phone: +1 303 661 9100",
      "zh-CHS": "共同编辑：Jean-Francois Mule CableLabs邮政编码：858 Coal Creek Circle Louisville，Co 80027美国电子邮件：jf。mule@cablelabs.com电话：+13036619100"
    },
    {
      "indent": 4,
      "text": " Co-editor: Dave Walker email: drwalker@rogers.com \" DESCRIPTION \"Session Initiation Protocol (SIP) Server MIB module. SIP is an application-layer signaling protocol for creating, modifying, and terminating multimedia sessions with one or more participants. These sessions include Internet multimedia conferences and Internet telephone calls. SIP is defined in RFC 3261 (June 2002).",
      "zh-CHS": "共同编辑：Dave Walker电子邮件：drwalker@rogers.com“说明”会话启动协议（SIP）服务器MIB模块。SIP是一种应用层信令协议，用于创建、修改和终止与一个或多个参与者的多媒体会话。这些会议包括互联网多媒体会议和互联网电话。SIP的定义见RFC 3261（2002年6月）。"
    },
    {
      "indent": 8,
      "text": "This MIB is defined for the management of SIP Proxy, Redirect, and Registrar Servers.",
      "zh-CHS": "此MIB定义用于管理SIP代理、重定向和注册服务器。"
    },
    {
      "indent": 8,
      "text": "A Proxy Server acts as both a client and a server. It accepts requests from other clients, either responding to them or passing them on to other servers, possibly after modification.",
      "zh-CHS": "代理服务器同时充当客户端和服务器。它接受来自其他客户端的请求，或者响应请求，或者在修改后将请求传递给其他服务器。"
    },
    {
      "indent": 8,
      "text": "A Redirect Server accepts requests from clients and returns zero or more addresses to that client. Unlike a User Agent Server, it does not accept calls.",
      "zh-CHS": "接收从零个或多个客户端返回的请求的客户端。与用户代理服务器不同，它不接受调用。"
    },
    {
      "indent": 8,
      "text": "A Registrar is a server that accepts REGISTER requests. A Registrar is typically co-located with a Proxy or Redirect Server.",
      "zh-CHS": "注册器是接受注册请求的服务器。注册器通常与代理服务器或重定向服务器位于同一位置。"
    },
    {
      "indent": 2,
      "text": "      Copyright (C) The IETF Trust (2007).  This version of\n      this MIB module is part of RFC 4780; see the RFC itself for\n      full legal notices.\"\n  REVISION        \"200704200000Z\"\n  DESCRIPTION\n     \"Initial version of the IETF SIP-SERVER-MIB module.  This\n     version published as part of RFC 4780.\"\n::= { mib-2 151 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Top-Level Components of this MIB.",
      "zh-CHS": "--此MIB的顶级组件。"
    },
    {
      "indent": 0,
      "text": "sipServerMIBObjects     OBJECT IDENTIFIER ::= { sipServerMIB 1 }\nsipServerMIBConformance OBJECT IDENTIFIER ::= { sipServerMIB 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- These groups contain objects common to all SIP servers.\n--\nsipServerCfg            OBJECT IDENTIFIER ::= { sipServerMIBObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Common Server Configuration Objects\n--\nsipServerCfgTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipServerCfgEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains configuration objects applicable to SIP\n        Redirect and Proxy Servers.\"\n    ::= { sipServerCfg 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerCfgEntry OBJECT-TYPE SYNTAX SipServerCfgEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "zh-CHS": "sipServerCfgEntry对象类型语法sipServerCfgEntry MAX-ACCESS不可访问状态当前描述"
    },
    {
      "indent": 7,
      "text": "\"A row of common configuration.",
      "zh-CHS": "“一行通用配置。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP server\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP servers and correlate them through\n    the common framework of the NETWORK-SERVICES-MIB (RFC 2788).\n    The same value of applIndex used in the corresponding\n    SIP-COMMON-MIB is used here.\"\nINDEX { applIndex }\n::= { sipServerCfgTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipServerCfgEntry ::=\n    SEQUENCE {\n        sipServerCfgHostAddressType       InetAddressType,\n        sipServerCfgHostAddress           InetAddress\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerCfgHostAddressType OBJECT-TYPE SYNTAX InetAddressType MAX-ACCESS read-only",
      "zh-CHS": "sipServerCfgHostAddressType对象类型语法InetAddressType MAX-ACCESS只读"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n   \"The type of Internet address by which the SIP server is\n    reachable.\"\nREFERENCE\n   \"RFC 3261, Section 19.1.1\"\n::= { sipServerCfgEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerCfgHostAddress OBJECT-TYPE\n    SYNTAX      InetAddress\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This is the host portion of a SIP URI that is assigned to the\n        SIP server.  It MAY contain a fully qualified domain name or\n        an IP address.  The length of the value will depend on the type\n        of address specified.  The type of address given by this object\n        is controlled by sipServerCfgHostAddressType.\"\n    REFERENCE\n       \"RFC 3261, Section 19.1.1\"\n    ::= { sipServerCfgEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- This group contains MIB objects\n-- related to SIP Proxy Servers.\n--\nsipServerProxyCfg      OBJECT IDENTIFIER ::= { sipServerMIBObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerProxyStats    OBJECT IDENTIFIER ::= { sipServerMIBObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Proxy Server Configuration\n--\nsipServerProxyCfgTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipServerProxyCfgEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains configuration objects applicable to SIP\n        Proxy Servers.\"\n    ::= { sipServerProxyCfg 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerProxyCfgEntry OBJECT-TYPE SYNTAX SipServerProxyCfgEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of common proxy configuration.",
      "zh-CHS": "sipServerProxyCfgEntry对象类型语法sipServerProxyCfgEntry MAX-ACCESS不可访问状态当前描述“一行常用代理配置”。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP server\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP servers and correlate them through the\n    common framework of the NETWORK-SERVICES-MIB (RFC 2788).  The\n    same value of applIndex used in the corresponding\n    SIP-COMMON-MIB is used here.\"\nINDEX { applIndex }\n::= { sipServerProxyCfgTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipServerProxyCfgEntry ::=\n    SEQUENCE {\n        sipServerCfgProxyStatefulness     INTEGER,\n        sipServerCfgProxyRecursion        TruthValue,\n        sipServerCfgProxyRecordRoute      TruthValue,\n        sipServerCfgProxyAuthMethod       BITS,\n        sipServerCfgProxyAuthDefaultRealm SnmpAdminString\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerCfgProxyStatefulness OBJECT-TYPE\n    SYNTAX      INTEGER {\n                  stateless(1),\n                  transactionStateful(2),\n                  callStateful(3)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "\"This object reflects the default mode of operation for the Proxy Server entity.",
      "zh-CHS": "“此对象反映代理服务器实体的默认操作模式。"
    },
    {
      "indent": 8,
      "text": "A stateless proxy is a logical entity that does not maintain the client or server transaction state machines when it processes requests. A stateless proxy forwards every request it receives downstream and every response it receives upstream. If the value of this object is stateless(1), the proxy defaults to stateless operations.",
      "zh-CHS": "无状态代理是一种逻辑实体，在处理请求时不维护客户端或服务器事务状态机。无状态代理转发它在下游收到的每个请求和在上游收到的每个响应。如果此对象的值为无状态（1），则代理默认为无状态操作。"
    },
    {
      "indent": 8,
      "text": "A transaction stateful proxy, or simply a 'stateful proxy', is a logical entity that maintains the client and server transaction state machines during the processing of a request. A (transaction) stateful proxy is not the same as a call stateful proxy. If the value of this object is transactionStateful(2), the proxy is stateful on a transaction basis.",
      "zh-CHS": "事务有状态代理，或者简称为“有状态代理”，是一个逻辑实体，在处理请求期间维护客户端和服务器事务状态机。（事务）有状态代理与调用有状态代理不同。如果此对象的值是transactionStateful（2），则代理在事务基础上是有状态的。"
    },
    {
      "indent": 8,
      "text": "A call stateful proxy is a logical entity if it retains state for a dialog from the initiating INVITE to the terminating BYE request. A call stateful proxy is always transaction stateful, but the converse is not necessarily true. If the value of this object is callStateful(3), the proxy is call stateful.\"",
      "zh-CHS": "如果call stateful proxy保留从发起邀请到终止BYE请求的对话框状态，则它是一个逻辑实体。调用有状态代理始终是事务有状态的，但反之不一定成立。如果此对象的值为callStateful（3），则代理为call stateful。“"
    },
    {
      "indent": 4,
      "text": "REFERENCE\n    \"RFC 3261, Section 16\"\n::= { sipServerProxyCfgEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerCfgProxyRecursion OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"This object reflects whether or not the Proxy performs a recursive search on the Contacts provided in 3xx redirects.",
      "zh-CHS": "sipServerCfgProxyRecursion对象类型语法TruthValue MAX-ACCESS只读状态当前描述“此对象反映代理是否对3xx重定向中提供的联系人执行递归搜索。"
    },
    {
      "indent": 4,
      "text": "    If the value of this object is 'true', a recursive search is\n    performed.  If the value is 'false', no search is performed,\n    and the 3xx response is sent upstream towards the source of\n    the request.\"\nREFERENCE\n   \"RFC 3261 Sections 16.5 and 16.6\"\n::= { sipServerProxyCfgEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerCfgProxyRecordRoute OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current",
      "zh-CHS": "sipServerCfgProxyRecordRoute对象类型语法TruthValue MAX-ACCESS只读状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"This object reflects whether or not the proxy adds itself to the Record-Route header as a default action. This header is used to list the proxies that insist on being in the signaling path for subsequent requests related to the call leg.",
      "zh-CHS": "DESCRIPTION“此对象反映代理是否将自身添加到记录路由头中作为默认操作。此头用于列出坚持位于信令路径中的代理，以用于与呼叫分支相关的后续请求。"
    },
    {
      "indent": 4,
      "text": "    If the value of this object is 'true', the proxy adds itself to\n    the end of the Record-Route header, creating the header if\n    required.  If the value is 'false', the proxy does not add\n    itself to the Record-Route header.\"\nREFERENCE\n   \"RFC 3261, Section 20.30\"\n::= { sipServerProxyCfgEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Security\n--\nsipServerCfgProxyAuthMethod OBJECT-TYPE\n    SYNTAX      BITS {\n                  none(0),\n                  tls(1),\n                  digest(2)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the authentication methods that MAY be\n        used to authenticate request originators.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "    bit 0  no authentication is performed\n    bit 1  TLS is used\n    bit 2  HTTP Digest is used.\"\nREFERENCE\n   \"RFC 3261 Sections 22, 23, 26, 26.2.3\"\n::= { sipServerProxyCfgEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerCfgProxyAuthDefaultRealm OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the default realm value used in\n        Proxy-Authenticate headers.  Note that this MAY need to be\n        stored per user, in which case, this default value is ignored.\n       \"\n    REFERENCE\n       \"RFC 3261, Section 22.1\"\n    ::= { sipServerProxyCfgEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Proxy Server Statistics -- sipServerProxyStatsTable OBJECT-TYPE SYNTAX SEQUENCE OF SipServerProxyStatsEntry MAX-ACCESS not-accessible",
      "zh-CHS": "----代理服务器统计信息--sipServerProxyStatsTable SipServerProxyStatsEntry MAX-ACCESS的对象类型语法序列不可访问"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n   \"This table contains the statistics objects applicable to all\n    SIP Proxy Servers in this system.\"\n::= { sipServerProxyStats 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerProxyStatsEntry OBJECT-TYPE SYNTAX SipServerProxyStatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of summary statistics.",
      "zh-CHS": "SIPServerProxyStatEntry对象类型语法SIPServerProxyStatEntry MAX-ACCESS不可访问状态当前描述“一行摘要统计信息。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP server\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP servers and correlate them through the\n    common framework of the NETWORK-SERVICES-MIB (RFC 2788).  The\n    same value of applIndex used in the corresponding\n    SIP-COMMON-MIB is used here.\"\nINDEX { applIndex }\n::= { sipServerProxyStatsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipServerProxyStatsEntry ::=\n    SEQUENCE {\n        sipServerProxyStatProxyReqFailures Counter32,\n        sipServerProxyStatsDisconTime      TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerProxyStatProxyReqFailures OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains the number of occurrences of unsupported options being specified in received Proxy-Require headers. Such occurrences result in a 420 Bad Extension status code being returned.",
      "zh-CHS": "sipServerProxyStatProxyReqFailures对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含在接收的代理请求标头中指定的不受支持选项的出现次数。此类出现会导致返回错误的扩展状态代码。"
    },
    {
      "indent": 8,
      "text": "Discontinuities in the value of this counter can occur at re-initialization of the SIP entity or service. A Management Station can detect discontinuities in this counter by",
      "zh-CHS": "在SIP实体或服务重新初始化时，此计数器的值可能会出现不连续。管理站可通过以下方式检测此计数器中的不连续性："
    },
    {
      "indent": 4,
      "text": "    monitoring the sipServerProxyStatsDisconTime object in the same\n    row.\"\n::= { sipServerProxyStatsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerProxyStatsDisconTime OBJECT-TYPE\n SYNTAX      TimeStamp\n MAX-ACCESS  read-only\n STATUS      current\n DESCRIPTION\n    \"The value of the sysUpTime object when the counters for the server\n     statistics objects in this row last experienced a discontinuity.\"\n ::= { sipServerProxyStatsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- This group contains MIB objects related to SIP Registrars.\n--\nsipServerRegCfg         OBJECT IDENTIFIER ::= { sipServerMIBObjects 5 }\nsipServerRegStats       OBJECT IDENTIFIER ::= { sipServerMIBObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Registrar Configuration\n--\nsipServerRegCfgTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipServerRegCfgEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains configuration objects applicable to SIP\n        Registrars.\"\n    ::= { sipServerRegCfg 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegCfgEntry OBJECT-TYPE SYNTAX SipServerRegCfgEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of common Registrar configuration.",
      "zh-CHS": "sipServerRegCfgEntry对象类型语法sipServerRegCfgEntry MAX-ACCESS不可访问状态当前描述“一行通用注册器配置”。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP server\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP servers and correlate them through the\n    common framework of the NETWORK-SERVICES-MIB (RFC 2788).  The\n    same value of applIndex used in the corresponding\n    SIP-COMMON-MIB is used here.\"\nINDEX { applIndex }\n::= { sipServerRegCfgTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipServerRegCfgEntry ::=",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "SEQUENCE {\n    sipServerRegMaxContactExpiryDuration  Unsigned32,\n    sipServerRegMaxUsers                  Unsigned32,\n    sipServerRegCurrentUsers              Gauge32,\n    sipServerRegDfltRegActiveInterval     Unsigned32\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegMaxContactExpiryDuration OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..4294967295)\n    UNITS      \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the maximum expiry that may be requested\n        by a User Agent for a particular Contact.  User Agents can\n        specify expiry using either an Expiry header in a REGISTER\n        request, or using an Expires parameter in a Contact header in\n        a REGISTER request.  If the value requested by the User Agent\n        is greater than the value of this object, then the contact\n        information is given the duration specified by this object, and\n        that duration is indicated to the User Agent in the response.\"\n    ::= { sipServerRegCfgEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegMaxUsers OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the maximum number of users that the\n        Registrar supports.  The current number of users is reflected\n        by sipServerRegCurrentUsers.\"\n    ::= { sipServerRegCfgEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegCurrentUsers OBJECT-TYPE\n    SYNTAX      Gauge32 (0..4294967295)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object reflects the number of users currently registered\n        with the Registrar.\"\n    ::= { sipServerRegCfgEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegDfltRegActiveInterval OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION",
      "zh-CHS": "SIPServerRegDfLTRegativeInterval对象类型语法Unsigned32（1..4294967295）单位“秒”最大访问只读状态当前说明"
    },
    {
      "indent": 0,
      "text": "       \"This object reflects the default time interval the Registrar\n        considers registrations to be active.  The value is used to\n        compute the Expires header in the REGISTER response.  If a user\n        agent requests a time interval shorter than specified by this\n        object, the Registrar SHOULD honor that request.  If a Contact\n        entry does not have an 'expires' parameter, the value of the\n        Expires header field is used instead.  If a Contact entry has no\n        'expires' parameter and no Expires header field is present,\n        the value of this object is used as the default value.\"\n    REFERENCE\n       \"RFC 3261, Section 10.2\"\n    ::= { sipServerRegCfgEntry 4 }\n--\n-- Per User Information\n--\nsipServerRegUserTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipServerRegUserEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains information on all users registered to each\n        Registrar in this system.\"\n    ::= { sipServerRegCfg 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegUserEntry OBJECT-TYPE SYNTAX SipServerRegUserEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This entry contains information for a single user registered to this Registrar.",
      "zh-CHS": "sipServerRegUserEntry对象类型语法sipServerRegUserEntry MAX-ACCESS不可访问状态当前描述“此条目包含注册到此注册器的单个用户的信息。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP server\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP servers and correlate them through the\n    common framework of the NETWORK-SERVICES-MIB (RFC 2788).  The\n    same value of applIndex used in the corresponding\n    SIP-COMMON-MIB is used here.\"\nINDEX { applIndex, sipServerRegUserIndex }\n::= { sipServerRegUserTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipServerRegUserEntry ::=\n    SEQUENCE {\n        sipServerRegUserIndex                  Unsigned32,\n        sipServerRegUserUri                    SnmpAdminString,\n        sipServerRegUserAuthenticationFailures Counter32,\n        sipServerRegUserDisconTime             TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegUserIndex OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This object uniquely identifies a conceptual row in the table.\"\n    ::= { sipServerRegUserEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegUserUri OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the user's address-of-record.  It is the\n        main form by which the Registrar knows the user.  The format is\n        typically 'user@domain'.  It is contained in the To header for\n        all REGISTER requests.\"\n    ::= { sipServerRegUserEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegUserAuthenticationFailures OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains a count of the number of times the user has failed authentication.",
      "zh-CHS": "sipServerRegUserAuthenticationFailures对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含用户身份验证失败的次数计数。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur due to\n    successful user authentications and at re-initialization of\n    the SIP entity or service.  A Management Station can detect\n    discontinuities in this counter by monitoring the\n    sipServerRegUserDisconTime object in the same row.\"\n::= { sipServerRegUserEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegUserDisconTime OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The value of the sysUpTime object when the counters for the\n        user registration statistics objects in this row last\n        experienced a discontinuity.\"\n    ::= { sipServerRegUserEntry 4 }\n--\n-- Per Contact Information\n--\nsipServerRegContactTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipServerRegContactEntry",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS  not-accessible\nSTATUS      current\nDESCRIPTION\n   \"This table contains information on every location where a\n    registered user (specified by sipServerRegUserIndex) wishes to\n    be found (i.e., the user has provided contact information to\n    each SIP Registrar in this system).\"\n::= { sipServerRegCfg 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegContactEntry OBJECT-TYPE SYNTAX SipServerRegContactEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This entry contains information for a single Contact. Multiple contacts may exist for a single user.",
      "zh-CHS": "sipServerRegContactEntry对象类型语法sipServerRegContactEntry MAX-ACCESS不可访问状态当前描述“此条目包含单个联系人的信息。单个用户可能存在多个联系人。"
    },
    {
      "indent": 8,
      "text": "Each row represents those objects for a particular SIP server present in this system. applIndex is used to uniquely identify these instances of SIP servers and correlate them through the common framework of the NETWORK-SERVICES-MIB (RFC 2788). The same value of applIndex used in the corresponding SIP-COMMON-MIB is used here.\"",
      "zh-CHS": "每一行表示此系统中存在的特定SIP服务器的对象。applIndex用于唯一标识SIP服务器的这些实例，并通过NETWORK-SERVICES-MIB（RFC 2788）的公共框架将它们关联起来。此处使用与相应SIP-COMMON-MIB中使用的applIndex相同的值。”"
    },
    {
      "indent": 4,
      "text": "INDEX { applIndex,\n        sipServerRegUserIndex,\n        sipServerRegContactIndex\n      }\n::= { sipServerRegContactTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipServerRegContactEntry ::=\n    SEQUENCE {\n        sipServerRegContactIndex        Unsigned32,\n        sipServerRegContactDisplayName  SnmpAdminString,\n        sipServerRegContactURI          SnmpAdminString,\n        sipServerRegContactLastUpdated  TimeStamp,\n        sipServerRegContactExpiry       DateAndTime,\n        sipServerRegContactPreference   SnmpAdminString\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegContactIndex OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"Along with the sipServerRegUserIndex, this object uniquely\n        identifies a conceptual row in the table.\"\n    ::= { sipServerRegContactEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegContactDisplayName OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the display name for the Contact.  For\n        example, 'Santa at Home', or 'Santa on his Sled', corresponding\n        to contact URIs of sip:BigGuy@example.com or\n        sip:sclaus817@example.com, respectively.\"\n    ::= { sipServerRegContactEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegContactURI OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object contains either a SIP URI where the user can be\n        contacted.  This URI is normally returned to a client from a\n        Redirect Server, or is used as the RequestURI in a SIP request\n        line for requests forwarded by a proxy.\"\n    ::= { sipServerRegContactEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegContactLastUpdated OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object indicates the time when this contact information\n        was accepted.  If the contact information is updated via a\n        subsequent REGISTER of the same information, this object is\n        also updated.\"\n    ::= { sipServerRegContactEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegContactExpiry OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"This object contains the date and time when the contact\n        information will no longer be valid.  Such times may be\n        specified by the user at registration (i.e., Expires header or\n        expiry parameter in the Contact information), or a system\n        default can be applied.\"\n    ::= { sipServerRegContactEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegContactPreference OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only",
      "zh-CHS": "sipServerRegContactPreference对象类型语法SnmpAdminString MAX-ACCESS只读"
    },
    {
      "indent": 4,
      "text": "STATUS current DESCRIPTION \"This object indicates a relative preference for the particular Contact header field value compared to other bindings for this address-of-record. A registering user may provide this preference as a 'qvalue' parameter in the Contact header.",
      "zh-CHS": "STATUS current DESCRIPTION“与此记录地址的其他绑定相比，此对象表示特定联系人标头字段值的相对首选项。注册用户可以将此首选项作为联系人标头中的“qvalue”参数提供。"
    },
    {
      "indent": 4,
      "text": "    The format of this item is a decimal number between 0 and 1\n    (for example 0.9).  Higher values indicate locations preferred\n    by the user.\"\nREFERENCE\n   \"RFC 3261, Section 10.2.1.2, 16.6, and 20.10\"\n::= { sipServerRegContactEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Registrar Statistics\n--\nsipServerRegStatsTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SipServerRegStatsEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n       \"This table contains the summary statistics objects applicable\n        to all SIP Registrars in this system.\"\n    ::= { sipServerRegStats 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegStatsEntry OBJECT-TYPE SYNTAX SipServerRegStatsEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A row of summary statistics.",
      "zh-CHS": "SIPServerRegstatEntry对象类型语法SIPServerRegstatEntry MAX-ACCESS不可访问状态当前描述“一行摘要统计信息。"
    },
    {
      "indent": 4,
      "text": "    Each row represents those objects for a particular SIP server\n    present in this system.  applIndex is used to uniquely identify\n    these instances of SIP servers and correlate them through the\n    common framework of the NETWORK-SERVICES-MIB (RFC 2788).  The\n    same value of applIndex used in the corresponding\n    SIP-COMMON-MIB is used here.\"\nINDEX { applIndex }\n::= { sipServerRegStatsTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "SipServerRegStatsEntry ::=\n    SEQUENCE {\n        sipServerRegStatsAcceptedRegs     Counter32,\n        sipServerRegStatsRejectedRegs     Counter32,\n        sipServerRegStatsDisconTime       TimeStamp\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegStatsAcceptedRegs OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains a count of the number of REGISTER requests that have been accepted (status code 200) by the Registrar. This includes additions of new contact information, refreshing contact information, as well as requests for deletion of contact information.",
      "zh-CHS": "sipServerRegStatsAcceptedRegs对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含已接受的寄存器请求数（状态代码200）这包括添加新的联系信息、刷新联系信息以及请求删除联系信息。"
    },
    {
      "indent": 4,
      "text": "    Discontinuities in the value of this counter can occur at\n    re-initialization of the SIP entity or service.  A Management\n    Station can detect discontinuities in this counter by\n    monitoring the sipServerRegStatsDisconTime object in the same\n    row.\"\n::= { sipServerRegStatsEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegStatsRejectedRegs OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains a count of the number REGISTER requests that have been rejected by the Registrar.",
      "zh-CHS": "sipServerRegStatsRejectedRegs对象类型语法计数器32 MAX-ACCESS只读状态当前描述“此对象包含已被注册器拒绝的注册请求数。"
    },
    {
      "indent": 2,
      "text": "      Discontinuities in the value of this counter can occur at\n      re-initialization of the SIP entity or service.  A Management\n      Station can detect discontinuities in this counter by\n      monitoring the sipServerRegStatsDisconTime object in the same\n      row.\"\n::= { sipServerRegStatsEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegStatsDisconTime OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n       \"The value of the sysUpTime object when the counters for the\n        registrar statistics objects in this row last experienced a\n        discontinuity.\"\n ::= { sipServerRegStatsEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Conformance\n--\nsipServerMIBCompliances\n         OBJECT IDENTIFIER ::= { sipServerMIBConformance 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerMIBGroups\n         OBJECT IDENTIFIER ::= { sipServerMIBConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- Compliance Statements\n--\nsipServerProxyServerCompliance MODULE-COMPLIANCE\n    STATUS      current\n    DESCRIPTION\n       \"The compliance statement for SIP entities acting as Proxy\n        Servers.\"\n    MODULE -- this module\n        MANDATORY-GROUPS { sipServerConfigGroup,\n                           sipServerProxyConfigGroup,\n                           sipServerProxyStatsGroup\n                         }\n    ::= { sipServerMIBCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipRedirectServerCompliance MODULE-COMPLIANCE\n    STATUS      current\n    DESCRIPTION\n       \"The compliance statement for SIP entities acting as Redirect\n        Servers.\"\n    MODULE -- this module\n        MANDATORY-GROUPS { sipServerConfigGroup }\n    ::= { sipServerMIBCompliances 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegistrarServerCompliance MODULE-COMPLIANCE\n    STATUS      current\n    DESCRIPTION\n       \"The compliance statement for SIP entities acting as\n        Registrars.\"\n    MODULE -- this module\n        MANDATORY-GROUPS { sipServerConfigGroup,\n                           sipServerRegistrarConfigGroup,\n                           sipServerRegistrarStatsGroup }\n    GROUP sipServerRegistrarUsersGroup\n    DESCRIPTION\n       \"This is an optional group.\"\n    ::= { sipServerMIBCompliances 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- -- Units of Conformance -- sipServerConfigGroup OBJECT-GROUP OBJECTS { sipServerCfgHostAddressType, sipServerCfgHostAddress",
      "zh-CHS": "----一致性单位--sipServerConfigGroup对象组对象{sipServerCfgHostAddressType，sipServerCfgHostAddress"
    },
    {
      "indent": 4,
      "text": "}\nSTATUS      current\nDESCRIPTION\n   \"A collection of objects providing configuration common to SIP\n    Proxy and Redirect servers.\"\n::= { sipServerMIBGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerProxyConfigGroup OBJECT-GROUP\n    OBJECTS {\n            sipServerCfgProxyStatefulness,\n            sipServerCfgProxyRecursion,\n            sipServerCfgProxyRecordRoute,\n            sipServerCfgProxyAuthMethod,\n            sipServerCfgProxyAuthDefaultRealm\n    }\n    STATUS      current\n    DESCRIPTION\n       \"A collection of objects providing configuration for SIP Proxy\n        servers.\"\n    ::= { sipServerMIBGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerProxyStatsGroup OBJECT-GROUP\n    OBJECTS {\n            sipServerProxyStatProxyReqFailures,\n            sipServerProxyStatsDisconTime\n    }\n    STATUS      current\n    DESCRIPTION\n       \"A collection of objects providing statistics for SIP Proxy\n        servers.\"\n    ::= { sipServerMIBGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegistrarConfigGroup OBJECT-GROUP\n    OBJECTS {\n            sipServerRegMaxContactExpiryDuration,\n            sipServerRegMaxUsers,\n            sipServerRegCurrentUsers,\n            sipServerRegDfltRegActiveInterval\n    }\n    STATUS      current\n    DESCRIPTION\n       \"A collection of objects providing configuration for SIP\n        Registrars.\"\n    ::= { sipServerMIBGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegistrarStatsGroup OBJECT-GROUP OBJECTS { sipServerRegStatsAcceptedRegs,",
      "zh-CHS": "SIPServerRegisterStatsGroup对象组对象{sipServerRegStatsAcceptedRegs，"
    },
    {
      "indent": 4,
      "text": "        sipServerRegStatsRejectedRegs,\n        sipServerRegStatsDisconTime\n}\nSTATUS      current\nDESCRIPTION\n   \"A collection of objects providing statistics for SIP\n    Registrars.\"\n::= { sipServerMIBGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "sipServerRegistrarUsersGroup OBJECT-GROUP\n    OBJECTS {\n            sipServerRegUserUri,\n            sipServerRegUserAuthenticationFailures,\n            sipServerRegUserDisconTime,\n            sipServerRegContactDisplayName,\n            sipServerRegContactURI,\n            sipServerRegContactLastUpdated,\n            sipServerRegContactExpiry,\n            sipServerRegContactPreference\n    }\n    STATUS      current\n    DESCRIPTION\n       \"A collection of objects related to registered users.\"\n    ::= { sipServerMIBGroups 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "zh-CHS": "8. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The MIB modules defined in this document use the following IANA-assigned OBJECT IDENTIFIER values recorded in the SMI Numbers registry:",
      "zh-CHS": "本文档中定义的MIB模块使用SMI编号注册表中记录的以下IANA分配的对象标识符值："
    },
    {
      "indent": 16,
      "text": "+--------------+-------------------------+\n| Descriptor   | OBJECT IDENTIFIER value |\n+--------------+-------------------------+\n| sipTC        | { mib-2 148 }           |\n| sipCommonMIB | { mib-2 149 }           |\n| sipUAMIB     | { mib-2 150 }           |\n| sipServerMIB | { mib-2 151 }           |\n+--------------+-------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "zh-CHS": "9. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in the SIP-COMMON-MIB MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "zh-CHS": "在SIP-COMMON-MIB MIB模块中定义了许多管理对象，其中MAX-ACCESS子句为read-write和/或read-create。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作可能会对网络操作产生负面影响。"
    },
    {
      "indent": 3,
      "text": "The following read-create object in SIP-COMMON-MIB is used to configure the status code statistics that will be monitored by the SIP entity:",
      "zh-CHS": "SIP-COMMON-MIB中的以下读取创建对象用于配置SIP实体将监视的状态代码统计信息："
    },
    {
      "indent": 6,
      "text": "sipCommonStatusCodeRowStatus:",
      "zh-CHS": "sipCommonStatusCodeRowStatus："
    },
    {
      "indent": 6,
      "text": "If this object is SET maliciously, it may result in an over-allocation of resources in a system for the purpose of accumulating and maintaining statistics.",
      "zh-CHS": "如果恶意设置此对象，可能会导致系统中为了积累和维护统计数据而过度分配资源。"
    },
    {
      "indent": 3,
      "text": "The following read-write objects in SIP-COMMON-MIB are used to configure the behavior of certain SNMP notifications potentially generated by a SIP entity:",
      "zh-CHS": "SIP-COMMON-MIB中的以下读写对象用于配置SIP实体可能生成的某些SNMP通知的行为："
    },
    {
      "indent": 6,
      "text": "sipCommonStatusCodeNotifSend, sipCommonStatusCodeNotifEmitMode, sipCommonStatusCodeNotifThresh, sipCommonStatusCodeNotifInterval, sipCommonCfgServiceNotifEnable:",
      "zh-CHS": "sipCommonStatusCodeNotifSend、SIPCommonStatusCodeNotifEmit模式、sipCommonStatusCodeNotifThresh、sipCommonStatusCodeNotifInterval、sipCommonCfgServiceNotifEnable："
    },
    {
      "indent": 6,
      "text": "If these objects are SET maliciously, it may result in a system and/or network performance impact due to the generation of SNMP notifications.",
      "zh-CHS": "如果恶意设置这些对象，可能会由于生成SNMP通知而导致系统和/或网络性能影响。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in the MIB modules (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP.",
      "zh-CHS": "在某些网络环境中，MIB模块中的一些可读对象（即具有MAX-ACCESS而非not ACCESS的对象）可能被视为敏感或易受攻击。因此，在通过SNMP通过网络发送这些对象时，控制甚至获取和/或通知对这些对象的访问，甚至可能加密这些对象的值，这一点非常重要。"
    },
    {
      "indent": 3,
      "text": "The following object values may contain private or confidential customer information like first name, last name, customer identification, location, company affiliation, the time the information was updated, etc.",
      "zh-CHS": "以下对象值可能包含私人或机密客户信息，如姓名、姓氏、客户身份、位置、公司从属关系、信息更新时间等。"
    },
    {
      "indent": 6,
      "text": "sipServerRegContactDisplayName, sipServerRegContactURI, sipServerRegContactLastUpdated and sipCommonCfgOrganization.",
      "zh-CHS": "sipServerRegContactDisplayName、sipServerRegContactURI、sipServerRegContactLastUpdated和SIPCommonCfGorOrganization。"
    },
    {
      "indent": 3,
      "text": "The sipCommonCfgTable table contains some objects that may help attackers gain knowledge about the status and operations of the SIP service. In particular, the object value of sipCommonCfgServiceOperStatus may indicate that the SIP entity is in congested state and may lead attackers to build additional service attacks to overload the system.",
      "zh-CHS": "sipCommonCfgTable表包含一些对象，这些对象可能帮助攻击者了解SIP服务的状态和操作。特别是，sipCommonCfgServiceOperStatus的对象值可能表示SIP实体处于拥塞状态，并可能导致攻击者构建额外的服务攻击以使系统过载。"
    },
    {
      "indent": 3,
      "text": "The sipCommonCfgEntityType object indicates the type of SIP entity, and the sipCommonMethodSupportedTable table contains in the SIP-COMMON-MIB MIB module list of SIP methods supported by each entity in the system. Gaining access to this information may allow attackers to build method-specific attacks or use unsupported methods to create denial-of-service attack scenarios.",
      "zh-CHS": "sipCommonCfgEntityType对象指示SIP实体的类型，sipCommonMethodSupportedTable表包含系统中每个实体支持的SIP方法的SIP-COMMON-MIB MIB模块列表。获取此信息可能会允许攻击者构建特定于方法的攻击，或使用不受支持的方法来创建拒绝服务攻击场景。"
    },
    {
      "indent": 3,
      "text": "In the SIP-UA-MIB MIB module, the sipUACfgServerTable contains the address of the SIP servers providing services to the UA, and obtaining this information may disclose some private or sensitive information about the SIP service usage.",
      "zh-CHS": "在SIP-UA-MIB MIB模块中，sipUACfgServerTable包含向UA提供服务的SIP服务器的地址，并且获取该信息可能会披露有关SIP服务使用的一些私有或敏感信息。"
    },
    {
      "indent": 3,
      "text": "In the SIP-SERVER-MIB MIB module, the sipServerCfgProxyAuthMethod object defines the authentication methods supported by the server and may be used to build specific denial-of-service attackers targeted at the security mechanisms employed by the SIP entity.",
      "zh-CHS": "在SIP-SERVER-MIB MIB模块中，sipServerCfgProxyAuthMethod对象定义了服务器支持的身份验证方法，并可用于构建针对SIP实体使用的安全机制的特定拒绝服务攻击者。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this set of MIB modules.",
      "zh-CHS": "SNMPv3之前的SNMP版本未包含足够的安全性。即使网络本身是安全的（例如通过使用IPsec），即使如此，也无法控制安全网络上的谁可以访问和获取/设置（读取/更改/创建/删除）这组MIB模块中的对象。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementers consider the security features as provided by the SNMPv3 framework (see RFC 3410 [RFC3410]), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "zh-CHS": "建议实施者考虑SNMPv3框架所提供的安全特性（参见RFC 3410 [RFC310]），包括对SNMPv3加密机制的完全支持（用于身份验证和隐私）。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsi when bility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "此外，不建议部署SNMPv3之前的SNMP版本。相反，建议部署SNMPv3并启用加密安全性。因此，客户/运营商的责任是确保正确配置访问此MIB模块实例的SNMP实体，以便仅向那些拥有确实获取或设置（更改/创建/删除）对象的合法权限的主体（用户）授予访问对象的权限。"
    },
    {
      "indent": 0,
      "text": "10. Contributor Acknowledgments",
      "section_title": true,
      "zh-CHS": "10. 投稿人确认"
    },
    {
      "indent": 3,
      "text": "We wish to thank the members of the IETF SIP and SIPPING working groups, and the SIP-MIB Design team for their comments and suggestions. Detailed comments were provided by Tom Taylor, Kavitha Patchayappan, Dan Romascanu, Cullen Jennings, Orit Levin, AC Mahendran, Mary Barnes, Rohan Mahy, Bob Penfield, Charles Eckel, and Dean Willis. Special thanks to Bert Wijnen for his expert reviews, which have greatly improved the SIP MIB modules.",
      "zh-CHS": "我们要感谢IETF SIP和SIP工作组的成员以及SIP-MIB设计团队的意见和建议。汤姆·泰勒、卡维塔·帕卡亚潘、丹·罗马斯坎努、卡伦·詹宁斯、奥里特·莱文、AC·马亨德兰、玛丽·巴恩斯、罗汉·马伊、鲍勃·彭菲尔德、查尔斯·埃克尔和迪安·威利斯提供了详细的评论。特别感谢Bert Wijnen的专家评论，这些评论极大地改进了SIP MIB模块。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "zh-CHS": "11. 工具书类"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "zh-CHS": "11.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[RFC3261]Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.，和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2788] Freed, N. and S. Kille, \"Network Services Monitoring MIB\", RFC 2788, March 2000.",
      "zh-CHS": "[RFC2788]Freed，N.和S.Kille，“网络服务监控MIB”，RFC 2788，2000年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "zh-CHS": "[RFC3411]Harrington，D.，Presohn，R.，和B.Wijnen，“描述简单网络管理协议（SNMP）管理框架的体系结构”，STD 62，RFC 3411，2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., and J. Schoenwaelder, \"Textual Conventions for Internet Network Addresses\", RFC 4001, February 2005.",
      "zh-CHS": "[RFC4001]Daniele，M.，Haberman，B.，Routhier，S.，和J.Schoenwaeld，“互联网网络地址的文本约定”，RFC 4001，2005年2月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "zh-CHS": "11.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.，和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 34102002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3262] Rosenberg, J. and H. Schulzrinne, \"Reliability of Provisional Responses in Session Initiation Protocol (SIP)\", RFC 3262, June 2002.",
      "zh-CHS": "[RFC3262]Rosenberg，J.和H.Schulzrinne，“会话启动协议（SIP）中临时响应的可靠性”，RFC 32622，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4168] Rosenberg, J., Schulzrinne, H., and G. Camarillo, \"The Stream Control Transmission Protocol (SCTP) as a Transport for the Session Initiation Protocol (SIP)\", RFC 4168, October 2005.",
      "zh-CHS": "[RFC4168]Rosenberg，J.，Schulzrinne，H.，和G.Camarillo，“作为会话启动协议（SIP）传输的流控制传输协议（SCTP）”，RFC 4168，2005年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Kevin Lingle Cisco Systems, Inc. 7025 Kit Creek Road P.O. Box 14987 Research Triangle Park, NC 27709 US",
      "zh-CHS": "Kevin Lingle Cisco Systems，Inc.地址：美国北卡罗来纳州三角研究公园Kit Creek路7025号14987信箱，邮编：27709"
    },
    {
      "indent": 3,
      "text": "Phone: +1 919 476 2029\nEMail: klingle@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jean-Francois Mule CableLabs 858 Coal Creek Circle Louisville, CO 80027 US",
      "zh-CHS": "Jean-Francois Mule CableLabs 858美国科罗拉多州路易斯维尔市煤溪圈80027"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303 661 9100\nEMail: jf.mule@cablelabs.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Joon Maeng 5612 Sedona Drive Austin, TX 78759 US",
      "zh-CHS": "美国德克萨斯州奥斯汀Sedona大道5612号，邮编78759"
    },
    {
      "indent": 3,
      "text": "Phone: +1 512 418 0590\nEMail: jmaeng@austin.rr.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dave Walker",
      "zh-CHS": "戴夫·沃克"
    },
    {
      "indent": 3,
      "text": "EMail: drwalker@rogers.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}