{
  "title": {
    "text": "RFC 4054: Impairments and Other Constraints on Optical Layer Routing",
    "zh-CHS": "RFC 4054"
  },
  "number": 4054,
  "created_at": "2021-11-12 16:26:17.737601+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     J. Strand, Ed.\nRequest for Comments: 4054                                  A. Chiu, Ed.\nCategory: Informational                                             AT&T\n                                                                May 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Impairments and Other Constraints on Optical Layer Routing",
      "zh-CHS": "光学层布线的损伤和其他限制"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Optical networking poses a number challenges for Generalized Multi-Protocol Label Switching (GMPLS). Fundamentally, optical technology is an analog rather than digital technology whereby the optical layer is lowest in the transport hierarchy and hence has an intimate relationship with the physical geography of the network. This contribution surveys some of the aspects of optical networks that impact routing and identifies possible GMPLS responses for each: (1) Constraints arising from the design of new software controllable network elements, (2) Constraints in a single all-optical domain without wavelength conversion, (3) Complications arising in more complex networks incorporating both all-optical and opaque architectures, and (4) Impacts of diversity constraints.",
      "zh-CHS": "光网络对通用多协议标签交换（GMPLS）提出了许多挑战。从根本上说，光学技术是一种模拟技术，而不是数字技术，因此光学层在传输层次结构中是最低的，因此与网络的自然地理位置有着密切的关系。本文调查了影响路由的光网络的一些方面，并确定了每个方面可能的GMPLS响应：（1）新软件可控网络元件设计产生的约束，（2）没有波长转换的单个全光域中的约束，（3）在包含全光和不透明体系结构的更复杂网络中产生的复杂性，以及（4）多样性限制的影响。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction .................................................  2\n2.  Sub-IP Area Summary and Justification of Work ................  3\n3.  Reconfigurable Network Elements ..............................  3\n    3.1.  Technology Background ..................................  3\n    3.2.  Implications for Routing ...............................  6\n4.  Wavelength Routed All-Optical Networks .......................  6\n    4.1.  Problem Formulation ....................................  7\n    4.2.  Polarization Mode Dispersion (PMD) .....................  8\n    4.3.  Amplifier Spontaneous Emission .........................  9\n    4.4.  Approximating the Effects of Some Other\n          Impairments Constraints ................................ 10\n    4.5.  Other Impairment Considerations ........................ 13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "    4.6.  An Alternative Approach - Using Maximum\n          Distance as the Only Constraint ........................ 13\n    4.7.  Other Considerations ................................... 15\n    4.8.  Implications for Routing and Control Plane Design ...... 15\n5.  More Complex Networks ........................................ 17\n6.  Diversity .................................................... 19\n    6.1.  Background on Diversity ................................ 19\n    6.2.  Implications for Routing ............................... 23\n7.  Security Considerations ...................................... 23\n8.  Acknowledgements ............................................. 24\n9.  References ................................................... 25\n    9.1.  Normative References ................................... 25\n    9.2.  Informative References ................................. 26\n10. Contributing Authors ......................................... 26",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Generalized Multi-Protocol Label Switching (GMPLS) [Mannie04] aims to extend MPLS to encompass a number of transport architectures, including optical networks that incorporate a number of all-optical and opto-electronic elements, such as optical cross-connects with both optical and electrical fabrics, transponders, and optical add-drop multiplexers. Optical networking poses a number of challenges for GMPLS. Fundamentally, optical technology is an analog rather than digital technology whereby the optical layer is lowest in the transport hierarchy and hence has an intimate relationship with the physical geography of the network.",
      "zh-CHS": "广义多协议标签交换（GMPLS）[Mannie04]旨在将MPLS扩展到包括许多传输架构，包括包含许多全光和光电元件的光网络，例如与光和电结构的光交叉连接、转发器、，和光分插复用器。光网络为GMPLS带来了许多挑战。从根本上说，光学技术是一种模拟技术，而不是数字技术，因此光学层在传输层次结构中是最低的，因此与网络的自然地理位置有着密切的关系。"
    },
    {
      "indent": 3,
      "text": "GMPLS already has incorporated extensions to deal with some of the unique aspects of the optical layer. This contribution surveys some of the aspects of optical networks that impact routing and identifies possible GMPLS responses for each. Routing constraints and/or complications arising from the design of network elements, the accumulation of signal impairments, and the need to guarantee the physical diversity of some circuits are discussed.",
      "zh-CHS": "GMPLS已经加入了扩展来处理光学层的一些独特方面。本文调查了影响路由的光网络的一些方面，并确定了每个方面可能的GMPLS响应。讨论了由于网络元件的设计、信号损伤的累积以及保证某些电路的物理多样性的需要而产生的路由约束和/或复杂性。"
    },
    {
      "indent": 3,
      "text": "Since the purpose of this document is to further the specification of GMPLS, alternative approaches to controlling an optical network are not discussed. For discussions of some broader issues, see [Gerstel2000] and [Strand02].",
      "zh-CHS": "由于本文件的目的是进一步规范GMPLS，因此不讨论控制光网络的替代方法。有关一些更广泛问题的讨论，请参见[Gerstel2000]和[Strand02]。"
    },
    {
      "indent": 3,
      "text": "The organization of the contribution is as follows:",
      "zh-CHS": "捐款的组织如下："
    },
    {
      "indent": 3,
      "text": "- Section 2 is a section requested by the sub-IP Area management for all new documents. It explains how this document fits into the Area and into the IPO WG, and why it is appropriate for these groups.",
      "zh-CHS": "- 第2节是子IP区域管理层要求的所有新文件的一节。它解释了本文件如何适合该领域和IPO工作组，以及为什么适合这些群体。"
    },
    {
      "indent": 3,
      "text": "- Section 3 describes constraints arising from the design of new software controllable network elements.",
      "zh-CHS": "- 第3节描述了设计新的软件可控网络元素时产生的约束。"
    },
    {
      "indent": 3,
      "text": "- Section 4 addresses the constraints in a single all-optical domain without wavelength conversion.",
      "zh-CHS": "- 第4节讨论了没有波长转换的单个全光域中的限制。"
    },
    {
      "indent": 3,
      "text": "- Section 5 extends the discussion to more complex networks and incorporates both all-optical and opaque architectures.",
      "zh-CHS": "- 第5节将讨论扩展到更复杂的网络，并结合了全光和不透明体系结构。"
    },
    {
      "indent": 3,
      "text": "- Section 6 discusses the impacts of diversity constraints.",
      "zh-CHS": "- 第6节讨论了多样性约束的影响。"
    },
    {
      "indent": 3,
      "text": "- Section 7 deals with security requirements.",
      "zh-CHS": "- 第7节涉及安全要求。"
    },
    {
      "indent": 3,
      "text": "- Section 8 contains acknowledgments.",
      "zh-CHS": "- 第8节包含确认。"
    },
    {
      "indent": 3,
      "text": "- Section 9 contains references.",
      "zh-CHS": "- 第9节载有参考资料。"
    },
    {
      "indent": 3,
      "text": "- Section 10 contains contributing authors' addresses.",
      "zh-CHS": "- 第10节包含投稿作者的地址。"
    },
    {
      "indent": 0,
      "text": "2. Sub-IP Area Summary and Justification of Work",
      "section_title": true,
      "zh-CHS": "2. 子IP区域总结和工作理由"
    },
    {
      "indent": 3,
      "text": "This document merges and extends two previous expired Internet-Drafts that were made IPO working group documents to form a basis for a design team at the Minneapolis IETF meeting, where it was also requested that they be merged to create a requirements document for the WG.",
      "zh-CHS": "本文件合并并扩展了两份先前过期的互联网草案，这两份草案是由IPO工作组文件编制的，以构成明尼阿波利斯IETF会议上设计团队的基础，并要求将其合并，以创建工作组的需求文件。"
    },
    {
      "indent": 3,
      "text": "In the larger sub-IP Area structure, this merged document describes specific characteristics of optical technology and the requirements they place on routing and path selection. It is appropriate for the IPO working group because the material is specific to optical networks. It identifies and documents the characteristics of the optical transport network that are important for selecting paths for optical channels, which is a work area for the IPO WG. The material covered is directly aimed at establishing a framework and requirements for routing in an optical network.",
      "zh-CHS": "在较大的子IP区域结构中，本合并文档描述了光学技术的具体特征以及它们对路由和路径选择的要求。这对于首次公开募股工作组来说是合适的，因为材料是针对光网络的。它确定并记录了光传输网络的特性，这些特性对于选择光信道路径非常重要，而光信道是IPO WG的一个工作区域。所涵盖的材料直接旨在建立光网络路由的框架和要求。"
    },
    {
      "indent": 0,
      "text": "3. Reconfigurable Network Elements",
      "section_title": true,
      "zh-CHS": "3. 可重构网元"
    },
    {
      "indent": 0,
      "text": "3.1. Technology Background",
      "section_title": true,
      "zh-CHS": "3.1. 技术背景"
    },
    {
      "indent": 3,
      "text": "Control plane architectural discussions (e.g., [Awduche99]) usually assume that the only software reconfigurable network element is an optical layer cross-connect (OLXC). There are however other software reconfigurable elements on the horizon, specifically tunable lasers and receivers and reconfigurable optical add-drop multiplexers",
      "zh-CHS": "控制平面架构讨论（例如，[Awduche99]）通常假设唯一的软件可重构网元是光学层交叉连接（OLXC）。然而，还有其他软件可重构元件即将问世，特别是可调谐激光器和接收器以及可重构光分插复用器"
    },
    {
      "indent": 3,
      "text": "(OADM). These elements are illustrated in the following simple example, which is modeled on announced Optical Transport System (OTS) products:",
      "zh-CHS": "（OADM）。以下简单示例对这些要素进行了说明，该示例以已发布的光传输系统（OTS）产品为模型："
    },
    {
      "indent": 3,
      "text": "            +                                       +\n---+---+    |\\                                     /|    +---+---\n---| A |----|D|          X              Y         |D|----| A |---\n---+---+    |W|     +--------+     +--------+     |W|    +---+---\n     :      |D|-----|  OADM  |-----|  OADM  |-----|D|      :\n---+---+    |M|     +--------+     +--------+     |M|    +---+---\n---| A |----| |      |      |       |      |      | |----| A |---\n---+---+    |/       |      |       |      |       \\|    +---+---\n            +      +---+  +---+   +---+  +---+      +\n             D     | A |  | A |   | A |  | A |     E\n                   +---+  +---+   +---+  +---+\n                    | |    | |     | |    | |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Figure 3-1: An OTS With OADMs - Functional Architecture",
      "zh-CHS": "图3-1：带OADM的OTS-功能架构"
    },
    {
      "indent": 3,
      "text": "In Fig. 3-1, the part that is on the inner side of all boxes labeled \"A\" defines an all-optical subnetwork. From a routing perspective two aspects are critical:",
      "zh-CHS": "在图3-1中，所有标有“A”的盒子内侧的部分定义了一个全光子网。从路由角度来看，两个方面至关重要："
    },
    {
      "indent": 3,
      "text": "- Adaptation: These are the functions done at the edges of the subnetwork that transform the incoming optical channel into the physical wavelength to be transported through the subnetwork.",
      "zh-CHS": "- 自适应：这些是在子网边缘完成的功能，用于将入射光信道转换为物理波长，以便通过子网传输。"
    },
    {
      "indent": 3,
      "text": "- Connectivity: This defines which pairs of edge Adaptation functions can be interconnected through the subnetwork.",
      "zh-CHS": "- 连通性：这定义了哪些对边缘自适应功能可以通过子网络互连。"
    },
    {
      "indent": 3,
      "text": "In Fig. 3-1, D and E are DWDMs and X and Y are OADMs. The boxes labeled \"A\" are adaptation functions. They map one or more input optical channels assumed to be standard short reach signals into a long reach (LR) wavelength or wavelength group that will pass transparently to a distant adaptation function. Adaptation functionality that affects routing includes:",
      "zh-CHS": "在图3-1中，D和E为DWDM，X和Y为OADM。标有“A”的框是自适应功能。它们将一个或多个假定为标准短距离信号的输入光信道映射为长距离（LR）波长或波长组，该波长或波长组将透明地传递给远程自适应功能。影响路由的自适应功能包括："
    },
    {
      "indent": 3,
      "text": "- Multiplexing: Either electrical or optical TDM may be used to combine the input channels into a single wavelength. This is done to increase effective capacity: A typical DWDM might be able to handle 100 2.5 Gb/sec signals (250 Gb/sec total) or 50 10 Gb/sec (500 Gb/sec total); combining the 2.5 Gb/sec signals together thus effectively doubles capacity. After multiplexing the combined signal must be routed as a group to the distant adaptation function.",
      "zh-CHS": "- 多路复用：可以使用电TDM或光TDM将输入通道组合成单个波长。这样做是为了提高有效容量：典型的DWDM可能能够处理100个2.5 Gb/s信号（总计250 Gb/s）或50个10 Gb/s信号（总计500 Gb/s）；将2.5 Gb/sec信号组合在一起，从而有效地使容量加倍。多路复用后，组合信号必须作为一组路由到远程自适应功能。"
    },
    {
      "indent": 3,
      "text": "- Adaptation Grouping: In this technique, groups of k (e.g., 4) wavelengths are managed as a group within the system and must be added/dropped as a group. We will call such a group an \"adaptation grouping\". Examples include so called \"wave group\" and \"waveband\" [Passmore01]. Groupings on the same system may differ in basics such as wavelength spacing, which constrain the type of channels that can be accommodated.",
      "zh-CHS": "- 自适应分组：在这种技术中，k（例如，4）个波长的组在系统中作为一个组进行管理，并且必须作为一个组进行添加/删除。我们将这种群体称为“适应群体”。示例包括所谓的“波组”和“波段”[Passmore01]。同一系统上的分组可能在基本方面有所不同，如波长间隔，这限制了可容纳的通道类型。"
    },
    {
      "indent": 3,
      "text": "- Laser Tunability: The lasers producing the LR wavelengths may have a fixed frequency, may be tunable over a limited range, or may be tunable over the entire range of wavelengths supported by the DWDM. Tunability speeds may also vary.",
      "zh-CHS": "- 激光可调谐性：产生LR波长的激光器可具有固定频率，可在有限范围内调谐，或可在DWDM支持的整个波长范围内调谐。可调速度也可能有所不同。"
    },
    {
      "indent": 3,
      "text": "Connectivity between adaptation functions may also be limited:",
      "zh-CHS": "自适应功能之间的连接也可能受到限制："
    },
    {
      "indent": 3,
      "text": "- As pointed out above, TDM multiplexing and/or adaptation grouping by the adaptation function forces groups of input channels to be delivered together to the same distant adaptation function.",
      "zh-CHS": "- 如上所述，由适配功能进行的TDM复用和/或适配分组迫使输入信道组一起传送到相同的远程适配功能。"
    },
    {
      "indent": 3,
      "text": "- Only adaptation functions whose lasers/receivers are tunable to compatible frequencies can be connected.",
      "zh-CHS": "- 只能连接其激光器/接收器可调谐至兼容频率的自适应功能。"
    },
    {
      "indent": 3,
      "text": "- The switching capability of the OADMs may also be constrained.",
      "zh-CHS": "- oadm的切换能力也可能受到限制。"
    },
    {
      "indent": 3,
      "text": "For example:",
      "zh-CHS": "例如："
    },
    {
      "indent": 3,
      "text": "o There may be some wavelengths that can not be dropped at all.",
      "zh-CHS": "o 可能有一些波长根本不能被丢弃。"
    },
    {
      "indent": 3,
      "text": "o There may be a fixed relationship between the frequency dropped and the physical port on the OADM to which it is dropped.",
      "zh-CHS": "o 在被丢弃的频率和它被丢弃到的OADM上的物理端口之间可能存在固定的关系。"
    },
    {
      "indent": 3,
      "text": "o OADM physical design may put an upper bound on the number of adaptation groupings dropped at any single OADM.",
      "zh-CHS": "o OADM物理设计可能会对在任何单个OADM上丢弃的自适应分组的数量设置上限。"
    },
    {
      "indent": 3,
      "text": "For a fixed configuration of the OADMs and adaptation functions connectivity will be fixed: Each input port will essentially be hard-wired to some specific distant port. However this connectivity can be changed by changing the configurations of the OADMs and adaptation functions. For example, an additional adaptation grouping might be dropped at an OADM or a tunable laser retuned. In each case the port-to-port connectivity is changed.",
      "zh-CHS": "对于OADM和自适应功能的固定配置，连接将是固定的：每个输入端口基本上都将硬连接到某个特定的远程端口。但是，可以通过更改OADM和自适应功能的配置来更改此连接。例如，可能会在OADM或可调谐激光器重新调谐时丢弃额外的自适应分组。在每种情况下，端口到端口的连接都会发生更改。"
    },
    {
      "indent": 3,
      "text": "These capabilities can be expected to be under software control. Today the control would rest in the vendor-supplied Element Management system (EMS), which in turn would be controlled by the operator's OSes. However in principle the EMS could participate in the GMPLS routing process.",
      "zh-CHS": "这些功能预计将由软件控制。如今，控制权将由供应商提供的元件管理系统（EMS）控制，而EMS又由运营商的操作系统控制。然而，原则上EMS可以参与GMPLS路由过程。"
    },
    {
      "indent": 0,
      "text": "3.2. Implications for Routing",
      "section_title": true,
      "zh-CHS": "3.2. 对路由的影响"
    },
    {
      "indent": 3,
      "text": "An OTS of the sort discussed in Sec. 3.1 is essentially a geographically distributed but blocking cross-connect system. The specific port connectivity is dependent on the vendor design and also on exactly what line cards have been deployed.",
      "zh-CHS": "第节讨论的那种OTS。3.1基本上是一个地理分布但阻塞的交叉连接系统。具体的端口连接取决于供应商的设计以及部署的线路卡。"
    },
    {
      "indent": 3,
      "text": "One way for GMPLS to deal with this architecture would be to view the port connectivity as externally determined. In this case the links known to GMPLS would be groups of identically routed wavebands. If these were reconfigured by the external EMS the resulting connectivity changes would need to be detected and advertised within GMPLS. If the topology shown in Fig. 3-1 became a tree or a mesh instead of the linear topology shown, the connectivity changes could result in Shared Risk Link Group (SRLG - see Section 6.2) changes.",
      "zh-CHS": "GMPLS处理此体系结构的一种方法是将端口连接视为外部确定的。在这种情况下，GMPLS已知的链路将是相同路由波段的组。如果这些由外部EMS重新配置，则需要在GMPLS内检测并公布由此产生的连接更改。如果图3-1中所示的拓扑变成树或网格而不是所示的线性拓扑，则连接变化可能导致共享风险链路组（SRLG-见第6.2节）的变化。"
    },
    {
      "indent": 3,
      "text": "Alternatively, GMPLS could attempt to directly control this port connectivity. The state information needed to do this is likely to be voluminous and vendor specific.",
      "zh-CHS": "或者，GMPLS可以尝试直接控制此端口连接。执行此操作所需的状态信息可能是大量的，并且是特定于供应商的。"
    },
    {
      "indent": 0,
      "text": "4. Wavelength Routed All-Optical Networks",
      "section_title": true,
      "zh-CHS": "4. 波长路由全光网络"
    },
    {
      "indent": 3,
      "text": "The optical networks deployed until recently may be called \"opaque\" ([Tkach98]): each link is optically isolated by transponders doing O/E/O conversions. They provide regeneration with retiming and reshaping, also called 3R, which eliminates transparency to bit rates and frame format. These transponders are quite expensive and their lack of transparency also constrains the rapid introduction of new services. Thus there are strong motivators to introduce \"domains of transparency\" - all-optical subnetworks - larger than an OTS.",
      "zh-CHS": "直到最近才部署的光网络可能被称为“不透明”（[Tkach98]）：每个链路由进行O/E/O转换的转发器进行光学隔离。它们通过重定时和重塑（也称为3R）提供再生，消除了比特率和帧格式的透明度。这些转发器相当昂贵，而且缺乏透明度也限制了新服务的快速推出。因此，引入比OTS更大的“透明域”（全光子网）有着强大的动力。"
    },
    {
      "indent": 3,
      "text": "The routing of lightpaths through an all-optical network has received extensive attention. (See [Yates99] or [Ramaswami98]). When discussing routing in an all-optical network it is usually assumed that all routes have adequate signal quality. This may be ensured by limiting all-optical networks to subnetworks of limited geographic size that are optically isolated from other parts of the optical layer by transponders. This approach is very practical and has been applied to date, e.g., when determining the maximum length of an Optical Transport System (OTS). Furthermore operational considerations like fault isolation also make limiting the size of domains of transparency attractive.",
      "zh-CHS": "通过全光网络的光路路由已受到广泛关注。（见[Yates99]或[Ramaswami98]）。在讨论全光网络中的路由时，通常假定所有路由都具有足够的信号质量。这可以通过将全光网络限制为有限地理尺寸的子网来确保，这些子网通过转发器与光层的其他部分进行光学隔离。这种方法非常实用，迄今为止已被应用，例如，在确定光传输系统（OTS）的最大长度时。此外，故障隔离等操作考虑因素也使得限制透明域的大小具有吸引力。"
    },
    {
      "indent": 3,
      "text": "There are however reasons to consider contained domains of transparency in which not all routes have adequate signal quality. From a demand perspective, maximum bit rates have rapidly increased from DS3 to OC-192 and soon OC-768 (40 Gb/sec). As bit rates increase it is necessary to increase power. This makes impairments",
      "zh-CHS": "然而，有理由考虑包含所有不具有足够信号质量的透明度的包含域。从需求的角度来看，最大比特率已经从DS3迅速增加到OC-192，很快又增加到OC-768（40 Gb/秒）。随着比特率的增加，有必要增加功率。这会造成损害"
    },
    {
      "indent": 3,
      "text": "and nonlinearities more troublesome. From a supply perspective, optical technology is advancing very rapidly, making ever-larger domains possible. In this section, we assume that these considerations will lead to the deployment of a domain of transparency that is too large to ensure that all potential routes have adequate signal quality for all circuits. Our goal is to understand the impacts of the various types of impairments in this environment.",
      "zh-CHS": "而且非线性更麻烦。从供应的角度来看，光学技术发展非常迅速，使越来越大的领域成为可能。在本节中，我们假设这些考虑因素将导致部署过大的透明域，以确保所有潜在路由对所有电路具有足够的信号质量。我们的目标是了解在这种环境中各种损伤的影响。"
    },
    {
      "indent": 3,
      "text": "Note that, as we describe later in the section, there are many types of physical impairments. Which of these needs to be dealt with explicitly when performing on-line distributed routing will vary considerably and will depend on many variables, including:",
      "zh-CHS": "请注意，正如我们在本节后面所述，身体损伤有多种类型。在执行在线分布式路由时，需要明确处理其中哪些问题将有很大差异，并取决于许多变量，包括："
    },
    {
      "indent": 3,
      "text": "- Equipment vendor design choices, - Fiber characteristics, - Service characteristics (e.g., circuit speeds), - Network size, - Network operator engineering and deployment strategies.",
      "zh-CHS": "- 设备供应商设计选择，-光纤特性，-服务特性（如电路速度），-网络规模，-网络运营商工程和部署策略。"
    },
    {
      "indent": 3,
      "text": "For example, a metropolitan network that does not intend to support bit rates above 2.5 Gb/sec may not be constrained by any of these impairments, while a continental or international network that wished to minimize O/E/O regeneration investment and support 40 Gb/sec connections might have to explicitly consider many of them. Also, a network operator may reduce or even eliminate their constraint set by building a relatively small domain of transparency to ensure that all the paths are feasible, or by using some proprietary tools based on rules from the OTS vendor to pre-qualify paths between node pairs and put them in a table that can be accessed each time a routing decision has to be made through that domain.",
      "zh-CHS": "例如，不打算支持高于2.5 Gb/s的比特率的城域网可能不受任何这些障碍的约束，而希望最小化O/E/O再生投资和支持40 Gb/s连接的大陆或国际网络可能必须明确地考虑其中的许多障碍。此外，网络运营商可以通过构建相对较小的透明域来减少甚至消除其约束集，以确保所有路径都是可行的，或者，使用一些基于OTS供应商规则的专有工具，预先确定节点对之间的路径，并将它们放入一个表中，每次必须通过该域做出路由决策时都可以访问该表。"
    },
    {
      "indent": 0,
      "text": "4.1. Problem Formulation",
      "section_title": true,
      "zh-CHS": "4.1. 问题表述"
    },
    {
      "indent": 3,
      "text": "We consider a single domain of transparency without wavelength translation. Additionally, due to the proprietary nature of DWDM transmission technology, we assume that the domain is either single vendor or architected using a single coherent design, particularly with regard to the management of impairments.",
      "zh-CHS": "我们考虑没有波长平移的单一透明区域。此外，由于DWDM传输技术的专有性质，我们假设该领域要么是单一供应商，要么是使用单一一致设计构建的，特别是在损害管理方面。"
    },
    {
      "indent": 3,
      "text": "We wish to route a unidirectional circuit from ingress client node X to egress client node Y. At both X and Y, the circuit goes through an O/E/O conversion that optically isolates the portion within our domain. We assume that we know the bit rate of the circuit. Also, we assume that the adaptation function at X may apply some Forward Error Correction (FEC) method to the circuit. We also assume we know the launch power of the laser at X.",
      "zh-CHS": "我们希望将单向电路从入口客户机节点X路由到出口客户机节点Y。在X和Y处，电路都经过O/E/O转换，光学隔离我们域内的部分。我们假设我们知道电路的比特率。此外，我们假设X处的自适应函数可以对电路应用某些前向纠错（FEC）方法。我们还假设我们知道激光在X的发射功率。"
    },
    {
      "indent": 3,
      "text": "Impairments can be classified into two categories, linear and nonlinear. (See [Tkach98] or [Kaminow02] for more on impairment constraints.) Linear effects are independent of signal power and affect wavelengths individually. Amplifier spontaneous emission (ASE), polarization mode dispersion (PMD), and chromatic dispersion are examples. Nonlinearities are significantly more complex: they generate not only impairments on each channel, but also crosstalk between channels.",
      "zh-CHS": "损伤可分为两类，线性和非线性。（参见[Tkach98]或[Kaminow02]了解更多关于损伤约束的信息。）线性效应独立于信号功率，并单独影响波长。放大器自发辐射（ASE）、偏振模色散（PMD）和色散就是例子。非线性要复杂得多：它们不仅在每个通道上产生损伤，而且在通道之间产生串扰。"
    },
    {
      "indent": 3,
      "text": "In the remainder of this section we first outline how two key linear impairments (PMD and ASE) might be handled by a set of analytical formulae as additional constraints on routing. We next discuss how the remaining constraints might be approached. Finally we take a broader perspective and discuss the implications of such constraints on control plane architecture and also on broader constrained domain of transparency architecture issues.",
      "zh-CHS": "在本节剩余部分中，我们首先概述了两个关键的线性损伤（PMD和ASE）如何通过一组分析公式处理，作为路由的附加约束。接下来，我们将讨论如何处理剩余的约束。最后，我们从一个更广阔的角度讨论了此类约束对控制平面体系结构的影响，以及对透明度体系结构问题更广泛的约束领域的影响。"
    },
    {
      "indent": 0,
      "text": "4.2. Polarization Mode Dispersion (PMD)",
      "section_title": true,
      "zh-CHS": "4.2. 偏振模色散（PMD）"
    },
    {
      "indent": 3,
      "text": "For a transparent fiber segment, the general PMD requirement is that the time-average differential group delay (DGD) between two orthogonal state of polarizations should be less than some fraction a of the bit duration, T=1/B, where B is the bit rate. The value of the parameter a depends on three major factors: 1) margin allocated to PMD, e.g., 1dB; 2) targeted outage probability, e.g., 4x10-5, and 3) sensitivity of the receiver to DGD. A typical value for a is 10% [ITU]. More aggressive designs to compensate for PMD may allow values higher than 10%. (This would be a system parameter dependent on the system design. It would need to be known to the routing process.)",
      "zh-CHS": "对于透明光纤段，PMD的一般要求是，两个正交偏振态之间的时间平均差分群延迟（DGD）应小于比特持续时间的某个分数a，T=1/B，其中B是比特率。参数a的值取决于三个主要因素：1）分配给PMD的余量，例如1dB；2） 目标中断概率，例如4x10-5，以及3）接收器对DGD的灵敏度。A的典型值为10%[ITU]。补偿PMD的更积极的设计可能允许值高于10%。（这将是一个取决于系统设计的系统参数。路由过程需要知道。）"
    },
    {
      "indent": 3,
      "text": "The PMD parameter (Dpmd) is measured in pico-seconds (ps) per sqrt(km). The square of the PMD in a fiber span, denoted as span-PMD-square is then given by the product of Dpmd**2 and the span length. (A fiber span in a transparent network refers to a segment between two optical amplifiers.) If Dpmd is constant, this results in a upper bound on the maximum length of an M-fiber-span transparent segment, which is inversely proportional to the square of the product of bit rate and Dpmd (the detailed equation is omitted due to the format constraint - see [Strand01] for details).",
      "zh-CHS": "PMD参数（Dpmd）的测量单位为皮秒（ps）/sqrt（km）。光纤跨度中PMD的平方，表示为跨度PMD平方，然后由Dpmd**2和跨度长度的乘积给出。（透明网络中的光纤跨度指的是两个光放大器之间的段。）如果Dpmd为常数，则会导致M-光纤跨度透明段最大长度的上限，该上限与比特率和Dpmd乘积的平方成反比（由于格式限制，省略了详细的公式-有关详细信息，请参见[Strand01]）。"
    },
    {
      "indent": 3,
      "text": "For older fibers with a typical PMD parameter of 0.5 picoseconds per square root of km, based on the constraint, the maximum length of the transparent segment should not exceed 400km and 25km for bit rates of 10Gb/s and 40Gb/s, respectively. Due to recent advances in fiber technology, the PMD-limited distance has increased dramatically. For newer fibers with a PMD parameter of 0.1 picosecond per square root of km, the maximum length of the transparent segment (without PMD",
      "zh-CHS": "对于典型PMD参数为0.5皮秒/km平方根的较旧光纤，根据限制，对于10Gb/s和40Gb/s的比特率，透明段的最大长度分别不得超过400km和25km。由于光纤技术的最新发展，偏振模色散有限距离显著增加。对于PMD参数为每平方公里0.1皮秒的较新光纤，透明段的最大长度（无PMD"
    },
    {
      "indent": 3,
      "text": "compensation) is limited to 10000km and 625km for bit rates of 10Gb/s and 40Gb/, respectively. Still lower values of PMD are attainable in commercially available fiber today, and the PMD limit can be further extended if a larger value of the parameter a (ratio of DGD to the bit period) can be tolerated. In general, the PMD requirement is not an issue for most types of fibers at 10Gb/s or lower bit rate. But it will become an issue at bit rates of 40Gb/s and higher.",
      "zh-CHS": "对于10Gb/s和40Gb/的比特率，补偿）分别限制为10000km和625km。如今，在商用光纤中可以获得更低的PMD值，如果可以容忍更大的参数a（DGD与比特周期之比），则PMD限制可以进一步延长。一般来说，对于大多数类型的10Gb/s或更低比特率光纤，PMD要求不是问题。但当比特率达到40Gb/s或更高时，它将成为一个问题。"
    },
    {
      "indent": 3,
      "text": "If the PMD parameter varies between spans, a slightly more complicated equation results (see [Strand01]), but in any event the only link dependent information needed by the routing algorithm is the square of the link PMD, denoted as link-PMD-square. It is the sum of the span-PMD-square of all spans on the link.",
      "zh-CHS": "如果PMD参数在跨距之间变化，则会产生稍微复杂的方程（请参见[Strand01]），但在任何情况下，路由算法所需的唯一链路相关信息是链路PMD的平方，表示为链路PMD平方。它是链路上所有跨距的跨距PMD平方之和。"
    },
    {
      "indent": 3,
      "text": "Note that when one has some viable PMD compensation devices and deploy them ubiquitously on all routes with potential PMD issues in the network, then the PMD constraint disappears from the routing perspective.",
      "zh-CHS": "请注意，如果有一些可行的PMD补偿设备，并在网络中所有存在潜在PMD问题的路由上普遍部署它们，则PMD约束将从路由角度消失。"
    },
    {
      "indent": 0,
      "text": "4.3. Amplifier Spontaneous Emission",
      "section_title": true,
      "zh-CHS": "4.3. 放大器自发辐射"
    },
    {
      "indent": 3,
      "text": "ASE degrades the optical signal to noise ratio (OSNR). An acceptable optical SNR level (SNRmin), which depends on the bit rate, transmitter-receiver technology (e.g., FEC), and margins allocated for the impairments, needs to be maintained at the receiver. In order to satisfy this requirement, vendors often provide some general engineering rule in terms of maximum length of the transparent segment and number of spans. For example, current transmission systems are often limited to up to 6 spans each 80km long. For larger transparent domains, more detailed OSNR computations will be needed to determine whether the OSNR level through a domain of transparency is acceptable. This would provide flexibility in provisioning or restoring a lightpath through a transparent subnetwork.",
      "zh-CHS": "ASE降低了光信噪比（OSNR）。需要在接收器处保持可接受的光学SNR水平（SNRmin），该水平取决于比特率、发射机-接收机技术（例如FEC）和分配给损伤的余量。为了满足这一要求，供应商通常提供透明段最大长度和跨度数量方面的一些通用工程规则。例如，目前的输电系统通常限制在每80km长的6个跨度内。对于较大的透明域，需要进行更详细的OSNR计算，以确定通过透明域的OSNR水平是否可接受。这将为通过透明子网配置或恢复光路提供灵活性。"
    },
    {
      "indent": 3,
      "text": "Assume that the average optical power launched at the transmitter is P. The lightpath from the transmitter to the receiver goes through M optical amplifiers, with each introducing some noise power. Unity gain can be used at all amplifier sites to maintain constant signal power at the input of each span to minimize noise power and nonlinearity. A constraint on the maximum number of spans can be obtained [Kaminow97] which is proportional to P and inversely proportional to SNRmin, optical bandwidth B, amplifier gain G-1 and spontaneous emission factor n of the optical amplifier, assuming all spans have identical gain and noise figure. (Again, the detailed equation is omitted due to the format constraint - see [Strand01] for details.) Let's take a typical example. Assuming P=4dBm, SNRmin=20dB with FEC, B=12.5GHz, n=2.5, G=25dB, based on the",
      "zh-CHS": "假设发射器发射的平均光功率为P。从发射器到接收器的光路经过M个光放大器，每个光放大器都会引入一些噪声功率。单位增益可用于所有放大器位置，以保持每个跨距输入端的恒定信号功率，从而最小化噪声功率和非线性。假设所有跨距具有相同的增益和噪声系数，则可获得对最大跨距数的约束[Kaminow97]，该约束与P成正比，与SNRmin、光带宽B、放大器增益G-1和光放大器的自发辐射系数n成反比。（再次），由于格式约束省略了详细方程-详见[Strud01]。我们举一个典型的例子。假设p=4dBm，SNRmin＝20dB，fEC，b＝125GHz，n＝2.5，g=25dB，基于"
    },
    {
      "indent": 3,
      "text": "constraint, the maximum number of spans is at most 10. However, if FEC is not used and the requirement on SNRmin becomes 25dB, the maximum number of spans drops down to 3.",
      "zh-CHS": "约束，最大跨距数最多为10。但是，如果不使用FEC，且对SNRmin的要求变为25dB，则最大跨距数将降至3。"
    },
    {
      "indent": 3,
      "text": "For ASE the only link-dependent information needed by the routing algorithm is the noise of the link, denoted as link-noise, which is the sum of the noise of all spans on the link. Hence the constraint on ASE becomes that the aggregate noise of the transparent segment which is the sum of the link-noise of all links can not exceed P/SNRmin.",
      "zh-CHS": "对于ASE，路由算法所需的唯一链路相关信息是链路的噪声，表示为链路噪声，它是链路上所有跨度的噪声之和。因此，对ASE的约束变成透明段的聚集噪声（所有链路的链路噪声之和）不能超过P/SNRmin。"
    },
    {
      "indent": 0,
      "text": "4.4. Approximating the Effects of Some Other Impairment Constraints",
      "section_title": true,
      "zh-CHS": "4.4. 近似其他一些减值约束的影响"
    },
    {
      "indent": 3,
      "text": "There are a number of other impairment constraints that we believe could be approximated with a domain-wide margin on the OSNR, plus in some cases a constraint on the total number of networking elements (OXC or OADM) along the path. Most impairments generated at OXCs or OADMs, including polarization dependent loss, coherent crosstalk, and effective passband width, could be dealt with using this approach. In principle, impairments generated at the nodes can be bounded by system engineering rules because the node elements can be designed and specified in a uniform manner. This approach is not feasible with PMD and noise because neither can be uniformly specified. Instead, they depend on node spacing and the characteristics of the installed fiber plant, neither of which are likely to be under the system designer's control.",
      "zh-CHS": "我们认为，还有许多其他损害限制可以通过OSNR上的全域范围限制来近似，在某些情况下，还可以对路径上的网络元素总数（OXC或OADM）进行限制。在OXCs或OADM上产生的大多数损伤，包括偏振相关损耗、相干串扰和有效通带宽度，都可以用这种方法处理。原则上，节点处产生的损伤可以由系统工程规则限定，因为节点元素可以以统一的方式设计和指定。这种方法对于PMD和噪声是不可行的，因为两者都不能统一指定。相反，它们取决于节点间距和已安装光纤设备的特性，这两者都不可能由系统设计师控制。"
    },
    {
      "indent": 3,
      "text": "Examples of the constraints we propose to approximate with a domain-wide margin are given in the remaining paragraphs in this section. It should be kept in mind that as optical transport technology evolves it may become necessary to include some of these impairments explicitly in the routing process. Other impairments not mentioned here at all may also become sufficiently important to require incorporation either explicitly or via a domain-wide margin.",
      "zh-CHS": "本节其余各段中给出了我们建议在整个领域范围内进行近似的约束示例。应该记住，随着光传输技术的发展，可能有必要在路由过程中明确地包括其中一些损伤。此处未提及的其他减值也可能变得非常重要，需要明确或通过领域范围的保证金纳入。"
    },
    {
      "indent": 3,
      "text": "Other Polarization Dependent Impairments Other polarization-dependent effects besides PMD influence system performance. For example, many components have polarization-dependent loss (PDL) [Ramaswami98], which accumulates in a system with many components on the transmission path. The state of polarization fluctuates with time and its distribution is very important also. It is generally required that the total PDL on the path be maintained within some acceptable limit, potentially by using some compensation technology for relatively long transmission systems, plus a small built-in margin in OSNR. Since the total PDL increases with the number of components in the data path, it must be taken into account by the system vendor when determining the maximum allowable number of spans.",
      "zh-CHS": "除偏振模色散外，其他偏振相关损伤和其他偏振相关效应也会影响系统性能。例如，许多组件具有偏振相关损耗（PDL）[Ramaswami98]，该损耗在传输路径上具有许多组件的系统中累积。极化状态随时间波动，其分布也非常重要。通常要求路径上的总PDL保持在某个可接受的限度内，可能通过对相对较长的传输系统使用一些补偿技术，加上OSNR中的小内置裕度。由于总PDL随着数据路径中组件数量的增加而增加，因此系统供应商在确定最大允许跨距数时必须将其考虑在内。"
    },
    {
      "indent": 3,
      "text": "Chromatic Dispersion In general this impairment can be adequately (but not optimally) compensated for on a per-link basis, and/or at system initial setup time. Today most deployed compensation devices are based on Dispersion Compensation Fiber (DCF). DCF provides per fiber compensation by means of a spool of fiber with a CD coefficient opposite to the fiber. Due to the imperfect matching between the CD slope of the fiber and the DCF some lambdas can be over compensated while others can be under compensated. Moreover DCF modules may only be available in fixed lengths of compensating fiber; this means that sometimes it is impossible to find a DCF module that exactly compensates the CD introduced by the fiber. These effects introduce what is known as residual CD. Residual CD varies with the frequency of the wavelength. Knowing the characteristics of both of the fiber and the DCF modules along the path, this can be calculated with a sufficient degree of precision. However this is a very challenging task. In fact the per-wavelength residual dispersion needs to be combined with other information in the system (e.g., types fibers to figure out the amount of nonlinearities) to obtain the net effect of CD either by simulation or by some analytical approximation. It appears that the routing/control plane should not be burdened by such a large set of information while it can be handled at the system design level. Therefore it will be assumed until proven otherwise that residual dispersion should not be reported. For high bit rates, dynamic dispersion compensation may be required at the receiver to clean up any residual dispersion.",
      "zh-CHS": "色散一般来说，这种损害可以在每个链路的基础上和/或在系统初始设置时得到充分（但不是最佳）补偿。如今，大多数部署的补偿设备都基于色散补偿光纤（DCF）。DCF通过一个CD系数与光纤相反的光纤卷轴提供每根光纤的补偿。由于光纤的CD斜率和DCF之间的不完全匹配，一些lambda可能会被过度补偿，而其他lambda可能会被欠补偿。此外，DCF模块可能仅在固定长度的补偿光纤中可用；这意味着有时不可能找到一个DCF模块来精确补偿光纤引入的CD。这些效应引入了所谓的残余CD。残余CD随波长的频率而变化。了解光纤和DCF模块沿路径的特性后，可以以足够高的精度进行计算。然而，这是一项非常具有挑战性的任务。事实上，每波长剩余色散需要与系统中的其他信息（例如，计算非线性量的光纤类型）结合，以通过模拟或某种分析近似获得CD的净效应。路由/控制平面似乎不应承受如此大的信息集，而可以在系统设计级别进行处理。因此，除非另有证明，否则将假定不应报告残余分散。对于高比特率，接收机处可能需要动态色散补偿以清除任何残余色散。"
    },
    {
      "indent": 3,
      "text": "Crosstalk Optical crosstalk refers to the effect of other signals on the desired signal. It includes both coherent (i.e., intrachannel) crosstalk and incoherent (i.e., interchannel) crosstalk. Main contributors of crosstalk are the OADM and OXC sites that use a DWDM multiplexer/demultiplexer (MUX/DEMUX) pair. For a relatively sparse network where the number of OADM/OXC nodes on a path is low, crosstalk can be treated with a low margin in OSNR without being a binding constraint. But for some relatively dense networks where crosstalk might become a binding constraint, one needs to propagate the per-link crosstalk information to make sure that the end-to-end path crosstalk which is the sum of the crosstalks on all the corresponding links to be within some limit, e.g., -25dB threshold with 1dB penalty ([Goldstein94]). Another way to treat it without having to propagate per-link crosstalk information is to have the system evaluate what the maximum number of OADM/OXC nodes that has a MUX/DEMUX pair for the worst route in the transparent domain for a low built-in margin. The latter one should work well where all the OXC/OADM nodes have similar level of crosstalk.",
      "zh-CHS": "串扰光串扰是指其他信号对所需信号的影响。它包括相干（即信道内）串扰和非相干（即信道间）串扰。串扰的主要原因是使用DWDM多路复用器/解复用器（MUX/DEMUX）对的OADM和OXC站点。对于路径上OADM/OXC节点数量较少的相对稀疏网络，可以在OSNR中以较低的裕度处理串扰，而无需绑定约束。但是对于一些相对密集的网络，其中串扰可能成为绑定约束，需要传播每链路串扰信息以确保端到端路径串扰（即所有对应链路上的串扰之和）在某个限制范围内，例如，具有1dB惩罚的-25dB阈值（[Goldstein94]）。在不必传播每链路串扰信息的情况下处理它的另一种方法是，让系统评估透明域中具有MUX/DEMUX对的OADM/OXC节点的最大数量，以获得较低的内置余量。在所有OXC/OADM节点具有相似串扰水平的情况下，后一种方法应该可以很好地工作。"
    },
    {
      "indent": 3,
      "text": "Effective Passband As more and more DWDM components are cascaded, the effective passband narrows. The number of filters along the link, their passband width and their shape will determine the end-to-end effective passband. In general, this is a system design issue, i.e., the system is designed with certain maximum bit rate using the proper modulation format and filter spacing. For linear systems, the filter effect can be turned into a constraint on the maximum number of narrow filters with the condition that filters in the systems are at least as wide as the one in the receiver. Because traffic at lower bit rates can tolerate a narrower passband, the maximum allowable number of narrow filters will increase as the bit rate decreases.",
      "zh-CHS": "有效通带随着越来越多的DWDM组件级联，有效通带变窄。沿链路的滤波器数量、其通带宽度和形状将决定端到端的有效通带。一般来说，这是一个系统设计问题，即使用适当的调制格式和滤波器间距，以一定的最大比特率设计系统。对于线性系统，在系统中的滤波器至少与接收机中的滤波器一样宽的条件下，滤波器效应可以转化为对窄滤波器最大数量的约束。由于较低比特率下的业务可以容忍较窄的通带，因此随着比特率的降低，允许的最大窄滤波器数量将增加。"
    },
    {
      "indent": 3,
      "text": "Nonlinear Impairments It seems unlikely that these can be dealt with explicitly in a routing algorithm because they lead to constraints that can couple routes together and lead to complex dependencies, e.g., on the order in which specific fiber types are traversed [Kaminow97]. Note that different fiber types (standard single mode fiber, dispersion shifted fiber, dispersion compensated fiber, etc.) have very different effects from nonlinear impairments. A full treatment of the nonlinear constraints would likely require very detailed knowledge of the physical infrastructure, including measured dispersion values for each span, fiber core area and composition, as well as knowledge of subsystem details such as dispersion compensation technology. This information would need to be combined with knowledge of the current loading of optical signals on the links of interest to determine the level of nonlinear impairment. Alternatively, one could assume that nonlinear impairments are bounded and result in X dB margin in the required OSNR level for a given bit rate, where X for performance reasons would be limited to 1 or 2 dB, consequently setting a limit on the maximum number of spans. For the approach described here to be useful, it is desirable for this span length limit to be longer than that imposed by the constraints which can be treated explicitly. When designing a DWDM transport system, there are tradeoffs between signal power launched at the transmitter, span length, and nonlinear effects on BER that need to be considered jointly. Here, we assume that an X dB margin is obtained after the transport system has been designed with a fixed signal power and maximum span length for a given bit rate. Note that OTSs can be designed in very different ways, in linear, pseudo-linear, or nonlinear environments. The X-dB margin approach may be valid for some but not for others. However, it is likely that there is an advantage in designing systems that are",
      "zh-CHS": "非线性损伤似乎不太可能在路由算法中明确处理，因为它们会导致约束，从而将路由耦合在一起，并导致复杂的依赖关系，例如特定光纤类型的穿越顺序[Kaminow97]。请注意，不同类型的光纤（标准单模光纤、色散位移光纤、色散补偿光纤等）对非线性损伤的影响非常不同。全面处理非线性约束可能需要非常详细的物理基础设施知识，包括每个跨度的测量色散值、光纤芯面积和组成，以及子系统细节知识，如色散补偿技术。该信息需要与感兴趣链路上光信号的当前负载知识相结合，以确定非线性损伤的水平。或者，可以假设非线性损伤是有界的，并且在给定比特率的要求OSNR水平中产生X dB余量，其中，出于性能原因，X将被限制为1或2 dB，从而对最大跨距数设置限制。为了使本文描述的方法有用，希望该跨度长度限制比可明确处理的约束施加的长度长。在设计DWDM传输系统时，需要在发射机发射的信号功率、跨距长度和对误码率的非线性影响之间进行权衡，这需要联合考虑。在这里，我们假设在传输系统设计为具有固定信号功率和给定比特率的最大跨距长度后，获得X dB裕度。请注意，OTS可以在线性、伪线性或非线性环境中以非常不同的方式设计。X-dB余量法可能对某些人有效，但对其他人无效。然而，在设计系统时很可能有一个优势，即"
    },
    {
      "indent": 6,
      "text": "less aggressive with respect to nonlinearities, and therefore somewhat sub-optimal, in exchange for improved scalability, simplicity and flexibility in routing and control plane design.",
      "zh-CHS": "在非线性方面不太激进，因此有点次优，以换取路由和控制平面设计中改进的可伸缩性、简单性和灵活性。"
    },
    {
      "indent": 0,
      "text": "4.5. Other Impairment Considerations",
      "section_title": true,
      "zh-CHS": "4.5. 其他减值考虑"
    },
    {
      "indent": 3,
      "text": "There are many other types of impairments that can degrade performance. In this section, we briefly mention one other type of impairment, which we propose be dealt with by either the system designer or by the transmission engineers at the time the system is installed. If dealt with successfully in this manner they should not need to be considered in the dynamic routing process.",
      "zh-CHS": "还有许多其他类型的损伤会降低性能。在本节中，我们简要提及另一种类型的损害，我们建议在安装系统时由系统设计师或传输工程师处理。如果以这种方式成功处理，则不需要在动态路由过程中考虑这些问题。"
    },
    {
      "indent": 3,
      "text": "Gain Nonuniformity and Gain Transients For simple noise estimates to be of use, the amplifiers must be gain-flattened and must have automatic gain control (AGC). Furthermore, each link should have dynamic gain equalization (DGE) to optimize power levels each time wavelengths are added or dropped. Variable optical attenuators on the output ports of an OXC or OADM can be used for this purpose, and in-line devices are starting to become commercially available. Optical channel monitors are also required to provide feedback to the DGEs. AGC must be done rapidly if signal degradation after a protection switch or link failure is to be avoided.",
      "zh-CHS": "增益不均匀性和增益瞬变为了使用简单的噪声估计，放大器必须增益平坦，并且必须具有自动增益控制（AGC）。此外，每个链路应具有动态增益均衡（DGE），以在每次添加或删除波长时优化功率水平。OXC或OADM输出端口上的可变光衰减器可用于此目的，并且在线设备开始商业化。还需要光学通道监视器向DGE提供反馈。如果要避免保护开关或链路故障后的信号退化，则必须快速进行AGC。"
    },
    {
      "indent": 3,
      "text": "Note that the impairments considered here are treated more or less independently. By considering them jointly and varying the tradeoffs between the effects from different components may allow more routes to be feasible. If that is desirable or the system is designed such that certain impairments (e.g., nonlinearities) need to be considered by a centralized process, then distributed routing is not the one to use.",
      "zh-CHS": "注意，此处考虑的损伤或多或少是独立处理的。通过联合考虑这些因素，并在不同组成部分的影响之间进行权衡，可以使更多的路线可行。如果这是可取的，或者系统的设计使得集中处理需要考虑某些损伤（例如非线性），那么分布式路由就不是可以使用的。"
    },
    {
      "indent": 0,
      "text": "4.6. An Alternative Approach - Using Maximum Distance as the Only Constraint",
      "zh-CHS": "4.6. 另一种方法-使用最大距离作为唯一约束"
    },
    {
      "indent": 3,
      "text": "Today, carriers often use maximum distance to engineer point-to-point OTS systems given a fixed per-span length based on the OSNR constraint for a given bit rate. They may desire to keep the same engineering rule when they move to all-optical networks. Here, we discuss the assumptions that need to be satisfied to keep this approach viable and how to treat the network elements between two adjacent links.",
      "zh-CHS": "今天，运营商通常使用最大距离来设计基于给定比特率的OSNR约束的固定每跨长度的点对点OTS系统。当他们转向全光网络时，他们可能希望保持相同的工程规则。在这里，我们讨论了保持这种方法可行所需满足的假设，以及如何处理两个相邻链路之间的网络元素。"
    },
    {
      "indent": 3,
      "text": "In order to use the maximum distance for a given bit rate to meet an OSNR constraint as the only binding constraint, the operators need to satisfy the following constraints in their all-optical networks:",
      "zh-CHS": "为了将给定比特率的最大距离用作满足OSNR约束的唯一绑定约束，运营商需要在其全光网络中满足以下约束："
    },
    {
      "indent": 3,
      "text": "- All the other non-OSNR constraints described in the previous subsections are not binding factors as long as the maximum distance constraint is met.",
      "zh-CHS": "- 只要满足最大距离约束，前面小节中描述的所有其他非OSNR约束都不是约束因子。"
    },
    {
      "indent": 3,
      "text": "- Specifically for PMD, this means that the whole all-optical network is built on top of sufficiently low-PMD fiber such that the upper bound on the mean aggregate path DGD is always satisfied for any path that does not exceed the maximum distance, or PMD compensation devices might be used for routes with high-PMD fibers.",
      "zh-CHS": "- 特别是对于PMD，这意味着整个全光网络建立在足够低的PMD光纤之上，使得对于任何不超过最大距离的路径，平均聚合路径DGD的上限始终满足，或者PMD补偿装置可用于具有高PMD光纤的路由。"
    },
    {
      "indent": 3,
      "text": "- In terms of the ASE/OSNR constraint, in order to convert the ASE constraint into a distance constraint directly, the network needs to have a fixed fiber distance D for each span (so that ASE can be directly mapped by the gain of the amplifier which equals to the loss of the previous fiber span), e.g., 80km spacing which is commonly chosen by carriers. However, when spans have variable lengths, certain adjustment and compromise need to be made in order to avoid treating ASE explicitly as in section 4.3. These include: 1) Unless a certain mechanism is built in the OTS to take advantage of shorter spans, spans shorter than a typical span length D need to be treated as a span of length D instead of with its real length. 2) Spans that are longer than D would have a higher average span loss. In general, the maximum system reach decreases when the average span loss increases. Thus, in order to accommodate longer spans in the network, the maximum distance upper bound has to be set with respect to the average span loss of the worst path in the network. This sub-optimality may be acceptable for some networks if the variance is not too large, but may be too conservative for others.",
      "zh-CHS": "- 就ASE/OSNR约束而言，为了将ASE约束直接转换为距离约束，网络需要为每个跨度提供固定的光纤距离D（以便ASE可以通过放大器的增益直接映射，该增益等于先前光纤跨度的损耗），例如。，80公里间距，通常由承运人选择。然而，当跨距长度可变时，需要进行某些调整和折衷，以避免如第4.3节所述明确处理ASE。这些包括：1）除非OTS中构建了某种机制以利用较短的跨度，否则比典型跨度长度D短的跨度需要被视为长度D的跨度，而不是实际长度。2） 大于D的跨度将具有更高的平均跨度损失。一般来说，当平均跨距损失增加时，最大系统到达范围减小。因此，为了适应网络中较长的跨度，必须根据网络中最差路径的平均跨度损失设置最大距离上限。如果方差不太大，这种次优性对于某些网络可能是可接受的，但对于其他网络可能过于保守。"
    },
    {
      "indent": 3,
      "text": "If these assumptions are satisfied, the second issue we need to address is how to treat a transparent network element (e.g., MEMS-based switch) between two adjacent links in terms of a distance constraint since it also introduces an insertion loss. If the network element cannot somehow compensate for this OSNR degradation, one approach is to convert each network element into an equivalent length of fiber based on its loss/ASE contribution. Hence, in general, introducing a set of transparent network elements would effectively result in reducing the overall actual transmission distance between the OEO edges.",
      "zh-CHS": "如果满足这些假设，我们需要解决的第二个问题是如何根据距离约束处理两个相邻链路之间的透明网络元件（例如，基于MEMS的交换机），因为它也会引入插入损耗。如果网元无法以某种方式补偿这种OSNR下降，一种方法是根据其损耗/ASE贡献将每个网元转换为等效长度的光纤。因此，一般而言，引入一组透明的网络元件将有效地减少OEO边缘之间的总体实际传输距离。"
    },
    {
      "indent": 3,
      "text": "With this approach, the link-specific state information is link-distance, the length of a link. It equals the distance sum of all fiber spans on the link and the equivalent length of fiber for the network element(s) on the link. The constraint is that the sum of",
      "zh-CHS": "使用这种方法，链路特定的状态信息是链路距离，即链路的长度。它等于链路上所有光纤跨度的距离和链路上网元的等效光纤长度。约束条件是"
    },
    {
      "indent": 3,
      "text": "all the link-distance over all links of a path should be less than the maximum-path-distance, the upper bound of all paths.",
      "zh-CHS": "路径的所有链接上的所有链接距离应小于最大路径距离，即所有路径的上限。"
    },
    {
      "indent": 0,
      "text": "4.7. Other Considerations",
      "section_title": true,
      "zh-CHS": "4.7. 其他考虑"
    },
    {
      "indent": 3,
      "text": "Routing in an all-optical network without wavelength conversion raises several additional issues:",
      "zh-CHS": "在没有波长转换的全光网络中进行路由会引发几个额外的问题："
    },
    {
      "indent": 3,
      "text": "- Since the route selected must have the chosen wavelength available on all links, this information needs to be considered in the routing process. One approach is to propagate information throughout the network about the state of every wavelength on every link in the network. However, the state required and the overhead involved in processing and maintaining this information is proportional to the total number of links (thus, number of nodes squared), maximum number of wavelengths (which keeps doubling every couple of years), and the frequency of wavelength availability changes, which can be very high. Instead [Hjalmtysson00], proposes an alternative method which probes along a chosen path to determine which wavelengths (if any) are available. This would require a significant addition to the routing logic normally used in OSPF. Others have proposed simultaneously probing along multiple paths.",
      "zh-CHS": "- 由于所选路由必须在所有链路上具有所选波长，因此在路由过程中需要考虑该信息。一种方法是在整个网络中传播关于网络中每个链路上每个波长的状态的信息。但是，处理和维护此信息所需的状态和开销与链路总数（因此，节点数平方）、最大波长数（每两年增加一倍）和波长可用性变化频率（可能非常高）成正比。相反，[Hjalmtysson00]提出了一种替代方法，沿着选定的路径进行探测，以确定哪些波长（如果有的话）可用。这将需要对OSPF中通常使用的路由逻辑进行重大补充。其他人则建议沿多条路径同时探测。"
    },
    {
      "indent": 3,
      "text": "- Choosing a path first and then a wavelength along the path is known to give adequate results in simple topologies such as rings and trees ([Yates99]). This does not appear to be true in large mesh networks under realistic provisioning scenarios, however. Instead significantly better results are achieved if wavelength and route are chosen simultaneously ([Strand01b]). This approach would however also have a significant effect on OSPF.",
      "zh-CHS": "- 已知先选择一条路径，然后沿路径选择一个波长，可以在简单的拓扑结构（如环和树）中提供足够的结果（[Yates99]）。然而，在现实的资源调配场景下，在大型网状网络中，情况似乎并非如此。相反，如果同时选择波长和路径（[Strand01b]），则可获得显著更好的结果。然而，这种方法也将对OSPF产生重大影响。"
    },
    {
      "indent": 0,
      "text": "4.8. Implications For Routing and Control Plane Design",
      "section_title": true,
      "zh-CHS": "4.8. 布线和控制平面设计的含义"
    },
    {
      "indent": 3,
      "text": "If distributed routing is desired, additional state information will be required by the routing to deal with the impairments described in Sections 4.2 - 4.4:",
      "zh-CHS": "如果需要分布式路由，路由将需要额外的状态信息来处理第4.2-4.4节所述的损害："
    },
    {
      "indent": 3,
      "text": "- As mentioned earlier, an operator who wants to avoid having to provide impairment-related parameters to the control plane may elect not to deal with them at the routing level, instead treating them at the system design and planning level if that is a viable approach for their network. In this approach the operator can pre-qualify all or a set of feasible end-to-end optical paths through the domain of transparency for each bit rate. This approach may work well with relatively small and sparse networks, but it may not be scalable for large and dense networks where the number of feasible paths can be very large.",
      "zh-CHS": "- 如前所述，希望避免向控制平面提供损伤相关参数的运营商可以选择不在路由级别处理这些参数，而在系统设计和规划级别处理这些参数，如果这是其网络的可行方法。在这种方法中，操作员可以通过每个比特率的透明域预先限定所有或一组可行的端到端光路。这种方法可能适用于相对较小且稀疏的网络，但对于可行路径数量可能非常大的大型密集网络，它可能无法扩展。"
    },
    {
      "indent": 3,
      "text": "- If the optical paths are not pre-qualified, additional link-specific state information will be required by the routing algorithm for each type of impairment that has the potential of being limiting for some routes. Note that for one operator, PMD might be the only limiting constraint while for another, ASE might be the only one, or it could be both plus some other constraints considered in this document. Some networks might not be limited by any of these constraints.",
      "zh-CHS": "- 如果光路未经预鉴定，则路由算法将需要针对可能限制某些路由的每种损伤类型的额外链路特定状态信息。请注意，对于一个运营商，PMD可能是唯一的限制性约束，而对于另一个运营商，ASE可能是唯一的限制性约束，或者两者加上本文档中考虑的一些其他约束。某些网络可能不受任何这些约束的限制。"
    },
    {
      "indent": 3,
      "text": "- For an operator needing to deal explicitly with these constraints, the link-dependent information identified above for PMD is link-PMD-square which is the square of the total PMD on a link. For ASE the link-dependent information identified is link-noise which is the total noise on a link. Other link-dependent information includes link-span-length which is the total number of spans on a link, link-crosstalk or OADM-OXC-number which is the total crosstalk or the number of OADM/OXC nodes on a link, respectively, and filter-number which is the number of narrow filters on a link. When the alternative distance-only approach is chosen, the link-specific information is link-distance.",
      "zh-CHS": "- 对于需要明确处理这些约束的操作员，上面为PMD标识的链路相关信息是链路PMD平方，它是链路上总PMD的平方。对于ASE，识别的链路相关信息是链路噪声，链路噪声是链路上的总噪声。其他链路相关信息包括链路跨度长度（链路上的跨度总数）、链路串扰或OADM OXC编号（分别为总串扰或链路上的OADM/OXC节点数量）和过滤器编号（为链路上窄过滤器的数量）。如果选择了仅限距离的备选方法，则特定于链路的信息为链路距离。"
    },
    {
      "indent": 3,
      "text": "- In addition to the link-specific information, bounds on each of the impairments need to be quantified. Since these bounds are determined by the system designer's impairment allocations, these will be system dependent. For PMD, the constraint is that the sum of the link-PMD-square of all links on the transparent segment is less than the square of (a/B) where B is the bit rate. Hence, the required information is the parameter \"a\". For ASE, the constraint is that the sum of the link-noise of all links is no larger than P/SNRmin. Thus, the information needed include the launch power P and OSNR requirement SNRmin. The minimum acceptable OSNR, in turn, depends on the strength of the FEC being used and the margins reserved for other types of impairments. Other bounds include the maximum span length of the transmission system, the maximum path crosstalk or the maximum number of OADM/OXC nodes, and the maximum number of narrow filters, all are bit rate dependent. With the alternative distance-only approach, the upper bound is the maximum-path-distance. In single-vendor \"islands\" some of these parameters may be available in a local or EMS database and would not need to be advertised",
      "zh-CHS": "- 除了链路特定信息外，还需要量化每个损伤的界限。由于这些界限由系统设计者的减值分配决定，因此这些界限将取决于系统。对于PMD，约束条件是透明段上所有链路的链路PMD平方和小于（a/B）的平方，其中B是比特率。因此，所需的信息是参数“a”。对于ASE，约束条件是所有链路的链路噪声之和不大于P/SNRmin。因此，所需信息包括发射功率P和OSNR要求SNRmin。反过来，最低可接受OSNR取决于所用FEC的强度以及为其他类型的损伤保留的裕度。其他界限包括传输系统的最大跨距长度、最大路径串扰或OADM/OXC节点的最大数量以及窄带滤波器的最大数量，所有这些都取决于比特率。对于仅限距离的替代方法，上限为最大路径距离。在单一供应商的“孤岛”中，这些参数中的一些可能在本地或EMS数据库中可用，无需公布"
    },
    {
      "indent": 3,
      "text": "- It is likely that the physical layer parameters do not change value rapidly and could be stored in some database; however these are physical layer parameters that today are frequently not known at the granularity required. If the ingress node of a lightpath does path selection these parameters would need to be available at this node.",
      "zh-CHS": "- 物理层参数很可能不会快速改变值，并且可以存储在某些数据库中；但是，这些是物理层参数，目前在所需的粒度上通常是未知的。如果光通路的入口节点不进行路径选择，则需要在该节点上提供这些参数。"
    },
    {
      "indent": 3,
      "text": "- The specific constraints required in a given situation will depend on the design and engineering of the domain of transparency; for example it will be essential to know whether chromatic dispersion has been dealt with on a per-link basis, and whether the domain is operating in a linear or nonlinear regime.",
      "zh-CHS": "- 特定情况下所需的具体约束将取决于透明度领域的设计和工程；例如，必须知道是否已在每个链路的基础上处理了色散，以及域是否在线性或非线性区域中运行。"
    },
    {
      "indent": 3,
      "text": "- As optical transport technology evolves, the set of constraints that will need to be considered either explicitly or via a domain-wide margin may change. The routing and control plane design should therefore be as open as possible, allowing parameters to be included as necessary.",
      "zh-CHS": "- 随着光传输技术的发展，需要明确考虑或通过域范围考虑的约束集可能会发生变化。因此，布线和控制平面设计应尽可能开放，允许在必要时包括参数。"
    },
    {
      "indent": 3,
      "text": "- In the absence of wavelength conversion, the necessity of finding a single wavelength that is available on all links introduces the need to either advertise detailed information on wavelength availability, which probably doesn't scale, or have some mechanism for probing potential routes with or without crankback to determine wavelength availability. Choosing the route first, and then the wavelength, may not yield acceptable utilization levels in mesh-type networks.",
      "zh-CHS": "- 在没有波长转换的情况下，需要找到一个在所有链路上都可用的单一波长，这就需要宣传关于波长可用性的详细信息，这可能无法扩展，或者有某种机制来探测有无回退的潜在路由，以确定波长可用性。在网状网络中，首先选择路由，然后选择波长，可能不会产生可接受的利用率水平。"
    },
    {
      "indent": 0,
      "text": "5. More Complex Networks",
      "section_title": true,
      "zh-CHS": "5. 更复杂的网络"
    },
    {
      "indent": 3,
      "text": "Mixing optical equipment in a single domain of transparency that has not been explicitly designed to interwork is beyond the scope of this document. This includes most multi-vendor all-optical networks.",
      "zh-CHS": "未明确设计用于互通的单一透明领域中的混合光学设备超出了本文件的范围。这包括大多数多供应商全光网络。"
    },
    {
      "indent": 3,
      "text": "An optical network composed of multiple domains of transparency optically isolated from each other by O/E/O devices (transponders) is more plausible. A network composed of both \"opaque\" (optically isolated) OLXCs and one or more all-optical \"islands\" isolated by transponders is of particular interest because this is most likely how all-optical technologies (such as that described in Sec. 2) are going to be introduced. (We use the term \"island\" in this discussion rather than a term like \"domain\" or \"area\" because these terms are associated with specific approaches like BGP or OSPF.)",
      "zh-CHS": "由O/E/O设备（转发器）相互光学隔离的多个透明域组成的光网络更合理。由“不透明”（光学隔离）OLXC和由转发器隔离的一个或多个全光“孤岛”组成的网络特别令人感兴趣，因为这是最有可能引入全光技术（如第2节所述）的方式。（在本讨论中，我们使用术语“孤岛”，而不是“域”或“区域”，因为这些术语与BGP或OSPF等特定方法相关。）"
    },
    {
      "indent": 3,
      "text": "We consider the complexities raised by these alternatives now.",
      "zh-CHS": "我们现在考虑这些替代方案所带来的复杂性。"
    },
    {
      "indent": 3,
      "text": "The first requirement for routing in a multi-island network is that the routing process needs to know the extent of each island. There are several reasons for this:",
      "zh-CHS": "在多岛网络中，路由的第一个要求是路由过程需要知道每个岛的范围。这有几个原因："
    },
    {
      "indent": 3,
      "text": "- When entering or leaving an all-optical island, the regeneration process cleans up the optical impairments discussed in Sec. 3.",
      "zh-CHS": "- 当进入或离开全光孤岛时，再生过程会清除第节中讨论的光学损伤。3."
    },
    {
      "indent": 3,
      "text": "- Each all-optical island may have its own bounds on each impairment.",
      "zh-CHS": "- 每个全光孤岛在每个损伤上都有自己的界限。"
    },
    {
      "indent": 3,
      "text": "- The routing process needs to be sensitive to the costs associated with \"island-hopping\".",
      "zh-CHS": "- 路由过程需要对与“跳岛”相关的成本敏感。"
    },
    {
      "indent": 3,
      "text": "This last point needs elaboration. It is extremely important to realize that, at least in the short to intermediate term, the resources committed by a single routing decision can be very significant: The equipment tied up by a single coast-to-coast OC-192 can easily have a first cost of $10**6, and the holding times on a circuit once established is likely to be measured in months. Carriers will expect the routing algorithms used to be sensitive to these costs. Simplistic measures of cost such as the number of \"hops\" are not likely to be acceptable.",
      "zh-CHS": "最后一点需要详细阐述。认识到这一点非常重要，至少在短期到中期内，单个路由决策投入的资源可能非常重要：由单个海岸到海岸OC-192捆绑的设备很容易产生10**6美元的首次成本，电路一旦建立，保持时间可能以月为单位。运营商希望过去的路由算法对这些成本敏感。诸如“啤酒花”数量等简单的成本衡量标准不太可能被接受。"
    },
    {
      "indent": 3,
      "text": "Taking the case of an all-optical island consisting of an \"ultra long-haul\" system like that in Fig. 3-1 embedded in an OEO network of electrical fabric OLXCs as an example: It is likely that the ULH system will be relatively expensive for short hops but relatively economical for longer distances. It is therefore likely to be deployed as a sort of \"express backbone\". In this scenario a carrier is likely to expect the routing algorithm to balance OEO costs against the additional costs associated with ULH technology and route circuitously to make maximum use of the backbone where appropriate. Note that the metrics used to do this must be consistent throughout the routing domain if this expectation is to be met.",
      "zh-CHS": "以由“超长距离”系统组成的全光岛为例，如图3-1中嵌入在电结构OLXCs的OEO网络中的系统：ULH系统可能在短跳时相对昂贵，但在长距离时相对经济。因此，它可能被部署为一种“快速主干网”。在这种情况下，运营商可能期望路由算法平衡OEO成本与ULH技术相关的额外成本，并在适当情况下迂回路由以最大限度地利用主干网。请注意，如果要满足这一期望，用于执行此操作的度量必须在整个路由域中保持一致。"
    },
    {
      "indent": 3,
      "text": "The first-order implications for GMPLS seem to be:",
      "zh-CHS": "GMPLS的一阶含义似乎是："
    },
    {
      "indent": 3,
      "text": "- Information about island boundaries needs to be advertised.",
      "zh-CHS": "- 关于岛屿边界的信息需要公布。"
    },
    {
      "indent": 3,
      "text": "- The routing algorithm needs to be sensitive to island transitions and to the connectivity limitations and impairment constraints particular to each island.",
      "zh-CHS": "- 路由算法需要对孤岛过渡以及每个孤岛特有的连接限制和损伤约束敏感。"
    },
    {
      "indent": 3,
      "text": "- The cost function used in routing must allow the balancing of transponder costs, OXC and OADM costs, and line haul costs across the entire routing domain.",
      "zh-CHS": "- 路由中使用的成本函数必须允许在整个路由域中平衡转发器成本、OXC和OADM成本以及长途运输成本。"
    },
    {
      "indent": 3,
      "text": "Several distributed approaches to multi-island routing seem worth investigating:",
      "zh-CHS": "多岛路由的几种分布式方法似乎值得研究："
    },
    {
      "indent": 3,
      "text": "- Advertise the internal topology and constraints of each island globally; let the ingress node compute an end-to-end strict explicit route sensitive to all constraints and wavelength availabilities. In this approach the routing algorithm used by the ingress node must be able to deal with the details of routing within each island.",
      "zh-CHS": "- 全球宣传每个岛的内部拓扑和约束；让入口节点计算对所有约束和波长可用性敏感的端到端严格显式路由。在这种方法中，入口节点使用的路由算法必须能够处理每个岛内的路由细节。"
    },
    {
      "indent": 3,
      "text": "- Have the EMS or control plane of each island determine and advertise the connectivity between its boundary nodes together with additional information such as costs and the bit rates and formats supported. As the spare capacity situation changes, updates would be advertised. In this approach impairment constraints are handled within each island and impairment-related parameters need not be advertised outside of the island. The ingress node would then do a loose explicit route and leave the routing and wavelength selection within each island to the island.",
      "zh-CHS": "- 让每个岛的EMS或控制平面确定并公布其边界节点之间的连接，以及其他信息，如成本、比特率和支持的格式。随着备用容量情况的变化，将公布更新。在这种方法中，减值约束在每个岛内处理，减值相关参数无需在岛外公布。入口节点随后将执行松散的显式路由，并将每个岛内的路由和波长选择留给岛。"
    },
    {
      "indent": 3,
      "text": "- Have the ingress node send out probes or queries to nearby gateway nodes or to an NMS to get routing guidance.",
      "zh-CHS": "- 让入口节点向附近的网关节点或NMS发送探测或查询，以获得路由指导。"
    },
    {
      "indent": 0,
      "text": "6. Diversity",
      "section_title": true,
      "zh-CHS": "6. 差异"
    },
    {
      "indent": 0,
      "text": "6.1. Background on Diversity",
      "section_title": true,
      "zh-CHS": "6.1. 多样性背景"
    },
    {
      "indent": 3,
      "text": "\"Diversity\" is a relationship between lightpaths. Two lightpaths are said to be diverse if they have no single point of failure. In traditional telephony the dominant transport failure mode is a failure in the interoffice plant, such as a fiber cut inflicted by a backhoe.",
      "zh-CHS": "“多样性”是光路之间的关系。如果两条光路没有单点故障，则称之为不同的光路。在传统电话中，主要的传输故障模式是办公室间设备的故障，例如反铲造成的光纤切断。"
    },
    {
      "indent": 3,
      "text": "Why is diversity a unique problem that needs to be considered for optical networks? Traditionally, data network operators have relied on their private line providers to ensure diversity and so have not had to deal directly with the problem. GMPLS makes the complexities handled by the private line provisioning process, including diversity, part of the common control plane and so visible to all.",
      "zh-CHS": "为什么多样性是光网络需要考虑的独特问题？传统上，数据网络运营商依靠其专用线路提供商来确保多样性，因此不必直接处理该问题。GMPLS使专用线路供应过程处理的复杂性，包括多样性，公共控制平面的一部分，因此对所有人都可见。"
    },
    {
      "indent": 3,
      "text": "To determine whether two lightpath routings are diverse it is necessary to identify single points of failure in the interoffice plant. To do so we will use the following terms: A fiber cable is a uniform group of fibers contained in a sheath. An Optical Transport System will occupy fibers in a sequence of fiber cables. Each fiber cable will be placed in a sequence of conduits - buried honeycomb structures through which fiber cables may be pulled - or buried in a right of way (ROW). A ROW is land in which the network operator has the right to install his conduit or fiber cable. It is worth noting that for economic reasons, ROWs are frequently obtained from railroads, pipeline companies, or thruways. It is frequently the case that several carriers may lease ROW from the same source; this makes it common to have a number of carriers' fiber cables in close proximity to each other. Similarly, in a metropolitan network, several carriers might be leasing duct space in the same RBOC conduit. There are also \"carrier's carriers\" - optical networks which provide fibers to multiple carriers, all of whom could be affected by a single failure in the \"carrier's carrier\" network. In",
      "zh-CHS": "为了确定两条光路路由是否不同，有必要确定办公室间工厂中的单点故障。为此，我们将使用以下术语：光缆是包含在护套中的一组均匀光纤。光传输系统将以光缆的顺序占用光纤。每根光纤电缆将被放置在一系列导管中——埋入蜂窝结构中，光纤电缆可通过这些导管被牵引——或埋入路权（ROW）中。一排是指网络运营商有权安装其导管或光缆的土地。值得注意的是，出于经济原因，ROW通常来自铁路、管道公司或高速公路。通常情况下，多个运营商可以从同一来源租赁行；这使得许多运营商的光缆彼此非常接近变得很常见。类似地，在大都市网络中，多个运营商可能在同一个RBOC管道中租用管道空间。还有“运营商的运营商”——向多个运营商提供光纤的光纤网络，所有运营商都可能受到“运营商的运营商”网络中单一故障的影响。在里面"
    },
    {
      "indent": 3,
      "text": "a typical intercity facility network there might be on the order of 100 offices that are candidates for OLXCs. To represent the inter-office fiber network accurately a network with an order of magnitude more nodes is required. In addition to Optical Amplifier (OA) sites, these additional nodes include:",
      "zh-CHS": "一个典型的城际设施网络可能有大约100个办事处，这些办事处都是OLXC的候选办事处。为了准确地表示办公室间光纤网络，需要一个数量级的网络，即多个节点。除了光放大器（OA）站点外，这些附加节点还包括："
    },
    {
      "indent": 3,
      "text": "- Places where fiber cables enter/leave a conduit or right of way;",
      "zh-CHS": "- 光纤电缆进出导管或通行权的位置；"
    },
    {
      "indent": 3,
      "text": "- Locations where fiber cables cross; Locations where fiber splices are used to interchange fibers between fiber cables.",
      "zh-CHS": "- 光缆交叉的位置；使用光纤接头在光纤电缆之间交换光纤的位置。"
    },
    {
      "indent": 3,
      "text": "An example of the first might be:",
      "zh-CHS": "第一个例子可能是："
    },
    {
      "indent": 6,
      "text": "                              A                 B\nA-------------B                 \\             /\n                                  \\         /\n                                    X-----Y\n                                  /         \\\nC-------------D                 /             \\\n                              C                 D",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "(a) Fiber Cable Topology (b) Right-Of-Way/Conduit Topology",
      "zh-CHS": "(a) 光缆拓扑（b）路权/导管拓扑"
    },
    {
      "indent": 13,
      "text": "Figure 6-1: Fiber Cable vs. ROW Topologies",
      "zh-CHS": "图6-1：光纤电缆与世界其他地区的拓扑结构"
    },
    {
      "indent": 3,
      "text": "Here the A-B fiber cable would be physically routed A-X-Y-B and the C-D cable would be physically routed C-X-Y-D. This topology might arise because of some physical bottleneck: X-Y might be the Lincoln Tunnel, for example, or the Bay Bridge.",
      "zh-CHS": "此处，A-B光缆将物理路由为A-X-Y-B，C-D光缆将物理路由为C-X-Y-D。这种拓扑可能是由于某些物理瓶颈而产生的：例如，X-Y可能是林肯隧道或海湾大桥。"
    },
    {
      "indent": 3,
      "text": "Fiber route crossing (the second case) is really a special case of this, where X and Y coincide. In this case the crossing point may not even be a manhole; the fiber routes might just be buried at different depths.",
      "zh-CHS": "光纤路由交叉（第二种情况）实际上是一种特殊情况，其中X和Y重合。在这种情况下，交叉点甚至可能不是检修孔；光纤线路可能只是埋在不同的深度。"
    },
    {
      "indent": 3,
      "text": "Fiber splicing (the third case) often occurs when a major fiber route passes near to a small office. To avoid the expense and additional transmission loss only a small number of fibers are spliced out of the major route into a smaller route going to the small office. This might well occur in a manhole or hut. An example is shown in Fig. 6-2(a), where A-X-B is the major route, X the manhole, and C the smaller office. The actual fiber topology would then look like Fig. 6-2(b), where there would typically be many more A-B fibers than A-C or C-B fibers, and where A-C and C-B might have different numbers of fibers. (One of the latter might even be missing.)",
      "zh-CHS": "光纤拼接（第三种情况）通常发生在主光纤线路经过小型办公室附近时。为了避免费用和额外的传输损耗，只需将少量光纤从主路由拼接到通往小型办公室的较小路由中。这很可能发生在检修孔或小屋中。图6-2（a）中显示了一个示例，其中a-X-B为主要路线，X为人孔，C为较小的办公室。实际的光纤拓扑结构将如图6-2（b）所示，其中A-b光纤通常比A-C或C-b光纤多得多，并且A-C和C-b可能具有不同数量的光纤。（后者中的一个甚至可能不见了。）"
    },
    {
      "indent": 15,
      "text": "       C                             C\n       |                           /   \\\n       |                         /       \\\n       |                       /           \\\nA------X------B              A---------------B",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "(a) Fiber Cable Topology (b) Fiber Topology",
      "zh-CHS": "(a) 光纤电缆拓扑（b）光纤拓扑"
    },
    {
      "indent": 17,
      "text": "Figure 6-2. Fiber Cable vs Fiber Topologies",
      "zh-CHS": "图6-2。光纤电缆与光纤拓扑"
    },
    {
      "indent": 3,
      "text": "The imminent deployment of ultra-long (>1000 km) Optical Transport Systems introduces a further complexity: Two OTSes could interact a number of times. To make up a hypothetical example: A New York - Atlanta OTS and a Philadelphia - Orlando OTS might ride on the same right of way for x miles in Maryland and then again for y miles in Georgia. They might also cross at Raleigh or some other intermediate node without sharing right of way.",
      "zh-CHS": "即将部署的超长（>1000 km）光传输系统带来了进一步的复杂性：两个OTSE可以进行多次交互。假设一个例子：一辆纽约-亚特兰大OTS和一辆费城-奥兰多OTS可能在马里兰州行驶x英里，然后在乔治亚州行驶y英里。它们也可能在罗利或其他中间节点交叉，而不共享通行权。"
    },
    {
      "indent": 3,
      "text": "Diversity is often equated to routing two lightpaths between a single pair of points, or different pairs of points so that no single route failure will disrupt them both. This is too simplistic, for a number of reasons:",
      "zh-CHS": "分集通常等同于在一对点或不同的点对之间路由两条光路，以便没有单一路由故障会破坏它们。这太简单了，原因有很多："
    },
    {
      "indent": 3,
      "text": "- A sophisticated client of an optical network will want to derive diversity needs from his/her end customers' availability requirements. These often lead to more complex diversity requirements than simply providing diversity between two lightpaths. For example, a common requirement is that no single failure should isolate a node or nodes. If a node A has single lightpaths to nodes B and C, this requires A-B and A-C to be diverse. In real applications, a large data network with N lightpaths between its routers might describe their needs in an NxN matrix, where (i,j) defines whether lightpaths i and j must be diverse.",
      "zh-CHS": "- 光纤网络的复杂客户希望从其终端客户的可用性需求中获得多样性需求。这些通常导致比简单地提供两条光路之间的分集更复杂的分集要求。例如，一个常见的要求是，任何单一故障都不应隔离一个或多个节点。如果节点a具有到节点B和C的单个光路，则这要求a-B和a-C具有多样性。在实际应用中，路由器之间有N条光路的大型数据网络可能在NxN矩阵中描述它们的需求，其中（i，j）定义了光路i和j是否必须多样化。"
    },
    {
      "indent": 3,
      "text": "- Two circuits that might be considered diverse for one application might not be considered diverse for in another situation. Diversity is usually thought of as a reaction to interoffice route failures. High reliability applications may require other types of failures to be taken into account. Some examples:",
      "zh-CHS": "- 在另一种情况下，对于一种应用可能被视为不同的两个电路可能不会被视为不同。多样性通常被认为是对办公室间路由故障的一种反应。高可靠性应用可能需要考虑其他类型的故障。一些例子："
    },
    {
      "indent": 6,
      "text": "o Office Outages: Although less frequent than route failures, fires, power outages, and floods do occur. Many network managers require that diverse routes have no (intermediate) nodes in common. In other cases an intermediate node might be acceptable as long as there is power diversity within the office.",
      "zh-CHS": "o 办公室停电：虽然比线路故障少，但火灾、停电和洪水确实会发生。许多网络管理器要求不同的路由没有共同的（中间）节点。在其他情况下，只要办公室内存在电源多样性，就可以接受中间节点。"
    },
    {
      "indent": 6,
      "text": "o Shared Rings: Many applications are willing to allow \"diverse\" circuits to share a SONET ring-protected link; presumably they would allow the same for optical layer rings.",
      "zh-CHS": "o 共享环：许多应用程序愿意允许“多样化”电路共享SONET环保护链路；据推测，对于光学层环，它们将允许相同的情况。"
    },
    {
      "indent": 6,
      "text": "o Disasters: Earthquakes and floods can cause failures over an extended area. Defense Department circuits might need to be routed with nuclear damage radii taken into account.",
      "zh-CHS": "o 灾害：地震和洪水可能导致大面积的故障。国防部的电路布线可能需要考虑核损伤半径。"
    },
    {
      "indent": 3,
      "text": "- Conversely, some networks may be willing to take somewhat larger risks. Taking route failures as an example: Such a network might be willing to consider two fiber cables in heavy duty concrete conduit as having a low enough chance of simultaneous failure to be considered \"diverse\". They might also be willing to view two fiber cables buried on opposite sides of a railroad track as being diverse because there is minimal danger of a single backhoe disrupting them both even though a bad train wreck might jeopardize them both. A network seeking N mutually diverse paths from an office with less than N diverse ROWs will need to live with some level of compromise in the immediate vicinity of the office.",
      "zh-CHS": "- 相反，一些网络可能愿意承担更大的风险。以线路故障为例：这样的网络可能愿意考虑重负荷混凝土管道中的两条光纤电缆，因为其具有同时被认为是“多样性”的足够低的机会。他们也可能愿意将埋在铁路轨道两侧的两根光缆视为多种多样的光缆，因为即使发生严重的火车失事，也不会有一台反铲破坏它们的危险。如果一个网络从一个不到N个不同行的办公室中寻找N条相互不同的路径，那么它需要在办公室附近进行某种程度的妥协。"
    },
    {
      "indent": 3,
      "text": "These considerations strongly suggest that the routing algorithm should be sensitive to the types of threat considered unacceptable by the requester. Note that the impairment constraints described in the previous section may eliminate some of the long circuitous routes sometimes needed to provide diversity. This would make it harder to find many diverse paths through an all-optical network than an opaque one.",
      "zh-CHS": "这些考虑强烈建议路由算法应该对请求者认为不可接受的威胁类型敏感。请注意，前一节中描述的损伤约束可能会消除一些有时需要提供多样性的长迂回路线。这将使得通过全光网络比不透明网络更难找到许多不同的路径。"
    },
    {
      "indent": 3,
      "text": "[Hjalmtysson00] introduced the term \"Shared Risk Link Group\" (SRLG) to describe the relationship between two non-diverse links. The above examples and discussion given at the start of this section suggests that an SRLG should be characterized by 2 parameters:",
      "zh-CHS": "[Hjalmtysson00]引入术语“共享风险链接组”（SRLG）来描述两个非多元化链接之间的关系。本节开头给出的上述示例和讨论表明，SRLG应具有两个参数："
    },
    {
      "indent": 3,
      "text": "- Type of Compromise: Examples would be shared fiber cable, shared conduit, shared ROW, shared optical ring, shared office without power sharing, etc.)",
      "zh-CHS": "- 妥协类型：例如共享光缆、共享导管、共享行、共享光环、不共享电源的共享办公室等。）"
    },
    {
      "indent": 3,
      "text": "- Extent of Compromise: For compromised outside plant, this would be the length of the sharing.",
      "zh-CHS": "- 妥协程度：对于妥协的外部工厂，这将是共享的长度。"
    },
    {
      "indent": 3,
      "text": "A CSPF algorithm could then penalize a diversity compromise by an amount dependent on these two parameters.",
      "zh-CHS": "然后，CSPF算法可以根据这两个参数对多样性妥协进行一定程度的惩罚。"
    },
    {
      "indent": 3,
      "text": "Two links could be related by many SRLGs. (AT&T's experience indicates that a link may belong to over 100 SRLGs, each corresponding to a separate fiber group.) Each SRLG might relate a single link to many other links. For the optical layer, similar situations can be expected where a link is an ultra-long OTS.",
      "zh-CHS": "这两个链接可能由许多SRLGs关联。（AT&T的经验表明，一条链路可能属于100多个SRLG，每个SRLG对应一个单独的光纤组。）每个SRLG可能将一条链路与许多其他链路相关联。对于光学层，在链路是超长OTS的情况下，可以预期类似的情况。"
    },
    {
      "indent": 3,
      "text": "The mapping between links and different types of SRLGs is in general defined by network operators based on the definition of each SRLG type. Since SRLG information is not yet ready to be discoverable by a network element and does not change dynamically, it need not be advertised with other resource availability information by network elements. It could be configured in some central database and be distributed to or retrieved by the nodes, or advertised by network elements at the topology discovery stage.",
      "zh-CHS": "链路和不同类型SRLG之间的映射通常由网络运营商根据每个SRLG类型的定义进行定义。由于SRLG信息尚未准备好由网元发现，并且不会动态更改，因此不需要由网元将其与其他资源可用性信息一起公布。它可以在一些中央数据库中配置，并分发给节点或由节点检索，或在拓扑发现阶段由网络元素发布。"
    },
    {
      "indent": 0,
      "text": "6.2. Implications For Routing",
      "section_title": true,
      "zh-CHS": "6.2. 对路由的影响"
    },
    {
      "indent": 3,
      "text": "Dealing with diversity is an unavoidable requirement for routing in the optical layer. It requires dealing with constraints in the routing process, but most importantly requires additional state information (e.g., the SRLG relationships). The routings of any existing circuits from which the new circuit must be diverse must also be available to the routing process.",
      "zh-CHS": "处理分集是光层路由不可避免的要求。它需要处理路由过程中的约束，但最重要的是需要额外的状态信息（例如，SRLG关系）。新线路必须多样化的任何现有线路的布线也必须可用于布线过程。"
    },
    {
      "indent": 3,
      "text": "At present SRLG information cannot be self-discovered. Indeed, in a large network it is very difficult to maintain accurate SRLG information. The problem becomes particularly daunting whenever multiple administrative domains are involved, for instance after the acquisition of one network by another, because there normally is a likelihood that there are diversity violations between the domains. It is very unlikely that diversity relationships between carriers will be known any time in the near future.",
      "zh-CHS": "目前，SRLG信息无法自我发现。事实上，在大型网络中，很难维护准确的SRLG信息。每当涉及多个管理域时（例如，在一个网络被另一个网络收购之后），该问题就变得特别令人畏惧，因为域之间通常存在违反多样性的可能性。在不久的将来，不太可能知道载波之间的分集关系。"
    },
    {
      "indent": 3,
      "text": "Considerable variation in what different customers will mean by acceptable diversity should be anticipated. Consequently we suggest that an SRLG should be defined as follows: (i) It is a relationship between two or more links, and (ii) it is characterized by two parameters, the type of compromise (shared conduit, shared ROW, shared optical ring, etc.) and the extent of the compromise (e.g., the number of miles over which the compromise persisted). This will allow the SRLGs appropriate to a particular routing request to be easily identified.",
      "zh-CHS": "不同的客户所指的可接受的多样性应存在相当大的差异。因此，我们建议将SRLG定义如下：（i）它是两个或多个链路之间的关系，以及（ii）它由两个参数表征，折衷类型（共享导管、共享行、共享光环等）和折衷程度（例如，折衷持续的英里数）。这将允许容易地识别适合于特定路由请求的srlg。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "We are assuming OEO interfaces to the domain(s) covered by our discussion (see, e.g., Sec. 4.1 above). If this assumption were to be relaxed and externally generated optical signals allowed into the",
      "zh-CHS": "我们假设OEO接口与我们的讨论所涉及的域（见上文第4.1节）。如果放宽这一假设，允许外部产生的光信号进入"
    },
    {
      "indent": 3,
      "text": "domain, network security issues would arise. Specifically, unauthorized usage in the form of signals at improper wavelengths or with power levels or impairments inconsistent with those assumed by the domain would be possible. With OEO interfaces, these types of layer one threats should be controllable.",
      "zh-CHS": "域，网络安全问题就会出现。具体地说，以不适当波长的信号或功率水平或损害不符合本领域假设的信号形式进行未经授权的使用是可能的。对于OEO接口，这些类型的第一层威胁应该是可控的。"
    },
    {
      "indent": 3,
      "text": "A key layer one security issue is resilience in the face of physical attack. Diversity, as describe in Sec. 6, is a part of the solution. However, it is ineffective if there is not sufficient spare capacity available to make the network whole after an attack. Several major related issues are:",
      "zh-CHS": "一个关键的第一层安全问题是在面对物理攻击时的恢复能力。多样性，如第。是解决方案的一部分。但是，如果攻击后没有足够的备用容量使网络完整，则该方法无效。几个主要的相关问题是："
    },
    {
      "indent": 3,
      "text": "- Defining the threat: If, for example, an electro-magnetic interference (EMI) burst is an in-scope threat, then (in the terminology of Sec. 6) all of the links sufficiently close together to be disrupted by such a burst must be included in a single SRLG. Similarly for other threats: For each in-scope threat, SRLGs must be defined so that all links vulnerable to a single incident of the threat must be grouped together in a single SRLG.",
      "zh-CHS": "- 定义威胁：例如，如果电磁干扰（EMI）突发是范围内的威胁，那么（用第6节的术语）所有足够紧密的链路都必须包含在一个SRLG中，以便被此类突发中断。类似地，对于其他威胁：对于每个范围内的威胁，必须定义SRLG，以便所有易受单个威胁事件影响的链路必须在单个SRLG中分组。"
    },
    {
      "indent": 3,
      "text": "- Allocating responsibility for responding to a layer one failure between the various layers (especially the optical and IP layers): This must be clearly specified to avoid churning and unnecessary service interruptions.",
      "zh-CHS": "- 在不同层（特别是光学层和IP层）之间分配响应第一层故障的责任：必须明确规定这一点，以避免混乱和不必要的服务中断。"
    },
    {
      "indent": 3,
      "text": "The whole proposed process depends on the integrity of the impairment characterization information (PMD parameters, etc.) and also the SRLG definitions. Security of this information, both when stored and when distributed, is essential.",
      "zh-CHS": "整个拟定过程取决于损伤表征信息（PMD参数等）的完整性以及SRLG定义。这些信息在存储和分发时的安全性至关重要。"
    },
    {
      "indent": 3,
      "text": "This document does not address control plane issues, and so control-plane security is out of scope. IPO control plane security considerations are discussed in [Rajagopalam04]. Security considerations for GMPLS, a likely control plane candidate, are discussed in [Mannie04].",
      "zh-CHS": "本文档不涉及控制平面问题，因此控制平面安全性超出范围。[Rajagopalam04]中讨论了IPO控制平面安全注意事项。[Mannie04]中讨论了GMPLS（一种可能的候选控制平面）的安全注意事项。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "This document has benefited from discussions with Michael Eiselt, Jonathan Lang, Mark Shtaif, Jennifer Yates, Dongmei Wang, Guangzhi Li, Robert Doverspike, Albert Greenberg, Jim Maloney, John Jacob, Katie Hall, Diego Caviglia, D. Papadimitriou, O. Audouin, J. P. Faure, L. Noirie, and with our OIF colleagues.",
      "zh-CHS": "本文件得益于与Michael Eiselt、Jonathan Lang、Mark Shtaif、Jennifer Yates、Wang Dongmi、Li Guangzhi、Robert Doverspike、Albert Greenberg、Jim Maloney、John Jacob、Katie Hall、Diego Caviglia、D.Papadimitriou、O.Audouin、J.P.Faure、L.Noirie以及OIF同事的讨论。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[Goldstein94] Goldstein, E. L., Eskildsen, L., and Elrefaie, A. F., Performance Implications of Component Crosstalk in Transparent Lightwave Networks\", IEEE Photonics Technology Letters, Vol.6, No.5, May 1994.",
      "zh-CHS": "[Goldstein94]Goldstein，E.L.，Eskildsen，L.，和Elrefaie，A.F.，透明光波网络中组件串扰的性能影响”，《IEEE光电子技术快报》，第6卷，第5期，1994年5月。"
    },
    {
      "indent": 3,
      "text": "[Hjalmtysson00] Gsli Hjalmtysson, Jennifer Yates, Sid Chaudhuri and Albert Greenberg, \"Smart Routers - Simple Optics: An Architecture for the Optical Internet, IEEE/OSA Journal of Lightwave Technology, December 2000, Vo 18, Issue 12, Dec. 2000, pp. 1880-1891.",
      "zh-CHS": "[Hjalmtysson00]Gsli Hjalmtysson，Jennifer Yates，Sid Chaudhuri和Albert Greenberg，“智能路由器-简单光学：光互联网架构”，IEEE/OSA光波技术杂志，2000年12月，Vo 18，2000年12月第12期，1880-1891页。"
    },
    {
      "indent": 3,
      "text": "[ITU] ITU-T Doc. G.663, Optical Fibers and Amplifiers, Section II.4.1.2.",
      "zh-CHS": "[ITU]ITU-T文件。G.663，光纤和放大器，第II.4.1.2节。"
    },
    {
      "indent": 3,
      "text": "[Kaminow97] Kaminow, I. P. and Koch, T. L., editors, Optical Fiber Telecommunications IIIA, Academic Press, 1997.",
      "zh-CHS": "[Kaminow97]Kaminow，I.P.和Koch，T.L.，编辑，光纤通信IIIA，学术出版社，1997年。"
    },
    {
      "indent": 3,
      "text": "[Mannie04] Mannie, E., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Architecture\", RFC 3945, October 2004.",
      "zh-CHS": "[Mannie04]Mannie，E.，Ed.“通用多协议标签交换（GMPLS）体系结构”，RFC 39452004年10月。"
    },
    {
      "indent": 3,
      "text": "[Rajagopalam04] Rajagopalan, B., Luciani, J., and D. Awduche, \"IP over Optical Networks: A Framework\", RFC 3717, March 2004.",
      "zh-CHS": "[Rajagopalam04]Rajagopalan，B.，Luciani，J.，和D.Awduche，“光网络IP：框架”，RFC 37172004年3月。"
    },
    {
      "indent": 3,
      "text": "[Strand01] Strand, J., Chiu, A., and R. Tkach, \"Issues for Routing in the Optical Layer\", IEEE Communications Magazine, Feb. 2001, vol. 39 No. 2, pp. 81-88.",
      "zh-CHS": "[Strand01]Strand，J.，Chiu，A.，和R.Tkach，“光层路由问题”，IEEE通信杂志，2001年2月，第39卷第2期，第81-88页。"
    },
    {
      "indent": 3,
      "text": "[Strand01b] Strand, J., Doverspike, R., and G. Li, \"Importance of Wavelength Conversion In An Optical Network\", Optical Networks Magazine, May/June 2001, pp. 33-44.",
      "zh-CHS": "[Strand01b]Strand，J.，Doverspike，R.，和G.Li，“光网络中波长转换的重要性”，光网络杂志，2001年5月/6月，第33-44页。"
    },
    {
      "indent": 3,
      "text": "[Yates99] Yates, J. M., Rumsewicz, M. P., and J. P. R. Lacey, \"Wavelength Converters in Dynamically-Reconfigurable WDM Networks\", IEEE Communications Surveys, 2Q1999 (online at www.comsoc.org/pubs/surveys/2q99issue/yates.html).",
      "zh-CHS": "[Yates99]Yates，J.M.，Rumsewicz，M.P.，和J.P.R.Lacey，“动态可重构WDM网络中的波长转换器”，IEEE通信调查，1999年第2季度（在线访问www.comsoc.org/pubs/Surveys/2q99issue/Yates.html）。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[Awduche99] Awduche, D. O., Rekhter, Y., Drake, J., R. and Coltun, \"Multi-Protocol Lambda Switching: Combining MPLS Traffic Engineering Control With Optical Crossconnects\", Work in Progress.",
      "zh-CHS": "[Awduche99]Awduche，D.O.，Rekhter，Y.，Drake，J.，R.和Coltun，“多协议Lambda交换：将MPLS流量工程控制与光交叉连接相结合”，正在进行中。"
    },
    {
      "indent": 3,
      "text": "[Gerstel2000] Gorstel, O., \"Optical Layer Signaling: How Much Is Really Needed?\" IEEE Communications Magazine, vol. 38 no. 10, Oct. 2000, pp. 154-160",
      "zh-CHS": "[Gerstel2000]Gorstel，O.，“光层信令：真正需要多少？”IEEE通信杂志，第38卷第10期，2000年10月，第154-160页"
    },
    {
      "indent": 3,
      "text": "[Kaminow02] Ivan P. Kaminow and Tingye Li (editors), \"Optical Fiber Communications IV: Systems and Impairments\", Elsevier Press, 2002.",
      "zh-CHS": "[Kaminow02]Ivan P.Kaminow和Tingye Li（编辑），“光纤通信四：系统和损伤”，爱思唯尔出版社，2002年。"
    },
    {
      "indent": 3,
      "text": "[Passmore01] Passmore, D., \"Managing Fatter Pipes,\" Business Communications Review, August 2001, pp. 20-21.",
      "zh-CHS": "[Passmore01]Passmore，D.，“管理肥胖管道”，《商业传播评论》，2001年8月，第20-21页。"
    },
    {
      "indent": 3,
      "text": "[Ramaswami98] Ramaswami, R. and K. N. Sivarajan, Optical Networks: A Practical Perspective, Morgan Kaufmann Publishers, 1998.",
      "zh-CHS": "[Ramaswami98]Ramaswami，R.和K.N.Sivarajan，《光网络：实用的视角》，摩根·考夫曼出版社，1998年。"
    },
    {
      "indent": 3,
      "text": "[Strand02] John Strand, \"Optical Network Architecture Evolution\", in [Kaminow02].",
      "zh-CHS": "[Strand02]John Strand，“光网络体系结构演变”，发表于[Kaminow02]。"
    },
    {
      "indent": 3,
      "text": "[Tkach98] Tkach, R., Goldstein, E., Nagel, J., and J. Strand, \"Fundamental Limits of Optical Transparency\", Optical Fiber Communication Conf., Feb. 1998, pp. 161-162.",
      "zh-CHS": "[Tkach98]Tkach，R.，Goldstein，E.，Nagel，J.，和J.Strand，“光学透明度的基本限制”，光纤通信形态，1998年2月，第161-162页。"
    },
    {
      "indent": 0,
      "text": "10. Contributing Authors",
      "section_title": true,
      "zh-CHS": "10. 撰稿人"
    },
    {
      "indent": 3,
      "text": "This document was a collective work of a number of people. The text and content of this document was contributed by the editors and the co-authors listed below.",
      "zh-CHS": "这份文件是许多人的集体作品。本文件的文本和内容由以下列出的编辑和合著者提供。"
    },
    {
      "indent": 3,
      "text": "Ayan Banerjee Calient Networks 6620 Via Del Oro San Jose, CA 95119 EMail: abanerjee@calient.net",
      "zh-CHS": "Ayan Banerjee Calient Networks 6620通过加利福尼亚州圣何塞市Del Oro 95119发送电子邮件：abanerjee@calient.net"
    },
    {
      "indent": 3,
      "text": "Prof. Dan Blumenthal Eng. Science Bldg., Room 2221F Department of Electrical and Computer Engineering University of California Santa Barbara, CA 93106-9560 EMail: danb@ece.ucsb.edu",
      "zh-CHS": "丹BrimthalEngEngic Brdgg，加利福尼亚大学电气与计算机工程系，巴巴拉，CA931069560，2221F室：danb@ece.ucsb.edu"
    },
    {
      "indent": 3,
      "text": "Dr. John Drake Boeing 2260 E Imperial Highway El Segundo, Ca 90245 EMail: John.E.Drake2@boeing.com",
      "zh-CHS": "约翰·德雷克博士，波音2260 E，加利福尼亚州塞贡多帝国公路，邮编90245电子邮件：John.E。Drake2@boeing.com"
    },
    {
      "indent": 3,
      "text": "Andre Fredette Hatteras Networks PO Box 110025 Research Triangle Park, NC 27709 EMail: afredette@hatterasnetworks.com",
      "zh-CHS": "Andre Fredette Hatteras Networks邮政信箱110025北卡罗来纳州三角研究公园27709电子邮件：afredette@hatterasnetworks.com"
    },
    {
      "indent": 3,
      "text": "Change Nan Froberg's reach info to: Dr. Nan Froberg Photonic Systems, Inc. 900 Middlesex Turnpike, Bldg #5 Billerica, MA 01821 EMail: nfroberg@photonicsinc.com",
      "zh-CHS": "将Nan Froberg的联系信息更改为：Dr.Nan Froberg光子系统公司，地址：马萨诸塞州比尔里卡5号楼米德尔塞克斯收费公路900号邮编：01821电子邮件：nfroberg@photonicsinc.com"
    },
    {
      "indent": 3,
      "text": "Dr. Taha Landolsi King Fahd University KFUPM Mail Box 1026 Dhahran 31261, Saudi Arabia EMail: landolsi@kfupm.edu.sa",
      "zh-CHS": "Taha Landolsi King Fahd大学KFUPM邮箱1026 Dhahran 31261，沙特阿拉伯电子邮件：landolsi@kfupm.edu.sa"
    },
    {
      "indent": 3,
      "text": "James V. Luciani 900 Chelmsford St. Lowell, MA 01851 EMail: james_luciani@mindspring.com",
      "zh-CHS": "James V.Luciani 900 Chelmsford St.Lowell，马萨诸塞州01851电子邮件：James_luciani@mindspring.com"
    },
    {
      "indent": 3,
      "text": "Dr. Robert Tkach 32 Carriage House Lane Little Silver, NJ 07739 908 246 5048 EMail: tkach@ieee.org",
      "zh-CHS": "Robert Tkach博士新泽西州小银路32号马车屋07739 908 246 5048电子邮件：tkach@ieee.org"
    },
    {
      "indent": 3,
      "text": "Yong Xue Dr. Yong Xue DoD/DISA 5600 Columbia Pike Falls Church VA 22041 EMail: yong.xue@disa.mil",
      "zh-CHS": "Yong Xue博士Yong Xue DoD/DISA 5600 Columbia Pike Falls Church VA 22041电子邮件：Yong。xue@disa.mil"
    },
    {
      "indent": 0,
      "text": "Editors' Addresses",
      "zh-CHS": "编辑地址"
    },
    {
      "indent": 3,
      "text": "Angela Chiu AT&T Labs 200 Laurel Ave., Rm A5-1F13 Middletown, NJ 07748",
      "zh-CHS": "新泽西州米德尔敦劳雷尔大道200号A5-1F13室Angela Chiu AT&T实验室07748"
    },
    {
      "indent": 3,
      "text": "Phone: (732) 420-9061 EMail: chiu@research.att.com",
      "zh-CHS": "电话：（732）420-9061电子邮件：chiu@research.att.com"
    },
    {
      "indent": 3,
      "text": "John Strand AT&T Labs 200 Laurel Ave., Rm A5-1D33 Middletown, NJ 07748",
      "zh-CHS": "新泽西州米德尔敦劳雷尔大道200号A5-1D33室约翰斯特兰德AT&T实验室07748"
    },
    {
      "indent": 3,
      "text": "Phone: (732) 420-9036 EMail: jls@research.att.com",
      "zh-CHS": "电话：（732）420-9036电子邮件：jls@research.att.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}