{
  "title": {
    "text": "RFC 4597: Conferencing Scenarios",
    "zh-CHS": "RFC 4597"
  },
  "number": 4597,
  "created_at": "2021-11-14 10:03:34.499087+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            R. Even\nRequest for Comments: 4597                                       Polycom\nCategory: Informational                                        N. Ismail\n                                                     Cisco Systems, Inc.\n                                                               July 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Conferencing Scenarios",
      "zh-CHS": "会议场景"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes multimedia conferencing scenarios. It describes both basic and advanced conferencing scenarios involving voice, video, text, and interactive text sessions. These scenarios will help with the definition and evaluation of the protocols being developed in the centralized conferencing XCON working group.",
      "zh-CHS": "本文档介绍多媒体会议场景。它描述了基本和高级会议场景，包括语音、视频、文本和交互式文本会话。这些场景将有助于定义和评估集中会议XCON工作组正在制定的协议。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Basic Conferencing Scenarios ....................................3\n   2.1. Ad Hoc Conferences .........................................4\n   2.2. Extension of a Point-to-Point Call to a Multipoint Call ....4\n   2.3. Reserved Conferences .......................................4\n3. Advanced Conferencing Scenarios .................................5\n   3.1. Extending a Point-to-Point Call to a Multipoint Call .......5\n   3.2. Lecture Mode Conferences ...................................5\n   3.3. Conference with Conference-Aware and Unaware Participants ..6\n   3.4. A Reserved or Ad Hoc Conference with\n        Conference-Aware Participants ..............................6\n   3.5. Advanced Conference Features ...............................6\n4. Scenarios for Media Policy Control ..............................9\n   4.1. Video Mixing Scenarios ....................................10\n   4.2. Typical Video Conferencing Scenario .......................11\n   4.3. Conference Sidebar Scenario ...............................11\n   4.4. Coaching Scenario .........................................12\n   4.5. Presentation and Q & A Session ............................12\n   4.6. Presence-Enabled Ad Hoc Conference ........................13\n   4.7. Group Chat Text Conferencing ..............................13\n   4.8. Interactive Text ..........................................13\n   4.9. Moderated Group Chat ......................................14\n   4.10. Text Sidebars ............................................14\n   4.11. Conference Announcements .................................14\n5. Security Considerations ........................................14\n6. Acknowledgements ...............................................15\n7. Informative References .........................................15",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document describes multimedia conferencing scenarios. The development of these scenarios is intended to help with the definition and evaluation of the requirements for the centralized conferencing (XCON) working group. Although this document uses some definitions and conventions described in the SIP Conferencing Framework document [1], these scenarios are not specific to SIP. The document describes basic and advanced conferencing scenarios. The advanced scenarios assume that the user agents support the set of XCON protocols, identified in the Framework and Data Model for Centralized Conferencing [3], in order to take advantage of the conference functionality. However, note that many of these features can be implemented today by using an interactive voice response (IVR) or web interface to control the conferencing application.",
      "zh-CHS": "本文档介绍多媒体会议场景。这些场景的开发旨在帮助定义和评估集中式会议（XCON）工作组的需求。尽管本文档使用了SIP会议框架文档[1]中描述的一些定义和约定，但这些场景并不特定于SIP。本文档描述了基本和高级会议场景。高级场景假设用户代理支持一组XCON协议（在集中式会议的框架和数据模型[3]中确定），以便利用会议功能。但是，请注意，现在可以通过使用交互式语音响应（IVR）或web界面来控制会议应用程序来实现其中许多功能。"
    },
    {
      "indent": 3,
      "text": "The entities comprising the Conferencing System are the conference that is the center point for signaling and the participants. The participant who initiated the conference is called the initiating participant.",
      "zh-CHS": "组成会议系统的实体是作为信令中心点的会议和参与者。发起会议的参与者称为发起参与者。"
    },
    {
      "indent": 3,
      "text": "The scenarios described here demonstrate different conferencing services. These services can be offered in a multimedia environment that benefits from having some support in the user agents that enable more robust and easier-to-use conferencing services. It is up to the conferencing system manufacturers and the conferencing service provider to decide what services can be built and which services are offered to the end users.",
      "zh-CHS": "这里描述的场景演示了不同的会议服务。这些服务可以在多媒体环境中提供，这得益于在用户代理中提供一些支持，从而实现更健壮和更易于使用的会议服务。由会议系统制造商和会议服务提供商决定可以构建哪些服务以及向最终用户提供哪些服务。"
    },
    {
      "indent": 3,
      "text": "The scenarios describe multimedia examples, but they are applicable to audio only as well as to audio and video conferences.",
      "zh-CHS": "这些场景描述了多媒体示例，但它们仅适用于音频以及音频和视频会议。"
    },
    {
      "indent": 3,
      "text": "Multimedia conferences may include any combination of different media types such as audio, video, text, interactive text, or presentation graphics. The conference scenarios are similar, but the media handling may be dependent on the media type.",
      "zh-CHS": "多媒体会议可以包括不同媒体类型的任意组合，例如音频、视频、文本、交互式文本或演示图形。会议场景类似，但媒体处理可能取决于媒体类型。"
    },
    {
      "indent": 0,
      "text": "2. Basic Conferencing Scenarios",
      "section_title": true,
      "zh-CHS": "2. 基本会议场景"
    },
    {
      "indent": 3,
      "text": "These scenarios enable a conference-unaware participant to create, join, and participate in a conference. The participant may use out-of-band signaling to participate in a conference, but this is not mandatory. The Conferencing System has all the functionality it needs in order to supply the service offered to the participants. Typical minimum requirements are that the participant support dual-tone multi-frequency (DTMF) tones/signal or provide voice responses to an IVR system.",
      "zh-CHS": "这些场景使不了解会议的参与者能够创建、加入和参与会议。参与者可以使用带外信令参加会议，但这不是强制性的。会议系统具有向参与者提供服务所需的所有功能。典型的最低要求是参与者支持双音多频（DTMF）音调/信号或向IVR系统提供语音响应。"
    },
    {
      "indent": 0,
      "text": "2.1. Ad Hoc Conferences",
      "section_title": true,
      "zh-CHS": "2.1. 特设会议"
    },
    {
      "indent": 3,
      "text": "A participant has a service provisioned to him that enables him to start an ad hoc conference when he calls the Conferencing System. When the participant wants to start a conference, he calls the conference service. The participant may be identified by different means, including request destination, authenticated identity, or an IVR system using DTMF. The conference is created automatically with the predefined functionality. The participant who has such a service notifies the other participants how to call the conference via external means such as instant message or email.",
      "zh-CHS": "参与者有一个为其提供的服务，使其能够在调用会议系统时启动临时会议。当参与者想要开始会议时，他会呼叫会议服务。参与者可以通过不同的方式识别，包括请求目的地、经过认证的身份或使用DTMF的IVR系统。会议是使用预定义功能自动创建的。拥有此类服务的参与者通知其他参与者如何通过即时消息或电子邮件等外部方式呼叫会议。"
    },
    {
      "indent": 3,
      "text": "The participant may have Conferencing System functionality and thus can create an ad hoc conference using his own user agent. An example of such a conference is an audio conference initiated by a participant who has a conference service that enables him to start a conference when he calls a specific URI. The conference may be created by the first person calling this URI, or it may be created only after the owner is authenticated using an IVR system. In the latter case, the other participants may get an announcement and are placed on hold if they call the conference before the owner.",
      "zh-CHS": "参与者可以具有会议系统功能，因此可以使用自己的用户代理创建临时会议。此类会议的一个示例是由具有会议服务的参与者发起的音频会议，该会议服务使他能够在调用特定URI时启动会议。会议可以由调用此URI的第一个人创建，也可以仅在使用IVR系统对所有者进行身份验证后创建。在后一种情况下，如果其他参与者在所有者之前召开会议，他们可能会收到通知并被搁置。"
    },
    {
      "indent": 0,
      "text": "2.2. Extension of a Point-to-Point Call to a Multipoint Call",
      "section_title": true,
      "zh-CHS": "2.2. 将点对点调用扩展为多点调用"
    },
    {
      "indent": 3,
      "text": "This is a basic case. The initiating participant (PA) is in a point-to-point call with another participant (PB). PA wants to add a third participant (PC) to the call. PA cannot provide the Conferencing System functionality on his user agent nor can the other participant PB. PA and PB do not support call transfer. PA has a conferencing service that uses the methods described in 2.1. PA conveys the conference information to PB in the point-to-point call. Both participants disconnect and call the Conferencing System. The Conferencing System may support dial-out (for example, via DTMF), allowing the initiating participant PA to call the third party PC through the Conferencing System.",
      "zh-CHS": "这是一个基本情况。发起参与者（PA）与另一参与者（PB）进行点对点通话。PA希望在通话中添加第三方参与者（PC）。PA不能在其用户代理上提供会议系统功能，其他参与者PB也不能。PA和PB不支持呼叫转接。PA有一个使用2.1中描述的方法的会议服务。PA在点对点呼叫中向PB传送会议信息。两位参与者都断开并呼叫会议系统。会议系统可支持拨出（例如，通过DTMF），允许发起参与者PA通过会议系统呼叫第三方PC。"
    },
    {
      "indent": 0,
      "text": "2.3. Reserved Conferences",
      "section_title": true,
      "zh-CHS": "2.3. 保留会议"
    },
    {
      "indent": 3,
      "text": "The reservation for this type of conference is typically done by an out-of-band mechanism in advance of the actual conference time. The conference identification, which may be a URI or a phone number with a pin number, is allocated by the reservation system. It is sent to all participants through email, IM, etc. The participants join by using the conference identification. The conference identification must be routable, enabling the allocation of a conference with free resources at the time when the conference actually runs. The Conferencing System can also dial out to the conference participants. The participants may not be informed that they are in a conference,",
      "zh-CHS": "此类会议的预订通常在实际会议时间之前通过带外机制完成。会议标识可以是URI或带有pin码的电话号码，由预订系统分配。它通过电子邮件、IM等发送给所有参与者。参与者使用会议标识加入。会议标识必须是可路由的，以便在会议实际运行时分配具有空闲资源的会议。会议系统还可以拨出电话给会议参与者。参与者可能不会被告知他们正在参加会议，"
    },
    {
      "indent": 3,
      "text": "since their User Agent is not conference aware. The participants may know, via announcement from the Conferencing System, that they are in a conference and who the other participants are.",
      "zh-CHS": "因为他们的用户代理不支持会议。通过会议系统的通知，参与者可能知道他们正在参加会议以及其他参与者是谁。"
    },
    {
      "indent": 0,
      "text": "3. Advanced Conferencing Scenarios",
      "section_title": true,
      "zh-CHS": "3. 高级会议场景"
    },
    {
      "indent": 3,
      "text": "These scenarios assume user agents that support at least call transfer service and a way to communicate information on events from the Conferencing System to the user agent. The Conferencing System may have the ability to discover the capabilities of the participants, for example, whether they support call transfer. This section specifies the dependencies in each scenario. An advanced conference can be initiated only by a user agent that has advanced features, but some user agents in the conference may have less functionality.",
      "zh-CHS": "这些场景假设用户代理至少支持呼叫转移服务，并提供一种将事件信息从会议系统传递给用户代理的方式。会议系统可以具有发现参与者的能力的能力，例如，他们是否支持呼叫转移。本节指定每个场景中的依赖项。高级会议只能由具有高级功能的用户代理启动，但会议中的某些用户代理可能功能较少。"
    },
    {
      "indent": 0,
      "text": "3.1. Extending a Point-to-Point Call to a Multipoint Call",
      "section_title": true,
      "zh-CHS": "3.1. 将点对点调用扩展为多点调用"
    },
    {
      "indent": 3,
      "text": "The initiating participant PA is in a point-to-point call and wants to add a third participant. PA can start a multipoint call on a conferencing bridge known to him. The extension can be without consultation, which means that PA moves the point-to-point call to the Conferencing System and then adds the third party (this can be done in various ways). Alternatively the extension can be done with consultation, which means that PA puts his current party on hold, calls the third party, asks him to join the conference, and then transfers all the participants to the Conferencing System.",
      "zh-CHS": "发起方参与者PA处于点对点呼叫中，希望添加第三方参与者。PA可以在他已知的会议桥上启动多点呼叫。该扩展可以在没有咨询的情况下进行，这意味着PA将点对点呼叫移动到会议系统，然后添加第三方（这可以通过各种方式实现）。或者，可以通过协商进行扩展，这意味着PA将其当前参与方置于暂停状态，致电第三方，要求他加入会议，然后将所有参与者转移到会议系统。"
    },
    {
      "indent": 0,
      "text": "3.2. Lecture Mode Conferences",
      "section_title": true,
      "zh-CHS": "3.2. 讲座式会议"
    },
    {
      "indent": 3,
      "text": "This conference scenario enables a conference with a lecturer who presents a topic and can allow questions. The lecturer needs to know who the participants are and needs to be able to give them the right to speak. The right to speak can be based on floor control or an out-of-band mechanism.",
      "zh-CHS": "此会议场景允许与讲师进行会议，讲师提出主题并允许提问。讲师需要知道参与者是谁，并且需要能够给予他们发言权。发言权可以基于楼层控制或带外机制。"
    },
    {
      "indent": 3,
      "text": "In general, the lecturer is seen/heard by the conference participants and often shares a presentation or application with the other participants.",
      "zh-CHS": "一般来说，讲师会被会议参与者看到/听到，并经常与其他参与者分享演讲或申请。"
    },
    {
      "indent": 3,
      "text": "A participant joining this type of conference can get the identity of the lecturer and often the identities of the audience participants.",
      "zh-CHS": "参加此类会议的参与者可以获得讲师的身份，通常还可以获得听众参与者的身份。"
    },
    {
      "indent": 3,
      "text": "This type of conference may have multiple media streams. For example, if simultaneous language translation is available, a participant has the option of selecting the appropriate language audio stream. Multiple video streams could include the speaker's face and a whiteboard/demonstration stream.",
      "zh-CHS": "这种类型的会议可能有多个媒体流。例如，如果有同声传译，参与者可以选择适当的语言音频流。多个视频流可以包括说话人的脸和白板/演示流。"
    },
    {
      "indent": 0,
      "text": "3.3. Conference with Conference-Aware and Unaware Participants",
      "section_title": true,
      "zh-CHS": "3.3. 有会议意识和无意识参与者的会议"
    },
    {
      "indent": 3,
      "text": "A conference can include a mix of participants that are conference-aware and unaware. Conference-unaware participants may be using a proxy function that proxies the advanced functionality between the different protocols and the Conferencing System. For example, an IVR system or a web page interface can be used to provide additional functionality.",
      "zh-CHS": "一个会议可以包括一组了解会议和不了解会议的参与者。会议参与者可能正在使用代理功能，代理不同协议和会议系统之间的高级功能。例如，可以使用IVR系统或网页界面来提供附加功能。"
    },
    {
      "indent": 0,
      "text": "3.4. A Reserved or Ad Hoc Conference with Conference-Aware Participants",
      "section_title": true,
      "zh-CHS": "3.4. 有会议意识参与者的保留或临时会议"
    },
    {
      "indent": 3,
      "text": "In order to start the conference, the initiating participant calls the Conferencing System using, for example, a unique identifier. The Conferencing System may use some authenticating method to qualify the participant. The other participants may call the Conferencing System and join the conference. The Conferencing System is able to find the capabilities of the participants. In case of a reserved conference, the Conferencing System starts the conference at the scheduled time. The participants may join by calling the conference URI, or the Conferencing System may call them. The conference may have privilege levels associated with a specific conference or participant. The privileges are for the initiating participant and for a regular participant; the initiating participant may delegate privileges to the other participants. The privileges allow functionality as defined in the next section.",
      "zh-CHS": "为了启动会议，发起参与者使用例如唯一标识符呼叫会议系统。会议系统可以使用某种身份验证方法来确定参与者的资格。其他参与者可以呼叫会议系统并加入会议。会议系统能够找到参与者的能力。如果是保留会议，会议系统将在预定时间启动会议。参与者可以通过调用会议URI加入，或者会议系统可以调用他们。会议可能具有与特定会议或参与者关联的特权级别。特权适用于发起参与者和普通参与者；发起人可将特权委托给其他参与者。特权允许下一节中定义的功能。"
    },
    {
      "indent": 0,
      "text": "3.5. Advanced Conference Features",
      "section_title": true,
      "zh-CHS": "3.5. 高级会议功能"
    },
    {
      "indent": 3,
      "text": "The following features can be used in all the advanced conferencing scenarios. In the examples given in this section, when referring to a participant that has a functionality, it means a participant with the right privileges. These scenarios may be available in the advanced conferencing scenarios and are common in many conferencing applications. This is not a requirement list, rather some examples of how specific functions may be used in a conference.",
      "zh-CHS": "以下功能可用于所有高级会议场景。在本节给出的示例中，当提及具有功能的参与者时，指具有适当权限的参与者。这些场景可能在高级会议场景中可用，并且在许多会议应用程序中很常见。这不是一个需求列表，而是一些在会议中如何使用特定功能的示例。"
    },
    {
      "indent": 3,
      "text": "o Add Participants - A participant may add a new participant to the conference. This can be done, for example, by instructing the Conferencing System to call the participant or by the first participant calling the new participant and pointing him to the conference.",
      "zh-CHS": "o 添加参与者-参与者可以向会议添加新的参与者。例如，可以通过指示会议系统呼叫参与者或通过第一个参与者呼叫新参与者并将其指向会议来实现。"
    },
    {
      "indent": 3,
      "text": "o Delete Participant - A participant may delete participants from the conference if he can identify them.",
      "zh-CHS": "o 删除参与者-如果参与者能够识别参与者，则可以将其从会议中删除。"
    },
    {
      "indent": 3,
      "text": "o Changing User Agent/Modes - During the course of a conference, a participant may switch between user agents with different capabilities while still remaining part of the conference. For example, a participant may initially join using a mobile phone and then switch to a desktop phone. Or a participant may join with a phone, discover that the conference has video streams available, and switch to a video phone.",
      "zh-CHS": "o 更改用户代理/模式-在会议过程中，参与者可以在具有不同功能的用户代理之间切换，同时仍然是会议的一部分。例如，参与者可以首先使用移动电话加入，然后切换到桌面电话。或者，参与者可以使用手机加入，发现会议有可用的视频流，然后切换到视频电话。"
    },
    {
      "indent": 3,
      "text": "o Changing Media - During the conference, a participant may be able to select different media streams than the one he had when he joined the conference. An example is a participant that initially joined the conference as an audio participant. The participant is unable to understand the conversation properly, and he learns that there is also an interactive text available. He will ask to receive the text stream also.",
      "zh-CHS": "o 改变媒体-在会议期间，参与者可以选择与他加入会议时不同的媒体流。例如，最初作为音频参与者加入会议的参与者。参与者无法正确理解对话，他了解到还有一个交互式文本可用。他也会要求接收文本流。"
    },
    {
      "indent": 3,
      "text": "o Authenticate participants - A participant can authenticate other participants who want to join the conference. This can be done, for example, in a video conferencing session by creating a sidebar between the two participants, allowing the authenticating participant to talk with the new participant and verify his identity.",
      "zh-CHS": "o 验证参与者-参与者可以验证想要加入会议的其他参与者。例如，在视频会议会话中，可以通过在两个参与者之间创建侧栏来实现这一点，从而允许验证参与者与新参与者对话并验证其身份。"
    },
    {
      "indent": 3,
      "text": "o Authorize participants - A participant can authorize other participants in order to allow them to join the conference. This can be done implicitly by assigning a password to the conference or to each participant and letting the Conferencing System decide if the new participant is allowed to join. The authorization can be done explicitly by directing the entered password to the initiating participant who will authorize each participant. The conferencing system may use an authentication mechanism to authenticate the participants.",
      "zh-CHS": "o 授权参与者-参与者可以授权其他参与者以允许他们加入会议。这可以通过向会议或每个参与者分配密码并让会议系统决定是否允许新参与者加入来隐式完成。授权可以通过将输入的密码定向到将授权每个参与者的发起参与者来明确完成。会议系统可以使用认证机制来认证参与者。"
    },
    {
      "indent": 3,
      "text": "o Controlling the presentation of media - During the conference, the participant may be able to manage whose media is being sent to each participant. For example, the participant may be able to decide that he wants to be the speaker and all the rest to be listeners; he may also specify whose media he wants to receive. The participant may be able to mute a media stream during the conference.",
      "zh-CHS": "o 控制媒体的展示-在会议期间，参与者可以管理向每个参与者发送的媒体。例如，参与者可以决定他想成为演讲者，而其他所有人都想成为听众；他还可以指定他想要接收谁的媒体。参与者可以在会议期间使媒体流静音。"
    },
    {
      "indent": 3,
      "text": "o Giving privileges - During the conference, the participant may want to give a privilege to another participant. The assigning of privileges may be implicit when requested or explicit by asking the participant to grant a privilege.",
      "zh-CHS": "o 给予特权-在会议期间，参与者可能希望给予其他参与者特权。在请求时，特权的分配可以是隐式的，也可以通过请求参与者授予特权而显式的。"
    },
    {
      "indent": 3,
      "text": "o Side conferences or sidebars - The participant may want to create a side conference that include some of the main conference participants. When the side conference is finished, the participants return to the main conference. A sidebar may have the same functionality as the main conference. There can be several sidebar scenarios:",
      "zh-CHS": "o 侧边会议或侧边栏-参与者可能希望创建一个包含一些主要会议参与者的侧边会议。旁听会议结束后，与会者返回主会议。侧边栏可能具有与主会议相同的功能。可以有几个侧边栏场景："
    },
    {
      "indent": 6,
      "text": "1. A basic sidebar requires that two participants have the capability to have two calls at the same time, with a point-to-point call in parallel to the main conference. It is user agent implementation-specific whether both calls' streams are mixed automatically or the participants are allowed to manually switch between them.",
      "zh-CHS": "1. 一个基本的侧栏要求两个参与者能够同时进行两次通话，一次点对点通话与主会议并行。无论是自动混合两个调用的流，还是允许参与者在它们之间手动切换，都是用户代理实现特有的。"
    },
    {
      "indent": 6,
      "text": "2. A conferencing-system-based sidebar uses the Conferencing System to create the sidebar and compose the relevant sidebar stream mixes. These mixes can include the main conference as an incoming stream to the mix. Mechanisms to signal the creation of the sidebar, invite participants, and control the mixes should be available.",
      "zh-CHS": "2. 基于会议系统的侧栏使用会议系统创建侧栏并合成相关的侧栏流。这些混音可以包括主会议作为混音的传入流。应该提供一些机制来通知侧边栏的创建、邀请参与者和控制混合。"
    },
    {
      "indent": 10,
      "text": "For example, participants in an audio sidebar may not be heard by the rest of the conference. However, the main conference audio may be mixed in the sidebar, but at a lower volume, or in a different channel. As another example, a sidebar can have a different media type from the main conference: a video call can have an audio sidebar where the other participants can see the sidebar participants talking but cannot hear them; or an audio or video conference may have a text sidebar.",
      "zh-CHS": "例如，音频侧边栏中的参与者可能不会被会议的其他人听到。但是，主会议音频可以在侧边栏中混合，但音量较低，或者在不同的频道中混合。另一个例子是，侧边栏可以具有与主会议不同的媒体类型：视频通话可以具有音频侧边栏，其中其他参与者可以看到侧边栏参与者在讲话，但听不到他们；或者音频或视频会议可能有一个文本侧栏。"
    },
    {
      "indent": 3,
      "text": "o Conference information - When a participant joins the conference, he is announced to the participants. An announcement may be available when he leaves the conference. The participants may query the conferencing system for the current participants of a specific conference. This conference information may include other information, for example, the media streams available in the conference.",
      "zh-CHS": "o 会议信息-当参与者加入会议时，将向参与者宣布他。他离开会议时可能会有通知。参与者可以向会议系统查询特定会议的当前参与者。该会议信息可以包括其他信息，例如，会议中可用的媒体流。"
    },
    {
      "indent": 3,
      "text": "o Extending of a conference - Reserved conferences and ad hoc conferences may have a time limit. The Conferencing System informs the participants when the limit is approaching and may allow the extension of the conference.",
      "zh-CHS": "o 延长会议时间-保留会议和临时会议可能有时间限制。会议系统在接近极限时通知参与者，并允许延长会议。"
    },
    {
      "indent": 3,
      "text": "o Adding and removing a media type to the conference - A participant may want to start a data presentation during a conference. He may want to distribute this new media to all the participants. The participant asks the Conferencing System to start the new media channel and to allow him to send data in the new channel.",
      "zh-CHS": "o 向会议添加和删除媒体类型-参与者可能希望在会议期间开始数据演示。他可能想将这种新媒体分发给所有参与者。参与者要求会议系统启动新媒体频道，并允许他在新频道中发送数据。"
    },
    {
      "indent": 3,
      "text": "o Audio-only participants - In a multimedia conference, some of the participants who want to join may have no way to send and receive all the media types. Typically, they can send and receive audio. Such participants join the conference as audio-only participants. The general case is that participants may send and receive only part of the media streams available in the multimedia conference.",
      "zh-CHS": "o 仅音频参与者-在多媒体会议中，一些想要加入的参与者可能无法发送和接收所有媒体类型。通常，他们可以发送和接收音频。这些与会者以仅音频与会者的身份参加会议。一般情况下，参与者只能发送和接收多媒体会议中可用的部分媒体流。"
    },
    {
      "indent": 3,
      "text": "o Passive participants - In a conference, some participants may be listeners to all or part of the media streams, but may be invisible to all other participants.",
      "zh-CHS": "o 被动参与者-在会议中，一些参与者可能是全部或部分媒体流的听众，但其他所有参与者可能看不见。"
    },
    {
      "indent": 3,
      "text": "o Recorders - A recorder can be added to the conference. A recorder can record all streams or a subset of the streams. Recorders may be turned on and off during the conference. Recorders may be used for a \"role call\" scenario in order to record a participant's name. This name can be announced at a later stage automatically or based on a participant request. A recorder is a case of a passive participant.",
      "zh-CHS": "o 记录器-可以将记录器添加到会议中。记录器可以记录所有流或流的子集。会议期间可以打开和关闭记录器。记录器可用于“角色调用”场景，以记录参与者的姓名。此名称可以在稍后阶段自动宣布，也可以根据参与者的请求宣布。录音机是被动参与者的一种情况。"
    },
    {
      "indent": 3,
      "text": "o Whisper/Private Message - A participant can send a one-way message (text, audio, or even some other media) to another participant that is immediately rendered. This differs from a sidebar in that it is immediate and creates no long-lived session.",
      "zh-CHS": "o 耳语/私人消息-参与者可以向另一个参与者发送单向消息（文本、音频，甚至其他媒体），并立即呈现。这与侧边栏的不同之处在于它是即时的，不会创建长期会话。"
    },
    {
      "indent": 3,
      "text": "o Human operator - A participant may ask for assistance from a human operator during the conference.",
      "zh-CHS": "o 人工操作员-与会者可在会议期间向人工操作员寻求帮助。"
    },
    {
      "indent": 0,
      "text": "4. Scenarios for Media Policy Control",
      "section_title": true,
      "zh-CHS": "4. 媒体策略控制的场景"
    },
    {
      "indent": 3,
      "text": "During a conference, media streams may be controlled by authorized participants using either a media control protocol or a third-party application. This section describes some typical media control scenarios. The conference can be of any size. Some of the media control scenarios are typical of specific conference sizes. As a general rule, larger conferences scenarios tend to be more centrally managed or structured.",
      "zh-CHS": "在会议期间，媒体流可由授权参与者使用媒体控制协议或第三方应用程序进行控制。本节介绍一些典型的介质控制方案。会议可以有任何规模。一些媒体控制场景是特定会议规模的典型场景。一般来说，大型会议场景往往更集中管理或结构化。"
    },
    {
      "indent": 3,
      "text": "The mixing of media in a conference may start when the conference starts or when the initiating participant joins. In the later case, early participants may be put on hold and get \"music on hold\".",
      "zh-CHS": "会议中媒体的混合可以在会议开始或发起参与者加入时开始。在后一种情况下，早期参与者可能会被搁置，并获得“音乐搁置”。"
    },
    {
      "indent": 3,
      "text": "The scenarios apply to audio conferences as well as to multimedia conferences. In the sections below, there is some specific information about the mixed video layout and interactive text.",
      "zh-CHS": "这些场景适用于音频会议以及多媒体会议。在下面的部分中，有一些关于混合视频布局和交互式文本的具体信息。"
    },
    {
      "indent": 0,
      "text": "4.1. Video Mixing Scenarios",
      "section_title": true,
      "zh-CHS": "4.1. 视频混合场景"
    },
    {
      "indent": 3,
      "text": "For video, the participant selects one of a set of predefined video presentations offered by the server. Each video presentation is identified by a textual description as well as an image specifying how the presentation appears on the screen. In this scenario, by choosing a video presentation, the participant chooses how many video streams (participants) are viewed at once and the layout of these video streams on the screen.",
      "zh-CHS": "对于视频，参与者从服务器提供的一组预定义视频演示文稿中选择一个。每个视频演示文稿都由文本描述以及指定演示文稿在屏幕上显示方式的图像标识。在此场景中，通过选择视频演示，参与者选择一次观看多少视频流（参与者）以及这些视频流在屏幕上的布局。"
    },
    {
      "indent": 3,
      "text": "The contents of each sub-window can be defined by a conference policy and/or controlled by authorized participants. It may also be possible to have multiple mixes per conference, possibly as many as there are participants. (Note that the same flexibility may be afforded to audio mixes as well.)",
      "zh-CHS": "每个子窗口的内容可以由会议策略定义和/或由授权参与者控制。每个会议也可能有多个混音，可能有多少参与者就有多少。（请注意，音频混音也可以提供相同的灵活性。）"
    },
    {
      "indent": 3,
      "text": "The following is a list of typical video presentations. Other layouts are available today in commercial products.",
      "zh-CHS": "以下是典型视频演示的列表。今天，商业产品中还提供了其他布局。"
    },
    {
      "indent": 3,
      "text": "- Single view: This presentation typically shows the video of the loudest speaker.",
      "zh-CHS": "- 单视图：此演示文稿通常显示最大扬声器的视频。"
    },
    {
      "indent": 3,
      "text": "- Dual view: This presentation shows two streams. If the streams are to be multiplexed in one image (typical of centralized servers), the multiplexing can be:",
      "zh-CHS": "- 双视图：此演示文稿显示两个流。如果要在一个映像（典型的集中式服务器）中复用流，则复用可以是："
    },
    {
      "indent": 5,
      "text": "1. Side-by-side windows, with no altered aspect ratio. Thus, blanking of parts of the image might be necessary if the streams are to be combined as one image.",
      "zh-CHS": "1. 并排的窗户，没有改变的纵横比。因此，如果要将流组合为一个图像，则可能需要对图像的部分进行消隐。"
    },
    {
      "indent": 5,
      "text": "2. Side-by-side windows, with altered aspect ratios. Thus, blanking parts of the image is not necessary. The mixer handles the cropping of the images.",
      "zh-CHS": "2. 并排的窗户，具有改变的纵横比。因此，不需要对图像的部分进行消隐。混合器处理图像的裁剪。"
    },
    {
      "indent": 5,
      "text": "3. One window above the other, with no altered aspect ratio.",
      "zh-CHS": "3. 一个窗口在另一个窗口之上，没有改变的纵横比。"
    },
    {
      "indent": 5,
      "text": "4. One window above the other, with altered aspect ratios.",
      "zh-CHS": "4. 一个窗口位于另一个窗口之上，具有改变的纵横比。"
    },
    {
      "indent": 3,
      "text": "- Quadrate view: This presentation shows 4 streams. If the streams are multiplexed into one image (centralized server), they are arranged in a 2x2 style. Note that in this style the aspect ratios are maintained.",
      "zh-CHS": "- 方形视图：此演示文稿显示4条流。如果流被多路复用到一个映像（集中式服务器），则它们以2x2样式排列。请注意，在这种样式中，纵横比保持不变。"
    },
    {
      "indent": 3,
      "text": "- 9 sub-picture view: This presentation shows 9 streams. If the streams are to be multiplexed in one image, they are arranged in a 3x3 style. In the multiplexing case, cropping is performed under the discretion of the mixer.",
      "zh-CHS": "- 9子图片视图：本演示文稿显示9条流。如果要在一个图像中多路复用流，则它们以3x3样式排列。在多路复用情况下，裁剪由混合器决定执行。"
    },
    {
      "indent": 3,
      "text": "- 16 sub-picture view: This presentation shows 16 streams. If the streams are to be multiplexed into one image, they are arranged in a 4x4 style. In this style, the aspect ratios are maintained, and no cropping or blanking is needed.",
      "zh-CHS": "- 16子图片视图：此演示文稿显示16个流。如果要将流多路复用到一个图像中，则以4x4样式排列。在这种样式中，纵横比保持不变，不需要裁剪或消隐。"
    },
    {
      "indent": 3,
      "text": "- 5+1 sub-picture view: This presentation shows 6 streams. If the streams are to be multiplexed into one image, then the pictures are laid so that one sub-window occupies 4/9 of the screen while each of the other five occupies 1/9 of the screen.",
      "zh-CHS": "- 5+1子图片视图：此演示文稿显示6个流。如果要将流多路复用为一个图像，则图片的布局应确保一个子窗口占据屏幕的4/9，而其他五个子窗口中的每一个子窗口占据屏幕的1/9。"
    },
    {
      "indent": 0,
      "text": "4.2. Typical Video Conferencing Scenario",
      "section_title": true,
      "zh-CHS": "4.2. 典型的视频会议场景"
    },
    {
      "indent": 3,
      "text": "This scenario is known as voice-activated video switch. Every participant hears the N loudest participants but does not hear himself. All the participants see the loudest speaker; the loudest speaker may see the previous loudest speaker. This mode is typical for a small conference.",
      "zh-CHS": "这种情况称为语音激活视频开关。每个参与者都能听到N个声音最大的参与者的声音，但听不到自己的声音。所有参与者都看到声音最大的演讲者；最大的扬声器可能会看到前一个最大的扬声器。这种模式是小型会议的典型模式。"
    },
    {
      "indent": 3,
      "text": "A participant with proper authorization can exclude one or more participants from the audio or video mix. An indication that they are not being seen/heard might be displayed to the affected participants.",
      "zh-CHS": "具有适当授权的参与者可以将一个或多个参与者排除在音频或视频混合之外。可能会向受影响的参与者显示未被看到/听到的迹象。"
    },
    {
      "indent": 3,
      "text": "A participant with proper authorization can manipulate the gain level associated with one or more audio streams in the mix.",
      "zh-CHS": "具有适当授权的参与者可以操纵与混音中的一个或多个音频流相关联的增益水平。"
    },
    {
      "indent": 0,
      "text": "4.3. Conference Sidebar Scenario",
      "section_title": true,
      "zh-CHS": "4.3. 会议侧边栏场景"
    },
    {
      "indent": 3,
      "text": "An authorized participant creates a sidebar. The participant selects whether the sidebar should include the media from the main conference or not and the audio gain level associated with the main conference audio.",
      "zh-CHS": "授权参与者创建一个侧栏。参与者选择侧边栏是否应包括来自主会议的媒体以及与主会议音频相关联的音频增益级别。"
    },
    {
      "indent": 3,
      "text": "A participant invites participants to the sidebar, and upon acceptance they start receiving the sidebar media as specified by the sidebar creator. If the new participant is not a participant of the conference, but is just a participant of the sidebar, the participant only receives the sidebar media without the media of the main conference.",
      "zh-CHS": "参与者邀请参与者进入侧边栏，接受后，他们开始接收侧边栏创建者指定的侧边栏媒体。如果新参与者不是会议的参与者，而只是侧边栏的参与者，则参与者仅接收侧边栏媒体，而不接收主会议的媒体。"
    },
    {
      "indent": 3,
      "text": "A participant with the right authorization can move another participant into the sidebar with no indication, in which case the participant suddenly starts receiving the sidebar media.",
      "zh-CHS": "具有正确授权的参与者可以在没有指示的情况下将另一个参与者移动到侧边栏中，在这种情况下，参与者突然开始接收侧边栏媒体。"
    },
    {
      "indent": 3,
      "text": "Sidebar participants with the right authorization can select to hear or not to hear the main conference audio mixed with the sidebar audio.",
      "zh-CHS": "具有正确授权的侧边栏参与者可以选择收听或不收听与侧边栏音频混合的主会议音频。"
    },
    {
      "indent": 3,
      "text": "A participant can be a participant to more than one sidebar but can only actively participate in one.",
      "zh-CHS": "参与者可以是多个侧边栏的参与者，但只能积极参与一个侧边栏。"
    },
    {
      "indent": 3,
      "text": "A participant can jump back and forth between the main conference and one or more sidebars.",
      "zh-CHS": "参与者可以在主会议和一个或多个侧边栏之间来回跳跃。"
    },
    {
      "indent": 0,
      "text": "4.4. Coaching Scenario",
      "section_title": true,
      "zh-CHS": "4.4. 指导情景"
    },
    {
      "indent": 3,
      "text": "This is a call center or a remote training session where there is a supervisor who can monitor the conference. The supervised participants may be the call center operators or the teachers. A participant in the conference may be a supervised participant or a \"customer\".",
      "zh-CHS": "这是一个呼叫中心或远程培训课程，其中有一名主管可以监控会议。受监督的参与者可以是呼叫中心操作员或教师。会议的参与者可以是受监督的参与者或“客户”。"
    },
    {
      "indent": 3,
      "text": "The supervisor is a hidden participant and is not part of the participant roster.",
      "zh-CHS": "主管是隐藏参与者，不属于参与者名册的一部分。"
    },
    {
      "indent": 3,
      "text": "The supervised participants might get an announcement/tone indicating that the supervisor has joined. The other participants do not hear the announcement.",
      "zh-CHS": "受监督的参与者可能会收到通知/提示音，表明监督人已加入。其他参与者没有听到公告。"
    },
    {
      "indent": 3,
      "text": "The supervisor listens to or sees the session but can only be heard or seen by the supervised participant.",
      "zh-CHS": "监管者收听或观看会议，但只能由受监管者收听或观看。"
    },
    {
      "indent": 3,
      "text": "The supervisor can become a normal participant, in which case the participants see the supervisor as part of the roster and start hearing and seeing him.",
      "zh-CHS": "主管可以成为正常的参与者，在这种情况下，参与者将主管视为名册的一部分，并开始听和看他。"
    },
    {
      "indent": 0,
      "text": "4.5. Presentation and Q & A Session",
      "section_title": true,
      "zh-CHS": "4.5. 演讲及问答环节"
    },
    {
      "indent": 3,
      "text": "An example is an earning call scenario in which a group of presenters delivers material to a group of people. After the presentation is finished, a Q & A session is opened.",
      "zh-CHS": "例如，一组演示者向一组人发送材料的赚钱通话场景。演讲结束后，将打开问答环节。"
    },
    {
      "indent": 3,
      "text": "The conference is created as a panel, and the panel participants are identified. Only their streams are mixed.",
      "zh-CHS": "会议创建为一个小组，并确定小组参与者。只有他们的溪流是混合的。"
    },
    {
      "indent": 3,
      "text": "After the end of the presentation, the session chair changes the conference type to normal, and now streams from all participants may be mixed. Alternatively, a floor control protocol can be used. The chair can grant the right to speak by adding the participant, whose turn it is to ask a question, to the conference mix.",
      "zh-CHS": "演示结束后，会议主持人将会议类型更改为正常，现在所有参与者的信息流可能会混合。或者，可以使用楼层控制协议。主席可以通过将轮到其提问的参与者加入会议组合来授予发言权。"
    },
    {
      "indent": 0,
      "text": "4.6. Presence-Enabled Ad Hoc Conference",
      "section_title": true,
      "zh-CHS": "4.6. 支持出席的特设会议"
    },
    {
      "indent": 3,
      "text": "A presence-enabled ad hoc conference, sometimes described as \"walkie talkie\" service, is a scenario in which a participant sends media to the other participants of the conference after receiving a confirmation of the other participants' availability. For example, a participant presses a talk button, which checks the presence of the participants to see if they are available for communication. If they are, a confirmation tone is played, and the participant can then talk; as a result, the media is sent to the other participants in the conference. These types of conferences tend to be long lived, hence the need for presence to ensure that the other participants are still available. The ad hoc nature of the conference means that the participant list can be changed at any time. Floor control can be used to allow other participants to speak, as the conference is usually half-duplex in nature.",
      "zh-CHS": "支持出席的特别会议，有时被称为“对讲机”服务，是一种参与者在收到其他参与者可用性的确认后向会议的其他参与者发送媒体的场景。例如，一个参与者按下一个对话按钮，检查参与者是否在场，看他们是否可以进行交流。如果是，则播放确认音，然后参与者可以讲话；因此，媒体被发送给会议的其他参与者。这些类型的会议往往是长期的，因此需要出席会议，以确保其他与会者仍然在场。会议的临时性质意味着与会者名单可以随时更改。楼层控制可用于允许其他与会者发言，因为会议通常是半双工性质的。"
    },
    {
      "indent": 0,
      "text": "4.7. Group Chat Text Conferencing",
      "section_title": true,
      "zh-CHS": "4.7. 群聊文本会议"
    },
    {
      "indent": 3,
      "text": "Group chat is a common scenario for text messaging in which a participant joins (or enters) a chat room in which text messages from participants are rendered in a single window and attributed to the participant that sent the message. Changes in conference membership are often announced in the text window itself (e.g., \"Alice has just entered the room. Bob has just departed.\"). Note that a real-time transcription/closed captioning service can provide a similar window in which audio media is converted into interactive text. \"Nicknames\" or aliases are often chosen by participants or assigned by the Conferencing System and used as handles within the room.",
      "zh-CHS": "群聊是一种常见的短信场景，参与者加入（或进入）聊天室，在聊天室中，来自参与者的短信在一个窗口中呈现，并归属于发送消息的参与者。会议成员的变更通常在文本窗口中宣布（例如，“Alice刚进入会议室，Bob刚离开”）。请注意，实时转录/闭路字幕服务可以提供一个类似的窗口，在该窗口中音频媒体被转换为交互式文本。“昵称”或别名通常由参与者选择或由会议系统指定，并用作房间内的把手。"
    },
    {
      "indent": 0,
      "text": "4.8. Interactive Text",
      "section_title": true,
      "zh-CHS": "4.8. 交互式文本"
    },
    {
      "indent": 3,
      "text": "Interactive text uses RTP to carry text one character at a time, providing real-time interactivity, as described in RFC 4103 [2]. The interactive text session may be the main conference itself, or it may be used in conjunction with other media types. Interactive text may be used to represent the audio in the conference using some translation services. There can be more than one such stream where each text stream is in a different language. These text streams may be used as subtitles to the audio stream. The translation from to text to speech and back is done by transcoders. These transcoders have similar functionality to transcoders between different audio or video algorithms.",
      "zh-CHS": "交互式文本使用RTP一次携带一个字符的文本，提供实时交互，如RFC 4103[2]所述。交互式文本会话可以是主要会议本身，也可以与其他媒体类型结合使用。交互式文本可以使用一些翻译服务来表示会议中的音频。可以有多个这样的流，其中每个文本流使用不同的语言。这些文本流可用作音频流的字幕。翻译是由文字和代码转换器来完成的。这些转码器具有与不同音频或视频算法之间的转码器相似的功能。"
    },
    {
      "indent": 3,
      "text": "The conference participants should be able to select to receive text streams with the conference audio or those without it.",
      "zh-CHS": "会议参与者应能够选择接收带有会议音频的文本流或不带会议音频的文本流。"
    },
    {
      "indent": 0,
      "text": "4.9. Moderated Group Chat",
      "section_title": true,
      "zh-CHS": "4.9. 主持群聊"
    },
    {
      "indent": 3,
      "text": "A moderated group chat scenario for text messaging is similar to group chat, but all text messages sent to the group are filtered/ approved by a moderator. Note that the moderator can be a human or an application. The moderator also often has the ability to remove participants and provide feedback on their submissions (e.g., provide warnings before removal).",
      "zh-CHS": "短信的“有节制的群聊”场景类似于“群聊”，但发送到该群的所有短信都由主持人过滤/批准。请注意，主持人可以是人，也可以是应用程序。主持人通常还能够删除参与者，并就其提交的内容提供反馈（例如，在删除之前提供警告）。"
    },
    {
      "indent": 0,
      "text": "4.10. Text Sidebars",
      "section_title": true,
      "zh-CHS": "4.10. 文本侧栏"
    },
    {
      "indent": 3,
      "text": "Interactive text or instant messaging sidebars are perhaps the most common sidebars in conferences today. Often the text sessions are separate from the conference. However, there are some advantages to having text sessions be a sidebar and as a result a part of the main conference. For example, a conference that is providing anonymity/ aliases to participants can also provide anonymous/alias sidebars. A text sidebar can also benefit from other security/logging/recording services provided by the Conferencing System.",
      "zh-CHS": "交互式文本或即时消息边栏可能是当今会议中最常见的边栏。文本会议通常与会议分开。然而，将文本会议作为一个侧栏并作为主要会议的一部分有一些好处。例如，向参与者提供匿名/别名的会议也可以提供匿名/别名侧栏。文本侧栏还可以从会议系统提供的其他安全/日志记录/录制服务中获益。"
    },
    {
      "indent": 3,
      "text": "Another use of a text sidebar is a text-only conversation/discussion between two or more conference participants who are following the main conference at the same time.",
      "zh-CHS": "文本侧边栏的另一个用途是同时关注主要会议的两个或多个会议参与者之间的纯文本对话/讨论。"
    },
    {
      "indent": 0,
      "text": "4.11. Conference Announcements",
      "section_title": true,
      "zh-CHS": "4.11. 会议公告"
    },
    {
      "indent": 3,
      "text": "The conference moderator may be able to play announcements to all the conference participants. An announcement may be prerecorded or composed by the moderator before it is sent. The announcements may be text, audio, or audio-visual. An example is a conference with several audio break-out sessions going on. At some point, the moderator wants to record an audio message like \"In 5 minutes, everyone please come back to the main meeting\" and then play that message to all the breakout sessions.",
      "zh-CHS": "会议主持人可以向所有会议参与者播放公告。公告可以在发送前由主持人预先录制或撰写。公告可以是文本、音频或视听形式。一个例子是一个会议，有几个音频中断会话正在进行。在某个时刻，主持人想要录制一条音频消息，如“5分钟后，所有人请回到主会议”，然后将该消息播放给所有分组会议。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Conferences generally have authorization rules about who may or may not join a conference, what type of media may or may not be used, etc. This information, sometimes called the conference policy or common conference information, is used by the Conferencing System to admit or deny participation in a conference. For the conference policy to be implemented, the Conferencing System needs to be able to authenticate potential participants. The methods used depend on the signaling protocols used by the conference. This can include a challenge/response mechanism, certificates, shared secret, asserted identity, etc.",
      "zh-CHS": "会议通常有关于谁可以或不可以参加会议、可以或不可以使用什么类型的媒体等的授权规则。这些信息有时称为会议策略或通用会议信息，会议系统使用这些信息来允许或拒绝参加会议。为了实现会议策略，会议系统需要能够对潜在参与者进行身份验证。使用的方法取决于会议使用的信令协议。这可以包括质询/响应机制、证书、共享机密、断言的身份等。"
    },
    {
      "indent": 3,
      "text": "Conferences often require that their content be confidential. In addition, secure authorization of participants is incomplete if access to the media can be gained by unauthorized participants. Functions for securing the media and for key management and distribution to authorized participants need to be provided by the Conferencing System. In some cases, the functions used for participant authorization can be leveraged for this purpose.",
      "zh-CHS": "会议通常要求其内容保密。此外，如果未经授权的参与者可以访问媒体，则参与者的安全授权是不完整的。会议系统需要提供保护媒体、密钥管理和向授权参与者分发的功能。在某些情况下，用于参与者授权的功能可用于此目的。"
    },
    {
      "indent": 3,
      "text": "Privacy is an important aspect of conferencing. Users may wish to join a conference without anyone knowing that they have joined, in order to silently listen in. In other applications, a participant may wish just to hide their identity from other participants, but otherwise let them know of their presence. These functions need to be provided by the Conferencing System.",
      "zh-CHS": "隐私是会议的一个重要方面。用户可能希望在没有任何人知道他们已加入的情况下加入会议，以便静默地收听。在其他应用程序中，参与者可能只希望对其他参与者隐藏自己的身份，但要让他们知道自己的存在。这些功能需要由会议系统提供。"
    },
    {
      "indent": 3,
      "text": "These conference-specific security requirements are discussed further in the XCON framework document.",
      "zh-CHS": "XCON框架文件将进一步讨论这些特定于会议的安全需求。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "Thanks to Brian Rosen for contributing conferencing scenarios.",
      "zh-CHS": "感谢Brian Rosen对会议场景的贡献。"
    },
    {
      "indent": 3,
      "text": "Thanks to Alan Johnston for going over the document and adding some more scenarios; to Keith Lantz, Mary Barnes, and Dave Morgan for carefully reading the document.",
      "zh-CHS": "感谢Alan Johnston审阅了文档并添加了更多场景；感谢基思·兰茨、玛丽·巴恩斯和戴夫·摩根仔细阅读了这份文件。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "zh-CHS": "7. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[1] Rosenberg, J., \"A Framework for Conferencing with the Session Initiation Protocol (SIP)\", RFC 4353, February 2006.",
      "zh-CHS": "[1] Rosenberg，J.，“会话启动协议（SIP）会议框架”，RFC 4353，2006年2月。"
    },
    {
      "indent": 3,
      "text": "[2] Hellstrom, G. and P. Jones, \"RTP Payload for Text Conversation\", RFC 4103, June 2005.",
      "zh-CHS": "[2] Hellstrom，G.和P.Jones，“文本对话的RTP有效载荷”，RFC 4103，2005年6月。"
    },
    {
      "indent": 3,
      "text": "[3] Barnes, M., \"A Framework and Data Model for Centralized Conferencing\", Work in Progress, June 2006.",
      "zh-CHS": "[3] Barnes，M.，“集中式会议的框架和数据模型”，正在进行的工作，2006年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Roni Even Polycom 94 Derech Em Hamoshavot Petach Tikva 49130 Israel",
      "zh-CHS": "Roni Even Polycom 94 Derech Em Hamoshavot Petach Tikva 49130以色列"
    },
    {
      "indent": 3,
      "text": "EMail: roni.even@polycom.co.il",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Nermeen Ismail Cisco Systems, Inc. 170 West Tasman Drive San Jose 95134 CA USA",
      "zh-CHS": "美国加利福尼亚州圣何塞西塔斯曼大道170号Nermeen Ismail Cisco Systems，Inc.95134"
    },
    {
      "indent": 3,
      "text": "EMail: nismail@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}