{
  "title": {
    "text": "RFC 4143: Facsimile Using Internet Mail (IFAX) Service of ENUM",
    "zh-CHS": "RFC 4143"
  },
  "number": 4143,
  "created_at": "2021-11-12 23:33:01.437739+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          K. Toyoda\nRequest for Comments: 4143                                           PCC\nCategory: Standards Track                                     D. Crocker\n                                                             Brandenburg\n                                                           November 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Facsimile Using Internet Mail (IFAX) Service of ENUM",
      "zh-CHS": "使用ENUM的互联网邮件（IFAX）服务进行传真"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the functional specification and definition of the ENUM Naming Authority Pointer (NAPTR) record for IFax service. IFax is \"facsimile using Internet mail\". For this use, the Domain Name System (DNS) returns the email address of the referenced IFax system. This mechanism allows email-based fax communication to use telephone numbers instead of requiring the sender to already know the recipient email address.",
      "zh-CHS": "本文档描述了IFax服务的枚举命名机构指针（NAPTR）记录的功能规范和定义。IFax是“使用互联网邮件的传真”。对于此用途，域名系统（DNS）返回引用的IFax系统的电子邮件地址。这种机制允许基于电子邮件的传真通信使用电话号码，而不是要求发件人已经知道收件人的电子邮件地址。"
    },
    {
      "indent": 0,
      "text": "1. Functional Specification",
      "section_title": true,
      "zh-CHS": "1. 功能规范"
    },
    {
      "indent": 3,
      "text": "An IFax client makes a [ENUMbis] DNS query, using the target system's telephone number. The returned NAPTR record specifies an email address to be used for reaching the target system. The email address is then used in accordance with Simple Mode of Facsimile using Internet Mail [RFC3965], Extended Facsimile using Internet Mail [RFC2532], or Full Mode Fax Profile for Internet Mail [FFPIM] is applied.",
      "zh-CHS": "IFax客户端使用目标系统的电话号码进行[ENUMbis]DNS查询。返回的NAPTR记录指定用于到达目标系统的电子邮件地址。然后根据使用互联网邮件[RFC3965]的简单传真模式、使用互联网邮件[RFC2532]的扩展传真模式或应用互联网邮件[FFPIM]的全模式传真配置文件使用电子邮件地址。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"SHOULD\", \"SHOULD NOT\", and \"MAY\" in this document are to be interpreted as defined in \"Key words for use in RFCs to Indicate Requirement Levels\" [KEYWORDS].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“应该”、“不应该”和“可能”应按照“RFC中用于指示需求水平的关键词”中的定义进行解释[关键词]。"
    },
    {
      "indent": 0,
      "text": "2. IFax Service Registration",
      "section_title": true,
      "zh-CHS": "2. IFax服务注册"
    },
    {
      "indent": 3,
      "text": "Service Name : \"E2U+ifax\"",
      "zh-CHS": "服务名称：“E2U+ifax”"
    },
    {
      "indent": 3,
      "text": "Type: \"ifax\"",
      "zh-CHS": "类型：“ifax”"
    },
    {
      "indent": 3,
      "text": "Subtype: \"mailto\"",
      "zh-CHS": "子类型：“mailto”"
    },
    {
      "indent": 3,
      "text": "URI Scheme: \"mailto\" The URI Scheme is \"mailto\" because facsimile is a profile of standard Internet mail and uses standard Internet mail addressing.",
      "zh-CHS": "URI方案：“mailto”URI方案是“mailto”，因为传真是标准Internet邮件的配置文件，并使用标准Internet邮件地址。"
    },
    {
      "indent": 3,
      "text": "Functional Specification: See section 1",
      "zh-CHS": "功能规范：见第1节"
    },
    {
      "indent": 3,
      "text": "Security Considerations: See section 3",
      "zh-CHS": "安全注意事项：见第3节"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Author: Kiyoshi Toyoda (toyoda.kiyoshi@jp.panasonic.com) Dave Crocker (dcrocker@bbiw.net)",
      "zh-CHS": "作者：丰田清吉（丰田章男）。kiyoshi@jp.panasonic.com)戴夫·克罗克(dcrocker@bbiw.net)"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "zh-CHS": "3. 安全考虑"
    },
    {
      "indent": 3,
      "text": "DNS, as used by ENUM, is a globally distributed database. Thus, any information stored in it is visible to anyone anonymously. Although this is not qualitatively different from publication in a telephone directory, it does expose the data subject to automatic data collection without any indication that this has been done or by whom.",
      "zh-CHS": "ENUM使用的DNS是一个全局分布的数据库。因此，存储在其中的任何信息对任何人都是匿名可见的。尽管这与在电话簿中发布并无本质区别，但它确实会将数据暴露在自动数据收集之下，而没有任何迹象表明这是由谁完成的。"
    },
    {
      "indent": 3,
      "text": "Data harvesting by third parties is often used to generate lists of targets for unrequested information; in short, the lists are used to address \"spam\". The publication of a telephone number in ENUM, especially when it is an associated Internet fax service, may be used to send \"junk faxes\", for example.",
      "zh-CHS": "第三方收集的数据通常用于生成未请求信息的目标列表；简而言之，这些列表用于处理“垃圾邮件”。例如，在ENUM中公布电话号码，特别是当它是相关的Internet传真服务时，可用于发送“垃圾传真”。"
    },
    {
      "indent": 3,
      "text": "In the case of electronic mail, users subscribed to mailing lists can have \"sacrificial\" email accounts. These special-purpose addresses help the user filter out unrequested email. This is not so easy with published telephone numbers. The PSTN E.164 number assignment process is much more involved and less flexible; usually a single E.164 number (or a fixed range of numbers) is associated with each PSTN access. Thus, it is not possible to use a \"sacrificial\" phone number.",
      "zh-CHS": "就电子邮件而言，订阅邮件列表的用户可以拥有“牺牲性”电子邮件帐户。这些专用地址有助于用户过滤未请求的电子邮件。对于公开的电话号码来说，这并不容易。PSTN E.164号码分配过程更复杂，灵活性更低；通常，单个E.164号码（或固定范围的号码）与每个PSTN接入相关联。因此，不可能使用“牺牲性”电话号码。"
    },
    {
      "indent": 3,
      "text": "Due to the implications of publishing data in a globally accessible database, as a principle, the data subject MUST give explicit informed consent to data being published in ENUM.",
      "zh-CHS": "由于在全球可访问数据库中发布数据的影响，作为一项原则，数据主体必须对在ENUM中发布的数据给予明确的知情同意。"
    },
    {
      "indent": 3,
      "text": "Internet Fax is based on existing use of Internet mail. Developers and users should also consider the Security Consideration sections in [RFC3965] and [RFC2532].",
      "zh-CHS": "Internet传真基于现有的Internet邮件使用。开发人员和用户也应该考虑[RCFC96]和[RCF253]中的安全考虑部分。"
    },
    {
      "indent": 3,
      "text": "In addition to the specific security considerations given above, the Security Considerations section of [ENUMbis] applies to this document.",
      "zh-CHS": "除上述特定安全注意事项外，[ENUMbis]的安全注意事项部分也适用于本文件。"
    },
    {
      "indent": 0,
      "text": "4. Example",
      "section_title": true,
      "zh-CHS": "4. 实例"
    },
    {
      "indent": 3,
      "text": "The following is an example of the use of IFax service in a NAPTR record.",
      "zh-CHS": "以下是在NAPTR记录中使用IFax服务的示例。"
    },
    {
      "indent": 6,
      "text": "$ORIGIN 4.3.2.1.6.7.9.8.6.4.e164.arpa\n  IN NAPTR 10 10 \"u\" \"E2U+ifax:mailto\"\n                         \"!^.*$!mailto:toyo@example.com!\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This specification creates a DNS NAPTR registration, according to the terms specified in [ENUMbis].",
      "zh-CHS": "本规范根据[ENUMbis]中指定的条款创建DNS NAPTR注册。"
    },
    {
      "indent": 3,
      "text": "The registration details are contained in section 2, Fax Service Registration.",
      "zh-CHS": "注册详情见第2节“传真服务注册”。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[关键词]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[ENUMbis] Faltstrom, P. and M. Mealling, \"The E.164 to Uniform Resource Identifiers (URI) Dynamic Delegation Discovery System (DDDS) Application (ENUM)\", RFC 3761, April 2004.",
      "zh-CHS": "[ENUMbis]Faltstrom，P.和M.Mealling，“E.164到统一资源标识符（URI）动态委托发现系统（DDDS）应用程序（ENUM）”，RFC 3761，2004年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3965] Toyoda, K., Ohno, H., Murai, J., and D. Wing, \"A Simple Mode of Facsimile Using Internet Mail\", RFC 3965, December 2004.",
      "zh-CHS": "[RFC3965]丰田章男，K.，大野，H.，Murai，J.，和D.Wing，“使用互联网邮件的简单传真模式”，RFC 39652004年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2532] Masinter, L. and D. Wing, \" Extended Facsimile Using Internet Mail\", RFC 2532, March 1999.",
      "zh-CHS": "[RFC2532]Masinter，L.和D.Wing，“使用互联网邮件的扩展传真”，RFC 25321999年3月。"
    },
    {
      "indent": 3,
      "text": "[FFPIM] Crocker, D. and G. Klyne, \"Full-mode Fax Profile for Internet Mail (FFPIM)\", RFC 4142, November 2005.",
      "zh-CHS": "[FFPIM]Crocker，D.和G.Klyne，“互联网邮件的全模式传真配置文件（FFPIM）”，RFC 41422005年11月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Kiyoshi Toyoda Research and Development Laboratory Panasonic Communications Co., Ltd. 4-1-62 Minoshima Hakata-ku, Fukuoka 812-8531 Japan",
      "zh-CHS": "日本福冈市博田町美能岛4-1-62号松下通信有限公司松下研究开发实验室"
    },
    {
      "indent": 3,
      "text": "Phone: +81-50-3380-5181\nEMail: toyoda.kiyoshi@jp.panasonic.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dave Crocker Brandenburg InternetWorking 675 Spruce Drive Sunnyvale, CA 94086 USA",
      "zh-CHS": "戴夫·克罗克·勃兰登堡互联网络美国加利福尼亚州桑尼维尔市云杉大道675号，邮编94086"
    },
    {
      "indent": 3,
      "text": "Phone: +1.408.246.8253\nEMail: dcrocker@bbiw.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}