{
  "title": {
    "text": "RFC 4394: A Transport Network View of the Link Management Protocol (LMP)",
    "zh-CHS": "RFC 4394"
  },
  "number": 4394,
  "created_at": "2021-11-13 18:57:37.333771+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           D. Fedyk\nRequest for Comments: 4394                                 O. Aboul-Magd\nCategory: Informational                                  Nortel Networks\n                                                             D. Brungard\n                                                                    AT&T\n                                                                 J. Lang\n                                                             Sonos, Inc.\n                                                        D. Papadimitriou\n                                                                 Alcatel\n                                                           February 2006",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "A Transport Network View of the Link Management Protocol (LMP)",
      "zh-CHS": "链路管理协议（LMP）的传输网络视图"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Link Management Protocol (LMP) has been developed as part of the Generalized MPLS (GMPLS) protocol suite to manage Traffic Engineering (TE) resources and links. The GMPLS control plane (routing and signaling) uses TE links for establishing Label Switched Paths (LSPs). This memo describes the relationship of the LMP procedures to 'discovery' as defined in the International Telecommunication Union (ITU-T), and ongoing ITU-T work. This document provides an overview of LMP in the context of the ITU-T Automatically Switched Optical Networks (ASON) and transport network terminology and relates it to the ITU-T discovery work to promote a common understanding for progressing the work of IETF and ITU-T.",
      "zh-CHS": "链路管理协议（LMP）是作为通用MPLS（GMPLS）协议套件的一部分开发的，用于管理流量工程（TE）资源和链路。GMPLS控制平面（路由和信令）使用TE链路建立标签交换路径（LSP）。本备忘录描述了LMP程序与国际电信联盟（ITU-T）定义的“发现”的关系，以及ITU-T正在进行的工作。本文件在ITU-T自动交换光网络（ASON）和传输网络术语的背景下概述了LMP，并将其与ITU-T发现工作联系起来，以促进对IETF和ITU-T工作进展的共同理解。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. ASON Terminology and Abbreviations Related to Discovery .........3\n   2.1. Terminology ................................................3\n   2.2. Abbreviations ..............................................4\n3. Transport Network Architecture ..................................5\n   3.1. G.8080 Discovery Framework .................................7\n4. Discovery Technologies ..........................................9\n   4.1. Generalized Automatic Discovery Techniques G.7714 ..........9\n   4.2. LMP and G.8080 Terminology Mapping .........................9\n        4.2.1. TE Link Definition and Scope .......................12\n   4.3. LMP and G.8080 Discovery Relationship .....................13\n   4.4. Comparing LMP and G.8080 ..................................14\n5. Security Considerations ........................................15\n6. Informative References .........................................15\n7. Acknowledgements ...............................................16",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The GMPLS control plane consists of several building blocks as described in [RFC3945]. The building blocks include signaling, routing, and link management for establishing LSPs. For scalability purposes, multiple physical resources can be combined to form a single TE link for the purposes of path computation and GMPLS control plane signaling.",
      "zh-CHS": "GMPLS控制平面由[RFC3945]中所述的几个构建块组成。构建模块包括用于建立LSP的信令、路由和链路管理。出于可伸缩性目的，可以组合多个物理资源以形成单个TE链路，用于路径计算和GMPLS控制平面信令。"
    },
    {
      "indent": 3,
      "text": "As manual provisioning and management of these links are impractical in large networks, LMP was specified to manage TE links. Two mandatory management capabilities of LMP are control channel management and TE link property correlation. Additional optional capabilities include verifying physical connectivity and fault management. [LMP] defines the messages and procedures for GMPLS TE link management. [LMP-TEST] defines SONET/SDH-specific messages and procedures for link verification.",
      "zh-CHS": "由于手动配置和管理这些链路在大型网络中是不切实际的，因此指定LMP来管理TE链路。LMP的两个强制性管理功能是控制信道管理和TE链路属性关联。其他可选功能包括验证物理连接和故障管理。[LMP]定义了GMPLS TE链路管理的消息和程序。[LMP-TEST]定义用于链路验证的SONET/SDH特定消息和程序。"
    },
    {
      "indent": 3,
      "text": "ITU-T Recommendation G.8080 Amendment 1 [G.8080] defines control plane discovery as two separate processes; one process occurs within the transport plane space and the other process occurs within the control plane space.",
      "zh-CHS": "ITU-T建议G.8080修改件1[G.8080]将控制平面发现定义为两个独立的过程；一个过程发生在传输平面空间内，另一个过程发生在控制平面空间内。"
    },
    {
      "indent": 3,
      "text": "The ITU-T has developed Recommendation G.7714, \"Generalized automatic discovery techniques\" [G.7714], defining the functional processes and information exchange related to transport plane discovery aspects, i.e., layer adjacency discovery and physical media adjacency discovery. Specific methods and protocols are not defined in Recommendation G.7714. ITU-T Recommendation G.7714.1, \"Protocol for automatic discovery in SDH and OTN networks\" [G.7714.1], defines a",
      "zh-CHS": "ITU-T制定了建议G.7714，“通用自动发现技术”[G.7714]，定义了与传输平面发现方面相关的功能过程和信息交换，即层邻接发现和物理媒体邻接发现。建议G.7714中未定义具体方法和协议。ITU-T建议G.7714.1，“SDH和OTN网络中的自动发现协议”[G.7714.1]，定义了"
    },
    {
      "indent": 3,
      "text": "protocol and procedure for transport plane layer adjacency discovery (e.g., discovering the transport plane layer endpoint relationships and verifying their connectivity). The ITU-T is currently working to extend discovery to control plane aspects providing detail on a discovery framework architecture in G.8080 and a new Recommendation on \"Control plane initial establishment, reconfiguration\".",
      "zh-CHS": "传输平面层邻接发现的协议和过程（例如，发现传输平面层端点关系并验证其连接性）。ITU-T目前正致力于将发现扩展到控制平面方面，提供G.8080中发现框架架构的详细信息，以及关于“控制平面初始建立、重新配置”的新建议。"
    },
    {
      "indent": 0,
      "text": "2. ASON Terminology and Abbreviations Related to Discovery",
      "section_title": true,
      "zh-CHS": "2. 与发现相关的ASON术语和缩写"
    },
    {
      "indent": 3,
      "text": "ITU-T Recommendation G.8080 Amendment 1 [G.8080] and ITU-T Recommendation G.7714 [G.7714] provide definitions and mechanisms related to transport plane discovery.",
      "zh-CHS": "ITU-T建议G.8080修改件1[G.8080]和ITU-T建议G.7714[G.7714]提供了与传输平面发现相关的定义和机制。"
    },
    {
      "indent": 3,
      "text": "Note that in the context of this work, \"Transport\" relates to the data plane (sometimes called the transport plane or the user plane) and does not refer to the transport layer (layer 4) of the OSI seven layer model, nor to the concept of transport intended by protocols such as the Transmission Control Protocol (TCP).",
      "zh-CHS": "请注意，在本工作的上下文中，“传输”与数据平面（有时称为传输平面或用户平面）相关，并不涉及OSI七层模型的传输层（第4层），也不涉及传输控制协议（TCP）等协议预期的传输概念。"
    },
    {
      "indent": 3,
      "text": "Special care must be taken with the acronym \"TCP\", which within the context of the rest of this document means \"Termination Connection Point\" and does not indicate the Transmission Control Protocol.",
      "zh-CHS": "必须特别注意首字母缩写“TCP”，在本文件其余部分的上下文中，它表示“终端连接点”，并不表示传输控制协议。"
    },
    {
      "indent": 0,
      "text": "2.1. Terminology",
      "section_title": true,
      "zh-CHS": "2.1. 术语"
    },
    {
      "indent": 3,
      "text": "The reader is assumed to be familiar with the terminology in [LMP] and [LMP-TEST]. The following ITU-T terminology/abbreviations are used in this document:",
      "zh-CHS": "假定读者熟悉[LMP]和[LMP-TEST]中的术语。本文件中使用了以下ITU-T术语/缩写："
    },
    {
      "indent": 3,
      "text": "Connection Point (CP): A \"reference point\" that consists of a pair of co-located \"unidirectional connection points\" and therefore represents the binding of two paired bidirectional \"connections\".",
      "zh-CHS": "连接点（CP）：由一对共同定位的“单向连接点”组成的“参考点”，因此表示两对双向“连接”的绑定。"
    },
    {
      "indent": 3,
      "text": "Connection Termination Point (CTP): A connection termination point represents the state of a CP [M.3100].",
      "zh-CHS": "连接终止点（CTP）：连接终止点表示CP的状态[M.3100]。"
    },
    {
      "indent": 3,
      "text": "Characteristic Information: Signal with a specific format, which is transferred on \"network connections\". The specific formats will be defined in the technology-specific recommendations. For trails, the Characteristic Information is the payload plus the overhead. The information transferred is characteristic of the layer network.",
      "zh-CHS": "特征信息：特定格式的信号，通过“网络连接”传输。具体格式将在技术特定建议中定义。对于航迹，特征信息是有效载荷加上开销。传输的信息是分层网络的特征。"
    },
    {
      "indent": 3,
      "text": "Link: A subset of ports at the edge of a subnetwork or access group that are associated with a corresponding subset of ports at the edge of another subnetwork or access group.",
      "zh-CHS": "链路：子网或接入组边缘的端口子集，与另一个子网或接入组边缘的相应端口子集相关联。"
    },
    {
      "indent": 3,
      "text": "Link Connection (LC): A transport entity that transfers information between ports across a link.",
      "zh-CHS": "链路连接（LC）：通过链路在端口之间传输信息的传输实体。"
    },
    {
      "indent": 3,
      "text": "Network Connection (NC): A concatenation of link and subnetwork connections.",
      "zh-CHS": "网络连接（NC）：链路和子网络连接的连接。"
    },
    {
      "indent": 3,
      "text": "Subnetwork: A set of ports that are available for the purpose of routing 'characteristic information'.",
      "zh-CHS": "子网：用于路由“特征信息”的一组端口。"
    },
    {
      "indent": 3,
      "text": "Subnetwork Connection (SNC): A flexible connection that is set up and released using management or control plane procedures.",
      "zh-CHS": "子网连接（SNC）：使用管理或控制平面程序设置和释放的灵活连接。"
    },
    {
      "indent": 3,
      "text": "Subnetwork Point (SNP): SNP is an abstraction that represents an actual or potential underlying connection point (CP) or termination connection point (TCP) for the purpose of control plane representation.",
      "zh-CHS": "子网点（SNP）：SNP是一种抽象，表示实际或潜在的底层连接点（CP）或终端连接点（TCP），用于控制平面表示。"
    },
    {
      "indent": 3,
      "text": "Subnetwork Point Pool (SNPP): A set of SNPs that are grouped together for the purpose of routing.",
      "zh-CHS": "子网点池（SNPP）：为了路由而分组在一起的一组SNP。"
    },
    {
      "indent": 3,
      "text": "Termination Connection Point (TCP): A reference point that represents the output of a Trail Termination source function or the input to a Trail Termination sink function. A network connection represents a transport entity between TCPs.",
      "zh-CHS": "终端连接点（TCP）：表示跟踪终端源函数的输出或跟踪终端接收器函数的输入的参考点。网络连接表示TCP之间的传输实体。"
    },
    {
      "indent": 3,
      "text": "Trail Termination source/sink function: A \"transport processing function\" that accepts the characteristic information of the layer network at its input, removes the information related to \"trail\" monitoring, and presents the remaining information at its output.",
      "zh-CHS": "跟踪终止源/接收器功能：一种“传输处理功能”，在其输入端接受层网络的特征信息，删除与“跟踪”监控相关的信息，并在其输出端显示剩余信息。"
    },
    {
      "indent": 3,
      "text": "Unidirectional Connection: A \"transport entity\" that transfers information transparently from input to output.",
      "zh-CHS": "单向连接：将信息从输入透明地传输到输出的“传输实体”。"
    },
    {
      "indent": 3,
      "text": "Unidirectional Connection Point: A \"reference point\" that represents the binding of the output of a \"unidirectional connection\" to the input of another \"unidirectional connection\".",
      "zh-CHS": "单向连接点：表示“单向连接”的输出与另一个“单向连接”的输入绑定的“参考点”。"
    },
    {
      "indent": 0,
      "text": "2.2. Abbreviations",
      "section_title": true,
      "zh-CHS": "2.2. 缩写"
    },
    {
      "indent": 3,
      "text": "LMP: Link Management Protocol",
      "zh-CHS": "链路管理协议"
    },
    {
      "indent": 3,
      "text": "OTN: Optical Transport Network",
      "zh-CHS": "光传输网"
    },
    {
      "indent": 3,
      "text": "PDH: Plesiosynchronous Digital Hierarchy",
      "zh-CHS": "准同步数字体系"
    },
    {
      "indent": 3,
      "text": "SDH: Synchronous Digital Hierarchy",
      "zh-CHS": "同步数字体系"
    },
    {
      "indent": 3,
      "text": "SONET: Synchronous Optical Network",
      "zh-CHS": "同步光网络"
    },
    {
      "indent": 0,
      "text": "3. Transport Network Architecture",
      "section_title": true,
      "zh-CHS": "3. 传输网络结构"
    },
    {
      "indent": 3,
      "text": "A generic functional architecture for transport networks is defined in International Telecommunication Union (ITU-T) Recommendation [G.805]. This recommendation describes the functional architecture of transport networks in a technology-independent way. This architecture forms the basis for a set of technology-specific architectural recommendations for transport networks (e.g., SDH, PDH, OTN, etc.).",
      "zh-CHS": "国际电信联盟（ITU-T）建议[G.805]中定义了传输网络的通用功能架构。本建议以独立于技术的方式描述了传输网络的功能架构。该体系结构构成了一套针对传输网络（如SDH、PDH、OTN等）的技术特定体系结构建议的基础。"
    },
    {
      "indent": 3,
      "text": "The architecture defined in G.805 is designed using a layered model with a client-server relationship between layers. The architecture is recursive in nature; a network layer is both a server to the client layer above it and a client to the server layer below it. There are two basic building blocks defined in G.805: \"subnetworks\" and \"links\". A subnetwork is defined as a set of ports that are available for the purpose of routing \"characteristic information\". A link consists of a subset of ports at the edge of one subnetwork (or \"access group\") and is associated with a corresponding subset of ports at the edge of another subnetwork or access group.",
      "zh-CHS": "G.805中定义的体系结构使用分层模型设计，各层之间具有客户机-服务器关系。该体系结构本质上是递归的；网络层既是它上面的客户机层的服务器，也是它下面的服务器层的客户机。G.805中定义了两个基本构件：“子网”和“链路”。子网定义为一组可用于路由“特征信息”的端口。链路由一个子网（或“接入组”）边缘的端口子集组成，并与另一个子网或接入组边缘的相应端口子集相关联。"
    },
    {
      "indent": 3,
      "text": "Two types of connections are defined in G.805: link connection (LC) and subnetwork connection (SNC). A link connection is a fixed and inflexible connection, while a subnetwork connection is flexible and is set up and released using management or control plane procedures. A network connection is defined as a concatenation of subnetwork and link connections. Figure 1 illustrates link and subnetwork connections.",
      "zh-CHS": "G.805中定义了两种连接类型：链路连接（LC）和子网连接（SNC）。链路连接是固定且不灵活的连接，而子网连接是灵活的，并使用管理或控制平面程序进行设置和释放。网络连接定义为子网络和链路连接的串联。图1显示了链路和子网络连接。"
    },
    {
      "indent": 16,
      "text": "  (++++++++)              (++++++++)\n (   SNC    )   LC       (   SNC    )\n(o)--------(o)----------(o)--------(o)\n (          ) CP      CP (          )\n  (++++++++)              (++++++++)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 18,
      "text": "subnetwork subnetwork",
      "zh-CHS": "子网子网"
    },
    {
      "indent": 16,
      "text": "Figure 1: Subnetwork and Link Connections",
      "zh-CHS": "图1：子网和链路连接"
    },
    {
      "indent": 3,
      "text": "G.805 defines a set of reference points for the purpose of identification in both the management and the control planes. These identifiers are NOT required to be the same. A link connection or a subnetwork connection is delimited by connection points (CPs). A network connection is delimited by a termination connection point (TCP). A link connection in the client layer is represented by a pair of adaptation functions and a trail in the server layer network. A trail represents the transfer of monitored adapted characteristics information of the client layer network between access points (APs).",
      "zh-CHS": "G.805定义了一组参考点，用于管理和控制平面中的识别。这些标识符不需要相同。链路连接或子网络连接由连接点（CP）分隔。网络连接由终端连接点（TCP）分隔。客户端层中的链路连接由服务器层网络中的一对适配函数和一条路径表示。trail表示在接入点（ap）之间传输客户端层网络的被监视的自适应特征信息。"
    },
    {
      "indent": 3,
      "text": "A trail is delimited by two access points, one at each end of the trail. Figure 2 shows a network connection and its relationship with link and subnetwork connections. Figure 2 also shows the CP and TCP reference points.",
      "zh-CHS": "轨迹由两个访问点分隔，每个访问点位于轨迹的两端。图2显示了网络连接及其与链路和子网络连接的关系。图2还显示了CP和TCP参考点。"
    },
    {
      "indent": 14,
      "text": "  |<-------Network Connection---------->|\n  |                                     |\n  | (++++++++)              (++++++++)  |\n  |(   SNC    )   LC       (   SNC    ) |\n  (o)--------(o)----------(o)--------(o)|\nTCP(          )| CP    CP |(          )TCP\n    (++++++++) |          | (++++++++)\n               |          |\n               |  Trail   |\n               |<-------->|\n               |          |\n              ---        ---\n              \\ /        \\ /\n               -          -\n            AP 0          0 AP\n               |          |\n              (oo)------(oo)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Figure 2: Network Connection with Link and Subnetwork Connections",
      "zh-CHS": "图2：带有链路和子网连接的网络连接"
    },
    {
      "indent": 3,
      "text": "For management plane purposes, the G.805 reference points are represented by a set of management objects described in ITU-T Recommendation M.3100 [M.3100]. Connection termination points (CTPs) and trail termination points (TTPs) are the management plane objects for CP and TCP, respectively.",
      "zh-CHS": "出于管理平面的目的，G.805参考点由ITU-T建议M.3100[M.3100]中描述的一组管理对象表示。连接终止点（CTP）和跟踪终止点（TTP）分别是CP和TCP的管理平面对象。"
    },
    {
      "indent": 3,
      "text": "In the same way as in M.3100, the transport resources in G.805 are identified for the purposes of the control plane by entities suitable for connection control. G.8080 introduces the reference architecture for the control plane of the Automatically Switched Optical Networks (ASONs). G.8080 introduces a set of reference points relevant to the ASON control plane and their relationship to the corresponding points in the transport plane. A subnetwork point (SNP) is an abstraction that represents an actual or potential underlying CP or an actual or potential TCP. A set of SNPs that are grouped together for the purpose of routing is called SNP pool (SNPP). Similar to LC and SNC, the SNP-SNP relationship may be static and inflexible (this is referred to as an SNP link connection), or it can be dynamic and flexible (this is referred to as an SNP subnetwork connection).",
      "zh-CHS": "以与M.3100中相同的方式，G.805中的传输资源由适合于连接控制的实体为控制平面的目的进行标识。G.8080介绍了自动交换光网络（ASON）控制平面的参考体系结构。G.8080介绍了一组与ASON控制平面相关的参考点及其与传输平面中相应点的关系。子网点（SNP）是表示实际或潜在底层CP或实际或潜在TCP的抽象。为了路由而分组在一起的一组SNP称为SNP池（SNPP）。与LC和SNC类似，SNP-SNP关系可能是静态和不灵活的（这称为SNP链路连接），也可能是动态和灵活的（这称为SNP子网连接）。"
    },
    {
      "indent": 0,
      "text": "3.1. G.8080 Discovery Framework",
      "section_title": true,
      "zh-CHS": "3.1. G.8080发现框架"
    },
    {
      "indent": 3,
      "text": "G.8080 provides a reference control plane architecture based on the descriptive use of functional components representing abstract entities and abstract component interfaces. The description is generic, and no particular physical partitioning of functions is implied. The input/output information flows associated with the functional components serve for defining the functions of the components and are considered to be conceptual, not physical. Components can be combined in different ways, and the description is not intended to limit implementations. Control plane discovery is described in G.8080 by using three components: Discovery Agent (DA), Termination and Adaptation Performer (TAP), and Link Resource Manager (LRM).",
      "zh-CHS": "G.8080基于表示抽象实体和抽象组件接口的功能组件的描述性使用，提供了参考控制平面架构。该描述是通用的，没有暗示函数的特定物理分区。与功能组件相关的输入/输出信息流用于定义组件的功能，并且被认为是概念性的，而不是物理性的。组件可以以不同的方式组合，本说明并不打算限制实现。G.8080使用三个组件描述了控制平面发现：发现代理（DA）、终止和适配执行器（TAP）和链路资源管理器（LRM）。"
    },
    {
      "indent": 3,
      "text": "The objective of the discovery framework in G.8080 is to establish the relationship between CP-CP link connections (transport plane) and SNP-SNP link connections (control plane). The fundamental characteristics of G.8080 discovery framework is the functional separation between the control and the transport plane discovery processes and name spaces. From G.8080: \"This separation allows control plane names to be completely separate from transport plane names, and completely independent of the method used to populate the DAs with those transport names. In order to assign an SNP-SNP link connection to an SNPP link, it is only necessary for the transport name for the link connection to exist\". Thus, it is possible to assign link connections to the control plane without the link connection being physically connected.",
      "zh-CHS": "G.8080中发现框架的目标是建立CP-CP链路连接（传输平面）和SNP-SNP链路连接（控制平面）之间的关系。G.8080发现框架的基本特征是控制和传输平面发现过程和名称空间之间的功能分离。来自G.8080：“这种分离允许控制平面名称与传输平面名称完全分离，并且完全独立于用这些传输名称填充DAs的方法。为了将SNP-SNP链路连接分配给SNPP链路，只需要存在链路连接的传输名称”。因此，可以将链路连接分配到控制平面，而不需要物理连接链路连接。"
    },
    {
      "indent": 3,
      "text": "Discovery encompasses two separate processes: (1) transport plane discovery, i.e., CP-to-CP and TCP-to-TCP connectivity; and (2) control plane discovery, i.e., SNP-to-SNP and SNPP links.",
      "zh-CHS": "发现包括两个独立的过程：（1）传输平面发现，即CP到CP和TCP到TCP连接；和（2）控制平面发现，即SNP到SNP和SNPP链路。"
    },
    {
      "indent": 3,
      "text": "G.8080 Amendment 1 defines the Discovery Agent (DA) as the entity responsible for discovery in the transport plane. The DA operates in the transport name space only and in cooperation with the Termination and Adaptation Performer (TAP), provides the separation between that space and the control plane names. A local DA is only aware of the CPs and TCPs that are assigned to it. The DA holds the CP-CP link connection in the transport plane to enable SNP-SNP link connections to be bound to them at a later time by the TAP. The CP-CP relationship may be discovered (e.g., per G.7714.1) or provided by a management system.",
      "zh-CHS": "G.8080修改件1将发现代理（DA）定义为负责在运输飞机上进行发现的实体。DA仅在传输名称空间中运行，并与终止和适配执行器（TAP）合作，提供该空间与控制平面名称之间的分隔。本地DA只知道分配给它的CP和TCP。DA在传输平面中保持CP-CP链路连接，以使SNP-SNP链路连接能够在稍后由TAP绑定到它们。CP-CP关系可以发现（例如，根据g.7714.1）或由管理系统提供。"
    },
    {
      "indent": 3,
      "text": "Control plane discovery takes place entirely within the control plane name space (SNPs). The Link Resource Manager (LRM) holds the SNP-SNP binding information necessary for the control plane name of the link connection, while the termination adaptation performer (TAP) holds",
      "zh-CHS": "控制平面发现完全在控制平面名称空间（SNP）内进行。链路资源管理器（LRM）保存链路连接的控制平面名称所需的SNP-SNP绑定信息，而终端适配执行器（TAP）保存该信息"
    },
    {
      "indent": 3,
      "text": "the relation between the control plane name (SNP) and the transport plane name (CP) of the resource. Figure 3 shows the relationship and the different entities for transport and control discoveries.",
      "zh-CHS": "资源的控制平面名称（SNP）和传输平面名称（CP）之间的关系。图3显示了运输和控制发现的关系和不同实体。"
    },
    {
      "indent": 5,
      "text": "     LRM                             LRM\n   +-----+ holds SNP-SNP Relation  +-----+\n   |     |-------------------------|     |\n   +-----+                         +-----+\n      |                               |\n      v                               v\n   +-----+                         +-----+\n   |  o  | SNPs in SNPP            |  o  |\n   |     |                         |     |\n   |  o  |                         |  o  |\n   |     |                         |     |\n   |  o  |                         |  o  |\n   +-----+                         +-----+\n      |                               |\n      v                               v        Control Plane\n   +-----+                         +-----+        Discovery\n   |     | Termination and         |     |\n---|-----|-------------------------|-----|---------\n   |     | Adaptation Performer    |     |\n   +-----+       (TAP)             +-----+     Transport Plane\n     |   \\                           /  |          Discovery\n     |    \\                         /   |\n     |  +-----+                +-----+  |\n     |  | DA  |                |  DA |  |\n     |  |     |                |     |  |\n     |  +-----+                +-----+  |\n     | /                              \\ |\n     V/                                \\V\n     O  CP (Transport Name)             O   CP (Transport Name)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Figure 3: Discovery in the Control and the Transport Planes",
      "zh-CHS": "图3：控制机和运输机中的发现"
    },
    {
      "indent": 0,
      "text": "4. Discovery Technologies",
      "section_title": true,
      "zh-CHS": "4. 发现技术"
    },
    {
      "indent": 0,
      "text": "4.1. Generalized Automatic Discovery Techniques G.7714",
      "section_title": true,
      "zh-CHS": "4.1. 通用自动发现技术G.7714"
    },
    {
      "indent": 3,
      "text": "Generalized automatic discovery techniques are described in G.7714 to aid resource management and routing for G.8080. The term routing here is described in the transport context of routing connections in an optical network as opposed to the routing context typically associated in packet networks.",
      "zh-CHS": "G.7714中描述了通用自动发现技术，以帮助G.8080进行资源管理和路由。这里的术语路由在光网络中的路由连接的传输上下文中描述，与分组网络中通常关联的路由上下文相反。"
    },
    {
      "indent": 3,
      "text": "G.7714 is concerned with two types of discovery:",
      "zh-CHS": "G.7714涉及两种类型的发现："
    },
    {
      "indent": 3,
      "text": "- Layer adjacency discovery - Physical media adjacency discovery",
      "zh-CHS": "- 层邻接发现-物理介质邻接发现"
    },
    {
      "indent": 3,
      "text": "Layer adjacency discovery can be used to correlate physical connections with management configured attributes. Among other features this capability allows reduction in configuration and the detection of mis-wired equipment.",
      "zh-CHS": "层邻接发现可用于将物理连接与管理配置的属性关联起来。除其他功能外，该功能还可以减少配置和检测接线错误的设备。"
    },
    {
      "indent": 3,
      "text": "Physical media adjacency discovery is a process that allows the physical testing of the media for the purpose of inventory capacity and verifying the port characteristics of physical media adjacent networks.",
      "zh-CHS": "物理媒体邻接发现是一个允许对媒体进行物理测试的过程，目的是清点容量和验证物理媒体相邻网络的端口特征。"
    },
    {
      "indent": 3,
      "text": "G.7714 does not specify specific protocols but rather the type of techniques that can be used. G.7714.1 specifies a protocol for layer adjacency with respect to SDH and OTN networks for layer adjacency discovery. A GMPLS method for layer discovery using elements of LMP is included in this set of procedures.",
      "zh-CHS": "G.7714没有规定具体的协议，而是规定可以使用的技术类型。G.7714.1规定了SDH和OTN网络层邻接发现的层邻接协议。这套程序中包含了一种使用LMP元素进行层发现的GMPLS方法。"
    },
    {
      "indent": 3,
      "text": "An important point about the G.7714 specification is that it specifies a discovery mechanism for optical networks but not necessarily how the information will be used. It is intended that the transport management plane or a transport control plane may subsequently make use of the discovered information.",
      "zh-CHS": "关于G.7714规范的一个要点是，它规定了光网络的发现机制，但不一定规定了如何使用信息。意欲运输管理平面或运输控制平面可随后利用所发现的信息。"
    },
    {
      "indent": 0,
      "text": "4.2. LMP and G.8080 Terminology Mapping",
      "section_title": true,
      "zh-CHS": "4.2. LMP和G.8080术语映射"
    },
    {
      "indent": 3,
      "text": "GMPLS is a set of IP-based protocols, including LMP, providing a control plane for multiple data plane technologies, including optical/transport networks and their resources (i.e., wavelengths, timeslots, etc.) and without assuming any restriction on the control plane architecture (see [RFC3945]). On the other hand, G.8080 defines a control plane reference architecture for optical/transport networks without any restriction on the control plane implementation. Being developed in separate standards forums, and with different scopes, they use different terms and definitions.",
      "zh-CHS": "GMPLS是一组基于IP的协议，包括LMP，为多个数据平面技术提供控制平面，包括光/传输网络及其资源（即波长、时隙等），并且不对控制平面架构进行任何限制（请参见[RFC3945]）。另一方面，G.8080定义了光/传输网络的控制平面参考体系结构，对控制平面实现没有任何限制。在不同的标准论坛上开发，范围不同，它们使用不同的术语和定义。"
    },
    {
      "indent": 3,
      "text": "Terminology mapping between LMP and ASON (G.805/G.8080) is an important step towards the understanding of the two architectures and allows for potential cooperation in areas where cooperation is possible. To facilitate this mapping, we differentiate between the two types of data links in LMP. According to LMP, a data link may be considered by each node that it terminates on as either a 'port' or a 'component link'. The LMP notions of port and component link are supported by the G.805/G.8080 architecture. G.8080's variable adaptation function is broadly equivalent to LMP's component link, i.e., a single server-layer trail dynamically supporting different multiplexing structures. Note that when the data plane delivers its own addressing space, LMP Interface_IDs and Data Links IDs are used as handles by the control plane to the actual CP Name and CP-to-CP Name, respectively.",
      "zh-CHS": "LMP和ASON（G.805/G.8080）之间的术语映射是理解这两种体系结构的重要步骤，并允许在可能合作的领域进行潜在合作。为了便于这种映射，我们在LMP中区分了两种类型的数据链路。根据LMP，数据链路可被其终止的每个节点视为“端口”或“组件链路”。端口和组件链路的LMP概念由G.805/G.8080体系结构支持。G.8080的可变自适应功能大致相当于LMP的组件链路，即动态支持不同复用结构的单个服务器层跟踪。请注意，当数据平面交付其自己的寻址空间时，控制平面将LMP接口_ID和数据链路ID分别用作实际CP名称和CP到CP名称的句柄。"
    },
    {
      "indent": 3,
      "text": "The terminology mapping is summarized in the following table: Note that the table maps ASON terms to GMPLS terms that refer to equivalent objects, but in many cases there is not a one-to-one mapping. Additional information beyond discovery terminology can be found in [LEXICO].",
      "zh-CHS": "下表总结了术语映射：请注意，该表将ASON术语映射到引用等效对象的GMPLS术语，但在许多情况下没有一对一映射。在[LEXICO]中可以找到发现术语以外的其他信息。"
    },
    {
      "indent": 3,
      "text": "+----------------+--------------------+-------------------+\n| ASON Terms     | GMPLS/LMP Terms    | GMPLS/LMP Terms   |\n|                | Port               | Component Link    |\n+----------------+--------------------+-------------------+\n| CP             | TE Resource;       | TE Resource;      |\n|                | Interface (Port)   | Interface.        |\n|                |                    |(Comp. link)       |\n+----------------+--------------------+-------------------+\n| CP Name        | Interface ID       | Interface ID(s)   |\n|                | no further sub-    | resources (such as|\n|                | division for(label)| timeslots, etc.)  |\n|                | resource allocation| on this interface |\n|                |                    | are identified by |\n|                |                    | set of labels     |\n+----------------+--------------------+-------------------+\n| CP-to-CP Link  | Data Link          | Data Link         |\n+----------------+--------------------+-------------------+\n| CP-to-CP Name  | Data Link ID       | Data Link ID      |\n+----------------+--------------------+-------------------+\n| SNP            | TE Resource        | TE Resource       |\n+----------------+--------------------+-------------------+\n| SNP Name       | Link ID            | Link ID           |\n+----------------+--------------------+-------------------+\n| SNP LC         | TE Link            | TE Link           |\n+----------------+--------------------+-------------------+\n| SNP LC Name    | TE Link ID         | TE Link ID        |\n+----------------+--------------------+-------------------+\n| SNPP           | TE Link End        | TE Link End       |\n|                | (Port)             | (Comp. Link)      |\n+----------------+--------------------+-------------------+\n| SNPP Name      | Link ID            | Link ID           |\n+----------------+--------------------+-------------------+\n| SNPP Link      | TE Link            | TE Link           |\n+----------------+--------------------+-------------------+\n| SNPP Link Name | TE Link ID         | TE Link ID        |\n+----------------+--------------------+-------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where composite identifiers are:",
      "zh-CHS": "其中，复合标识符为："
    },
    {
      "indent": 3,
      "text": "- Data Link ID: <Local Interface ID; Remote Interface ID> - TE Link ID: <Local Link ID; Remote Link ID>",
      "zh-CHS": "- 数据链路ID:<本地接口ID；远程接口ID>-TE链路ID:<本地链路ID；远程链接ID>"
    },
    {
      "indent": 3,
      "text": "Composite Identifiers are defined in the RFC 4204 [LMP]. LMP discovers data links and identifies them by the pair of local and remote interface IDs. TE links are composed of data links or component TE links. TE links are similarly identified by pair of local and remote link ID.",
      "zh-CHS": "复合标识符在RFC 4204[LMP]中定义。LMP发现数据链路并通过本地和远程接口ID对其进行标识。TE链接由数据链接或组件TE链接组成。TE链路同样由本地和远程链路ID对标识。"
    },
    {
      "indent": 0,
      "text": "4.2.1. TE Link Definition and Scope",
      "section_title": true,
      "zh-CHS": "4.2.1. TE链接定义和范围"
    },
    {
      "indent": 3,
      "text": "In the table, TE link/resource is equated with the concept of SNP, SNP LC, SNPP, and SNPP link. The definition of the TE link is broad in scope, and it is useful to repeat it here. The original definition appears in [GMPLS-RTG]:",
      "zh-CHS": "在表中，TE链路/资源等同于SNP、SNP LC、SNPP和SNPP链路的概念。TE链接的定义范围很广，在这里重复一下很有用。原始定义见[GMPLS-RTG]："
    },
    {
      "indent": 3,
      "text": "\"A TE link is a logical construct that represents a way to group/map the information about certain physical resources (and their properties) that interconnects LSRs into the information that is used by Constrained SPF for GMPLS path computation, and GMPLS signaling\".",
      "zh-CHS": "“TE链路是一种逻辑结构，它表示一种将有关某些物理资源（及其属性）的信息分组/映射的方法，这些物理资源将LSR互连到受限SPF用于GMPLS路径计算和GMPLS信令的信息中。”。"
    },
    {
      "indent": 3,
      "text": "While this definition is concise, it is probably worth pointing out some of the implications of the definition.",
      "zh-CHS": "虽然这个定义很简洁，但可能值得指出该定义的一些含义。"
    },
    {
      "indent": 3,
      "text": "A component of the TE link may follow different paths between the pair of LSRs. For example, a TE link comprising multiple STS-3cs, the individual STS-3cs component links may take identical or different physical (OC-3 and/or OC-48) paths between LSRs.",
      "zh-CHS": "TE链路的组件可以遵循lsr对之间的不同路径。例如，包括多个STS-3c的TE链路，各个STS-3c组件链路可以在lsr之间采用相同或不同的物理（OC-3和/或OC-48）路径。"
    },
    {
      "indent": 3,
      "text": "The TE link construct is a logical construction encompassing many layers in networks [RFC3471]. A TE link can represent either unallocated potential or allocated actual resources. Further allocation is represented by bandwidth reservation, and the resources may be real or, in the case of packets, virtual to allow for overbooking or other forms of statistical multiplexing schemes.",
      "zh-CHS": "TE链路结构是包含网络中许多层的逻辑结构[RFC3471]。TE链接可以表示未分配的潜在资源或已分配的实际资源。进一步的分配由带宽预留表示，并且资源可以是真实的，或者在分组的情况下是虚拟的，以允许超售或其他形式的统计复用方案。"
    },
    {
      "indent": 3,
      "text": "Since TE links may represent large numbers of parallel resources, they can be bundled for efficient summarization of resource capacity. Typically, bundling represents a logical TE link resource at a particular Interface Switching Capability. Once TE link resources are allocated, the actual capacity may be represented as LSP hierarchical (tunneled) TE link capability in another logical TE link [HIER].",
      "zh-CHS": "由于TE链路可能代表大量并行资源，因此可以将它们捆绑起来，以便有效地汇总资源容量。通常，捆绑表示特定接口交换能力下的逻辑TE链路资源。一旦分配了TE链路资源，实际容量可表示为另一逻辑TE链路[HIER]中的LSP分层（隧道）TE链路容量。"
    },
    {
      "indent": 3,
      "text": "TE links also incorporate the notion of a Forwarding Adjacency (FA) and Interface Switching Capability [RFC3945]. The FA allows transport resources to be represented as TE links. The Interface Switching Capability specifies the type of transport capability such as Packet Switch Capable (PSC), Layer-2 Switch Capable (L2SC), Time-Division Multiplex (TDM), Lambda Switch Capable (LSC), and Fiber-Switch Capable (FSC).",
      "zh-CHS": "TE链路还包含转发邻接（FA）和接口交换能力的概念[RFC3945]。FA允许将传输资源表示为TE链路。接口交换能力规定了传输能力的类型，如支持分组交换（PSC）、支持第二层交换（L2SC）、时分复用（TDM）、支持Lambda交换（LSC）和支持光纤交换（FSC）。"
    },
    {
      "indent": 3,
      "text": "A TE link between GMPLS-controlled optical nodes may consist of a bundled TE link, which itself consists of a mix of point-to-point component links [BUNDLE]. A TE link is identified by the tuple (link Identifier (32-bit number), Component link Identifier (32-bit number), and generalized label (media specific)).",
      "zh-CHS": "GMPLS控制的光节点之间的TE链路可以由捆绑TE链路组成，捆绑TE链路本身由点到点组件链路的混合组成[BUNDLE]。TE链接由元组（链接标识符（32位编号）、组件链接标识符（32位编号）和通用标签（特定于媒体）标识。"
    },
    {
      "indent": 0,
      "text": "4.3. LMP and G.8080 Discovery Relationship",
      "section_title": true,
      "zh-CHS": "4.3. LMP与G.8080的发现关系"
    },
    {
      "indent": 3,
      "text": "LMP currently consists of four primary procedures, of which the first two are mandatory and the last two are optional:",
      "zh-CHS": "LMP目前包括四个主要程序，其中前两个是强制性的，后两个是可选的："
    },
    {
      "indent": 9,
      "text": "1. Control channel management 2. Link property correlation 3. Link verification 4. Fault management",
      "zh-CHS": "1. 控制通道管理2。链接属性相关性3。链接验证4。故障管理"
    },
    {
      "indent": 3,
      "text": "LMP procedures that are relevant to G.8080 control plane discovery are control channel management, link property correlation, and link verification. Key to understanding G.8080 discovery aspects in relation to [LMP] is that LMP procedures are specific for an IP-based control plane abstraction of the transport plane.",
      "zh-CHS": "与G.8080控制平面发现相关的LMP程序包括控制信道管理、链路属性关联和链路验证。理解与[LMP]相关的G.8080发现方面的关键在于，LMP程序特定于传输平面的基于IP的控制平面抽象。"
    },
    {
      "indent": 3,
      "text": "LMP control channel management is used to establish and maintain control channel connectivity between LMP adjacent nodes. In GMPLS, the control channels between two adjacent nodes are not required to use the same physical medium as the TE links between those nodes. The control channels that are used to exchange the GMPLS control plane information exist independently of the TE links they manage (i.e., control channels may be in-band or out-of-band, provided the associated control points terminate the LMP packets). The Link Management Protocol [LMP] was designed to manage TE links, independently of the physical medium capabilities of the data links.",
      "zh-CHS": "LMP控制信道管理用于建立和维护LMP相邻节点之间的控制信道连接。在GMPLS中，两个相邻节点之间的控制信道不需要使用与这些节点之间的TE链路相同的物理介质。用于交换GMPLS控制平面信息的控制信道独立于它们所管理的TE链路而存在（即，如果相关控制点终止LMP分组，则控制信道可以是带内或带外）。链路管理协议[LMP]设计用于管理TE链路，独立于数据链路的物理介质能力。"
    },
    {
      "indent": 3,
      "text": "Link property correlation is used to aggregate multiple data links into a single TE link and to synchronize the link properties.",
      "zh-CHS": "链接属性关联用于将多个数据链接聚合为单个TE链接，并同步链接属性。"
    },
    {
      "indent": 3,
      "text": "Link verification is used to verify the physical connectivity of the data links and verify the mapping of the Interface-ID to Link-ID (CP to SNP). The local-to-remote associations can be obtained using a priori knowledge or using the link verification procedure.",
      "zh-CHS": "链路验证用于验证数据链路的物理连接，并验证接口ID到链路ID（CP到SNP）的映射。可以使用先验知识或使用链接验证过程获得本地到远程关联。"
    },
    {
      "indent": 3,
      "text": "Fault management is primarily used to suppress alarms and to localize failures. It is an optional LMP procedure; its use will depend on the specific technology's capabilities.",
      "zh-CHS": "故障管理主要用于抑制报警和定位故障。这是一个可选的LMP程序；它的使用将取决于特定技术的能力。"
    },
    {
      "indent": 3,
      "text": "[LMP] supports distinct transport and control plane name spaces with the (out-of-band) TRACE object (see [LMP-TEST]). The LMP TRACE object allows transport plane names to be associated with interface identifiers [LMP-TEST].",
      "zh-CHS": "[LMP]支持带有（带外）跟踪对象的不同传输和控制平面名称空间（请参见[LMP-TEST]）。LMP跟踪对象允许传输平面名称与接口标识符相关联[LMP-TEST]。"
    },
    {
      "indent": 3,
      "text": "Aspects of LMP link verification appear similar to G.7714.1 discovery; however, the two procedures are different. G.7714.1 provides discovery of the transport plane layer adjacencies. It provides a generic procedure to discover the connectivity of two",
      "zh-CHS": "LMP链路验证方面与G.7714.1发现类似；然而，这两种程序是不同的。G.7714.1提供了传输平面层邻接的发现。它提供了一个通用过程来发现两个节点的连接"
    },
    {
      "indent": 3,
      "text": "endpoints in the transport plane. On the other hand, the LMP link verification procedure is a control-plane-driven procedure and assumes either (1) a priori knowledge of the associated data plane's local and remote endpoint connectivity and Interface_IDs (e.g., via management plane or use of G.7714.1), or (2) support of the remote node for associating the data interface being verified with the content of the TRACE object (inferred mapping). For SONET/SDH transport networks, LMP verification uses the SONET/SDH Trail Trace identifier (see [G.783]).",
      "zh-CHS": "传输平面中的端点。另一方面，LMP链路验证程序是控制平面驱动的程序，并假设（1）相关数据平面的本地和远程端点连接和接口ID的先验知识（例如，通过管理平面或使用g.7714.1），或（2）支持远程节点将正在验证的数据接口与跟踪对象的内容关联（推断映射）。对于SONET/SDH传输网络，LMP验证使用SONET/SDH跟踪标识符（见[G.783]）。"
    },
    {
      "indent": 3,
      "text": "G.7714.1 supports the use of transport plane discovery independent of the platform using the capability. Furthermore, G.7714.1 specifies the use of a Discovery Agent that could be located in an external system and the need to support the use of text-oriented man-machine language to provide the interface. Therefore, G.7714.1 limits the discovery messages to printable characters defined by [T.50] and requires Base64 encoding for the TCP-ID and DA ID. External name-servers may be used to resolve the G.7714.1 TCP name, allowing the TCP to have an IP, Network Service Access Protocol (NSAP), or any other address format. On the other hand, LMP is based on the use of an IP-based control plane, and the LMP interface ID uses IPv4, IPv6, or unnumbered interface IDs.",
      "zh-CHS": "G.7714.1支持使用运输机发现功能，该功能独立于平台。此外，G.7714.1规定了可位于外部系统中的发现代理的使用，以及支持使用面向文本的人机语言提供接口的需要。因此，G.7714.1将发现消息限制为[T.50]定义的可打印字符，并要求对TCP-ID和DA-ID进行Base64编码。外部名称服务器可用于解析G.7714.1 TCP名称，允许TCP具有IP、网络服务访问协议（NSAP）或任何其他地址格式。另一方面，LMP基于基于IP的控制平面的使用，并且LMP接口ID使用IPv4、IPv6或未编号的接口ID。"
    },
    {
      "indent": 0,
      "text": "4.4. Comparing LMP and G.8080",
      "section_title": true,
      "zh-CHS": "4.4. LMP与G.8080的比较"
    },
    {
      "indent": 3,
      "text": "LMP exists to support GMPLS TE resource and TE link discovery. In section 4.2.1, we elaborated on the definition of the TE link. LMP enables the aspects of TE links to be discovered and reported to the control plane, more specifically, the routing plane. G.8080 and G.7714 are agnostic to the type of control plane and discovery protocol used. LMP is a valid realization of a control plane discovery process under a G.8080 model.",
      "zh-CHS": "LMP的存在是为了支持GMPLS TE资源和TE链路发现。在第4.2.1节中，我们详细阐述了TE链接的定义。LMP使得TE链路的方面能够被发现并报告给控制平面，更具体地说，路由平面。G.8080和G.7714与所使用的控制平面类型和发现协议无关。LMP是G.8080模型下控制平面发现过程的有效实现。"
    },
    {
      "indent": 3,
      "text": "G.7714 specifies transport plane discovery with respect to the transport layer CTPs or TCPs using ASON conventions and naming for the elements of the ASON control plane and the ASON management plane. This discovery supports a centralized management model of configuration as well as a distributed control plane model; in other words, discovered items can be reported to the management plane or the control plane. G.7714.1 provides one realization of a transport plane discovery process.",
      "zh-CHS": "G.7714规定了关于传输层CTP或TCP的传输平面发现，使用ASON约定以及ASON控制平面和ASON管理平面元素的命名。该发现支持集中式配置管理模型和分布式控制平面模型；换句话说，发现的项目可以报告给管理平面或控制平面。G.7714.1提供了运输机发现过程的一种实现。"
    },
    {
      "indent": 3,
      "text": "Today, LMP and G.7714, G7714.1 are defined in different standards organizations. They have evolved out of different naming schemes and architectural concepts. Whereas G.7714.1 supports a transport plane layer adjacency connectivity verification that can be used by a",
      "zh-CHS": "今天，LMP和G.7714、G7714.1在不同的标准组织中定义。它们由不同的命名方案和架构概念演变而来。而G.7714.1支持传输平面层邻接连接验证，该验证可由"
    },
    {
      "indent": 3,
      "text": "control plane or a management plane, LMP is a control plane procedure for managing GMPLS TE links (GMPLS's control plane representation of the transport plane connections).",
      "zh-CHS": "控制平面或管理平面，LMP是用于管理GMPLS TE链路（GMPLS传输平面连接的控制平面表示）的控制平面程序。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Since this document is purely descriptive in nature, it does not introduce any security issues.",
      "zh-CHS": "由于本文档纯粹是描述性的，因此不会引入任何安全问题。"
    },
    {
      "indent": 3,
      "text": "G.8080 and G.7714/G.7714.1 provide security as associated with the Data Communications Network on which they are implemented.",
      "zh-CHS": "G.8080和G.7714/G.7714.1提供了与实施它们的数据通信网络相关的安全性。"
    },
    {
      "indent": 3,
      "text": "LMP is specified using IP, which provides security mechanisms associated with the IP network on which it is implemented.",
      "zh-CHS": "LMP是使用IP指定的，IP提供与实现LMP的IP网络相关的安全机制。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "zh-CHS": "6. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[LMP] Lang, J., \"Link Management Protocol (LMP)\", RFC 4204, October 2005.",
      "zh-CHS": "[LMP]Lang，J.，“链路管理协议（LMP）”，RFC4204，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[LMP-TEST] Lang, J. and D. Papadimitriou, \"Synchronous Optical Network (SONET)/Synchronous Digital Hierarchy (SDH) Encoding for Link Management Protocol (LMP) Test Messages\", RFC 4207, October 2005.",
      "zh-CHS": "[LMP-TEST]Lang，J.和D.Papadimitriou，“链路管理协议（LMP）测试消息的同步光网络（SONET）/同步数字体系（SDH）编码”，RFC 4207，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3945] Mannie, E., \"Generalized Multi-Protocol Label Switching (GMPLS) Architecture\", RFC 3945, October 2004.",
      "zh-CHS": "[RFC3945]Mannie，E.“通用多协议标签交换（GMPLS）体系结构”，RFC 39452004年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, January 2003.",
      "zh-CHS": "[RFC3471]Berger，L.“通用多协议标签交换（GMPLS）信令功能描述”，RFC 3471，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[GMPLS-RTG] Kompella, K. and Y. Rekhter, \"Routing Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4202, October 2005.",
      "zh-CHS": "[GMPLS-RTG]Kompella，K.和Y.Rekhter，“支持通用多协议标签交换（GMPLS）的路由扩展”，RFC 4202，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[HIER] Kompella, K. and Y. Rekhter, \"Label Switched Paths (LSP) Hierarchy with Generalized Multi-Protocol Label Switching (GMPLS) Traffic Engineering (TE)\", RFC 4206, October 2005.",
      "zh-CHS": "[HIER]Kompella，K.和Y.Rekhter，“具有通用多协议标签交换（GMPLS）流量工程（TE）的标签交换路径（LSP）层次结构”，RFC 4206，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[BUNDLE] Kompella, K., Rekhter, Y., and L. Berger, \"Link Bundling in MPLS Traffic Engineering (TE)\", RFC 4201, October 2005.",
      "zh-CHS": "[BUNDLE]Kompella，K.，Rekhter，Y.，和L.Berger，“MPLS流量工程（TE）中的链路捆绑”，RFC 4201，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[LEXICO] Bryskin, I. and A. Farrel, \"A Lexicography for the Interpretation of Generalized Multiprotocol Label Switching (GMPLS) Terminology within The Context of the ITU-T's Automatically Switched Optical Network (ASON) Architecture\", Work in Progress, January 2006.",
      "zh-CHS": "[LEXICO]Bryskin，I.和A.Farrel，“在ITU-T自动交换光网络（ASON）体系结构背景下解释通用多协议标签交换（GMPLS）术语的词典编纂”，正在进行中，2006年1月。"
    },
    {
      "indent": 3,
      "text": "For information on the availability of the ITU-T documents, please see http://www.itu.int.",
      "zh-CHS": "有关ITU-T文件可用性的信息，请参见http://www.itu.int."
    },
    {
      "indent": 3,
      "text": "[G.783] ITU-T G.783 (2004), Characteristics of synchronous digital hierarchy (SDH) equipment functional blocks.",
      "zh-CHS": "[G.783]ITU-T G.783（2004），同步数字体系（SDH）设备功能块的特征。"
    },
    {
      "indent": 3,
      "text": "[G.805] ITU-T G.805 (2000), Generic functional architecture of transport networks.",
      "zh-CHS": "[G.805]ITU-T G.805（2000），传输网络的通用功能架构。"
    },
    {
      "indent": 3,
      "text": "[G.7714] ITU-T G.7714/Y.1705 (2001), Generalized automatic discovery techniques.",
      "zh-CHS": "[G.7714]ITU-T G.7714/Y.1705（2001），通用自动发现技术。"
    },
    {
      "indent": 3,
      "text": "[G.7714.1] ITU-T G.7714.1/Y.1705.1 (2003), Protocol for automatic discovery in SDH and OTN networks.",
      "zh-CHS": "[G.7714.1]ITU-T G.7714.1/Y.1705.1（2003），SDH和OTN网络中的自动发现协议。"
    },
    {
      "indent": 3,
      "text": "[G.8080] ITU-T G.8080/Y.1304 (2001), Architecture for the automatically switched optical network (ASON).",
      "zh-CHS": "[G.8080]ITU-T G.8080/Y.1304（2001），自动交换光网络（ASON）的体系结构。"
    },
    {
      "indent": 3,
      "text": "[M.3100] ITU-T M.3100 (1995), Generic Network Information Model.",
      "zh-CHS": "[M.3100]ITU-T M.3100（1995），通用网络信息模型。"
    },
    {
      "indent": 3,
      "text": "[T.50] ITU-T T.50 (1992), International Reference Alphabet.",
      "zh-CHS": "[T.50]ITU-T.50（1992），国际参考字母表。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Astrid Lozano, John Drake, Adrian Farrel and Stephen Shew for their valuable comments.",
      "zh-CHS": "作者要感谢阿斯特里德·洛扎诺、约翰·德雷克、阿德里安·法雷尔和斯蒂芬·休的宝贵评论。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank ITU-T Study Group 15 Question 14 for their careful review and comments.",
      "zh-CHS": "作者要感谢ITU-T研究组15问题14的仔细审查和评论。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Don Fedyk Nortel Networks 600 Technology Park Drive Billerica, MA, 01821",
      "zh-CHS": "唐·费迪克北电网络600科技园大道，马里兰州，01821"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 288-3041\nEMail: dwfedyk@nortel.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Osama Aboul-Magd Nortel Networks P.O. Box 3511, Station 'C' Ottawa, Ontario, Canada K1Y-4H7",
      "zh-CHS": "加拿大安大略省渥太华C站北电网络邮政信箱3511号，邮编K1Y-4H7"
    },
    {
      "indent": 3,
      "text": "Phone: +1 613 763-5827\nEMail: osama@nortel.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Deborah Brungard AT&T Rm. D1-3C22 200 S. Laurel Ave. Middletown, NJ 07748, USA",
      "zh-CHS": "德博拉·布伦加德AT&T室。D1-3C22美国新泽西州米德尔顿市劳雷尔大道南200号，邮编07748"
    },
    {
      "indent": 3,
      "text": "EMail: dbrungard@att.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jonathan P. Lang Sonos, Inc. 223 E. De La Guerra Santa Barbara, CA 93101",
      "zh-CHS": "Jonathan P.Lang Sonos，Inc.加利福尼亚州圣巴巴拉市东格拉街223号，邮编93101"
    },
    {
      "indent": 3,
      "text": "EMail: jplang@ieee.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dimitri Papadimitriou Alcatel Francis Wellesplein, 1 B-2018 Antwerpen, Belgium",
      "zh-CHS": "迪米特里·帕帕迪米特里奥·阿尔卡特·弗朗西斯·韦勒斯普林，1 B-2018比利时安特卫普"
    },
    {
      "indent": 3,
      "text": "Phone: +32 3 240-84-91\nEMail: dimitri.papadimitriou@alcatel.be",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "zh-CHS": "版权所有（C）互联网协会（2006年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "zh-CHS": "RFC编辑器功能的资金由IETF行政支持活动（IASA）提供。"
    }
  ]
}