{
  "title": {
    "text": "RFC 4333: The IETF Administrative Oversight Committee (IAOC) Member Selection Guidelines and Process",
    "zh-CHS": "RFC 4333"
  },
  "number": 4333,
  "created_at": "2021-11-13 14:48:45.045048+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     G. Huston, Ed.\nRequest for Comments: 4333                                         APNIC\nBCP: 113                                                  B. Wijnen, Ed.\nCategory: Best Current Practice                      Lucent Technologies\n                                                           December 2005",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "The IETF Administrative Oversight Committee (IAOC) Member Selection Guidelines and Process",
      "zh-CHS": "IETF行政监督委员会（IAOC）成员选择指南和流程"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo outlines the guidelines for selection of members of the IETF Administrative Oversight Committee, and describes the selection process used by the IAB and the IESG.",
      "zh-CHS": "本备忘录概述了IETF行政监督委员会成员的选择指南，并描述了IAB和IESG使用的选择过程。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The IETF Administrative Support Activity (IASA) provides the administrative structure required to support the IETF standards process and to support the IETF's technical activities. Within this activity is the office of the IETF Administrative Director (IAD) and the IETF Administrative Oversight Committee (IAOC). In addition to the ex-officio roles of the IETF Chair and IAB Chair on this committee, the IAB and IESG are each responsible for the appointment of one voting member of this committee.",
      "zh-CHS": "IETF管理支持活动（IASA）提供了支持IETF标准过程和支持IETF技术活动所需的管理结构。在这项活动中，IETF行政总监办公室（IAD）和IETF行政监督委员会（IAOC）。除了IETF主席和IAB主席在本委员会中的当然角色外，IAB和IESG各自负责任命本委员会的一名投票成员。"
    },
    {
      "indent": 3,
      "text": "This memo outlines the process by which the IAB and IESG make their selections. This process will also be used in the event of mid-term vacancies that may arise with these positions.",
      "zh-CHS": "本备忘录概述了IAB和IESG做出选择的过程。如果这些职位可能出现中期空缺，也将采用这一程序。"
    },
    {
      "indent": 3,
      "text": "The document also provides guidance to the IETF Nominations Committee regarding desirable qualifications and selection criteria for IAOC candidates.",
      "zh-CHS": "该文件还为IETF提名委员会提供了关于IAOC候选人所需资格和选择标准的指导。"
    },
    {
      "indent": 3,
      "text": "The same guidance may be used by the Internet Society (ISOC) Board of Trustees within its process of IAOC member appointment.",
      "zh-CHS": "互联网协会（ISOC）董事会可在其IAOC成员任命过程中使用相同的指南。"
    },
    {
      "indent": 0,
      "text": "1.1. Overview of IAOC",
      "section_title": true,
      "zh-CHS": "1.1. IAOC概述"
    },
    {
      "indent": 3,
      "text": "The IASA is described in [RFC4071]. It is headed by a full-time ISOC employee, the IETF Administrative Director (IAD), an officer empowered to act on behalf of the IASA at the direction of the IAOC.",
      "zh-CHS": "IASA在[RFC4071]中有描述。该委员会由一名全职ISOC员工领导，即IETF行政主管（IAD），该主管有权代表IASA在IAOC的指导下行事。"
    },
    {
      "indent": 3,
      "text": "The IAOC's role is to provide appropriate direction to the IAD, to review the IAD's regular reports, and to oversee the IASA functions to ensure that the administrative needs of the IETF community are being properly met. The IAOC's mission is not to be engaged in the day-to-day administrative work of IASA, but rather to provide appropriate direction, oversight, and approval.",
      "zh-CHS": "IAOC的职责是向IAD提供适当的指导，审查IAD的定期报告，并监督IASA职能，以确保IETF社区的行政需求得到适当满足。IAOC的任务不是参与IASA的日常行政工作，而是提供适当的指导、监督和批准。"
    },
    {
      "indent": 3,
      "text": "As described in [RFC4071], the IAOC's responsibilities are as follows:",
      "zh-CHS": "如[RFC4071]所述，IAOC的职责如下："
    },
    {
      "indent": 3,
      "text": "o To select the IAD and provide high-level review and direction for his or her work. This task should be handled by a sub-committee, as described in [RFC4071].",
      "zh-CHS": "o 选择IAD，并为其工作提供高级审查和指导。该任务应由小组委员会处理，如[RFC4071]所述。"
    },
    {
      "indent": 3,
      "text": "o To review the IAD's plans and contracts to ensure that they will meet the administrative needs of the IETF.",
      "zh-CHS": "o 审查IAD的计划和合同，确保其满足IETF的管理需求。"
    },
    {
      "indent": 3,
      "text": "o To track whether the IASA functions are meeting the IETF community's administrative needs, and to work with the IAD to determine a plan for corrective action if they are not.",
      "zh-CHS": "o 跟踪IASA职能是否满足IETF社区的管理需求，并与IAD合作确定纠正行动计划（如果不满足）。"
    },
    {
      "indent": 3,
      "text": "o To review the IAD's budget proposals to ensure that they will meet the IETF's needs, and review the IAD's regular financial reports.",
      "zh-CHS": "o 审查IAD的预算提案，以确保其满足IETF的需求，并审查IAD的定期财务报告。"
    },
    {
      "indent": 3,
      "text": "o To ensure that the IASA is run in a transparent and accountable manner. While the day-to-day work should be delegated to the IAD and others, the IAOC is responsible for ensuring that IASA finances and operational status are tracked appropriately and that monthly, quarterly, and annual financial and operational reports are published to the IETF community.",
      "zh-CHS": "o 确保IASA以透明和负责的方式运行。虽然日常工作应委托给IAD和其他人，但IAOC负责确保适当跟踪IASA的财务和运营状况，并向IETF社区发布月度、季度和年度财务和运营报告。"
    },
    {
      "indent": 3,
      "text": "o To designate, in consultation with the IAB and the IESG, the person or people who carry out the tasks that other IETF process documents say are to be carried out by the IETF Executive Director.",
      "zh-CHS": "o 与IAB和IESG协商，指定执行其他IETF过程文件规定由IETF执行主任执行的任务的人员。"
    },
    {
      "indent": 3,
      "text": "The IAOC's role is to direct and review, not perform, the work of the IAD and IASA. The IAOC holds periodic teleconferences and face-to-face meetings as needed to carry out the IAOC's duties efficiently and effectively.",
      "zh-CHS": "IAOC的职责是指导和审查IAD和IASA的工作，而不是执行。IAOC根据需要定期召开电话会议和面对面会议，以高效、有效地履行IAOC的职责。"
    },
    {
      "indent": 0,
      "text": "1.2. Overview of Selection Process",
      "section_title": true,
      "zh-CHS": "1.2. 甄选程序概览"
    },
    {
      "indent": 3,
      "text": "In brief, this document describes the time frame and procedures for the IAB and IESG to solicit public input and make a selection for the position.",
      "zh-CHS": "简而言之，本文件描述了IAB和IESG征求公众意见和选择职位的时间框架和程序。"
    },
    {
      "indent": 0,
      "text": "2. Desirable Qualifications and Selection Criteria for IETF-Nominated IAOC Members",
      "zh-CHS": "2. IETF提名IAOC成员的理想资格和选择标准"
    },
    {
      "indent": 3,
      "text": "The qualifications and selection criteria described in this section shall be used by the IAB and IESG in selecting a suitably qualified candidate for the IAOC position. As described in [RFC4071], the IETF Nominations Committee also has the responsibility to select IAOC members, and the Nominations Committee shall also use these desirable qualifications and selection criteria to guide its selection process. The same guidance may be used by the ISOC Board of Trustees within its process of IAOC member appointment.",
      "zh-CHS": "IAB和IESG应使用本节所述的资格和选择标准为IAOC职位选择合适的合格候选人。如[RFC4071]所述，IETF提名委员会也有责任选择IAOC成员，提名委员会还应使用这些理想的资格和选择标准来指导其选择过程。ISOC董事会可在其IAOC成员任命过程中使用相同的指南。"
    },
    {
      "indent": 3,
      "text": "Candidates for these IAOC positions should have knowledge of the IETF, knowledge of contracts and financial procedures, and familiarity with the administrative support needs of the IAB, the IESG, and the IETF standards process.",
      "zh-CHS": "这些IAOC职位的候选人应具备IETF知识、合同和财务程序知识，并熟悉IAB、IESG和IETF标准流程的行政支持需求。"
    },
    {
      "indent": 3,
      "text": "The candidates are also expected to be able to understand the respective roles and responsibilities of the IETF and ISOC in this activity, and be able to articulate these roles within the IETF community.",
      "zh-CHS": "候选人还应能够理解IETF和ISOC在该活动中各自的角色和责任，并能够在IETF社区内阐明这些角色。"
    },
    {
      "indent": 3,
      "text": "The candidates will also be expected to exercise all the duties of an IAOC member, including being prepared to undertake any associated responsibilities. These include, but are not limited to, the setting of administrative support policies, oversight of the administrative operations of the IETF, and representing the interests of the IETF to the IAOC. The candidates must be able to undertake full participation in all committee meetings and committee activities.",
      "zh-CHS": "候选人还应履行IAOC成员的所有职责，包括准备承担任何相关责任。这些包括但不限于制定行政支持政策、监督IETF的行政运作以及向IAOC代表IETF的利益。候选人必须能够充分参与所有委员会会议和委员会活动。"
    },
    {
      "indent": 3,
      "text": "In the case of the IAB-selected member of the IAOC, this individual does not directly represent the IAB. Similarly for the IESG-selected member of the IAOC, this individual does not directly represent the IESG. The IAB- and IESG-selected members are accountable directly to the IETF community.",
      "zh-CHS": "对于IAB选定的IAOC成员，该个人不直接代表IAB。同样，对于IESG选定的IAOC成员，该个人并不直接代表IESG。IAB和IESG选定的成员直接向IETF社区负责。"
    },
    {
      "indent": 3,
      "text": "In the case of IAOC members selected by the IETF Nominations Committee, such members do not represent any particular sub-grouping of IETF participants. IETF Nominations Committee-selected IAOC members are accountable directly to the entire IETF community.",
      "zh-CHS": "对于IETF提名委员会选出的IAOC成员，这些成员不代表IETF参与者的任何特定分组。IETF提名委员会选定的IAOC成员直接向整个IETF社区负责。"
    },
    {
      "indent": 0,
      "text": "3. IAB and IESG Selection Process of an IAOC Member",
      "section_title": true,
      "zh-CHS": "3. IAOC成员的IAB和IESG选择流程"
    },
    {
      "indent": 0,
      "text": "3.1. Nominations and Eligibility",
      "section_title": true,
      "zh-CHS": "3.1. 提名和资格"
    },
    {
      "indent": 3,
      "text": "The IAB and IESG will alternate year by year in making a public call for nominations on the ietf-announce@ietf.org mailing list. The public call will specify the manner by which nominations will be accepted and the means by which the list of nominees will be published.",
      "zh-CHS": "IAB和IESG将每年轮流公开呼吁ietf提名-announce@ietf.org邮件列表。公众电话将说明接受提名的方式以及公布提名名单的方式。"
    },
    {
      "indent": 3,
      "text": "Self-nominations are permitted. Along with the name and contact information for each candidate, details about the candidate's background and qualifications for the position should be attached to the nomination. All IETF participants, including working group chairs, IETF Nominating Committee members, and IAB and IESG members are eligible for nomination.",
      "zh-CHS": "允许自我提名。提名书应附上候选人的姓名和联系方式以及候选人的背景和任职资格的详细信息。所有IETF参与者，包括工作组主席、IETF提名委员会成员以及IAB和IESG成员都有资格获得提名。"
    },
    {
      "indent": 3,
      "text": "IAB members who accept a nomination for an IAB-selected position will recuse themselves from IAB selection discussions. Similarly, IESG members who accept a nomination for an IESG-selected position will recuse themselves from IESG selection discussions.",
      "zh-CHS": "接受IAB选定职位提名的IAB成员将退出IAB选择讨论。同样，接受IESG选定职位提名的IESG成员将退出IESG选择讨论。"
    },
    {
      "indent": 0,
      "text": "3.2. Selection",
      "section_title": true,
      "zh-CHS": "3.2. 选择"
    },
    {
      "indent": 3,
      "text": "The selecting body will publish the list of nominated persons prior to making a decision, allowing time for the community to pass any relevant comments to that body.",
      "zh-CHS": "遴选机构将在作出决定前公布提名人名单，让社区有时间向该机构传达任何相关意见。"
    },
    {
      "indent": 3,
      "text": "The selecting body will review the nomination material and any submitted comments, and make its selection.",
      "zh-CHS": "遴选机构将审查提名材料和任何提交的评论，并作出选择。"
    },
    {
      "indent": 0,
      "text": "3.3. Care of Personal Information",
      "section_title": true,
      "zh-CHS": "3.3. 个人资料的保管"
    },
    {
      "indent": 3,
      "text": "The following procedures will be used by the IAB and IESG in managing candidates' personal information:",
      "zh-CHS": "IAB和IESG将使用以下程序管理候选人的个人信息："
    },
    {
      "indent": 3,
      "text": "o The candidate's name will be published, with all other candidate names, at the close of the nominations period.",
      "zh-CHS": "o 提名期结束时，候选人的姓名将与所有其他候选人的姓名一起公布。"
    },
    {
      "indent": 3,
      "text": "o Except as noted above, all information provided to the IAB or IESG during this process will be kept as confidential to that body.",
      "zh-CHS": "o 除上文所述外，在此过程中向IAB或IESG提供的所有信息将作为机密向该机构保密。"
    },
    {
      "indent": 0,
      "text": "3.4. Term of Office and Selection Time Frame",
      "section_title": true,
      "zh-CHS": "3.4. 任期和甄选时限"
    },
    {
      "indent": 3,
      "text": "The IAB and IESG expect to seat their selected committee member at the first IETF meeting of every second year, for a two-year term of office. The IAB and IESG will alternate each year in undertaking a selection, except for the initial selection. For the first year, the",
      "zh-CHS": "IAB和IESG希望在每两年的第一次IETF会议上选出他们的委员会成员，任期两年。IAB和IESG将每年轮流进行选择，初始选择除外。第一年"
    },
    {
      "indent": 3,
      "text": "IAB and IESG will operate their selection process concurrently. Also for the first year, the IESG-selected candidate will serve on the committee for an initial term ending with the first IETF meeting of the following year, and the IAB-selected candidate will serve for a term one year longer than the IESG-selected candidate. Thereafter, the candidates will be seated for two-year terms.",
      "zh-CHS": "IAB和IESG将同时执行其选择过程。同样在第一年，IESG选定的候选人将在委员会中任职，任期为初始任期，至下一年的第一次IETF会议结束，IAB选定的候选人的任期将比IESG选定的候选人长一年。此后，候选人的任期为两年。"
    },
    {
      "indent": 3,
      "text": "Basic time frame requirements for the selection process are as follows:",
      "zh-CHS": "选择过程的基本时间框架要求如下："
    },
    {
      "indent": 3,
      "text": "o 3-4 weeks for solicitation of nominations.",
      "zh-CHS": "o 3-4周进行提名征集。"
    },
    {
      "indent": 3,
      "text": "o 3-4 weeks for review of nominees, deliberation, and selection.",
      "zh-CHS": "o 3-4周用于审查提名人、审议和选择。"
    },
    {
      "indent": 3,
      "text": "In November of every year, the selecting body of that year will announce the specific dates for the selection process for that year, following the guidelines above.",
      "zh-CHS": "每年11月，该年度的遴选机构将根据上述准则宣布该年度遴选过程的具体日期。"
    },
    {
      "indent": 0,
      "text": "3.5. Mid-term Vacancies",
      "section_title": true,
      "zh-CHS": "3.5. 中期空缺"
    },
    {
      "indent": 3,
      "text": "This document describes the process for the general appointment of IAB-selected and IESG-selected IAOC members. However, if the appointed member is unable to serve the full two-year term, the selecting body may, at its discretion, immediately select a replacement to serve the remainder of the term using the interim process defined in Section 3.5.1. If the selecting body does not invoke the interim process, the next regularly scheduled two-year selection process will fill the vacancy.",
      "zh-CHS": "本文件描述了IAB选定和IESG选定IAOC成员的一般任命流程。但是，如果任命的成员不能满两年任期，遴选机构可自行决定，立即选择一名替代者，使用第3.5.1节规定的临时程序，在剩余任期内任职。如果甄选机构不启动临时程序，下一个定期安排的两年甄选程序将填补空缺。"
    },
    {
      "indent": 0,
      "text": "3.5.1. Interim Appointment Process",
      "section_title": true,
      "zh-CHS": "3.5.1. 临时任命程序"
    },
    {
      "indent": 3,
      "text": "If the selecting body elects to fill the mid-term vacancy before the next regularly scheduled two-year selection process, a separate time line will be announced and the remainder of the process described in this document will be followed.",
      "zh-CHS": "如果甄选机构选择在下一个定期安排的两年甄选程序之前填补中期空缺，将宣布一个单独的时间表，并遵循本文件所述程序的其余部分。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not describe any technical protocols and has no implications for network security.",
      "zh-CHS": "本文件不描述任何技术协议，也不涉及网络安全。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "This document is based extensively on RFC 3677 [RFC3677]. It has benefited from helpful review comments from Harald Alvestrand, Brian Carpenter, Leslie Daigle, Rob Evans, Michael Patton, Mark Townsley, and Margaret Wasserman.",
      "zh-CHS": "本文件广泛基于RFC 3677[RFC3677]。哈拉尔德·阿尔韦斯特朗、布赖恩·卡彭特、莱斯利·戴格尔、罗布·埃文斯、迈克尔·巴顿、马克·汤斯利和玛格丽特·沃瑟曼的评论对本书有帮助。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "zh-CHS": "6. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3677] Daigle, L. and Internet Architecture Board , \"IETF ISOC Board of Trustee Appointment Procedures\", BCP 77, RFC 3677, December 2003.",
      "zh-CHS": "[RFC3677]Daigle，L.和互联网架构委员会，“IETF ISOC受托人任命程序委员会”，BCP 77，RFC 3677，2003年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4071] Austein, R. and B. Wijnen, \"Structure of the IETF Administrative Support Activity (IASA)\", BCP 101, RFC 4071, April 2005.",
      "zh-CHS": "[RFC4071]Austein，R.和B.Wijnen，“IETF行政支持活动（IASA）的结构”，BCP 101，RFC 4071，2005年4月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. IAB Members",
      "section_title": true,
      "zh-CHS": "附录A.IAB成员"
    },
    {
      "indent": 3,
      "text": "Internet Architecture Board members at the time this document was written were the following:",
      "zh-CHS": "编写本文件时，互联网体系结构委员会成员如下："
    },
    {
      "indent": 6,
      "text": "Bernard Aboba Loa Andersson Brian Carpenter Leslie Daigle Patrik Faltstrom Bob Hinden Kurtis Lindqvist David Meyer Pekka Nikander Eric Rescorla Pete Resnick Janathan Rosenberg Lixia Zhang",
      "zh-CHS": "Bernard Aboba Loa Andersson Brian Carpenter Leslie Daigle Patrik Faltstrom Bob Hinden Kurtis Lindqvist David Meyer Pekka Nikander Eric Rescorla Pete Resnick Janathan Rosenberg Lixia Zhang"
    },
    {
      "indent": 0,
      "text": "Appendix B. IESG Members",
      "section_title": true,
      "zh-CHS": "附录B.IESG成员"
    },
    {
      "indent": 3,
      "text": "Internet Engineering Steering Group members at the time this document was written were the following:",
      "zh-CHS": "编写本文件时，互联网工程指导小组成员如下："
    },
    {
      "indent": 6,
      "text": "Brian Carpenter Bill Fenner Ted Hardie Sam Hartman Scott Hollenbeck Russell Housley David Kessens Allison Mankin Mark Townsley Jon Peterson Margaret Wasserman Bert Wijnen Alex Zinin",
      "zh-CHS": "布赖恩·卡彭特·比尔·芬纳·泰德·哈迪·萨姆·哈特曼·斯科特·霍伦贝克·拉塞尔·霍斯利·大卫·凯森斯·艾利森·曼金·马克·汤斯利·乔恩·彼得森·玛格丽特·瓦瑟曼·伯特·维恩·亚历克斯·齐宁"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Geoff Huston (editor) APNIC",
      "zh-CHS": "杰夫·休斯顿（编辑）APNIC"
    },
    {
      "indent": 3,
      "text": "EMail: gih@apnic.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Bert Wijnen (editor) Lucent Technologies",
      "zh-CHS": "Bert Wijnen（编辑）朗讯科技"
    },
    {
      "indent": 3,
      "text": "EMail: bwijnen@lucent.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "zh-CHS": "版权所有（C）互联网协会（2005年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息是按“原样”提供的，贡献者、他/她所代表或赞助的组织（如有）、互联网协会和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}