{
  "title": {
    "text": "RFC 6993: Instant Messaging and Presence Purpose for the Call-Info Header Field in the Session Initiation Protocol (SIP)",
    "zh-CHS": "RFC 6993"
  },
  "number": 6993,
  "created_at": "2021-11-04 18:23:21.622058+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    P. Saint-Andre\nRequest for Comments: 6993                           Cisco Systems, Inc.\nCategory: Informational                                        July 2013\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": " Instant Messaging and Presence Purpose for the Call-Info Header Field in the Session Initiation Protocol (SIP)",
      "zh-CHS": "会话启动协议（SIP）中呼叫信息报头字段的即时消息和存在目的"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines and registers a value of \"impp\" (\"instant messaging and presence protocol\") for the \"purpose\" header field parameter of the Call-Info header field in the Session Initiation Protocol (SIP).",
      "zh-CHS": "本文档为会话启动协议（SIP）中呼叫信息报头字段的“目的”报头字段参数定义并注册了“impp”（“即时消息和状态协议”）的值。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6993.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6993."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2013 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Security Considerations . . . . . . . . . . . . . . . . . . .   2\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   3\n4.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   3\n  4.1.  Normative References  . . . . . . . . . . . . . . . . . .   3\n  4.2.  Informative References  . . . . . . . . . . . . . . . . .   3\n5.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   4",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Some real-time communication endpoints support the combined use of the Session Initiation Protocol (SIP) [RFC3261] and the Extensible Messaging and Presence Protocol (XMPP) [RFC6120]. To improve interoperability among such \"CUSAX\" endpoints [CUSAX], it can be helpful to advertise each endpoint's SIP address over XMPP and each endpoint's XMPP address over SIP, thus providing hints about the communication capabilities of the endpoints. The former feature is enabled by an XMPP extension protocol called Reachability Addresses [XEP-0152]. As to the latter feature, discussion in the SIP community led to the conclusion that it would be best to use the Call-Info header field [RFC3261] with a value of \"impp\" (\"instant messaging and presence protocol\") for the \"purpose\" header field parameter. An example follows.",
      "zh-CHS": "一些实时通信端点支持会话发起协议（SIP）[RFC3261]和可扩展消息和状态协议（XMPP）[RFC6120]的组合使用。为了提高此类“CUSAX”端点之间的互操作性[CUSAX]，可以通过XMPP公布每个端点的SIP地址，通过SIP公布每个端点的XMPP地址，从而提供关于端点通信能力的提示。前一个特性是由称为可达性地址[XEP-0152]的XMPP扩展协议启用的。关于后一个功能，SIP社区的讨论得出结论，最好使用值为“impp”（“即时消息和状态协议”）的呼叫信息报头字段[RFC3261]作为“目的”报头字段参数。下面是一个例子。"
    },
    {
      "indent": 3,
      "text": "Call-Info: <xmpp:juliet@example.com> ;purpose=impp",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Although CUSAX endpoints constitute the primary use case for the \"impp\" purpose, a Uniform Resource Identifier (URI) [RFC3986] for an instant messaging and presence protocol other than XMPP could be included in the Call-Info header field.",
      "zh-CHS": "尽管CUSAX端点构成了“impp”用途的主要用例，但除了XMPP之外的即时消息和状态协议的统一资源标识符（URI）[RFC3986]可以包含在Call Info header字段中。"
    },
    {
      "indent": 0,
      "text": "2. Security Considerations",
      "section_title": true,
      "zh-CHS": "2. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Advertising an endpoint's XMPP address over SIP could inform malicious entities about an alternative attack vector. Because the \"purpose\" header field parameter could be spoofed, the receiving endpoint ought to check the value against an authoritative source such as a user directory. Clients can integrity protect and encrypt this header field using end-to-end mechanisms such as S/MIME or hop-by-hop mechanisms such as Transport Layer Security (TLS).",
      "zh-CHS": "通过SIP广告端点的XMPP地址可以通知恶意实体关于可选的攻击向量。因为“purpose”头字段参数可能被伪造，所以接收端点应该对照权威源（如用户目录）检查该值。客户端可以使用端到端机制（如S/MIME）或逐跳机制（如传输层安全性（TLS））来保护和加密此头字段的完整性。"
    },
    {
      "indent": 3,
      "text": "This specification provides a new way to correlate otherwise possibly unconnected identifiers. Because such correlations can be privacy sensitive, user agents ought to provide a means for users to control whether or not these values are sent.",
      "zh-CHS": "该规范提供了一种新的方法来关联可能未连接的标识符。因为这种关联可能对隐私敏感，所以用户代理应该为用户提供一种方法来控制是否发送这些值。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document defines and registers a new predefined value \"impp\" for the \"purpose\" header field parameter of the Call-Info header field. The IANA has completed this action by adding this RFC as a reference to the line for the header field \"Call-Info\" and parameter name \"purpose\" in the \"Header Field Parameters and Parameter Values\" section of the \"Session Initiation Protocol (SIP) Parameters\" registry as follows:",
      "zh-CHS": "本文档为Call Info header字段的“purpose”header字段参数定义并注册了一个新的预定义值“impp”。IANA通过添加此RFC作为对“会话初始化协议（SIP）参数”注册表“标题字段参数和参数值”部分标题字段“呼叫信息”和参数名称“目的”行的引用，完成了此操作，如下所示："
    },
    {
      "indent": 5,
      "text": "Header Field: Call-Info Parameter Name: purpose Predefined Values: Yes Reference: [RFC3261][RFC5367][RFC6910][RFC6993]",
      "zh-CHS": "表头字段：调用信息参数名称：用途预定义值：是参考：[RFC3261][RFC5367][RFC6910][RFC6993]"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "zh-CHS": "4. 工具书类"
    },
    {
      "indent": 0,
      "text": "4.1. Normative References",
      "section_title": true,
      "zh-CHS": "4.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[RFC3261]Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.，和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "zh-CHS": "[RFC3986]Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6120] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Core\", RFC 6120, March 2011.",
      "zh-CHS": "[RFC6120]Saint Andre，P.，“可扩展消息和状态协议（XMPP）：核心”，RFC61202011年3月。"
    },
    {
      "indent": 0,
      "text": "4.2. Informative References",
      "section_title": true,
      "zh-CHS": "4.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[CUSAX] Ivov, E., Saint-Andre, P., and E. Marocco, \"CUSAX: Combined Use of the Session Initiation Protocol (SIP) and the Extensible Messaging and Presence Protocol (XMPP)\", Work in Progress, June 2013.",
      "zh-CHS": "[CUSAX]Ivov，E.，Saint Andre，P.，和E.Marocco，“CUSAX：会话启动协议（SIP）和可扩展消息和状态协议（XMPP）的组合使用”，正在进行的工作，2013年6月。"
    },
    {
      "indent": 3,
      "text": "[XEP-0152] Saint-Andre, P. and J. Hildebrand, \"Reachability Addresses\", XSF XEP 0152, February 2013.",
      "zh-CHS": "[XEP-0152]圣安德烈，P.和J.希尔德布兰德，“可达性地址”，XSF XEP 0152，2013年2月。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "Thanks to Gonzalo Camarillo, Keith Drage, Saul Ibarra, Emil Ivov, Cullen Jennings, Olle Johanssen, Paul Kyzivat, Gonzalo Salgueiro, Dean Willis, and Dale Worley for their input. Elwyn Davies, Salvatore Loreto, Glen Zorn, and Mehmet Ersue completed reviews on behalf of the General Area Review Team, Applications Area Directorate, Security Directorate, and Operations and Management Directorate, respectively. Stephen Farrell and Pete Resnick provided substantive feedback during IESG review. Thanks to Yana Stamcheva for her helpful comments and for shepherding the document.",
      "zh-CHS": "感谢冈萨洛·卡马里洛、基思·德雷格、索尔·伊巴拉、埃米尔·伊沃夫、卡伦·詹宁斯、奥利·约翰逊、保罗·基齐瓦特、冈萨洛·萨尔盖罗、迪安·威利斯和戴尔·沃利的投入。Elwyn Davies、Salvatore Loreto、Glen Zorn和Mehmet Ersue分别代表总区域审查小组、应用区域董事会、安全董事会和运营管理董事会完成审查。Stephen Farrell和Pete Resnick在IESG审查期间提供了实质性反馈。感谢Yana Stamcheva的帮助性评论和对文档的指导。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre Cisco Systems, Inc. 1899 Wynkoop Street, Suite 600 Denver, CO 80202 USA",
      "zh-CHS": "Peter Saint Andre Cisco Systems，Inc.美国科罗拉多州丹佛市温库普街1899号600室，邮编：80202"
    },
    {
      "indent": 3,
      "text": "Phone: +1-303-308-3282\nEMail: psaintan@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}