{
  "title": {
    "text": "RFC 6482: A Profile for Route Origin Authorizations (ROAs)",
    "zh-CHS": "RFC 6482"
  },
  "number": 6482,
  "created_at": "2021-11-06 13:26:42.061238+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       M. Lepinski\nRequest for Comments: 6482                                       S. Kent\nCategory: Standards Track                                        D. Kong\nISSN: 2070-1721                                         BBN Technologies\n                                                           February 2012",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "A Profile for Route Origin Authorizations (ROAs)",
      "zh-CHS": "路由来源授权（ROA）的配置文件"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a standard profile for Route Origin Authorizations (ROAs). A ROA is a digitally signed object that provides a means of verifying that an IP address block holder has authorized an Autonomous System (AS) to originate routes to one or more prefixes within the address block.",
      "zh-CHS": "本文件定义了路线来源授权（ROA）的标准配置文件。ROA是一种数字签名对象，它提供了一种方法来验证IP地址块持有者是否已授权自治系统（AS）发起到地址块内一个或多个前缀的路由。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6482.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6482."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2012 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Terminology ................................................3\n2. The ROA Content-Type ............................................3\n3. The ROA eContent ................................................3\n   3.1. version ....................................................4\n   3.2. asID .......................................................4\n   3.3. ipAddrBlocks ...............................................4\n4. ROA Validation ..................................................5\n5. Security Considerations .........................................5\n6. Acknowledgments .................................................6\n7. References ......................................................6\n   7.1. Normative References .......................................6\n   7.2. Informative References .....................................6\n Appendix A: ASN.1  Module..........................................8",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The primary purpose of the Resource Public Key Infrastructure (RPKI) is to improve routing security. (See [RFC6480] for more information.) As part of this system, a mechanism is needed to allow entities to verify that an AS has been given permission by an IP address block holder to advertise routes to one or more prefixes within that block. A ROA provides this function.",
      "zh-CHS": "资源公钥基础设施（RPKI）的主要目的是提高路由安全性。（有关更多信息，请参阅[RFC6480]）作为该系统的一部分，需要一种机制来允许实体验证As是否已获得IP地址块持有者的许可，可以向该块中的一个或多个前缀播发路由。ROA提供此功能。"
    },
    {
      "indent": 3,
      "text": "The ROA makes use of the template for RPKI digitally signed objects [RFC6488], which defines a Crytopgraphic Message Syntax (CMS) [RFC5652] wrapper for the ROA content as well as a generic validation procedure for RPKI signed objects. Therefore, to complete the specification of the ROA (see Section 4 of [RFC6488]), this document defines:",
      "zh-CHS": "ROA使用RPKI数字签名对象的模板[RFC6488]，该模板定义了ROA内容的Crytopraphic Message Syntax（CMS）[RFC5652]包装器以及RPKI签名对象的通用验证过程。因此，为了完成ROA规范（见[RFC6488]第4节），本文件定义："
    },
    {
      "indent": 6,
      "text": "1. The OID that identifies the signed object as being a ROA. (This OID appears within the eContentType in the encapContentInfo object as well as the content-type signed attribute in the signerInfo object).",
      "zh-CHS": "1. 将签名对象标识为ROA的OID。（此OID显示在encapContentInfo对象中的eContentType以及signerInfo对象中的content type signed属性中）。"
    },
    {
      "indent": 6,
      "text": "2. The ASN.1 syntax for the ROA eContent. (This is the payload that specifies the AS being authorized to originate routes as well as the prefixes to which the AS may originate routes.) The ROA eContent is ASN.1 encoded using the Distinguished Encoding Rules (DER) [X.690].",
      "zh-CHS": "2. ROA eContent的ASN.1语法。（这是指定AS被授权发起路由以及AS可能发起路由的前缀的有效载荷。）使用可分辨编码规则（DER）[X.690]对ROA内容进行ASN.1编码。"
    },
    {
      "indent": 6,
      "text": "3. An additional step required to validate ROAs (in addition to the validation steps specified in [RFC6488]).",
      "zh-CHS": "3. 验证ROA所需的附加步骤（除了[RFC6488]中规定的验证步骤之外）。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "zh-CHS": "1.1. 术语"
    },
    {
      "indent": 3,
      "text": "It is assumed that the reader is familiar with the terms and concepts described in \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\" [RFC5280] and \"X.509 Extensions for IP Addresses and AS Identifiers\" [RFC3779].",
      "zh-CHS": "假设读者熟悉“Internet X.509公钥基础设施证书和证书吊销列表（CRL）配置文件”[RFC5280]和“IP地址和AS标识符的X.509扩展”[RFC3779]中描述的术语和概念。"
    },
    {
      "indent": 3,
      "text": "Additionally, this document makes use of the RPKI signed object profile [RFC6488]; thus, familiarity with that document is assumed. Note that the RPKI signed object profile makes use of certificates adhering to the RPKI Resource Certificate Profile [RFC6487]; thus, familiarly with that profile is also assumed.",
      "zh-CHS": "此外，本文档使用RPKI签名对象配置文件[RFC6488]；因此，假定熟悉该文件。请注意，RPKI签名的对象配置文件使用了遵循RPKI资源证书配置文件[RFC6487]的证书；因此，也假定熟悉该配置文件。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“建议”、“不建议”、“可”和“可选”应按照RFC 2119[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "2. The ROA Content-Type",
      "section_title": true,
      "zh-CHS": "2. ROA内容类型"
    },
    {
      "indent": 3,
      "text": "The content-type for a ROA is defined as routeOriginAuthz and has the numerical value of 1.2.840.113549.1.9.16.1.24.",
      "zh-CHS": "ROA的内容类型定义为RouteOrginUthz，数值为1.2.840.113549.1.9.16.1.24。"
    },
    {
      "indent": 3,
      "text": "This OID MUST appear both within the eContentType in the encapContentInfo object as well as the content-type signed attribute in the signerInfo object (see [RFC6488]).",
      "zh-CHS": "此OID必须同时出现在encapContentInfo对象中的eContentType以及signerInfo对象中的content type signed属性中（请参见[RFC6488]）。"
    },
    {
      "indent": 0,
      "text": "3. The ROA eContent",
      "section_title": true,
      "zh-CHS": "3. ROA经济舱"
    },
    {
      "indent": 3,
      "text": "The content of a ROA identifies a single AS that has been authorized by the address space holder to originate routes and a list of one or more IP address prefixes that will be advertised. If the address space holder needs to authorize multiple ASes to advertise the same set of address prefixes, the holder issues multiple ROAs, one per AS number. A ROA is formally defined as:",
      "zh-CHS": "ROA的内容识别已被地址空间持有者授权发起路由的单个AS，以及将被公布的一个或多个IP地址前缀的列表。如果地址空间持有者需要授权多个ASE来公布同一组地址前缀，则持有者会发出多个ROA，每个AS编号一个。居留权的正式定义为："
    },
    {
      "indent": 6,
      "text": "RouteOriginAttestation ::= SEQUENCE {\n   version [0] INTEGER DEFAULT 0,\n   asID  ASID,\n   ipAddrBlocks SEQUENCE (SIZE(1..MAX)) OF ROAIPAddressFamily }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "ASID ::= INTEGER",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "ROAIPAddressFamily ::= SEQUENCE {\n   addressFamily OCTET STRING (SIZE (2..3)),\n   addresses SEQUENCE (SIZE (1..MAX)) OF ROAIPAddress }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "ROAIPAddress ::= SEQUENCE {\n   address IPAddress,\n   maxLength INTEGER OPTIONAL }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "IPAddress ::= BIT STRING",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that this content appears as the eContent within the encapContentInfo (see [RFC6488]).",
      "zh-CHS": "请注意，此内容显示为encapContentInfo中的eContent（请参见[RFC6488]）。"
    },
    {
      "indent": 0,
      "text": "3.1. version",
      "section_title": true,
      "zh-CHS": "3.1. 版本"
    },
    {
      "indent": 3,
      "text": "The version number of the RouteOriginAttestation MUST be 0.",
      "zh-CHS": "RouteOriginAttestation的版本号必须为0。"
    },
    {
      "indent": 0,
      "text": "3.2. asID",
      "section_title": true,
      "zh-CHS": "3.2. 阿西德"
    },
    {
      "indent": 3,
      "text": "The asID field contains the AS number that is authorized to originate routes to the given IP address prefixes.",
      "zh-CHS": "asID字段包含授权发起到给定IP地址前缀的路由的AS编号。"
    },
    {
      "indent": 0,
      "text": "3.3. ipAddrBlocks",
      "section_title": true,
      "zh-CHS": "3.3. IP地址块"
    },
    {
      "indent": 3,
      "text": "The ipAddrBlocks field encodes the set of IP address prefixes to which the AS is authorized to originate routes. Note that the syntax here is more restrictive than that used in the IP address delegation extension defined in RFC 3779. That extension can represent arbitrary address ranges, whereas ROAs need to represent only prefixes.",
      "zh-CHS": "IPADRBLOCKS字段对授权AS发起路由的IP地址前缀集进行编码。请注意，这里的语法比RFC3779中定义的IP地址委派扩展中使用的语法更具限制性。该扩展可以表示任意地址范围，而ROA只需要表示前缀。"
    },
    {
      "indent": 3,
      "text": "Within the ROAIPAddressFamily structure, addressFamily contains the Address Family Identifier (AFI) of an IP address family. This specification only supports IPv4 and IPv6. Therefore, addressFamily MUST be either 0001 or 0002.",
      "zh-CHS": "在ROAIPAddressFamily结构中，addressFamily包含IP地址族的地址族标识符（AFI）。此规范仅支持IPv4和IPv6。因此，addressFamily必须为0001或0002。"
    },
    {
      "indent": 3,
      "text": "Within a ROAIPAddress structure, the addresses field represents prefixes as a sequence of type IPAddress. (See [RFC3779] for more details). If present, the maxLength MUST be an integer greater than or equal to the length of the accompanying prefix, and less than or equal to the length (in bits) of an IP address in the address family (32 for IPv4 and 128 for IPv6). When present, the maxLength specifies the maximum length of the IP address prefix that the AS is authorized to advertise. (For example, if the IP address prefix is 203.0.113/24 and the maxLength is 26, the AS is authorized to advertise any more specific prefix with a maximum length of 26. In this example, the AS would be authorized to advertise 203.0.113/24, 203.0.113.128/25, or 203.0.113.0/25, but not 203.0.113.0/27.) When the maxLength is not present, the AS is only authorized to advertise the exact prefix specified in the ROA.",
      "zh-CHS": "在ROAIPAddress结构中，addresses字段将前缀表示为IPAddress类型的序列。（有关更多详细信息，请参阅[RFC3779]）。如果存在，maxLength必须是大于或等于伴随前缀长度的整数，并且小于或等于地址族中IP地址的长度（以位为单位）（对于IPv4为32，对于IPv6为128）。存在时，maxLength指定授权AS播发的IP地址前缀的最大长度。（例如，如果IP地址前缀为203.0.113/24，maxLength为26，则AS有权公布任何更具体的前缀，最大长度为26。在本例中，AS有权公布203.0.113/24、203.0.113.128/25或203.0.113.0/25，但不公布203.0.113.0/27。）如果maxLength不存在，AS仅被授权公布ROA中指定的确切前缀。"
    },
    {
      "indent": 3,
      "text": "Note that a valid ROA may contain an IP address prefix (within a ROAIPAddress element) that is encompassed by another IP address prefix (within a separate ROAIPAddress element). For example, a ROA may contain the prefix 203.0.113/24 with maxLength 26, as well as the prefix 203.0.113.0/28 with maxLength 28. (Such a ROA would authorize the indicated AS to advertise any prefix beginning with 203.0.113 with a minimum length of 24 and a maximum length of 26, as well as the specific prefix 203.0.113.0/28.) Additionally, a ROA MAY contain two ROAIPAddress elements, where the IP address prefix is identical in both cases. However, this is NOT RECOMMENDED as, in such a case, the ROAIPAddress with the shorter maxLength grants no additional privileges to the indicated AS and thus can be omitted without changing the meaning of the ROA.",
      "zh-CHS": "请注意，有效的ROA可能包含由另一个IP地址前缀（在单独的ROAIPAddress元素内）包围的IP地址前缀（在ROAIPAddress元素内）。例如，ROA可能包含前缀203.0.113/24（最大长度为26）以及前缀203.0.113.0/28（最大长度为28）。（此类ROA将授权所示AS公布以203.0.113开头的任何前缀，最小长度为24，最大长度为26，以及特定前缀203.0.113.0/28。）此外，ROA可能包含两个ROAIPAddress元素，其中IP地址前缀在两种情况下相同。但是，不建议这样做，因为在这种情况下，maxLength较短的ROAIPAddress不会向指示的as授予任何额外特权，因此可以省略，而不会更改ROA的含义。"
    },
    {
      "indent": 0,
      "text": "4. ROA Validation",
      "section_title": true,
      "zh-CHS": "4. ROA验证"
    },
    {
      "indent": 3,
      "text": "Before a relying party can use a ROA to validate a routing announcement, the relying party MUST first validate the ROA. To validate a ROA, the relying party MUST perform all the validation checks specified in [RFC6488] as well as the following additional ROA-specific validation step.",
      "zh-CHS": "在依赖方可以使用ROA验证路由公告之前，依赖方必须首先验证ROA。要验证ROA，依赖方必须执行[RFC6488]中规定的所有验证检查以及以下特定于ROA的附加验证步骤。"
    },
    {
      "indent": 3,
      "text": "o The IP address delegation extension [RFC3779] is present in the end-entity (EE) certificate (contained within the ROA), and each IP address prefix(es) in the ROA is contained within the set of IP addresses specified by the EE certificate's IP address delegation extension.",
      "zh-CHS": "o IP地址委派扩展[RFC3779]存在于终端实体（EE）证书（包含在ROA中）中，并且ROA中的每个IP地址前缀都包含在EE证书的IP地址委派扩展指定的IP地址集中。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There is no assumption of confidentiality for the data in a ROA; it is anticipated that ROAs will be stored in repositories that are accessible to all ISPs, and perhaps to all Internet users. There is no explicit authentication associated with a ROA, since the PKI used for ROA validation provides authorization but not authentication. Although the ROA is a signed, application-layer object, there is no intent to convey non-repudiation via a ROA.",
      "zh-CHS": "居留权中的数据不存在保密性假设；预计ROA将存储在所有ISP都可以访问的存储库中，也许所有互联网用户都可以访问。由于用于ROA验证的PKI提供授权但不提供身份验证，因此没有与ROA关联的明确身份验证。尽管ROA是一个有签名的应用层对象，但并不打算通过ROA传递不可否认性。"
    },
    {
      "indent": 3,
      "text": "The purpose of a ROA is to convey authorization for an AS to originate a route to the prefix(es) in the ROA. Thus, the integrity of a ROA MUST be established. The ROA specification makes use of the RPKI signed object format; thus, all security considerations in [RFC6488] also apply to ROAs. Additionally, the signed object profile uses the CMS signed message format for integrity; thus, ROAs inherit all security considerations associated with that data structure.",
      "zh-CHS": "ROA的目的是向AS传递授权，以发起到ROA中前缀的路由。因此，必须确立居留权的完整性。ROA规范使用RPKI签名对象格式；因此，[RFC6488]中的所有安全注意事项也适用于ROA。此外，签名对象配置文件使用CMS签名消息格式实现完整性；因此，ROA继承了与该数据结构相关的所有安全注意事项。"
    },
    {
      "indent": 3,
      "text": "The right of the ROA signer to authorize the target AS to originate routes to the prefix(es) is established through use of the address space and AS number PKI described in [RFC6480]. Specifically, one MUST verify the signature on the ROA using an X.509 certificate issued under this PKI, and check that the prefix(es) in the ROA match those in the certificate's address space extension.",
      "zh-CHS": "通过使用地址空间和[RFC6480]中所述的数字PKI，建立了ROA签名者授权目标发起到前缀的路由的权利。具体而言，必须使用在此PKI下颁发的X.509证书验证ROA上的签名，并检查ROA中的前缀是否与证书地址空间扩展中的前缀匹配。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has registered the following RPKI Signed Object:",
      "zh-CHS": "IANA已注册以下RPKI签名对象："
    },
    {
      "indent": 3,
      "text": "ROA 1.2.840.113549.1.9.16.1.24 [RFC6482]",
      "zh-CHS": "ROA 1.2.840.113549.1.9.16.1.24[RFC6482]"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Charles Gardiner and Russ Housley for their help and contributions. Additionally, the authors would like to thank Rob Austein, Roque Gagliano, Danny McPherson, and Sam Weiler for their careful reviews and helpful comments.",
      "zh-CHS": "作者希望感谢查尔斯·加德纳和罗斯·霍斯利的帮助和贡献。此外，作者还要感谢Rob Austein、Roque Gagliano、Danny McPherson和Sam Weiler的仔细评论和有益的评论。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5652] Housley, R., \"Cryptographic Message Syntax (CMS)\", STD 70, RFC 5652, September 2009.",
      "zh-CHS": "[RFC5652]Housley，R.，“加密消息语法（CMS）”，STD 70，RFC 56522009年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3779] Lynn, C., Kent, S., and K. Seo, \"X.509 Extensions for IP Addresses and AS Identifiers\", RFC 3779, June 2004.",
      "zh-CHS": "[RFC3779]Lynn，C.，Kent，S.，和K.Seo，“IP地址和AS标识符的X.509扩展”，RFC 3779，2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "zh-CHS": "[RFC5280]Cooper，D.，Santesson，S.，Farrell，S.，Boeyen，S.，Housley，R.，和W.Polk，“Internet X.509公钥基础设施证书和证书撤销列表（CRL）配置文件”，RFC 52802008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6487] Huston, G., Michaelson, G., and R. Loomans, \"A Profile for X.509 PKIX Resource Certificates\", RFC 6487, February 2012.",
      "zh-CHS": "[RFC6487]Huston，G.，Michaelson，G.，和R.Loomans，“X.509 PKIX资源证书的配置文件”，RFC 6487，2012年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6488] Lepinski, M., Chi, A., and S. Kent, \"Signed Object Template for the Resource Public Key Infrastructure (RPKI)\", RFC 6488, February 2012.",
      "zh-CHS": "[RFC6488]Lepinski，M.，Chi，A.，和S.Kent，“资源公钥基础设施（RPKI）的签名对象模板”，RFC 6488，2012年2月。"
    },
    {
      "indent": 3,
      "text": "[X.690] ITU-T Recommendation X.690 (2002) | ISO/IEC 8825-1:2002, Information technology - ASN.1 encoding rules: Specification of Basic Encoding Rules (BER), Canonical Encoding Rules (CER) and Distinguished Encoding Rules (DER).",
      "zh-CHS": "[X.690]ITU-T建议X.690（2002）| ISO/IEC 8825-1:2002，信息技术-ASN.1编码规则：基本编码规则（BER）、规范编码规则（CER）和区分编码规则（DER）规范。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC6480] Lepinski, M. and S. Kent, \"An Infrastructure to Support Secure Internet Routing\", RFC 6480, February 2012.",
      "zh-CHS": "[RFC6480]Lepinski，M.和S.Kent，“支持安全互联网路由的基础设施”，RFC 6480，2012年2月。"
    },
    {
      "indent": 0,
      "text": "Appendix A: ASN.1 Module",
      "zh-CHS": "附录A:ASN.1模块"
    },
    {
      "indent": 3,
      "text": "This normative appendix provides an ASN.1 module that specifies the ROA content in ASN.1 syntax.",
      "zh-CHS": "本规范性附录提供了一个ASN.1模块，用ASN.1语法指定ROA内容。"
    },
    {
      "indent": 3,
      "text": "RPKI-ROA { iso(1) member-body(2) us(840) rsadsi(113549)\n   pkcs(1) pkcs9(9) smime(16) mod(0) 61 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "DEFINITIONS EXPLICIT TAGS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "RouteOriginAttestation ::= SEQUENCE {\n   version [0] INTEGER DEFAULT 0,\n   asID  ASID,\n   ipAddrBlocks SEQUENCE (SIZE(1..MAX)) OF ROAIPAddressFamily }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ASID ::= INTEGER",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ROAIPAddressFamily ::= SEQUENCE {\n   addressFamily OCTET STRING (SIZE (2..3)),\n   addresses SEQUENCE (SIZE (1..MAX)) OF ROAIPAddress }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ROAIPAddress ::= SEQUENCE {\n   address IPAddress,\n   maxLength INTEGER OPTIONAL }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IPAddress ::= BIT STRING",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Matt Lepinski BBN Technologies 10 Moulton Street Cambridge MA 02138 EMail: mlepinski@bbn.com",
      "zh-CHS": "Matt Lepinski BBN Technologies马萨诸塞州剑桥莫尔顿街10号02138电子邮件：mlepinski@bbn.com"
    },
    {
      "indent": 3,
      "text": "Stephen Kent BBN Technologies 10 Moulton Street Cambridge MA 02138 EMail: skent@bbn.com",
      "zh-CHS": "Stephen Kent BBN Technologies马萨诸塞州剑桥莫尔顿街10号02138电子邮件：skent@bbn.com"
    },
    {
      "indent": 3,
      "text": "Derrick Kong BBN Technologies 10 Moulton Street Cambridge MA 02138 EMail: dkong@bbn.com",
      "zh-CHS": "Derrick Kong BBN Technologies马萨诸塞州剑桥莫尔顿街10号02138电子邮件：dkong@bbn.com"
    }
  ]
}