{
  "title": {
    "text": "RFC 6588: A URN Namespace for ucode",
    "zh-CHS": "RFC 6588"
  },
  "number": 6588,
  "created_at": "2021-11-03 18:27:09.691773+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       C. Ishikawa\nRequest for Comments: 6588                 YRP Ubiquitous Networking Lab\nCategory: Informational                                       April 2012\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "A URN Namespace for ucode",
      "zh-CHS": "ucode的URN命名空间"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace for ucode, an identifier system for objects and places. ucode technology is used in many applications, and this document provides a URN namespace for ucode to enable its use in Internet-related devices and software.",
      "zh-CHS": "本文档描述了ucode的统一资源名（URN）命名空间，ucode是对象和位置的标识符系统。ucode技术用于许多应用程序，本文档为ucode提供了URN名称空间，以使其能够在互联网相关设备和软件中使用。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6588.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6588."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2012 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "ucode [UCODE] is an identifier to be stored in many types of tags (not limited to Radio Frequency Identification (RFID) tags). Its allocation and management is handled by the Ubiquitous ID Center [UIDC]. The embedding of ucode in many types of tags (RFID tags, optical code, infrared markers, and even sound source) is also specified by the Ubiquitous ID Center.",
      "zh-CHS": "ucode[ucode]是一种标识符，可存储在多种类型的标签中（不限于射频识别（RFID）标签）。其分配和管理由无处不在的ID中心[UIDC]处理。ucode嵌入多种标签（RFID标签、光学代码、红外标记，甚至声源）也是由无处不在的ID中心指定的。"
    },
    {
      "indent": 3,
      "text": "The basic length of ucode is 128 bits, but it is extensible in units of 128 bits if necessary.",
      "zh-CHS": "ucode的基本长度是128位，但如果需要，可以以128位为单位进行扩展。"
    },
    {
      "indent": 3,
      "text": "ucode has been devised to identify objects and places where existing standards do not fit the application needs or the scope of the applications or where the allocation policy of existing standards is too limited for Small and Medium Enterprises (SMEs), small-scale research laboratories at academic institutions, or individual users.",
      "zh-CHS": "ucode旨在确定现有标准不符合应用需求或应用范围，或现有标准的分配政策对中小型企业（SME）、学术机构的小型研究实验室或个人用户过于有限的对象和场所。"
    },
    {
      "indent": 3,
      "text": "Applications that use ucode take advantage of the Internet extensively. Use of ucode is open to anybody. Those who wish to have ucode allocated can do so either by having ucode subspace allocated to them directly from the Ubiquitous ID Center [UIDC] or by obtaining tags that have pre-stored ucode from so called \"providers\" [UCDMIP]. Such tags are certified as ucode tags [UIDTAG], and the reader specifications are published so that there will be many readers available for such tags.",
      "zh-CHS": "使用ucode的应用程序广泛地利用了互联网。任何人都可以使用ucode。那些希望分配ucode的人可以通过直接从无处不在的ID中心[UIDC]向他们分配ucode子空间，或者通过从所谓的“提供者”[UCDMIP]获取预先存储ucode的标签来实现。这样的标签被认证为ucode标签[UIDTAG]，并且发布了读卡器规范，以便有许多读卡器可用于这样的标签。"
    },
    {
      "indent": 3,
      "text": "By having a URN for ucode, we can facilitate the use of ucode in many Internet-related devices and software for the benefit of existing and future users of ucode and people who will access such tags attached to objects and places. Since an application based on ucode can run across organizational boundaries and spread across regions and countries, a formal URN Namespace Identifier (NID) assignment for 'ucode' is requested.",
      "zh-CHS": "通过为ucode提供URN，我们可以在许多与互联网相关的设备和软件中方便地使用ucode，以使ucode的现有和未来用户以及将访问附加到对象和位置的此类标签的人受益。由于基于ucode的应用程序可以跨组织边界运行并跨地区和国家分布，因此请求为“ucode”分配正式的URN命名空间标识符（NID）。"
    },
    {
      "indent": 0,
      "text": "2. 'ucode' Registration Template",
      "section_title": true,
      "zh-CHS": "2. “ucode”注册模板"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 3,
      "text": "'ucode' requested",
      "zh-CHS": "请求使用“ucode”"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 3,
      "text": "Registration Version Number: 1 Registration Date: 2011-12-21",
      "zh-CHS": "注册版本号：1注册日期：2011-12-21"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 3,
      "text": "T-Engine Forum 2-20-1, Nishi-Gotanda Shinagawa, Tokyo, 141-0031 Japan office@t-engine.org Tel: +81-3-5437-0572",
      "zh-CHS": "T-Engine论坛2-20-1，日本东京西田真川，141-0031office@t-engine.org电话：+81-3-5437-0572"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "zh-CHS": "句法结构声明："
    },
    {
      "indent": 3,
      "text": "The structure of the namespace for 'ucode' using the hexadecimal representation of the identifier is as follows using ABNF [RFC5234].",
      "zh-CHS": "使用十六进制标识符表示法的“ucode”命名空间的结构如下所示，使用ABNF[RFC5234]。"
    },
    {
      "indent": 3,
      "text": "UCODE-URN = \"urn:ucode:\" ucode-name\nucode-name = \"_\" ucode-number\nucode-number = 1*ucode-value\nucode-value = 32HEXDIG\nHEXDIG         =  DIGIT / \"A\" / \"B\" / \"C\" / \"D\" / \"E\" / \"F\"\nDIGIT          =  %x30-39\n               ; 0-9",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "NOTE 1: \"1*\" at the start of the ucode-number definition is not a typo. Although the currently used ucode [UCODE] is 128 bits (16 octets), thus requiring 32 hexadecimal characters to represent serially, ucode is designed to be extensible in increments of 128 bits. So, in the distant future, we may need to repeat the chunks of 128 bits. This is why \"1*\" precedes ucode-value.",
      "zh-CHS": "注1：ucode编号定义开头的“1*”不是打字错误。尽管目前使用的ucode[ucode]是128位（16个八位字节），因此需要32个十六进制字符来串行表示，但ucode设计为以128位为增量进行扩展。因此，在遥远的将来，我们可能需要重复128位的数据块。这就是为什么“1*”在ucode值之前。"
    },
    {
      "indent": 3,
      "text": "NOTE 2: ucode-name starts with a \"_\" because it is also intended to be used as an identifier for XML [W3CXML]. Because an XML tag can't start with a digit, an \"_\" (underscore) is inserted at the beginning to make sure ucode-name starts with a non-digit. For example, the 128-bit ucode value 0123456789ABCDEF0123456789ABCDEF, expressed in a series of hexadecimal digits, is as follows:",
      "zh-CHS": "注2：ucode名称以“ux1”开头，因为它还打算用作XML[W3CXML]的标识符。因为XML标记不能以数字开头，所以会在开头插入一个“_”（下划线），以确保ucode名称以非数字开头。例如，以一系列十六进制数字表示的128位ucode值0123456789ABCDEF0123456789ABCDEF如下："
    },
    {
      "indent": 3,
      "text": "urn:ucode:_0123456789ABCDEF0123456789ABCDEF",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 3,
      "text": "ucode, the identifier expressed by ucode-number, is managed by the Ubiquitous ID Center [UIDC], which is a sub-organization of the T-Engine Forum [TEF]. The document \"Ubiquitous Code: ucode\" [UCODE] defines this identifier system.",
      "zh-CHS": "ucode是由ucode编号表示的标识符，由无处不在的ID中心[UIDC]管理，该中心是T-Engine论坛[TEF]的子组织。文档“通用代码：ucode”[ucode]定义了该标识符系统。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 3,
      "text": "The 'ucode' namespace is managed by the Ubiquitous ID Center. The Ubiquitous ID Center assigns the identifier, ucode, in such a way that the uniqueness of the 'ucode' namespace will be maintained.",
      "zh-CHS": "“ucode”命名空间由无处不在的ID中心管理。无处不在的ID中心分配标识符ucode，以保持“ucode”命名空间的唯一性。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 3,
      "text": "The assignment process guarantees that names are not reassigned and that the binding between the name and its resource is permanent, regardless of any standards or organizational changes or the assignment period.",
      "zh-CHS": "分配过程保证不会重新分配名称，并且名称与其资源之间的绑定是永久性的，无论标准或组织更改或分配期限如何。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 3,
      "text": "Names are assigned by the Ubiquitous ID Center and by any entities that are sub-delegated by the Ubiquitous ID Center. This assignment process is based on \"ucode Management Implementing Procedures\" [UCDMIP] established by the Ubiquitous ID Center.",
      "zh-CHS": "名称由泛在ID中心和泛在ID中心委派的任何实体分配。此分配过程基于泛在ID中心建立的“ucode管理实施程序”[UCDMIP]。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 3,
      "text": "The process of identifier resolution is currently based on the \"ucode Resolution Protocol\" [UCSURP]. It will be enhanced by using newer recommendations from ITU-T and/or standards from ISO.",
      "zh-CHS": "标识符解析过程目前基于“ucode解析协议”[UCSURP]。它将通过使用ITU-T的新建议和/或ISO的标准得到增强。"
    },
    {
      "indent": 3,
      "text": "Rules for lexical equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 3,
      "text": "The entire UCODE-URN is case-sensitive.",
      "zh-CHS": "整个UCODE-URN区分大小写。"
    },
    {
      "indent": 3,
      "text": "NOTE: This is an additional restriction imposed on the ucode namespace by the requirements of some major applications of ucode in existence. Only capital \"A\", \"B\", \"C\", ..., \"F\" are allowed as part of hexadecimal characters.",
      "zh-CHS": "注意：这是现有ucode的一些主要应用程序的要求对ucode名称空间施加的附加限制。十六进制字符中只允许使用大写字母“A”、“B”、“C”、“F”作为一部分。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 3,
      "text": "There are no special reserved characters. The URN of this namespace conforms to RFC 2141 [RFC2141] and RFC 3986 [RFC3986].",
      "zh-CHS": "没有特殊的保留字符。此命名空间的URN符合RFC 2141[RFC2141]和RFC 3986[RFC3986]。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 3,
      "text": "No special considerations.",
      "zh-CHS": "没有特别考虑。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 3,
      "text": "Global.",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "One URN Namespace registration for 'ucode' (46) has been entered into the IANA \"Formal URN Namespaces\" sub-registry for URN NIDs.",
      "zh-CHS": "“ucode”（46）的一个URN命名空间注册已输入URN NID的IANA“正式URN命名空间”子注册表。"
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "4. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "ucode, the identifier expressed by ucode-number, is a unique identification number to identify a tangible object or a place. Additionally, ucode can be assigned to \"content\" or \"information\" that does not exist in the real world or a \"concept\" that is yet more abstract.",
      "zh-CHS": "ucode，由ucode编号表示的标识符，是用于标识有形对象或场所的唯一标识号。此外，ucode可以分配给现实世界中不存在的“内容”或“信息”，或更抽象的“概念”。"
    },
    {
      "indent": 3,
      "text": "ucode has been devised to identify objects and places where existing standards do not fit the application needs or the scope of the applications or where the allocation policy of existing standards is too limited for SMEs, small-scale research laboratories at academic institutions, or individual users.",
      "zh-CHS": "ucode旨在确定现有标准不符合应用需求或应用范围，或现有标准的分配政策对中小企业、学术机构的小型研究实验室或个人用户过于有限的对象和场所。"
    },
    {
      "indent": 3,
      "text": "ucode is only an identification number, and its value (or its sub-bitfields) does not contain any pre-assigned meaning. Any relevant information about the object or place to which a ucode is assigned is stored in a data server that can be reached after a \"resolution process\" [UCSURP]. This resolution process usually occurs over the Internet.",
      "zh-CHS": "ucode只是一个标识号，其值（或其子位字段）不包含任何预先指定的含义。有关ucode分配到的对象或位置的任何相关信息都存储在数据服务器中，可在“解析过程”[UCSUPP]后访问。此解析过程通常发生在互联网上。"
    },
    {
      "indent": 3,
      "text": "ucode can be assigned to an object to be identified regardless of the type of application. ucode is expected to be stored in any kind of tags (2D optical code, RFID, etc.), and it provides a framework where anyone can obtain unique numbers for identification purposes.",
      "zh-CHS": "无论应用程序的类型如何，都可以将ucode分配给要标识的对象。ucode预计可以存储在任何类型的标签中（2D光学代码、RFID等），它提供了一个框架，任何人都可以在其中获得唯一的数字以进行识别。"
    },
    {
      "indent": 3,
      "text": "ucode has been designed to provide the services outlined in ITU-T Recommendation F.771 [ITU-T-F771] and to operate in the framework of ITU-T Recommendation H.621 [ITU-T-H621].",
      "zh-CHS": "ucode旨在提供ITU-T建议F.771[ITU-T-F771]中概述的服务，并在ITU-T建议H.621[ITU-T-H621]的框架内运行。"
    },
    {
      "indent": 3,
      "text": "ucode architecture is general enough to cover many applications for the users.",
      "zh-CHS": "ucode架构足够通用，可以为用户覆盖许多应用程序。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "zh-CHS": "5. 社区考虑"
    },
    {
      "indent": 3,
      "text": "This namespace enables ucode to be stored in tags that are designed to store URN. Also, ucode-related information can be described as metadata using the URN namespace. Thus, the namespace facilitates the exchange of descriptions regarding objects and places among multiple organizations.",
      "zh-CHS": "此命名空间使ucode能够存储在设计用于存储URN的标记中。此外，可以使用URN名称空间将ucode相关信息描述为元数据。因此，名称空间有助于在多个组织之间交换有关对象和位置的描述。"
    },
    {
      "indent": 3,
      "text": "It is expected that many small-scale providers will offer ucode tags to small users and that large scale providers will hand out millions of tags to users.",
      "zh-CHS": "预计许多小型供应商将向小型用户提供ucode标签，而大型供应商将向用户分发数百万个标签。"
    },
    {
      "indent": 3,
      "text": "The resolution servers and applications will be available to general users with appropriate access control over the Internet. The published specification for resolver and access services for 'ucode' allows the creation of client software for many types of computers including small mobile terminals and ever-popular smartphones.",
      "zh-CHS": "解析服务器和应用程序将可供具有适当访问控制的Internet普通用户使用。已发布的“ucode”解析程序和访问服务规范允许为多种类型的计算机创建客户端软件，包括小型移动终端和日益流行的智能手机。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "除了通常与使用和解决骨灰盒相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[UCODE] T-Engine Forum, Ubiquitous ID Center, \"ucode: Ubiquitous Code\", UID-00010, <http://www.uidcenter.org/spec#UID-00010>.",
      "zh-CHS": "[UCODE]T-Engine论坛，泛在ID中心，“UCODE:泛在代码”，UID-00010<http://www.uidcenter.org/spec#UID-00010>."
    },
    {
      "indent": 3,
      "text": "[UCDMIP] T-Engine Forum, Ubiquitous ID Center, \"ucode Management Implementing Procedures\", UID-00034, <http://www.uidcenter.org/spec#UID-00034>.",
      "zh-CHS": "[UCDMIP]T-Engine论坛，泛在ID中心，“ucode管理实施程序”，UID-00034<http://www.uidcenter.org/spec#UID-00034>."
    },
    {
      "indent": 3,
      "text": "[UCSURP] T-Engine Forum, Ubiquitous ID Center, \"Simplified ucode Resolution Protocol\", UID-00005, <http://www.uidcenter.org/spec#UID-00005>.",
      "zh-CHS": "[UCSUPP]T-Engine论坛，泛在ID中心，“简化ucode解析协议”，UID-00005<http://www.uidcenter.org/spec#UID-00005>."
    },
    {
      "indent": 3,
      "text": "[UIDTAG] T-Engine Forum, Ubiquitous ID Center, \"ucode Tag Architecture\", UID-00017, <http://www.uidcenter.org/spec#UID-00017>.",
      "zh-CHS": "[UIDTAG]T-Engine论坛，无处不在的ID中心，“ucode标签体系结构”，UID-00017<http://www.uidcenter.org/spec#UID-00017>."
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[RFC2141]Moats，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "zh-CHS": "[RFC3986]Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "zh-CHS": "[RFC5234]Crocker，D.，Ed.，和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-F771] ITU-T, \"Service description and requirements for multimedia information access triggered by tag-based identification\", ITU-T Recommendation F.771, <http://www.itu.int/rec/T-REC-F.771-200808-I>.",
      "zh-CHS": "[ITU-T-F771]ITU-T，“由基于标签的标识触发的多媒体信息访问的服务描述和要求”，ITU-T建议F.771<http://www.itu.int/rec/T-REC-F.771-200808-I>."
    },
    {
      "indent": 3,
      "text": "[ITU-T-H621] ITU-T, \"Architecture of a system for multimedia information access triggered by tag-based identification\", ITU-T Recommendation H.621, <http://www.itu.int/rec/T-REC-H.621-200808-I>.",
      "zh-CHS": "[ITU-T-H621]ITU-T，“由基于标签的标识触发的多媒体信息访问系统的体系结构”，ITU-T建议H.621<http://www.itu.int/rec/T-REC-H.621-200808-I>."
    },
    {
      "indent": 0,
      "text": "7.2 Informative References",
      "section_title": true,
      "zh-CHS": "7.2 资料性引用"
    },
    {
      "indent": 3,
      "text": "[W3CXML] W3C, \"Extensible Markup Language (XML) 1.1\", <http://www.w3.org/TR/xml11/>.",
      "zh-CHS": "[W3CXML]W3C，“可扩展标记语言（XML）1.1”<http://www.w3.org/TR/xml11/>."
    },
    {
      "indent": 3,
      "text": "[UIDC] Ubiquitous ID Center, <http://www.uidcenter.org/>.",
      "zh-CHS": "[UIDC]无处不在的ID中心<http://www.uidcenter.org/>."
    },
    {
      "indent": 3,
      "text": "[TEF] T-Engine Forum, <http://www.t-engine.org/>.",
      "zh-CHS": "[TEF]T-Engine论坛<http://www.t-engine.org/>."
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "The author would like to thank Peter Saint-Andre, the Document Shepherd/Responsible Area Director for this document, for providing valuable suggestions. The author would also like to thank the following people who helped to improve this document:",
      "zh-CHS": "作者要感谢本文件的文件管理员/责任区主任彼得·圣安德烈（Peter Saint Andre）提供了宝贵的建议。作者还要感谢以下帮助改进本文件的人员："
    },
    {
      "indent": 3,
      "text": "Adrian Farrel",
      "zh-CHS": "阿德里安·法雷尔"
    },
    {
      "indent": 3,
      "text": "David Harrington",
      "zh-CHS": "大卫·哈林顿"
    },
    {
      "indent": 3,
      "text": "Pete Resnick",
      "zh-CHS": "皮特·雷斯尼克"
    },
    {
      "indent": 3,
      "text": "Stephen Farrel",
      "zh-CHS": "斯蒂芬法雷尔"
    },
    {
      "indent": 3,
      "text": "Ted Hardie",
      "zh-CHS": "泰德·哈迪"
    },
    {
      "indent": 3,
      "text": "Wesley Eddy",
      "zh-CHS": "卫斯理·艾迪"
    },
    {
      "indent": 3,
      "text": "The author would also like to thank the members of T-Engine Forum who have built prototype and real-world applications using ucode and offered valuable feedback. Application examples from these members can be found on the Ubiquitous ID Center web site [UIDC] and on www.youtube.com (search for \"uidcenter\" without the quotes).",
      "zh-CHS": "作者还要感谢T-Engine论坛的成员，他们使用ucode构建了原型和真实世界的应用程序，并提供了宝贵的反馈。这些成员的应用程序示例可以在无处不在的ID中心网站[UIDC]和www.youtube.com上找到（搜索不带引号的“uidcenter”）。"
    },
    {
      "indent": 0,
      "text": "9. Contributors",
      "section_title": true,
      "zh-CHS": "9. 贡献者"
    },
    {
      "indent": 3,
      "text": "Ken Sakamura",
      "zh-CHS": "坂村健"
    },
    {
      "indent": 3,
      "text": "Noboru Koshizuka",
      "zh-CHS": "小岛信郎"
    },
    {
      "indent": 3,
      "text": "Katsunori Shindo",
      "zh-CHS": "胜野真道"
    },
    {
      "indent": 3,
      "text": "Tomonori Usaka",
      "zh-CHS": "大阪友诺里酒店"
    },
    {
      "indent": 3,
      "text": "Past and current members of the uID architecture group at the University of Tokyo and the YRP Ubiquitous Networking Laboratory (YRP UNL)",
      "zh-CHS": "东京大学UID建筑群的过去和现在成员和YRP普适网络实验室（YRP UNL）"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Chiaki Ishikawa YRP Ubiquitous Networking Laboratory 2-20-1, Nishi-Gotanda Shinagawa, Tokyo, 141-0031 Japan",
      "zh-CHS": "Chiaki Ishikawa YRP无处不在的网络实验室2-20-1，日本东京西田真川，141-0031"
    },
    {
      "indent": 3,
      "text": "Tel: +81-3-5437-2270\nFAX: +81-3-5437-2271\nEMail: chiaki.ishikawa@ubin.jp",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}