{
  "title": {
    "text": "RFC 6061: Uniform Resource Name (URN) Namespace for the National Emergency Number Association (NENA)",
    "zh-CHS": "RFC 6061"
  },
  "number": 6061,
  "created_at": "2021-11-05 03:09:22.897193+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          B. Rosen\nRequest for Comments: 6061                                       NeuStar\nCategory: Informational                                     January 2011\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Uniform Resource Name (URN) Namespace for the National Emergency Number Association (NENA)",
      "zh-CHS": "国家应急号码协会（NENA）的统一资源名称（URN）命名空间"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the Namespace Identifier (NID) \"nena\" for Uniform Resource Name (URN) resources published by the National Emergency Number Association (NENA). NENA defines and manages resources that utilize this URN model. Management activities for these and other resource types are provided by the NENA Registry System (NRS).",
      "zh-CHS": "本文档描述了由国家应急编号协会（nena）发布的统一资源名称（URN）资源的名称空间标识符（NID）“nena”。NENA定义并管理利用此URN模型的资源。这些和其他资源类型的管理活动由NENA注册系统（NRS）提供。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6061.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6061."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. URN Specification for \"nena\" NID ................................2\n3. Examples ........................................................4\n4. Namespace Considerations ........................................5\n5. Community Considerations ........................................5\n6. Security Considerations .........................................6\n7. IANA Considerations .............................................6\n8. Acknowledgements ................................................6\n9. References ......................................................7\n   9.1. Normative References .......................................7\n   9.2. Informative References .....................................7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The National Emergency Number Association (NENA) is currently in the process of setting standards, processes, and procedures for the use of an IP-based Emergency Services IP Network (ESInet) for all public safety entities in North America. Some of the solutions being developed by NENA require XML namespaces that are managed so that they are unique and persistent. To assure that the uniqueness is absolute, the registration of a specific Uniform Resource Name (URN) [RFC2141] Namespace ID (NID) for use by NENA is required. This document defines and registers such a namespace in accordance with [RFC3406].",
      "zh-CHS": "国家应急号码协会（NENA）目前正在为北美所有公共安全实体制定基于IP的应急服务IP网络（ESInet）的使用标准、流程和程序。NENA正在开发的一些解决方案需要管理XML名称空间，以便它们是唯一和持久的。为了确保唯一性是绝对的，需要注册NENA使用的特定统一资源名（URN）[RFC2141]命名空间ID（NID）。本文件根据[RFC3406]定义并注册了此类名称空间。"
    },
    {
      "indent": 0,
      "text": "2. URN Specification for \"nena\" NID",
      "section_title": true,
      "zh-CHS": "2. “nena”NID的URN规范"
    },
    {
      "indent": 3,
      "text": "Namespace ID: nena",
      "zh-CHS": "名称空间ID:nena"
    },
    {
      "indent": 3,
      "text": "Registration information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "registration version number: 1",
      "zh-CHS": "注册版本号：1"
    },
    {
      "indent": 6,
      "text": "registration date: 2010-10-13",
      "zh-CHS": "注册日期：2010-10-13"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "Registering organization Name: National Emergency Number Association (NENA) Address: 4350 North Fairfax Drive, Suite 750 Arlington, VA 22203-1695",
      "zh-CHS": "注册机构名称：国家紧急号码协会（NENA）地址：弗吉尼亚州阿灵顿市北费尔法克斯大道4350号750室22203-1695"
    },
    {
      "indent": 3,
      "text": "Designated contact:",
      "zh-CHS": "指定联系人："
    },
    {
      "indent": 6,
      "text": "Role: NENA Registry Services Administrator Email: nrs-admin@nena.org",
      "zh-CHS": "角色：NENA注册服务管理员电子邮件：nrs-admin@nena.org"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "zh-CHS": "句法结构声明："
    },
    {
      "indent": 6,
      "text": "The Namespace Specific String (NSS) of all URNs that use the\n\"nena\" NID will have the following structure:\n   {NENAclass}:{ClassSpecificString}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The \"NENAclass\" conforms to the URN syntax requirements [RFC2141] and defines a specific class of resource type. Each class will have a specific labeling scheme that is covered by \"ClassSpecificString\", which also conforms to the naming requirements of [RFC2141].",
      "zh-CHS": "“NENAclass”符合URN语法要求[RFC2141]，并定义了资源类型的特定类。每个类都有一个特定的标签方案，该方案包含在“ClassSpecificString”中，它也符合[RFC2141]的命名要求。"
    },
    {
      "indent": 3,
      "text": "NENA maintains a naming authority, the National Emergency Number Association (NENA) Registry System (NRS), that will manage the assignment of \"NENAclass\" and the specific registration values assigned for each class. Other NENA standards documents will define the \"ClassSpecificStrings\" for a given \"NENAclass\".",
      "zh-CHS": "NENA拥有一个命名机构，即国家应急号码协会（NENA）注册系统（NRS），该系统将管理“NENAclass”的分配以及为每个类别分配的特定注册值。其他NENA标准文档将为给定的“NENAclass”定义“ClassSpecificString”。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "The National Emergency Number Association Registry System (NRS) provides information on the registered resources and the registrations for each. More information about the NRS and the registration activities and procedures to be followed are defined in \"NENA Registry System Standard\", NENA 70-001 [NENA70-001], which is available at http://www.nena.org/.",
      "zh-CHS": "国家应急号码协会注册系统（NRS）提供了注册资源的信息以及每个资源的注册信息。有关NRS和注册活动以及要遵循的程序的更多信息，请参见“NENA注册系统标准”，NENA 70-001[NENA70-001]，该标准可在http://www.nena.org/."
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "The NRS will manage resources using the \"nena\" NID and will be the authority for managing the resources and subsequent strings associated. The NRS shall ensure the uniqueness of all nena URNs by checking such names against the list of existing namespace names, as documented in NENA 70-001 [NENA70-001].",
      "zh-CHS": "NRS将使用“nena”NID管理资源，并将成为管理资源和后续相关字符串的机构。NRS应根据nena 70-001[NENA70-001]中记录的现有名称空间名称列表检查所有nena URN的唯一性。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 6,
      "text": "The NRS will provide clear documentation of the registered uses of the \"nena\" NID. The NRS will establish a registry for \"NENAclass\", as defined in NENA08-003 [NENA08-003]. Each \"NENAclass\" will have a separate description in the registry and may have its own sub-registry. In particular, new \"NENAclass\" registry entries will require a full NENA Technical Standard document.",
      "zh-CHS": "NRS将提供“nena”NID注册使用的清晰文件。NRS将建立NENA08-003[NENA08-003]中定义的“NENAclass”注册表。每个“NENAclass”在注册表中都有单独的描述，并且可能有自己的子注册表。特别是，新的“NENAclass”注册表项需要完整的NENA技术标准文件。"
    },
    {
      "indent": 3,
      "text": "The NRS will maintain a website at a stable address that provides XML and text renderings of the urn:nena registry.",
      "zh-CHS": "NRS将在一个稳定的地址维护一个网站，提供urn:nena注册表的XML和文本呈现。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 6,
      "text": "The NRS processes and procedures for identifier assignment are documented in NENA 07-001 [NENA70-001]. The registry that will control the urn:nena namespace is defined in NENA 08-003 [NENA08-003]. In particular, assignments to the \"NENAclass\" registry will require a NENA Technical Standard document. Subregistries for particular \"NENAclasses\" may be established by such technical standards. Subregistries may be defined to have more liberal management policies as defined in NENA 70-001 [NENA70-001], but must be NRS managed and will not be permitted to be delegated to any other organization or registry. Thus, the NRS will manage the entire urn:nena tree.",
      "zh-CHS": "NENA 07-001[NENA70-001]中记录了标识分配的NRS流程和程序。nena 08-003[NENA08-003]中定义了控制urn:nena命名空间的注册表。特别是，分配给“NENAclass”注册中心需要一份NENA技术标准文件。可根据此类技术标准建立特定“NENACLASS”的分区域。根据NENA 70-001[NENA70-001]的定义，子区域可能具有更为宽松的管理政策，但必须由NRS管理，且不得委托给任何其他组织或注册机构。因此，NRS将管理整个urn:nena树。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 6,
      "text": "The namespace is not currently listed with a Resolution Discovery System (RDS), but nothing about the namespace prohibits the future definition of appropriate resolution methods or listing with an RDS.",
      "zh-CHS": "名称空间当前未与解析发现系统（RDS）一起列出，但名称空间的任何内容都不禁止将来定义适当的解析方法或与RDS一起列出。"
    },
    {
      "indent": 3,
      "text": "Rules for lexical equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "No special considerations; the rules for lexical equivalence of [RFC2141] apply.",
      "zh-CHS": "没有特别考虑；[RFC2141]的词汇对等规则适用。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "zh-CHS": "没有特别考虑。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "None specified. URN assignment will be handled by procedures implemented in support of NENA activities.",
      "zh-CHS": "没有具体说明。URN任务将由支持NENA活动的程序执行。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "Global",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "The following examples are representative URNs that could be assigned by the NRS. They may not be the actual strings that would be assigned.",
      "zh-CHS": "以下示例是可由NRS分配的代表性URN。它们可能不是要分配的实际字符串。"
    },
    {
      "indent": 3,
      "text": "NENAresource \"psaproute\" Syntax: \"urn:nena:emergencyresponders:<responder name>\" ResourceSpecificString: simple string with name of responder, defined in a subregistry Use: Defines the URN to be used for queries to an NG9-1-1 Emergency Call Routing Function that provides URIs for responding agencies.",
      "zh-CHS": "NENAresource“psaproute”语法：“urn:nena:emergencyresponders:<responder name>”ResourceSpecificString：带有响应者名称的简单字符串，在子区域中定义使用：定义用于查询NG9-1-1紧急呼叫路由函数的urn，该函数为响应机构提供URI。"
    },
    {
      "indent": 3,
      "text": "Examples:",
      "zh-CHS": "示例："
    },
    {
      "indent": 6,
      "text": "urn:nena:emergencyresponders:ambulance\nurn:nena:emergencyresponders:fire\nurn:nena:emergencyresponders:police\nurn:nena:emergencyresponders:poison\nurn:nena:emergencyresponders:coastguard\nurn:nena:emergencyresponders:marine",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "4. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "The National Emergency Number Association has developed standards for emergency calling in North America for several decades. NENA is developing a variety of applications and services using Internet protocols built upon IETF standards. Some of these services require that supporting information (e.g., data descriptions, attributes, etc.) be fully specified. For proper operation, descriptions of the needed supporting information must exist and be available in a unique, reliable, and persistent manner. These dependencies provide the basis of the need for namespaces, in one form or another, and will enable NENA to define URNs that are to assign cleaner, more general, more permanent, more reliable, and more controllable namespace names related to NENA standards, while keeping URNs defined by NENA properly separate from the IETF-defined URNs.",
      "zh-CHS": "几十年来，美国国家紧急电话号码协会（National Emergency Number Association）制定了北美紧急呼叫标准。NENA正在使用基于IETF标准的互联网协议开发各种应用程序和服务。其中一些服务要求完全指定支持信息（例如，数据描述、属性等）。对于正确的操作，必须存在所需支持信息的描述，并以独特、可靠和持久的方式提供。这些依赖关系以一种或另一种形式提供了名称空间需求的基础，并将使NENA能够定义URN，以分配与NENA标准相关的更干净、更通用、更永久、更可靠和更可控的名称空间名称，同时使NENA定义的URN与IETF定义的URN适当分开。"
    },
    {
      "indent": 3,
      "text": "As the National Emergency Number Association work is ongoing and covers many technical areas, the possibility of binding to various other namespace repositories has been deemed impractical. Each object or description, as defined in NENA, could possibly be related to multiple different namespaces, so further conflicts of association could occur. Thus, the intent is to utilize the National Emergency Number Association Registry System, operated by NENA, as the naming authority for NENA-defined objects and descriptions.",
      "zh-CHS": "由于国家紧急号码协会的工作正在进行中，涵盖了许多技术领域，因此，将其绑定到各种其他名称空间存储库的可能性被认为是不切实际的。NENA中定义的每个对象或描述可能与多个不同的名称空间相关，因此可能会发生进一步的关联冲突。因此，目的是利用NENA运营的国家应急号码协会登记系统作为NENA定义的对象和描述的命名机构。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "zh-CHS": "5. 社区考虑"
    },
    {
      "indent": 3,
      "text": "The North American public safety organizations will benefit from publication of this namespace by having permanent and reliable URNs to be used with protocols defined by NENA. The objects and descriptions required for services defined by NENA are generally available for use by other organizations. The National Emergency",
      "zh-CHS": "北美公共安全组织将受益于该名称空间的发布，因为它们拥有永久和可靠的URN，可与NENA定义的协议一起使用。NENA定义的服务所需的对象和描述通常可供其他组织使用。国家紧急情况"
    },
    {
      "indent": 3,
      "text": "Number Association will provide access and support for name requests by these organizations within the constraints of the defined NRS processes and the specific urn:nena registry and subregistries. This support can be enabled in a timely and responsive fashion as new objects and descriptions are produced. These will be enabled in a fashion similar to current IANA processes, as documented in NENA70-001 [NENA70-001].",
      "zh-CHS": "数字协会将在规定的NRS流程和特定的urn:nena注册和子地区的约束范围内，为这些组织的姓名请求提供访问和支持。随着新对象和描述的产生，这种支持可以以及时和响应的方式启用。如NENA70-001[NENA70-001]所述，这些将以类似于当前IANA流程的方式启用。"
    },
    {
      "indent": 3,
      "text": "The NRS establishes registries when called for in a NENA Technical Standard. Such standards must provide the NRS with clear and concise instructions on creating and maintaining such registries. Defined management policies include \"NENA Technical Standard Required\", \"NENA Document Required\", \"Expert Review\", and \"First Come First Served\", which correspond to similar IANA management policies. NENA is establishing a website that provides controlled entry of new registries and entries in registries, and automatically produces HTML and XML descriptions of registry contents that are used by vendors and other consumers of the content.",
      "zh-CHS": "当NENA技术标准要求时，NRS建立登记册。此类标准必须向NRS提供关于创建和维护此类登记册的清晰简明说明。定义的管理政策包括“需要NENA技术标准”、“需要NENA文件”、“专家评审”和“先到先得”，这与类似的IANA管理政策相对应。NENA正在建立一个网站，提供新注册中心和注册中心中的受控条目，并自动生成注册中心内容的HTML和XML描述，供内容的供应商和其他消费者使用。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "除了通常与使用和解决骨灰盒相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document adds a new entry in the URN Namespaces registry. The namespace is \"nena\". The defining document is this RFC. The entry can be found in the Uniform Resource Names (URN) Namespaces registry available from http://www.iana.org and any associated mirrors.",
      "zh-CHS": "此文档在URN名称空间注册表中添加一个新条目。名称空间是“nena”。定义文档就是这个RFC。该项可以在统一资源名称（URN）命名空间注册表中找到，该注册表可从http://www.iana.org 以及任何相关的镜子。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "The author thanks Alfred Hoenes (TR-Sys) for his careful reading and extensive comments and suggestions. The author also acknowledges that the text from [RFC4358] formed the basis of this document.",
      "zh-CHS": "作者感谢Alfred Hoenes（TR Sys）的仔细阅读和广泛的评论和建议。作者还承认，[RFC4358]中的文本构成了本文件的基础。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[RFC2141]Moats，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[NENA08-003] NENA, \"Detailed Functional and Interface Specification for the NENA i3 Solution - Stage 3\", NENA Standard 08-003, September 2010.",
      "zh-CHS": "[NENA08-003]NENA，“NENA i3解决方案的详细功能和接口规范-第3阶段”，NENA标准08-003，2010年9月。"
    },
    {
      "indent": 3,
      "text": "[NENA70-001] NENA, \"NENA Registry System Standard\", NENA Standard 70-001, September 2009.",
      "zh-CHS": "[NENA70-001]NENA，“NENA注册系统标准”，NENA标准70-001，2009年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "zh-CHS": "[RFC3406]Daigle，L.，van Gulik，D.，Iannella，R.，和P.Faltstrom，“统一资源名称（URN）命名空间定义机制”，BCP 66，RFC 3406，2002年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4358] Smith, D., \"A Uniform Resource Name (URN) Namespace for the Open Mobile Alliance (OMA)\", RFC 4358, January 2006.",
      "zh-CHS": "[RFC4358]Smith，D.“开放移动联盟（OMA）的统一资源名（URN）命名空间”，RFC 4358，2006年1月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Brian Rosen NeuStar, Inc. 470 Conrad Dr. Mars, PA 16046 US",
      "zh-CHS": "布莱恩·罗森·纽斯塔公司，美国宾夕法尼亚州康拉德·马尔斯博士，邮编：16046"
    },
    {
      "indent": 3,
      "text": "EMail: br@brianrosen.net",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}