{
  "title": {
    "text": "RFC 6048: Network News Transfer Protocol (NNTP) Additions to LIST Command",
    "zh-CHS": "RFC 6048"
  },
  "number": 6048,
  "created_at": "2021-11-05 02:13:10.666183+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           J. Elie\nRequest for Comments: 6048                                 November 2010\nUpdates: 2980, 3977\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "Network News Transfer Protocol (NNTP) Additions to LIST Command",
      "zh-CHS": "网络新闻传输协议（NNTP）添加到列表命令"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a set of enhancements to the Network News Transfer Protocol (NNTP) that allow a client to request extended information from NNTP servers regarding server status, policy, and other aspects of local configuration. These enhancements are made as new keywords to the existing LIST capability described in RFC 3977.",
      "zh-CHS": "本文档定义了网络新闻传输协议（NNTP）的一组增强功能，允许客户端从NNTP服务器请求有关服务器状态、策略和本地配置的其他方面的扩展信息。这些增强作为RFC 3977中描述的现有列表功能的新关键字进行。"
    },
    {
      "indent": 3,
      "text": "This memo updates and formalizes the LIST DISTRIBUTIONS and LIST SUBSCRIPTIONS commands defined in RFC 2980. It also adds the LIST COUNTS, LIST MODERATORS, and LIST MOTD commands, and specifies additional values returned by the existing LIST ACTIVE command for the status of a newsgroup.",
      "zh-CHS": "此备忘录更新并规范RFC 2980中定义的列表分发和列表订阅命令。它还添加列表计数、列表主持人和列表MOTD命令，并指定现有列表活动命令为新闻组状态返回的其他值。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6048.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6048."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2010 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从该文档中提取的代码组件必须"
    },
    {
      "indent": 3,
      "text": "include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "包括信托法律条款第4.e节中所述的简化BSD许可证文本，且不提供简化BSD许可证中所述的担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.1.  Conventions Used in This Document  . . . . . . . . . . . .  4\n  1.2.  Author's Note  . . . . . . . . . . . . . . . . . . . . . .  4\n2.  New LIST Variants  . . . . . . . . . . . . . . . . . . . . . .  4\n  2.1.  Advertising the New LIST Variants  . . . . . . . . . . . .  4\n  2.2.  LIST COUNTS  . . . . . . . . . . . . . . . . . . . . . . .  5\n    2.2.1.  Usage  . . . . . . . . . . . . . . . . . . . . . . . .  5\n    2.2.2.  Description  . . . . . . . . . . . . . . . . . . . . .  6\n    2.2.3.  Examples . . . . . . . . . . . . . . . . . . . . . . .  7\n  2.3.  LIST DISTRIBUTIONS . . . . . . . . . . . . . . . . . . . .  8\n    2.3.1.  Usage  . . . . . . . . . . . . . . . . . . . . . . . .  8\n    2.3.2.  Description  . . . . . . . . . . . . . . . . . . . . .  8\n    2.3.3.  Example  . . . . . . . . . . . . . . . . . . . . . . . 10\n  2.4.  LIST MODERATORS  . . . . . . . . . . . . . . . . . . . . . 10\n    2.4.1.  Usage  . . . . . . . . . . . . . . . . . . . . . . . . 10\n    2.4.2.  Description  . . . . . . . . . . . . . . . . . . . . . 10\n    2.4.3.  Example  . . . . . . . . . . . . . . . . . . . . . . . 12\n  2.5.  LIST MOTD  . . . . . . . . . . . . . . . . . . . . . . . . 13\n    2.5.1.  Usage  . . . . . . . . . . . . . . . . . . . . . . . . 13\n    2.5.2.  Description  . . . . . . . . . . . . . . . . . . . . . 13\n    2.5.3.  Example  . . . . . . . . . . . . . . . . . . . . . . . 14\n  2.6.  LIST SUBSCRIPTIONS . . . . . . . . . . . . . . . . . . . . 14\n    2.6.1.  Usage  . . . . . . . . . . . . . . . . . . . . . . . . 14\n    2.6.2.  Description  . . . . . . . . . . . . . . . . . . . . . 15\n    2.6.3.  Examples . . . . . . . . . . . . . . . . . . . . . . . 16\n3.  Additions to LIST ACTIVE . . . . . . . . . . . . . . . . . . . 16\n  3.1.  New Status Field Values  . . . . . . . . . . . . . . . . . 16\n  3.2.  Examples . . . . . . . . . . . . . . . . . . . . . . . . . 20\n4.  Augmented BNF Syntax for These Additions to the LIST\n    Command  . . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n  4.1.  Commands . . . . . . . . . . . . . . . . . . . . . . . . . 21\n  4.2.  Responses  . . . . . . . . . . . . . . . . . . . . . . . . 21\n5.  Internationalization Considerations  . . . . . . . . . . . . . 22\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 23\n7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 23\n8.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 24\n9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 24\n  9.1.  Normative References . . . . . . . . . . . . . . . . . . . 24\n  9.2.  Informative References . . . . . . . . . . . . . . . . . . 25",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The NNTP specification [RFC3977] defines the LIST capability and a few keywords that can be used with that command: ACTIVE, ACTIVE.TIMES, DISTRIB.PATS, HEADERS, NEWSGROUPS, and OVERVIEW.FMT. Other variants of the LIST command are in use, but with limited or absent documentation. These variants are formalized in this document.",
      "zh-CHS": "NNTP规范[RFC3977]定义了列表功能和几个可用于该命令的关键字：ACTIVE、ACTIVE.TIMES、DISTRIB.PATS、HEADERS、NEWSGROUPS和OVERVIEW.FMT。LIST命令的其他变体正在使用中，但文档有限或不存在。这些变体在本文档中正式化。"
    },
    {
      "indent": 3,
      "text": "The DISTRIBUTIONS and SUBSCRIPTIONS variants were originally documented in [RFC2980]. The LIST DISTRIBUTIONS command is sent by a news client to obtain a list of relevant distributions known by a news server along with their descriptions. The LIST SUBSCRIPTIONS command is sent by a news client when first connecting to a news server so as to obtain a list of recommended newsgroups available on it. Both of these commands are intended to be used in place of hard-coding news clients to use specific distributions or look for specific default newsgroups.",
      "zh-CHS": "发行版和订阅变体最初记录在[RFC2980]中。LIST DISTRIBUTIONS命令由新闻客户端发送，以获取新闻服务器已知的相关发行版的列表及其描述。在第一次连接到新闻服务器时，新闻客户端会发送LIST SUBSCRIPTIONS命令，以获取其上可用的推荐新闻组列表。这两个命令都旨在代替硬编码新闻客户端使用特定的发行版或查找特定的默认新闻组。"
    },
    {
      "indent": 3,
      "text": "The MOTD variant was originally documented in [NNTP_LIST] (which also describes the SUBSCRIPTIONS variant). The LIST MOTD command is sent by a news client to obtain a \"message of the day\" from the server administrator regarding the current state of a news server.",
      "zh-CHS": "MOTD变体最初记录在[NNTP_列表]中（该列表还描述了订阅变体）。LIST MOTD命令由新闻客户端发送，以从服务器管理员处获取有关新闻服务器当前状态的“当日消息”。"
    },
    {
      "indent": 3,
      "text": "The COUNTS and MODERATORS variants have not been documented before. The LIST COUNTS command is similar to LIST ACTIVE, except that it also returns an estimated number of articles in each newsgroup. The LIST MODERATORS command is sent by a news client to obtain a list of associations between a moderated newsgroup and its submission address template.",
      "zh-CHS": "计数和调节变量以前没有记录。LIST COUNTS命令与LIST ACTIVE类似，只是它还返回每个新闻组中的估计文章数。“列表主持人”命令由新闻客户端发送，以获取主持人新闻组与其提交地址模板之间的关联列表。"
    },
    {
      "indent": 3,
      "text": "The ACTIVE variant was formalized in [RFC3977], but the meanings of only three status field values in LIST ACTIVE responses have been specified: \"y\", \"n\", and \"m\". These statuses are particularly useful for readers, since they describe local posting rights. However, several other statuses are in use that are primarily useful for peers as they mainly describe how remote articles coming from peers are locally handled by a given news server. This memo defines three other values for the status field in LIST ACTIVE responses: \"x\", \"j\", and \"=\" followed by the name of a newsgroup.",
      "zh-CHS": "[RFC3977]中对主动变量进行了形式化描述，但在列表主动响应中仅指定了三个状态字段值的含义：“y”、“n”和“m”。这些状态对于读者特别有用，因为它们描述了本地发布权限。但是，其他几个状态也在使用中，它们主要对对等方有用，因为它们主要描述来自对等方的远程文章是如何由给定的新闻服务器在本地处理的。此备忘录为列表活动响应中的状态字段定义了三个其他值：“x”、“j”和“=”后跟新闻组的名称。"
    },
    {
      "indent": 3,
      "text": "This specification should be read in conjunction with the NNTP base specification [RFC3977]. In the case of a conflict between these two documents, [RFC3977] takes precedence.",
      "zh-CHS": "本规范应与NNTP基本规范[RFC3977]一起阅读。如果这两个文件之间存在冲突，则以[RFC3977]为准。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The notational conventions used in this document are the same as those in [RFC3977], and any term not defined in this document has the same meaning as it does in that one.",
      "zh-CHS": "本文件中使用的符号约定与[RFC3977]中的符号约定相同，且本文件中未定义的任何术语具有与该文件中相同的含义。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "When a hexadecimal correspondence is given to an octet in this document, the value is in US-ASCII [ASCII] (for instance, \".\", noted %x2E).",
      "zh-CHS": "当本文档中的八位字节与十六进制对应时，值为US-ASCII[ASCII]（例如，“.”，注释为%x2E）。"
    },
    {
      "indent": 3,
      "text": "In the examples, commands from the client are indicated with [C], and responses from the server are indicated with [S]. The client is the initiator of the NNTP connection; the server is the other endpoint.",
      "zh-CHS": "在示例中，来自客户端的命令用[C]表示，来自服务器的响应用[S]表示。客户端是NNTP连接的发起方；服务器是另一个端点。"
    },
    {
      "indent": 0,
      "text": "1.2. Author's Note",
      "section_title": true,
      "zh-CHS": "1.2. 作者说明"
    },
    {
      "indent": 3,
      "text": "Please write the first letter of \"Elie\" with an acute accent wherever possible -- it is U+00C9, that is to say \"&#201;\" in XML.",
      "zh-CHS": "请尽可能用尖锐的口音写“Elie”的第一个字母——它是U+00C9，也就是用XML写的“&#201；”。"
    },
    {
      "indent": 0,
      "text": "2. New LIST Variants",
      "section_title": true,
      "zh-CHS": "2. 新列表变体"
    },
    {
      "indent": 3,
      "text": "The LIST capability is defined in Section 7.6 of [RFC3977]. It allows the server to provide useful information to the client in multi-line blocks.",
      "zh-CHS": "[RFC3977]第7.6节定义了列表能力。它允许服务器以多行块的形式向客户端提供有用的信息。"
    },
    {
      "indent": 3,
      "text": "This document provides five new keywords to the LIST capability: COUNTS, DISTRIBUTIONS, MODERATORS, MOTD, and SUBSCRIPTIONS.",
      "zh-CHS": "本文档为列表功能提供了五个新关键字：计数、分发、版主、MOTD和订阅。"
    },
    {
      "indent": 3,
      "text": "Each keyword is OPTIONAL and corresponds to the same-named variant of the LIST command.",
      "zh-CHS": "每个关键字都是可选的，并对应于LIST命令的相同命名变量。"
    },
    {
      "indent": 0,
      "text": "2.1. Advertising the New LIST Variants",
      "section_title": true,
      "zh-CHS": "2.1. 宣传新的列表变体"
    },
    {
      "indent": 3,
      "text": "When a news server implements a variant of the LIST command as described in this specification, it advertises the corresponding feature in the LIST capability. Where one of these new LIST keywords is advertised, it MUST have the meaning given in this specification.",
      "zh-CHS": "当新闻服务器实现本规范中所述的LIST命令的变体时，它会公布LIST功能中的相应功能。如果公布这些新列表关键字中的一个，它必须具有本规范中给出的含义。"
    },
    {
      "indent": 3,
      "text": "For instance, if a news server implements the SUBSCRIPTIONS variant, it will add the SUBSCRIPTIONS keyword to the LIST capability in response to the CAPABILITIES command (see Section 5.2 of [RFC3977]):",
      "zh-CHS": "例如，如果新闻服务器实现了订阅变量，它将向列表功能添加订阅关键字，以响应CAPABILITIES命令（请参见[RFC3977]第5.2节）："
    },
    {
      "indent": 6,
      "text": "[C] CAPABILITIES\n[S] 101 Capability list:\n[S] VERSION 2\n[S] READER\n[S] LIST ACTIVE NEWSGROUPS SUBSCRIPTIONS\n[S] .\n[C] LIST SUBSCRIPTIONS\n[S] 215 List of recommended newsgroups follows\n[S] local.welcome\n[S] local.test\n[S] news.newusers.questions\n[S] news.announce.newusers\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For each of the new LIST variants described in this specification, an empty response can be sent to the client:",
      "zh-CHS": "对于本规范中描述的每个新列表变量，可以向客户端发送空响应："
    },
    {
      "indent": 6,
      "text": "[C] LIST SUBSCRIPTIONS\n[S] 215 List of recommended newsgroups follows\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This means that the information is maintained by the news server but that it is voluntarily empty. Frequently, the news server maintains the information in a configuration file. This file can be empty or contain only commented or blank lines, indicating a voluntary absence of information.",
      "zh-CHS": "这意味着信息由新闻服务器维护，但它是自动清空的。新闻服务器通常在配置文件中维护信息。此文件可以为空，也可以仅包含注释行或空行，表示自愿缺少信息。"
    },
    {
      "indent": 3,
      "text": "When the news server software implements one of these LIST variants but a particular server does not maintain the information (for instance, when the configuration file does not exist), the 503 response code MUST be returned:",
      "zh-CHS": "当新闻服务器软件实现这些列表变量之一，但特定服务器不维护信息时（例如，当配置文件不存在时），必须返回503响应代码："
    },
    {
      "indent": 6,
      "text": "[C] LIST SUBSCRIPTIONS [S] 503 No list of recommended newsgroups available",
      "zh-CHS": "[C] 列表订阅[S]503没有可用的推荐新闻组列表"
    },
    {
      "indent": 0,
      "text": "2.2. LIST COUNTS",
      "section_title": true,
      "zh-CHS": "2.2. 列表计数"
    },
    {
      "indent": 0,
      "text": "2.2.1. Usage",
      "section_title": true,
      "zh-CHS": "2.2.1. 用法"
    },
    {
      "indent": 3,
      "text": "Syntax LIST COUNTS [wildmat]",
      "zh-CHS": "语法列表计数[wildmat]"
    },
    {
      "indent": 3,
      "text": "Responses 215 List of newsgroups follows (multi-line)",
      "zh-CHS": "以下是新闻组列表（多行）"
    },
    {
      "indent": 3,
      "text": "Parameters wildmat Groups of interest",
      "zh-CHS": "感兴趣的群体的参数"
    },
    {
      "indent": 0,
      "text": "2.2.2. Description",
      "section_title": true,
      "zh-CHS": "2.2.2. 描述"
    },
    {
      "indent": 3,
      "text": "See Section 7.6.1 of [RFC3977] for general requirements of the LIST command.",
      "zh-CHS": "LIST命令的一般要求见[RFC3977]第7.6.1节。"
    },
    {
      "indent": 3,
      "text": "The LIST COUNTS command returns a list of valid newsgroups carried by the news server along with associated information, the \"counts list\", and is similar to LIST ACTIVE.",
      "zh-CHS": "LIST COUNTS命令返回新闻服务器携带的有效新闻组列表以及相关信息，即“COUNTS LIST”，与LIST ACTIVE类似。"
    },
    {
      "indent": 3,
      "text": "The information is returned as a multi-line data block following the 215 response code and contains one line per newsgroup. Each line of this list MUST consist of five fields separated from each other by one or more spaces (the usual practice is a single space) in the following order:",
      "zh-CHS": "该信息在215响应代码之后以多行数据块的形式返回，每个新闻组包含一行。此列表的每一行必须由五个字段组成，每个字段之间用一个或多个空格分隔（通常是一个空格），顺序如下："
    },
    {
      "indent": 3,
      "text": "o The name of the newsgroup.",
      "zh-CHS": "o 新闻组的名称。"
    },
    {
      "indent": 3,
      "text": "o The reported high water mark for the group.",
      "zh-CHS": "o 据报道，该组的最高水位线。"
    },
    {
      "indent": 3,
      "text": "o The reported low water mark for the group.",
      "zh-CHS": "o 该组报告的低水位线。"
    },
    {
      "indent": 3,
      "text": "o The estimated number of articles in the group.",
      "zh-CHS": "o 组中文章的估计数量。"
    },
    {
      "indent": 3,
      "text": "o The current status of the group on this server.",
      "zh-CHS": "o 此服务器上组的当前状态。"
    },
    {
      "indent": 3,
      "text": "The reported high and low water marks, and the estimated number of articles, are as described in the GROUP command (see Section 6.1.1 of [RFC3977]), but note that they are in the opposite order to the 211 response (that is, number low high group) to the GROUP command. The current status of the group is as described in the LIST ACTIVE command (see Section 7.6.3 of [RFC3977], as well as Section 3 of this document). Also note that, similarly to the LIST ACTIVE command, TAB characters are not valid separators for the LIST COUNTS command.",
      "zh-CHS": "报告的高水位线和低水位线，以及物品的估计数量，如GROUP命令所述（见[RFC3977]第6.1.1节），但请注意，它们与GROUP命令的211响应（即，数量低-高组）的顺序相反。组的当前状态如列表激活命令所述（参见[RFC3977]第7.6.3节以及本文件第3节）。还要注意，与LIST ACTIVE命令类似，制表符不是LIST COUNTS命令的有效分隔符。"
    },
    {
      "indent": 3,
      "text": "The order of newsgroups in the counts list is not significant. The server need not consistently return the same order or the same results if this command is used more than once in a session.",
      "zh-CHS": "计数列表中新闻组的顺序不重要。如果在会话中多次使用此命令，则服务器不需要一致地返回相同的顺序或相同的结果。"
    },
    {
      "indent": 3,
      "text": "The same newsgroup SHOULD NOT appear twice in the output of this command.",
      "zh-CHS": "同一新闻组不应在该命令的输出中出现两次。"
    },
    {
      "indent": 3,
      "text": "The counts list is newsgroup-based, and a wildmat MAY be specified, in which case the response is limited to only the groups, if any, whose names match the wildmat. If no wildmat is specified, the server MUST include every newsgroup that the client is permitted to select with the GROUP command (see Section 6.1.1 of [RFC3977]).",
      "zh-CHS": "计数列表是基于新闻组的，可以指定wildmat，在这种情况下，响应仅限于名称与wildmat匹配的组（如果有）。如果未指定wildmat，服务器必须包括允许客户端使用GROUP命令选择的每个新闻组（请参阅[RFC3977]第6.1.1节）。"
    },
    {
      "indent": 3,
      "text": "The counts list MAY be empty. If the server does not maintain the information, a 503 response code MUST be returned. (However, note that a news server that supports this command usually maintains the information.)",
      "zh-CHS": "计数列表可能为空。如果服务器没有维护信息，则必须返回503响应代码。（但是，请注意，支持此命令的新闻服务器通常会维护信息。）"
    },
    {
      "indent": 3,
      "text": "The client MAY use LIST COUNTS in order to obtain an estimate of the number of articles in every newsgroup the server carries, which enables it to provide the end user with this information. This provides a simpler mechanism for a client to obtain the estimated number of articles in newsgroups, compared with a sequence of individual GROUP commands.",
      "zh-CHS": "客户端可以使用列表计数来获得服务器承载的每个新闻组中的文章数量的估计值，这使得它能够向最终用户提供此信息。与单个组命令序列相比，这为客户端获取新闻组中文章的估计数量提供了一种更简单的机制。"
    },
    {
      "indent": 0,
      "text": "2.2.3. Examples",
      "section_title": true,
      "zh-CHS": "2.2.3. 例子"
    },
    {
      "indent": 3,
      "text": "Example of output with no argument:",
      "zh-CHS": "不带参数的输出示例："
    },
    {
      "indent": 6,
      "text": "[C] CAPABILITIES\n[S] 101 Capability list:\n[S] VERSION 2\n[S] READER\n[S] LIST ACTIVE COUNTS NEWSGROUPS\n[S] .\n[C] LIST COUNTS\n[S] 215 List of newsgroups follows\n[S] misc.test 3002322 3000234 1234 y\n[S] comp.risks 442001 441099 742 m\n[S] rec.food.drink.tea 100 51 3 y\n[S] local.empty 7 8 0 y\n[S] local.tea 2004 1504 301 y\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example of output with a wildmat:",
      "zh-CHS": "使用wildmat的输出示例："
    },
    {
      "indent": 6,
      "text": "[C] LIST COUNTS *.tea,misc.*,!local.*\n[S] 215 List of newsgroups follows\n[S] misc.test 3002322 3000234 1234 y\n[S] rec.food.drink.tea 100 51 3 y\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example of output on an implementation that includes leading zeroes:",
      "zh-CHS": "包含前导零的实现的输出示例："
    },
    {
      "indent": 6,
      "text": "[C] LIST COUNTS\n[S] 215 List of newsgroups follows\n[S] misc.test 0003002322 0003000234 1234 y\n[S] comp.risks 0000442001 0000441099 742 m\n[S] rec.food.drink.tea 0000000100 0000000051 3 y\n[S] local.empty 0000000007 0000000008 0 y\n[S] local.tea 0000002004 0000001504 301 y\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The estimated number of articles usually does not start with leading zeroes, but MAY start with such zeroes.",
      "zh-CHS": "文章的估计数量通常不以前导零开始，但可能以此类零开始。"
    },
    {
      "indent": 0,
      "text": "2.3. LIST DISTRIBUTIONS",
      "section_title": true,
      "zh-CHS": "2.3. 列表分发"
    },
    {
      "indent": 0,
      "text": "2.3.1. Usage",
      "section_title": true,
      "zh-CHS": "2.3.1. 用法"
    },
    {
      "indent": 3,
      "text": "Syntax LIST DISTRIBUTIONS",
      "zh-CHS": "语法列表分布"
    },
    {
      "indent": 3,
      "text": "Responses 215 Distributions list follows (multi-line)",
      "zh-CHS": "答复如下（多行）"
    },
    {
      "indent": 0,
      "text": "2.3.2. Description",
      "section_title": true,
      "zh-CHS": "2.3.2. 描述"
    },
    {
      "indent": 3,
      "text": "See Section 7.6.1 of [RFC3977] for general requirements of the LIST command.",
      "zh-CHS": "LIST命令的一般要求见[RFC3977]第7.6.1节。"
    },
    {
      "indent": 3,
      "text": "A \"distributions list\" is maintained by some NNTP servers to contain the name of each distribution that is known by the news server and a short description about the meaning of the distribution. Distributions are used by clients as potential values for the Distribution header field body of a news article being posted (see Section 3.2.4 of [RFC5536] for the definition of this header field).",
      "zh-CHS": "一些NNTP服务器维护“分发列表”，以包含新闻服务器已知的每个分发的名称以及有关分发含义的简短描述。客户端将分发内容用作正在发布的新闻文章的分发标题字段正文的潜在值（有关此标题字段的定义，请参见[RFC5536]第3.2.4节）。"
    },
    {
      "indent": 3,
      "text": "The information is returned as a multi-line data block following the 215 response code and contains one line per distribution. Each line of this list MUST consist of two fields separated from each other by one or more space or TAB characters (the usual practice is a single TAB). The first field is the name of the distribution, and the second field is a short description of the distribution. There are no leading or trailing whitespaces in a line. The description MAY contain whitespaces.",
      "zh-CHS": "该信息作为215响应代码之后的多行数据块返回，并且每个分发包含一行。此列表的每一行必须由两个字段组成，两个字段之间用一个或多个空格或制表符分隔（通常是单个制表符）。第一个字段是分发的名称，第二个字段是分发的简短描述。一行中没有前导空格或尾随空格。描述可能包含空格。"
    },
    {
      "indent": 3,
      "text": "The order of distributions in the distributions list is not significant; the server need not consistently return the same order or the same results if this command is used more than once in a session.",
      "zh-CHS": "分配列表中的分配顺序不显著；如果在会话中多次使用此命令，则服务器不需要一致地返回相同的顺序或相同的结果。"
    },
    {
      "indent": 3,
      "text": "The same distribution SHOULD NOT appear twice in the output of this command.",
      "zh-CHS": "同一分布不应在该命令的输出中出现两次。"
    },
    {
      "indent": 3,
      "text": "The description MUST be in UTF-8 [RFC3629].",
      "zh-CHS": "说明必须采用UTF-8[RFC3629]格式。"
    },
    {
      "indent": 3,
      "text": "The distributions list is not newsgroup-based, and an argument MUST NOT be specified. Otherwise, a 501 response code MUST be returned.",
      "zh-CHS": "分发列表不是基于新闻组的，并且不能指定参数。否则，必须返回501响应代码。"
    },
    {
      "indent": 3,
      "text": "The distributions list MAY be empty. If the server does not maintain the information, a 503 response code MUST be returned.",
      "zh-CHS": "分发列表可能为空。如果服务器没有维护信息，则必须返回503响应代码。"
    },
    {
      "indent": 3,
      "text": "The client MAY use this information to generate or supplement a list of known distributions provided to the user. If the news server implements the LIST DISTRIBUTIONS command, it SHOULD also implement the LIST DISTRIB.PATS command (defined in Section 7.6.5 of [RFC3977]) and describe in the distributions list all the distributions present in the distrib.pats list so that the client can use both of these commands jointly (naturally, the distributions list can also describe distributions that are not present in the distrib.pats list). Note that the two commands need not return distributions in the same order.",
      "zh-CHS": "客户可以使用此信息生成或补充提供给用户的已知分发列表。如果新闻服务器执行LIST DISTRIBUTIONS命令，它还应执行LIST DISTRIB.PATS命令（在[RFC3977]第7.6.5节中定义），并在分发列表中描述DISTRIB.PATS列表中的所有分发，以便客户端可以联合使用这两个命令（当然，distributions列表也可以描述distrib.pats列表中不存在的发行版）。请注意，这两个命令不需要以相同的顺序返回发行版。"
    },
    {
      "indent": 0,
      "text": "2.3.3. Example",
      "section_title": true,
      "zh-CHS": "2.3.3. 实例"
    },
    {
      "indent": 3,
      "text": "Example of a joint use of LIST DISTRIB.PATS and LIST DISTRIBUTIONS:",
      "zh-CHS": "列表分发和列表分发的联合使用示例："
    },
    {
      "indent": 6,
      "text": "[C] CAPABILITIES\n[S] 101 Capability list:\n[S] VERSION 2\n[S] READER\n[S] LIST ACTIVE DISTRIB.PATS DISTRIBUTIONS NEWSGROUPS\n[S] .\n[C] LIST DISTRIB.PATS\n[S] 215 Information follows\n[S] 10:local.*:local\n[S] 5:france.*:fr\n[S] 20:local.here.*:thissite\n[S] .\n[C] LIST DISTRIBUTIONS\n[S] 215 List of distributions follows\n[S] fr Local to France.\n[S] local Local to this news server.\n[S] thissite Local to this site.\n[S] usa Local to the United States of America.\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.4. LIST MODERATORS",
      "section_title": true,
      "zh-CHS": "2.4. 列出版主"
    },
    {
      "indent": 0,
      "text": "2.4.1. Usage",
      "section_title": true,
      "zh-CHS": "2.4.1. 用法"
    },
    {
      "indent": 3,
      "text": "Syntax LIST MODERATORS",
      "zh-CHS": "语法列表版主"
    },
    {
      "indent": 3,
      "text": "Responses 215 Moderators list follows (multi-line)",
      "zh-CHS": "回复215主持人列表如下（多行）"
    },
    {
      "indent": 0,
      "text": "2.4.2. Description",
      "section_title": true,
      "zh-CHS": "2.4.2. 描述"
    },
    {
      "indent": 3,
      "text": "See Section 7.6.1 of [RFC3977] for general requirements of the LIST command.",
      "zh-CHS": "LIST命令的一般要求见[RFC3977]第7.6.1节。"
    },
    {
      "indent": 3,
      "text": "The \"moderators list\" is maintained by some NNTP servers to make clients aware of how the news server will generate a submission e-mail address when an article is locally posted to a moderated newsgroup.",
      "zh-CHS": "“版主列表”由一些NNTP服务器维护，以使客户端知道当文章在本地发布到版主新闻组时，新闻服务器将如何生成提交电子邮件地址。"
    },
    {
      "indent": 3,
      "text": "The information is returned as a multi-line data block following the 215 response code. Each line of this list MUST consist of two fields separated from each other by a colon (\":\" or %x3A). The first field is a wildmat (which may be a simple newsgroup name), and the second",
      "zh-CHS": "该信息作为215响应代码后的多行数据块返回。此列表的每一行必须由两个字段组成，两个字段之间用冒号（“：”或%x3A）隔开。第一个字段是wildmat（可能是一个简单的新闻组名称），第二个字段是"
    },
    {
      "indent": 3,
      "text": "field is the submission address template for newsgroups matching that wildmat. There are no leading or trailing whitespaces in a line. The submission template MAY contain colons (\":\").",
      "zh-CHS": "字段是与该wildmat匹配的新闻组的提交地址模板。一行中没有前导空格或尾随空格。提交模板可能包含冒号（“：”）。"
    },
    {
      "indent": 3,
      "text": "The submission template is essentially an e-mail address (see the definition of \"addr-spec\" in Section 3.4.1 of [RFC5322]), except with certain modifications. The case-sensitive string \"%s\" (%x25.73) MUST occur either zero or one time in the template. If there is to be a literal \"%\" in the submission address, it MUST be written as \"%%\" in the template, even if not followed by an \"s\". The character \"%\" MUST NOT occur in the submission template, except as part of \"%s\" or \"%%\".",
      "zh-CHS": "提交模板本质上是一个电子邮件地址（见[RFC5322]第3.4.1节中“addr spec”的定义），但经过某些修改的情况除外。区分大小写的字符串“%s”（%x25.73）必须在模板中出现零次或一次。如果提交地址中有文字“%”，则在模板中必须将其写为“%”，即使后面没有“s”。字符“%”不能出现在提交模板中，除非作为“%s”或“%%”的一部分。"
    },
    {
      "indent": 3,
      "text": "The order of lines in the moderators list is significant: the first matching line is used. Consequently, specific patterns should be listed before general patterns. Every moderated newsgroup name SHOULD be matched by at least one line in the list; often this is achieved by having a default pattern at the bottom, but other approaches are acceptable, and news server software MAY leave this up to the server administrator rather than enforcing it programmatically.",
      "zh-CHS": "版主列表中的行的顺序很重要：使用第一个匹配行。因此，特定模式应该在一般模式之前列出。每个经过审核的新闻组名称应至少与列表中的一行匹配；通常，这是通过在底部有一个默认模式来实现的，但是其他方法是可以接受的，新闻服务器软件可能会将这一点留给服务器管理员，而不是通过编程来实现。"
    },
    {
      "indent": 3,
      "text": "When an article without an Approved header field is locally posted to a moderated newsgroup, the server generates a submission address from the corresponding submission template (that is, the second field of the first matching line in the moderators list) by replacing the \"%s\", if present, with the name of the matching newsgroup after each period (\".\" or %x2E) in the name has been changed to a dash (\"-\" or %x2D). In addition, any \"%%\" is changed back to \"%\". The server then forwards the submitted article to the moderator at the resulting submission address (see Section 3.5.1 of [RFC5537]).",
      "zh-CHS": "当一篇没有批准的标题字段的文章在本地发布到受审核的新闻组时，服务器通过在每个时段后将“%s”（如果存在）替换为匹配的新闻组的名称，从相应的提交模板（即审核人列表中第一个匹配行的第二个字段）生成提交地址名称中的（“.”或%x2E）已更改为短划线（“-”或%x2D）。此外，任何“%%”都将更改回“%”。然后，服务器将提交的文章转发到最终提交地址的版主处（请参见[RFC5537]第3.5.1节）。"
    },
    {
      "indent": 6,
      "text": "NOTE: The creation and maintenance of submission addresses is outside the scope of this specification.",
      "zh-CHS": "注意：提交地址的创建和维护不在本规范的范围内。"
    },
    {
      "indent": 3,
      "text": "The moderators list is not newsgroup-based, and an argument MUST NOT be specified. Otherwise, a 501 response code MUST be returned.",
      "zh-CHS": "版主列表不是基于新闻组的，并且不能指定参数。否则，必须返回501响应代码。"
    },
    {
      "indent": 3,
      "text": "The moderators list MAY be empty. If the server does not maintain the information, a 503 response code MUST be returned, although these situations should not occur if the news server is an injecting agent that carries moderated newsgroups.",
      "zh-CHS": "版主列表可能为空。如果服务器不维护该信息，则必须返回503响应代码，尽管如果新闻服务器是一个携带有缓和新闻组的注入代理，则不应出现这种情况。"
    },
    {
      "indent": 0,
      "text": "2.4.3. Example",
      "section_title": true,
      "zh-CHS": "2.4.3. 实例"
    },
    {
      "indent": 3,
      "text": "Example of output:",
      "zh-CHS": "输出示例："
    },
    {
      "indent": 6,
      "text": "[C] CAPABILITIES\n[S] 101 Capability list:\n[S] VERSION 2\n[S] READER\n[S] POST\n[S] LIST ACTIVE MODERATORS NEWSGROUPS\n[S] .\n[C] LIST MODERATORS\n[S] 215 List of submission address templates follows\n[S] foo.bar:announce@example.com\n[S] local.*:%s@localhost\n[S] *:%s@moderators.example.com\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The following table describes a few examples associating a moderated newsgroup and its submission address on a news server whose moderators list is the one in the previous example:",
      "zh-CHS": "下表介绍了几个示例，这些示例将主持人列表与上一示例中的主持人列表相同的新闻服务器上的主持人新闻组及其提交地址关联起来："
    },
    {
      "indent": 3,
      "text": "+-----------------------------+-------------------------------------+\n| Name of the moderated       | Submission address                  |\n| newsgroup                   |                                     |\n+-----------------------------+-------------------------------------+\n| foo.bar                     | announce@example.com                |\n| local.test                  | local-test@localhost                |\n| alt.dev.null                | alt-dev-null@moderators.example.com |\n| alt.test-me                 | alt-test-me@moderators.example.com  |\n+-----------------------------+-------------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "NOTE: When \"%s\" is used, periods are changed to dashes, and dashes are left alone. This implies that two moderated newsgroups whose names differ only by changing a period to a dash would have the same submission address. Therefore, if a server carries such moderated newsgroup pairs but posts should go to different submission addresses, a \"%s\" pattern template cannot be used for the moderation submission addresses for those groups, and explicit entries without a pattern will be required.",
      "zh-CHS": "注意：当使用“%s”时，句点将更改为破折号，而破折号将单独保留。这意味着，只有将句点改为破折号，名称不同的两个版主新闻组才会具有相同的提交地址。因此，如果服务器携带这样的经审核的新闻组对，但帖子应该转到不同的提交地址，则不能将“%s”模式模板用于这些组的审核提交地址，并且需要没有模式的显式条目。"
    },
    {
      "indent": 6,
      "text": "Similarly, it is not recommended to use a \"%s\" pattern rule for the moderation submission template for two moderated newsgroups whose names differ only by the case of their characters, because e-mail systems frequently treat the left-hand side of e-mail addresses as case-sensitive. See also Section 3.1.4 of [RFC5536] and Section 7.2 of [USEAGE] for the syntax of a newsgroup name.",
      "zh-CHS": "同样，对于名称仅因字符大小写不同的两个受审核新闻组，不建议使用“%s”模式规则作为审核提交模板，因为电子邮件系统通常将电子邮件地址的左侧视为区分大小写。新闻组名称的语法另见[RFC5536]第3.1.4节和[USEAGE]第7.2节。"
    },
    {
      "indent": 0,
      "text": "2.5. LIST MOTD",
      "section_title": true,
      "zh-CHS": "2.5. 列表MOTD"
    },
    {
      "indent": 0,
      "text": "2.5.1. Usage",
      "section_title": true,
      "zh-CHS": "2.5.1. 用法"
    },
    {
      "indent": 3,
      "text": "Syntax LIST MOTD",
      "zh-CHS": "语法列表MOTD"
    },
    {
      "indent": 3,
      "text": "Responses 215 Information follows (multi-line)",
      "zh-CHS": "回复215信息如下（多行）"
    },
    {
      "indent": 0,
      "text": "2.5.2. Description",
      "section_title": true,
      "zh-CHS": "2.5.2. 描述"
    },
    {
      "indent": 3,
      "text": "See Section 7.6.1 of [RFC3977] for general requirements of the LIST command.",
      "zh-CHS": "LIST命令的一般要求见[RFC3977]第7.6.1节。"
    },
    {
      "indent": 3,
      "text": "The \"motd\" contains a \"message of the day\" relevant to the news server. It is intended to provide notification and communication between the news administrator and the news user. For instance, notification of upcoming downtime or information about new facilities available on the news server can be communicated via the LIST MOTD command.",
      "zh-CHS": "“motd”包含与新闻服务器相关的“当日消息”。其目的是在新闻管理员和新闻用户之间提供通知和通信。例如，关于即将停机的通知或关于新闻服务器上可用的新设施的信息可以通过LIST MOTD命令进行通信。"
    },
    {
      "indent": 3,
      "text": "The information is returned as a multi-line data block following the 215 response code. This text is not guaranteed to be in any particular format although, like all multi-line data blocks, it is \"dot-stuffed\".",
      "zh-CHS": "该信息作为215响应代码后的多行数据块返回。虽然与所有多行数据块一样，该文本是“点填充”的，但不保证采用任何特定格式。"
    },
    {
      "indent": 3,
      "text": "The server need not return the same information if this command is used more than once in a session. It MAY indeed send a different message of the day depending on the state of the session. For instance, on a mode-switching news server, the information can be different between its transit mode and its reader mode, or between an authenticated session and an unauthenticated session.",
      "zh-CHS": "如果在会话中多次使用此命令，则服务器无需返回相同的信息。根据会话的状态，它可能确实会发送当天不同的消息。例如，在模式切换新闻服务器上，信息在传输模式和读卡器模式之间，或者在经过身份验证的会话和未经身份验证的会话之间可能不同。"
    },
    {
      "indent": 3,
      "text": "The information MUST be in UTF-8 [RFC3629].",
      "zh-CHS": "信息必须采用UTF-8[RFC3629]格式。"
    },
    {
      "indent": 3,
      "text": "The motd is not newsgroup-based, and an argument MUST NOT be specified. Otherwise, a 501 response code MUST be returned.",
      "zh-CHS": "motd不是基于新闻组的，并且不能指定参数。否则，必须返回501响应代码。"
    },
    {
      "indent": 3,
      "text": "The motd MAY be empty. If the server does not maintain the information, a 503 response code MUST be returned.",
      "zh-CHS": "motd可能是空的。如果服务器没有维护信息，则必须返回503响应代码。"
    },
    {
      "indent": 3,
      "text": "It is up to the client to decide when and how to display this message to the user. No timestamp or date of last modification is provided programmatically, although the news administrator may include one in the text of the motd. The client MAY cache a local copy or fingerprint of the motd so that it can display the message to the user only upon modification. If the client caches the information,",
      "zh-CHS": "由客户端决定何时以及如何向用户显示此消息。虽然新闻管理员可以在motd文本中包含时间戳或最后修改日期，但不会以编程方式提供时间戳或最后修改日期。客户端可以缓存motd的本地副本或指纹，以便仅在修改后才能向用户显示消息。如果客户端缓存了信息，"
    },
    {
      "indent": 3,
      "text": "it MAY take into account only the motd obtained after reaching the intended state of the session. Nonetheless, in case a privacy extension is used, the client MUST NOT cache any motd obtained before that extension took effect.",
      "zh-CHS": "它可能只考虑达到预定会话状态后获得的motd。尽管如此，如果使用隐私扩展，客户端不得缓存在该扩展生效之前获得的任何motd。"
    },
    {
      "indent": 6,
      "text": "NOTE: Though the client MAY cache the results of this command, it MUST NOT rely on the correctness of any cached results, whether from earlier in the session or from a previous session. If the motd is cached, the client SHOULD provide a way to force the cached information to be refreshed.",
      "zh-CHS": "注意：尽管客户端可以缓存此命令的结果，但它不能依赖任何缓存结果的正确性，无论是来自会话早期还是来自上一个会话。如果motd被缓存，客户端应该提供一种方法来强制刷新缓存的信息。"
    },
    {
      "indent": 0,
      "text": "2.5.3. Example",
      "section_title": true,
      "zh-CHS": "2.5.3. 实例"
    },
    {
      "indent": 3,
      "text": "Example of output:",
      "zh-CHS": "输出示例："
    },
    {
      "indent": 4,
      "text": "[C] CAPABILITIES\n[S] 101 Capability list:\n[S] VERSION 2\n[S] READER\n[S] LIST ACTIVE MOTD NEWSGROUPS\n[S] .\n[C] LIST MOTD\n[S] 215 Message of the day follows\n[S] Attention all users,\n[S]\n[S] This server will be down for scheduled upgrades on February 1st.\n[S] It should be back up by 8:00 a.m. February 2nd.\n[S] Any questions should be e-mailed to <newsmaster@example.com>.\n[S]\n[S] Apologies for the disturbance.\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2.6. LIST SUBSCRIPTIONS",
      "section_title": true,
      "zh-CHS": "2.6. 列出订阅"
    },
    {
      "indent": 0,
      "text": "2.6.1. Usage",
      "section_title": true,
      "zh-CHS": "2.6.1. 用法"
    },
    {
      "indent": 3,
      "text": "Syntax LIST SUBSCRIPTIONS [wildmat]",
      "zh-CHS": "语法列表订阅[wildmat]"
    },
    {
      "indent": 3,
      "text": "Responses 215 Subscriptions list follows (multi-line)",
      "zh-CHS": "响应215订阅列表如下（多行）"
    },
    {
      "indent": 3,
      "text": "Parameters wildmat Groups of interest",
      "zh-CHS": "感兴趣的群体的参数"
    },
    {
      "indent": 0,
      "text": "2.6.2. Description",
      "section_title": true,
      "zh-CHS": "2.6.2. 描述"
    },
    {
      "indent": 3,
      "text": "See Section 7.6.1 of [RFC3977] for general requirements of the LIST command.",
      "zh-CHS": "LIST命令的一般要求见[RFC3977]第7.6.1节。"
    },
    {
      "indent": 3,
      "text": "The \"subscriptions list\" is maintained by some NNTP servers to provide the client with a list of recommended newsgroups.",
      "zh-CHS": "“订阅列表”由一些NNTP服务器维护，以向客户端提供推荐的新闻组列表。"
    },
    {
      "indent": 3,
      "text": "The information is returned as a multi-line data block following the 215 response code. Each line of this list MUST consist of a newsgroup name. There are no leading or trailing whitespaces in a line.",
      "zh-CHS": "该信息作为215响应代码后的多行数据块返回。此列表的每一行必须包含一个新闻组名称。一行中没有前导空格或尾随空格。"
    },
    {
      "indent": 3,
      "text": "The order of newsgroups in the subscriptions list is significant: they are listed by order of importance, the first newsgroup being the most important to subscribe to.",
      "zh-CHS": "订阅列表中新闻组的顺序很重要：它们按重要性顺序列出，第一个新闻组是要订阅的最重要的新闻组。"
    },
    {
      "indent": 3,
      "text": "The same newsgroup name SHOULD NOT appear twice in the output of this command. The subscriptions list SHOULD contain only newsgroups the news server carries.",
      "zh-CHS": "同一新闻组名称不应在该命令的输出中出现两次。订阅列表应仅包含新闻服务器承载的新闻组。"
    },
    {
      "indent": 3,
      "text": "The subscriptions list is newsgroup-based, and a wildmat MAY be specified, in which case the response is limited to only the groups, if any, whose names match the wildmat. Note that the wildmat argument is a new feature in this specification, and servers that do not support CAPABILITIES or do not advertise the SUBSCRIPTIONS keyword in the LIST capability (and therefore do not conform to this specification) are unlikely to support it.",
      "zh-CHS": "订阅列表基于新闻组，可以指定wildmat，在这种情况下，响应仅限于名称与wildmat匹配的组（如果有）。请注意，wildmat参数是本规范中的一项新功能，不支持功能或不在列表功能中公布SUBSCRIPTIONS关键字（因此不符合本规范）的服务器不太可能支持它。"
    },
    {
      "indent": 3,
      "text": "The subscriptions list MAY be empty. If the server does not maintain the information, a 503 response code MUST be returned.",
      "zh-CHS": "订阅列表可能为空。如果服务器没有维护信息，则必须返回503响应代码。"
    },
    {
      "indent": 3,
      "text": "The client MAY use this information the first time it connects to the news server so as to initialize the list of default subscribed newsgroups. This list should therefore contain groups intended for new users on the news server or Usenet in general (for instance, newsgroups dedicated to testing, support, announcement, or FAQs). The client MAY present the groups in the order of appearance in the list to the user. When the subscriptions list is maintained and non-empty, the news client SHOULD use it, instead of a hard-coded default list, if any.",
      "zh-CHS": "客户端可以在第一次连接到新闻服务器时使用此信息，以便初始化默认订阅的新闻组列表。因此，此列表应包含针对新闻服务器或Usenet上的新用户的组（例如，专门用于测试、支持、公告或常见问题解答的新闻组）。客户端可以按照列表中的出现顺序向用户呈现组。当订阅列表被维护且非空时，新闻客户端应该使用它，而不是硬编码的默认列表（如果有的话）。"
    },
    {
      "indent": 0,
      "text": "2.6.3. Examples",
      "section_title": true,
      "zh-CHS": "2.6.3. 例子"
    },
    {
      "indent": 3,
      "text": "Example of output with no argument:",
      "zh-CHS": "不带参数的输出示例："
    },
    {
      "indent": 6,
      "text": "[C] CAPABILITIES\n[S] 101 Capability list:\n[S] VERSION 2\n[S] READER\n[S] LIST ACTIVE NEWSGROUPS SUBSCRIPTIONS\n[S] .\n[C] LIST SUBSCRIPTIONS\n[S] 215 List of recommended newsgroups follows\n[S] local.welcome\n[S] local.test\n[S] news.newusers.questions\n[S] news.announce.newusers\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example of output with a wildmat:",
      "zh-CHS": "使用wildmat的输出示例："
    },
    {
      "indent": 6,
      "text": "[C] LIST SUBSCRIPTIONS local.*\n[S] 215 List of recommended newsgroups follows\n[S] local.welcome\n[S] local.test\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "3. Additions to LIST ACTIVE",
      "section_title": true,
      "zh-CHS": "3. 对列表的添加处于活动状态"
    },
    {
      "indent": 3,
      "text": "This document specifies three new status field values that can be used in the answers to LIST ACTIVE: \"x\", \"j\", and \"=\" followed by the name of a newsgroup.",
      "zh-CHS": "本文档指定了三个新的状态字段值，可用于活动列表的应答：“x”、“j”和“=”后跟新闻组的名称。"
    },
    {
      "indent": 0,
      "text": "3.1. New Status Field Values",
      "section_title": true,
      "zh-CHS": "3.1. 新状态字段值"
    },
    {
      "indent": 3,
      "text": "The LIST ACTIVE command is defined in Section 7.6.3 of [RFC3977]. The fourth field of each line of this list indicates the current status of the newsgroup whose name is specified in the first field. Three status field values are defined in [RFC3977]:",
      "zh-CHS": "[RFC3977]第7.6.3节定义了LIST ACTIVE命令。此列表每行的第四个字段表示在第一个字段中指定名称的新闻组的当前状态。[RFC3977]中定义了三个状态字段值："
    },
    {
      "indent": 3,
      "text": "\"y\" Posting is permitted.",
      "zh-CHS": "允许“y”过帐。"
    },
    {
      "indent": 3,
      "text": "\"n\" Posting is not permitted.",
      "zh-CHS": "不允许使用“n”过帐。"
    },
    {
      "indent": 3,
      "text": "\"m\" Postings will be forwarded to the newsgroup moderator.",
      "zh-CHS": "“m”帖子将转发给新闻组主持人。"
    },
    {
      "indent": 3,
      "text": "This document defines three other case-sensitive status field values that can also be used:",
      "zh-CHS": "本文档定义了另外三个也可以使用的区分大小写的状态字段值："
    },
    {
      "indent": 3,
      "text": "\"x\" Postings and articles from peers are not permitted.",
      "zh-CHS": "不允许来自同行的“x”帖子和文章。"
    },
    {
      "indent": 3,
      "text": "\"j\" Only articles from peers are permitted; no articles are locally filed.",
      "zh-CHS": "“j”仅允许来自同行的物品；没有物品在当地存档。"
    },
    {
      "indent": 3,
      "text": "\"=other.group\" Only articles from peers are permitted, and are filed under the newsgroup named \"other.group\".",
      "zh-CHS": "“=other.group”仅允许来自对等方的文章，并在名为“other.group”的新闻组下存档。"
    },
    {
      "indent": 3,
      "text": "The server SHOULD use these values when these meanings are required and MUST NOT use them with any other meaning.",
      "zh-CHS": "当需要这些含义时，服务器应使用这些值，并且不得将其与任何其他含义一起使用。"
    },
    {
      "indent": 3,
      "text": "A newsgroup with status \"x\" is a newsgroup with status \"n\", except that articles from peers are not accepted. A newsgroup with status \"x\" is considered as closed: no new articles will arrive in such a group. On the contrary, articles from peers will arrive in a newsgroup with status \"n\". Local postings are not allowed in a newsgroup with either of these two status field values.",
      "zh-CHS": "状态为“x”的新闻组是状态为“n”的新闻组，但不接受来自对等方的文章。状态为“x”的新闻组被视为已关闭：此类组中不会出现新文章。相反，来自同行的文章将进入状态为“n”的新闻组。不允许在具有这两个状态字段值之一的新闻组中进行本地发布。"
    },
    {
      "indent": 3,
      "text": "A newsgroup with status \"j\" is a newsgroup with status \"y\", except that (1) local postings are not accepted, (2) articles received from a peer that are crossposted to one or more valid groups are filed only into those valid groups, and (3) articles received from a peer that are not crossposted to any valid groups are not filed into any newsgroup, but are still propagated to other peers, if appropriate.",
      "zh-CHS": "状态为“j”的新闻组是状态为“y”的新闻组，但以下情况除外：（1）不接受本地发布；（2）从对等方收到的交叉发布到一个或多个有效组的文章仅归档到这些有效组中；（3）从对等方收到的未交叉发布到任何有效组的文章不归档到任何新闻组中，但如果合适，仍会传播到其他对等方。"
    },
    {
      "indent": 6,
      "text": "NOTE: Instead of not filing at all an article posted to a newsgroup with status \"j\", a news server MAY file it under a catch-all group if no valid group is applicable. When a news server uses a catch-all group to file the articles posted to newsgroups with status \"j\", this catch-all group SHOULD be named \"junk\". (The first letter of the \"junk\" newsgroup explains why this status has been called \"j\".)",
      "zh-CHS": "注意：如果没有适用的有效组，则新闻服务器可以将发布到状态为“j”的新闻组的文章归档到“全面覆盖”组下，而不是完全不归档。当一个新闻服务器使用一个全包组来归档状态为“j”的发布到新闻组的文章时，这个全包组应该命名为“垃圾”。（垃圾新闻组的第一个字母解释了为什么这种状态被称为“j”。）"
    },
    {
      "indent": 6,
      "text": "Consequently, when a news server carries the \"junk\" newsgroup and uses it for the purpose of the \"j\" status, the \"junk\" newsgroup contains all postings not filed under another newsgroup, regardless of the status of the \"junk\" newsgroup. (However, an article posted explicitly to \"junk\" is treated according to the status of the \"junk\" newsgroup.)",
      "zh-CHS": "因此，当新闻服务器携带“垃圾”新闻组并将其用于“j”状态时，“垃圾”新闻组包含未在另一个新闻组下归档的所有帖子，而不管“垃圾”新闻组的状态如何。（但是，明确发布到“垃圾邮件”的文章将根据“垃圾邮件”新闻组的状态进行处理。）"
    },
    {
      "indent": 6,
      "text": "The \"junk\" newsgroup may be available to news readers and is often used by a news server as a way to locally store an article that will be transmitted to peers (which may carry some of the newsgroups the article was posted to even if the local server does not). In addition, instead of rejecting an article that contains",
      "zh-CHS": "“垃圾”新闻组可供新闻读者使用，新闻服务器通常将其用作本地存储文章的一种方式，该文章将被发送给对等方（即使本地服务器没有，也可能包含文章发布到的某些新闻组）。此外，与其拒绝包含"
    },
    {
      "indent": 6,
      "text": "an invalid Newsgroups header field or that is posted to newsgroups it does not carry, a news server may accept such an article and file it under the catch-all newsgroup.",
      "zh-CHS": "无效的新闻组标题字段或发布到它不包含的新闻组的字段，新闻服务器可以接受此类文章并将其归档到“捕获所有”新闻组下。"
    },
    {
      "indent": 6,
      "text": "Depending on the configuration of the news server, mentioning a newsgroup with status \"j\" is different than simply not listing the group, since articles arriving for unknown newsgroups may be rejected.",
      "zh-CHS": "根据新闻服务器的配置，提及状态为“j”的新闻组与不列出该组不同，因为到达未知新闻组的文章可能会被拒绝。"
    },
    {
      "indent": 3,
      "text": "When the status field value begins with an equal sign (\"=\" or %x3D), a newsgroup name on the news server MUST immediately follow the sign. If the status of \"foo.bar\" is \"=other.group\", it means that \"foo.bar\" is an alias for \"other.group\". These two newsgroups are distinct; they do not share their articles or their article numbers. Local postings to \"foo.bar\" are not allowed, but articles from peers are accepted for \"foo.bar\" and filed into \"other.group\", regardless of the status of \"other.group\". The contents of their Newsgroups header fields MUST NOT be altered.",
      "zh-CHS": "当状态字段值以等号（“=”或%x3D）开头时，新闻服务器上的新闻组名称必须紧跟在该符号之后。如果“foo.bar”的状态为“=other.group”，则表示“foo.bar”是“other.group”的别名。这两个新闻组是不同的；他们不共享他们的文章或文章编号。不允许本地发布到“foo.bar”，但来自同行的文章将被接受为“foo.bar”，并归档到“other.group”，而不管其状态为“other.group”。不得更改其新闻组标题字段的内容。"
    },
    {
      "indent": 3,
      "text": "Alias groups are typically used during a transition between two newsgroups, including but not limited to a renaming of a group, or a correction of a misspelled group name.",
      "zh-CHS": "别名组通常在两个新闻组之间的转换期间使用，包括但不限于重命名组或更正拼写错误的组名。"
    },
    {
      "indent": 3,
      "text": "The status of the newsgroup an alias points to MUST NOT be taken into account when an article arrives in an alias newsgroup. In particular, it means that unapproved articles arriving from peers in an alias pointing to a moderated newsgroup are accepted and filed into this moderated newsgroup. Therefore, an alias SHOULD NOT point to a moderated newsgroup, since it allows bypassing of the moderation.",
      "zh-CHS": "当文章到达别名新闻组时，不得考虑别名指向的新闻组的状态。特别是，这意味着，来自别名中指向受审核新闻组的对等方的未经批准的文章将被接受并归档到此受审核新闻组中。所以，别名不应该指向受审核的新闻组，因为它允许绕过审核。"
    },
    {
      "indent": 3,
      "text": "An alias SHOULD NOT point to itself or another alias group. The newsgroup an alias points to SHOULD exist on the news server, and be visible to any client that can see the original group. However, when a client issues a LIST ACTIVE command with a wildmat including the original group, the newsgroup it points to is not listed in the response (unless of course the second newsgroup also matches the wildmat).",
      "zh-CHS": "别名不应指向自身或其他别名组。别名指向的新闻组应该存在于新闻服务器上，并且对任何可以看到原始组的客户端都可见。但是，当客户端使用包含原始组的wildmat发出LIST ACTIVE命令时，它指向的新闻组不会在响应中列出（当然，除非第二个新闻组也与wildmat匹配）。"
    },
    {
      "indent": 6,
      "text": "NOTE: If a server files newsgroups with status \"j\" into \"junk\", a newsgroup with status \"j\" and a newsgroup with status \"=junk\" are different. An article fed by a peer, and crossposted to a group with status \"j\", will result in the article being filed only in \"junk\" if there are no other groups with which to file it, or otherwise only in other valid newsgroups it is crossposted to. On the other hand, an article fed by a peer, and crossposted to a group with status \"=junk\", will result in the article being filed in \"junk\" and in other valid newsgroups it is crossposted to.",
      "zh-CHS": "注意：如果服务器将状态为“j”的新闻组归档为“垃圾邮件”，则状态为“j”的新闻组和状态为“=垃圾邮件”的新闻组是不同的。由对等方提供的文章，并交叉发布到状态为“j”的组中，如果没有其他组可提交该文章，或仅在交叉发布到的其他有效新闻组中提交，则该文章将仅在“垃圾邮件”中提交。另一方面，由对等方提供并交叉发布到状态为“=垃圾”的组的文章将导致该文章被归档到“垃圾”中，并被交叉发布到其他有效的新闻组中。"
    },
    {
      "indent": 3,
      "text": "The following table summarizes what usually happens to an article posted to only the newsgroup \"foo.bar\", depending on its status field value on the news server:",
      "zh-CHS": "下表总结了仅发布到新闻组“foo.bar”的文章通常发生的情况，具体取决于其在新闻服务器上的状态字段值："
    },
    {
      "indent": 3,
      "text": "+---------------+------------+-----------+------------+-------------+\n| Status field  | Accepted   | Accepted  | Moderation | Destination |\n| value of      | if local   | from      | needed?    | if accepted |\n| \"foo.bar\"     | posting?   | peers?    |            |             |\n+---------------+------------+-----------+------------+-------------+\n| y             | Yes        | Yes       | No         | foo.bar     |\n| n             | No         | Yes       | No         | foo.bar     |\n| m             | Yes        | Yes       | Yes        | foo.bar     |\n| x             | No         | No        | No         |             |\n| j             | No         | Yes       | No         | junk (if    |\n|               |            |           |            | filed)      |\n| =other.group  | No         | Yes       | No         | other.group |\n+---------------+------------+-----------+------------+-------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The following table summarizes what usually happens to an article crossposted to the newsgroup \"foo.bar\" and a valid newsgroup \"misc.test\" (whose status field is \"y\") known by the news server, depending on the status field value of \"foo.bar\" on the news server:",
      "zh-CHS": "下表总结了交叉发布到新闻组“foo.bar”和新闻服务器已知的有效新闻组“misc.test”（其状态字段为“y”）的文章通常发生的情况，具体取决于新闻服务器上“foo.bar”的状态字段值："
    },
    {
      "indent": 3,
      "text": "+---------------+-----------+-----------+------------+--------------+\n| Status field  | Accepted  | Accepted  | Moderation | Destination  |\n| value of      | if local  | from      | needed?    | if accepted  |\n| \"foo.bar\"     | posting?  | peers?    |            |              |\n+---------------+-----------+-----------+------------+--------------+\n| y             | Yes       | Yes       | No         | foo.bar,     |\n|               |           |           |            | misc.test    |\n| n             | No        | Yes       | No         | foo.bar,     |\n|               |           |           |            | misc.test    |\n| m             | Yes       | Yes       | Yes        | foo.bar,     |\n|               |           |           |            | misc.test    |\n| x             | No        | Yes       | No         | misc.test    |\n| j             | No        | Yes       | No         | misc.test    |\n| =other.group  | No        | Yes       | No         | other.group, |\n|               |           |           |            | misc.test    |\n+---------------+-----------+-----------+------------+--------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "NOTE: The status of a newsgroup only indicates how articles arriving for that newsgroup are normally processed; news servers MAY provide clients with special privileges to allow or disallow some rights in these newsgroups. This specification defines neither these rights nor whether or not articles posted to these groups should be propagated to other peers.",
      "zh-CHS": "注意：新闻组的状态仅表示到达该新闻组的文章的正常处理方式；新闻服务器可以为客户端提供特权，允许或不允许这些新闻组中的某些权限。此规范既不定义这些权限，也不定义发布到这些组的文章是否应传播到其他对等方。"
    },
    {
      "indent": 0,
      "text": "3.2. Examples",
      "section_title": true,
      "zh-CHS": "3.2. 例子"
    },
    {
      "indent": 3,
      "text": "Example of an article posted to an alias group by a peer:",
      "zh-CHS": "对等方将文章发布到别名组的示例："
    },
    {
      "indent": 6,
      "text": "[C] LIST ACTIVE\n[S] 215 List of newsgroups follows\n[S] foo.bar 21 12 y\n[S] misc.test 3002322 3000234 =foo.bar\n[S] .\n[C] IHAVE <for.misc.test@example.com>\n[S] 335 Send it; end with <CR-LF>.<CR-LF>\n[C] Path: demo!.POSTED.somewhere!not-for-mail\n[C] From: \"Demo User\" <nobody@example.com>\n[C] Newsgroups: misc.test\n[C] Subject: I am just a test article\n[C] Date: 18 Oct 2008 16:02:45 +0200\n[C] Organization: An example, Paris, FR.\n[C] Message-ID: <for.misc.test@example.com>\n[C] MIME-Version: 1.0\n[C]\n[C] This is just a test article.\n[C] .\n[S] 235 Article transferred OK\n[C] LIST ACTIVE\n[S] 215 List of newsgroups follows\n[S] foo.bar 22 12 y\n[S] misc.test 3002322 3000234 =foo.bar\n[S] .\n[C] HDR Xref <for.misc.test@example.com>\n[S] 225 Header information follows\n[S] 0 news.example.com foo.bar:22\n[S] .\n[C] HDR Newsgroups <for.misc.test@example.com>\n[S] 225 Header information follows\n[S] 0 misc.test\n[S] .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The Newsgroups header field of this article is kept untouched. This article is filed under \"foo.bar\" even though it has originally been posted to the newsgroup \"misc.test\". Yet, it still propagates to peers that have been configured to receive articles posted to \"misc.text\".",
      "zh-CHS": "本文的新闻组标题字段保持不变。这篇文章是在“foo.bar”下归档的，尽管它最初是发布到新闻组“misc.test”上的。然而，它仍然会传播到配置为接收发布到“misc.text”的文章的对等方。"
    },
    {
      "indent": 3,
      "text": "Example of an article locally posted to an alias group:",
      "zh-CHS": "本地发布到别名组的文章示例："
    },
    {
      "indent": 6,
      "text": "[C] LIST ACTIVE\n[S] 215 List of newsgroups follows\n[S] foo.bar 22 12 y\n[S] misc.test 3002322 3000234 =foo.bar\n[S] .\n[C] POST\n[S] 340 Input article; end with <CR-LF>.<CR-LF>\n[C] From: \"Demo User\" <nobody@example.com>\n[C] Newsgroups: misc.test\n[C] Subject: I am just a test article\n[C] MIME-Version: 1.0\n[C]\n[C] This is just a test article.\n[C] .\n[S] 441 Newsgroup \"misc.test\" has been renamed to \"foo.bar\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The article is rejected, with a detailed error.",
      "zh-CHS": "这篇文章被拒绝，但有一个详细的错误。"
    },
    {
      "indent": 0,
      "text": "4. Augmented BNF Syntax for These Additions to the LIST Command",
      "section_title": true,
      "zh-CHS": "4. 增加了这些添加到LIST命令的BNF语法"
    },
    {
      "indent": 3,
      "text": "This section describes the formal syntax of the new LIST variants defined in this document using [RFC5234]. It extends the syntax in Section 9 of [RFC3977], and non-terminals not defined in this document are defined there. The [RFC3977] ABNF should be imported first, before attempting to validate these rules.",
      "zh-CHS": "本节介绍本文档中使用[RFC5234]定义的新列表变量的正式语法。它扩展了[RFC3977]第9节中的语法，本文件中未定义的非终端在此定义。在尝试验证这些规则之前，应首先导入[RFC3977]ABNF。"
    },
    {
      "indent": 0,
      "text": "4.1. Commands",
      "section_title": true,
      "zh-CHS": "4.1. 命令"
    },
    {
      "indent": 3,
      "text": "This syntax extends the non-terminal <list-arguments>, which represents the variants of the LIST command.",
      "zh-CHS": "此语法扩展了非终端<list arguments>，它表示list命令的变体。"
    },
    {
      "indent": 5,
      "text": "; counts list-arguments =/ \"COUNTS\" [WS wildmat]",
      "zh-CHS": "; 计数列表参数=/“计数”[WS-wildmat]"
    },
    {
      "indent": 5,
      "text": "; distributions, moderators, motd\nlist-arguments =/ \"DISTRIBUTIONS\" / \"MODERATORS\" / \"MOTD\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "; subscriptions list-arguments =/ \"SUBSCRIPTIONS\" [WS wildmat]",
      "zh-CHS": "; 订阅列表参数=/“订阅”[WS-wildmat]"
    },
    {
      "indent": 0,
      "text": "4.2. Responses",
      "section_title": true,
      "zh-CHS": "4.2. 响应"
    },
    {
      "indent": 3,
      "text": "This syntax extends the non-terminals <newsgroup-status> and <list-content>, which represent the status field value returned by the LIST ACTIVE command and the response contents for the LIST command, respectively.",
      "zh-CHS": "此语法扩展了非终端<newsgroup status>和<list content>，它们分别表示list ACTIVE命令返回的状态字段值和list命令的响应内容。"
    },
    {
      "indent": 5,
      "text": "; active\nnewsgroup-status =/ newsgroup-alias /\n      %x78 / %x6a  ; case-sensitive \"x\" and \"j\"\nnewsgroup-alias =  \"=\" newsgroup-name",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "; counts list-content =/ list-counts-content list-counts-content = *(newsgroup-name 3(SPA article-number) SPA newsgroup-status CRLF)",
      "zh-CHS": "; counts list content=/list counts content list counts content=*（新闻组名称3（SPA文章编号）SPA新闻组状态CRLF）"
    },
    {
      "indent": 5,
      "text": "; distributions list-content =/ list-distributions-content list-distributions-content = *(distribution WS distribution-description CRLF) distribution-description = U-TEXT",
      "zh-CHS": "; 分发列表内容=/列表分发内容列表分发内容=*（分发WS分发说明CRLF）分发说明=U-TEXT"
    },
    {
      "indent": 5,
      "text": "; moderators\nlist-content =/ list-moderators-content\nlist-moderators-content =\n      *(wildmat \":\" moderators-address CRLF)\nmoderators-address = S-TEXT",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "; motd\nlist-content =/ list-motd-content\nlist-motd-content = *(*U-CHAR CRLF)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "; subscriptions\nlist-content =/ list-subscriptions-content\nlist-subscriptions-content = *(newsgroup-name CRLF)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5. Internationalization Considerations",
      "section_title": true,
      "zh-CHS": "5. 国际化考虑"
    },
    {
      "indent": 3,
      "text": "No new internationalization considerations are introduced by this extension, beyond those already described in the core specification [RFC3977].",
      "zh-CHS": "除了核心规范[RFC3977]中已经描述的内容外，此扩展没有引入新的国际化注意事项。"
    },
    {
      "indent": 3,
      "text": "In particular, newsgroup names SHOULD be restricted to US-ASCII [ASCII] until a successor to [RFC5536] standardizes another approach.",
      "zh-CHS": "特别是，在[RFC5536]的继任者将另一种方法标准化之前，新闻组名称应限制为US-ASCII[ASCII]。"
    },
    {
      "indent": 3,
      "text": "Distribution descriptions and the message of the day MUST be in UTF-8 [RFC3629].",
      "zh-CHS": "分发说明和当天的消息必须采用UTF-8[RFC3629]格式。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "No new security considerations are introduced by this extension, beyond those already described in the core specification [RFC3977] and the Netnews Architecture and Protocols specification [RFC5537] (especially distribution leakage and e-mail Denial of Service during the moderation process).",
      "zh-CHS": "除了核心规范[RFC3977]和Netnews体系结构和协议规范[RFC5537]中已经描述的安全注意事项外，此扩展没有引入新的安全注意事项（特别是在调节过程中的分发泄漏和电子邮件拒绝服务）。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This section gives a formal definition of this extension as required by Section 3.3.3 of [RFC3977] for the IANA registry. It extends the LIST capability label defined in Section 7.6 of [RFC3977].",
      "zh-CHS": "本节根据[RFC3977]第3.3.3节对IANA注册表的要求，给出了该扩展的正式定义。它扩展了[RFC3977]第7.6节中定义的列表功能标签。"
    },
    {
      "indent": 3,
      "text": "o This extension provides additional keywords to the pre-existing LIST capability defined in Section 7.6 of [RFC3977]. New status field values are also added to the ACTIVE variant of the LIST command.",
      "zh-CHS": "o 此扩展为[RFC3977]第7.6节中定义的现有列表功能提供了附加关键字。新的状态字段值也添加到LIST命令的活动变量中。"
    },
    {
      "indent": 3,
      "text": "o The capability label that this extension extends is \"LIST\".",
      "zh-CHS": "o 此扩展扩展扩展的功能标签是“列表”。"
    },
    {
      "indent": 3,
      "text": "o This extension adds five optional arguments to the \"LIST\" capability label: \"COUNTS\", \"DISTRIBUTIONS\", \"MODERATORS\", \"MOTD\", and \"SUBSCRIPTIONS\", indicating which new variants of the LIST command are supported. Consequently, this extension associates these new arguments with the pre-existing \"LIST\" NNTP command.",
      "zh-CHS": "o 此扩展将五个可选参数添加到“列表”功能标签：“计数”、“分发”、“版主”、“MOTD”和“订阅”，指示支持哪些新的LIST命令变体。因此，此扩展将这些新参数与预先存在的“LIST”NNTP命令相关联。"
    },
    {
      "indent": 3,
      "text": "o This extension defines five new commands, LIST COUNTS, LIST DISTRIBUTIONS, LIST MODERATORS, LIST MOTD, and LIST SUBSCRIPTIONS, whose behavior, arguments, and responses are defined in Sections 2.2, 2.3, 2.4, 2.5, and 2.6, respectively.",
      "zh-CHS": "o 此扩展定义了五个新命令：列表计数、列表分发、列表主持人、列表MOTD和列表订阅，其行为、参数和响应分别在第2.2、2.3、2.4、2.5和2.6节中定义。"
    },
    {
      "indent": 3,
      "text": "o This extension does not associate any new responses with pre-existing NNTP commands.",
      "zh-CHS": "o 此扩展不会将任何新响应与预先存在的NNTP命令相关联。"
    },
    {
      "indent": 3,
      "text": "o This extension does not affect the maximum length of commands or initial response lines.",
      "zh-CHS": "o 此扩展不影响命令或初始响应行的最大长度。"
    },
    {
      "indent": 3,
      "text": "o This extension does not alter pipelining. The LIST COUNTS, LIST DISTRIBUTIONS, LIST MODERATORS, LIST MOTD, and LIST SUBSCRIPTIONS commands can be pipelined.",
      "zh-CHS": "o 此扩展不会改变管道。列表计数、列表分发、列表管理员、列表MOTD和列表订阅命令可以通过管道传输。"
    },
    {
      "indent": 3,
      "text": "o Use of this extension does not alter the capabilities list.",
      "zh-CHS": "o 使用此扩展不会更改功能列表。"
    },
    {
      "indent": 3,
      "text": "o This extension does not cause any pre-existing command to produce a 401, 480, or 483 response.",
      "zh-CHS": "o 此扩展不会导致任何预先存在的命令生成401、480或483响应。"
    },
    {
      "indent": 3,
      "text": "o This extension is unaffected by any use of the MODE READER command.",
      "zh-CHS": "o 此扩展不受任何使用模式读取器命令的影响。"
    },
    {
      "indent": 3,
      "text": "o This extension does not affect the overall behavior of a server or client other than via the new commands.",
      "zh-CHS": "o 除了通过新命令之外，此扩展不会影响服务器或客户端的总体行为。"
    },
    {
      "indent": 3,
      "text": "o Published Specification: This document.",
      "zh-CHS": "o 已发布规范：本文件。"
    },
    {
      "indent": 3,
      "text": "o Contact for Further Information: Author of this document.",
      "zh-CHS": "o 更多信息请联系：本文件作者。"
    },
    {
      "indent": 3,
      "text": "o Change Controller: IESG <iesg@ietf.org>.",
      "zh-CHS": "o 更改控制器：IESG<iesg@ietf.org>."
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "The author gratefully acknowledges the comments and additional information provided by Russ Allbery, Urs Janssen, Antti-Juhani Kaijanaho, Alexey Melnikov, Peter Saint-Andre, Dieter Stussy, and Sean Turner on this document.",
      "zh-CHS": "作者感谢Russ Allbery、Urs Janssen、Antti Juhani Kaijanaho、Alexey Melnikov、Peter Saint Andre、Dieter Stussy和Sean Turner就本文件提供的评论和补充信息。"
    },
    {
      "indent": 3,
      "text": "The author would particularly like to thank Jeffrey M. Vinocur for having reread, improved, and patiently fixed the English wording and the quality of this document.",
      "zh-CHS": "作者特别感谢Jeffrey M.Vinocur重读、改进并耐心地修改了本文件的英文措辞和质量。"
    },
    {
      "indent": 3,
      "text": "Special thanks are due to:",
      "zh-CHS": "特别感谢："
    },
    {
      "indent": 6,
      "text": "Stan Barber, whose text in [RFC2980] served as the initial basis for the DISTRIBUTIONS and SUBSCRIPTIONS variants of the LIST command.",
      "zh-CHS": "Stan Barber，其[RFC2980]中的文本作为LIST命令的分发和订阅变体的初始基础。"
    },
    {
      "indent": 6,
      "text": "Brian Hernacki, whose text in [NNTP_LIST] served as the initial basis for the MOTD and also the SUBSCRIPTIONS variants of the LIST command.",
      "zh-CHS": "Brian Hernacki在[NNTP_LIST]中的文本是MOTD的初始基础，也是LIST命令的订阅变体。"
    },
    {
      "indent": 6,
      "text": "The authors of the documentation of a few sample files of the InterNetNews news server (\"active\", \"distributions\", \"moderators\", \"motd.news\", and \"subscriptions\"): Russ Allbery, Bettina Fink, Rich Salz, and a few other people to whom I am also grateful.",
      "zh-CHS": "InterNetNews新闻服务器的几个示例文件（“活动”、“分发”、“版主”、“motd.news”和“订阅”）的文档作者：Russ Allbery、Bettina Fink、Rich Salz和其他一些我也很感激的人。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "zh-CHS": "[RFC3629]Yergeau，F.，“UTF-8，ISO 10646的转换格式”，STD 63，RFC 3629，2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3977] Feather, C., \"Network News Transfer Protocol (NNTP)\", RFC 3977, October 2006.",
      "zh-CHS": "[RFC3977]Feather，C.，“网络新闻传输协议（NNTP）”，RFC3977，2006年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "zh-CHS": "[RFC5234]Crocker，D.和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5322] Resnick, P., Ed., \"Internet Message Format\", RFC 5322, October 2008.",
      "zh-CHS": "[RFC5322]Resnick，P.，Ed.“互联网信息格式”，RFC5222008年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[ASCII] American National Standards Institute, \"Coded Character Sets - 7-Bit American Standard Code for Information Interchange (7-Bit ASCII), ANSI X3.4\", 1986.",
      "zh-CHS": "[ASCII]美国国家标准协会，“编码字符集-信息交换用7位美国标准代码（7位ASCII）”，ANSI X3.4，1986年。"
    },
    {
      "indent": 3,
      "text": "[NNTP_LIST] Hernacki, B., \"NNTP LIST Additions\", Work in Progress, July 1997.",
      "zh-CHS": "[NNTP_清单]Hernacki，B.，“NNTP清单增补”，正在进行的工作，1997年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC2980] Barber, S., \"Common NNTP Extensions\", RFC 2980, October 2000.",
      "zh-CHS": "[RFC2980]Barber，S.，“通用NNTP扩展”，RFC 29802000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5536] Murchison, K., Lindsey, C., and D. Kohn, \"Netnews Article Format\", RFC 5536, November 2009.",
      "zh-CHS": "[RFC5536]Murchison，K.，Lindsey，C.，和D.Kohn，“网络新闻文章格式”，RFC5362009年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5537] Allbery, R. and C. Lindsey, \"Netnews Architecture and Protocols\", RFC 5537, November 2009.",
      "zh-CHS": "[RFC5537]Allbery，R.和C.Lindsey，“网络新闻体系结构和协议”，RFC5372009年11月。"
    },
    {
      "indent": 3,
      "text": "[USEAGE] Lindsey, C., \"Usenet Best Practice\", Work in Progress, March 2005.",
      "zh-CHS": "[USEAGE]Lindsey，C.，“Usenet最佳实践”，正在进行的工作，2005年3月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Julien Elie 13 rue Marx Dormoy Noisy-le-Grand 93160 France",
      "zh-CHS": "朱利安·埃利马克思街13号大酒店93160法国"
    },
    {
      "indent": 3,
      "text": "EMail: julien@trigofacile.com\nURI:   http://www.trigofacile.com/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}