{
  "title": {
    "text": "RFC 6430: Email Feedback Report Type Value: not-spam",
    "zh-CHS": "RFC 6430"
  },
  "number": 6430,
  "created_at": "2021-11-06 10:12:45.464390+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                             K. Li\nRequest for Comments: 6430                                      B. Leiba\nCategory: Standards Track                            Huawei Technologies\nISSN: 2070-1721                                            November 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Email Feedback Report Type Value: not-spam",
      "zh-CHS": "电子邮件反馈报告类型值：非垃圾邮件"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a new Abuse Reporting Format (ARF) feedback report type value: \"not-spam\". It can be used to report an email message that was mistakenly marked as spam.",
      "zh-CHS": "本文档定义了一个新的滥用报告格式（ARF）反馈报告类型值：“非垃圾邮件”。它可用于报告错误标记为垃圾邮件的电子邮件。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6430.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6430."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Discussion .................................................2\n2. Feedback Report Type: not-spam ..................................3\n3. Example .........................................................3\n4. Security Considerations .........................................5\n5. IANA Considerations .............................................6\n6. Acknowledgements ................................................6\n7. References ......................................................6\n   7.1. Normative References .......................................6\n   7.2. Informative References .....................................6",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "In RFC 5965 [RFC5965], an Abuse Reporting Format (ARF) is defined for reporting email abuse. Currently, two feedback report types are defined that are related to the spam problem and that can be used to report abusive or fraudulent email messages:",
      "zh-CHS": "在RFC 5965[RFC5965]中，定义了滥用报告格式（ARF），用于报告电子邮件滥用。目前，定义了两种与垃圾邮件问题相关的反馈报告类型，可用于报告滥用或欺诈性电子邮件："
    },
    {
      "indent": 3,
      "text": "o abuse: indicates unsolicited email or some other kind of email abuse.",
      "zh-CHS": "o 滥用：表示未经请求的电子邮件或其他类型的电子邮件滥用。"
    },
    {
      "indent": 3,
      "text": "o fraud: indicates some kind of fraud or phishing activity.",
      "zh-CHS": "o 欺诈：表示某种欺诈或网络钓鱼活动。"
    },
    {
      "indent": 3,
      "text": "This specification defines a new feedback report type: \"not-spam\". It can be used to report a message that was mistakenly marked as spam.",
      "zh-CHS": "该规范定义了一种新的反馈报告类型：“非垃圾邮件”。它可用于报告错误标记为垃圾邮件的邮件。"
    },
    {
      "indent": 0,
      "text": "1.1. Discussion",
      "section_title": true,
      "zh-CHS": "1.1. 讨论"
    },
    {
      "indent": 3,
      "text": "In some cases, the email client receives an email message that was incorrectly tagged as spam, perhaps by the email system, or accidentally by the user. The email client accepts the end user's \"not-spam\" report instruction, retrieves information related to the message, and reports this email as not-spam to the email operator. When the email operator receives the report, it can determine what action is appropriate for the particular message and user. (The requirement for a not-spam report type is from the Open Mobile Alliance (OMA) Spam Report Requirement Document [OMA-SpamRep-RD].)",
      "zh-CHS": "在某些情况下，电子邮件客户端收到的电子邮件可能被电子邮件系统错误地标记为垃圾邮件，也可能是用户意外地将其标记为垃圾邮件。电子邮件客户端接受最终用户的“非垃圾邮件”报告指令，检索与邮件相关的信息，并将此电子邮件作为非垃圾邮件报告给电子邮件操作员。当电子邮件操作员收到报告时，它可以确定适合特定消息和用户的操作。（非垃圾邮件报告类型的要求来自开放移动联盟（OMA）垃圾邮件报告要求文档[OMA SpamRep RD]。）"
    },
    {
      "indent": 3,
      "text": "For example, in response to a \"not-spam\" report, the email system can remove the spam tag or otherwise reclassify the message, possibly preventing similar email for this user from being marked as spam in the future. The report can be used to adjust the training of an automated classifier. After processing the report, the email",
      "zh-CHS": "例如，为了响应“非垃圾邮件”报告，电子邮件系统可以删除垃圾邮件标签或以其他方式重新分类邮件，可能会防止该用户的类似邮件在将来被标记为垃圾邮件。该报告可用于调整自动分类器的训练。处理完报告后，电子邮件"
    },
    {
      "indent": 3,
      "text": "operator might send a notification to the email client about the processing result (for example, by moving the message from one mailbox to another, such as from \"Junk\" to \"Inbox\").",
      "zh-CHS": "操作员可能会向电子邮件客户端发送关于处理结果的通知（例如，通过将邮件从一个邮箱移动到另一个邮箱，例如从“垃圾邮件”移动到“收件箱”）。"
    },
    {
      "indent": 3,
      "text": "In most cases, \"not-spam\" reports will probably not be taken on their own, but will be considered along with other information, analysis of the message, etc. Because different users have different needs and different views of what constitutes spam, reports from one user might or might not be applicable to others. And because users might sometimes press a \"report not spam\" button accidentally, immediate strong action, such as marking all similar messages as \"good\" based on a single report, is probably not the right approach. Recipients of \"not-spam\" reports need to consider what's right in their environments.",
      "zh-CHS": "在大多数情况下，“非垃圾邮件”报告可能不会自行处理，但会与其他信息、邮件分析等一起考虑。由于不同用户对垃圾邮件的构成有不同的需求和观点，一个用户的报告可能适用于其他用户，也可能不适用于其他用户。而且，由于用户有时可能会意外按下“report not spam”（报告非垃圾邮件）按钮，因此立即采取强有力的行动，例如根据单个报告将所有类似的消息标记为“良好”，可能不是正确的方法。“垃圾邮件”报告的接收者需要考虑在他们的环境中什么是正确的。"
    },
    {
      "indent": 3,
      "text": "There are anti-spam systems that use (non-standard) \"not spam\" feedback today. All of them take the reports and mix them with other spam reports and other data, using their own algorithms, to determine appropriate action. In no case do the existing systems use a \"not spam\" report as an immediate, automatic override.",
      "zh-CHS": "现在有反垃圾邮件系统使用（非标准）“非垃圾邮件”反馈。他们都会使用自己的算法将这些报告与其他垃圾邮件报告和其他数据混合，以确定适当的操作。在任何情况下，现有系统都不会使用“非垃圾邮件”报告作为即时自动覆盖。"
    },
    {
      "indent": 3,
      "text": "The feedback types \"abuse\" and \"not-spam\" can be taken as opposites. A mistaken \"not-spam\" report could be countermanded by a subsequent \"abuse\" report from the same user, and an operator could consider collected reports of \"abuse\" and \"not-spam\" in making future assessments.",
      "zh-CHS": "反馈类型“滥用”和“非垃圾邮件”可以视为相反。一个错误的“不垃圾邮件”报告可能会被来自同一用户的后续“滥用”报告所抵消，并且操作员可以考虑收集“滥用”和“不垃圾邮件”的报告来进行未来的评估。"
    },
    {
      "indent": 0,
      "text": "2. Feedback Report Type: not-spam",
      "section_title": true,
      "zh-CHS": "2. 反馈报告类型：非垃圾邮件"
    },
    {
      "indent": 3,
      "text": "This document defines a new feedback report type, \"not-spam\", which extends the Email Feedback Reports specification [RFC5965].",
      "zh-CHS": "本文档定义了一种新的反馈报告类型“非垃圾邮件”，它扩展了电子邮件反馈报告规范[RFC5965]。"
    },
    {
      "indent": 3,
      "text": "In the first MIME part of the feedback report message, the end user or the email client can add information to indicate why the message is not considered as spam -- for example, because the originator or its domain is well known.",
      "zh-CHS": "在反馈报告消息的第一个MIME部分中，最终用户或电子邮件客户端可以添加信息，以说明消息不被视为垃圾邮件的原因——例如，因为发起者或其域是众所周知的。"
    },
    {
      "indent": 0,
      "text": "3. Example",
      "section_title": true,
      "zh-CHS": "3. 实例"
    },
    {
      "indent": 3,
      "text": "In the example, Joe, a pharmaceuticals sales representative, has received a message about discount pharmaceuticals. Because that is a frequent subject of spam email, the message has been marked as spam -- incorrectly, in this case. Joe has reported it as \"not-spam\", and this is an example of the report, shortened (the \"[...etc...]\" part) for presentation here.",
      "zh-CHS": "在本例中，药品销售代表Joe收到了一条关于药品折扣的消息。因为这是垃圾邮件的一个常见主题，所以该邮件被标记为垃圾邮件——在本例中是错误的。Joe已将其报告为“非垃圾邮件”，这是报告的一个示例，在这里缩短了（“[…等…]”部分）。"
    },
    {
      "indent": 3,
      "text": "Note that the message has been signed using DomainKeys Identified Mail (DKIM) [RFC6376] -- a good security practice as suggested in Section 8.2 of RFC 5965 [RFC5965].",
      "zh-CHS": "请注意，已使用域密钥标识邮件（DKIM）[RFC6376]对消息进行了签名，这是RFC 5965[RFC5965]第8.2节中建议的良好安全实践。"
    },
    {
      "indent": 6,
      "text": "DKIM-Signature: v=1; a=rsa-sha256; s=abuse; d=example.com;\n  c=simple/simple; q=dns/txt; i=abusedesk@example.com;\n  h=From:Date:Subject:To:Message-ID:MIME-Version:Content-Type;\n  bh=iF4dMNYs/KepE0HuwfukJCDyjkduUzZFiaHqO9DMIPU=;\n  b=e+BF8DCHFGqCp7/pExleNz7pVaLEoT+uWj/8H9DoZpxFI1vNnCTDu14w5v\n    ze4mqJkldudVI0JspsYHTYeomhPklCV4F95GfwpM5W+ziUOv7AySTfygPW\n    EerczqZwAK88//oaYCFXq3XV9T/z+zlLp3rrirKGmCMCPPcbdSGv/Eg=\nFrom: <abusedesk@example.com>\nDate: Thu, 8 Mar 2005 17:40:36 EDT\nSubject: FW: Discount on pharmaceuticals\nTo: <abuse@example.net>\nMessage-ID: <20030712040037.46341.5F8J@example.com>\nMIME-Version: 1.0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Content-Type: multipart/report; report-type=feedback-report;\n     boundary=\"part1_13d.2e68ed54_boundary\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "--part1_13d.2e68ed54_boundary\nContent-Type: text/plain; charset=\"US-ASCII\"\nContent-Transfer-Encoding: 7bit",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "This is an email abuse report for an email message received from IP 192.0.2.1 on Thu, 8 Mar 2005 14:00:00 EDT. For more information about this format please see http://tools.ietf.org/html/rfc5965 Comment: I sell pharmaceuticals, so this is not spam for me.",
      "zh-CHS": "这是2005年3月8日星期四美国东部夏令时14:00:00从IP 192.0.2.1收到的电子邮件滥用报告。有关此格式的更多信息，请参阅http://tools.ietf.org/html/rfc5965 评论：我卖药品，所以这对我来说不是垃圾邮件。"
    },
    {
      "indent": 6,
      "text": "--part1_13d.2e68ed54_boundary Content-Type: message/feedback-report",
      "zh-CHS": "--第1部分\\u 13d.2e68ed54 \\u边界内容类型：消息/反馈报告"
    },
    {
      "indent": 6,
      "text": "Feedback-Type: not-spam User-Agent: SomeGenerator/1.0 Version: 1",
      "zh-CHS": "反馈类型：非垃圾邮件用户代理：SomeGenerator/1.0版本：1"
    },
    {
      "indent": 6,
      "text": "--part1_13d.2e68ed54_boundary Content-Type: message/rfc822 Content-Disposition: inline",
      "zh-CHS": "--第1部分\\u 13d.2e68ed54 \\u边界内容类型：消息/rfc822内容处置：内联"
    },
    {
      "indent": 6,
      "text": "Received: from mailserver.example.net\n     (mailserver.example.net [192.0.2.1])\n     by example.com with ESMTP id M63d4137594e46;\n     Thu, 08 Mar 2005 14:00:00 -0400\nFrom: <someone@example.net>\nTo: <Undisclosed Recipients>\nSubject: Discount on pharmaceuticals\nMIME-Version: 1.0\nContent-type: text/plain\nMessage-ID: 8787KJKJ3K4J3K4J3K4J3.mail@example.net\nDate: Thu, 02 Sep 2004 12:31:03 -0500",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Hi, Joe. I got a lead on a source for discounts on pharmaceuticals, and I thought you might be interested. [...etc...] --part1_13d.2e68ed54_boundary--",
      "zh-CHS": "嗨，乔。我得到了一个药品折扣来源的线索，我想你可能会感兴趣。[…等]-第1部分\\u 13d.2e68ed54 \\u边界--"
    },
    {
      "indent": 24,
      "text": "Example 1: not-spam Report",
      "zh-CHS": "示例1：非垃圾邮件报告"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "All of the security considerations from the Email Feedback Reports specification [RFC5965] are inherited here. In addition, the Email Feedback Reports Applicability Statement [MARF-AS] contains important information about trust relationships and other security- and integrity-related aspects of accepting abuse feedback.",
      "zh-CHS": "此处继承了电子邮件反馈报告规范[RFC5965]中的所有安全注意事项。此外，电子邮件反馈报告适用性声明[MARF-AS]包含有关信任关系以及接受滥用反馈的其他安全和完整性相关方面的重要信息。"
    },
    {
      "indent": 3,
      "text": "In particular, not-spam reports will likely be used in an attack on a filtering system, reporting true spam as \"not-spam\". Even in absence of malice, some not-spam reports might be made in error, or will only apply to the user sending the report. Operators need to be careful in trusting such reports, beyond their applicability to the specific user in question.",
      "zh-CHS": "特别是，非垃圾邮件报告可能会用于攻击过滤系统，将真实垃圾邮件报告为“非垃圾邮件”。即使没有恶意，一些非垃圾邮件报告也可能出错，或者只适用于发送报告的用户。除了对特定用户的适用性之外，运营商在信任此类报告时需要谨慎。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has registered the newly defined feedback type name: \"not-spam\", according to the instructions in Section 7.3 of the base specification [RFC5965].",
      "zh-CHS": "根据基本规范[RFC5965]第7.3节中的说明，IANA已注册了新定义的反馈类型名称：“非垃圾邮件”。"
    },
    {
      "indent": 3,
      "text": "The following has been added to the \"Feedback Report Type Values\" registry:",
      "zh-CHS": "以下内容已添加到“反馈报告类型值”注册表中："
    },
    {
      "indent": 3,
      "text": "Feedback Type Name: not-spam",
      "zh-CHS": "反馈类型名称：非垃圾邮件"
    },
    {
      "indent": 3,
      "text": "Description: Indicates that the entity providing the report does not consider the message to be spam. This may be used to correct a message that was incorrectly tagged or categorized as spam.",
      "zh-CHS": "说明：指示提供报表的实体不认为消息是垃圾邮件。这可用于更正错误标记或归类为垃圾邮件的邮件。"
    },
    {
      "indent": 3,
      "text": "Published in: this document",
      "zh-CHS": "发表于：本文件"
    },
    {
      "indent": 3,
      "text": "Status: current",
      "zh-CHS": "状态：当前"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Murray S. Kucherawy and Bert Greevenbosch for their discussion and review, and J.D. Falk for suggesting some explanatory text.",
      "zh-CHS": "作者要感谢Murray S.Kucherawy和Bert Greevenbosch的讨论和评论，以及J.D.Falk提出的一些解释性文本。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC5965] Shafranovich, Y., Levine, J., and M. Kucherawy, \"An Extensible Format for Email Feedback Reports\", RFC 5965, August 2010.",
      "zh-CHS": "[RFC5965]Shafranovich，Y.，Levine，J.，和M.Kucherawy，“电子邮件反馈报告的可扩展格式”，RFC 59652010年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[MARF-AS] Falk, J., \"Creation and Use of Email Feedback Reports: An Applicability Statement for the Abuse Reporting Format (ARF)\", Work in Progress, September 2011.",
      "zh-CHS": "[MARF-AS]Falk，J.，“电子邮件反馈报告的创建和使用：滥用报告格式（ARF）的适用性声明”，正在进行的工作，2011年9月。"
    },
    {
      "indent": 3,
      "text": "[OMA-SpamRep-RD] Open Mobile Alliance, \"Mobile Spam Reporting Requirements\", Candidate Version 1.0 OMA-RD-SpamRep-V1_0- 20101123-C, November 2010, <http:// www.openmobilealliance.org/Technical/release_program/docs/ SpamRep/V1_0-20101123-C/ OMA-RD-SpamRep-V1_0-20101123-C.pdf>.",
      "zh-CHS": "[OMA SpamRep RD]开放移动联盟，“移动垃圾邮件报告要求”，候选版本1.0 OMA-RD-SpamRep-V1_0-20101123-C，2010年11月，<http://www.openmobilealliance.org/Technical/release_program/docs/SpamRep/V1_0-20101123-C/OMA-RD-SpamRep-V1_0-20101123-C.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC6376] Crocker, D., Ed., Hansen, T., Ed., and M. Kucherawy, Ed., \"DomainKeys Identified Mail (DKIM) Signatures\", RFC 6376, September 2011.",
      "zh-CHS": "[RFC6376]Crocker，D.，Ed.，Hansen，T.，Ed.，和M.Kucherawy，Ed.，“域密钥识别邮件（DKIM）签名”，RFC 63762011年9月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Kepeng Li Huawei Technologies Huawei Base, Bantian, Longgang District Shenzhen, Guangdong 518129 P.R. China",
      "zh-CHS": "中国广东省深圳市龙岗区坂田李克鹏华为技术有限公司华为基地邮编：518129"
    },
    {
      "indent": 3,
      "text": "Phone: +86-755-28974289\nEMail: likepeng@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Barry Leiba Huawei Technologies",
      "zh-CHS": "巴里·雷巴华为技术有限公司"
    },
    {
      "indent": 3,
      "text": "Phone: +1 646 827 0648\nEMail: barryleiba@computer.org\nURI:   http://internetmessagingtechnology.org/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}