{
  "title": {
    "text": "RFC 6395: An Interface Identifier (ID) Hello Option for PIM",
    "zh-CHS": "RFC 6395"
  },
  "number": 6395,
  "created_at": "2021-11-06 07:47:14.207694+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      S. Gulrajani\nRequest for Comments: 6395                                     S. Venaas\nCategory: Standards Track                                  Cisco Systems\nISSN: 2070-1721                                             October 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "An Interface Identifier (ID) Hello Option for PIM",
      "zh-CHS": "PIM的接口标识符（ID）Hello选项"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a new PIM Hello option to advertise an Interface Identifier that can be used by PIM protocols to uniquely identify an interface of a neighboring router.",
      "zh-CHS": "本文档定义了一个新的PIM Hello选项，用于公布接口标识符，PIM协议可使用该标识符唯一标识相邻路由器的接口。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6395.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6395."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n  1.1.  Requirements Notation . . . . . . . . . . . . . . . . . . . 2\n2.  Interface Identifier Option . . . . . . . . . . . . . . . . . . 2\n  2.1.  Local Interface Identifier  . . . . . . . . . . . . . . . . 3\n  2.2.  Router Identifier . . . . . . . . . . . . . . . . . . . . . 3\n3.  Message Format  . . . . . . . . . . . . . . . . . . . . . . . . 4\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 5\n6.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . 5\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . . . 5\n  7.2.  Informative References  . . . . . . . . . . . . . . . . . . 5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This document defines a new option for use in PIM Hello messages [RFC4601] to carry an Interface Identifier. A router generates identifiers for each of its PIM-enabled interfaces such that each interface has a different identifier. The identifiers can optionally be generated such that they are unique within, e.g., an administrative domain.",
      "zh-CHS": "本文档定义了一个用于PIM Hello消息[RFC4601]的新选项，以携带接口标识符。路由器为其每个支持PIM的接口生成标识符，以便每个接口具有不同的标识符。标识符可以选择性地生成，使得它们在例如管理域内是唯一的。"
    },
    {
      "indent": 3,
      "text": "An example where this Interface Identifier can be used is with PIM over Reliable Transport (PORT) [PIM-PORT], where a single Transport connection is used between two routers that have multiple interfaces connecting them. If these interfaces have unnumbered or IPv6 link-local addresses, the Interface Identifier included in the PORT Join/ Prune message will identify with which interface the message is associated. For PORT, the Router Identifier is not needed, and it can be set to zero.",
      "zh-CHS": "此接口标识符可用于PIM over Reliable Transport（端口）[PIM-PORT]的一个示例，其中在具有多个接口的两个路由器之间使用单个传输连接。如果这些接口具有未编号或IPv6链路本地地址，则端口加入/删除消息中包含的接口标识符将标识消息与哪个接口关联。对于端口，不需要路由器标识符，可以将其设置为零。"
    },
    {
      "indent": 3,
      "text": "All multi-byte integers in this specification are transmitted in network byte order (i.e., most significant byte first).",
      "zh-CHS": "本规范中的所有多字节整数均以网络字节顺序传输（即，最高有效字节优先）。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Notation",
      "section_title": true,
      "zh-CHS": "1.1. 需求符号"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Interface Identifier Option",
      "section_title": true,
      "zh-CHS": "2. 接口标识符选项"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier option is used to identify the interface of a neighboring router through which a PIM Hello [RFC4601] was sent. This allows PIM protocols to refer to, or identify, a particular interface on a neighboring router.",
      "zh-CHS": "接口标识符选项用于识别发送PIM Hello[RFC4601]的相邻路由器的接口。这允许PIM协议引用或识别相邻路由器上的特定接口。"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier option need only be included in PIM Hello messages if the router supports protocols that require it. An implementation MAY choose to always include it. The usage of the Interface Identifier and the uniqueness requirements are left to the specifications of the PIM protocols that implement it. It is assumed that different protocols have different minimum requirements for stability and uniqueness of the Interface Identifier but that they have no maximum requirement. When specified, these protocols should indicate what their minimum requirements are.",
      "zh-CHS": "如果路由器支持需要的协议，接口标识符选项只需要包含在PIM Hello消息中。实现可以选择始终包含它。接口标识符的使用和唯一性要求由实现它的PIM协议的规范决定。假设不同的协议对接口标识符的稳定性和唯一性有不同的最低要求，但没有最高要求。如有规定，这些协议应说明其最低要求。"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier consists of 64 bits. The lower 32 bits form a Local Interface Identifier, and the high 32 bits form a Router Identifier.",
      "zh-CHS": "接口标识符由64位组成。低32位形成本地接口标识符，高32位形成路由器标识符。"
    },
    {
      "indent": 0,
      "text": "2.1. Local Interface Identifier",
      "section_title": true,
      "zh-CHS": "2.1. 本地接口标识符"
    },
    {
      "indent": 3,
      "text": "The 32-bit Local Interface Identifier is selected such that it is unique among the router's PIM-enabled interfaces. That is, there MUST NOT be two PIM interfaces with the same Local Interface Identifier. While an interface is up, the Identifier MUST always be the same once it has been allocated. If an interface goes down and comes up, the router SHOULD use the same Identifier. If a node goes down and comes up again, the Identifier for each interface MAY change. Many systems make use of an ifIndex [RFC2863] as a Local Interface Identifier.",
      "zh-CHS": "选择32位本地接口标识符，使其在路由器启用PIM的接口中唯一。也就是说，不能有两个具有相同本地接口标识符的PIM接口。当接口启动时，标识符在分配后必须始终相同。如果一个接口出现故障，路由器应该使用相同的标识符。如果一个节点下降又上升，每个接口的标识符可能会改变。许多系统使用ifIndex[RFC2863]作为本地接口标识符。"
    },
    {
      "indent": 3,
      "text": "The Local Interface Identifier MUST be non-zero. The reason for this is that some protocols may have messages that optionally reference an Interface Identifier, and they may use the value of 0 to show that no Interface Identifier is being referenced. Note that the value of 0 is not a valid ifIndex as defined in [RFC2863].",
      "zh-CHS": "本地接口标识符必须为非零。这是因为某些协议可能具有可选引用接口标识符的消息，并且它们可能使用值0来表示未引用任何接口标识符。请注意，0的值不是[RFC2863]中定义的有效ifIndex。"
    },
    {
      "indent": 0,
      "text": "2.2. Router Identifier",
      "section_title": true,
      "zh-CHS": "2.2. 路由器标识符"
    },
    {
      "indent": 3,
      "text": "The 32-bit Router Identifier may be used to uniquely identify the router. The requirements for the scope in which the Router Identifier needs to be unique depend on the protocols that utilize it. It may need to be unique within some administrative domain, or it may possibly be globally unique.",
      "zh-CHS": "32位路由器标识符可用于唯一标识路由器。路由器标识符需要唯一的范围要求取决于使用它的协议。它可能需要在某些管理域中是唯一的，或者可能是全局唯一的。"
    },
    {
      "indent": 3,
      "text": "A router implementation selects a Router Identifier according to a configured policy that defines the uniqueness scope. Thus, an implementation MAY be configured to choose an IPv4 unicast address assigned to the router as the Router Identifier, but the implementation MUST allow the identifier to be configured manually.",
      "zh-CHS": "路由器实现根据定义唯一性范围的配置策略选择路由器标识符。因此，可以将实现配置为选择分配给路由器的IPv4单播地址作为路由器标识符，但是该实现必须允许手动配置标识符。"
    },
    {
      "indent": 3,
      "text": "Protocols such as BGP [RFC4271] and OSPFv2 [RFC2328] are other protocols that make use of 32-bit identifiers for routers. Provided that the stability and uniqueness requirements of the protocols that make use of the Router Identifier are met, an implementation MAY use the same identifier used by other protocols.",
      "zh-CHS": "诸如BGP[RFC4271]和OSPFv2[RFC2328]之类的协议是为路由器使用32位标识符的其他协议。如果满足使用路由器标识符的协议的稳定性和唯一性要求，则实现可以使用其他协议使用的相同标识符。"
    },
    {
      "indent": 3,
      "text": "The value 0 has a special meaning for the Router Identifier. It means that no Router Identifier is used. If a router only supports protocols that require the Interface Identifier to be unique for one router (only making use of the Local Interface Identifier), then the implementation MAY set the Router Identifier to zero.",
      "zh-CHS": "值0对路由器标识符具有特殊意义。这意味着没有使用路由器标识符。如果路由器仅支持要求接口标识符对于一个路由器是唯一的协议（仅使用本地接口标识符），则实现可将路由器标识符设置为零。"
    },
    {
      "indent": 0,
      "text": "3. Message Format",
      "section_title": true,
      "zh-CHS": "3. 消息格式"
    },
    {
      "indent": 3,
      "text": "Option Type: Interface Identifier",
      "zh-CHS": "选项类型：接口标识符"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Type = 31           |         Length = 8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Router Identifier                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Local Interface Identifier                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Allocated Hello Type values can be found in [HELLO-OPT].",
      "zh-CHS": "分配的Hello类型值可在[Hello-OPT]中找到。"
    },
    {
      "indent": 3,
      "text": "Length: In bytes for the value part of the Type/Length/Value encoding. The Interface Identifier will be 8 bytes long.",
      "zh-CHS": "长度：类型/长度/值编码的值部分以字节为单位。接口标识符的长度为8字节。"
    },
    {
      "indent": 3,
      "text": "Router Identifier: The Router Identifier is a 4-byte identifier uniquely identifying the router within some scope. It MAY be 0 when no protocols require a Router Identifier. The field MUST contain a valid Router Identifier or the value zero.",
      "zh-CHS": "路由器标识符：路由器标识符是一个4字节的标识符，唯一地标识某个范围内的路由器。当没有协议需要路由器标识符时，它可能为0。该字段必须包含有效的路由器标识符或值零。"
    },
    {
      "indent": 3,
      "text": "Local Interface Identifier: The Local Interface Identifier is a 4-byte identifier that is unique among all PIM-enabled interfaces on a router.",
      "zh-CHS": "本地接口标识符：本地接口标识符是一个4字节的标识符，在路由器上所有启用PIM的接口中是唯一的。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier is included in PIM Hello messages. See [RFC4601] for security considerations regarding PIM Hello messages. In particular, PIM Hello messages may be forged and include an arbitrary Interface Identifier, or the Interface Identifier may be intentionally omitted. The effects of this depend on how the Interface Identifier is used by other protocols.",
      "zh-CHS": "接口标识符包含在PIM Hello消息中。有关PIM Hello消息的安全注意事项，请参阅[RFC4601]。具体地，PIM Hello消息可以是伪造的，并且包括任意接口标识符，或者可以故意省略接口标识符。其效果取决于其他协议如何使用接口标识符。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the value 31 for the Interface ID PIM-Hello option defined in this document.",
      "zh-CHS": "IANA已为本文档中定义的接口ID PIM Hello选项分配了值31。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors thank Yiqun Cai, Heidi Ou, Liming Wei, Gorry Fairhurst, Bharat Joshi, and Bill Atwood for providing valuable feedback.",
      "zh-CHS": "作者感谢蔡一群、欧海蒂、魏黎明、戈里·费尔赫斯特、巴拉特·乔希和比尔·阿特伍德提供了宝贵的反馈。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4601] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "zh-CHS": "[RFC4601]Fenner，B.，Handley，M.，Holbrook，H.，和I.Kouvelas，“协议独立多播-稀疏模式（PIM-SM）：协议规范（修订版）”，RFC 46012006年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[HELLO-OPT] IANA, \"PIM Hello Options\", <http://www.iana.org/>.",
      "zh-CHS": "[HELLO-OPT]IANA，“PIM HELLO选项”<http://www.iana.org/>."
    },
    {
      "indent": 3,
      "text": "[PIM-PORT] Farinacci, D., Wijnands, IJ., Venaas, S., and M. Napierala, \"A Reliable Transport Mechanism for PIM\", Work in Progress, August 2011.",
      "zh-CHS": "[PIM-PORT]Farinaci，D.，Wijnands，IJ.，Venaas，S.，和M.Napierala，“PIM的可靠运输机制”，正在进行的工作，2011年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "zh-CHS": "[RFC2328]Moy，J.，“OSPF版本2”，STD 54，RFC 2328，1998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "zh-CHS": "[RFC2863]McCloghrie，K.和F.Kastenholz，“接口组MIB”，RFC 28632000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Li, T., and S. Hares, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "zh-CHS": "[RFC4271]Rekhter，Y.，Li，T.，和S.Hares，“边境网关协议4（BGP-4）”，RFC 42712006年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Sameer Gulrajani Cisco Systems Tasman Drive San Jose, CA 95134 USA",
      "zh-CHS": "美国加利福尼亚州圣何塞市塔斯曼大道Sameer Gullajani思科系统公司，邮编95134"
    },
    {
      "indent": 3,
      "text": "EMail: sameerg@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stig Venaas Cisco Systems Tasman Drive San Jose, CA 95134 USA",
      "zh-CHS": "美国加利福尼亚州圣何塞市塔斯曼大道Stig Venaas思科系统公司，邮编95134"
    },
    {
      "indent": 3,
      "text": "EMail: stig@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}