{
  "title": {
    "text": "RFC 6903: Additional Link Relation Types",
    "zh-CHS": "RFC 6903"
  },
  "number": 6903,
  "created_at": "2021-11-22 03:14:18.422508+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                          J. Snell\nRequest for Comments: 6903                                    March 2013\nCategory: Informational\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "Additional Link Relation Types",
      "zh-CHS": "其他链接关系类型"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This specification defines a number of additional link relation types that can used for a range of purposes in a variety of applications types.",
      "zh-CHS": "本规范定义了许多附加链接关系类型，这些类型可用于各种应用程序类型中的一系列用途。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "这是对RFC系列的贡献，独立于任何其他RFC流。RFC编辑器已选择自行发布此文档，并且未声明其对实现或部署的价值。RFC编辑批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6903.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6903."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2013 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  \"about\" . . . . . . . . . . . . . . . . . . . . . . . . . . .   2\n3.  \"preview\" . . . . . . . . . . . . . . . . . . . . . . . . . .   2\n4.  \"privacy-policy\"  . . . . . . . . . . . . . . . . . . . . . .   3\n  4.1.  The \"privacy-policy\" Link Relation and P3P  . . . . . . .   4\n5.  \"terms-of-service\"  . . . . . . . . . . . . . . . . . . . . .   4\n6.  \"type\"  . . . . . . . . . . . . . . . . . . . . . . . . . . .   5\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . .   6\n  9.2.  Informative References  . . . . . . . . . . . . . . . . .   6",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The fundamental model for web links and the \"Link Relations\" registry are established by [RFC5988]. This specification defines and adds the following additional link relation types to the registry: \"about\", \"preview\", \"privacy-policy\", \"terms-of-service\", and \"type\".",
      "zh-CHS": "[RFC5988]建立了web链接和“链接关系”注册表的基本模型。本规范定义并向注册表添加以下附加链接关系类型：“关于”、“预览”、“隐私策略”、“服务条款”和“类型”。"
    },
    {
      "indent": 0,
      "text": "2. \"about\"",
      "section_title": true,
      "zh-CHS": "2. “关于”"
    },
    {
      "indent": 3,
      "text": "The \"about\" link relation can be used to refer to a resource that is the subject or topic of the link's context. Multiple subjects can be indicated through the use of multiple \"about\" link relations.",
      "zh-CHS": "“关于”链接关系可用于指作为链接上下文主题或主题的资源。通过使用多个“关于”链接关系可以指示多个主题。"
    },
    {
      "indent": 3,
      "text": "For example, if the context resource is a review about a particular product, the \"about\" link can be used to reference the URL of the product:",
      "zh-CHS": "例如，如果上下文资源是关于特定产品的评论，“关于”链接可用于引用产品的URL："
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK\nContent-Type: application/json\nLink: <http://store.example.org/product/abc>; rel=\"about\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "{...}",
      "zh-CHS": "{...}"
    },
    {
      "indent": 0,
      "text": "3. \"preview\"",
      "section_title": true,
      "zh-CHS": "3. “预览”"
    },
    {
      "indent": 3,
      "text": "The \"preview\" link relation can be used to refer to a resource that serves as a preview of the link's context, likely with reduced quality or limited content. For instance, the preview link might reference a screen capture of a video, a brief snippet of audio from a song, or a thumbnail representation of an image.",
      "zh-CHS": "“预览”链接关系可用于指代用作链接上下文预览的资源，可能会降低质量或限制内容。例如，预览链接可能引用视频的屏幕截图、歌曲的简短音频片段或图像的缩略图。"
    },
    {
      "indent": 3,
      "text": "For example, issuing an HTTP HEAD request to a URI representing a large video or image file might return a link to a short or lower-quality preview of the original:",
      "zh-CHS": "例如，向表示大型视频或图像文件的URI发出HTTP HEAD请求可能会返回指向原始文件的较短或较低质量预览的链接："
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK\nContent-Text: video/mpeg\nLink: <http://example.org/preview/10-second-preview.mpg>;\n  rel=\"preview\"; type=\"video/mpeg\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. \"privacy-policy\"",
      "section_title": true,
      "zh-CHS": "4. “隐私政策”"
    },
    {
      "indent": 3,
      "text": "The \"privacy-policy\" link relation can be used to refer to a resource describing the privacy policy associated with the link's context. The privacy policy can be any resource that discloses what personal information about the user is collected and how that personal information is stored, used, managed, and disclosed to other parties.",
      "zh-CHS": "“隐私策略”链接关系可用于引用描述与链接上下文关联的隐私策略的资源。隐私策略可以是任何资源，用于披露收集的用户个人信息以及如何存储、使用、管理和向其他方披露该个人信息。"
    },
    {
      "indent": 3,
      "text": "For example, an HTTP server that collects personal information about a user throughout the course of the user's interaction with the service can include \"privacy-policy\" links within all HTTP responses using any combination of Link headers or links embedded in the response payload:",
      "zh-CHS": "例如，在用户与服务交互的整个过程中收集用户个人信息的HTTP服务器可以使用链接头或嵌入在响应有效负载中的链接的任意组合在所有HTTP响应中包括“隐私策略”链接："
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK\nContent-Type: text/html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<html>\n  <head>\n    ...\n    <link rel=\"privacy-policy\" href=\"/privacy-policy.html\" />\n    ...\n  </head>\n  <body>\n    ...\n  </body>\n</html>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that in the absence of clear legal obligations placed on an entity, either through contract or law, the presence of a \"privacy-policy\" link does not constitute a legally binding obligation on the part of the service. The linked resource can only be interpreted as a description of the expected practice.",
      "zh-CHS": "请注意，如果实体没有通过合同或法律承担明确的法律义务，则“隐私政策”链接的存在并不构成服务方面具有法律约束力的义务。链接资源只能解释为对预期实践的描述。"
    },
    {
      "indent": 3,
      "text": "It is recommended that publishers of privacy-policy resources linked to using the \"privacy-policy\" link relation provide a clear and simple mechanism for signaling when changes to the privacy-policy resource have been made, such as generating a new Entity Tag for the",
      "zh-CHS": "建议链接到使用“隐私策略”链接关系的隐私策略资源的发布者提供一种清晰简单的机制，用于在隐私策略资源发生更改时发出信号，例如为用户生成新的实体标记"
    },
    {
      "indent": 3,
      "text": "resource or generating a hash over the privacy policy's content. The extent to which mechanisms are utilized is out of the scope of this specification, however.",
      "zh-CHS": "资源或在隐私策略的内容上生成哈希。然而，使用机制的程度超出了本规范的范围。"
    },
    {
      "indent": 0,
      "text": "4.1. The \"privacy-policy\" Link Relation and P3P",
      "section_title": true,
      "zh-CHS": "4.1. “隐私政策”链接关系与P3P"
    },
    {
      "indent": 3,
      "text": "The Platform for Privacy Preferences [P3P] is a W3C Recommendation that defines a data format for the expression of privacy policy information. While the \"privacy-policy\" link relation can be used to reference P3P documents, there is no intended relationship, normative or otherwise, between this specification and the P3P Recommendation. As far as this specification is concerned, P3P documents are just one possible type of resource that \"privacy-policy\" links can reference.",
      "zh-CHS": "隐私首选项平台[P3P]是W3C的建议，它定义了用于表达隐私策略信息的数据格式。虽然“隐私政策”链接关系可用于引用P3P文件，但本规范与P3P建议之间不存在规范性或其他预期关系。就本规范而言，P3P文档只是“隐私政策”链接可以引用的一种可能的资源类型。"
    },
    {
      "indent": 0,
      "text": "5. \"terms-of-service\"",
      "section_title": true,
      "zh-CHS": "5. “服务条款”"
    },
    {
      "indent": 3,
      "text": "The \"terms-of-service\" link relation can be used to refer to a resource describing the terms of service associated with the link's context. The terms of service can be any resource that describes the rules to which a consumer of the service must agree to follow when using the service provided by the link's context.",
      "zh-CHS": "“服务条款”链接关系可用于引用描述与链接上下文关联的服务条款的资源。服务条款可以是描述服务消费者在使用链接上下文提供的服务时必须遵守的规则的任何资源。"
    },
    {
      "indent": 3,
      "text": "For example, an HTTP server can include \"terms-of-service\" links within all HTTP responses using any combination of Link headers or links embedded in the response payload:",
      "zh-CHS": "例如，HTTP服务器可以使用链接头或嵌入在响应负载中的链接的任意组合，在所有HTTP响应中包含“服务条款”链接："
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK\nContent-Type: text/html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "<html>\n  <head>\n    ...\n    <link rel=\"terms-of-service\" href=\"/tos.html\">\n    ...\n  </head>\n  <body>\n    ...\n  </body>\n</html>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "It must be noted that the terms of service linked to using this link relation carry no legal weight and can be ignored with impunity in the absence of an explicit, legally enforceable contract. The linked terms of service are simply a notice of the terms that may be expected to apply once a contract is established.",
      "zh-CHS": "必须指出的是，与使用这种联系关系有关的服务条款不具有法律效力，如果没有明确的、法律上可执行的合同，可以忽略这些条款而不受惩罚。链接的服务条款只是一个通知，说明一旦合同成立，预期将适用的条款。"
    },
    {
      "indent": 0,
      "text": "6. \"type\"",
      "section_title": true,
      "zh-CHS": "6. “类型”"
    },
    {
      "indent": 3,
      "text": "The \"type\" link relation can be used to indicate that the context resource is an instance of the resource identified by the target Internationalized Resource Identifier (IRI).",
      "zh-CHS": "“类型”链接关系可用于指示上下文资源是由目标国际化资源标识符（IRI）标识的资源的实例。"
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK\nContent-Type: text/plain\nLink: <http://example.org/Person/givenName>; rel=\"type\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "Sally",
      "zh-CHS": "俏皮话"
    },
    {
      "indent": 3,
      "text": "When used within the header of an HTTP message, the type specified by the \"type\" link relation cannot be confused with the content type of the payload as given by the Content-Type header. The \"type\" link relation references the payload's abstract semantic type, whereas the Content-Type header identifies the specific serialization format of the payload.",
      "zh-CHS": "当在HTTP消息头中使用时，“type”链接关系指定的类型不能与content type头给出的有效负载的内容类型混淆。“type”链接关系引用负载的抽象语义类型，而Content-type头标识负载的特定序列化格式。"
    },
    {
      "indent": 3,
      "text": "If the context can be considered to be an instance of multiple semantic types, multiple \"type\" link relations can be used.",
      "zh-CHS": "如果可以将上下文视为多个语义类型的实例，则可以使用多个“类型”链接关系。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The \"Link Relation Types\" registry has been updated with the following entries:",
      "zh-CHS": "“链接关系类型”注册表已更新为以下条目："
    },
    {
      "indent": 3,
      "text": "o Relation Name: about o Description: Refers to a resource that is the subject of the link's context. o Reference: This specification, Section 2",
      "zh-CHS": "o 关系名称：about o Description：指作为链接上下文主题的资源。o参考：本规范第2节"
    },
    {
      "indent": 3,
      "text": "o Relation Name: preview o Description: Refers to a resource that provides a preview of the link's context. o Reference: This specification, Section 3",
      "zh-CHS": "o 关系名称：预览o说明：指提供链接上下文预览的资源。o参考：本规范第3节"
    },
    {
      "indent": 3,
      "text": "o Relation Name: privacy-policy o Description: Refers to a privacy policy associated with the link's context. o Reference: This specification, Section 4",
      "zh-CHS": "o 关系名称：隐私策略o描述：指与链接上下文关联的隐私策略。o参考：本规范第4节"
    },
    {
      "indent": 3,
      "text": "o Relation Name: terms-of-service o Description: Refers to the terms of service associated with the link's context. o Reference: This specification, Section 5",
      "zh-CHS": "o 关系名称：服务条款o描述：指与链接上下文关联的服务条款。o参考：本规范第5节"
    },
    {
      "indent": 3,
      "text": "o Relation Name: type o Description: Refers to a resource identifying the abstract semantic type of which the link's context is considered to be an instance. o Reference: This specification, Section 6",
      "zh-CHS": "o 关系名称：type o Description：指标识抽象语义类型的资源，链接的上下文被视为该类型的实例。o参考：本规范第6节"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security concerns introduced by this document.",
      "zh-CHS": "本文件不涉及其他安全问题。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC5988] Nottingham, M., \"Web Linking\", RFC 5988, October 2010.",
      "zh-CHS": "[RFC5988]诺丁汉，M.，“网络链接”，RFC 5988，2010年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[P3P] W3C, \"P3P: The Platform for Privacy Preferences\", November 2007, <http://www.w3.org/P3P/>.",
      "zh-CHS": "[P3P]W3C，“P3P：隐私偏好平台”，2007年11月<http://www.w3.org/P3P/>."
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "James M Snell",
      "zh-CHS": "詹姆斯·姆斯内尔"
    },
    {
      "indent": 3,
      "text": "EMail: jasnell@gmail.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}