{
  "title": {
    "text": "RFC 6448: The Unencrypted Form of Kerberos 5 KRB-CRED Message",
    "zh-CHS": "RFC 6448"
  },
  "number": 6448,
  "created_at": "2021-11-06 11:12:41.738278+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          R. Yount\nRequest for Comments: 6448                    Carnegie Mellon University\nCategory: Standards Track                                  November 2011\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "The Unencrypted Form of Kerberos 5 KRB-CRED Message",
      "zh-CHS": "Kerberos 5 KRB-CRED消息的未加密形式"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Kerberos 5 KRB-CRED message is used to transfer Kerberos credentials between applications. When used with a secure transport, the unencrypted form of the KRB-CRED message may be desirable. This document describes the unencrypted form of the KRB-CRED message.",
      "zh-CHS": "Kerberos 5 KRB-CRED消息用于在应用程序之间传输Kerberos凭据。当与安全传输一起使用时，可能需要KRB-CRED消息的未加密形式。本文档描述了KRB-CRED消息的未加密形式。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6448.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6448."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "There are applications that need to transfer Kerberos credentials between them without having a prior relationship with established Kerberos keys. When transferred over a transport that provides confidentiality and integrity, the unencrypted form of the KRB-CRED message MAY be used. One application employing this method is the Kerberos attribute transport mechanism, described in Section 2.7 of the Security Assertion Markup Language (SAML) V2.0 Kerberos Attribute Profile [SAMLv2-KRB-ATTRIB].",
      "zh-CHS": "有些应用程序需要在它们之间传输Kerberos凭据，而不需要事先与已建立的Kerberos密钥建立关系。当通过提供机密性和完整性的传输进行传输时，可以使用未加密形式的KRB-CRED消息。使用此方法的一个应用程序是Kerberos属性传输机制，如安全断言标记语言（SAML）V2.0 Kerberos属性配置文件[SAMLv2 KRB ATTRIB]第2.7节所述。"
    },
    {
      "indent": 3,
      "text": "In the SAML application, the Identity Provider (IdP) somehow obtains a Kerberos service ticket from the Kerberos Key Distribution Center (KDC) when required by the SAML system and transfers the credential to a Service Provider (SP) within an attribute statement. The SP can then use the credential to access a Kerberos protected service.",
      "zh-CHS": "在SAML应用程序中，当SAML系统需要时，身份提供者（IdP）以某种方式从Kerberos密钥分发中心（KDC）获取Kerberos服务票证，并在属性语句中将凭证传输给服务提供者（SP）。然后，SP可以使用凭据访问受Kerberos保护的服务。"
    },
    {
      "indent": 3,
      "text": "The Kerberos 5 specification as described in [RFC4120] mentions the non-standard legacy use of unencrypted KRB-CRED messages with the Generic Security Service Application Program Interface (GSS-API) [RFC1964] by the MIT, Heimdal, and Microsoft Kerberos implementations. This document provides a formal specification of the unencrypted form of the KRB-CRED message to enable its continued use in new applications.",
      "zh-CHS": "[RFC4120]中所述的Kerberos 5规范提到MIT、Heimdal和Microsoft Kerberos实现在通用安全服务应用程序接口（GSS-API）[RFC1964]中非标准地使用未加密的KRB-CRED消息。本文档提供了KRB-CRED消息未加密形式的正式规范，以便在新应用程序中继续使用。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Notation",
      "section_title": true,
      "zh-CHS": "2. 需求符号"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. The Unencrypted Form of the KRB-CRED Message",
      "section_title": true,
      "zh-CHS": "3. KRB-CRED消息的未加密形式"
    },
    {
      "indent": 3,
      "text": "The unencrypted form of the KRB-CRED message contains EncryptedData as defined in Section 5.2.9 of [RFC4120]. The encryption type (etype) MUST be specified as 0. The optional key version number (kvno) SHOULD NOT be present and MUST be ignored by the recipient if present. The ciphertext (cipher) is a copy of the EncKrbCredPart, which is in cleartext, as defined in Section 5.8.1 of [RFC4120].",
      "zh-CHS": "KRB-CRED报文的未加密形式包含[RFC4120]第5.2.9节中定义的加密数据。必须将加密类型（etype）指定为0。可选密钥版本号（kvno）不应存在，收件人必须忽略（如果存在）。密文（cipher）是EncKrbCredPart的副本，其为明文，如[RFC4120]第5.8.1节所定义。"
    },
    {
      "indent": 0,
      "text": "4. Kerberos Encryption Type 0 Is Not an Encryption System",
      "section_title": true,
      "zh-CHS": "4. Kerberos加密类型0不是加密系统"
    },
    {
      "indent": 3,
      "text": "The Kerberos Encryption Type 0 is an invalid value [RFC3961]. This means that no encryption type with value 0 will ever be defined; no encryption or key management operations will use this value. Layers above the encryption layer often transport encryption types as integer values. These layers are free to use a 0 in an encryption",
      "zh-CHS": "Kerberos加密类型0是无效值[RFC3961]。这意味着永远不会定义值为0的加密类型；没有加密或密钥管理操作将使用此值。加密层之上的层通常将加密类型作为整数值传输。这些层可以在加密中自由使用0"
    },
    {
      "indent": 3,
      "text": "type integer as a flag or sentinel value, or for other context-specific purposes. For example, Section 3 of this specification defines the semantics of a 0 carried in the KRB-CRED message's encryption type field. In the context of the KRB-CRED message, it is a message-specific indicator to be interpreted as the message is not encrypted. This approach was chosen due to existing Kerberos implementations that conform to this specification.",
      "zh-CHS": "键入integer作为标志或sentinel值，或用于其他特定于上下文的目的。例如，本规范第3节定义了KRB-CRED消息的加密类型字段中携带的0的语义。在KRB-CRED消息的上下文中，它是一个消息特定的指示符，被解释为消息未加密。选择此方法是因为现有的Kerberos实现符合此规范。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The KRB-CRED message contains sensitive information related to Kerberos credentials being transferred, such as their secret session keys, client and server principal names, and validity period. Possession of this information, along with the ticket itself, would allow an attacker to impersonate the client named in the ticket. The possibility of modification of the KRB-CRED message enables the attacker to substitute the credentials. This can result in the recipient using the credentials of a client that was not intended. As a result, the KRB-CRED message must be carefully safeguarded.",
      "zh-CHS": "KRB-CRED消息包含与正在传输的Kerberos凭据相关的敏感信息，例如其秘密会话密钥、客户端和服务器主体名称以及有效期。拥有此信息以及票据本身将允许攻击者模拟票据中指定的客户端。修改KRB-CRED消息的可能性使攻击者能够替换凭据。这可能会导致收件人使用非预期的客户端凭据。因此，必须小心保护KRB-CRED消息。"
    },
    {
      "indent": 3,
      "text": "The use of an unencrypted form of the KRB-CRED message MUST only be used with a transport where sender and recipient identities can be established to be known to each other. The transport MUST also provide confidentiality, integrity, and mutual authentication. Examples of transports that MAY be securely used to transport an unencrypted KRB-CRED message would include Transport Layer Security (TLS) [RFC5246], where mutual authentication has been established, or the use of messages where the KRB-CRED is encoded within an encrypted and signed SAML 2.0 [OASIS-SAMLv2] statement.",
      "zh-CHS": "使用未加密形式的KRB-CRED消息只能用于发送者和接收者身份可以确定为彼此已知的传输。传输还必须提供机密性、完整性和相互身份验证。可安全用于传输未加密的KRB-CRED消息的传输示例包括传输层安全性（TLS）[RFC5246]，其中已建立相互认证，或使用在加密和签名SAML 2.0[OASIS-SAMLv2]语句中编码KRB-CRED的消息。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The following individuals have contributed to the development of this specification.",
      "zh-CHS": "以下人员对本规范的制定做出了贡献。"
    },
    {
      "indent": 6,
      "text": "Thomas Hardjono, Massachusetts Institute of Technology",
      "zh-CHS": "Thomas Hardjono，麻省理工学院"
    },
    {
      "indent": 6,
      "text": "Josh Howlett, Individual",
      "zh-CHS": "Josh Howlett，个人"
    },
    {
      "indent": 6,
      "text": "Jeffrey Hutzelman, Carnegie Mellon University",
      "zh-CHS": "杰弗里·哈泽尔曼，卡内基梅隆大学"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The reference for Kerberos Encryption Type 0 has been updated to point to this document.",
      "zh-CHS": "Kerberos加密类型0的引用已更新为指向此文档。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[OASIS-SAMLv2] Cantor, S., Ed., Kemp, J., Ed., Philpott, R., Ed., and E. Maler, Ed., \"Assertions and Protocol for the OASIS Security Assertion Markup Language (SAML) V2.0\", OASIS Standard saml-core-2.0-os, March 2005.",
      "zh-CHS": "[OASIS-SAMLv2]Cantor，S.，Ed.，Kemp，J.，Ed.，Philpott，R.，Ed.，和E.Maler，Ed.，“OASIS安全断言标记语言（SAML）V2.0的断言和协议”，OASIS标准SAML-core-2.0-os，2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC1964] Linn, J., \"The Kerberos Version 5 GSS-API Mechanism\", RFC 1964, June 1996.",
      "zh-CHS": "[RFC1964]Linn，J.，“Kerberos版本5 GSS-API机制”，RFC19641996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4120] Neuman, C., Yu, T., Hartman, S., and K. Raeburn, \"The Kerberos Network Authentication Service (V5)\", RFC 4120, July 2005.",
      "zh-CHS": "[RFC4120]Neuman，C.，Yu，T.，Hartman，S.，和K.Raeburn，“Kerberos网络身份验证服务（V5）”，RFC41202005年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, August 2008.",
      "zh-CHS": "[RFC5246]Dierks，T.和E.Rescorla，“传输层安全（TLS）协议版本1.2”，RFC 5246，2008年8月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3961] Raeburn, K., \"Encryption and Checksum Specifications for Kerberos 5\", RFC 3961, February 2005.",
      "zh-CHS": "[RFC3961]Raeburn，K.，“Kerberos 5的加密和校验和规范”，RFC 3961，2005年2月。"
    },
    {
      "indent": 3,
      "text": "[SAMLv2-KRB-ATTRIB] Howlett, J., Ed., and T. Hardjono, Ed., \"SAML V2.0 Kerberos Attribute Profile Version 1.0\", sstc-saml-attribute-kerberos.odt, August 2011.",
      "zh-CHS": "[SAMLv2 KRB ATTRIB]Howlett，J.，Ed.，和T.Hardjono，Ed.，“SAML V2.0 Kerberos属性配置文件版本1.0”，sstc-SAML-Attribute-Kerberos.odt，2011年8月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Russell J. Yount Carnegie Mellon University 5000 Forbes Avenue Pittsburgh, Pennsylvania 15213 US",
      "zh-CHS": "美国宾夕法尼亚州匹兹堡福布斯大道5000号拉塞尔J.杨特卡内基梅隆大学15213"
    },
    {
      "indent": 3,
      "text": "Phone: +1 412 268 8391\nEMail: rjy@cmu.edu",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}