{
  "title": {
    "text": "RFC 6387: GMPLS Asymmetric Bandwidth Bidirectional Label Switched Paths (LSPs)",
    "zh-CHS": "RFC 6387"
  },
  "number": 6387,
  "created_at": "2021-11-06 07:09:39.986783+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Takacs\nRequest for Comments: 6387                                      Ericsson\nObsoletes: 5467                                                L. Berger\nCategory:  Standards Track                       LabN Consulting, L.L.C.\nISSN:  2070-1721                                             D. Caviglia\n                                                                Ericsson\n                                                                D. Fedyk\n                                                          Alcatel-Lucent\n                                                               J. Meuric\n                                                   France Telecom Orange\n                                                          September 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "GMPLS Asymmetric Bandwidth Bidirectional Label Switched Paths (LSPs)",
      "zh-CHS": "GMPLS非对称带宽双向标签交换路径（LSP）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a method for the support of GMPLS asymmetric bandwidth bidirectional Label Switched Paths (LSPs). The approach presented is applicable to any switching technology and builds on the original Resource Reservation Protocol (RSVP) model for the transport of traffic-related parameters. This document moves the experiment documented in RFC 5467 to the standards track and obsoletes RFC 5467.",
      "zh-CHS": "本文件定义了一种支持GMPLS非对称带宽双向标签交换路径（LSP）的方法。提出的方法适用于任何交换技术，并建立在原始资源预留协议（RSVP）模型的基础上，用于传输流量相关参数。本文件将RFC 5467中记录的实验移至标准轨道，并淘汰RFC 5467。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6387.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6387."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n  1.1.  Background . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.2.  Approach Overview  . . . . . . . . . . . . . . . . . . . .  3\n  1.3.  Conventions Used in This Document  . . . . . . . . . . . .  4\n2.  Generalized Asymmetric Bandwidth Bidirectional LSPs  . . . . .  4\n  2.1.  UPSTREAM_FLOWSPEC Object . . . . . . . . . . . . . . . . .  5\n    2.1.1.  Procedures . . . . . . . . . . . . . . . . . . . . . .  5\n  2.2.  UPSTREAM_TSPEC Object  . . . . . . . . . . . . . . . . . .  5\n    2.2.1.  Procedures . . . . . . . . . . . . . . . . . . . . . .  5\n  2.3.  UPSTREAM_ADSPEC Object . . . . . . . . . . . . . . . . . .  6\n    2.3.1.  Procedures . . . . . . . . . . . . . . . . . . . . . .  6\n3.  Packet Formats . . . . . . . . . . . . . . . . . . . . . . . .  6\n4.  Compatibility  . . . . . . . . . . . . . . . . . . . . . . . .  7\n5.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  8\n  5.1.  UPSTREAM_FLOWSPEC Object . . . . . . . . . . . . . . . . .  8\n  5.2.  UPSTREAM_TSPEC Object  . . . . . . . . . . . . . . . . . .  8\n  5.3.  UPSTREAM_ADSPEC Object . . . . . . . . . . . . . . . . . .  8\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . .  8\n7.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n  7.1.  Normative References . . . . . . . . . . . . . . . . . . .  9\n  7.2.  Informative References . . . . . . . . . . . . . . . . . .  9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "GMPLS [RFC3473] introduced explicit support for bidirectional Label Switched Paths (LSPs). The defined support matched the switching technologies covered by GMPLS, notably Time Division Multiplexing (TDM) and lambdas; specifically, it only supported bidirectional LSPs with symmetric bandwidth allocation. Symmetric bandwidth requirements are conveyed using the semantics objects defined in [RFC2205] and [RFC2210].",
      "zh-CHS": "GMPLS[RFC3473]引入了对双向标签交换路径（LSP）的明确支持。定义的支持与GMPLS涵盖的交换技术相匹配，特别是时分复用（TDM）和lambdas；具体来说，它只支持具有对称带宽分配的双向LSP。对称带宽要求使用[RFC2205]和[RFC2210]中定义的语义对象传达。"
    },
    {
      "indent": 3,
      "text": "GMPLS asymmetric bandwidth bidirectional LSPs are bidirectional LSPs that have different bandwidth reservations in each direction. Support for bidirectional LSPs with asymmetric bandwidth was previously discussed in the context of Ethernet, notably [RFC6060] and [RFC6003]. In that context, asymmetric bandwidth support was considered to be a capability that was unlikely to be deployed, and hence [RFC5467] was published as Experimental. The MPLS Transport Profile, MPLS-TP, requires that asymmetric bandwidth bidirectional LSPs be supported (see [RFC5654]); therefore, this document is being published on the Standards Track. This document has no technical changes from the approach defined in [RFC5467]. This document moves the experiment documented in [RFC5467] to the standards track and obsoletes [RFC5467]. This document also removes the Ethernet-technology-specific alternative approach discussed in the appendix of [RFC5467] and maintains only one approach that is suitable for use with any technology.",
      "zh-CHS": "GMPLS非对称带宽双向LSP是在每个方向上具有不同带宽保留的双向LSP。对具有非对称带宽的双向LSP的支持之前在以太网的上下文中讨论过，特别是[RFC6060]和[RFC6003]。在这种情况下，非对称带宽支持被认为是一种不太可能部署的能力，因此[RFC5467]被作为实验性发布。MPLS传输配置文件MPLS-TP要求支持非对称带宽双向LSP（参见[RFC5654]）；因此，本文件将在标准轨道上发布。与[RFC5467]中定义的方法相比，本文件没有任何技术变更。本文件将[RFC5467]中记录的实验移至标准轨道，并淘汰[RFC5467]。本文件还删除了[RFC5467]附录中讨论的特定于以太网技术的替代方法，并仅保留了一种适用于任何技术的方法。"
    },
    {
      "indent": 0,
      "text": "1.1. Background",
      "section_title": true,
      "zh-CHS": "1.1. 出身背景"
    },
    {
      "indent": 3,
      "text": "Bandwidth parameters are transported within RSVP ([RFC2210], [RFC3209], and [RFC3473]) via several objects that are opaque to RSVP. While opaque to RSVP, these objects support a particular model for the communication of bandwidth information between an RSVP session sender (ingress) and receiver (egress). The original model of communication, defined in [RFC2205] and maintained in [RFC3209], used the SENDER_TSPEC and ADSPEC objects in Path messages and the FLOWSPEC object in Resv messages. The SENDER_TSPEC object was used to indicate a sender's data generation capabilities. The FLOWSPEC object was issued by the receiver and indicated the resources that should be allocated to the associated data traffic. The ADSPEC object was used to inform the receiver and intermediate hops of the actual resources available for the associated data traffic.",
      "zh-CHS": "带宽参数通过几个对RSVP不透明的对象在RSVP（[RFC2210]、[RFC3209]和[RFC3473]）内传输。虽然对RSVP不透明，但这些对象支持RSVP会话发送方（入口）和接收方（出口）之间带宽信息通信的特定模型。[RFC2205]中定义并在[RFC3209]中维护的原始通信模型在Path消息中使用SENDER_TSPEC和ADSPEC对象，在Resv消息中使用FLOWSPEC对象。SENDER_TSPEC对象用于指示发件人的数据生成能力。FLOWSPEC对象由接收方发出，并指示应分配给相关数据通信的资源。ADSPEC对象用于通知接收器和中间跃点相关数据通信的实际可用资源。"
    },
    {
      "indent": 3,
      "text": "With the introduction of bidirectional LSPs in [RFC3473], the model of communication of bandwidth parameters was implicitly changed. In the context of [RFC3473] bidirectional LSPs, the SENDER_TSPEC object indicates the desired resources for both upstream and downstream directions. The FLOWSPEC object is simply confirmation of the allocated resources. The definition of the ADSPEC object is either unmodified and only has meaning for downstream traffic, or is implicitly or explicitly ([RFC4606] and [RFC6003]) irrelevant.",
      "zh-CHS": "随着[RFC3473]中双向LSP的引入，带宽参数的通信模型发生了隐式变化。在[RFC3473]双向LSP的上下文中，发送方_TSPEC对象指示上游和下游方向的所需资源。FLOWSPEC对象只是确认分配的资源。ADSPEC对象的定义要么未修改且仅对下游流量有意义，要么隐式或显式（[RFC4606]和[RFC6003]）不相关。"
    },
    {
      "indent": 0,
      "text": "1.2. Approach Overview",
      "section_title": true,
      "zh-CHS": "1.2. 方法概述"
    },
    {
      "indent": 3,
      "text": "The approach for supporting asymmetric bandwidth bidirectional LSPs defined in this document builds on the original RSVP model for the transport of traffic-related parameters and GMPLS's support for bidirectional LSPs.",
      "zh-CHS": "本文中定义的支持非对称带宽双向LSP的方法建立在用于传输流量相关参数的原始RSVP模型和GMPLS对双向LSP的支持的基础上。"
    },
    {
      "indent": 3,
      "text": "The defined approach is generic and can be applied to any switching technology supported by GMPLS. With this approach, the existing SENDER_TSPEC, ADSPEC, and FLOWSPEC objects are complemented with the addition of new UPSTREAM_TSPEC, UPSTREAM_ADSPEC, and UPSTREAM_FLOWSPEC objects. The existing objects are used in the original fashion defined in [RFC2205] and [RFC2210], and refer only to traffic associated with the LSP flowing in the downstream direction. The new objects are used in exactly the same fashion as the old objects, but refer to the upstream traffic flow Figure 1 shows the bandwidth-related objects used for asymmetric bandwidth bidirectional LSPs.",
      "zh-CHS": "定义的方法是通用的，可以应用于GMPLS支持的任何交换技术。通过这种方法，现有的SENDER_TSPEC、ADSPEC和FLOWSPEC对象可以通过添加新的上游_TSPEC、上游_ADSPEC和上游_FLOWSPEC对象来补充。现有对象以[RFC2205]和[RFC2210]中定义的原始方式使用，并且仅指与在下游方向流动的LSP相关联的流量。新对象的使用方式与旧对象完全相同，但请参阅上游业务流。图1显示了用于非对称带宽双向LSP的带宽相关对象。"
    },
    {
      "indent": 20,
      "text": "|---|        Path        |---|\n| I |------------------->| E |\n| n | -SENDER_TSPEC      | g |\n| g | -ADSPEC            | r |\n| r | -UPSTREAM_FLOWSPEC | e |\n| e |                    | s |\n| s |        Resv        | s |\n| s |<-------------------|   |\n|   | -FLOWSPEC          |   |\n|   | -UPSTREAM_TSPEC    |   |\n|   | -UPSTREAM_ADSPEC   |   |\n|---|                    |---|",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "Figure 1: Generic Asymmetric Bandwidth Bidirectional LSPs",
      "zh-CHS": "图1：通用非对称带宽双向LSP"
    },
    {
      "indent": 3,
      "text": "The extensions defined in this document are limited to Point-to-Point (P2P) LSPs. Support for Point-to-Multipoint (P2MP) bidirectional LSPs is not currently defined and, as such, not covered in this document.",
      "zh-CHS": "本文档中定义的扩展仅限于点对点（P2P）LSP。当前未定义对点对多点（P2MP）双向LSP的支持，因此，本文档未涵盖此支持。"
    },
    {
      "indent": 0,
      "text": "1.3. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "1.3. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Generalized Asymmetric Bandwidth Bidirectional LSPs",
      "section_title": true,
      "zh-CHS": "2. 广义非对称带宽双向LSP"
    },
    {
      "indent": 3,
      "text": "The setup of an asymmetric bandwidth bidirectional LSP is signaled using the bidirectional procedures defined in [RFC3473] together with the inclusion of the new UPSTREAM_FLOWSPEC, UPSTREAM_TSPEC, and UPSTREAM_ADSPEC objects.",
      "zh-CHS": "使用[RFC3473]中定义的双向程序以及新的上游_FLOWSPEC、上游_TSPEC和上游_ADSPEC对象，向不对称带宽双向LSP的设置发送信号。"
    },
    {
      "indent": 3,
      "text": "The new upstream objects carry the same information and are used in the same fashion as the existing downstream objects; they differ in that they relate to traffic flowing in the upstream direction while",
      "zh-CHS": "新的上游对象携带相同的信息，并以与现有下游对象相同的方式使用；它们的不同之处在于，它们与上游方向的交通流有关，而"
    },
    {
      "indent": 3,
      "text": "the existing objects relate to traffic flowing in the downstream direction. The new objects also differ in that they are carried in messages traveling in the opposite direction.",
      "zh-CHS": "现有对象与下游方向的交通流相关。新对象的不同之处还在于，它们以相反的方向传递信息。"
    },
    {
      "indent": 0,
      "text": "2.1. UPSTREAM_FLOWSPEC Object",
      "section_title": true,
      "zh-CHS": "2.1. 上游流规范对象"
    },
    {
      "indent": 3,
      "text": "The format of an UPSTREAM_FLOWSPEC object is the same as a FLOWSPEC object [RFC2210]. This includes the definition of class types and their formats. The class number of the UPSTREAM_FLOWSPEC object is 120 (of the form 0bbbbbbb).",
      "zh-CHS": "上游_FLOWSPEC对象的格式与FLOWSPEC对象的格式相同[RFC2210]。这包括类类型及其格式的定义。上游_FLOWSPEC对象的类号为120（形式为0bbb）。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Procedures",
      "section_title": true,
      "zh-CHS": "2.1.1. 程序"
    },
    {
      "indent": 3,
      "text": "The Path message of an asymmetric bandwidth bidirectional LSP MUST contain an UPSTREAM_FLOWSPEC object and MUST use the bidirectional LSP formats and procedures defined in [RFC3473]. The C-Type of the UPSTREAM_FLOWSPEC object MUST match the C-Type of the SENDER_TSPEC object used in the Path message. The contents of the UPSTREAM_FLOWSPEC object MUST be constructed using a format and procedures consistent with those used to construct the FLOWSPEC object that will be used for the LSP, e.g., [RFC2210] or [RFC4328].",
      "zh-CHS": "非对称带宽双向LSP的路径消息必须包含上游\\u FLOWSPEC对象，并且必须使用[RFC3473]中定义的双向LSP格式和过程。上游\\u FLOWSPEC对象的C类型必须与路径消息中使用的发送方\\u TSPEC对象的C类型匹配。上游_FLOWSPEC对象的内容必须使用与用于构建将用于LSP的FLOWSPEC对象的格式和程序一致的格式和程序来构建，例如[RFC2210]或[RFC4328]。"
    },
    {
      "indent": 3,
      "text": "Nodes processing a Path message containing an UPSTREAM_FLOWSPEC object MUST use the contents of the UPSTREAM_FLOWSPEC object in the upstream label and the resource allocation procedure defined in Section 3.1 of [RFC3473]. Consistent with [RFC3473], a node that is unable to allocate a label or internal resources based on the contents of the UPSTREAM_FLOWSPEC object MUST issue a PathErr message with a \"Routing problem/MPLS label allocation failure\" indication.",
      "zh-CHS": "处理包含上游\\u FLOWSPEC对象的路径消息的节点必须使用上游标签中上游\\u FLOWSPEC对象的内容以及[RFC3473]第3.1节中定义的资源分配过程。与[RFC3473]一致，无法根据上游\\u FLOWSPEC对象的内容分配标签或内部资源的节点必须发出带有“路由问题/MPLS标签分配失败”指示的PathErr消息。"
    },
    {
      "indent": 0,
      "text": "2.2. UPSTREAM_TSPEC Object",
      "section_title": true,
      "zh-CHS": "2.2. 上游_TSPEC对象"
    },
    {
      "indent": 3,
      "text": "The format of an UPSTREAM_TSPEC object is the same as a SENDER_TSPEC object, which includes the definition of class types and their formats. The class number of the UPSTREAM_TSPEC object is 121 (of the form 0bbbbbbb).",
      "zh-CHS": "上游_TSPEC对象的格式与发送方_TSPEC对象相同，其中包括类类型及其格式的定义。上游_TSPEC对象的类号为121（形式为0bbb）。"
    },
    {
      "indent": 0,
      "text": "2.2.1. Procedures",
      "section_title": true,
      "zh-CHS": "2.2.1. 程序"
    },
    {
      "indent": 3,
      "text": "The UPSTREAM_TSPEC object describes the traffic flow that originates at the egress. The UPSTREAM_TSPEC object MUST be included in any Resv message that corresponds to a Path message containing an UPSTREAM_FLOWSPEC object. The C-Type of the UPSTREAM_TSPEC object MUST match the C-Type of the corresponding UPSTREAM_FLOWSPEC object. The contents of the UPSTREAM_TSPEC object MUST be constructed using a format and procedures consistent with those used to construct the FLOWSPEC object that will be used for the LSP, e.g., [RFC2210] or [RFC4328]. The contents of the UPSTREAM_TSPEC object MAY differ from",
      "zh-CHS": "上游_TSPEC对象描述源自出口的交通流。上游_TSPEC对象必须包含在与包含上游_FLOWSPEC对象的路径消息相对应的任何Resv消息中。上游_TSPEC对象的C类型必须与相应上游_FLOWSPEC对象的C类型匹配。上游_TSPEC对象的内容必须使用与用于构建将用于LSP的FLOWSPEC对象的格式和程序一致的格式和程序来构建，例如[RFC2210]或[RFC4328]。上游_TSPEC对象的内容可能不同于"
    },
    {
      "indent": 3,
      "text": "contents of the UPSTREAM_FLOWSPEC object based on application data transmission requirements.",
      "zh-CHS": "基于应用程序数据传输要求的上游\\u FLOWSPEC对象的内容。"
    },
    {
      "indent": 3,
      "text": "When an UPSTREAM_TSPEC object is received by an ingress, the ingress MAY determine that the original reservation is insufficient to satisfy the traffic flow. In this case, the ingress MAY tear down the LSP and send a PathTear message. Alternatively, the ingress MAY issue a Path message with an updated UPSTREAM_FLOWSPEC object to modify the resources requested for the upstream traffic flow. This modification might require the LSP to be re-routed, and in extreme cases might result in the LSP being torn down when sufficient resources are not available along the path of the LSP.",
      "zh-CHS": "当入口接收到上游_TSPEC对象时，入口可确定原始保留不足以满足业务流。在这种情况下，入口可能会断开LSP并发送PathTear消息。或者，入口可以发出具有更新的上游流规范对象的路径消息，以修改为上游业务流请求的资源。这种修改可能需要重新路由LSP，在极端情况下，当LSP路径上没有足够的资源可用时，可能会导致LSP被拆除。"
    },
    {
      "indent": 0,
      "text": "2.3. UPSTREAM_ADSPEC Object",
      "section_title": true,
      "zh-CHS": "2.3. 上游ADSPEC对象"
    },
    {
      "indent": 3,
      "text": "The format of an UPSTREAM_ADSPEC object is the same as an ADSPEC object. This includes the definition of class types and their formats. The class number of the UPSTREAM_ADSPEC object is 122 (of the form 0bbbbbbb).",
      "zh-CHS": "上游\\u ADSPEC对象的格式与ADSPEC对象相同。这包括类类型及其格式的定义。上游_ADSPEC对象的类号为122（形式为0bbb）。"
    },
    {
      "indent": 0,
      "text": "2.3.1. Procedures",
      "section_title": true,
      "zh-CHS": "2.3.1. 程序"
    },
    {
      "indent": 3,
      "text": "The UPSTREAM_ADSPEC object MAY be included in any Resv message that corresponds to a Path message containing an UPSTREAM_FLOWSPEC object. The C-Type of the UPSTREAM_TSPEC object MUST be consistent with the C-Type of the corresponding UPSTREAM_FLOWSPEC object. The contents of the UPSTREAM_ADSPEC object MUST be constructed using a format and procedures consistent with those used to construct the ADSPEC object that will be used for the LSP, e.g., [RFC2210] or [RFC6003]. The UPSTREAM_ADSPEC object is processed using the same procedures as the ADSPEC object and, as such, MAY be updated or added at transit nodes.",
      "zh-CHS": "上游_ADSPEC对象可以包括在与包含上游_FLOWSPEC对象的路径消息相对应的任何Resv消息中。上游_TSPEC对象的C类型必须与相应上游_FLOWSPEC对象的C类型一致。上游_ADSPEC对象的内容必须使用与用于构造将用于LSP的ADSPEC对象的格式和程序一致的格式和程序来构造，例如，[RFC2210]或[RFC6003]。上游ADSPEC对象使用与ADSPEC对象相同的过程进行处理，因此，可以在传输节点处更新或添加。"
    },
    {
      "indent": 0,
      "text": "3. Packet Formats",
      "section_title": true,
      "zh-CHS": "3. 包格式"
    },
    {
      "indent": 3,
      "text": "This section presents the RSVP message-related formats as modified by this section. This document modifies formats defined in [RFC2205], [RFC3209], and [RFC3473]. See [RFC5511] for the syntax used by RSVP. Unmodified formats are not listed. Three new objects are defined in this section:",
      "zh-CHS": "本节介绍本节修改的RSVP消息相关格式。本文件修改了[RFC2205]、[RFC3209]和[RFC3473]中定义的格式。RSVP使用的语法请参见[RFC5511]。未修改的格式未列出。本节定义了三个新对象："
    },
    {
      "indent": 6,
      "text": "Object name            Applicable RSVP messages\n---------------        ------------------------\nUPSTREAM_FLOWSPEC      Path, PathTear, PathErr, and Notify\n                           (via sender descriptor)\nUPSTREAM_TSPEC         Resv, ResvConf, ResvTear, ResvErr, and\n                           Notify (via flow descriptor list)\nUPSTREAM_ADSPEC        Resv, ResvConf, ResvTear, ResvErr, and\n                           Notify (via flow descriptor list)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The format of the sender description for bidirectional asymmetric LSPs is:",
      "zh-CHS": "双向非对称LSP的发送方描述格式为："
    },
    {
      "indent": 6,
      "text": "<sender descriptor> ::=  <SENDER_TEMPLATE> <SENDER_TSPEC>\n                         [ <ADSPEC> ]\n                         [ <RECORD_ROUTE> ]\n                         [ <SUGGESTED_LABEL> ]\n                         [ <RECOVERY_LABEL> ]\n                         <UPSTREAM_LABEL>\n                         <UPSTREAM_FLOWSPEC>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The format of the flow descriptor list for bidirectional asymmetric LSPs is:",
      "zh-CHS": "双向非对称LSP的流描述符列表格式为："
    },
    {
      "indent": 6,
      "text": "<flow descriptor list> ::= <FF flow descriptor list>\n                         | <SE flow descriptor>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "<FF flow descriptor list> ::= <FLOWSPEC>\n                         <UPSTREAM_TSPEC> [ <UPSTREAM_ADSPEC> ]\n                         <FILTER_SPEC>\n                         <LABEL> [ <RECORD_ROUTE> ]\n                         | <FF flow descriptor list>\n                         <FF flow descriptor>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "<FF flow descriptor> ::= [ <FLOWSPEC> ]\n                         [ <UPSTREAM_TSPEC>] [ <UPSTREAM_ADSPEC> ]\n                         <FILTER_SPEC> <LABEL>\n                         [ <RECORD_ROUTE> ]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "<SE flow descriptor> ::= <FLOWSPEC>\n                         <UPSTREAM_TSPEC> [ <UPSTREAM_ADSPEC> ]\n                         <SE filter spec list>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "<SE filter spec list> is unmodified by this document.",
      "zh-CHS": "<SE过滤器规范列表>未被本文档修改。"
    },
    {
      "indent": 0,
      "text": "4. Compatibility",
      "section_title": true,
      "zh-CHS": "4. 兼容性"
    },
    {
      "indent": 3,
      "text": "This extension reuses and extends semantics and procedures defined in [RFC2205], [RFC3209], and [RFC3473] to support bidirectional LSPs with asymmetric bandwidth. Three new objects are defined to indicate the use of asymmetric bandwidth. Each of these objects is defined with class numbers in the form 0bbbbbbb. Per [RFC2205], nodes not supporting this extension will not recognize the new class numbers and will respond with an \"Unknown Object Class\" error. The error message will propagate to the ingress, which can then take action to avoid the path with the incompatible node or can simply terminate the session.",
      "zh-CHS": "此扩展重用并扩展了[RFC2205]、[RFC3209]和[RFC3473]中定义的语义和过程，以支持具有不对称带宽的双向LSP。定义了三个新对象以指示不对称带宽的使用。这些对象中的每一个都是以0bbb的形式用类号定义的。根据[RFC2205]，不支持此扩展的节点将无法识别新的类编号，并将以“未知对象类”错误进行响应。错误消息将传播到入口，入口可以采取措施避免与不兼容节点的路径，也可以简单地终止会话。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA has made the assignments described below in the \"Class Names, Class Numbers, and Class Types\" section of the \"RSVP PARAMETERS\" registry.",
      "zh-CHS": "IANA已在“RSVP参数”注册表的“类名、类号和类类型”部分进行了如下所述的分配。"
    },
    {
      "indent": 0,
      "text": "5.1. UPSTREAM_FLOWSPEC Object",
      "section_title": true,
      "zh-CHS": "5.1. 上游流规范对象"
    },
    {
      "indent": 3,
      "text": "The class named UPSTREAM_FLOWSPEC has been assigned in the 0bbbbbbb range (120) with the following definition:",
      "zh-CHS": "名为UPSTREAM_FLOWSPEC的类已在0bbb范围（120）中分配，定义如下："
    },
    {
      "indent": 8,
      "text": "Class Types or C-types:",
      "zh-CHS": "类别类型或C类型："
    },
    {
      "indent": 8,
      "text": "Same values as FLOWSPEC object (C-Num 9)",
      "zh-CHS": "与FLOWSPEC对象相同的值（C-Num 9）"
    },
    {
      "indent": 0,
      "text": "5.2. UPSTREAM_TSPEC Object",
      "section_title": true,
      "zh-CHS": "5.2. 上游_TSPEC对象"
    },
    {
      "indent": 3,
      "text": "The class named UPSTREAM_TSPEC has been assigned in the 0bbbbbbb range (121) with the following definition:",
      "zh-CHS": "名为上游_TSPEC的类已分配到0bbb范围（121）中，定义如下："
    },
    {
      "indent": 8,
      "text": "Class Types or C-types:",
      "zh-CHS": "类别类型或C类型："
    },
    {
      "indent": 8,
      "text": "Same values as SENDER_TSPEC object (C-Num 12)",
      "zh-CHS": "与发送方_TSPEC对象相同的值（C-Num 12）"
    },
    {
      "indent": 0,
      "text": "5.3. UPSTREAM_ADSPEC Object",
      "section_title": true,
      "zh-CHS": "5.3. 上游ADSPEC对象"
    },
    {
      "indent": 3,
      "text": "The class named UPSTREAM_ADSPEC has been assigned in the 0bbbbbbb range (122) with the following definition:",
      "zh-CHS": "名为UPSTREAM_ADSPEC的类已分配到0bbb范围（122）中，定义如下："
    },
    {
      "indent": 8,
      "text": "Class Types or C-types:",
      "zh-CHS": "类别类型或C类型："
    },
    {
      "indent": 8,
      "text": "Same values as ADSPEC object (C-Num 13)",
      "zh-CHS": "与ADSPEC对象相同的值（C-Num 13）"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document introduces new message objects for use in GMPLS signaling [RFC3473] -- specifically the UPSTREAM_TSPEC, UPSTREAM_ADSPEC, and UPSTREAM_FLOWSPEC objects. These objects parallel the existing SENDER_TSPEC, ADSPEC, and FLOWSPEC objects but are used in the opposite direction. As such, any vulnerabilities that are due to the use of the old objects now apply to messages flowing in the reverse direction.",
      "zh-CHS": "本文档介绍了GMPLS信令[RFC3473]中使用的新消息对象，特别是上游\\u TSPEC、上游\\u ADSPEC和上游\\u FLOWSPEC对象。这些对象与现有的SENDER_TSPEC、ADSPEC和FLOWSPEC对象平行，但使用方向相反。因此，由于使用旧对象而导致的任何漏洞现在都适用于反向流动的消息。"
    },
    {
      "indent": 3,
      "text": "From a message standpoint, this document does not introduce any new signaling messages or change the relationship between LSRs that are adjacent in the control plane. As such, this document introduces no additional message- or neighbor-related security considerations.",
      "zh-CHS": "从消息的角度来看，本文档不会引入任何新的信令消息，也不会更改控制平面中相邻的LSR之间的关系。因此，本文档不引入其他与消息或邻居相关的安全注意事项。"
    },
    {
      "indent": 3,
      "text": "See [RFC3473] for relevant security considerations and [RFC5920] for a more general discussion on RSVP-TE security discussions.",
      "zh-CHS": "有关安全注意事项，请参见[RFC3473]，有关RSVP-TE安全讨论的更一般性讨论，请参见[RFC5920]。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Ed., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "zh-CHS": "[RFC2205]Braden，R.，Ed.，Zhang，L.，Berson，S.，Herzog，S.，和S.Jamin，“资源预留协议（RSVP）——版本1功能规范”，RFC 22052997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2210] Wroclawski, J., \"The Use of RSVP with IETF Integrated Services\", RFC 2210, September 1997.",
      "zh-CHS": "[RFC2210]Wroclawski，J.，“RSVP与IETF集成服务的使用”，RFC 2210，1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "zh-CHS": "[RFC3209]Awduche，D.，Berger，L.，Gan，D.，Li，T.，Srinivasan，V.，和G.Swallow，“RSVP-TE：LSP隧道RSVP的扩展”，RFC 3209，2001年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003.",
      "zh-CHS": "[RFC3473]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令资源预留协议流量工程（RSVP-TE）扩展”，RFC 3473，2003年1月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC4606] Mannie, E. and D. Papadimitriou, \"Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control\", RFC 4606, August 2006.",
      "zh-CHS": "[RFC4606]Mannie，E.和D.Papadimitriou，“同步光网络（SONET）和同步数字体系（SDH）控制的通用多协议标签交换（GMPLS）扩展”，RFC 4606，2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4328] Papadimitriou, D., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Extensions for G.709 Optical Transport Networks Control\", RFC 4328, January 2006.",
      "zh-CHS": "[RFC4328]Papadimitriou，D.，编辑，“G.709光传输网络控制的通用多协议标签交换（GMPLS）信令扩展”，RFC 4328，2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5511] Farrel, A., \"Routing Backus-Naur Form (RBNF): A Syntax Used to Form Encoding Rules in Various Routing Protocol Specifications\", RFC 5511, April 2009.",
      "zh-CHS": "[RFC5511]Farrel，A.，“路由Backus-Naur形式（RBNF）：用于在各种路由协议规范中形成编码规则的语法”，RFC 5511，2009年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5654] Niven-Jenkins, B., Ed., Brungard, D., Ed., Betts, M., Ed., Sprecher, N., and S. Ueno, \"Requirements of an MPLS Transport Profile\", RFC 5654, September 2009.",
      "zh-CHS": "[RFC5654]Niven Jenkins，B.，Ed.，Brungard，D.，Ed.，Betts，M.，Ed.，Sprecher，N.，和S.Ueno，“MPLS传输配置文件的要求”，RFC 56542009年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, July 2010.",
      "zh-CHS": "[RFC5920]方，L.，编辑，“MPLS和GMPLS网络的安全框架”，RFC 5920，2010年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5467] Berger, L., Takacs, A., Caviglia, D., Fedyk, D., and J. Meuric, \"GMPLS Asymmetric Bandwidth Bidirectional Label Switched Paths (LSPs)\", RFC 5467, March 2009.",
      "zh-CHS": "[RFC5467]Berger，L.，Takacs，A.，Caviglia，D.，Fedyk，D.，和J.Meuria，“GMPLS非对称带宽双向标签交换路径（LSP）”，RFC 54672009年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6003] Papadimitriou, D., \"Ethernet Traffic Parameters\", RFC 6003, October 2010.",
      "zh-CHS": "[RFC6003]Papadimitriou，D.，“以太网流量参数”，RFC6003，2010年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6060] Fedyk, D., Shah, H., Bitar, N., and A. Takacs, \"Generalized Multiprotocol Label Switching (GMPLS) Control of Ethernet Provider Backbone Traffic Engineering (PBB-TE)\", RFC 6060, March 2011.",
      "zh-CHS": "[RFC6060]Fedyk，D.，Shah，H.，Bitar，N.，和A.Takacs，“以太网提供商主干流量工程（PBB-TE）的通用多协议标签交换（GMPLS）控制”，RFC 6060，2011年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Attila Takacs Ericsson Konyves Kalman krt. 11. Budapest, 1097 Hungary",
      "zh-CHS": "阿提拉·塔卡什·爱立信·柯尼夫·卡尔曼·克尔特。11布达佩斯，1097匈牙利"
    },
    {
      "indent": 3,
      "text": "EMail: attila.takacs@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Lou Berger LabN Consulting, L.L.C.",
      "zh-CHS": "Lou Berger LabN咨询公司，L.L.C。"
    },
    {
      "indent": 3,
      "text": "EMail: lberger@labn.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Diego Caviglia Ericsson Via A. Negrone 1/A Genova-Sestri Ponente, Italy",
      "zh-CHS": "Diego Caviglia Ericsson Via A.Negrone 1/A Genova Sestri Ponente，意大利"
    },
    {
      "indent": 3,
      "text": "Phone: +390106003738\nFax:\nEMail: diego.caviglia@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Don Fedyk Alcatel-Lucent Groton, MA USA",
      "zh-CHS": "美国马萨诸塞州朗讯格罗顿唐·费迪克·阿尔卡特"
    },
    {
      "indent": 3,
      "text": "EMail: donald.fedyk@alcatel-lucent.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Julien Meuric France Telecom Orange 2, avenue Pierre Marzin Lannion Cedex, 22307 France",
      "zh-CHS": "Julien Meuri法国电信橙2号，皮埃尔·马津·拉尼翁·塞德克斯大道，法国22307"
    },
    {
      "indent": 3,
      "text": "EMail: julien.meuric@orange.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}