{
  "title": {
    "text": "RFC 6985: IMIX Genome: Specification of Variable Packet Sizes for Additional Testing",
    "zh-CHS": "RFC 6985"
  },
  "number": 6985,
  "created_at": "2021-11-04 17:55:45.520510+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Morton\nRequest for Comments: 6985                                     AT&T Labs\nCategory: Informational                                        July 2013\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "IMIX Genome: Specification of Variable Packet Sizes for Additional Testing",
      "zh-CHS": "IMIX基因组：附加测试的可变数据包大小规范"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Benchmarking methodologies have always relied on test conditions with constant packet sizes, with the goal of understanding what network device capability has been tested. Tests with a constant packet size reveal device capabilities but differ significantly from the conditions encountered in operational deployment, so additional tests are sometimes conducted with a mixture of packet sizes, or \"IMIX\" (\"Internet Mix\"). The mixture of sizes a networking device will encounter is highly variable and depends on many factors. An IMIX suited for one networking device and deployment will not be appropriate for another. However, the mix of sizes may be known, and the tester may be asked to augment the fixed-size tests. To address this need and the perpetual goal of specifying repeatable test conditions, this document defines a way to specify the exact repeating sequence of packet sizes from the usual set of fixed sizes and from other forms of mixed-size specification.",
      "zh-CHS": "基准测试方法始终依赖于具有恒定数据包大小的测试条件，目的是了解测试了哪些网络设备能力。具有恒定数据包大小的测试揭示了设备的能力，但与操作部署中遇到的条件有很大差异，因此有时会使用数据包大小的混合或“IMIX”（“Internet混合”）进行额外的测试。网络设备将遇到的大小混合是高度可变的，取决于许多因素。适用于一个网络设备和部署的IMIX将不适用于另一个。然而，尺寸的混合可能是已知的，测试人员可能被要求增加固定尺寸测试。为了满足这一需求以及指定可重复测试条件的永久目标，本文件定义了一种方法，用于从通常的固定大小集和其他形式的混合大小规范中指定数据包大小的精确重复序列。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6985.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6985."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2013 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Requirements Language ...........................................3\n3. Scope and Goals .................................................3\n4. Specification of the IMIX Genome ................................4\n5. Specification of a Custom IMIX ..................................6\n6. Reporting Long or Pseudorandom Packet Sequences .................7\n   6.1. Run-Length Encoding ........................................7\n   6.2. Table of Proportions .......................................7\n   6.3. Deterministic Algorithm ....................................7\n   6.4. Pseudorandom Length Algorithm ..............................8\n   6.5. Pseudorandom Sequence Algorithm ............................8\n7. Security Considerations .........................................8\n8. Acknowledgements ................................................8\n9. References ......................................................9\n   9.1. Normative References .......................................9\n   9.2. Informative References .....................................9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "This memo defines a method to unambiguously specify the sequence of packet sizes used in a load test.",
      "zh-CHS": "此备忘录定义了一种方法，用于明确指定负载测试中使用的数据包大小顺序。"
    },
    {
      "indent": 3,
      "text": "Benchmarking methodologies [RFC2544] have always relied on test conditions with constant packet sizes, with the goal of understanding what network device capability has been tested. Tests with the smallest size stress the header processing capacity, and tests with the largest size stress the overall bit-processing capacity. Tests with sizes in between may determine the transition between these two capacities.",
      "zh-CHS": "基准测试方法[RFC2544]始终依赖于恒定数据包大小的测试条件，目的是了解已测试的网络设备能力。具有最小大小的测试强调报头处理能力，而具有最大大小的测试强调整体比特处理能力。尺寸介于两者之间的试验可确定这两种容量之间的转换。"
    },
    {
      "indent": 3,
      "text": "Streams of constant packet size differ significantly from the conditions encountered in operational deployment, so additional tests are sometimes conducted with a mixture of packet sizes. The set of sizes used is often called an Internet Mix, or \"IMIX\" [Spirent] [IXIA] [Agilent].",
      "zh-CHS": "恒定数据包大小的数据流与操作部署中遇到的条件有很大差异，因此有时会使用数据包大小的混合进行额外的测试。所使用的一组大小通常称为互联网组合，或“IMIX”[Spirent][IXIA][Agilent]。"
    },
    {
      "indent": 3,
      "text": "The mixture of sizes a networking device will encounter is highly variable and depends on many factors. An IMIX suited for one networking device and deployment will not be appropriate for another. However, the mix of sizes may be known, and the tester may be asked to augment the fixed-size tests. The references above cite the original studies and their methodologies. Similar methods can be used to determine new size mixes present on a link or network. We note that the architecture for IP Flow Information Export [RFC5470] provides one method to gather packet-size information on private networks.",
      "zh-CHS": "网络设备将遇到的大小混合是高度可变的，取决于许多因素。适用于一个网络设备和部署的IMIX将不适用于另一个。然而，尺寸的混合可能是已知的，测试人员可能被要求增加固定尺寸测试。上述参考文献引用了原始研究及其方法。类似的方法可用于确定链路或网络上存在的新大小混合。我们注意到，IP流信息导出架构[RFC5470]提供了一种在专用网络上收集数据包大小信息的方法。"
    },
    {
      "indent": 3,
      "text": "To address this need and the perpetual goal of specifying repeatable test conditions, this memo proposes a way to specify the exact repeating sequence of packet sizes from the usual set of fixed sizes: the IMIX Genome. Other, less exact forms of size specification are also recommended for extremely complicated or customized size mixes. We apply the term \"genome\" to infer that the entire test packet-size sequence can be replicated if this information is known -- a parallel to the information needed for biological replication.",
      "zh-CHS": "为了满足这一需求和指定可重复测试条件的永久目标，本备忘录提出了一种方法，从通常的固定大小集：IMIX基因组中指定数据包大小的精确重复序列。对于极其复杂或定制的尺寸混合，也建议采用其他不太精确的尺寸规格形式。我们使用“基因组”一词来推断，如果已知该信息，整个测试数据包大小序列可以被复制——与生物复制所需的信息类似。"
    },
    {
      "indent": 3,
      "text": "This memo takes the position that it cannot be proven for all circumstances that the sequence of packet sizes does not affect the test result; thus, a standardized specification of sequence is valuable.",
      "zh-CHS": "本备忘录的立场是，无法证明在所有情况下，数据包大小的顺序不会影响测试结果；因此，序列的标准化规范是有价值的。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "zh-CHS": "2. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Scope and Goals",
      "section_title": true,
      "zh-CHS": "3. 范围和目标"
    },
    {
      "indent": 3,
      "text": "This memo defines a method to unambiguously specify the sequence of packet sizes that have been used in a load test, assuming that a relevant mix of sizes is known to the tester and the length of the repeating sequence is not very long (<100 packets).",
      "zh-CHS": "本备忘录定义了一种方法，用于明确指定负载测试中使用的数据包大小顺序，前提是测试人员已知大小的相关组合，并且重复序列的长度不是很长（<100个数据包）。"
    },
    {
      "indent": 3,
      "text": "The IMIX Genome will allow an exact sequence of packet sizes to be communicated as a single-line name, resolving the current ambiguity with results that simply refer to \"IMIX\". This aspect is critical because no ability has been demonstrated to extrapolate results from",
      "zh-CHS": "IMIX基因组将允许将数据包大小的精确序列作为一个单行名称进行通信，从而解决当前的歧义，结果仅涉及“IMIX”。这一方面至关重要，因为尚未证明有能力从中推断结果"
    },
    {
      "indent": 3,
      "text": "one IMIX to another IMIX -- and certainly no ability to extrapolate results to other circumstances -- even when the mix varies only slightly from another IMIX.",
      "zh-CHS": "一个IMIX到另一个IMIX——当然没有能力将结果外推到其他情况——即使组合与另一个IMIX的变化很小。"
    },
    {
      "indent": 3,
      "text": "While documentation of the exact sequence is ideal, the memo also covers the case where the sequence of sizes is very long or may be generated by a pseudorandom process.",
      "zh-CHS": "虽然精确序列的记录是理想的，但备忘录也涵盖了尺寸序列很长或可能由伪随机过程生成的情况。"
    },
    {
      "indent": 3,
      "text": "It is a colossal non-goal to standardize one or more versions of the IMIX. This topic has been discussed on many occasions on the BMWG mailing list [IMIXonList]. The goal is to enable customization with minimal constraints while fostering repeatable testing once the fixed-size testing is complete. Thus, the requirements presented in this specification, expressed in [RFC2119] terms, are intended for those performing/reporting laboratory tests to improve clarity and repeatability.",
      "zh-CHS": "标准化一个或多个版本的IMIX是一个巨大的非目标。BMWG邮件列表[IMIXonList]中已多次讨论过此主题。目标是在固定大小测试完成后，在支持可重复测试的同时，以最小的约束实现定制。因此，本规范中以[RFC2119]术语表示的要求适用于执行/报告实验室试验的人员，以提高清晰度和可重复性。"
    },
    {
      "indent": 0,
      "text": "4. Specification of the IMIX Genome",
      "section_title": true,
      "zh-CHS": "4. IMIX基因组规范"
    },
    {
      "indent": 3,
      "text": "The IMIX Genome is specified in the following format:",
      "zh-CHS": "IMIX基因组按以下格式指定："
    },
    {
      "indent": 3,
      "text": "IMIX - 123456...x",
      "zh-CHS": "IMIX-123456…x"
    },
    {
      "indent": 3,
      "text": "where each number is replaced by the letter corresponding to the size of the packet at that position in the sequence. The following table gives the letter encoding for the [RFC2544] standard sizes (64, 128, 256, 512, 1024, 1280, and 1518 bytes) and \"jumbo\" sizes (2112, 9000, and 16000 bytes). Note that the 4-octet Ethernet frame check sequence may fail to detect bit errors in the larger jumbo frames [Jumbo1] [Jumbo2].",
      "zh-CHS": "其中，每个数字由与序列中该位置处的数据包大小相对应的字母替换。下表给出了[RFC2544]标准大小（64、128、256、512、1024、1280和1518字节）和“巨型”大小（2112、9000和16000字节）的字母编码。注意，4-八位以太网帧检查序列可能无法检测较大的巨型帧[Jumbo1][Jumbo2]中的比特错误。"
    },
    {
      "indent": 20,
      "text": "+--------------+--------------------+\n| Size (Bytes) | Genome Code Letter |\n+--------------+--------------------+\n| 64           | a                  |\n| 128          | b                  |\n| 256          | c                  |\n| 512          | d                  |\n| 1024         | e                  |\n| 1280         | f                  |\n| 1518         | g                  |\n| 2112         | h                  |\n| 9000         | i                  |\n| 16000        | j                  |\n| MTU          | z                  |\n+--------------+--------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For example, a five-packet sequence with sizes 64,64,64,1280,1518 would be designated:",
      "zh-CHS": "例如，将指定大小为64,64,6412801518的五个数据包序列："
    },
    {
      "indent": 3,
      "text": "IMIX - aaafg",
      "zh-CHS": "IMIX-aaafg"
    },
    {
      "indent": 3,
      "text": "If z (MTU) is used, the tester MUST specify the length of the MTU in the report.",
      "zh-CHS": "如果使用z（MTU），测试仪必须在报告中指定MTU的长度。"
    },
    {
      "indent": 3,
      "text": "While this approach allows some flexibility, there are also constraints.",
      "zh-CHS": "虽然这种方法允许一些灵活性，但也存在一些限制。"
    },
    {
      "indent": 3,
      "text": "o Packet sizes not defined by RFC 2544 would need to be approximated by those available in the table.",
      "zh-CHS": "o RFC 2544未定义的数据包大小需要与表中的可用数据包大小近似。"
    },
    {
      "indent": 3,
      "text": "o The genome for very long sequences can become undecipherable by humans.",
      "zh-CHS": "o 很长序列的基因组可能无法被人类识别。"
    },
    {
      "indent": 3,
      "text": "Some questions testers must ask and answer when using the IMIX Genome are:",
      "zh-CHS": "当使用IMIX基因组时，测试人员必须问和回答以下问题："
    },
    {
      "indent": 3,
      "text": "1. Multiple source-destination address pairs: Is the IMIX sequence applicable to each pair, across multiple pairs in sets, or across all pairs?",
      "zh-CHS": "1. 多个源-目标地址对：IMIX序列是否适用于每个对、跨集合中的多个对或跨所有对？"
    },
    {
      "indent": 3,
      "text": "2. Multiple tester ports: Is the IMIX sequence applicable to each port, across multiple ports in sets, or across all ports?",
      "zh-CHS": "2. 多个测试仪端口：IMIX序列是否适用于每个端口、集合中的多个端口或所有端口？"
    },
    {
      "indent": 3,
      "text": "The chosen configuration would be expressed in the following general form:",
      "zh-CHS": "所选配置将以以下一般形式表示："
    },
    {
      "indent": 3,
      "text": "+-------------------+------------------------+---------------------+\n| Source Address +  | Destination Address +  | Corresponding IMIX  |\n| Port AND/OR Blade | Port AND/OR Blade      |                     |\n+-------------------+------------------------+---------------------+\n| x.x.x.x Blade2    | y.y.y.y Blade3         | IMIX - aaafg        |\n+-------------------+------------------------+---------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "where testers can specify the IMIX used between any two entities in the test architecture (and \"Blade\" is a component in a multi-component device chassis).",
      "zh-CHS": "其中，测试人员可以指定测试体系结构中任意两个实体之间使用的IMIX（“刀片”是多组件设备机箱中的一个组件）。"
    },
    {
      "indent": 0,
      "text": "5. Specification of a Custom IMIX",
      "section_title": true,
      "zh-CHS": "5. 自定义IMIX的规范"
    },
    {
      "indent": 3,
      "text": "This section describes how to specify an IMIX with locally selected packet sizes.",
      "zh-CHS": "本节介绍如何使用本地选择的数据包大小指定IMIX。"
    },
    {
      "indent": 3,
      "text": "The custom IMIX is specified in the following format:",
      "zh-CHS": "自定义IMIX以以下格式指定："
    },
    {
      "indent": 3,
      "text": "CUSTOM IMIX - 123456...x",
      "zh-CHS": "自定义IMIX-123456…x"
    },
    {
      "indent": 3,
      "text": "where each number is replaced by the letter corresponding to the size of the packet at that position in the sequence. The tester MUST complete the following table, giving the letter encoding for each size used, where each set of three lower-case letters would be replaced by the integer size in octets.",
      "zh-CHS": "其中，每个数字由与序列中该位置处的数据包大小相对应的字母替换。测试人员必须填写下表，给出所用每个大小的字母编码，其中每组三个小写字母将替换为八位字节的整数大小。"
    },
    {
      "indent": 20,
      "text": "+--------------+--------------------+\n| Size (Bytes) | Custom Code Letter |\n+--------------+--------------------+\n| aaa          | A                  |\n| bbb          | B                  |\n| ccc          | C                  |\n| ddd          | D                  |\n| eee          | E                  |\n| fff          | F                  |\n| ggg          | G                  |\n| etc.         | up to Z            |\n+--------------+--------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For example, a five-packet sequence with sizes aaa=64,aaa=64,aaa=64,ggg=1020,ggg=1020 would be designated:",
      "zh-CHS": "例如，将指定大小为aaa=64、aaa=64、aaa=64、ggg=1020、ggg=1020的五个数据包序列："
    },
    {
      "indent": 3,
      "text": "CUSTOM IMIX - AAAGG",
      "zh-CHS": "自定义IMIX-AAAGG"
    },
    {
      "indent": 0,
      "text": "6. Reporting Long or Pseudorandom Packet Sequences",
      "section_title": true,
      "zh-CHS": "6. 报告长或伪随机数据包序列"
    },
    {
      "indent": 3,
      "text": "When the IMIX Genome cannot be used (when the sheer length of the sequence would make the genome unmanageable), five options are possible, as noted in the following subsections.",
      "zh-CHS": "当不能使用IMIX基因组时（当序列的绝对长度会使基因组无法管理时），有五种选择是可能的，如下小节所述。"
    },
    {
      "indent": 0,
      "text": "6.1. Run-Length Encoding",
      "section_title": true,
      "zh-CHS": "6.1. 游程编码"
    },
    {
      "indent": 3,
      "text": "When a sequence can be decomposed into a series of short repeating sequences, then a run-length encoding approach MAY be specified as shown in the table below (using the single lower-case letter Genome Codes from Section 4):",
      "zh-CHS": "当一个序列可以分解为一系列短重复序列时，则可以如下表所示指定运行长度编码方法（使用第4节中的单个小写字母基因组代码）："
    },
    {
      "indent": 11,
      "text": "+------------------------------+----------------------+\n| Count of Repeating Sequences | Packet-Size Sequence |\n+------------------------------+----------------------+\n| 20                           | abcd                 |\n| 5                            | ggga                 |\n| 10                           | dcba                 |\n+------------------------------+----------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The run-length encoding approach is also applicable to the custom IMIX as described in Section 5 (where the single upper-case letter Genome Codes would be used instead).",
      "zh-CHS": "游程编码方法也适用于第5节所述的定制IMIX（其中将使用单个大写字母基因组代码）。"
    },
    {
      "indent": 0,
      "text": "6.2. Table of Proportions",
      "section_title": true,
      "zh-CHS": "6.2. 比例表"
    },
    {
      "indent": 3,
      "text": "When the sequence is designed to vary within some proportional constraints, a table simply giving the proportions of each size MAY be used instead.",
      "zh-CHS": "当序列设计为在某些比例约束范围内变化时，可以使用一个简单给出每个尺寸比例的表格。"
    },
    {
      "indent": 7,
      "text": "+-----------+---------------------+---------------------------+\n| IP Length | Percentage of Total | Length(s) at Other Layers |\n+-----------+---------------------+---------------------------+\n| 64        | 23                  | 82                        |\n| 128       | 67                  | 146                       |\n| 1000      | 10                  | 1018                      |\n+-----------+---------------------+---------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Note that the table of proportions also allows non-standard packet sizes but trades the short genome specification and ability to specify the exact sequence for other flexibilities.",
      "zh-CHS": "注意，比例表也允许非标准的数据包大小，但交换了短基因组规格和为其他灵活性指定精确序列的能力。"
    },
    {
      "indent": 0,
      "text": "6.3. Deterministic Algorithm",
      "section_title": true,
      "zh-CHS": "6.3. 确定性算法"
    },
    {
      "indent": 3,
      "text": "If a deterministic packet-size generation method is used (such as a monotonic increase by 1 octet from start value to MTU), then the generation algorithm SHOULD be reported.",
      "zh-CHS": "如果使用确定性数据包大小生成方法（例如从起始值到MTU单调增加1个八位组），则应报告生成算法。"
    },
    {
      "indent": 0,
      "text": "6.4. Pseudorandom Length Algorithm",
      "section_title": true,
      "zh-CHS": "6.4. 伪随机长度算法"
    },
    {
      "indent": 3,
      "text": "If a pseudorandom length generation capability is used, then the generation algorithm SHOULD be reported with the results along with the seed value used. We also recognize the opportunity to randomize inter-packet spacing from a test sender as well as the size, and both spacing and length pseudorandom generation algorithms and seeds SHOULD be reported when used.",
      "zh-CHS": "如果使用伪随机长度生成功能，则生成算法应报告结果以及使用的种子值。我们还认识到有机会将来自测试发送方的数据包间隔以及大小随机化，使用时应报告间隔和长度伪随机生成算法和种子。"
    },
    {
      "indent": 0,
      "text": "6.5. Pseudorandom Sequence Algorithm",
      "section_title": true,
      "zh-CHS": "6.5. 伪随机序列算法"
    },
    {
      "indent": 3,
      "text": "Finally, we note another possibility: a pseudorandom sequence generates an index to the table of packet lengths, and the generation algorithm SHOULD be reported with the results, along with the seed value if used.",
      "zh-CHS": "最后，我们注意到另一种可能性：伪随机序列生成数据包长度表的索引，生成算法应报告结果以及种子值（如果使用）。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Benchmarking activities as described in this memo are limited to technology characterization using controlled stimuli in a laboratory environment, with dedicated address space and other constraints [RFC2544].",
      "zh-CHS": "本备忘录中所述的基准测试活动仅限于在实验室环境中使用受控刺激进行技术表征，具有专用地址空间和其他限制[RFC2544]。"
    },
    {
      "indent": 3,
      "text": "The benchmarking network topology will be an independent test setup and MUST NOT be connected to devices that may forward the test traffic into a production network or misroute traffic to the test management network.",
      "zh-CHS": "基准网络拓扑将是一个独立的测试设置，不得连接到可能将测试流量转发到生产网络或将流量错误路由到测试管理网络的设备。"
    },
    {
      "indent": 3,
      "text": "Further, benchmarking is performed on a \"black-box\" basis, relying solely on measurements observable external to the Device Under Test (DUT) or System Under Test (SUT).",
      "zh-CHS": "此外，基准测试是在“黑盒”的基础上进行的，仅依赖于被测设备（DUT）或被测系统（SUT）外部可观察到的测量值。"
    },
    {
      "indent": 3,
      "text": "Special capabilities SHOULD NOT exist in the DUT/SUT specifically for benchmarking purposes. Any implications for network security arising from the DUT/SUT SHOULD be identical in the lab and in production networks.",
      "zh-CHS": "DUT/SUT中不应存在专门用于基准测试的特殊能力。DUT/SUT对网络安全的任何影响应在实验室和生产网络中相同。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "Thanks to Sarah Banks, Aamer Akhter, Steve Maxwell, and Scott Bradner for their reviews and comments. Ilya Varlashkin suggested the run-length encoding approach in Section 6.1.",
      "zh-CHS": "感谢Sarah Banks、Aamer Akhter、Steve Maxwell和Scott Bradner的评论和评论。Ilya Varlashkin在第6.1节中提出了游程编码方法。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2544] Bradner, S. and J. McQuaid, \"Benchmarking Methodology for Network Interconnect Devices\", RFC 2544, March 1999.",
      "zh-CHS": "[RFC2544]Bradner，S.和J.McQuaid，“网络互连设备的基准测试方法”，RFC 2544，1999年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[Agilent] Agilent, \"The Journal of Internet Test Methodologies\", September 2007, <http://www.ixiacom.com/pdfs/test_plans/ agilent_journal_of_internet_test_methodologies.pdf>.",
      "zh-CHS": "[安捷伦]安捷伦，《互联网测试方法学杂志》，2007年9月<http://www.ixiacom.com/pdfs/test_plans/ 安捷伦互联网测试方法学杂志.pdf>。"
    },
    {
      "indent": 3,
      "text": "[IMIXonList] IETF Benchmarking Methodology Working Group, \"Discussion on IMIX\", October 2003, <http://www.ietf.org/mail-archive/ web/bmwg/current/msg00691.html>.",
      "zh-CHS": "[IMIXonList]IETF基准方法工作组，“关于IMIX的讨论”，2003年10月<http://www.ietf.org/mail-archive/ web/bmwg/current/msg00691.html>。"
    },
    {
      "indent": 3,
      "text": "[IXIA] IXIA, \"Testing PPPoX and L2TP Broadband Access Devices\", 2004, <http://www.ixiacom.com/library/test_plans/ display?skey=testing_pppox>.",
      "zh-CHS": "[IXIA]IXIA，“测试PPPoX和L2TP宽带接入设备”，2004年<http://www.ixiacom.com/library/test_plans/ 显示？skey=测试\\u pppox>。"
    },
    {
      "indent": 3,
      "text": "[Jumbo1] Dykstra, P., \"Gigabit Ethernet Jumbo Frames, and why you should care\", WareOnEarth Communications, Inc., December 1999, <http://sd.wareonearth.com/~phil/jumbo.html>.",
      "zh-CHS": "[Jumbo1]Dykstra，P.，“千兆以太网巨型帧，以及为什么您应该关心”，WareOnEarth通信公司，1999年12月<http://sd.wareonearth.com/~phil/jumbo.html>。"
    },
    {
      "indent": 3,
      "text": "[Jumbo2] Mathis, M., \"The Ethernet CRC limits packets to about 12 kBytes. (NOT)\", Pittsburgh Supercomputing Center, April 2003, <http://staff.psc.edu/mathis/MTU/arguments.html#crc>.",
      "zh-CHS": "[Jumbo2]Mathis，M.，“以太网CRC将数据包限制在12千字节左右（不是）”，匹兹堡超级计算中心，2003年4月<http://staff.psc.edu/mathis/MTU/arguments.html#crc>."
    },
    {
      "indent": 3,
      "text": "[RFC5470] Sadasivan, G., Brownlee, N., Claise, B., and J. Quittek, \"Architecture for IP Flow Information Export\", RFC 5470, March 2009.",
      "zh-CHS": "[RFC5470]Sadasivan，G.，Brownlee，N.，Claise，B.，和J.Quitek，“IP流信息导出架构”，RFC 54702009年3月。"
    },
    {
      "indent": 3,
      "text": "[Spirent] Spirent, \"Test Methodology Journal: IMIX (Internet Mix) Journal\", January 2006, <http://gospirent.com/whitepaper/ IMIX%20Test%20Methodolgy%20Journal.pdf>.",
      "zh-CHS": "[Spirent]Spirent，“测试方法学杂志：IMIX（互联网混合）杂志”，2006年1月<http://gospirent.com/whitepaper/ IMIX%20Test%20Methodogy%20Journal.pdf>。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Al Morton AT&T Labs 200 Laurel Avenue South Middletown, NJ 07748 USA",
      "zh-CHS": "美国新泽西州劳雷尔大道南米德尔顿200号阿尔莫顿AT&T实验室，邮编：07748"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 1571\nFax:   +1 732 368 1192\nEMail: acmorton@att.com\nURI:   http://home.comcast.net/~acmacm/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}