{
  "title": {
    "text": "RFC 6132: Sieve Notification Using Presence Information",
    "zh-CHS": "RFC 6132"
  },
  "number": 6132,
  "created_at": "2021-11-05 10:22:01.972754+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. George\nRequest for Comments: 6132                                      B. Leiba\nCategory: Standards Track                            Huawei Technologies\nISSN: 2070-1721                                                July 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Sieve Notification Using Presence Information",
      "zh-CHS": "使用状态信息筛选通知"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This is a further extension to the Sieve mail filtering language Notification extension, defining presence information that may be checked through the notify_method_capability feature.",
      "zh-CHS": "这是对Sieve邮件过滤语言通知扩展的进一步扩展，定义了可通过notify_method_功能检查的状态信息。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6132.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6132."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n  1.1.  Terminology Used in This Document . . . . . . . . . . . . . 2\n2.  Testing Presence Information  . . . . . . . . . . . . . . . . . 2\n3.  Examples  . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 6\n6.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . 7\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 7\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . . . 7\n  7.2.  Informative References  . . . . . . . . . . . . . . . . . . 8",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Sometimes, it's desirable to tailor Sieve [RFC5228] notifications to a user's current situation. Presence information provides some information about the user that would be useful to have access to in these cases. The Notification extension [RFC5435] defines a mechanism to test for presence (the notify_method_capability feature), and defines one test for presence (the \"online\" notification-capability, described in Section 5 of RFC 5435). This extension defines more presence tests by registering additional notification-capability parameters in the IANA registry, allowing testing of a wider variety of presence information.",
      "zh-CHS": "有时，需要根据用户的当前情况定制筛选[RFC5228]通知。状态信息提供了一些关于用户的信息，在这些情况下可以访问这些信息。通知扩展[RFC5435]定义了一种测试存在性的机制（notify_method_功能），并定义了一种存在性测试（“在线”通知功能，如RFC 5435第5节所述）。此扩展通过在IANA注册表中注册额外的通知功能参数来定义更多的状态测试，从而允许测试更广泛的状态信息。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology Used in This Document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的术语"
    },
    {
      "indent": 3,
      "text": "The upper-case key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中大写关键字“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Testing Presence Information",
      "section_title": true,
      "zh-CHS": "2. 测试状态信息"
    },
    {
      "indent": 3,
      "text": "This extension uses the notify_method_capability test, as defined in the Sieve [RFC5228] Notify extension [RFC5435], to test presence information. When a Sieve event occurs (mail arrives) for a user, a Sieve script running on behalf of that user can present the user's presence URI (in the \"notification-uri\" parameter) and test a specific item of notification presence as defined below (in the \"notification-capability\" parameter) against one or more values (in the \"key-list\" parameter).",
      "zh-CHS": "此扩展使用在筛[RFC5228]通知扩展[RFC5435]中定义的通知方法能力测试来测试存在信息。当用户发生筛选事件（邮件到达）时，代表该用户运行的筛选脚本可以显示用户的状态URI（在“notification URI”参数中），并根据一个或多个值（在“key list”参数中）测试下面定义的特定通知状态项（在“notification capability”参数中）。"
    },
    {
      "indent": 3,
      "text": "This document defines an initial set of items of notification presence, which may be specified in the notification-capability parameter. It is expected that future extensions will add additional presence items derived from diverse sources, including calendar information, geographic location, and so on.",
      "zh-CHS": "本文档定义了通知状态的初始项集，可在通知能力参数中指定。预计未来的扩展将添加来自不同来源的其他状态项，包括日历信息、地理位置等。"
    },
    {
      "indent": 3,
      "text": "Note that, while the items below are documented as similar to items in Extensible Messaging and Presence Protocol (XMPP) [RFC6121], it is not the intent that this extension be tied to XMPP, nor to any particular source of presence, and flexible implementations will be ready for future extensions. Useful informational references for presence data and formats include Presence Information Data Format (PIDF) [RFC3863], RPID: Rich Presence Extensions to PIDF [RFC4480], and GEOPRIV Presence Information Data Format Location Object (PIDF-LO) [RFC5491].",
      "zh-CHS": "请注意，虽然下面的项目与可扩展消息传递和状态协议（XMPP）[RFC6121]中的项目类似，但并不打算将此扩展绑定到XMPP，也不绑定到任何特定的状态源，灵活的实现将为将来的扩展做好准备。状态数据和格式的有用信息参考包括状态信息数据格式（PIDF）[RFC3863]、RPID:PIDF的丰富状态扩展[RFC4480]和GEOPRIV状态信息数据格式位置对象（PIDF-LO）[RFC5491]。"
    },
    {
      "indent": 3,
      "text": "The script tests the values of notification presence items in the key-list parameter. The values that each item may have are specified in the list below. Note that in addition to the presence values, any item may have the value \"unknown\" if it is not possible to determine the correct presence value of the item.",
      "zh-CHS": "该脚本测试键列表参数中通知状态项的值。每个项目可能具有的值在下面的列表中指定。注意，除了存在值之外，如果无法确定项目的正确存在值，则任何项目都可能具有“未知”值。"
    },
    {
      "indent": 3,
      "text": "If a particular presence item is tested multiple times within the same script execution context, implementations MUST present the same value each time (for example, by caching the value on first use). This provides consistency within a single execution.",
      "zh-CHS": "如果在同一脚本执行上下文中多次测试特定的状态项，则每次实现都必须呈现相同的值（例如，通过在第一次使用时缓存该值）。这在单个执行中提供了一致性。"
    },
    {
      "indent": 3,
      "text": "Supported presence items are as follows:",
      "zh-CHS": "支持的状态项如下所示："
    },
    {
      "indent": 3,
      "text": "busy: An indication of whether the user is considered \"busy\" now (the value \"yes\") or not (the value \"no\"), or \"unknown\" if it cannot be determined. The meaning of \"busy\" is left to the implementation, and may be a state that's synthesized from other information (including \"show\", below).",
      "zh-CHS": "忙：表示用户现在是否被视为“忙”（值“是”）或“不忙”（值“否”），如果无法确定，则表示“未知”。“忙”的含义留给实现，可能是从其他信息合成的状态（包括下面的“show”）。"
    },
    {
      "indent": 3,
      "text": "show: The availability status of the user, formally specified. Note that this is similar to the presence element with the same name that's defined in Section 4.7.2.1 of RFC 6121 [RFC6121]. The value of this item is one of the following:",
      "zh-CHS": "显示：正式指定的用户的可用性状态。注意，这类似于RFC 6121[RFC6121]第4.7.2.1节中定义的同名存在元素。此项的值为以下值之一："
    },
    {
      "indent": 12,
      "text": "away: The user is temporarily away.",
      "zh-CHS": "离开：用户暂时离开。"
    },
    {
      "indent": 12,
      "text": "chat: The user is online and actively interested in chatting.",
      "zh-CHS": "聊天：用户在线并且对聊天非常感兴趣。"
    },
    {
      "indent": 12,
      "text": "dnd: Do Not Disturb; the user does not wish to be disturbed now.",
      "zh-CHS": "dnd：请勿打扰；用户现在不希望受到干扰。"
    },
    {
      "indent": 12,
      "text": "offline: The user is offline.",
      "zh-CHS": "脱机：用户处于脱机状态。"
    },
    {
      "indent": 12,
      "text": "xa: The user is away for an extended period (xa = \"eXtended Away\").",
      "zh-CHS": "xa：用户离开一段较长的时间（xa=“延长离开”）。"
    },
    {
      "indent": 12,
      "text": "unknown: The correct presence value could not be determined.",
      "zh-CHS": "未知：无法确定正确的存在值。"
    },
    {
      "indent": 3,
      "text": "status: A human-readable description of the user's availability status, in natural language. There is no formal definition for the values this item may take. It is free-form, and may be in any language. Direct comparisons against the value of this field are unlikely to be useful; rather, it is provided to enable extraction of the value into a variable [RFC5229] for use elsewhere (see example 3 in Section 3). Note that this is similar to the presence element with the same name that's defined in Section 4.7.2.2 of RFC 6121 [RFC6121], and to the <note> element defined in section 4.1.6 of PIDF [RFC3863].",
      "zh-CHS": "状态：以自然语言对用户可用性状态的可读描述。此项可能采用的值没有正式定义。它是自由形式的，可以是任何语言。与该字段的值进行直接比较不太可能有用；相反，它是用来将值提取到变量[RFC5229]中，以便在其他地方使用（参见第3节中的示例3）。注意，这类似于RFC 6121[RFC6121]第4.7.2.2节中定义的同名存在元素，以及PIDF[RFC3863]第4.1.6节中定义的<Note>元素。"
    },
    {
      "indent": 12,
      "text": "Because this is a free-form value that might be created directly by a user, no value, including \"unknown\", can have any special meaning. If the Sieve processor is unable to determine the value of this item, it might be best to leave it as an empty string. In any case, it is not meant for machine-readable processing, beyond possible XML interpretation.",
      "zh-CHS": "因为这是一个自由形式的值，可以由用户直接创建，所以任何值，包括“未知”都不能有任何特殊含义。如果筛选处理器无法确定此项的值，最好将其保留为空字符串。在任何情况下，除了可能的XML解释之外，它并不意味着用于机器可读的处理。"
    },
    {
      "indent": 3,
      "text": "There is no capability string associated with this extension, but this requires support for \"enotify\" [RFC5435]. If the implementation does not support the item being tested (that is, the specified notification-capability item is not known to the Sieve interpreter), RFC 5435 already specifies that the test fail without an error.",
      "zh-CHS": "没有与此扩展关联的功能字符串，但这需要支持“enotify”[RFC5435]。如果实现不支持正在测试的项（即，指定的通知功能项对于Sieve解释器来说是未知的），RFC 5435已经指定测试失败，并且没有错误。"
    },
    {
      "indent": 3,
      "text": "Although this feature was conceived to assist in notifications, and the test requires support of the Sieve Notify feature, it is only a condition test, and any Sieve action can appear inside it. There are no Sieve actions that conflict with this extension.",
      "zh-CHS": "尽管此功能旨在帮助通知，并且测试需要支持筛通知功能，但它只是一个条件测试，任何筛动作都可以出现在其中。没有与此扩展冲突的筛选操作。"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "1. This example will send a notification only if the recipient is not \"busy\". If the test for \"busy\" is not supported, this example will not send a notification.",
      "zh-CHS": "1. 此示例仅在收件人不“忙”时发送通知。如果不支持“忙”测试，则此示例将不发送通知。"
    },
    {
      "indent": 3,
      "text": "require [\"enotify\"];",
      "zh-CHS": "要求[“enotify”]；"
    },
    {
      "indent": 3,
      "text": "if notify_method_capability \"xmpp:tim@example.com\" \"busy\" \"no\"\n  {\n    notify :message \"You got mail\"\n        \"xmpp:tim@example.com?message;subject=SIEVE\";\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "2. This example will send a notification only if the recipient is not \"busy\". If the test for \"busy\" is not supported, this example will send a notification.",
      "zh-CHS": "2. 此示例仅在收件人不“忙”时发送通知。如果不支持“忙”测试，此示例将发送通知。"
    },
    {
      "indent": 3,
      "text": "require [\"enotify\"];",
      "zh-CHS": "要求[“enotify”]；"
    },
    {
      "indent": 3,
      "text": "if not notify_method_capability \"xmpp:tim@example.com\" \"busy\" \"yes\"\n  {\n    notify :message \"You got mail\"\n        \"xmpp:tim@example.com?message;subject=SIEVE\";\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "3. This example uses the vacation extension [RFC5230] to generate an auto-reply [RFC6133] if the sender is in the recipient's address book [RFC6134] and the recipient's presence shows \"extended away\". The variables extension [RFC5229] is used to extract the value of the recipient's presence status message, which will be used in the response to the sender. If the test for \"show\" is not supported, this example will not send an auto-reply.",
      "zh-CHS": "3. 此示例使用假期扩展[RFC5230]生成自动回复[RFC6133]，前提是发件人位于收件人的通讯簿[RFC6134]中，并且收件人的状态显示为“已扩展”。变量扩展[RFC5229]用于提取收件人状态消息的值，该值将用于对发件人的响应。如果不支持“show”测试，则本例将不会发送自动回复。"
    },
    {
      "indent": 3,
      "text": "require [\"extlists\", \"vacation\", \"enotify\", \"variables\"];",
      "zh-CHS": "需要[“ExtList”、“休假”、“enotify”、“变量”]；"
    },
    {
      "indent": 3,
      "text": "if allof (\n    envelope :list \"from\" \":addrbook:default\",\n    notify_method_capability \"xmpp:myjid@example.com\" \"show\" \"xa\"\n  ) {\n    # :matches \"*\" is used here to extract the value\n    if notify_method_capability :matches\n        \"xmpp:myjid@example.com\" \"status\" \"*\" {\n      set \"resp_msg\" \"${1}\";\n    } else {\n      set \"resp_msg\" \"I'm away from email for a while.\"\n    }\n    vacation :handle \"ext-away\" \"${resp_msg}\";\n  }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Security considerations for Sieve [RFC5228] and the Notify extension [RFC5435] apply equally here. In addition, implementations MUST ensure that users cannot create scripts that access the presence information of others without the proper access controls.",
      "zh-CHS": "筛[RFC5228]和通知扩展[RFC5435]的安全注意事项同样适用于此处。此外，实现必须确保用户在没有适当的访问控制的情况下无法创建访问他人状态信息的脚本。"
    },
    {
      "indent": 3,
      "text": "In some situations, scripts may act on some of the recipient's presence information that the sender of the triggering message is not allowed to see. This can be a benefit to the recipient in many cases, but it can also present an opportunity for a sender to use messages to probe the recipient's presence (if, for example, messages sometimes result in auto-replies, and sometimes do not). Script authors should take care in considering this aspect of presence-triggered actions.",
      "zh-CHS": "在某些情况下，脚本可能会作用于某些收件人的状态信息，而触发消息的发件人不允许看到这些信息。在许多情况下，这对收件人来说都是一个好处，但它也为发件人提供了一个机会，让他们可以使用邮件来探测收件人的存在（例如，如果邮件有时会导致自动回复，有时则不会）。脚本作者在考虑存在触发动作的这一方面时应该小心。"
    },
    {
      "indent": 3,
      "text": "It's possible for a large number of messages to arrive at or around the same time and be processed by Sieve scripts that all test presence. If many of the users share the same presence server, such a burst could put an unexpectedly heavy load on the presence server. Implementations might consider providing options for rate limiting, or for caching presence tests for periods of time, even across Sieve script instances. When caching presence tests, the server must be careful not to violate access controls that the presence server might have. Thus, cached results MUST NOT be used outside the context in which they were retrieved. If, for example, a script running on behalf of Adam requests presence information for Barbara, that information MAY be cached for a future script running on behalf of Adam, but MUST NOT be used to satisfy the same query in a script running on behalf of Cindy -- because the presence server will have to decide whether Cindy has access to that information.",
      "zh-CHS": "大量消息可能同时到达或大约同时到达，并由所有测试是否存在的筛选脚本进行处理。如果许多用户共享同一个状态服务器，这样的突发可能会给状态服务器带来意外的沉重负载。实现可能考虑为速率限制提供选项，或者在一段时间内缓存存在性测试，甚至跨越筛选器脚本实例。缓存状态测试时，服务器必须小心，不要违反状态服务器可能具有的访问控制。因此，缓存的结果不能在检索它们的上下文之外使用。例如，如果代表Adam运行的脚本请求Barbara的状态信息，则该信息可能会被缓存以供将来代表Adam运行的脚本使用，但不能用于在代表Cindy运行的脚本中满足相同的查询，因为状态服务器必须决定Cindy是否有权访问该信息。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This registers each presence item as a notification-capability parameter. Future extensions that add new presence items should register those items similarly, using the instructions in Section 9.3 of RFC 5435 [RFC5435].",
      "zh-CHS": "这会将每个状态项注册为通知功能参数。添加新存在项的未来扩展应使用RFC 5435[RFC5435]第9.3节中的说明，以类似方式注册这些项。"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of a new notification-capability parameter Capability name: busy Description: An indication of whether the user is considered \"busy\" now (the value \"yes\") or not (the value \"no\"). The meaning of \"busy\" is left to the implementation, and may be a state that's synthesized from other information. Syntax: Has one of the values \"yes\", \"no\", or \"unknown\". The value MUST be in lower case.",
      "zh-CHS": "致：iana@iana.org主题：注册新的通知功能参数功能名称：忙描述：指示用户现在是否被视为“忙”（值“是”）（值“否”）。“忙”的含义留给实现，可能是从其他信息合成的状态。语法：具有值“是”、“否”或“未知”之一。该值必须为小写。"
    },
    {
      "indent": 3,
      "text": "Permanent and readily available reference(s):  RFC 6132\nContact information:  The Sieve discussion list, <sieve@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "To:  iana@iana.org\nSubject:  Registration of a new notification-capability parameter\nCapability name:  show\nDescription:  The availability status of the user.  This is similar\n     to the presence element with the same name that's defined in\n     Section 4.7.2.1 of RFC 6121.\nSyntax:  Has one of the values \"away\", \"chat\", \"dnd\", \"offline\",\n     \"xa\", or \"unknown\".  The value MUST be in lower case.\nPermanent and readily available reference(s):  RFC 6132\nContact information:  The Sieve discussion list, <sieve@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of a new notification-capability parameter Capability name: status Description: A human-readable description of the user's availability status. This is similar to the presence element with the same name that's defined in Section 4.7.2.2 of RFC 6121. Syntax: There is no formal definition for the values this item may take. It is free-form and may be in any language, and is meant for human consumption. Permanent and readily available reference(s): RFC 6132 Contact information: The Sieve discussion list, <sieve@ietf.org>",
      "zh-CHS": "致：iana@iana.org主题：注册新的通知功能参数功能名称：状态描述：用户可用性状态的可读描述。这类似于RFC 6121第4.7.2.2节中定义的同名存在元素。语法：此项可能采用的值没有正式定义。它是自由形式的，可以是任何语言，并且是供人类消费的。永久和现成的参考资料：RFC 6132联系信息：筛讨论列表<sieve@ietf.org>"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors thank Alexey Melnikov for significant early feedback and suggestions.",
      "zh-CHS": "作者感谢Alexey Melnikov提供了重要的早期反馈和建议。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "zh-CHS": "7. 工具书类"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "zh-CHS": "7.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5228] Guenther, P. and T. Showalter, \"Sieve: An Email Filtering Language\", RFC 5228, January 2008.",
      "zh-CHS": "[RFC5228]Guenther，P.和T.Showalter，“筛选：电子邮件过滤语言”，RFC 5228，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5435] Melnikov, A., Leiba, B., Segmuller, W., and T. Martin, \"Sieve Email Filtering: Extension for Notifications\", RFC 5435, January 2009.",
      "zh-CHS": "[RFC5435]Melnikov，A.，Leiba，B.，Segmuller，W.，和T.Martin，“筛选电子邮件过滤：通知扩展”，RFC 54352009年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6121] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Instant Messaging and Presence\", RFC 6121, March 2011.",
      "zh-CHS": "[RFC6121]圣安德烈，P.，“可扩展消息和状态协议（XMPP）：即时消息和状态”，RFC61212011年3月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "zh-CHS": "7.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3863] Sugano, H., Fujimoto, S., Klyne, G., Bateman, A., Carr, W., and J. Peterson, \"Presence Information Data Format (PIDF)\", RFC 3863, August 2004.",
      "zh-CHS": "[RFC3863]Sugano，H.，Fujimoto，S.，Klyne，G.，Batman，A.，Carr，W.，和J.Peterson，“状态信息数据格式（PIDF）”，RFC 38632004年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4480] Schulzrinne, H., Gurbani, V., Kyzivat, P., and J. Rosenberg, \"RPID: Rich Presence Extensions to the Presence Information Data Format (PIDF)\", RFC 4480, July 2006.",
      "zh-CHS": "[RFC4480]Schulzrinne，H.，Gurbani，V.，Kyzivat，P.，和J.Rosenberg，“RPID：状态信息数据格式（PIDF）的丰富状态扩展”，RFC 44802006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5229] Homme, K., \"Sieve Email Filtering: Variables Extension\", RFC 5229, January 2008.",
      "zh-CHS": "[RFC5229]Homme，K.，“筛选电子邮件过滤：变量扩展”，RFC5292008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5230] Showalter, T. and N. Freed, \"Sieve Email Filtering: Vacation Extension\", RFC 5230, January 2008.",
      "zh-CHS": "[RFC5230]Showalter，T.和N.Freed，“筛选电子邮件过滤：假期延长”，RFC 5230，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5491] Winterbottom, J., Thomson, M., and H. Tschofenig, \"GEOPRIV Presence Information Data Format Location Object (PIDF-LO) Usage Clarification, Considerations, and Recommendations\", RFC 5491, March 2009.",
      "zh-CHS": "[RFC5491]Winterbottom，J.，Thomson，M.，和H.Tschofenig，“GEOPRIV存在信息数据格式位置对象（PIDF-LO）使用说明、注意事项和建议”，RFC 54912009年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6133] George, R., Leiba, B., and A. Melnikov, \"Sieve Email Filtering: Use of Presence Information with Auto-Responder Functionality\", RFC 6134, July 2011.",
      "zh-CHS": "[RFC6133]George，R.，Leiba，B.，和A.Melnikov，“筛选电子邮件过滤：使用状态信息和自动响应功能”，RFC 61342011年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6134] Melnikov, A. and B. Leiba, \"Sieve Extension: Externally Stored Lists\", RFC 6134, July 2011.",
      "zh-CHS": "[RFC6134]Melnikov，A.和B.Leiba，“筛子扩展：外部存储列表”，RFC 61342011年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Robins George Huawei Technologies Bangalore, Karnataka 560071 India",
      "zh-CHS": "罗宾斯乔治华为技术有限公司印度卡纳塔克邦班加罗尔560071"
    },
    {
      "indent": 3,
      "text": "Phone: +91-080-41117676\nEMail: robinsgv@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Barry Leiba Huawei Technologies",
      "zh-CHS": "巴里·雷巴华为技术有限公司"
    },
    {
      "indent": 3,
      "text": "Phone: +1 646 827 0648\nEMail: barryleiba@computer.org\nURI:   http://internetmessagingtechnology.org/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}