{
  "title": {
    "text": "RFC 6823: Advertising Generic Information in IS-IS",
    "zh-CHS": "RFC 6823"
  },
  "number": 6823,
  "created_at": "2021-11-22 02:15:29.816050+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       L. Ginsberg\nRequest for Comments: 6823                                    S. Previdi\nCategory: Standards Track                                       M. Shand\nISSN: 2070-1721                                            Cisco Systems\n                                                           December 2010",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Advertising Generic Information in IS-IS",
      "zh-CHS": "IS-IS中的广告通用信息"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the manner in which generic application information (i.e., information not directly related to the operation of the Intermediate System to Intermediate System (IS-IS) protocol) should be advertised in IS-IS Link State Protocol Data Units (LSPs) and defines guidelines that should be used when flooding such information.",
      "zh-CHS": "本文件描述了在IS-IS链路状态协议数据单元（LSP）中公布通用应用程序信息（即与中间系统到中间系统（IS-IS）协议的操作不直接相关的信息）的方式，并定义了在淹没此类信息时应使用的指南。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6823.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6823."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2010 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Conventions Used in This Document  . . . . . . . . . . . . . .  3\n3.  Encoding Format for GENINFO  . . . . . . . . . . . . . . . . .  3\n  3.1.  GENINFO TLV  . . . . . . . . . . . . . . . . . . . . . . .  3\n  3.2.  Use of Sub-TLVs in GENINFO TLV . . . . . . . . . . . . . .  5\n4.  GENINFO Flooding Procedures  . . . . . . . . . . . . . . . . .  5\n  4.1.  Leaking Procedures . . . . . . . . . . . . . . . . . . . .  6\n  4.2.  Minimizing Update Confusion  . . . . . . . . . . . . . . .  7\n  4.3.  Interpreting Attribute Information . . . . . . . . . . . .  7\n5.  Use of a Separate Protocol Instance  . . . . . . . . . . . . .  7\n6.  Applicability of GENINFO TLV . . . . . . . . . . . . . . . . .  8\n7.  Standardization Requirements . . . . . . . . . . . . . . . . .  8\n8.  Security Considerations  . . . . . . . . . . . . . . . . . . .  9\n9.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  9\n10. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  9\n11. Normative References . . . . . . . . . . . . . . . . . . . . . 10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "zh-CHS": "1. 概述"
    },
    {
      "indent": 3,
      "text": "[ISO10589] defines the format of Type-Length-Values (TLVs) that may be sent in IS-IS Protocol Data Units (PDUs). The first octet of a TLV encodes the \"type\" or \"codepoint\" that provides a scope for the information and information format that follows. The protocol is therefore limited to 256 different codepoints that may be assigned. This number has proved generous as regards the information required for correct operation of the IS-IS protocol. However, the increasing use of IS-IS Link State Protocol Data Units (LSPs) for advertisement of generic information (GENINFO) not directly related to the operation of the IS-IS protocol places additional demands on the TLV encoding space that have the potential to consume a significant number of TLV codepoints. This document therefore defines an encoding format for GENINFO that minimizes the consumption of TLV codepoints and also maximizes the flexibility of the formats that can be used to represent GENINFO.",
      "zh-CHS": "[ISO10589]定义了可在IS-IS协议数据单元（PDU）中发送的类型长度值（TLV）的格式。TLV的第一个八位组编码“类型”或“代码点”，为随后的信息和信息格式提供范围。因此，该协议被限制为可分配的256个不同的码点。就IS-IS协议正确运行所需的信息而言，该数字已被证明是慷慨的。然而，越来越多地使用IS-IS链路状态协议数据单元（LSP）来发布与IS-IS协议的操作不直接相关的通用信息（GENINFO），这对TLV编码空间提出了额外的要求，可能会消耗大量TLV码点。因此，本文档为GENINFO定义了一种编码格式，该格式可以最大限度地减少TLV代码点的消耗，并最大限度地提高可用于表示GENINFO的格式的灵活性。"
    },
    {
      "indent": 3,
      "text": "This document also discusses optimal behavior associated with the advertisement and flooding of LSPs containing GENINFO in order to avoid the advertisement of stale information and minimize the presence of duplicate or conflicting information when advertisements are updated.",
      "zh-CHS": "本文档还讨论了与广告和包含GENINFO的LSP的泛滥相关的最佳行为，以避免发布过时信息，并在更新广告时最小化重复或冲突信息的存在。"
    },
    {
      "indent": 3,
      "text": "The manner in which the information contained in GENINFO TLVs is exchanged between an instance of the IS-IS protocol and the application that generates or consumes the GENINFO is outside the scope of this specification.",
      "zh-CHS": "在is-is协议实例和生成或使用GENINFO的应用程序之间交换GENINFO TLV中包含的信息的方式不在本规范的范围内。"
    },
    {
      "indent": 3,
      "text": "In order to minimize the impact that advertisement of GENINFO may have on the operation of routing, such advertisements MUST occur in the context of a non-zero instance of the IS-IS protocol as defined in [RFC6822] except where the rules for the use of the zero instance set out later in this document are followed.",
      "zh-CHS": "为了尽量减少GENINFO公告对路由操作的影响，此类公告必须在[RFC6822]中定义的IS-IS协议非零实例的上下文中进行，除非遵循本文件后面规定的零实例使用规则。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "2. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Encoding Format for GENINFO",
      "section_title": true,
      "zh-CHS": "3. GENINFO的编码格式"
    },
    {
      "indent": 3,
      "text": "The encoding format defined below has the following goals regarding the advertisement of GENINFO in IS-IS LSPs:",
      "zh-CHS": "关于IS-IS LSP中的GENINFO广告，以下定义的编码格式具有以下目标："
    },
    {
      "indent": 3,
      "text": "o Minimize the number of IS-IS top level and sub-TLV codepoints required",
      "zh-CHS": "o 尽量减少所需IS-IS顶级和子TLV代码点的数量"
    },
    {
      "indent": 3,
      "text": "o Minimize the depth of sub-TLV levels required",
      "zh-CHS": "o 尽可能减少所需的子TLV水平的深度"
    },
    {
      "indent": 3,
      "text": "In order to support these goals, a new IANA registry has been created. This registry manages the assignment of IS-IS GENINFO Application Identifiers. These numbers are unsigned 16-bit numbers ranging in value from 1 to 65535. Application-specific sub-TLV codepoints are unsigned 8-bit numbers ranging in value from 0 to 255. The assignment of the sub-TLV codepoints is scoped by the Application Identifier. Management of the application specific sub-TLV codepoints is outside the scope of this document.",
      "zh-CHS": "为了支持这些目标，创建了一个新的IANA注册中心。此注册表管理IS-IS GENINFO应用程序标识符的分配。这些数字是无符号16位数字，其值范围为1到65535。特定于应用程序的子TLV代码点是值范围为0到255的无符号8位数字。子TLV代码点的分配由应用程序标识符确定范围。特定于应用程序的子TLV代码点的管理不在本文档的范围内。"
    },
    {
      "indent": 0,
      "text": "3.1. GENINFO TLV",
      "section_title": true,
      "zh-CHS": "3.1. GENINFO TLV"
    },
    {
      "indent": 3,
      "text": "The GENINFO TLV supports the advertisement of application-specific information that is not directly related to the operation of the IS-IS protocol.",
      "zh-CHS": "GENINFO TLV支持发布与is-is协议操作不直接相关的特定于应用程序的信息。"
    },
    {
      "indent": 5,
      "text": "Type: 251 Length: Number of octets in the value field (3 to 255)",
      "zh-CHS": "类型：251长度：值字段中的八位字节数（3到255）"
    },
    {
      "indent": 5,
      "text": "Value:",
      "zh-CHS": "价值："
    },
    {
      "indent": 16,
      "text": "                          No. of octets\n+-----------------------+\n| Flags                 |     1\n+-----------------------+\n| Application ID        |     2\n+-----------------------+\n| Application           |\n| IP Address Info       |     0 to 20\n+-----------------------+\n|Additional Application-|     0 to (252 -\n|  Specific Information |     len of IP Address info)\n+-----------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Flags",
      "zh-CHS": "旗帜"
    },
    {
      "indent": 19,
      "text": " 0 1 2 3 4 5 6 7\n+-+-+-+-+-+-+-+-+\n|  Rsvd |V|I|D|S|\n+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The following bit flags are defined.",
      "zh-CHS": "定义了以下位标志。"
    },
    {
      "indent": 6,
      "text": "S bit (0x01): If the S bit is set (1), the GENINFO TLV MUST be flooded across the entire routing domain. If the S bit is not set (0), the TLV MUST NOT be leaked between levels. This bit MUST NOT be altered during the TLV leaking.",
      "zh-CHS": "S位（0x01）：如果设置了S位（1），则GENINFO TLV必须覆盖整个路由域。如果未设置S位（0），则TLV不得在级别之间泄漏。TLV泄漏期间，不得更改该位。"
    },
    {
      "indent": 6,
      "text": "D bit (0x02): When the GENINFO TLV is leaked from Level-2 to Level-1, the D bit MUST be set. Otherwise, this bit MUST be clear. GENINFO TLVs with the D bit set MUST NOT be leaked from Level-1 to Level-2. This is to prevent TLV looping.",
      "zh-CHS": "D位（0x02）：当GENINFO TLV从2级泄漏到1级时，必须设置D位。否则，该位必须是清晰的。设置了D位的GENINFO TLV不得从1级泄漏到2级。这是为了防止TLV循环。"
    },
    {
      "indent": 6,
      "text": "I bit (0x04): When the I bit is set, the 4-octet IPv4 address associated with the application immediately follows the Application ID.",
      "zh-CHS": "I位（0x04）：设置I位时，与应用程序关联的4个八位IPv4地址紧跟在应用程序ID之后。"
    },
    {
      "indent": 6,
      "text": "V bit (0x08): When the V bit is set, the 16-octet IPv6 address associated with the application immediately follows either the Application ID (if I bit is clear) or the IPv4 address (if I bit is set).",
      "zh-CHS": "V位（0x08）：设置V位时，与应用程序关联的16位八位组IPv6地址紧跟在应用程序ID（如果I位已清除）或IPv4地址（如果I位已设置）之后。"
    },
    {
      "indent": 3,
      "text": "Application ID An identifier assigned to this application via the IANA registry defined later in this document.",
      "zh-CHS": "应用程序ID通过本文档后面定义的IANA注册表分配给该应用程序的标识符。"
    },
    {
      "indent": 3,
      "text": "Application IPv4 Address Info The IPv4 address associated with the application. This is not necessarily an address of a router running the IS-IS protocol.",
      "zh-CHS": "应用程序IPv4地址信息与应用程序关联的IPv4地址。这不一定是运行is-is协议的路由器的地址。"
    },
    {
      "indent": 3,
      "text": "Application IPv6 Address Info The IPv6 address associated with the application. This is not necessarily an address of a router running the IS-IS protocol.",
      "zh-CHS": "应用程序IPv6地址信息与应用程序关联的IPv6地址。这不一定是运行is-is协议的路由器的地址。"
    },
    {
      "indent": 3,
      "text": "Additional Application-Specific Information Each application may define additional information to be encoded in a GENINFO TLV following the fixed information. Definition of such information is beyond the scope of this document.",
      "zh-CHS": "附加特定于应用程序的信息每个应用程序可以定义附加信息，这些信息将在固定信息之后编码到GENINFO TLV中。此类信息的定义超出了本文件的范围。"
    },
    {
      "indent": 0,
      "text": "3.2. Use of Sub-TLVs in GENINFO TLV",
      "section_title": true,
      "zh-CHS": "3.2. 在GENINFO TLV中使用子TLV"
    },
    {
      "indent": 3,
      "text": "[RFC5305] introduced the definition and use of sub-TLVs. One of the advantages of using sub-TLVs rather than fixed encoding of information inside a TLV is to allow for the addition of new information in a backwards compatible manner, i.e., just as with TLVs, implementations are required to ignore sub-TLVs that they do not understand.",
      "zh-CHS": "[RFC5305]介绍了子TLV的定义和使用。使用子TLV而不是TLV内部信息的固定编码的优点之一是允许以向后兼容的方式添加新信息，即，与TLV一样，实现需要忽略他们不理解的子TLV。"
    },
    {
      "indent": 3,
      "text": "GENINFO TLVs MAY include sub-TLVs in the application specific information as deemed necessary and appropriate for each application. The scope of the codepoints used in such sub-TLVs is defined by the combination of the GENINFO TLV codepoint and the Application ID, i.e., the sub-TLV codepoints are private to the application. Such sub-TLVs are referred to as APPsub-TLVs.",
      "zh-CHS": "GENINFO TLV可在应用特定信息中包含子TLV，视为每个应用的必要和适当信息。此类子TLV中使用的代码点的范围由GENINFO TLV代码点和应用程序ID的组合定义，即子TLV代码点是应用程序专用的。这种子TLV称为APPsub TLV。"
    },
    {
      "indent": 3,
      "text": "Additional levels of APPsub-TLVs may be required when there is variable information that is scoped by a specific APPsub-TLV. These \"nested\" sub-TLVs MUST be encoded in the same manner as sub-TLVs, i.e., with a one-octet Type field, a one-octet Length field, and zero or more octets of Value.",
      "zh-CHS": "当存在特定APPsub TLV范围内的变量信息时，可能需要额外级别的APPsub TLV。这些“嵌套”子TLV必须以与子TLV相同的方式编码，即使用一个八位字节类型字段、一个八位字节长度字段和零个或多个八位字节值。"
    },
    {
      "indent": 0,
      "text": "4. GENINFO Flooding Procedures",
      "section_title": true,
      "zh-CHS": "4. GENINFO洪水程序"
    },
    {
      "indent": 3,
      "text": "This section describes procedures that apply to the propagation of LSPs that contain GENINFO TLVs. These procedures have been previously discussed in [RFC4971]. This section is intended to serve as a reference specification for future documents that define the use of GENINFO TLV(s) for a specific application -- eliminating the need to repeat the definition of these procedures in the application-specific documents.",
      "zh-CHS": "本节描述了适用于包含GENINFO TLV的LSP传播的过程。这些程序之前已在[RFC4971]中讨论过。本节旨在作为未来文件的参考规范，这些文件定义了GENINFO TLV在特定应用中的使用——无需在特定应用文件中重复这些程序的定义。"
    },
    {
      "indent": 3,
      "text": "Each GENINFO TLV contains information regarding exactly one application instance as identified by the Application ID in the GENINFO TLV. When it is necessary to advertise sets of information",
      "zh-CHS": "每个GENINFO TLV都包含由GENINFO TLV中的应用程序ID标识的一个应用程序实例的相关信息。当需要公布一组信息时"
    },
    {
      "indent": 3,
      "text": "with the same Application ID that have different flooding scopes, a router MUST originate a minimum of one GENINFO TLV for each required flooding scope. GENINFO TLVs that contain information having area/ level scope will have the S bit clear. These TLVs MUST NOT be leaked into another level. GENINFO TLVs that contain information that has domain scope will have the S bit set. These TLVs MUST be leaked into other IS-IS levels. When a TLV is leaked from Level-2 to Level-1, the D bit MUST be set in the Level-1 LSP advertisement.",
      "zh-CHS": "对于具有不同泛洪作用域的相同应用程序ID，路由器必须为每个所需的泛洪作用域至少发起一个GENINFO TLV。包含区域/级别范围信息的GENINFO TLV将清除S位。这些TLV不得泄漏到其他级别。包含具有域作用域的信息的GENINFO TLV将设置S位。这些TLV必须泄漏到其他IS-IS级别。当TLV从2级泄漏到1级时，必须在1级LSP播发中设置D位。"
    },
    {
      "indent": 0,
      "text": "4.1. Leaking Procedures",
      "section_title": true,
      "zh-CHS": "4.1. 泄漏程序"
    },
    {
      "indent": 3,
      "text": "When leaking GENINFO TLVs downward from Level-2 into Level-1, if the originator of the TLV is a Level-1 router in another area, it is possible that multiple copies of the same TLV may be received from multiple L2 routers in the originating area. A router performing downward leaking MUST check for such duplication by comparing the contents of the TLVs. The set of LSPs generated by a router for a given level MUST NOT contain two or more copies of the same GENINFO TLV.",
      "zh-CHS": "当GENINFO TLV从2级向下泄漏到1级时，如果TLV的发起人是另一个区域中的1级路由器，则可能从发起区域中的多个L2路由器接收同一TLV的多个副本。执行向下泄漏的路由器必须通过比较TLV的内容来检查这种重复。路由器为给定级别生成的LSP集不得包含同一GENINFO TLV的两个或多个副本。"
    },
    {
      "indent": 3,
      "text": "In order to prevent the use of stale GENINFO information, a system MUST NOT use a GENINFO TLV present in an LSP of a system that is not currently reachable via Level-x paths, where \"x\" is the level (1 or 2) associated with the LSP in which the GENINFO TLV appears. Note that leaking a GENINFO TLV is one of the uses that is prohibited under these conditions. The following example illustrates what might occur in the absence of this restriction.",
      "zh-CHS": "为了防止使用过时的GENINFO信息，系统不得使用系统LSP中当前无法通过x级路径访问的GENINFO TLV，其中“x”是与出现GENINFO TLV的LSP关联的级别（1或2）。请注意，泄漏GENINFO TLV是这些条件下禁止的用途之一。以下示例说明了在没有此限制的情况下可能发生的情况。"
    },
    {
      "indent": 3,
      "text": "Example: If Level-1 router A generates a GENINFO TLV and floods it to two L1/L2 routers S and T, they will flood it into the Level-2 sub-domain. Now suppose the Level-1 area partitions, such that A and S are in one partition and T is in another. IP routing will still continue to work, but if A now issues a revised version of the GENINFO TLV, or decides to stop advertising it, S will follow suit, but T will continue to advertise the old version until the LSP times out.",
      "zh-CHS": "示例：如果一级路由器A生成GENINFO TLV并将其泛洪到两个L1/L2路由器S和T，则它们将其泛洪到二级子域。现在假设1级区域分区，A和S在一个分区中，T在另一个分区中。IP路由仍将继续工作，但如果A现在发布GENINFO TLV的修订版，或决定停止发布，S将跟进，但T将继续发布旧版本，直到LSP超时。"
    },
    {
      "indent": 3,
      "text": "Routers in other areas have to choose whether to trust T's copy of A's GENINFO TLV or S's copy of A's information and they have no reliable way to choose. By making sure that T stops leaking A's information, this removes the possibility that other routers will use stale information from A.",
      "zh-CHS": "其他地区的路由器必须选择是信任T的A的GENINFO TLV副本，还是信任s的A的信息副本，他们没有可靠的选择方法。通过确保T停止泄漏A的信息，这消除了其他路由器使用A的过时信息的可能性。"
    },
    {
      "indent": 0,
      "text": "4.2. Minimizing Update Confusion",
      "section_title": true,
      "zh-CHS": "4.2. 最小化更新混乱"
    },
    {
      "indent": 3,
      "text": "If an update to a TLV is advertised in an LSP with a different number than the LSP associated with the old advertisement, the possibility exists that other systems can temporarily have either 0 copies of a particular advertisement or 2 copies of a particular advertisement, depending on the order in which new copies of the LSP that had the old advertisement and the LSP that has the new advertisement arrive at other systems.",
      "zh-CHS": "如果使用与旧广告相关联的LSP不同的号码在LSP中广告对TLV的更新，则存在其他系统可以临时具有特定广告的0个副本或特定广告的2个副本的可能性，取决于具有旧广告的LSP的新副本和具有新广告的LSP到达其他系统的顺序。"
    },
    {
      "indent": 3,
      "text": "Whenever possible, an implementation SHOULD advertise the update to a GENINFO TLV in the LSP with the same number as the advertisement that it replaces. Where this is not possible, the two affected LSPs SHOULD be flooded as an atomic action.",
      "zh-CHS": "只要有可能，一个实现应该在LSP中将更新通知给GENINFO TLV，通知的编号与其替换的通知相同。在不可能的情况下，两个受影响的LSP应作为原子动作被淹没。"
    },
    {
      "indent": 3,
      "text": "Systems that receive an update to an existing GENINFO TLV can minimize the potential disruption associated with the update by employing a hold-down time prior to processing the update so as to allow for the receipt of multiple LSPs associated with the same update prior to beginning processing.",
      "zh-CHS": "接收对现有GENINFO TLV的更新的系统可以通过在处理更新之前采用抑制时间来最小化与更新相关联的潜在中断，从而允许在开始处理之前接收与同一更新相关联的多个LSP。"
    },
    {
      "indent": 0,
      "text": "4.3. Interpreting Attribute Information",
      "section_title": true,
      "zh-CHS": "4.3. 解释属性信息"
    },
    {
      "indent": 3,
      "text": "Where a receiving system has two copies of a GENINFO TLV with the same Application ID, attribute information in the two TLVs that does not conflict MUST be considered additive. When information in the two GENINFO TLVs conflicts, i.e., there are different settings for a given attribute, the procedure used to choose which copy shall be used is undefined.",
      "zh-CHS": "如果接收系统具有两个具有相同应用程序ID的GENINFO TLV副本，则必须将两个TLV中不冲突的属性信息视为可添加信息。当两个GENINFO TLV中的信息冲突时，即给定属性的设置不同，用于选择应使用哪个副本的过程未定义。"
    },
    {
      "indent": 0,
      "text": "5. Use of a Separate Protocol Instance",
      "section_title": true,
      "zh-CHS": "5. 使用单独的协议实例"
    },
    {
      "indent": 3,
      "text": "The use of the IS-IS flooding mechanism as a means of reliably and efficiently propagating information is understandably attractive. However, it is prudent to remember that the primary purpose of that mechanism is to flood information necessary for the correct operation of the IS-IS protocol. Flooding of information not directly related to the use of the IS-IS protocol in support of routing degrades the operation of the protocol. Degradation occurs because the frequency of LSP updates is increased and because the processing of non-routing information in each router consumes resources whose primary responsibility is to efficiently respond to reachability changes in the network.",
      "zh-CHS": "可以理解，使用IS-IS泛洪机制作为可靠和高效传播信息的手段具有吸引力。然而，谨慎的做法是记住，该机制的主要目的是提供is-is协议正确运行所需的信息。与使用IS-IS协议支持路由不直接相关的信息泛滥会降低协议的运行。发生降级的原因是LSP更新的频率增加，并且每个路由器中非路由信息的处理消耗了资源，这些资源的主要职责是有效地响应网络中的可达性变化。"
    },
    {
      "indent": 3,
      "text": "Advertisement of GENINFO therefore MUST occur in the context of a non-zero instance of the IS-IS protocol as defined in [RFC6822] except when the use in the zero instance is defined in a Standards Track RFC.",
      "zh-CHS": "因此，GENINFO的发布必须在[RFC6822]中定义的IS-IS协议的非零实例的上下文中进行，除非零实例中的使用是在标准跟踪RFC中定义的。"
    },
    {
      "indent": 3,
      "text": "The use of a separate instance of the protocol allows both the flooding and the processing of the non-routing information to be decoupled from the information necessary to support correct routing of data in the network. The flooding and processing of non-routing information can then be prioritized appropriately.",
      "zh-CHS": "协议的单独实例的使用使得非路由信息的泛洪和处理与支持网络中数据的正确路由所需的信息分离。然后，可以适当地优先处理非路由信息的泛洪和处理。"
    },
    {
      "indent": 3,
      "text": "Use of a separate protocol instance to advertise GENINFO does not eliminate the need to use prudence in the frequency with which such information is updated. One of the most egregious oversights is a failure to appropriately dampen changes in the information to be advertised; this can lead to flooding storms. Documents that specify the use of the mechanisms defined here MUST define the expected rate of change of the information to be advertised.",
      "zh-CHS": "使用单独的协议实例来公布GENINFO并不能消除在更新此类信息的频率上谨慎使用的必要性。最令人震惊的疏忽之一是未能适当抑制广告信息的变化；这可能导致洪水风暴。指定使用此处定义的机制的文档必须定义要公布的信息的预期变化率。"
    },
    {
      "indent": 3,
      "text": "If desirable, independent control of the flooding scope for information related to two different applications can be achieved by utilizing separate non-zero protocol instances for each application [RFC6822].",
      "zh-CHS": "如果需要，可以通过为每个应用程序使用单独的非零协议实例来实现对与两个不同应用程序相关的信息的泛洪范围的独立控制[RFC6822]。"
    },
    {
      "indent": 0,
      "text": "6. Applicability of GENINFO TLV",
      "section_title": true,
      "zh-CHS": "6. GENINFO TLV的适用性"
    },
    {
      "indent": 3,
      "text": "The GENINFO TLV supports the advertisement of application-specific information in IS-IS LSPs that is not directly related to the operation of the IS-IS protocol. Information advertised in the GENINFO TLV MUST NOT alter basic IS-IS protocol operation including (but not limited to) the establishment of adjacencies, the update process, and the decision process.",
      "zh-CHS": "GENINFO TLV支持在IS-IS LSP中公布与IS-IS协议的操作不直接相关的应用程序特定信息。GENINFO TLV中公布的信息不得改变基本IS-IS协议操作，包括（但不限于）邻接的建立、更新过程和决策过程。"
    },
    {
      "indent": 0,
      "text": "7. Standardization Requirements",
      "section_title": true,
      "zh-CHS": "7. 标准化要求"
    },
    {
      "indent": 3,
      "text": "GENINFO is intended to advertise information on behalf of applications whose operations have been defined in a public specification as discussed in [RFC5226].",
      "zh-CHS": "GENINFO旨在代表其操作已在[RFC5226]中讨论的公共规范中定义的应用程序发布信息。"
    },
    {
      "indent": 3,
      "text": "The public specification MUST include:",
      "zh-CHS": "公共规范必须包括："
    },
    {
      "indent": 3,
      "text": "o a description of the sub-TLV allocation policy",
      "zh-CHS": "o 子TLV分配策略的说明"
    },
    {
      "indent": 3,
      "text": "o discussion of security issues",
      "zh-CHS": "o 安全问题的讨论"
    },
    {
      "indent": 3,
      "text": "o discussion of the rate of change of the information being advertised",
      "zh-CHS": "o 关于广告信息变化率的讨论"
    },
    {
      "indent": 3,
      "text": "o justification for the use of GENINFO",
      "zh-CHS": "o 使用GENINFO的理由"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The introduction and use of the new TLV codepoint for GENINFO in and of itself raises no new security issues for IS-IS.",
      "zh-CHS": "GENINFO引入和使用新的TLV代码点本身并不会给IS-IS带来新的安全问题。"
    },
    {
      "indent": 3,
      "text": "It is possible that information advertised in a GENINFO TLV by a given application MAY introduce new security issues. The public specification that defines the use of GENINFO by that application MUST include a discussion of the security issues. Where appropriate, it is recommended that either [RFC5304] or [RFC5310] be used.",
      "zh-CHS": "给定应用程序在GENINFO TLV中发布的信息可能会带来新的安全问题。定义该应用程序使用GENINFO的公共规范必须包括对安全问题的讨论。在适当情况下，建议使用[RFC5304]或[RFC5310]。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "zh-CHS": "9. IANA考虑"
    },
    {
      "indent": 3,
      "text": "Per this document, IANA has registered a new IS-IS TLV in the \"IS-IS TLV Codepoints\" registry:",
      "zh-CHS": "根据本文件，IANA已在“IS-IS TLV代码点”注册表中注册了一个新的IS-IS TLV："
    },
    {
      "indent": 3,
      "text": "Type     Description                           IIH   LSP   SNP  Purge\n----     ----------------------------------    ---   ---   ---  -----\n251      Generic Information                    n     y     n     n",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IANA has also created a new registry. The new registry manages the assignment of Application Identifiers that may be used in the Generic Information TLV. These identifiers are unsigned 16-bit numbers ranging in value from 1 to 65535. The value 0 is reserved. The registration procedure is \"Expert Review\" as defined in [RFC5226]. The expert MUST verify that the public specification that defines the use of GENINFO for the application adequately discusses all points mentioned in Section 7 of this document.",
      "zh-CHS": "IANA还创建了一个新的注册表。新注册表管理可在通用信息TLV中使用的应用程序标识符的分配。这些标识符是值从1到65535的无符号16位数字。值0是保留的。注册程序为[RFC5226]中定义的“专家评审”。专家必须验证定义GENINFO应用的公共规范是否充分讨论了本文件第7节中提到的所有要点。"
    },
    {
      "indent": 3,
      "text": "The following information MUST be specified in the registry:",
      "zh-CHS": "必须在注册表中指定以下信息："
    },
    {
      "indent": 3,
      "text": "o ID Value (1-65535)",
      "zh-CHS": "o ID值（1-65535）"
    },
    {
      "indent": 3,
      "text": "o Description",
      "zh-CHS": "o 描述"
    },
    {
      "indent": 3,
      "text": "o Allowed in Instance zero (Y/N)",
      "zh-CHS": "o 实例零中允许（是/否）"
    },
    {
      "indent": 3,
      "text": "o Reference Specification",
      "zh-CHS": "o 参考规范"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "zh-CHS": "10. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank JP. Vasseur and David Ward for providing the need to produce this document and Tony Li for making sure it was done with appropriate wisdom and prudence.",
      "zh-CHS": "作者要感谢JP。Vasseur和David Ward提供了制作本文件的必要性，Tony Li确保以适当的智慧和谨慎完成。"
    },
    {
      "indent": 0,
      "text": "11. Normative References",
      "section_title": true,
      "zh-CHS": "11. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISO10589] International Organization for Standardization, \"Intermediate system to Intermediate system intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode Network Service (ISO 8473)\", ISO/IEC 10589:2002, Second Edition, Nov. 2002.",
      "zh-CHS": "[ISO10589]国际标准化组织，“与提供无连接模式网络服务协议一起使用的中间系统到中间系统域内路由信息交换协议（ISO 8473）”，ISO/IEC 10589:2002，第二版，2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4971] Vasseur, JP., Shen, N., and R. Aggarwal, \"Intermediate System to Intermediate System (IS-IS) Extensions for Advertising Router Information\", RFC 4971, July 2007.",
      "zh-CHS": "[RFC4971]Vasseur，JP.，Shen，N.，和R.Aggarwal，“广告路由器信息的中间系统到中间系统（IS-IS）扩展”，RFC 49712007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, October 2008.",
      "zh-CHS": "[RFC5304]Li，T.和R.Atkinson，“IS-IS加密认证”，RFC 5304，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5305] Li, T. and H. Smit, \"IS-IS Extensions for Traffic Engineering\", RFC 5305, October 2008.",
      "zh-CHS": "[RFC5305]Li，T.和H.Smit，“交通工程的IS-IS扩展”，RFC 5305，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, February 2009.",
      "zh-CHS": "[RFC5310]Bhatia，M.，Manral，V.，Li，T.，Atkinson，R.，White，R.，和M.Fanto，“IS-IS通用密码认证”，RFC 53102009年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6822] Previdi, S., Ginsberg, L., Shand, M., Roy, A., and D. Ward, \"IS-IS Multi-Instance\", RFC 6822, December 2012.",
      "zh-CHS": "[RFC6822]Previdi，S.，Ginsberg，L.，Shand，M.，Roy，A.，和D.Ward，“IS-IS多实例”，RFC 6822，2012年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Les Ginsberg Cisco Systems 510 McCarthy Blvd. Milpitas, CA 95035 USA",
      "zh-CHS": "莱斯金斯伯格思科系统公司，麦卡锡大道510号。美国加利福尼亚州米尔皮塔斯95035"
    },
    {
      "indent": 3,
      "text": "EMail: ginsberg@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems Via Del Serafico 200 00142 - Roma Italy",
      "zh-CHS": "Stefano Previdi思科系统通过Del Serafico 200 00142-意大利罗马"
    },
    {
      "indent": 3,
      "text": "EMail: sprevidi@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mike Shand Cisco Systems 250, Longwater Avenue. Reading, Berks RG2 6GB UK",
      "zh-CHS": "Mike Shand Cisco Systems 250，Longwater大道。雷丁，伯克斯RG2 6GB英国"
    },
    {
      "indent": 3,
      "text": "EMail: imc.shand@gmail.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}