{
  "title": {
    "text": "RFC 6041: Forwarding and Control Element Separation (ForCES) Applicability Statement",
    "zh-CHS": "RFC 6041"
  },
  "number": 6041,
  "created_at": "2021-11-05 01:37:40.740559+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Crouch\nRequest for Comments: 6041                                   H. Khosravi\nCategory: Informational                                            Intel\nISSN: 2070-1721                                            A. Doria, Ed.\n                                                                     LTU\n                                                                 X. Wang\n                                                                  Huawei\n                                                                K. Ogawa\n                                                         NTT Corporation\n                                                            October 2010",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Forwarding and Control Element Separation (ForCES) Applicability Statement",
      "zh-CHS": "转发和控制元素分离（ForCES）适用性声明"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Forwarding and Control Element Separation (ForCES) protocol defines a standard framework and mechanism for the interconnection between control elements and forwarding elements in IP routers and similar devices. In this document we describe the applicability of the ForCES model and protocol. We provide example deployment scenarios and functionality, as well as document applications that would be inappropriate for ForCES.",
      "zh-CHS": "转发和控制元素分离（ForCES）协议定义了IP路由器和类似设备中控制元素和转发元素之间互连的标准框架和机制。在本文件中，我们描述了ForCES模型和协议的适用性。我们提供了示例部署场景和功能，以及不适用于部队的文档应用程序。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6041.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6041."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2010 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "zh-CHS": "本文件可能包含2008年11月10日之前发布或公开的IETF文件或IETF贡献中的材料。控制某些材料版权的人员可能未授予IETF信托允许在IETF标准流程之外修改此类材料的权利。在未从控制此类材料版权的人员处获得充分许可的情况下，不得在IETF标准流程之外修改本文件，也不得在IETF标准流程之外创建其衍生作品，除了将其格式化以RFC形式发布或将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Purpose .........................................................4\n3. Terminology .....................................................4\n4. Applicability to IP Networks ....................................4\n   4.1. Applicable Services ........................................5\n        4.1.1. Association, Capability Discovery, and\n               Information Exchange ................................5\n        4.1.2. Topology Information Exchange .......................6\n        4.1.3. Configuration .......................................6\n        4.1.4. Routing Exchange ....................................6\n        4.1.5. QoS Capabilities Exchange and Configuration .........7\n        4.1.6. Security Exchange ...................................7\n        4.1.7. Filtering Exchange and Firewalls ....................7\n        4.1.8. Encapsulation/Tunneling Exchange ....................7\n        4.1.9. NAT and Application-Level Gateways ..................7\n        4.1.10. Measurement and Accounting .........................7\n        4.1.11. Diagnostics ........................................8\n        4.1.12. Redundancy and Failover ............................8\n   4.2. CE-FE Link Capability ......................................8\n   4.3. CE/FE Locality .............................................8\n5. Security Considerations .........................................9\n6. ForCES Manageability ............................................9\n   6.1. The NE as an Atomic Element ...............................10\n   6.2. The NE as Composed of Manageable Elements .................10\n   6.3. ForCES Protocol MIB .......................................10\n        6.3.1. MIB Management of an FE ............................11\n   6.4. The FEM and CEM ...........................................12\n7. Contributors ...................................................12\n8. Acknowledgments ................................................12\n9. References .....................................................12\n   9.1. Normative References ......................................12\n   9.2. Informative References ....................................13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The Forwarding and Control Element Separation (ForCES) protocol defines a standard framework and mechanism for the exchange of information between the logically separate functionality of the control and data forwarding planes of IP routers and similar devices. It focuses on the communication necessary for separation of control plane functionality such as routing protocols, signaling protocols, and admission control from data forwarding plane per-packet activities such as packet forwarding, queuing, and header editing.",
      "zh-CHS": "转发和控制元素分离（ForCES）协议定义了一个标准框架和机制，用于在IP路由器和类似设备的控制和数据转发平面的逻辑分离功能之间交换信息。它着重于将控制平面功能（如路由协议、信令协议）与数据转发平面（如分组转发、排队和报头编辑）分离所需的通信。"
    },
    {
      "indent": 3,
      "text": "This document defines the applicability of the ForCES mechanisms. It describes types of configurations and settings where ForCES is most appropriately applied. This document also describes scenarios and configurations where ForCES would not be appropriate for use.",
      "zh-CHS": "本文件定义了力机制的适用性。它描述了最适合应用力的配置和设置类型。本文档还描述了部队不适合使用的场景和配置。"
    },
    {
      "indent": 0,
      "text": "2. Purpose",
      "section_title": true,
      "zh-CHS": "2. 意图"
    },
    {
      "indent": 3,
      "text": "The purpose of the ForCES Applicability Statement is to capture the intent of the ForCES protocol [RFC5810] designers as to how the protocol could be used in conjunction with the ForCES model [RFC5812] and a Transport Mapping Layer [RFC5811].",
      "zh-CHS": "ForCES适用性声明的目的在于说明ForCES协议[RFC5810]设计者的意图，即协议如何与ForCES模型[RFC5812]和传输映射层[RFC5811]结合使用。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "zh-CHS": "3. 术语"
    },
    {
      "indent": 3,
      "text": "A set of concepts associated with ForCES was introduced in \"Requirements for Separation of IP Control and Forwarding\" [RFC3654] and in \"Forwarding and Control Element Separation (ForCES) Framework\" [RFC3746]. The terminology associated with these concepts and with the protocol elements in ForCES is defined in the \"Forwarding and Control Element Separation (ForCES) Protocol Specification\" [RFC5810].",
      "zh-CHS": "“IP控制和转发分离要求”[RFC3654]和“转发和控制单元分离（部队）框架”[RFC3746]中引入了一组与部队相关的概念。“转发和控制元素分离（ForCES）协议规范”[RFC5810]中定义了与这些概念和ForCES协议元素相关的术语。"
    },
    {
      "indent": 3,
      "text": "The reader is directed to these documents for the conceptual introduction and for definitions, including the following acronyms:",
      "zh-CHS": "读者可通过这些文件了解概念介绍和定义，包括以下首字母缩略词："
    },
    {
      "indent": 3,
      "text": "o CE: control element",
      "zh-CHS": "o 控制元件"
    },
    {
      "indent": 3,
      "text": "o CEM: CE Manager",
      "zh-CHS": "o 行政长官：行政长官"
    },
    {
      "indent": 3,
      "text": "o FE: forwarding element",
      "zh-CHS": "o FE：转发元素"
    },
    {
      "indent": 3,
      "text": "o FEM: FE Manager",
      "zh-CHS": "o 有限元：有限元经理"
    },
    {
      "indent": 3,
      "text": "o ForCES: Forwarding and Control Element Separation protocol",
      "zh-CHS": "o ForCES：转发和控制元素分离协议"
    },
    {
      "indent": 3,
      "text": "o LFB: Logical Function Block",
      "zh-CHS": "o 逻辑功能块"
    },
    {
      "indent": 3,
      "text": "o NE: ForCES network element",
      "zh-CHS": "o NE：部队网络单元"
    },
    {
      "indent": 3,
      "text": "o TML: Transport Mapping Layer",
      "zh-CHS": "o TML：传输映射层"
    },
    {
      "indent": 0,
      "text": "4. Applicability to IP Networks",
      "section_title": true,
      "zh-CHS": "4. 适用于IP网络"
    },
    {
      "indent": 3,
      "text": "This section lists the areas of ForCES applicability in IP network devices. Some relatively low-end routing systems may be implemented on simple hardware that performs both control and packet forwarding functionality. ForCES may not be useful for such devices.",
      "zh-CHS": "本节列出了IP网络设备中的适用范围。一些相对低端的路由系统可以在执行控制和分组转发功能的简单硬件上实现。这些力对此类装置可能没有用处。"
    },
    {
      "indent": 3,
      "text": "Higher-end routing systems typically distribute work amongst several interface-processing elements, and these devices (FEs) therefore need to communicate with the control element(s) to perform their job. A higher-end router may also distribute control processing amongst several processing elements (CEs). ForCES provides a standard way to do this communication. ForCES also provides support for high-availability configurations that include a primary CE and one or more secondary CEs.",
      "zh-CHS": "高端路由系统通常在几个接口处理单元之间分配工作，因此这些设备（FEs）需要与控制单元通信以执行其工作。高端路由器还可以在多个处理元件（ce）之间分配控制处理。ForCES提供了进行此通信的标准方式。ForCES还支持包括主CE和一个或多个辅助CE的高可用性配置。"
    },
    {
      "indent": 3,
      "text": "The remainder of this section lists the applicable services that ForCES may support, applicable FE functionality, applicable CE-FE link scenarios, and applicable topologies in which ForCES may be deployed.",
      "zh-CHS": "本节剩余部分列出了部队可能支持的适用服务、适用FE功能、适用CE-FE链路场景以及部队可能部署的适用拓扑。"
    },
    {
      "indent": 0,
      "text": "4.1. Applicable Services",
      "section_title": true,
      "zh-CHS": "4.1. 适用服务"
    },
    {
      "indent": 3,
      "text": "In this section we describe the applicability of ForCES for the following control-forwarding-plane services:",
      "zh-CHS": "在本节中，我们描述了以下控制转发平面服务的力的适用性："
    },
    {
      "indent": 3,
      "text": "o Association, Capability Discovery, and Information Exchange",
      "zh-CHS": "o 关联、能力发现和信息交换"
    },
    {
      "indent": 3,
      "text": "o Topology Information Exchange",
      "zh-CHS": "o 拓扑信息交换"
    },
    {
      "indent": 3,
      "text": "o Configuration",
      "zh-CHS": "o 配置"
    },
    {
      "indent": 3,
      "text": "o Routing Exchange",
      "zh-CHS": "o 路由交换"
    },
    {
      "indent": 3,
      "text": "o Quality of Service (QoS) Exchange",
      "zh-CHS": "o 服务质量（QoS）交换"
    },
    {
      "indent": 3,
      "text": "o Security Exchange",
      "zh-CHS": "o 证券交易所"
    },
    {
      "indent": 3,
      "text": "o Filtering Exchange",
      "zh-CHS": "o 过滤交换"
    },
    {
      "indent": 3,
      "text": "o Encapsulation/Tunneling Exchange",
      "zh-CHS": "o 封装/隧道交换"
    },
    {
      "indent": 3,
      "text": "o NAT and Application-Level Gateways",
      "zh-CHS": "o NAT和应用层网关"
    },
    {
      "indent": 3,
      "text": "o Measurement and Accounting",
      "zh-CHS": "o 计量与会计"
    },
    {
      "indent": 3,
      "text": "o Diagnostics",
      "zh-CHS": "o 诊断学"
    },
    {
      "indent": 3,
      "text": "o CE Redundancy or CE Failover",
      "zh-CHS": "o CE冗余或CE故障切换"
    },
    {
      "indent": 0,
      "text": "4.1.1. Association, Capability Discovery, and Information Exchange",
      "section_title": true,
      "zh-CHS": "4.1.1. 关联、能力发现和信息交换"
    },
    {
      "indent": 3,
      "text": "Association is the first step of the ForCES protocol exchange in which capability discovery and exchange happens between one or more CEs and the FEs. ForCES assumes that CEs and FEs already have",
      "zh-CHS": "关联是ForCES协议交换的第一步，在此过程中，一个或多个CE与FEs之间发生能力发现和交换。ForCES假设CEs和FEs已经"
    },
    {
      "indent": 3,
      "text": "sufficient information to begin communication in a secure manner. The ForCES protocol is only applicable after CEs and FEs have discovered each other. ForCES makes no assumption about whether discovery was performed using a dynamic protocol or merely static configuration. Some discussion about how this can occur can be found in Section 6.4 of this document.",
      "zh-CHS": "足够的信息以安全的方式开始通信。只有在CEs和FEs发现对方后，ForCES协议才适用。ForCES不假设是使用动态协议还是仅使用静态配置执行发现。本文件第6.4节对如何实现这一点进行了一些讨论。"
    },
    {
      "indent": 3,
      "text": "During the association phase, CEs and FEs exchange capability information with each other. For example, the FEs express the number of interface ports they provide, as well as the static and configurable attributes of each port.",
      "zh-CHS": "在关联阶段，CEs和FEs相互交换能力信息。例如，FEs表示它们提供的接口端口的数量，以及每个端口的静态和可配置属性。"
    },
    {
      "indent": 3,
      "text": "In addition to initial configuration, the CEs and FEs also exchange dynamic configuration changes using ForCES. For example, FEs asynchronously inform the CEs of an increase/decrease in available resources or capabilities on the FE.",
      "zh-CHS": "除了初始配置外，CEs和FEs还使用武力交换动态配置更改。例如，FE异步通知CEs FE上可用资源或能力的增加/减少。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Topology Information Exchange",
      "section_title": true,
      "zh-CHS": "4.1.2. 拓扑信息交换"
    },
    {
      "indent": 3,
      "text": "In this context, topology information relates to how the FEs are interconnected with each other with respect to packet forwarding. Topology discovery is outside the scope of the ForCES protocol. An implementation can choose its own method of topology discovery (for example, it can use a standard topology discovery protocol or apply a static topology configuration policy). Once the topology is established, the ForCES protocol may be used to transmit the resulting information to the CEs.",
      "zh-CHS": "在此上下文中，拓扑信息与FEs如何在分组转发方面彼此互连有关。拓扑发现不在ForCES协议的范围内。实现可以选择自己的拓扑发现方法（例如，可以使用标准拓扑发现协议或应用静态拓扑配置策略）。一旦建立了拓扑，就可以使用ForCES协议将结果信息传输到CEs。"
    },
    {
      "indent": 0,
      "text": "4.1.3. Configuration",
      "section_title": true,
      "zh-CHS": "4.1.3. 配置"
    },
    {
      "indent": 3,
      "text": "ForCES is used to perform FE configuration. For example, CEs set configurable FE attributes such as IP addresses, etc. for their interfaces.",
      "zh-CHS": "力用于执行FE配置。例如，CEs为其接口设置可配置的FE属性，如IP地址等。"
    },
    {
      "indent": 0,
      "text": "4.1.4. Routing Exchange",
      "section_title": true,
      "zh-CHS": "4.1.4. 路由交换"
    },
    {
      "indent": 3,
      "text": "ForCES may be used to deliver packet forwarding information resulting from CE routing calculations. For example, CEs may send forwarding table updates to the FEs, so that they can make forwarding decisions. FEs may inform the CEs in the event of a forwarding table miss. ForCES may also be used to configure Equal Cost Multi-Path (ECMP) capability.",
      "zh-CHS": "强制可用于传递由CE路由计算产生的分组转发信息。例如，CEs可以向FEs发送转发表更新，以便它们能够做出转发决策。FEs可在转发表未命中的情况下通知CEs。部队也可用于配置等成本多路径（ECMP）能力。"
    },
    {
      "indent": 0,
      "text": "4.1.5. QoS Capabilities Exchange and Configuration",
      "section_title": true,
      "zh-CHS": "4.1.5. QoS功能交换和配置"
    },
    {
      "indent": 3,
      "text": "ForCES may be used to exchange QoS capabilities between CEs and FEs. For example, an FE may express QoS capabilities to the CE. Such capabilities might include metering, policing, shaping, and queuing functions. The CE may use ForCES to configure these capabilities.",
      "zh-CHS": "部队可用于在CEs和FEs之间交换QoS能力。例如，FE可以向CE表示QoS能力。这些功能可能包括计量、监管、成形和排队功能。CE可以使用强制配置这些功能。"
    },
    {
      "indent": 0,
      "text": "4.1.6. Security Exchange",
      "section_title": true,
      "zh-CHS": "4.1.6. 证券交易所"
    },
    {
      "indent": 3,
      "text": "ForCES may be used to exchange security information between a CE and the FEs it controls. For example, the FE may use ForCES to express the types of encryption that it is capable of using in an IP Security (IPsec) tunnel. The CE may use ForCES to configure such a tunnel. The CEs would be responsible for the NE dynamic key exchanges and updates.",
      "zh-CHS": "部队可用于CE和其控制的FEs之间交换安全信息。例如，FE可以使用强制来表示它能够在IP安全（IPsec）隧道中使用的加密类型。CE可以使用强制来配置这样的隧道。CEs将负责NE动态密钥交换和更新。"
    },
    {
      "indent": 0,
      "text": "4.1.7. Filtering Exchange and Firewalls",
      "section_title": true,
      "zh-CHS": "4.1.7. 过滤交换和防火墙"
    },
    {
      "indent": 3,
      "text": "ForCES may be used to exchange filtering information. For example, FEs may use ForCES to express the filtering functions, such as classification and action, that they can perform, and the CE may configure these capabilities.",
      "zh-CHS": "力可用于交换过滤信息。例如，FEs可以使用强制来表示它们可以执行的过滤功能，例如分类和操作，CE可以配置这些功能。"
    },
    {
      "indent": 0,
      "text": "4.1.8. Encapsulation/Tunneling Exchange",
      "section_title": true,
      "zh-CHS": "4.1.8. 封装/隧道交换"
    },
    {
      "indent": 3,
      "text": "ForCES may be used to exchange encapsulation capabilities of an FE, such as tunneling, and the configuration of such capabilities.",
      "zh-CHS": "力可用于交换FE的封装能力，如隧道以及此类能力的配置。"
    },
    {
      "indent": 0,
      "text": "4.1.9. NAT and Application-Level Gateways",
      "section_title": true,
      "zh-CHS": "4.1.9. NAT和应用层网关"
    },
    {
      "indent": 3,
      "text": "ForCES may be used to exchange configuration information for Network Address Translators. Whilst ForCES is not specifically designed for the configuration of application-level gateway functionality, this may be in scope for some types of application-level gateways.",
      "zh-CHS": "ForCES可用于交换网络地址转换器的配置信息。虽然ForCES不是专门为配置应用级网关功能而设计的，但这可能适用于某些类型的应用级网关。"
    },
    {
      "indent": 0,
      "text": "4.1.10. Measurement and Accounting",
      "section_title": true,
      "zh-CHS": "4.1.10. 计量与会计"
    },
    {
      "indent": 3,
      "text": "ForCES may be used to exchange configuration information regarding traffic measurement and accounting functionality. In this area, ForCES may overlap somewhat with functionality provided by network management mechanisms such as the Simple Network Management Protocol (SNMP). In some cases, ForCES may be used to convey information to the CE to be reported externally using SNMP. A further discussion of this capability is covered in Section 6 of this document.",
      "zh-CHS": "ForCES可用于交换有关流量测量和计费功能的配置信息。在这方面，部队可能与网络管理机制（如简单网络管理协议（SNMP））提供的功能有些重叠。在某些情况下，可以使用强制向CE传递信息，以便使用SNMP从外部报告。本文件第6节对该能力进行了进一步讨论。"
    },
    {
      "indent": 0,
      "text": "4.1.11. Diagnostics",
      "section_title": true,
      "zh-CHS": "4.1.11. 诊断学"
    },
    {
      "indent": 3,
      "text": "ForCES may be used for CEs and FEs to exchange diagnostic information. For example, an FE can send self-test results to a CE.",
      "zh-CHS": "CEs和FEs可以使用强制来交换诊断信息。例如，FE可以将自检结果发送给CE。"
    },
    {
      "indent": 0,
      "text": "4.1.12. Redundancy and Failover",
      "section_title": true,
      "zh-CHS": "4.1.12. 冗余和故障切换"
    },
    {
      "indent": 3,
      "text": "The ForCES architecture includes mechanisms that allow for multiple redundant CEs and FEs in a ForCES NE. The ForCES-model LFB definitions provide sufficient component details via component identifiers to be universally unique within an NE. The ForCES protocol includes mechanisms to facilitate transactions as well as atomicity across the NE.",
      "zh-CHS": "ForCES架构包括允许ForCES NE中存在多个冗余CE和FEs的机制。部队模型LFB定义通过组件标识符提供了足够的组件详细信息，使其在网元内具有普遍唯一性。ForCES协议包括促进整个网元的事务和原子性的机制。"
    },
    {
      "indent": 3,
      "text": "Given the above, it is possible to deploy redundant CEs and FEs that incorporate failover.",
      "zh-CHS": "鉴于上述情况，可以部署包含故障切换的冗余CE和FEs。"
    },
    {
      "indent": 0,
      "text": "4.2. CE-FE Link Capability",
      "section_title": true,
      "zh-CHS": "4.2. CE-FE链路能力"
    },
    {
      "indent": 3,
      "text": "When using ForCES, the bandwidth of the CE-FE link is a consideration, and cannot be ignored. For example, sending a full routing table is reasonable over a high-bandwidth link, but could be non-trivial over a lower-bandwidth link. ForCES should be sufficiently future-proof to be applicable in scenarios where routing tables grow to several orders of magnitude greater than their current size. However, we also note that not all IP routers need full routing tables.",
      "zh-CHS": "使用力时，CE-FE链路的带宽是一个考虑因素，不能忽略。例如，在高带宽链路上发送完整的路由表是合理的，但在低带宽链路上则可能非常重要。在路由表增长到比其当前大小大几个数量级的情况下，部队应具有足够的未来证明。然而，我们也注意到并非所有的IP路由器都需要完整的路由表。"
    },
    {
      "indent": 0,
      "text": "4.3. CE/FE Locality",
      "section_title": true,
      "zh-CHS": "4.3. CE/FE局部性"
    },
    {
      "indent": 3,
      "text": "ForCES is intended for environments where one of the following applies:",
      "zh-CHS": "力适用于以下情况之一的环境："
    },
    {
      "indent": 3,
      "text": "o The control interconnect is some form of local bus, switch, or LAN, where reliability is high, closely controlled, and not susceptible to external disruption that does not also affect the CEs and/or FEs.",
      "zh-CHS": "o 控制互连是某种形式的本地总线、交换机或LAN，其中可靠性高，控制严密，不易受到不影响CEs和/或FEs的外部中断的影响。"
    },
    {
      "indent": 3,
      "text": "o The control interconnect shares its fate with the FE's forwarding function. Typically this is because the control connection is also the FE's primary packet forwarding connection, and so if that link goes down, the FE cannot forward packets anyway.",
      "zh-CHS": "o 控制互连与FE的转发功能共享命运。通常这是因为控制连接也是FE的主要数据包转发连接，因此如果该链路断开，FE无论如何都无法转发数据包。"
    },
    {
      "indent": 3,
      "text": "The key guideline is that the reliability of the device should not be significantly reduced by the separation of control and forwarding functionality.",
      "zh-CHS": "关键准则是，控制和转发功能的分离不应显著降低设备的可靠性。"
    },
    {
      "indent": 3,
      "text": "Taking this into account, ForCES is applicable in the following CE/FE localities:",
      "zh-CHS": "考虑到这一点，力适用于以下CE/FE地区："
    },
    {
      "indent": 3,
      "text": "Single Box NE: chassis with multiple CEs and FEs set up. ForCES is applicable in localities consisting of control and forwarding elements that are components in the same physical box.",
      "zh-CHS": "单箱NE：设置了多个CEs和FEs的机箱。力适用于由控制和转发元素组成的位置，控制和转发元素是同一物理框中的组件。"
    },
    {
      "indent": 6,
      "text": "Example: a network element with a single control blade, and one or more forwarding blades, all present in the same chassis and sharing an interconnect such as Ethernet or Peripheral Component Interconnect (PCI). In this locality, the majority of the data traffic being forwarded typically does not traverse the same links as the ForCES control traffic.",
      "zh-CHS": "示例：具有单个控制刀片和一个或多个转发刀片的网元，所有这些刀片都位于同一机箱中，并共享互连，如以太网或外围组件互连（PCI）。在这种情况下，被转发的大部分数据流量通常不会穿过与部队控制流量相同的链路。"
    },
    {
      "indent": 3,
      "text": "Multiple Box NE: separated CE and FE, where physical locality could be the same rack, room, or building; or long distances that could span across continents and oceans. ForCES is applicable in localities consisting of control and forwarding elements that are separated by a single hop or multiple hops in the network.",
      "zh-CHS": "多箱NE：分离的CE和FE，物理位置可以是同一机架、房间或建筑物；或者可以跨越大陆和海洋的远距离。ForCES适用于由控制和转发元素组成的位置，这些元素在网络中由单个跃点或多个跃点分隔。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The ForCES protocol allows for a variety of security levels [RFC5810]. When operating under a secured physical environment, or for other operational concerns (in some cases, performance issues), the operator may turn off all the security functions between CEs and FEs. When the operator makes a decision to secure the path between the FEs and CEs, then the operator chooses from one of the options provided by the TML. Security choices provided by the TML take effect during the pre-association phase of the ForCES protocol. An operator may choose to use all, some, or none of the security services provided by the TML in a CE-FE connection. A ForCES NE is required to provide CE/FE node authentication services, and may provide message integrity and confidentiality services. The NE may provide these services by employing IPsec or Transport Layer Security (TLS), depending on the choice of TML used in the deployment of the NE.",
      "zh-CHS": "ForCES协议允许各种安全级别[RFC5810]。在安全的物理环境下运行时，或出于其他运行问题（在某些情况下，性能问题），操作员可能会关闭CEs和FEs之间的所有安全功能。当运营商决定保护FEs和CEs之间的路径时，运营商从TML提供的选项中进行选择。TML提供的安全选择在部队协议的预关联阶段生效。运营商可以选择在CE-FE连接中使用TML提供的全部、部分或全部安全服务。强制网元需要提供CE/FE节点认证服务，并且可以提供消息完整性和机密性服务。网元可以通过采用IPsec或传输层安全性（TLS）来提供这些服务，这取决于在部署网元时使用的TML的选择。"
    },
    {
      "indent": 0,
      "text": "6. ForCES Manageability",
      "section_title": true,
      "zh-CHS": "6. 部队可管理性"
    },
    {
      "indent": 3,
      "text": "From the architectural perspective, the ForCES NE is a single network element. As an example, if the ForCES NE is specifically a router that needs to be managed, then it should be managed in essentially the same way any router should be managed. From another perspective, element management could directly view the individual entities and interfaces that make up a ForCES NE. However, any element management",
      "zh-CHS": "从架构的角度来看，ForCES NE是一个单一的网络元素。例如，如果ForCES NE特别是需要管理的路由器，则应以与管理任何路由器基本相同的方式对其进行管理。从另一个角度来看，元素管理可以直接查看组成元素的各个实体和接口。但是，任何元素管理"
    },
    {
      "indent": 3,
      "text": "updates made directly on these entities and interfaces may compromise the control relationship between the CEs and the FEs, unless the update mechanism has been accounted for in the model used by the NE.",
      "zh-CHS": "直接在这些实体和接口上进行的更新可能会损害CEs和FEs之间的控制关系，除非更新机制已在网元使用的模型中得到考虑。"
    },
    {
      "indent": 0,
      "text": "6.1. The NE as an Atomic Element",
      "section_title": true,
      "zh-CHS": "6.1. 作为原子元素的氖"
    },
    {
      "indent": 3,
      "text": "From the ForCES Requirements [RFC3654], Section 4, point 4:",
      "zh-CHS": "根据部队要求[RFC3654]，第4节第4点："
    },
    {
      "indent": 6,
      "text": "A NE MUST support the appearance of a single functional device.",
      "zh-CHS": "网元必须支持单个功能设备的外观。"
    },
    {
      "indent": 3,
      "text": "As a single functional device, a ForCES NE runs protocols, and each of the protocols has its own existing manageability aspects that are documented elsewhere. As an example, a router would also have a configuration interface. When viewed in this manner, the NE is controlled as a single routing entity, and no new management beyond what is already available for routers and routing protocols would be required for a ForCES NE. Management commands on a management interface to the NE will arrive at the CE and may require ForCES interactions between the CE and FEs to complete. This may impact the atomicity of such commands and may require careful implementation by the CE.",
      "zh-CHS": "作为单个功能设备，强制网元运行协议，并且每个协议都有其自己的现有可管理性方面，这些方面在别处有记录。例如，路由器也会有一个配置接口。当以这种方式查看时，网元作为单个路由实体进行控制，并且除了路由器和路由协议已经可用之外，不需要对网元进行新的管理。网元管理界面上的管理命令将到达CE，可能需要强制CE和FEs之间的交互才能完成。这可能会影响此类命令的原子性，并且可能需要CE仔细执行。"
    },
    {
      "indent": 0,
      "text": "6.2. The NE as Composed of Manageable Elements",
      "section_title": true,
      "zh-CHS": "6.2. 网元由可管理的元素组成"
    },
    {
      "indent": 3,
      "text": "When viewed as a decomposed set of elements from the management perspective, the ForCES NE is divided into a set of one of more control elements, forwarding elements, and the interfaces between them. The interface functionality between the CE and the FE is provided by the ForCES protocol. A MIB module is provided for the purpose of gaining management information on the operation of the protocol described in Section 6.3 of this document.",
      "zh-CHS": "从管理的角度来看，当被视为一组分解的元素时，力NE被划分为一组多个控制元素、转发元素以及它们之间的接口中的一个。CE和FE之间的接口功能由ForCES协议提供。MIB模块用于获取本文件第6.3节所述协议操作的管理信息。"
    },
    {
      "indent": 3,
      "text": "Additionally, the architecture makes provisions for configuration control of the individual CEs and FEs. This is handled by elements called the FE Manager (FEM) and the CE Manager (CEM). Specifically, from the ForCES Requirements RFC [RFC3654], Section 4, point 4:",
      "zh-CHS": "此外，该体系结构还规定了各个CE和FEs的配置控制。这由称为FE管理器（FEM）和CE管理器（CEM）的元素处理。具体而言，根据部队要求RFC[RFC3654]，第4节第4点："
    },
    {
      "indent": 6,
      "text": "However, external entities (e.g., FE Managers and CE Managers) MAY have direct access to individual ForCES protocol elements for providing information to transition them from the pre-association to the post-association phase.",
      "zh-CHS": "但是，外部实体（如FE经理和CE经理）可以直接访问各个部队协议元素，以提供信息，将其从关联前阶段过渡到关联后阶段。"
    },
    {
      "indent": 0,
      "text": "6.3. ForCES Protocol MIB",
      "section_title": true,
      "zh-CHS": "6.3. 强制协议MIB"
    },
    {
      "indent": 3,
      "text": "The ForCES MIB [RFC5813] defines a primarily read-only MIB module that captures information related to the ForCES protocol. This includes state information about the associations between CE(s) and FE(s) in the NE.",
      "zh-CHS": "ForCES MIB[RFC5813]定义了一个主要为只读的MIB模块，用于捕获与ForCES协议相关的信息。这包括有关网元中CE（s）和FE（s）之间关联的状态信息。"
    },
    {
      "indent": 3,
      "text": "The ForCES MIB does not include information that is specified in other MIB modules, such as packet counters for interfaces, etc.",
      "zh-CHS": "ForCES MIB不包括在其他MIB模块中指定的信息，例如接口的数据包计数器等。"
    },
    {
      "indent": 3,
      "text": "More specifically, the information in the ForCES MIB module relative to associations includes:",
      "zh-CHS": "更具体地说，ForCES MIB模块中与关联相关的信息包括："
    },
    {
      "indent": 3,
      "text": "o identifiers of the elements in the association",
      "zh-CHS": "o 关联中元素的标识符"
    },
    {
      "indent": 3,
      "text": "o state of the association",
      "zh-CHS": "o 协会状况"
    },
    {
      "indent": 3,
      "text": "o configuration parameters of the association",
      "zh-CHS": "o 关联的配置参数"
    },
    {
      "indent": 3,
      "text": "o statistics of the association",
      "zh-CHS": "o 协会统计数字"
    },
    {
      "indent": 0,
      "text": "6.3.1. MIB Management of an FE",
      "section_title": true,
      "zh-CHS": "6.3.1. FE的MIB管理"
    },
    {
      "indent": 3,
      "text": "While it is possible to manage an FE from an element manager, several requirements relating to this have been included in the ForCES Requirements.",
      "zh-CHS": "虽然可以从分队经理处管理FE，但与此相关的若干要求已包含在部队要求中。"
    },
    {
      "indent": 3,
      "text": "From the ForCES Requirements [RFC3654], Section 4, point 14:",
      "zh-CHS": "根据部队要求[RFC3654]，第4节第14点："
    },
    {
      "indent": 6,
      "text": "1. The ability for a management tool (e.g., SNMP) to be used to read (but not change) the state of FE SHOULD NOT be precluded.",
      "zh-CHS": "1. 不应排除使用管理工具（如SNMP）读取（但不更改）FE状态的能力。"
    },
    {
      "indent": 6,
      "text": "2. It MUST NOT be possible for management tools (e.g., SNMP, etc) to change the state of a FE in a manner that affects overall NE behavior without the CE being notified.",
      "zh-CHS": "2. 在未通知CE的情况下，管理工具（如SNMP等）不得以影响整个网元行为的方式更改FE的状态。"
    },
    {
      "indent": 3,
      "text": "The ForCES Framework [RFC3746], Section 5.7, goes further in discussing the manner in which FEs should handle management requests that are specifically directed to the FE:",
      "zh-CHS": "部队框架[RFC3746]第5.7节进一步讨论了FEs应以何种方式处理专门针对FE的管理请求："
    },
    {
      "indent": 6,
      "text": "(For a ForCES NE that is an IP router,) RFC 1812 [RFC1812] also dictates that \"Routers must be manageable by SNMP\". In general, for the post-association phase, most external management tasks (including SNMP) should be done through interaction with the CE in order to support the appearance of a single functional device. Therefore, it is recommended that an SNMP agent be implemented by CEs and that the SNMP messages received by FEs be redirected to their CEs. AgentX framework defined in RFC 2741 [RFC2741]) may be applied here such that CEs act in the role of master agent to process SNMP messages while FEs act in the role of subagent to provide access to the MIB objects residing on FEs. AgentX protocol messages between the master agent (CE) and the subagent (FE) are encapsulated and transported via ForCES, just like data packets from any other application layer protocols.",
      "zh-CHS": "（对于作为IP路由器的强制网元，）RFC 1812[RFC1812]还规定“路由器必须由SNMP管理”。一般来说，对于关联后阶段，大多数外部管理任务（包括SNMP）应通过与CE的交互来完成，以支持单个功能设备的外观。因此，建议由CEs实现SNMP代理，并将FEs接收的SNMP消息重定向到其CEs。此处可应用RFC 2741[RFC2741]中定义的AgentX框架，以便CEs以主代理的角色处理SNMP消息，而FEs以子代理的角色提供对驻留在FEs上的MIB对象的访问。主代理（CE）和子代理（FE）之间的AgentX协议消息通过FORCE进行封装和传输，就像来自任何其他应用层协议的数据包一样。"
    },
    {
      "indent": 0,
      "text": "6.4. The FEM and CEM",
      "section_title": true,
      "zh-CHS": "6.4. 有限元法与CEM"
    },
    {
      "indent": 3,
      "text": "Though out of scope for the initial ForCES specification effort, the ForCES architecture includes two entities: the CE Manager (CEM) and the FE Manager (FEM). From the ForCES Protocol Specification [RFC5810]:",
      "zh-CHS": "虽然超出了初始部队规范工作的范围，但部队体系结构包括两个实体：CE管理器（CEM）和FE管理器（FEM）。根据ForCES协议规范[RFC5810]："
    },
    {
      "indent": 3,
      "text": "CE Manager (CEM): A logical entity responsible for generic CE management tasks. It is particularly used during the pre-association phase to determine with which FE(s) a CE should communicate.",
      "zh-CHS": "CE管理器（CEM）：负责通用CE管理任务的逻辑实体。它特别用于在预关联阶段确定CE应与哪些FE通信。"
    },
    {
      "indent": 3,
      "text": "FE Manager (FEM): A logical entity responsible for generic FE management tasks. It is used during the pre-association phase to determine with which CE(s) an FE should communicate.",
      "zh-CHS": "FE管理器（FEM）：负责一般FE管理任务的逻辑实体。它在预关联阶段用于确定FE应与哪些CE通信。"
    },
    {
      "indent": 0,
      "text": "7. Contributors",
      "section_title": true,
      "zh-CHS": "7. 贡献者"
    },
    {
      "indent": 3,
      "text": "Mark Handley was an initial author involved in the earlier versions of this document.",
      "zh-CHS": "马克·汉德利是本文件早期版本的最初作者。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "Many of the participants in the ForCES WG, as well as fellow employees of the authors, have provided valuable input into this work. Particular thanks go to Jamal Hadi Salim, our WG chair and document shepherd; and to Adrian Farrel, the AD for the area; for their review, comments, and encouragement, without which this document might never have been completed.",
      "zh-CHS": "ForCES工作组的许多参与者以及作者的同事为这项工作提供了宝贵的投入。特别感谢Jamal Hadi Salim，我们的工作组主席和文件管理员；和阿德里安·法雷尔，该地区的广告；感谢他们的审查、评论和鼓励，没有这些，本文件可能永远无法完成。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC1812] Baker, F., \"Requirements for IP Version 4 Routers\", RFC 1812, June 1995.",
      "zh-CHS": "[RFC1812]Baker，F.，“IP版本4路由器的要求”，RFC1812，1995年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5810] Doria, A., Hadi Salim, J., Haas, R., Khosravi, H., Wang, W., Dong, L., Gopal, R., and J. Halpern, \"Forwarding and Control Element Separation (ForCES) Protocol Specification\", RFC 5810, March 2010.",
      "zh-CHS": "[RFC5810]Doria，A.，Hadi Salim，J.，Haas，R.，Khosravi，H.，Wang，W.，Dong，L.，Gopal，R.，和J.Halpern，“转发和控制元件分离（部队）协议规范”，RFC 58102010年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5811] Hadi Salim, J. and K. Ogawa, \"SCTP-Based Transport Mapping Layer (TML) for the Forwarding and Control Element Separation (ForCES) Protocol\", RFC 5811, March 2010.",
      "zh-CHS": "[RFC5811]Hadi Salim，J.和K.Ogawa，“转发和控制元素分离（ForCES）协议的基于SCTP的传输映射层（TML）”，RFC 58112010年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5812] Halpern, J. and J. Hadi Salim, \"Forwarding and Control Element Separation (ForCES) Forwarding Element Model\", RFC 5812, March 2010.",
      "zh-CHS": "[RFC5812]Halpern，J.和J.Hadi Salim，“转发和控制单元分离（部队）转发单元模型”，RFC 5812，2010年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5813] Haas, R., \"Forwarding and Control Element Separation (ForCES) MIB\", RFC 5813, March 2010.",
      "zh-CHS": "[RFC5813]Haas，R.，“转发和控制单元分离（部队）MIB”，RFC 5813，2010年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2741] Daniele, M., Wijnen, B., Ellison, M., and D. Francisco, \"Agent Extensibility (AgentX) Protocol Version 1\", RFC 2741, January 2000.",
      "zh-CHS": "[RFC2741]Daniele，M.，Wijnen，B.，Ellison，M.，和D.Francisco，“代理可扩展性（AgentX）协议版本1”，RFC 27412000年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3654] Khosravi, H. and T. Anderson, \"Requirements for Separation of IP Control and Forwarding\", RFC 3654, November 2003.",
      "zh-CHS": "[RFC3654]Khosravi，H.和T.Anderson，“IP控制和转发分离的要求”，RFC 3654，2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3746] Yang, L., Dantu, R., Anderson, T., and R. Gopal, \"Forwarding and Control Element Separation (ForCES) Framework\", RFC 3746, April 2004.",
      "zh-CHS": "[RFC3746]Yang，L.，Dantu，R.，Anderson，T.，和R.Gopal，“转发和控制单元分离（部队）框架”，RFC 37462004年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Alan Crouch Intel 2111 NE 25th Avenue Hillsboro, OR 97124 USA",
      "zh-CHS": "艾伦·克劳奇英特尔2111美国希尔斯伯勒第25大道东北，邮编：97124"
    },
    {
      "indent": 3,
      "text": "Phone: +1 503 264 2196\nEMail: alan.crouch@intel.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Hormuzd Khosravi Intel 2111 NE 25th Avenue Hillsboro, OR 97124 USA",
      "zh-CHS": "美国希尔斯伯勒第25大道东北2111号霍尔木兹德科斯拉维英特尔公司，邮编：97124"
    },
    {
      "indent": 3,
      "text": "Phone: 1-503-264-0334 EMail: hormuzd.m.khosravi@intel.com",
      "zh-CHS": "电话：1-503-264-0334电子邮件：hormuzd.m。khosravi@intel.com"
    },
    {
      "indent": 3,
      "text": "Avri Doria (editor) LTU Lulea University of Technology Sweden",
      "zh-CHS": "Avri Doria（编辑）LUU Lulea技术大学瑞典"
    },
    {
      "indent": 3,
      "text": "Phone: +46 73 277 1788\nEMail: avri@acm.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Xin-ping Wang Huawei Beijing China",
      "zh-CHS": "王新平华为中国北京"
    },
    {
      "indent": 3,
      "text": "Phone: +86 10 82836067\nEMail: carly.wang@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Kentaro Ogawa NTT Corporation 3-9-11 Midori-cho Musashino-shi, Tokyo 180-8585 Japan",
      "zh-CHS": "日本东京小川健太郎NTT公司3-9-11 Midori cho Musashino shi 180-8585"
    },
    {
      "indent": 3,
      "text": "EMail: ogawa.kentaro@lab.ntt.co.jp",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}