{
  "title": {
    "text": "RFC 6226: PIM Group-to-Rendezvous-Point Mapping",
    "zh-CHS": "RFC 6226"
  },
  "number": 6226,
  "created_at": "2021-11-05 16:30:15.389419+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          B. Joshi\nRequest for Comments: 6226                     Infosys Technologies Ltd.\nUpdates: 4601                                                 A. Kessler\nCategory: Standards Track                            Cisco Systems, Inc.\nISSN: 2070-1721                                              D. McWalter\n                                                                May 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "PIM Group-to-Rendezvous-Point Mapping",
      "zh-CHS": "PIM组到集合点映射"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Each Protocol Independent Multicast - Sparse Mode (PIM-SM) router in a PIM domain that supports Any Source Multicast (ASM) maintains Group-to-RP mappings that are used to identify a Rendezvous Point (RP) for a specific multicast group. PIM-SM has defined an algorithm to choose a RP from the Group-to-RP mappings learned using various mechanisms. This algorithm does not consider the PIM mode and the mechanism through which a Group-to-RP mapping was learned.",
      "zh-CHS": "支持任何源多播（ASM）的PIM域中的每个协议独立多播稀疏模式（PIM-SM）路由器都维护组到RP的映射，这些映射用于标识特定多播组的集合点（RP）。PIM-SM定义了一种算法，用于从使用各种机制学习的组到RP映射中选择RP。该算法不考虑PIM模式和学习到群组到RP映射的机制。"
    },
    {
      "indent": 3,
      "text": "This document defines a standard algorithm to deterministically choose between several Group-to-RP mappings for a specific group. This document first explains the requirements to extend the Group-to-RP mapping algorithm and then proposes the new algorithm.",
      "zh-CHS": "本文档定义了一个标准算法，用于在特定组的多个组到RP映射之间进行决定性选择。本文档首先解释了将组扩展到RP映射算法的要求，然后提出了新算法。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6226.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6226."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................3\n3. Existing Algorithm ..............................................4\n4. Assumptions .....................................................5\n5. Common Use Cases ................................................5\n6. Proposed Algorithm ..............................................6\n7. Interpretation of MIB Objects ...................................8\n8. Clarification for MIB Objects ...................................8\n9. Use of Dynamic Group-to-RP Mapping Protocols ....................9\n10. Considerations for Bidirectional-PIM and BSR Hash ..............9\n11. Filtering Group-to-RP Mappings at Domain Boundaries ............9\n12. Security Considerations .......................................10\n13. Acknowledgements ..............................................10\n14. Normative References ..........................................10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Multiple mechanisms exist today to create and distribute Group-to-RP mappings. Each PIM-SM router may learn Group-to-RP mappings through various mechanisms, as described in Section 4.",
      "zh-CHS": "目前存在多种机制来创建和分发组到RP的映射。每个PIM-SM路由器可以通过各种机制学习组到RP的映射，如第4节所述。"
    },
    {
      "indent": 3,
      "text": "It is critical that each router select the same 'RP' for a specific multicast group address; otherwise, full multicast connectivity will not be established. This is true even when using an Anycast RP to provide redundancy. This RP address may correspond to a different physical router, but it is one logical RP address and must be consistent across the PIM domain. This is usually achieved by using the same algorithm to select the RP in all the PIM routers in a domain.",
      "zh-CHS": "每个路由器为特定的多播组地址选择相同的“RP”是至关重要的；否则，将无法建立完整的多播连接。即使在使用选播RP提供冗余时也是如此。此RP地址可能对应于不同的物理路由器，但它是一个逻辑RP地址，必须在整个PIM域中保持一致。这通常是通过使用相同的算法来选择域中所有PIM路由器中的RP来实现的。"
    },
    {
      "indent": 3,
      "text": "PIM-SM [RFC4601] has defined an algorithm to select a 'RP' for a given multicast group address, but it is not flexible enough for an administrator to apply various policies. Please refer to Section 3 for more details.",
      "zh-CHS": "PIM-SM[RFC4601]定义了一种算法，用于为给定的多播组地址选择“RP”，但它不够灵活，管理员无法应用各种策略。有关更多详细信息，请参阅第3节。"
    },
    {
      "indent": 3,
      "text": "The PIM-STD-MIB [RFC5060] includes a number of objects to allow an administrator to set the precedence for Group-to-RP mappings that are learned statically or dynamically and stored in the 'pimGroupMappingTable'. The Management Information Base (MIB) module also defines an algorithm that can be applied to the data contained in the 'pimGroupMappingTable' to determine Group-to-RP mappings. However, this algorithm is not completely deterministic, because it includes an implementation-specific 'precedence' value.",
      "zh-CHS": "PIM-STD-MIB[RFC5060]包括许多对象，允许管理员为静态或动态学习并存储在“pimGroupMappingTable”中的组到RP映射设置优先级。管理信息库（MIB）模块还定义了一种算法，该算法可应用于“pimGroupMappingTable”中包含的数据，以确定组到RP的映射。但是，该算法不是完全确定的，因为它包含一个特定于实现的“优先级”值。"
    },
    {
      "indent": 3,
      "text": "Network management stations will be able to deduce which RPs will be selected by applying the algorithm from this document to the list of Group-to-RP mappings from the 'pimGroupMappingTable'. The algorithm provides MIB visibility into how routers will apply Group-to-RP mappings and also fixes the inconsistency introduced by the way that different vendors implement the selection of the Group-to-RP mappings to create multicast forwarding state.",
      "zh-CHS": "网络管理站将能够通过将本文件中的算法应用于“pimGroupMappingTable”中的组到RP映射列表，推断将选择哪些RP。该算法为路由器如何应用组到RP映射提供了MIB可视性，并修复了不同供应商实现组到RP映射选择以创建多播转发状态所引入的不一致性。"
    },
    {
      "indent": 3,
      "text": "Embedded-RP, as defined in Section 7.1 of \"Embedding the Rendezvous Point (RP) Address in an IPv6 Multicast Address\" [RFC3956], specifies the following: \"To avoid loops and inconsistencies, for addresses in the range ff70::/12, the Embedded-RP mapping MUST be considered the longest possible match and higher priority than any other mechanism\".",
      "zh-CHS": "嵌入式RP，如“将集合点（RP）地址嵌入IPv6多播地址”[RFC3956]第7.1节所定义，规定如下：“为避免循环和不一致，对于ff70:：/12范围内的地址，嵌入式RP映射必须被视为最长的匹配，且优先级高于任何其他机制”。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "This document also uses the following terms:",
      "zh-CHS": "本文件还使用以下术语："
    },
    {
      "indent": 3,
      "text": "o PIM Mode",
      "zh-CHS": "o PIM模式"
    },
    {
      "indent": 6,
      "text": "PIM Mode is the mode of operation for which a particular multicast group is used. Wherever this term is used in this document, it refers to either Sparse Mode or Bidirectional (BIDIR) Mode.",
      "zh-CHS": "PIM模式是使用特定多播组的操作模式。本文件中使用该术语时，它指的是稀疏模式或双向（BIDIR）模式。"
    },
    {
      "indent": 3,
      "text": "o Dynamic Group-to-RP Mapping Mechanisms",
      "zh-CHS": "o 动态组到RP映射机制"
    },
    {
      "indent": 6,
      "text": "The term \"dynamic Group-to-RP mapping mechanisms\" in this document refers to Bootstrap Router (BSR) [RFC5059] and Auto-RP.",
      "zh-CHS": "本文档中的术语“动态组到RP映射机制”指引导路由器（BSR）[RFC5059]和自动RP。"
    },
    {
      "indent": 3,
      "text": "o Dynamic Mappings and Dynamically Learned Mappings",
      "zh-CHS": "o 动态映射和动态学习映射"
    },
    {
      "indent": 6,
      "text": "The terms \"dynamic mappings\" and \"dynamically learned mappings\" refer to Group-to-RP mappings that have been learned by either BSR or Auto-RP. Group-to-RP mappings that have been learned by Embedded-RP are referred to as Embedded Group-to-RP mappings.",
      "zh-CHS": "术语“动态映射”和“动态学习映射”指的是由BSR或Auto-RP学习的组到RP映射。由嵌入式RP学习的组到RP映射称为嵌入式组到RP映射。"
    },
    {
      "indent": 3,
      "text": "o Filtering",
      "zh-CHS": "o 过滤"
    },
    {
      "indent": 6,
      "text": "Filtering is the selective discarding of dynamic Group-to-RP mapping information, based on the group address, the type of Group-to-RP mapping message, and the interface on which the mapping message was received.",
      "zh-CHS": "过滤是根据组地址、组到RP映射消息的类型以及接收映射消息的接口，选择性地丢弃动态组到RP映射信息。"
    },
    {
      "indent": 3,
      "text": "o Multicast Domain and Boundaries",
      "zh-CHS": "o 多播域与边界"
    },
    {
      "indent": 6,
      "text": "The term \"multicast domain\" used in this document refers to a network topology that has a consistent set of Group-to-RP mappings. The interface between two or more multicast domains is a multicast domain boundary. The multicast boundaries are usually enforced by filtering the dynamic mapping messages and/or configuring different static RP mappings.",
      "zh-CHS": "本文档中使用的术语“多播域”是指具有一组一致的组到RP映射的网络拓扑。两个或多个多播域之间的接口是多播域边界。多播边界通常通过过滤动态映射消息和/或配置不同的静态RP映射来实现。"
    },
    {
      "indent": 0,
      "text": "3. Existing Algorithm",
      "section_title": true,
      "zh-CHS": "3. 现有算法"
    },
    {
      "indent": 3,
      "text": "The existing algorithm defined in PIM-SM (Section 4.7.1 of [RFC4601]) does not consider the following constraints:",
      "zh-CHS": "现有的算法在PIM-SM（第4.7.1席[RCF4601]）中没有考虑以下约束："
    },
    {
      "indent": 3,
      "text": "o It does not consider the origin of a Group-to-RP mapping and therefore will treat all of them equally.",
      "zh-CHS": "o 它不考虑群的起源到RP映射，因此将平等对待它们。"
    },
    {
      "indent": 3,
      "text": "o It does not provide the flexibility to give higher priority to a specific PIM mode. For example, an entry learned for the PIM-BIDIR Mode is treated with the same priority as an entry learned for PIM-SM.",
      "zh-CHS": "o 它不提供为特定PIM模式赋予更高优先级的灵活性。例如，为PIM-BIDIR模式读入的条目与为PIM-SM读入的条目具有相同的优先级。"
    },
    {
      "indent": 3,
      "text": "The algorithm defined in this document updates the algorithm defined in PIM-SM (Section 4.7.1 of [RFC4601]). The new algorithm is backward compatible and will produce the same result only if the Group-to-RP mappings are learned from a single mapping source. The full benefits of the new algorithm will not be realized until it is widely deployed.",
      "zh-CHS": "本文件中定义的算法更新了PIM-SM（RFC4601第4.7.1节）中定义的算法。新算法是向后兼容的，并且仅当从单个映射源学习组到RP的映射时，才会产生相同的结果。新算法的全部好处只有在广泛部署后才能实现。"
    },
    {
      "indent": 0,
      "text": "4. Assumptions",
      "section_title": true,
      "zh-CHS": "4. 假设"
    },
    {
      "indent": 3,
      "text": "We have made the following assumptions in defining this algorithm:",
      "zh-CHS": "在定义该算法时，我们做出了以下假设："
    },
    {
      "indent": 3,
      "text": "o A Group-to-RP mapping can be learned from various mechanisms. We assume that the following list is ordered by decreasing preference for these mechanisms:",
      "zh-CHS": "o 一组到RP的映射可以从各种机制中学习。我们假设以下列表是通过减少对这些机制的偏好来排序的："
    },
    {
      "indent": 6,
      "text": "* Embedded Group-to-RP mappings",
      "zh-CHS": "* 嵌入群到RP映射"
    },
    {
      "indent": 6,
      "text": "* Dynamically learned mappings",
      "zh-CHS": "* 动态学习映射"
    },
    {
      "indent": 6,
      "text": "* Static configuration",
      "zh-CHS": "* 静态配置"
    },
    {
      "indent": 6,
      "text": "* Other mapping method",
      "zh-CHS": "* 其他映射方法"
    },
    {
      "indent": 3,
      "text": "o Embedded Group-to-RP mappings are special and always have the highest priority. They cannot be overridden by static configuration or by dynamic Group-to-RP mappings.",
      "zh-CHS": "o 嵌入式组到RP映射是特殊的，并且始终具有最高优先级。它们不能被静态配置或动态组到RP映射覆盖。"
    },
    {
      "indent": 3,
      "text": "o Dynamic mappings will override a static RP configuration if they have overlapping ranges. However, it is possible to override dynamic Group-to-RP mappings with static configurations, either by filtering, or by configuring longer static group addresses that override dynamic mappings when longest prefix matching is applied.",
      "zh-CHS": "o 如果动态映射的范围重叠，则它们将覆盖静态RP配置。但是，可以使用静态配置来覆盖动态组到RP的映射，可以通过过滤，也可以通过配置更长的静态组地址来覆盖动态映射（当应用最长前缀匹配时）。"
    },
    {
      "indent": 3,
      "text": "o A Group-to-RP mapping learned for PIM-BIDIR Mode is preferred to an entry learned for PIM-SM Mode as stipulated in Section 3.3 of [RFC5059].",
      "zh-CHS": "o 根据[RFC5059]第3.3节的规定，为PIM-BIDIR模式学习的组到RP映射优先于为PIM-SM模式学习的条目。"
    },
    {
      "indent": 3,
      "text": "o Dynamic Group-to-RP mapping mechanisms are filtered at domain boundaries or for policy enforcement inside a domain.",
      "zh-CHS": "o 动态组到RP映射机制在域边界处进行过滤，或在域内执行策略。"
    },
    {
      "indent": 0,
      "text": "5. Common Use Cases",
      "section_title": true,
      "zh-CHS": "5. 常见用例"
    },
    {
      "indent": 3,
      "text": "A network operator deploying IP Multicast will require a deterministic way to select the precedence for Group-to-RP mappings in the following use cases:",
      "zh-CHS": "在以下用例中，部署IP多播的网络运营商将需要一种确定性方法来选择组到RP映射的优先级："
    },
    {
      "indent": 3,
      "text": "o Default static Group-to-RP mappings with dynamically learned entries",
      "zh-CHS": "o 具有动态学习条目的默认静态组到RP映射"
    },
    {
      "indent": 6,
      "text": "Many network operators will have a dedicated infrastructure for the standard multicast group range (224/4) and so might be using statically configured Group-to-RP mappings for this range. In this case, to support some specific applications, they might want to learn Group-to-RP mappings dynamically using either the BSR or Auto-RP mechanism. In this case, to select Group-to-RP mappings",
      "zh-CHS": "许多网络运营商将为标准多播组范围（224/4）提供专用基础设施，因此可能会为此范围使用静态配置的组到RP映射。在这种情况下，为了支持某些特定的应用程序，他们可能希望使用BSR或自动RP机制动态学习组到RP的映射。在本例中，选择“组到RP映射”"
    },
    {
      "indent": 6,
      "text": "for these specific applications, a longer prefix match should be given preference over statically configured Group-to-RP mappings. For example, 239.100.0.0/16, an administratively scoped multicast address range, could be learned for a corporate communications application. Network operators may change the Group-to-RP mappings for these applications more often, and the mappings would need to be learned dynamically. This is not an issue for IPv6 Multicast address ranges.",
      "zh-CHS": "对于这些特定的应用程序，应该优先考虑更长的前缀匹配，而不是静态配置的组到RP映射。例如，239.100.0.0/16，一个管理范围的多播地址范围，可以为公司通信应用程序学习。网络运营商可能会更频繁地为这些应用程序更改组到RP的映射，并且需要动态地学习映射。这不是IPv6多播地址范围的问题。"
    },
    {
      "indent": 3,
      "text": "o Migration situations",
      "zh-CHS": "o 移徙情况"
    },
    {
      "indent": 6,
      "text": "Network operators occasionally go through a migration due to an acquisition or a change in their network design. In order to facilitate this migration, there is a need to have a deterministic behavior of Group-to-RP mapping selection for entries learned using the BSR and Auto-RP mechanisms. This will help in avoiding any unforeseen interoperability issues between different vendors' network elements.",
      "zh-CHS": "网络运营商偶尔会因收购或网络设计变更而进行迁移。为了促进这种迁移，需要对使用BSR和自动RP机制学习的条目进行组到RP映射选择的确定性行为。这将有助于避免不同供应商的网络元素之间出现任何不可预见的互操作性问题。"
    },
    {
      "indent": 3,
      "text": "o Use by management systems",
      "zh-CHS": "o 管理系统的使用"
    },
    {
      "indent": 6,
      "text": "A network management station can determine the RP for a specific group in a specific router by running this algorithm on the Group-to-RP mapping table fetched using MIB objects.",
      "zh-CHS": "网络管理站可以通过在使用MIB对象获取的组到RP映射表上运行此算法来确定特定路由器中特定组的RP。"
    },
    {
      "indent": 0,
      "text": "6. Proposed Algorithm",
      "section_title": true,
      "zh-CHS": "6. 提出的算法"
    },
    {
      "indent": 3,
      "text": "The following algorithm deterministically chooses between several Group-to-RP mappings for a specific group. It also addresses the above-mentioned shortcomings in the existing mechanism.",
      "zh-CHS": "以下算法确定地在特定组的多个组到RP映射之间进行选择。它还解决了现有机制中的上述缺陷。"
    },
    {
      "indent": 3,
      "text": "1. If the multicast group address being looked up contains an embedded RP, the RP address extracted from the group address is selected as the Group-to-RP mapping.",
      "zh-CHS": "1. 如果正在查找的多播组地址包含嵌入式RP，则从组地址提取的RP地址将被选择为组到RP的映射。"
    },
    {
      "indent": 3,
      "text": "2. If the multicast group address being looked up is in the Source Specific Multicast (SSM) range or is configured for Dense Mode, no Group-to-RP mapping is selected, and this algorithm terminates. The fact that no Group-to-RP mapping has been selected can be represented in the PIM-STD-MIB module [RFC5060] by setting the address type of the RP to 'unknown', as described in Section 8.",
      "zh-CHS": "2. 如果正在查找的多播组地址位于源特定多播（SSM）范围内或配置为密集模式，则不选择组到RP的映射，并且此算法终止。如第8节所述，通过将RP的地址类型设置为“未知”，可以在PIM-STD-MIB模块[RFC5060]中表示未选择组到RP的映射。"
    },
    {
      "indent": 3,
      "text": "3. From the set of all Group-to-RP mapping entries, the subset whose group prefix contains the multicast group that is being looked up is selected.",
      "zh-CHS": "3. 从所有组到RP映射项的集合中，选择其组前缀包含正在查找的多播组的子集。"
    },
    {
      "indent": 3,
      "text": "4. If there are no entries available, then the Group-to-RP mapping is undefined, and this algorithm terminates.",
      "zh-CHS": "4. 如果没有可用的条目，则组到RP的映射未定义，此算法终止。"
    },
    {
      "indent": 3,
      "text": "5. A longest prefix match is performed on the subset of Group-to-RP mappings.",
      "zh-CHS": "5. 对组到RP映射的子集执行最长前缀匹配。"
    },
    {
      "indent": 8,
      "text": "* If there is only one entry available, then that entry is selected as the Group-to-RP mapping.",
      "zh-CHS": "* 如果只有一个条目可用，则选择该条目作为组到RP的映射。"
    },
    {
      "indent": 8,
      "text": "* If there are multiple entries available, the algorithm continues with this smaller set of Group-to-RP mappings.",
      "zh-CHS": "* 如果有多个条目可用，则该算法将继续使用这个较小的组到RP映射集。"
    },
    {
      "indent": 3,
      "text": "6. From the remaining set of Group-to-RP mappings, we select the subset of entries based on the preference for the PIM modes to which the multicast group addresses are assigned. A Group-to-RP mapping entry with PIM Mode 'BIDIR' will be preferred to an entry with PIM Mode 'PIM-SM'.",
      "zh-CHS": "6. 从剩余的组到RP映射集合中，我们根据多播组地址分配到的PIM模式的偏好选择条目子集。具有PIM模式“BIDIR”的组到RP映射条目将优先于具有PIM模式“PIM-SM”的条目。"
    },
    {
      "indent": 8,
      "text": "* If there is only one entry available, then that entry is selected as the Group-to-RP mapping.",
      "zh-CHS": "* 如果只有一个条目可用，则选择该条目作为组到RP的映射。"
    },
    {
      "indent": 8,
      "text": "* If there are multiple entries available, the algorithm continues with this smaller set of Group-to-RP mappings.",
      "zh-CHS": "* 如果有多个条目可用，则该算法将继续使用这个较小的组到RP映射集。"
    },
    {
      "indent": 3,
      "text": "7. From the remaining set of Group-to-RP mappings, we select the subset of the entries based on the origin. Group-to-RP mappings learned dynamically are preferred over static mappings. If the remaining dynamic Group-to-RP mappings are from BSR and Auto-RP, then the mappings from BSR are preferred.",
      "zh-CHS": "7. 从组到RP映射的剩余集合中，我们根据原点选择条目的子集。动态学习的组到RP映射优于静态映射。如果剩余的动态组到RP映射来自BSR和自动RP，则首选来自BSR的映射。"
    },
    {
      "indent": 8,
      "text": "* If there is only one entry available, then that entry is selected as the Group-to-RP mapping.",
      "zh-CHS": "* 如果只有一个条目可用，则选择该条目作为组到RP的映射。"
    },
    {
      "indent": 8,
      "text": "* If there are multiple entries available, the algorithm continues with this smaller set of Group-to-RP mappings.",
      "zh-CHS": "* 如果有多个条目可用，则该算法将继续使用这个较小的组到RP映射集。"
    },
    {
      "indent": 3,
      "text": "8. If the remaining Group-to-RP mappings were learned through BSR, then the RP will be selected by comparing the RP Priority values in the Candidate-RP-Advertisement messages. The RP mapping with the lowest value indicates the highest priority [RFC5059].",
      "zh-CHS": "8. 如果剩余的组到RP的映射是通过BSR学习的，那么将通过比较候选RP广告消息中的RP优先级值来选择RP。具有最低值的RP映射表示最高优先级[RFC5059]。"
    },
    {
      "indent": 8,
      "text": "* If more than one RP has the same highest priority (i.e., the same lowest value), the algorithm continues with those Group-to-RP mappings.",
      "zh-CHS": "* 如果多个RP具有相同的最高优先级（即相同的最低值），则该算法将继续使用这些组到RP的映射。"
    },
    {
      "indent": 8,
      "text": "* If the remaining Group-to-RP mappings were NOT learned from BSR, the algorithm continues with the next step.",
      "zh-CHS": "* 如果未从BSR学习剩余的组到RP映射，则该算法继续执行下一步。"
    },
    {
      "indent": 3,
      "text": "9. If the remaining Group-to-RP mappings were learned through BSR and the PIM Mode of the group is 'PIM-SM', then the hash function as defined in Section 4.7.2 of [RFC4601] will be used to choose the RP. The RP with the highest resulting hash value will be selected. Please see Section 10 for consideration of hash for BIDIR-PIM and BSR.",
      "zh-CHS": "9. 如果剩余的组到RP映射是通过BSR学习的，并且组的PIM模式为“PIM-SM”，则将使用[RFC4601]第4.7.2节中定义的哈希函数来选择RP。将选择结果哈希值最高的RP。关于BIDIR-PIM和BSR的哈希，请参见第10节。"
    },
    {
      "indent": 8,
      "text": "* If more than one RP has the same highest hash value, the algorithm continues with those Group-to-RP mappings.",
      "zh-CHS": "* 如果多个RP具有相同的最高哈希值，则该算法将继续使用这些组到RP的映射。"
    },
    {
      "indent": 8,
      "text": "* If the remaining Group-to-RP mappings were NOT learned from BSR, the algorithm continues with the next step.",
      "zh-CHS": "* 如果未从BSR学习剩余的组到RP映射，则该算法继续执行下一步。"
    },
    {
      "indent": 3,
      "text": "10. From the remaining set of Group-to-RP mappings, the RP with the highest IP address (numerically greater) will be selected. This will serve as a final tiebreaker.",
      "zh-CHS": "10. 从剩余的组到RP映射集合中，将选择IP地址最高（数值较大）的RP。这将成为最后的决胜局。"
    },
    {
      "indent": 0,
      "text": "7. Interpretation of MIB Objects",
      "section_title": true,
      "zh-CHS": "7. MIB对象的解释"
    },
    {
      "indent": 3,
      "text": "As described in [RFC5060], the Group-to-RP mapping information is summarized in the pimGroupMappingTable. The precedence value is stored in the 'pimGroupMappingPrecedence' object, which covers both the dynamically learned Group-to-RP mapping information and the static configuration. For static configurations, the 'pimGroupMappingPrecedence' object uses the value of the 'pimStaticRPPrecedence' object from the pimStaticRPTable.",
      "zh-CHS": "如[RFC5060]所述，pimGroupMappingTable中总结了组到RP的映射信息。优先级值存储在“PIMGroupMappingPreference”对象中，该对象涵盖动态学习的组到RP映射信息和静态配置。对于静态配置，“PIMGroupMappingPreference”对象使用pimStaticRPTable中“PIMStaticRPPreference”对象的值。"
    },
    {
      "indent": 3,
      "text": "The algorithm defined in this document does not use the concept of precedence, and therefore the values configured in the 'pimGroupMappingPrecedence' and 'pimStaticRPPrecedence' objects in the PIM-STD-MIB module [RFC5060] are not applicable to the new algorithm. The objects still retain their meaning for 'legacy' implementations, but since the algorithm defined in this document is to be used in preference to those found in PIM-SM [RFC4601] and the PIM-STD-MIB [RFC5060], the values of these objects will be ignored on implementations that support the new algorithm.",
      "zh-CHS": "本文件中定义的算法不使用优先级概念，因此PIM-STD-MIB模块[RFC5060]中“PIMGroupMappingPreference”和“PIMStaticRPPreference”对象中配置的值不适用于新算法。这些对象对于“遗留”实现仍然保留其意义，但由于本文档中定义的算法将优先于PIM-SM[RFC4601]和PIM-STD-MIB[RFC5060]中的算法，因此在支持新算法的实现中，这些对象的值将被忽略。"
    },
    {
      "indent": 0,
      "text": "8. Clarification for MIB Objects",
      "section_title": true,
      "zh-CHS": "8. MIB对象的澄清"
    },
    {
      "indent": 3,
      "text": "An implementation of this specification can continue to be managed using the PIM-STD-MIB [RFC5060]. Group-to-RP mapping entries are created in the pimGroupMappingTable for group ranges that are SSM or Dense mode. In these cases, the pimGroupMappingRPAddressType object is set to unknown(0), and the PIM Mode in the pimGroupMappingPimMode object is set to either ssm(2) or dm(5) to reflect the type of the group range.",
      "zh-CHS": "可继续使用PIM-STD-MIB[RFC5060]管理本规范的实施。在pimGroupMappingTable中为SSM或密集模式的组范围创建组到RP的映射条目。在这些情况下，pimGroupMappingRPAddressType对象设置为unknown（0），pimGroupMappingPimMode对象中的PIM模式设置为ssm（2）或dm（5），以反映组范围的类型。"
    },
    {
      "indent": 3,
      "text": "Also, all the entries that are already included in the SSM Range table in the IP Multicast MIB [RFC5132] are copied to the pimGroupMappingTable. Such entries have their type in the pimGroupMappingOrigin object set to configSsm(3) and the RP address type in the pimGroupMappingRPAddressType object set to unknown(0), as described above.",
      "zh-CHS": "此外，IP多播MIB[RFC5132]中SSM范围表中已包含的所有条目都复制到pimGroupMappingTable。如上所述，此类条目在pimGroupMappingOrigin对象中的类型设置为configSsm（3），在pimGroupMappingRPAddressType对象中的RP地址类型设置为unknown（0）。"
    },
    {
      "indent": 0,
      "text": "9. Use of Dynamic Group-to-RP Mapping Protocols",
      "section_title": true,
      "zh-CHS": "9. 使用动态组到RP映射协议"
    },
    {
      "indent": 3,
      "text": "It is not usually necessary to run several dynamic Group-to-RP mapping mechanisms in one administrative domain. Specifically, interoperation of BSR and Auto-RP is OPTIONAL.",
      "zh-CHS": "通常不需要在一个管理域中运行多个动态组到RP映射机制。具体而言，BSR和自动RP的互操作是可选的。"
    },
    {
      "indent": 3,
      "text": "However, if a router does receive two overlapping sets of Group-to-RP mappings, for example from Auto-RP and BSR, then some algorithm is needed to deterministically resolve the situation. The algorithm in this document MUST be used on all routers in the domain. This can be important at domain border routers, and is likely to avoid conflicts caused by misconfiguration (when routers receive overlapping sets of Group-to-RP mappings) and when configuration is changing.",
      "zh-CHS": "然而，如果路由器确实接收到两组重叠的组到RP映射集，例如来自Auto RP和BSR，则需要某种算法来确定解决这种情况。本文档中的算法必须用于域中的所有路由器。这在域边界路由器上非常重要，并且有可能避免由于错误配置（当路由器接收到重叠的组到RP映射集时）和配置发生更改而导致的冲突。"
    },
    {
      "indent": 3,
      "text": "An implementation of PIM that supports only one mechanism for learning Group-to-RP mappings MUST also use this algorithm. The algorithm has been chosen so that existing standard implementations are already compliant.",
      "zh-CHS": "仅支持一种学习组到RP映射机制的PIM实现也必须使用此算法。选择该算法是为了使现有的标准实现已经兼容。"
    },
    {
      "indent": 0,
      "text": "10. Considerations for Bidirectional-PIM and BSR Hash",
      "section_title": true,
      "zh-CHS": "10. 双向PIM和BSR哈希的注意事项"
    },
    {
      "indent": 3,
      "text": "BIDIR-PIM [RFC5015] is designed to avoid any data-driven events. This is especially true in the case of a source-only branch. The RP mapping is determined based on a group mask when the mapping is received through a dynamic mapping protocol or statically configured.",
      "zh-CHS": "BIDIR-PIM[RFC5015]旨在避免任何数据驱动事件。在仅源分支的情况下尤其如此。当通过动态映射协议接收映射或静态配置映射时，基于组掩码确定RP映射。"
    },
    {
      "indent": 3,
      "text": "Therefore, based on the algorithm defined in this document, the hash in BSR is ignored for PIM-BIDIR RP mappings. It is RECOMMENDED that network operators configure only one PIM-BIDIR RP for each RP Priority.",
      "zh-CHS": "因此，根据本文定义的算法，PIM-BIDIR RP映射忽略BSR中的哈希。建议网络运营商仅为每个RP优先级配置一个PIM-BIDIR RP。"
    },
    {
      "indent": 0,
      "text": "11. Filtering Group-to-RP Mappings at Domain Boundaries",
      "section_title": true,
      "zh-CHS": "11. 域边界处的过滤组到RP映射"
    },
    {
      "indent": 3,
      "text": "An implementation of PIM SHOULD support configuration to filter specific dynamic mechanisms for a valid group prefix range. For example, it should be possible to allow an administratively scoped address range, such as 239/8, for the Auto-RP protocol, but to filter out the BSR advertisement for the same range. Similarly, it should be possible to filter out all Group-to-RP mappings learned from BSR or the Auto-RP protocol.",
      "zh-CHS": "PIM的实现应支持配置，以过滤有效组前缀范围的特定动态机制。例如，对于自动RP协议，应该可以允许管理范围的地址范围，例如239/8，但是可以过滤掉相同范围的BSR公告。类似地，应该可以过滤掉从BSR或自动RP协议学到的所有组到RP的映射。"
    },
    {
      "indent": 0,
      "text": "12. Security Considerations",
      "section_title": true,
      "zh-CHS": "12. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document enhances an existing algorithm to deterministically choose between several Group-to-RP mappings for a specific group. Different routers may select a different Group-to-RP mapping for the same group if the Group-to-RP mappings learned in these routers are not consistent. For example, let us assume that BSR is not enabled in one of the routers, and so it does not learn any Group-to-RP mappings from BSR. Now the Group-to-RP mappings learned in this router may not be consistent with other routers in the network; it may select a different RP or may not select any RP for a given group. Such situations can be avoided if the mechanisms used to learn Group-to-RP mappings are secure and consistent across the network. Secure transport of the mapping protocols can be accomplished by using authentication with IPsec, as described in Section 6.3 of [RFC4601].",
      "zh-CHS": "本文档增强了一个现有算法，用于在特定组的多个组到RP映射之间进行确定性选择。如果在这些路由器中学习到的组到RP映射不一致，则不同的路由器可以为同一组选择不同的组到RP映射。例如，我们假设其中一个路由器中没有启用BSR，因此它不会从BSR学习任何组到RP的映射。现在，在该路由器中学习到的组到RP映射可能与网络中的其他路由器不一致；它可以为给定组选择不同的RP，也可以不选择任何RP。如果用于学习组到RP映射的机制在整个网络中是安全和一致的，则可以避免这种情况。如[RFC4601]第6.3节所述，映射协议的安全传输可以通过使用IPsec认证来实现。"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgements",
      "section_title": true,
      "zh-CHS": "13. 致谢"
    },
    {
      "indent": 3,
      "text": "This document is created based on discussion that occurred during work on the PIM-STD-MIB [RFC5060]. Many thanks to Stig Venaas, Yiqun Cai, and Toerless Eckert for providing useful comments.",
      "zh-CHS": "本文件是根据PIM-STD-MIB[RFC5060]工作期间发生的讨论创建的。非常感谢Stig Venaas、Yiqun Cai和Toerless Eckert提供了有用的评论。"
    },
    {
      "indent": 0,
      "text": "14. Normative References",
      "section_title": true,
      "zh-CHS": "14. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3956] Savola, P. and B. Haberman, \"Embedding the Rendezvous Point (RP) Address in an IPv6 Multicast Address\", RFC 3956, November 2004.",
      "zh-CHS": "[RFC3956]Savola，P.和B.Haberman，“将集合点（RP）地址嵌入IPv6多播地址”，RFC 3956，2004年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4601] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "zh-CHS": "[RFC4601]Fenner，B.，Handley，M.，Holbrook，H.，和I.Kouvelas，“协议独立多播-稀疏模式（PIM-SM）：协议规范（修订版）”，RFC 46012006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5015] Handley, M., Kouvelas, I., Speakman, T., and L. Vicisano, \"Bidirectional Protocol Independent Multicast (BIDIR-PIM)\", RFC 5015, October 2007.",
      "zh-CHS": "[RFC5015]Handley，M.，Kouvelas，I.，Speakman，T.，和L.Vicisano，“双向协议独立多播（BIDIR-PIM）”，RFC 50152007年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5059] Bhaskar, N., Gall, A., Lingard, J., and S. Venaas, \"Bootstrap Router (BSR) Mechanism for Protocol Independent Multicast (PIM)\", RFC 5059, January 2008.",
      "zh-CHS": "[RFC5059]Bhaskar，N.，Gall，A.，Lingard，J.，和S.Venaas，“用于协议独立多播（PIM）的引导路由器（BSR）机制”，RFC 5059，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5060] Sivaramu, R., Lingard, J., McWalter, D., Joshi, B., and A. Kessler, \"Protocol Independent Multicast MIB\", RFC 5060, January 2008.",
      "zh-CHS": "[RFC5060]Sivaramu，R.，Lingard，J.，McWalter，D.，Joshi，B.，和A.Kessler，“协议独立多播MIB”，RFC 50602008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5132] McWalter, D., Thaler, D., and A. Kessler, \"IP Multicast MIB\", RFC 5132, December 2007.",
      "zh-CHS": "[RFC5132]McWalter，D.，Thaler，D.，和A.Kessler，“IP多播MIB”，RFC 51322007年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Bharat Joshi Infosys Technologies Ltd. 44 Electronics City, Hosur Road Bangalore 560 100 India",
      "zh-CHS": "印度班加罗尔霍苏尔路44号电子城Bharat Joshi Infosys Technologies Ltd.560 100"
    },
    {
      "indent": 3,
      "text": "EMail: bharat_joshi@infosys.com\nURI:   http://www.infosys.com/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Andy Kessler Cisco Systems, Inc. 425 E. Tasman Drive San Jose, CA 95134 USA",
      "zh-CHS": "安迪·凯斯勒思科系统公司，美国加利福尼亚州圣何塞塔斯曼大道东425号，邮编95134"
    },
    {
      "indent": 3,
      "text": "EMail: kessler@cisco.com\nURI:   http://www.cisco.com/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "David McWalter",
      "zh-CHS": "大卫·麦克沃尔特"
    },
    {
      "indent": 3,
      "text": "EMail: david@mcwalter.eu",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}