{
  "title": {
    "text": "RFC 6360: Conclusion of FYI RFC Sub-Series",
    "zh-CHS": "RFC 6360"
  },
  "number": 6360,
  "created_at": "2021-11-06 04:32:48.685152+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        R. Housley\nRequest for Comments: 6360                                Vigil Security\nObsoletes: 1150                                              August 2011\nCategory: Informational\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Conclusion of FYI RFC Sub-Series",
      "zh-CHS": "FYI RFC子系列的结论"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document concludes the For Your Information (FYI) sub-series of RFCs, established by RFC 1150 for use by the IETF User Services Area, which no longer exists. The IESG does not intend to make any further additions to this RFC sub-series, and this document provides a record of this decision. This document also obsoletes RFC 1150 and changes the status of RFC 1150 to Historic.",
      "zh-CHS": "本文件总结了RFC 1150建立的供IETF用户服务区使用的RFC供您参考（FYI）子系列，该子系列已不存在。IESG不打算对RFC子系列进行任何进一步的补充，本文件提供了该决定的记录。本文件还废除了RFC 1150，并将RFC 1150的状态更改为历史状态。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6360.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6360."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "1. Background",
      "section_title": true,
      "zh-CHS": "1. 出身背景"
    },
    {
      "indent": 3,
      "text": "The For Your Information (FYI) sub-series of RFCs was established by RFC 1150 [RFC1150] in 1990 for use by the IETF User Services Area, which has not met since IETF 53 held in March 2001. This RFC sub-series was designed to provide Internet users with a repository of information regarding the Internet that might be interesting to a wide range of people.",
      "zh-CHS": "RFC的供您参考（FYI）子系列由RFC 1150[RFC1150]于1990年建立，供IETF用户服务区使用，自2001年3月举行IETF 53以来，该子系列从未见过。本RFC子系列旨在为互联网用户提供一个关于互联网的信息库，这些信息可能会引起广泛的兴趣。"
    },
    {
      "indent": 3,
      "text": "The publication of RFC 1150 [RFC1150] introduced the FYI sub-series of RFCs. Since that time, a total of 38 FYI numbers have been assigned. Many other Informational RFCs have been published that are not part of the FYI sub-series.",
      "zh-CHS": "RFC 1150[RFC1150]的出版引入了FYI RFC子系列。自那时以来，总共分配了38个FYI编号。发布了许多其他信息性RFC，这些RFC不属于FYI子系列。"
    },
    {
      "indent": 3,
      "text": "The list of documents in the FYI sub-series can be found on the RFC Editor web site [INDEX].",
      "zh-CHS": "可在RFC编辑器网站[索引]上找到FYI子系列中的文档列表。"
    },
    {
      "indent": 0,
      "text": "2. Conclusion of the FYI Sub-Series",
      "section_title": true,
      "zh-CHS": "2. FYI子系列的结论"
    },
    {
      "indent": 3,
      "text": "The IESG does not intend to make any further additions to the FYI sub-series. The IESG intends to continue to produce Informational RFCs, but none of them will be assigned an FYI number.",
      "zh-CHS": "IESG不打算对FYI子系列进行任何进一步补充。IESG打算继续生产信息RFC，但不会为其中任何一个分配FYI编号。"
    },
    {
      "indent": 3,
      "text": "All published RFCs that are currently part of the FYI sub-series will retain their FYI numbers. The FYI numbers continue to provide reference points for these documents, and the FYI number can be used in citations to these documents.",
      "zh-CHS": "目前属于FYI子系列的所有已发布RFC将保留其FYI编号。FYI编号继续为这些文件提供参考点，FYI编号可用于这些文件的引用。"
    },
    {
      "indent": 3,
      "text": "If a future RFC is published that obsoletes an existing member of the FYI sub-series, the new RFC will not be assigned an FYI number.",
      "zh-CHS": "如果发布的未来RFC淘汰了FYI子系列的现有成员，则不会为新RFC分配FYI编号。"
    },
    {
      "indent": 0,
      "text": "3. RFC 1150 Moved to Historic",
      "section_title": true,
      "zh-CHS": "3. RFC 1150移动到历史位置"
    },
    {
      "indent": 3,
      "text": "This document moves RFC 1150 [RFC1150] to Historic. The procedural information in RFC 1150 is no longer valid. If it becomes desirable to make additions to the FYI sub-series in the future, new procedures can be developed to replace this document.",
      "zh-CHS": "本文档将RFC 1150[RFC1150]移动到历史位置。RFC 1150中的程序信息不再有效。如果将来需要对FYI子系列进行补充，可以制定新的程序来取代本文件。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "No Internet security issues are anticipated by the actions described in this document.",
      "zh-CHS": "本文件中所述的措施预计不会出现任何互联网安全问题。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "zh-CHS": "5. 工具书类"
    },
    {
      "indent": 0,
      "text": "5.1. Normative Reference",
      "section_title": true,
      "zh-CHS": "5.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC1150] Malkin, G. and J. Reynolds, \"FYI on FYI: Introduction to the FYI Notes\", FYI 1, RFC 1150, March 1990.",
      "zh-CHS": "[RFC1150]Malkin，G.和J.Reynolds，“关于FYI的FYI：FYI注释简介”，FYI 1，RFC 1150，1990年3月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative Reference",
      "section_title": true,
      "zh-CHS": "5.2. 资料性参考"
    },
    {
      "indent": 3,
      "text": "[INDEX]   \"FYI Index\", http://www.rfc-editor.org/fyi-index.html",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Russell Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, VA 20170 USA EMail: housley@vigilsec.com",
      "zh-CHS": "Russell Housley Vigil Security，LLC 918 Spring Knoll Drive Herndon，弗吉尼亚州20170美国电子邮件：housley@vigilsec.com"
    }
  ]
}