{
  "title": {
    "text": "RFC 6718: Pseudowire Redundancy",
    "zh-CHS": "RFC 6718"
  },
  "number": 6718,
  "created_at": "2021-11-04 03:21:08.612245+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          P. Muley\nRequest for Comments: 6718                                   M. Aissaoui\nCategory: Informational                                         M. Bocci\nISSN: 2070-1721                                           Alcatel-Lucent\n                                                             August 2012",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Pseudowire Redundancy",
      "zh-CHS": "伪线冗余"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a framework comprised of a number of scenarios and associated requirements for pseudowire (PW) redundancy. A set of redundant PWs is configured between provider edge (PE) nodes in single-segment PW applications or between terminating PE (T-PE) nodes in multi-segment PW applications. In order for the PE/T-PE nodes to indicate the preferred PW to use for forwarding PW packets to one another, a new PW status is required to indicate the preferential forwarding status of active or standby for each PW in the redundant set.",
      "zh-CHS": "本文档描述了一个框架，该框架由许多场景和伪线（PW）冗余相关需求组成。在单段PW应用程序中的提供者边缘（PE）节点之间或在多段PW应用程序中的终端PE（T-PE）节点之间配置一组冗余PW。为了使PE/T-PE节点指示用于彼此转发PW分组的优选PW，需要新的PW状态来指示冗余集中每个PW的活动或备用的优选转发状态。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6718.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6718."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2012 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................4\n   2.1. Requirements Language ......................................6\n3. Reference Models ................................................6\n   3.1. PE Architecture ............................................6\n   3.2. PW Redundancy Network Reference Scenarios ..................7\n        3.2.1. PW Redundancy for AC and PE Protection: One\n               Dual-Homed CE with Redundant SS-PWs .................7\n        3.2.2. PW Redundancy for AC and PE Protection: Two\n               Dual-Homed CEs with Redundant SS-PWs ................8\n        3.2.3. PW Redundancy for S-PE Protection:\n               Single-Homed CEs with Redundant MS-PWs .............10\n        3.2.4. PW Redundancy for PE-rs Protection in\n               H-VPLS Using SS-PWs ................................11\n        3.2.5. PW Redundancy for PE Protection in a VPLS\n               Ring Using SS-PWs ..................................13\n        3.2.6. PW Redundancy for VPLS n-PE Protection\n               Using SS-PWs .......................................14\n4. Generic PW Redundancy Requirements .............................15\n   4.1. Protection Switching Requirements .........................15\n   4.2. Operational Requirements ..................................15\n5. Security Considerations ........................................16\n6. Contributors ...................................................16\n7. Acknowledgements ...............................................17\n8. References .....................................................17\n   8.1. Normative References ......................................17\n   8.2. Informative Reference .....................................18",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The objective of pseudowire (PW) redundancy is to maintain connectivity across the packet switched network (PSN) used by the emulated service if a component in the path of the emulated service fails or a backup component is activated. For example, PW redundancy will enable the correct PW to be used for forwarding emulated service packets when the connectivity of an attachment circuit (AC) changes due to the failure of an AC or when a pseudowire (PW) or packet switched network (PSN) tunnel fails due to the failure of a provider edge (PE) node.",
      "zh-CHS": "伪线（PW）冗余的目标是在模拟服务路径中的组件发生故障或备份组件被激活时，保持模拟服务所使用的分组交换网络（PSN）之间的连接。例如，当连接电路（AC）的连接因AC的故障而改变时，或者当伪线（PW）或分组交换网络（PSN）隧道因提供商边缘（PE）节点的故障而失败时，PW冗余将使正确的PW能够用于转发模拟服务分组。"
    },
    {
      "indent": 3,
      "text": "PW redundancy uses redundant ACs, PEs, and PWs to eliminate single points of failure in the path of an emulated service. This is achieved while ensuring that only one path between a pair of customer edge (CE) nodes is active at any given time. Mechanisms that rely on more than one active path between the CEs, e.g., 1+1 protection switching, are out of the scope of this document because they may require a permanent bridge to provide traffic replication as well as support for a 1+1 protection switching protocol in the CEs.",
      "zh-CHS": "PW冗余使用冗余ACs、PEs和PWs消除模拟服务路径中的单点故障。这是在确保在任何给定时间一对客户边缘（CE）节点之间只有一条路径处于活动状态的情况下实现的。依赖于CEs之间一条以上活动路径的机制（例如1+1保护交换）不在本文件的范围内，因为它们可能需要一个永久网桥来提供通信量复制以及支持CEs中的1+1保护交换协议。"
    },
    {
      "indent": 3,
      "text": "Protection for a PW segment can be provided by the PSN layer. This may be a Resource Reservation Protocol with Traffic Engineering (RSVP-TE) label switched path (LSP) with a fast-reroute (FRR) backup or an end-to-end backup LSP. These mechanisms can restore PSN connectivity rapidly enough to avoid triggering protection by PW redundancy. PSN protection mechanisms cannot protect against the failure of a PE node or the failure of the remote AC. Typically, this is supported by dual-homing a CE node to different PE nodes that provide a pseudowire emulated service across the PSN. A set of PW mechanisms that enables a primary and one or more backup PWs to terminate on different PE nodes is therefore required. An important requirement is that changes occurring on the dual-homed side of the network due to the failure of an AC or PE are not propagated to the ACs on the other side of the network. Furthermore, failures in the PSN are not propagated to the attached CEs.",
      "zh-CHS": "PW段的保护可由PSN层提供。这可能是一种具有流量工程（RSVP-TE）标签交换路径（LSP）的资源预留协议，具有快速重路由（FRR）备份或端到端备份LSP。这些机制可以快速恢复PSN连接，避免PW冗余触发保护。PSN保护机制无法针对PE节点故障或远程AC故障进行保护。通常，通过将CE节点双重归巢到不同的PE节点来支持这一点，这些PE节点跨PSN提供伪线模拟服务。因此，需要一组PW机制，使主PW和一个或多个备份PW能够在不同的PE节点上终止。一个重要的要求是，由于AC或PE故障而在网络的双宿端发生的更改不会传播到网络另一端的ACs。此外，PSN中的故障不会传播到连接的CE。"
    },
    {
      "indent": 3,
      "text": "In cases where PSN protection mechanisms are not able to recover from a PSN failure or where a failure of a switching PE (S-PE) may occur, a set of mechanisms that supports the operation of a primary and one or more backup PWs via a different set of S-PEs or diverse PSN tunnels is therefore required. For multi-segment PWs (MS-PWs), the paths of these PWs are diverse in that they are switched at different S-PE nodes.",
      "zh-CHS": "如果PSN保护机制无法从PSN故障中恢复，或者可能发生交换PE（S-PE）故障，则需要一组机制，通过不同的S-PE或不同的PSN隧道支持主PW和一个或多个备用PW的操作。对于多段PW（MS PW），这些PW的路径不同，因为它们在不同的S-PE节点上切换。"
    },
    {
      "indent": 3,
      "text": "In both of these cases, PW redundancy is important to maximize the resiliency of the emulated service. It supplements PSN protection techniques and can operate in addition to or instead of those techniques when they are not available.",
      "zh-CHS": "在这两种情况下，PW冗余对于最大化模拟服务的弹性非常重要。它补充了PSN保护技术，并可在这些技术不可用时作为这些技术的补充或替代。"
    },
    {
      "indent": 3,
      "text": "This document describes a framework for these applications and associated operational requirements. The framework utilizes a new PW status, called the 'Preferential Forwarding Status' of the PW. This is separate from the operational states defined in RFC 5601 [RFC5601]. The mechanisms for PW redundancy are modeled on general protection switching principles.",
      "zh-CHS": "本文档描述了这些应用程序的框架和相关的操作需求。该框架利用了一种新的PW状态，称为PW的“优先转发状态”。这与RFC 5601[RFC5601]中定义的操作状态不同。PW冗余机制根据一般保护切换原则建模。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "o Up PW: A PW that has been configured (label mapping exchanged between PEs) and is not in any of the PW or AC defect states represented by the status codes specified in [RFC4446]. Such a PW is available for forwarding traffic.",
      "zh-CHS": "o Up PW：已配置的PW（PEs之间交换的标签映射），不处于[RFC4446]中规定的状态代码表示的任何PW或AC缺陷状态。这样的PW可用于转发流量。"
    },
    {
      "indent": 3,
      "text": "o Down PW: A PW that either has not been fully configured or has been configured and is in any one of the PW or AC defect states specified in [RFC4446]. Such a PW is not available for forwarding traffic.",
      "zh-CHS": "o 向下PW：未完全配置或已配置且处于[RFC4446]中规定的任何一种PW或AC缺陷状态的PW。这样的PW不可用于转发流量。"
    },
    {
      "indent": 3,
      "text": "o Active PW: An up PW used for forwarding Operations, Administration, and Maintenance (OAM) as well as user-plane and control-plane traffic.",
      "zh-CHS": "o 主动PW：用于转发操作、管理和维护（OAM）以及用户平面和控制平面流量的up PW。"
    },
    {
      "indent": 3,
      "text": "o Standby PW: An up PW that is not used for forwarding user traffic but may forward OAM and specific control-plane traffic.",
      "zh-CHS": "o 备用PW：一种up PW，不用于转发用户流量，但可以转发OAM和特定控制平面流量。"
    },
    {
      "indent": 3,
      "text": "o PW Endpoint: A PE where a PW terminates on a point where native service processing is performed, e.g., a single-segment PW (SS-PW) PE, a multi-segment pseudowire (MS-PW) terminating PE (T-PE), or a hierarchical Virtual Private LAN Service (VPLS) MTU-s or PE-rs.",
      "zh-CHS": "o PW端点：PW在执行本机服务处理的点上终止的PE，例如单段PW（SS-PW）PE、多段伪线（MS-PW）终止PE（T-PE）或分层虚拟专用LAN服务（VPLS）MTU-s或PE-rs。"
    },
    {
      "indent": 3,
      "text": "o Primary PW: The PW that a PW endpoint activates (i.e., uses for forwarding) in preference to any other PW when more than one PW qualifies for the active state. When the primary PW comes back up after a failure and qualifies for the active state, the PW endpoint always reverts to it. The designation of primary is performed by local configuration for the PW at the PE and is only required when revertive behavior is used and is not applicable when non-revertive protection switching is used.",
      "zh-CHS": "o 主PW：当超过一个PW符合激活状态时，PW端点优先于任何其他PW激活（即用于转发）的PW。当主PW在故障后恢复并符合激活状态时，PW端点始终恢复为激活状态。主电源的指定由PE处PW的本地配置执行，仅在使用回复行为时需要，在使用非回复保护开关时不适用。"
    },
    {
      "indent": 3,
      "text": "o Secondary PW: When it qualifies for the active state, a secondary PW is only selected if no primary PW is configured or if the configured primary PW does not qualify for active state (e.g., is down). By default, a PW in a redundancy PW set is considered secondary. There is no revertive mechanism among secondary PWs.",
      "zh-CHS": "o 辅助PW：当辅助PW符合激活状态时，仅当未配置主PW或配置的主PW不符合激活状态（例如，关闭）时，才会选择辅助PW。默认情况下，冗余PW集中的PW被视为次要PW。次级PWs之间没有回复机制。"
    },
    {
      "indent": 3,
      "text": "o Revertive protection switching: Traffic will be carried by the primary PW if all of the following is true: it is up, a wait-to-restore timer expires, and the primary PW is made the active PW.",
      "zh-CHS": "o 恢复保护切换：如果以下所有条件均为真，则主PW将承载流量：启动，等待恢复计时器过期，主PW变为激活PW。"
    },
    {
      "indent": 3,
      "text": "o Non-revertive protection switching: Traffic will be carried by the last PW selected as a result of a previous active PW entering the operationally down state.",
      "zh-CHS": "o 非恢复性保护切换：由于先前激活的PW进入操作关闭状态，最后选择的PW将承载流量。"
    },
    {
      "indent": 3,
      "text": "o Manual selection of a PW: The ability to manually select the primary/secondary PWs.",
      "zh-CHS": "o 手动选择PW：手动选择主/辅助PW的能力。"
    },
    {
      "indent": 3,
      "text": "o MTU-s: A hierarchical virtual private LAN service multi-tenant unit switch, as defined in RFC 4762 [RFC4762].",
      "zh-CHS": "o MTU-s：分层虚拟专用LAN服务多租户单元交换机，如RFC 4762[RFC4762]中所定义。"
    },
    {
      "indent": 3,
      "text": "o PE-rs: A hierarchical virtual private LAN service switch, as defined in RFC 4762.",
      "zh-CHS": "o PE rs：分层虚拟专用LAN服务交换机，如RFC 4762中所定义。"
    },
    {
      "indent": 3,
      "text": "o n-PE: A network-facing provider edge node, as defined in RFC 4026 [RFC4026].",
      "zh-CHS": "o n-PE：面向网络的提供商边缘节点，如RFC 4026[RFC4026]中所定义。"
    },
    {
      "indent": 3,
      "text": "o 1:1 protection: One specific subset of a path for an emulated service, consisting of a standby PW and/or AC, protects another specific subset of a path for the emulated service. User traffic is transmitted over only one specific subset of the path at a time.",
      "zh-CHS": "o 1:1保护：模拟服务路径的一个特定子集（由备用PW和/或AC组成）保护模拟服务路径的另一个特定子集。用户流量一次仅通过路径的一个特定子集传输。"
    },
    {
      "indent": 3,
      "text": "o N:1 protection: N specific subsets of paths for an emulated service, consisting of standby PWs and/or ACs, protect another specific subset of the path for the emulated service. User traffic is transmitted over only one specific subset of the path at a time.",
      "zh-CHS": "o N:1保护：由备用PW和/或ACs组成的模拟服务的N个特定路径子集，保护模拟服务的另一个特定路径子集。用户流量一次仅通过路径的一个特定子集传输。"
    },
    {
      "indent": 3,
      "text": "o 1+1 protection: One specific subset of a path for an emulated service, consisting of a standby PW and/or AC, protects another specific subset of a path for the emulated service. Traffic is permanently duplicated at the ingress node on both the currently active and standby subsets of the paths.",
      "zh-CHS": "o 1+1保护：模拟服务路径的一个特定子集（由备用PW和/或AC组成）保护模拟服务路径的另一个特定子集。流量在入口节点的当前活动和备用路径子集上永久复制。"
    },
    {
      "indent": 3,
      "text": "This document uses the term 'PE' to be synonymous with both PEs as per RFC 3985 [RFC3985] and T-PEs as per RFC 5659 [RFC5659].",
      "zh-CHS": "本文件使用术语“PE”作为RFC 3985[RFC3985]规定的PEs和RFC 5659[RFC5659]规定的T-PEs的同义词。"
    },
    {
      "indent": 3,
      "text": "This document uses the term 'PW' to be synonymous with both PWs as per RFC 3985 and SS-PWs, MS-PWs, and PW segments as per RFC 5659.",
      "zh-CHS": "本文件使用术语“PW”作为RFC 3985规定的PW和RFC 5659规定的SS PWs、MS PWs和PW段的同义词。"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "2.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Reference Models",
      "section_title": true,
      "zh-CHS": "3. 参考模型"
    },
    {
      "indent": 3,
      "text": "The following sections show the reference architecture of the PE for PW redundancy and the usage of the architecture in different topologies and applications.",
      "zh-CHS": "以下各节显示了用于PW冗余的PE参考体系结构以及该体系结构在不同拓扑和应用中的使用。"
    },
    {
      "indent": 0,
      "text": "3.1. PE Architecture",
      "section_title": true,
      "zh-CHS": "3.1. 体育建筑"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the PE architecture for PW redundancy when more than one PW in a redundant set is associated with a single AC. This is based on the architecture in Figure 4b of RFC 3985 [RFC3985]. The forwarder selects which of the redundant PWs to use based on the criteria described in this document.",
      "zh-CHS": "图1显示了当冗余集中的多个PW与单个AC关联时，PW冗余的PE架构。该架构基于RFC 3985[RFC3985]图4b中的架构。转运商根据本文件中所述的标准选择要使用的冗余PW。"
    },
    {
      "indent": 5,
      "text": "         +----------------------------------------+\n         |                PE Device               |\n         +----------------------------------------+\nSingle   |                 |        Single        | PW Instance\n AC      |                 +      PW Instance     X<===========>\n         |                 |                      |\n         |                 |----------------------|\n <------>o                 |        Single        | PW Instance\n         |    Forwarder    +      PW Instance     X<===========>\n         |                 |                      |\n         |                 |----------------------|\n         |                 |        Single        | PW Instance\n         |                 +      PW Instance     X<===========>\n         |                 |                      |\n         +----------------------------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Figure 1: PE Architecture for PW Redundancy",
      "zh-CHS": "图1:PW冗余的PE架构"
    },
    {
      "indent": 0,
      "text": "3.2. PW Redundancy Network Reference Scenarios",
      "section_title": true,
      "zh-CHS": "3.2. PW冗余网络参考方案"
    },
    {
      "indent": 3,
      "text": "This section presents a set of reference scenarios for PW redundancy. These reference scenarios represent example network topologies that illustrate the use of PW redundancy. They can be combined together to create more complex or comprehensive topologies, as required by a particular application or deployment.",
      "zh-CHS": "本节介绍了一组PW冗余的参考方案。这些参考场景代表了举例说明PW冗余使用的网络拓扑。根据特定应用程序或部署的需要，可以将它们组合在一起以创建更复杂或更全面的拓扑。"
    },
    {
      "indent": 0,
      "text": "3.2.1. PW Redundancy for AC and PE Protection: One Dual-Homed CE with Redundant SS-PWs",
      "zh-CHS": "3.2.1. 交流和PE保护的PW冗余：一个带冗余SS PW的双宿CE"
    },
    {
      "indent": 3,
      "text": "Figure 2 illustrates an application of single-segment pseudowire redundancy where one of the CEs is dual-homed. This scenario is designed to protect the emulated service against a failure of one of the PEs or ACs attached to the multi-homed CE. Protection against failures of the PSN tunnels is provided using PSN mechanisms such as MPLS fast reroute, so that these failures do not impact the PW.",
      "zh-CHS": "图2说明了单段伪线冗余的应用，其中一个CE为双宿。此场景旨在防止连接到多宿CE的其中一个PEs或ACs出现故障，从而保护模拟服务。使用PSN机制（如MPLS快速重路由）提供针对PSN隧道故障的保护，以便这些故障不会影响PW。"
    },
    {
      "indent": 3,
      "text": "CE1 is dual-homed to PE1 and PE3. A dual-homing control protocol, the details of which are outside the scope of this document, enables the PEs and CEs to determine which PE (PE1 or PE3) should forward towards CE1 and therefore which AC CE1 should use to forward towards the PSN.",
      "zh-CHS": "CE1是PE1和PE3的双重宿主。双归位控制协议（其细节不在本文件范围内）使PEs和CEs能够确定哪个PE（PE1或PE3）应转发至CE1，因此哪个AC CE1应用于转发至PSN。"
    },
    {
      "indent": 6,
      "text": "      |<-------------- Emulated Service ---------------->|\n      |                                                  |\n      |          |<------- Pseudo Wire ------>|          |\n      |          |                            |          |\n      |          |    |<-- PSN Tunnels-->|    |          |\n      |          V    V                  V    V          |\n      V    AC    +----+                  +----+     AC   V\n+-----+    |     | PE1|==================|    |     |    +-----+\n|     |----------|....|...PW1.(active)...|....|----------|     |\n|     |          |    |==================|    |          | CE2 |\n| CE1 |          +----+                  |PE2 |          |     |\n|     |          +----+                  |    |          +-----+\n|     |          |    |==================|    |\n|     |----------|....|...PW2.(standby)..|    |\n+-----+    |     | PE3|==================|    |\n           AC    +----+                  +----+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Figure 2: One Dual-Homed CE and Redundant SS-PWs",
      "zh-CHS": "图2：一个双宿CE和冗余SS PWs"
    },
    {
      "indent": 3,
      "text": "In this scenario, only one of the PWs should be used for forwarding between PE1/PE3 and PE2. PW redundancy determines which PW to make active based on the forwarding state of the ACs so that only one path is available from CE1 to CE2. This requires an additional PW state",
      "zh-CHS": "在这种情况下，只有一个PW应用于PE1/PE3和PE2之间的转发。PW冗余根据ACs的转发状态确定要激活的PW，以便从CE1到CE2只有一条路径可用。这需要一个额外的PW状态"
    },
    {
      "indent": 3,
      "text": "that reflects this forwarding state, which is separate from the operational status of the PW. This is the 'Preferential Forwarding Status'.",
      "zh-CHS": "这反映了该转发状态，该状态与PW的运行状态分开。这是“优先转发状态”。"
    },
    {
      "indent": 3,
      "text": "Consider the example where the AC from CE1 to PE1 is initially active and the AC from CE1 to PE3 is initially standby. PW1 is made active and PW2 is made standby in order to complete the path to CE2.",
      "zh-CHS": "考虑一个例子，其中从CE1到PE1的AC最初是活动的，而从CE1到PE3的AC最初是备用的。PW1处于激活状态，PW2处于备用状态，以便完成到CE2的路径。"
    },
    {
      "indent": 3,
      "text": "On failure of the AC between CE1 and PE1, the forwarding state of the AC on PE3 transitions to active. The preferential forwarding state of PW2 therefore needs to become active, and PW1 standby, in order to re-establish connectivity between CE1 and CE2. PE3 therefore uses PW2 to forward towards CE2, and PE2 uses PW2 instead of PW1 to forward towards CE1. PW redundancy in this scenario requires that the forwarding status of the ACs at PE1 and PE3 be signaled to PE2 so that PE2 can choose which PW to make active.",
      "zh-CHS": "当CE1和PE1之间的AC发生故障时，PE3上AC的转发状态转换为激活状态。因此，PW2的优先转发状态需要变为活动状态，而PW1处于备用状态，以便在CE1和CE2之间重新建立连接。因此，PE3使用PW2向CE2前进，PE2使用PW2而不是PW1向CE1前进。此场景中的PW冗余要求将PE1和PE3处的ACs的转发状态用信号通知PE2，以便PE2可以选择激活哪个PW。"
    },
    {
      "indent": 3,
      "text": "Changes occurring on the dual-homed side of the network due to a failure of the AC or PE are not propagated to the ACs on the other side of the network. Furthermore, failures in the PSN are not propagated to the attached CEs.",
      "zh-CHS": "由于AC或PE故障而在网络双宿端发生的更改不会传播到网络另一端的ACs。此外，PSN中的故障不会传播到连接的CE。"
    },
    {
      "indent": 0,
      "text": "3.2.2. PW Redundancy for AC and PE Protection: Two Dual-Homed CEs with Redundant SS-PWs",
      "zh-CHS": "3.2.2. 交流和PE保护的PW冗余：两个带冗余SS PW的双宿CE"
    },
    {
      "indent": 3,
      "text": "Figure 3 illustrates an application of single-segment pseudowire redundancy where both of the CEs are dual-homed. This scenario is also designed to protect the emulated service against failures of the ACs and failures of the PEs. Both CE1 and CE2 are dual-homed to their respective PEs, CE1 to PE1 and PE2, and CE2 to PE3 and PE4. A dual-homing control protocol, the details of which are outside the scope of this document, enables the PEs and CEs to determine which PEs should forward towards the CEs and therefore which ACs the CEs should use to forward towards the PSN.",
      "zh-CHS": "图3说明了单段伪线冗余的应用，其中两个CE都是双宿的。此场景还设计用于保护模拟服务免受ACs故障和PEs故障的影响。CE1和CE2均与各自的PEs、CE1至PE1和PE2以及CE2至PE3和PE4双宿。双归宿控制协议（其详细信息不在本文件范围内）使PEs和CEs能够确定哪些PEs应转发至CEs，因此CEs应使用哪些ACs转发至PSN。"
    },
    {
      "indent": 3,
      "text": "Note that the PSN tunnels are not shown in this figure for clarity. However, it can be assumed that each of the PWs shown is encapsulated in a separate PSN tunnel. Protection against failures of the PSN tunnels is provided using PSN mechanisms such as MPLS fast reroute, so that these failures do not impact the PW.",
      "zh-CHS": "请注意，为清晰起见，本图中未显示PSN隧道。然而，可以假设所示的每个PW封装在单独的PSN隧道中。使用PSN机制（如MPLS快速重路由）提供针对PSN隧道故障的保护，以便这些故障不会影响PW。"
    },
    {
      "indent": 3,
      "text": "      |<-------------- Emulated Service ---------------->|\n      |                                                  |\n      |          |<------- Pseudowire ------->|          |\n      |          |                            |          |\n      |          |    |<-- PSN Tunnels-->|    |          |\n      |          V    V                  V    V          |\n      V    AC    +----+                  +----+     AC   V\n+-----+    |     |....|.......PW1........|....|     |    +-----+\n|     |----------| PE1|......   .........| PE3|----------|     |\n| CE1 |          +----+      \\ /  PW3    +----+          | CE2 |\n|     |          +----+       X          +----+          |     |\n|     |          |    |....../ \\..PW4....|    |          |     |\n|     |----------| PE2|                  | PE4|--------- |     |\n+-----+    |     |....|.....PW2..........|....|     |    +-----+\n           AC    +----+                  +----+     AC",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Figure 3: Two Dual-Homed CEs and Redundant SS-PWs",
      "zh-CHS": "图3：两个双宿CEs和冗余SS PW"
    },
    {
      "indent": 3,
      "text": "PW1 and PW4 connect PE1 to PE3 and PE4, respectively. Similarly, PW2 and PW3 connect PE2 to PE4 and PE3. PW1, PW2, PW3, and PW4 are all up. In order to support protection for the emulated service, only one PW MUST be selected to forward traffic.",
      "zh-CHS": "PW1和PW4分别将PE1连接到PE3和PE4。同样，PW2和PW3将PE2连接到PE4和PE3。PW1、PW2、PW3和PW4都已启动。为了支持对模拟服务的保护，必须只选择一个PW来转发流量。"
    },
    {
      "indent": 3,
      "text": "If a PW has a preferential forwarding status of 'active', it can be used for forwarding traffic. The actual up PW chosen by the combined set of PEs connected to the CEs is determined by considering the preferential forwarding status of each PW at each PE. The mechanisms for communicating the preferential forwarding status are outside the scope of this document. Only one PW is used for forwarding.",
      "zh-CHS": "如果PW的优先转发状态为“活动”，则可将其用于转发流量。通过考虑每个PE处每个PW的优先转发状态来确定连接到CEs的组合PE选择的实际up PW。传达优先转发状态的机制不在本文件范围内。只有一个PW用于转发。"
    },
    {
      "indent": 3,
      "text": "The following failure scenario illustrates the operation of PW redundancy in Figure 3. In the initial steady state, when there are no failures of the ACs, one of the PWs is chosen as the active PW, and all others are chosen as standby. The dual-homing protocol between CE1 and PE1/PE2 chooses to use the AC to PE2, while the protocol between CE2 and PE3/PE4 chooses to use the AC to PE4. Therefore, the PW between PE2 and PE4 is chosen as the active PW to complete the path between CE1 and CE2.",
      "zh-CHS": "以下故障场景说明了图3中PW冗余的操作。在初始稳定状态下，当ACs没有故障时，选择一个PW作为活动PW，选择所有其他PW作为备用PW。CE1和PE1/PE2之间的双归宿协议选择使用AC到PE2，而CE2和PE3/PE4之间的协议选择使用AC到PE4。因此，选择PE2和PE4之间的PW作为活动PW，以完成CE1和CE2之间的路径。"
    },
    {
      "indent": 3,
      "text": "On failure of the AC between the dual-homed CE1 and PE2, the preferential forwarding status of the PWs at PE1, PE2, PE3 and PE4 needs to change so as to re-establish a path from CE1 to CE2. Different mechanisms can be used to achieve this and these are beyond the scope of this document. After the change in status, the algorithm needs to evaluate and select which PW to forward traffic on. In this application, each dual-homing algorithm, i.e., {CE1, PE1, PE2} and {CE2, PE3, PE4}, selects the active AC independently.",
      "zh-CHS": "当双宿CE1和PE2之间的AC发生故障时，PE1、PE2、PE3和PE4处PWs的优先转发状态需要改变，以便重新建立从CE1到CE2的路径。可以使用不同的机制来实现这一点，这些机制超出了本文件的范围。在状态改变之后，算法需要评估和选择转发流量的PW。在该应用中，每个双归宿算法，即{CE1，PE1，PE2}和{CE2，PE3，PE4}，独立地选择有源AC。"
    },
    {
      "indent": 3,
      "text": "There is therefore a need to signal the active status of each AC such that the PEs can select a common active PW for forwarding between CE1 and CE2.",
      "zh-CHS": "因此，需要发出每个AC的激活状态的信号，以便PEs可以选择一个公共激活PW在CE1和CE2之间进行转发。"
    },
    {
      "indent": 3,
      "text": "Changes occurring on one side of network due to a failure of the AC or PE are not propagated to the ACs on the other side of the network. Furthermore, failures in the PSN are not propagated to the attached CEs. Note that end-to-end native service protection switching can also be used to protect the emulated service in this scenario. In this case, PW3 and PW4 are not necessary.",
      "zh-CHS": "由于AC或PE故障而在网络一侧发生的更改不会传播到网络另一侧的ACs。此外，PSN中的故障不会传播到连接的CE。请注意，在这种情况下，端到端本机服务保护切换也可用于保护模拟服务。在这种情况下，不需要PW3和PW4。"
    },
    {
      "indent": 3,
      "text": "If the CEs do not perform native service protection switching, they may instead use load balancing across the paths between the CEs.",
      "zh-CHS": "如果CEs不执行本机服务保护切换，它们可以在CEs之间的路径上使用负载平衡。"
    },
    {
      "indent": 0,
      "text": "3.2.3. PW Redundancy for S-PE Protection: Single-Homed CEs with Redundant MS-PWs",
      "zh-CHS": "3.2.3. S-PE保护的PW冗余：带有冗余MS PWs的单宿CEs"
    },
    {
      "indent": 3,
      "text": "Figure 4 shows a scenario where both CEs are single-homed, and MS-PW redundancy is used. The main objective is to protect the emulated service against failures of the S-PEs.",
      "zh-CHS": "图4显示了一个场景，其中两个CE都是单宿的，并且使用MS-PW冗余。主要目的是保护模拟服务免受S-PEs故障的影响。"
    },
    {
      "indent": 3,
      "text": "    Native   |<----------- Pseudowires ----------->|  Native\n    Service  |                                     |  Service\n     (AC)    |     |<-PSN1-->|     |<-PSN2-->|     |  (AC)\n       |     V     V         V     V         V     V   |\n       |     +-----+         +-----+         +-----+   |\n+----+ |     |T-PE1|=========|S-PE1|=========|T-PE2|   |   +----+\n|    |-------|......PW1-Seg1.......|.PW1-Seg2......|-------|    |\n| CE1|       |     |=========|     |=========|     |       | CE2|\n|    |       +-----+         +-----+         +-----+       |    |\n+----+        |.||.|                          |.||.|       +----+\n              |.||.|         +-----+          |.||.|\n              |.||.|=========|     |========== .||.|\n              |.||...PW2-Seg1......|.PW2-Seg2...||.|\n              |.| ===========|S-PE2|============ |.|\n              |.|            +-----+             |.|\n              |.|============+-----+============= .|\n              |.....PW3-Seg1.|     | PW3-Seg2......|\n               ==============|S-PE3|===============\n                             |     |\n                             +-----+",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Figure 4: Single-Homed CE with Redundant MS-PWs",
      "zh-CHS": "图4：带有冗余MS PWs的单宿CE"
    },
    {
      "indent": 3,
      "text": "CE1 is connected to T-PE1, and CE2 is connected to T-PE2. There are three multi-segment PWs. PW1 is switched at S-PE1, PW2 is switched at S-PE2, and PW3 is switched at S-PE3. This scenario provides N:1 protection for the subset of the path of the emulated service from T-PE1 to T-PE2.",
      "zh-CHS": "CE1连接到T-PE1，CE2连接到T-PE2。有三个多段PW。PW1在S-PE1处切换，PW2在S-PE2处切换，PW3在S-PE3处切换。此场景为从T-PE1到T-PE2的模拟服务路径子集提供N:1保护。"
    },
    {
      "indent": 3,
      "text": "Since there is no multi-homing running on the ACs, the T-PE nodes advertise 'active' for the preferential forwarding status based on a priority for the PW. The priority associates a meaning of 'primary PW' and 'secondary PW' to a PW. These priorities MUST be used if revertive mode is used and the active PW to use for forwarding is determined accordingly. The priority can be derived via configuration or based on the value of the PW forwarding equivalence class (FEC). For example, a lower value of PWid FEC can be taken as a higher priority. However, this does not guarantee selection of same PW by the T-PEs because of, for example, a mismatch in the configuration of the PW priority at each T-PE. The intent of this application is for T-PE1 and T-PE2 to synchronize the transmit and receive paths of the PW over the network. In other words, both T-PE nodes are required to transmit over the PW segment that is switched by the same S-PE. This is desirable for ease of operation and troubleshooting.",
      "zh-CHS": "由于ACs上没有运行多归属，T-PE节点根据PW的优先级为优先转发状态播发“活动”。优先级将“主要PW”和“次要PW”的含义与PW相关联。如果使用回复模式，并且相应地确定用于转发的活动PW，则必须使用这些优先级。优先级可以通过配置或基于PW转发等价类（FEC）的值导出。例如，PWid FEC的较低值可被视为较高优先级。然而，这并不保证T-PE选择相同的PW，因为，例如，每个T-PE的PW优先级配置不匹配。本应用程序的目的是让T-PE1和T-PE2通过网络同步PW的发送和接收路径。换句话说，两个T-PE节点都需要通过由相同S-PE交换的PW段进行传输。这是为了便于操作和故障排除。"
    },
    {
      "indent": 0,
      "text": "3.2.4. PW Redundancy for PE-rs Protection in H-VPLS Using SS-PWs",
      "section_title": true,
      "zh-CHS": "3.2.4. 使用SS PWs的H-VPLS中PE rs保护的PW冗余"
    },
    {
      "indent": 3,
      "text": "The following figure (based on the architecture shown in Figure 3 of [RFC4762]) illustrates the application of PW redundancy to hierarchical VPLS (H-VPLS). Note that the PSN tunnels are not shown for clarity, and only one PW of a PW group is shown. A multi-tenant unit switch (MTU-s) is dual-homed to two PE router switches. The example here uses SS-PWs, and the objective is to protect the emulated service against failures of a PE-rs.",
      "zh-CHS": "下图（基于[RFC4762]图3所示的体系结构）说明了PW冗余在分层VPL（H-VPL）中的应用。请注意，为清晰起见，未显示PSN通道，仅显示PW组中的一个PW。多租户单元交换机（MTU-s）是两个PE路由器交换机的双主交换机。这里的示例使用SS PWs，目的是保护模拟服务不受PE-rs故障的影响。"
    },
    {
      "indent": 7,
      "text": "                                    PE1-rs\n                                +--------+\n                                |  VSI   |\n                Active PW       |   --   |\n                 Group..........|../  \\..|.\nCE-1                 .          |  \\  /  | .\n \\                  .           |   --   |  .\n  \\                .            +--------+   .\n   \\   MTU-s      .                  .        .     PE3-rs\n    +--------+   .                   .         . +--------+\n    |   VSI  |  .                    .  H-VPlS  .|  VSI   |\n    |   -- ..|..                     .   Core    |.. --   |\n    |  /  \\  |                       .    PWs    |  /  \\  |\n    |  \\  /..|..                     .           |  \\  /  |\n    |   --   |  .                    .          .|.. --   |\n    +--------+   .                   .         . +--------+\n   /              .                  .        .\n  /                .            +--------+   .\n /                  .           |  VSI   |  .\nCE-2                 .          |   --   | .\n                      ..........|../  \\..|.\n                Standby PW      |  \\  /  |\n                 Group          |   --   |\n                                +--------+\n                                  PE2-rs",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Figure 5: MTU-s Dual-Homing in H-VPLS Core",
      "zh-CHS": "图5:H-VPLS核心中的MTU-s双归宿"
    },
    {
      "indent": 3,
      "text": "In Figure 5, the MTU-s is dual-homed to PE1-rs and PE2-rs and has spoke PWs to each of them. The MTU-s needs to choose only one of the spoke PWs (the active PW) to forward traffic to one of the PEs and sets the other PW to standby. The MTU-s can derive the status of the PWs based on local policy configuration. PE1-rs and PE2-rs are connected to the H-VPLS core on the other side of network. The MTU-s communicates the status of its member PWs for a set of virtual switching instances (VSIs) that share a common status of active or standby. Here, the MTU-s controls the selection of PWs used to forward traffic. Signaling using PW grouping with a common group-id in the PWid FEC Element, or a Grouping TLV in Generalized PWid FEC Element as defined in [RFC4447], to PE1-rs and PE2-rs, is recommended for improved scaling.",
      "zh-CHS": "在图5中，MTU-s与PE1-rs和PE2-rs双宿，并与每一个PE1-rs和PE2-rs相连。MTU-s只需选择一个分支PW（活动PW）将流量转发至其中一个PEs，并将另一个PW设置为备用。MTU-s可以根据本地策略配置导出PWs的状态。PE1 rs和PE2 rs连接到网络另一端的H-VPLS核心。MTU-s为一组虚拟交换实例（VSI）传递其成员PWs的状态，这些虚拟交换实例共享活动或备用的公共状态。这里，MTU-s控制用于转发流量的PWs的选择。建议使用PWid FEC元素中具有公共组id的PW分组或[RFC4447]中定义的广义PWid FEC元素中的分组TLV向PE1 rs和PE2 rs发送信令，以改进缩放。"
    },
    {
      "indent": 3,
      "text": "Whenever an MTU-s performs a switchover of the active PW group, it needs to communicate this status change to the PE2-rs. That is, it informs PE2-rs that the status of the standby PW group has changed to active.",
      "zh-CHS": "每当MTU-s执行激活PW组的切换时，它需要将此状态更改告知PE2-rs。也就是说，它通知PE2-rs备用PW组的状态已更改为激活。"
    },
    {
      "indent": 3,
      "text": "In this scenario, PE devices are aware of switchovers at the MTU-s and could generate Media Access Control (MAC) Address Withdraw messages to trigger MAC flushing within the H-VPLS full mesh. By default, MTU-s devices should still trigger MAC Address Withdraw messages as defined in [RFC4762] to prevent two copies of MAC Address Withdraw messages to be sent (one by the MTU-s and another one by the PE-rs). Mechanisms to disable the MAC withdraw trigger in certain devices are out of the scope of this document.",
      "zh-CHS": "在这种情况下，PE设备知道MTU-s处的切换，并可生成媒体访问控制（MAC）地址撤回消息，以触发H-VPLS全网内的MAC刷新。默认情况下，MTU-s设备仍应触发[RFC4762]中定义的MAC地址撤回消息，以防止发送两份MAC地址撤回消息（一份由MTU-s发送，另一份由PE-rs发送）。在某些设备中禁用MAC撤销触发器的机制不在本文档的范围内。"
    },
    {
      "indent": 0,
      "text": "3.2.5. PW Redundancy for PE Protection in a VPLS Ring Using SS-PWs",
      "section_title": true,
      "zh-CHS": "3.2.5. 使用SS PWs的VPLS环中PE保护的PW冗余"
    },
    {
      "indent": 3,
      "text": "The following figure illustrates the use of PW redundancy for dual-homed connectivity between PEs in a VPLS ring topology. As above, PSN tunnels are not shown, and only one PW of a PW group is shown for clarity. The example here uses SS-PWs, and the objective is to protect the emulated service against failures of a PE on the ring.",
      "zh-CHS": "下图说明了在VPLS环形拓扑中使用PW冗余实现PEs之间的双宿连接。如上所述，未显示PSN隧道，为清晰起见，仅显示PW组中的一个PW。这里的示例使用SS PWs，目的是保护模拟服务不受环上PE故障的影响。"
    },
    {
      "indent": 3,
      "text": "            PE1                            PE2\n         +--------+                     +--------+\n         |  VSI   |                     |  VSI   |\n         |   --   |                     |   --   |\n   ......|../  \\..|.....................|../  \\..|.......\n         |  \\  /  |     PW Group 1      |  \\  /  |\n         |   --   |                     |   --   |\n         +--------+                     +--------+\n              .                              .\n              .                              .\nVPLS Domain A .                              . VPLS Domain B\n              .                              .\n              .                              .\n              .                              .\n         +--------+                     +--------+\n         |  VSI   |                     |  VSI   |\n         |   --   |                     |   --   |\n   ......|../  \\..|.....................|../  \\..|........\n         |  \\  /  |     PW Group 2      |  \\  /  |\n         |   --   |                     |   --   |\n         +--------+                     +--------+\n            PE3                            PE4",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 6: Redundancy in a VPLS Ring Topology",
      "zh-CHS": "图6：VPLS环形拓扑中的冗余"
    },
    {
      "indent": 3,
      "text": "In Figure 6, PE1 and PE3 from VPLS domain A are connected to PE2 and PE4 in VPLS domain B via PW group 1 and PW group 2. The PEs are connected to each other in such a way as to form a ring topology. Such scenarios may arise in inter-domain H-VPLS deployments where the Rapid Spanning Tree Protocol (RSTP) or other mechanisms may be used to maintain loop-free connectivity of the PW groups.",
      "zh-CHS": "在图6中，来自VPLS域A的PE1和PE3通过PW组1和PW组2连接到VPLS域B中的PE2和PE4。PEs以形成环形拓扑的方式相互连接。此类场景可能出现在域间H-VPLS部署中，其中快速生成树协议（RSTP）或其他机制可用于维持PW组的无环路连接。"
    },
    {
      "indent": 3,
      "text": "[RFC4762] outlines multi-domain VPLS services without specifying how multiple redundant border PEs per domain and per VPLS instance can be supported. In the example above, PW group 1 may be blocked at PE1 by RSTP, and it is desirable to block the group at PE2 by exchanging the PW preferential forwarding status of standby. The details of how PW grouping is achieved and used is deployment specific and is outside the scope of this document.",
      "zh-CHS": "[RFC4762]概述了多域VPLS服务，但未指定如何支持每个域和每个VPLS实例的多个冗余边界PE。在上面的示例中，可以通过RSTP在PE1处阻塞PW组1，并且希望通过交换待机的PW优先转发状态来在PE2处阻塞该组。如何实现和使用PW分组的详细信息是特定于部署的，不在本文档的范围内。"
    },
    {
      "indent": 0,
      "text": "3.2.6. PW Redundancy for VPLS n-PE Protection Using SS-PWs",
      "section_title": true,
      "zh-CHS": "3.2.6. 使用SS PWs的VPLS n-PE保护的PW冗余"
    },
    {
      "indent": 8,
      "text": "                  |<----- Provider ----->|\n                            Core\n           +------+                      +------+\n           | n-PE |::::::::::::::::::::::| n-PE |\nProvider   | (P)  |..........   .........| (P)  |  Provider\nAccess     +------+          . .         +------+  Access\nNetwork                       X                    Network\n  (1)      +------+          . .         +------+    (2)\n           | n-PE |..........   .........| n-PE |\n           |  (B) |......................| (B)  |\n           +------+                      +------+",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "Figure 7: Bridge Module Model",
      "zh-CHS": "图7：桥接模块模型"
    },
    {
      "indent": 3,
      "text": "Figure 7 shows a scenario with two provider access networks. The example here uses SS-PWs, and the objective is to protect the emulated service against failures of a network-facing PE (n-PE).",
      "zh-CHS": "图7显示了具有两个提供商访问网络的场景。这里的示例使用SS PWs，其目的是保护模拟服务不受面向PE（n-PE）的网络故障的影响。"
    },
    {
      "indent": 3,
      "text": "Each network has two n-Pes. These n-PEs are connected via a full mesh of PWs for a given VPLS instance. As shown in the figure, only one n-PE in each access network serves as the primary PE (P) for that VPLS instance, and the other n-PE serves as the backup PE (B). In this figure, each primary PE has two active PWs originating from it. Therefore, when a multicast, broadcast, or unknown unicast frame arrives at the primary n-PE from the access network side, the n-PE replicates the frame over both PWs in the core even though it only needs to send the frames over a single PW (shown with :::: in the figure) to the primary n-PE on the other side. This is an unnecessary replication of the customer frames that consumes core-network bandwidth (half of the frames get discarded at the receiving n-PE). This issue gets aggravated when there are three or more n-PEs per provider access network. For example, if there are three n-PEs or four n-PEs per access network, then 67% or 75% of core bandwidth for multicast, broadcast, and unknown unicast are wasted, respectively.",
      "zh-CHS": "每个网络有两个n-PE。对于给定的VPLS实例，这些n-PE通过PWs的完整网格连接。如图所示，每个接入网络中只有一个n-PE用作该VPLS实例的主PE（P），另一个n-PE用作备份PE（B）。在该图中，每个主PE有两个源自它的活动PW。因此，当多播、广播或未知单播帧从接入网络侧到达主n-PE时，n-PE通过核心中的两个PW复制该帧，即使它只需要通过单个PW（如图中所示：：）将帧发送到另一侧的主n-PE。这是对消耗核心网络带宽的客户帧的不必要复制（一半帧在接收n-PE时被丢弃）。当每个提供商接入网络有三个或更多的n-PE时，这个问题会加剧。例如，如果每个接入网络有三个n-PE或四个n-PE，则多播、广播和未知单播的核心带宽分别浪费了67%或75%。"
    },
    {
      "indent": 3,
      "text": "In this scenario, the n-PEs can communicate the active or standby status of the PWs among them. This status can be derived from the active or backup state of an n-PE for a given VPLS.",
      "zh-CHS": "在这种情况下，n-PEs可以在它们之间传送PWs的活动或备用状态。该状态可以从给定VPL的n-PE的活动或备份状态派生。"
    },
    {
      "indent": 0,
      "text": "4. Generic PW Redundancy Requirements",
      "section_title": true,
      "zh-CHS": "4. 通用PW冗余要求"
    },
    {
      "indent": 0,
      "text": "4.1. Protection Switching Requirements",
      "section_title": true,
      "zh-CHS": "4.1. 保护开关要求"
    },
    {
      "indent": 3,
      "text": "o Protection architectures such as N:1,1:1 or 1+1 are possible. 1:1 protection MUST be supported. The N:1 protection case is less efficient in terms of the resources that must be allocated; hence, this SHOULD be supported. 1+1 protection MAY be used in the scenarios described in the document. However, the details of its usage are outside the scope of this document, as it MAY require a 1+1 protection switching protocol between the CEs.",
      "zh-CHS": "o 保护架构（如N:1、1:1或1+1）是可能的。必须支持1:1保护。就必须分配的资源而言，N:1保护案例的效率较低；因此，这应该得到支持。1+1保护可用于本文档中描述的场景。但是，其使用细节不在本文件范围内，因为它可能需要CEs之间的1+1保护切换协议。"
    },
    {
      "indent": 3,
      "text": "o Non-revertive behavior MUST be supported, while revertive behavior is OPTIONAL. This avoids the need to designate one PW as primary unless revertive behavior is explicitly required.",
      "zh-CHS": "o 必须支持非还原行为，而还原行为是可选的。这避免了将一个PW指定为主PW的需要，除非明确要求恢复行为。"
    },
    {
      "indent": 3,
      "text": "o Protection switchover can be initiated from a PE, e.g., using a manual switchover or a forced switchover, or it may be triggered by a signal failure, i.e., a defect in the PW or PSN. Manual switchover may be necessary if it is required to disable one PW in a redundant set. Both methods MUST be supported, and signal failure triggers MUST be treated with a lower priority than any local or far-end forced switch or manual trigger.",
      "zh-CHS": "o 保护切换可以从PE启动，例如使用手动切换或强制切换，也可以由信号故障（即PW或PSN中的缺陷）触发。如果需要禁用冗余设置中的一个PW，则可能需要手动切换。必须支持这两种方法，且信号故障触发器的优先级必须低于任何本地或远端强制开关或手动触发器。"
    },
    {
      "indent": 3,
      "text": "o A PE MAY be able to forward packets received from a PW with a standby status in order to avoid black holing of in-flight packets during switchover. However, in cases where VPLS is used, all VPLS application packets received from standby PWs MUST be dropped, except for OAM and control-plane packets.",
      "zh-CHS": "o PE可以转发从具有待机状态的PW接收的分组，以避免在切换期间飞行中分组的黑眼。但是，在使用VPLS的情况下，必须丢弃从备用PWs接收的所有VPLS应用程序数据包，OAM和控制平面数据包除外。"
    },
    {
      "indent": 0,
      "text": "4.2. Operational Requirements",
      "section_title": true,
      "zh-CHS": "4.2. 操作要求"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs involved in protecting a PW SHOULD automatically discover and attempt to resolve inconsistencies in the configuration of primary/secondary PWs.",
      "zh-CHS": "o 参与保护PW的（T-）PEs应自动发现并尝试解决主/辅助PW配置中的不一致。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs involved in protecting a PW SHOULD automatically discover and attempt to resolve inconsistencies in the configuration of revertive/non-revertive protection switching mode.",
      "zh-CHS": "o 涉及保护PW的（T-）PEs应自动发现并尝试解决回复/非回复保护切换模式配置中的不一致。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs that do not automatically discover or resolve inconsistencies in the configuration of primary/secondary, revertive/non-revertive, or other parameters MUST generate an alarm upon detection of an inconsistent configuration.",
      "zh-CHS": "o 不能自动发现或解决主/辅、回复/非回复或其他参数配置不一致的（T-）PEs必须在检测到不一致配置时生成警报。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs participating in PW redundancy MUST support the configuration of revertive or non-revertive protection switching modes if both modes are supported.",
      "zh-CHS": "o 参与PW冗余的（T-）PEs必须支持可逆或非可逆保护切换模式的配置（如果支持这两种模式）。"
    },
    {
      "indent": 3,
      "text": "o The MIB(s) MUST support inter-PSN monitoring of the PW redundancy configuration, including the protection switching mode.",
      "zh-CHS": "o MIB必须支持PW冗余配置的PSN间监控，包括保护切换模式。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs participating in PW redundancy SHOULD support the local invocation of protection switching.",
      "zh-CHS": "o 参与PW冗余的（T-）PE应支持保护切换的本地调用。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs participating in PW redundancy SHOULD support the local invocation of a lockout of protection switching.",
      "zh-CHS": "o 参与PW冗余的（T-）PE应支持本地调用保护切换锁定。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The PW redundancy method described in this RFC will require an extension to the PW setup and maintenance protocol [RFC4447], which in turn is carried over the Label Distribution Protocol (LDP) [RFC5036]. This PW redundancy method will therefore inherit the security mechanisms of the version of LDP implemented in the PEs.",
      "zh-CHS": "本RFC中描述的PW冗余方法将需要对PW设置和维护协议[RFC4447]进行扩展，该协议反过来通过标签分发协议（LDP）[RFC5036]进行。因此，此PW冗余方法将继承PEs中实现的LDP版本的安全机制。"
    },
    {
      "indent": 0,
      "text": "6. Contributors",
      "section_title": true,
      "zh-CHS": "6. 贡献者"
    },
    {
      "indent": 3,
      "text": "The editors would like to thank Pranjal Kumar Dutta, Marc Lasserre, Jonathan Newton, Hamid Ould-Brahim, Olen Stokes, Dave Mcdysan, Giles Heron, and Thomas Nadeau, all of whom made a major contribution to the development of this document.",
      "zh-CHS": "编辑们要感谢Pranjal Kumar Dutta、Marc Lasserre、Jonathan Newton、Hamid Ould Brahim、Olen Stokes、Dave Mcdysan、Giles Heron和Thomas Nadeau，他们为本文件的编写做出了重大贡献。"
    },
    {
      "indent": 3,
      "text": "Pranjal Dutta Alcatel-Lucent EMail: pranjal.dutta@alcatel-lucent.com",
      "zh-CHS": "Pranjal Dutta阿尔卡特朗讯电子邮件：Pranjal。dutta@alcatel-朗讯网"
    },
    {
      "indent": 3,
      "text": "Marc Lasserre Alcatel-Lucent EMail: marc.lasserre@alcatel-lucent.com",
      "zh-CHS": "马克·拉塞尔·阿尔卡特·朗讯电子邮件：马克。lasserre@alcatel-朗讯网"
    },
    {
      "indent": 3,
      "text": "Jonathan Newton Cable & Wireless EMail: Jonathan.Newton@cw.com",
      "zh-CHS": "乔纳森·牛顿有线和无线电子邮件：乔纳森。Newton@cw.com"
    },
    {
      "indent": 3,
      "text": "Hamid Ould-Brahim EMail: ouldh@yahoo.com",
      "zh-CHS": "哈米德·乌尔德·布拉希姆电子邮件：ouldh@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Olen Stokes Extreme Networks EMail: ostokes@extremenetworks.com",
      "zh-CHS": "Olen Stokes极限网络电子邮件：ostokes@extremenetworks.com"
    },
    {
      "indent": 3,
      "text": "Dave McDysan Verizon EMail: dave.mcdysan@verizon.com",
      "zh-CHS": "Dave McDysan Verizon电子邮件：Dave。mcdysan@verizon.com"
    },
    {
      "indent": 3,
      "text": "Giles Heron Cisco Systems EMail: giles.heron@gmail.com",
      "zh-CHS": "Giles Heron思科系统电子邮件：Giles。heron@gmail.com"
    },
    {
      "indent": 3,
      "text": "Thomas Nadeau Juniper Networks EMail: tnadeau@lucidvision.com",
      "zh-CHS": "Thomas Nadeau Juniper Networks电子邮件：tnadeau@lucidvision.com"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Vach Kompella, Kendall Harvey, Tiberiu Grigoriu, Neil Hart, Kajal Saha, Florin Balus, and Philippe Niger for their valuable comments and suggestions.",
      "zh-CHS": "作者感谢Vach Kompella、Kendall Harvey、Tiberiu Grigoriu、Neil Hart、Kajal Saha、Florin Balus和Philippe Niger提出的宝贵意见和建议。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S. and P. Pate, \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "zh-CHS": "[RFC3985]Bryant，S.和P.Pate，“伪线仿真边到边（PWE3）架构”，RFC 39852005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4026] Andersson, L. and T. Madsen, \"Provider Provisioned Virtual Private Network (VPN) Terminology\", RFC 4026, March 2005.",
      "zh-CHS": "[RFC4026]Andersson，L.和T.Madsen，“提供商提供的虚拟专用网络（VPN）术语”，RFC 4026，2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4446] Martini, L., \"IANA Allocations for Pseudowire Edge to Edge Emulation (PWE3)\", BCP 116, RFC 4446, April 2006.",
      "zh-CHS": "[RFC4446]Martini，L.，“伪线边到边仿真（PWE3）的IANA分配”，BCP 116，RFC 4446，2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4447] Martini, L., Rosen, E., El-Aawar, N., Smith, T., and G. Heron, \"Pseudowire Setup and Maintenance Using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006.",
      "zh-CHS": "[RFC4447]Martini，L.，Rosen，E.，El Aawar，N.，Smith，T.，和G.Heron，“使用标签分发协议（LDP）的伪线设置和维护”，RFC 4447，2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4762] Lasserre, M. and V. Kompella, \"Virtual Private LAN Service (VPLS) Using Label Distribution Protocol (LDP) Signaling\", RFC 4762, January 2007.",
      "zh-CHS": "[RFC4762]Lasserre，M.和V.Kompella，“使用标签分发协议（LDP）信令的虚拟专用LAN服务（VPLS）”，RFC 4762，2007年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5036] Andersson, L., Minei, I., and B. Thomas, \"LDP Specification\", RFC 5036, October 2007.",
      "zh-CHS": "[RFC5036]Andersson，L.，Minei，I.，和B.Thomas，“LDP规范”，RFC 5036，2007年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5659] Bocci, M. and S. Bryant, \"An Architecture for Multi-Segment Pseudowire Emulation Edge-to-Edge\", RFC 5659, October 2009.",
      "zh-CHS": "[RFC5659]Bocci，M.和S.Bryant，“多段伪线边到边仿真的体系结构”，RFC 5659，2009年10月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative Reference",
      "section_title": true,
      "zh-CHS": "8.2. 资料性参考"
    },
    {
      "indent": 3,
      "text": "[RFC5601] Nadeau, T. and D. Zelig, \"Pseudowire (PW) Management Information Base (MIB)\", RFC 5601, July 2009.",
      "zh-CHS": "[RFC5601]Nadeau，T.和D.Zelig，“伪线（PW）管理信息库（MIB）”，RFC 56012009年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Praveen Muley Alcatel-Lucent",
      "zh-CHS": "Praveen Muley阿尔卡特朗讯"
    },
    {
      "indent": 3,
      "text": "EMail: praveen.muley@alcatel-lucent.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Mustapha Aissaoui Alcatel-Lucent",
      "zh-CHS": "穆斯塔法·艾萨维·阿尔卡特·朗讯"
    },
    {
      "indent": 3,
      "text": "EMail: mustapha.aissaoui@alcatel-lucent.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Matthew Bocci Alcatel-Lucent",
      "zh-CHS": "马修·博奇·阿尔卡特·朗讯"
    },
    {
      "indent": 3,
      "text": "EMail: matthew.bocci@alcatel-lucent.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}