{
  "title": {
    "text": "RFC 6432: Carrying Q.850 Codes in Reason Header Fields in SIP (Session Initiation Protocol) Responses",
    "zh-CHS": "RFC 6432"
  },
  "number": 6432,
  "created_at": "2021-11-06 10:17:34.190042+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Jesske\nRequest for Comments: 6432                                      L. Liess\nCategory: Standards Track                               Deutsche Telekom\nISSN: 2070-1721                                            November 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": " Carrying Q.850 Codes in Reason Header Fields in SIP (Session Initiation Protocol) Responses",
      "zh-CHS": "在SIP（会话启动协议）响应的原因头字段中携带Q.850代码"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Although the use of the SIP (Session Initiation Protocol) Reason header field in responses is considered in general in RFC 3326, its use is not specified for any particular response code. Nonetheless, existing deployments have been using Reason header fields to carry failure-related Q.850 cause codes in SIP responses to INVITE requests that have been gatewayed to Public Switched Telephone Network (PSTN) systems. This document normatively describes the use of the Reason header field in carrying Q.850 cause codes in SIP responses.",
      "zh-CHS": "尽管在RFC 3326中一般考虑在响应中使用SIP（会话启动协议）原因报头字段，但没有为任何特定响应代码指定其使用。尽管如此，现有部署一直在使用原因头字段在SIP响应中携带与故障相关的Q.850原因代码，以邀请已通过网关连接到公共交换电话网络（PSTN）系统的请求。本文档规范性地描述了在SIP响应中携带Q.850原因代码时使用的原因标头字段。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6432.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6432."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "zh-CHS": "本文件可能包含2008年11月10日之前发布或公开的IETF文件或IETF贡献中的材料。控制某些材料版权的人员可能未授予IETF信托允许在IETF标准流程之外修改此类材料的权利。在未从控制此类材料版权的人员处获得充分许可的情况下，不得在IETF标准流程之外修改本文件，也不得在IETF标准流程之外创建其衍生作品，除了将其格式化以RFC形式发布或将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Overview ........................................................2\n2. Terminology .....................................................2\n3. Applicability ...................................................3\n4. Security Considerations .........................................3\n5. Acknowledgments .................................................3\n6. Normative References ............................................3",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "zh-CHS": "1. 概述"
    },
    {
      "indent": 3,
      "text": "Although the use of the SIP (Session Initiation Protocol) Reason header field in responses is considered in general in RFC 3326 [RFC3326], its use is not specified for any particular response code. Nonetheless, existing deployments have been using Reason header fields to carry failure-related Q.850 [Q.850] cause codes in SIP responses to INVITE requests that have been gatewayed to PSTN systems. This document normatively describes the use of the Reason header field in SIP responses to carry Q.850 [Q.850] cause codes.",
      "zh-CHS": "尽管在RFC 3326[RFC3326]中一般考虑在响应中使用SIP（会话启动协议）原因报头字段，但没有为任何特定响应代码指定其使用。尽管如此，现有部署一直在使用原因标头字段在SIP响应中携带与故障相关的Q.850[Q.850]原因代码，以邀请已通过网关传送到PSTN系统的请求。本文档规范性地描述了在SIP响应中使用原因标头字段来携带Q.850[Q.850]原因代码。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "This document uses terms from [RFC3261].",
      "zh-CHS": "本文件使用[RFC3261]中的术语。"
    },
    {
      "indent": 0,
      "text": "3. Applicability",
      "section_title": true,
      "zh-CHS": "3. 适用性"
    },
    {
      "indent": 3,
      "text": "This document allows SIP responses to carry Reason header fields as follows:",
      "zh-CHS": "本文档允许SIP响应携带如下原因标题字段："
    },
    {
      "indent": 6,
      "text": "Any SIP Response message, with the exception of a 100 (Trying), MAY contain a Reason header field with a Q.850 [Q.850] cause code.",
      "zh-CHS": "任何SIP响应消息（100（尝试）除外）都可能包含带有Q.850[Q.850]原因代码的原因标头字段。"
    },
    {
      "indent": 6,
      "text": "The Reason header field is not needed in the 100 (Trying) responses, since they are transmitted hop by hop, not end to end. SIP responses with Reason header fields carrying values other than Q.850 [Q.850] cause codes are outside of the scope of this document.",
      "zh-CHS": "100（尝试）响应中不需要“原因头”字段，因为它们是逐跳传输的，而不是端到端传输的。带有除Q.850[Q.850]原因代码以外的值的原因标头字段的SIP响应不在本文档范围内。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This specification allows the presence of the Reason header field containing Q.850 [Q.850] cause codes in responses. The presence of the Reason header field in a response does not affect the treatment of the response. Nevertheless, there could be situations where a wrong Q.850 [Q.850] cause code could, for example, cause an announcement system to play the wrong information. To avoid such situations, it is RECOMMENDED that this header field be protected by a suitable integrity mechanism. The use of transport- or network-layer hop-by-hop security mechanisms, such as Transport Layer Security (TLS) or IPsec with appropriate cipher suites, can satisfy this requirement.",
      "zh-CHS": "本规范允许在响应中存在包含Q.850[Q.850]原因代码的原因标头字段。响应中存在原因标头字段不会影响对响应的处理。然而，在某些情况下，错误的Q.850[Q.850]原因代码可能会导致公告系统播放错误的信息。为了避免这种情况，建议使用适当的完整性机制保护此标头字段。使用传输层或网络层逐跳安全机制，如传输层安全（TLS）或具有适当密码套件的IPsec，可以满足这一要求。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "Thanks to Gonzalo Camarillo and Mary Barnes for the detailed review of this document.",
      "zh-CHS": "感谢Gonzalo Camarillo和Mary Barnes对本文件的详细审查。"
    },
    {
      "indent": 3,
      "text": "Thanks to Paul Kyzivat, Mary Barnes, John Elwell, Keith Drage, and Thomas Belling, who provided helpful comments, feedback, and suggestions.",
      "zh-CHS": "感谢Paul Kyzivat、Mary Barnes、John Elwell、Keith Drage和Thomas Belling，他们提供了有用的评论、反馈和建议。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "zh-CHS": "6. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[Q.850] \"Usage of cause and location in the Digital Subscriber Signalling System No. 1 and the Signalling System No. 7 ISDN User Part\", ITU Recommendation Q.850, May 1998.",
      "zh-CHS": "[Q.850]“数字用户信号发送系统1号和信号发送系统7号ISDN用户部分中原因和位置的使用”，ITU建议Q.850，1998年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[RFC3261]Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.，和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3326] Schulzrinne, H., Oran, D., and G. Camarillo, \"The Reason Header Field for the Session Initiation Protocol (SIP)\", RFC 3326, December 2002.",
      "zh-CHS": "[RFC3326]Schulzrinne，H.，Oran，D.，和G.Camarillo，“会话启动协议（SIP）的原因头字段”，RFC 3326，2002年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Roland Jesske Deutsche Telekom Heinrich-Hertz-Strasse 3-7 Darmstadt 64307 Germany",
      "zh-CHS": "罗兰·杰西克德国电信海因里希·赫兹大街3-7号达姆施塔特64307德国"
    },
    {
      "indent": 3,
      "text": "Phone: +4961515812766\nEMail: r.jesske@telekom.de",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Laura Liess Deutsche Telekom Heinrich-Hertz-Strasse 3-7 Darmstadt 64307 Germany",
      "zh-CHS": "Laura Liess Deutsche Telekom Heinrich Hertz Strasse 3-7 Darmstadt 64307德国"
    },
    {
      "indent": 3,
      "text": "Phone: +4961515812761\nEMail: L.Liess@telekom.de",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}