{
  "title": {
    "text": "RFC 6385: General Area Review Team (Gen-ART) Experiences",
    "zh-CHS": "RFC 6385"
  },
  "number": 6385,
  "created_at": "2021-11-06 06:47:06.591146+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         M. Barnes\nRequest for Comments: 6385                                       Polycom\nCategory: Informational                                         A. Doria\nISSN: 2070-1721                                      Research Consultant\n                                                           H. Alvestrand\n                                                                  Google\n                                                            B. Carpenter\n                                                  University of Auckland\n                                                            October 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "General Area Review Team (Gen-ART) Experiences",
      "zh-CHS": "一般区域评审团队（Gen ART）经验"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The General Area Review Team (Gen-ART) has been doing reviews of Internet-Drafts (I-Ds) since 2004. This document discusses the experience and the lessons learned over the past 7 years of this process. The review team initially reviewed the I-Ds before each of the IESG telechats. Since late 2005, review team members have been assigned to review I-Ds during IETF Last Call, unless no IETF Last Call is necessary for the I-D. The same reviewer then reviews any updates when the I-D is placed on an IESG telechat agenda.",
      "zh-CHS": "一般领域审查小组（Gen ART）自2004年以来一直在审查互联网草案（I-D）。本文件讨论了过去7年在这一进程中取得的经验和教训。审查小组最初在每次IESG会议之前审查了I-D。自2005年末以来，评审小组成员被指派在IETF最后一次呼叫期间评审I-D，除非I-D不需要IETF最后一次呼叫。当I-D被列入IESG Telecohat议程时，同一评审员会评审任何更新。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6385.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6385."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Who Are the Gen-ART Members? ....................................3\n3. Goals of Gen-ART ................................................3\n4. Gen-ART Reviews .................................................4\n   4.1. IETF Last Call Review Process ..............................4\n   4.2. IESG Telechat Review Process ...............................5\n   4.3. Form of Review .............................................5\n   4.4. Gen-ART Process Overview ...................................8\n5. Secretarial Process ............................................10\n   5.1. Maintaining Review Spreadsheet ............................10\n   5.2. Last Call Assignment Procedure ............................12\n   5.3. Telechat Assignment Procedure .............................13\n   5.4. Capturing Reviews .........................................14\n6. Results ........................................................14\n7. Impressions ....................................................15\n   7.1. Reviewers' Impressions ....................................15\n   7.2. General Area Directors' Impressions .......................17\n   7.3. Gen-ART Secretaries' Impressions ..........................18\n8. Needed Improvements ............................................18\n9. Applicability ..................................................20\n10. Security Considerations .......................................20\n11. Acknowledgments ...............................................20\n12. Informative References ........................................21",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The General Area Review Team (Gen-ART) was created personally by the General Area Director in 2004. This document discusses the experiences and the lessons learned as the process has evolved over the past 7 years. The process described in this document reflects that which was in place at the time this document was published.",
      "zh-CHS": "总区域审查小组（Gen ART）由总区域主任于2004年亲自创建。本文件讨论了在过去7年中，随着这一进程的发展所取得的经验和教训。本文件中描述的流程反映了本文件发布时的流程。"
    },
    {
      "indent": 3,
      "text": "This process is likely to continue to change over time. The review team has been retained by subsequent General Area Directors. It has no official role in the IETF standards process, except as a set of individuals entitled, like everyone, to comment on Internet-Drafts (I-Ds). Its volunteers, including a secretary and the team of reviewers, serve at the invitation of the General AD. Both the reviews and the reviewer names are public.",
      "zh-CHS": "随着时间的推移，这一过程可能会继续发生变化。审查小组由随后的一般区域主管保留。它在IETF标准过程中没有正式角色，除了作为一组有权像所有人一样对互联网草案（I-D）发表评论的个人。其志愿者，包括一名秘书和一组评审员，应总广告的邀请服务。评审和评审员姓名都是公开的。"
    },
    {
      "indent": 0,
      "text": "2. Who Are the Gen-ART Members?",
      "section_title": true,
      "zh-CHS": "2. 谁是艺术世代的成员？"
    },
    {
      "indent": 3,
      "text": "The reviewers are typically individuals that have a fair amount of experience within various IETF Working Groups (WGs), have authored WG I-Ds and RFCs, and are often considered to be subject matter experts (SMEs) in their particular areas of work. The current review team is comprised of such technical experts, including several WG chairs as well as past and current Internet Architecture Board (IAB) members. Several past and current ADs have served as reviewers. Two past General ADs have also served as reviewers, with one currently serving.",
      "zh-CHS": "评审员通常是在各个IETF工作组（WG）内具有相当丰富经验、编写了工作组I-D和RFC的个人，通常被认为是其特定工作领域的主题专家（SME）。目前的审查小组由此类技术专家组成，包括几位工作组主席以及过去和现在的互联网架构委员会（IAB）成员。过去和现在的几则广告都曾担任评论员。过去的两个普通广告也曾担任评论员，目前有一个担任。"
    },
    {
      "indent": 3,
      "text": "Members of the review team sometimes excuse themselves from the team for various reasons, typically due to \"day job\" demands. However, they often rejoin (for periods of time) as their schedules allow. Also, some reviewers remain on the team, while their review workload is decreased by assigning them just one I-D (at Last Call time) to review each month. Section 11 provides a list of currently active reviewers, along with those who have served on the review team in the past.",
      "zh-CHS": "评审团队成员有时会出于各种原因而离开团队，通常是因为“日常工作”的需要。然而，他们经常在日程允许的情况下重新加入（一段时间）。此外，一些审阅者仍然留在团队中，而他们的审阅工作量则通过每月只分配一个I-D（在最后一次调用时）来减少。第11节列出了当前活跃的评审员名单，以及过去曾在评审小组中任职的评审员名单。"
    },
    {
      "indent": 0,
      "text": "3. Goals of Gen-ART",
      "section_title": true,
      "zh-CHS": "3. 当代艺术的目标"
    },
    {
      "indent": 3,
      "text": "The original and continuing goal of the Gen-ART was, and is, to offload from the General AD some of the burden of IESG reviews. The load for the bi-weekly IESG reviews is often quite large; occasionally, there are more than 20 I-Ds scheduled for discussion in a single telechat. Thus, ADs also have less than a week's notice for many of the I-Ds on the telechat agenda.",
      "zh-CHS": "Gen ART最初和持续的目标是，现在也是，从一般广告中卸下IESG评论的一些负担。每两周一次的IESG审查的工作量通常相当大；有时，在一个telechat中计划讨论20多个I-D。因此，对于telechat议程上的许多I-D，广告也只有不到一周的通知时间。"
    },
    {
      "indent": 3,
      "text": "Gen-ART was based on a model that had proved productive in the Operations (OPS) Directorate: quick review close to telechat time, to advise the AD on issues that remain serious. By having a trusted group of reviewers read and evaluate the I-Ds, the General AD would be able to concentrate on those I-Ds where there was a concern expressed by the reviewer. The reviewers are expected to provide feedback based on a whole set of criteria, including the criteria",
      "zh-CHS": "Gen ART基于一种在运营（OPS）董事会证明是有效的模式：在telechat时间附近进行快速审查，就仍然严重的问题向广告提供建议。通过让一组受信任的评审员阅读和评估I-D，一般广告将能够集中在评审员表示关注的I-D上。评审员应根据一整套标准（包括标准）提供反馈"
    },
    {
      "indent": 3,
      "text": "summarized in Section 4.3. The overall objective is to ensure that the I-Ds are well structured; can be easily understood, at least at a high level; and provide a reasonable basis for implementation (for I-Ds intended for the Standards Track).",
      "zh-CHS": "总结见第4.3节。总体目标是确保I-D结构良好；易于理解，至少在高水平上是如此；并为实施提供合理的依据（用于标准轨道的I-D）。"
    },
    {
      "indent": 3,
      "text": "While other area (and WG) directorates/review teams existed prior to Gen-ART and more have been established since Gen-ART, the roles of each are fairly distinct. Thus, there is little overlap between the goals and review criteria for the various review teams. It is also very valuable for these other review teams to operate independently. For example, when both Gen-ART reviews and Security Directorate (SecDir) reviews raise the same sorts of concerns, it's a clear red flag that the I-D needs more work before progressing. In addition, due to the typical thoroughness (and objectiveness) of the various review teams' reviews, the sponsoring AD and document shepherd are often able to work with the editors/WG (and vice versa, depending upon area and WG structure) to improve the overall quality of the final I-D. It should also be noted that some ADs take the Gen-ART reviews into consideration when preparing their own evaluations.",
      "zh-CHS": "虽然在Gen ART之前存在其他领域（和工作组）的董事会/审查小组，并且在Gen ART之后建立了更多的董事会/审查小组，但每个董事会/审查小组的角色相当不同。因此，各审查小组的目标和审查标准之间几乎没有重叠。这些其他审查小组独立运作也是非常有价值的。例如，当Gen ART审查和安全理事会（SecDir）审查都提出了同样的问题时，很明显，I-D在进展之前需要做更多的工作。此外，由于各审查小组的审查具有典型的彻底性（和客观性），赞助广告和文件管理人通常能够与编辑/工作组合作（反之亦然，取决于区域和工作组结构）为了提高最终I-D的整体质量。还应注意，一些广告在准备自己的评估时考虑了Gen艺术评论。"
    },
    {
      "indent": 3,
      "text": "Statistics from the Gen-ART reviews over the past 6+ years show a trend of increased quality and readiness for progression of I-Ds by the time they are placed on the telechat agenda. Additional statistics are discussed in Section 6.",
      "zh-CHS": "过去6年多的Gen ART回顾统计数据显示，当I-D被列入telechat议程时，其质量和进展准备度都有提高的趋势。第6节讨论了其他统计数据。"
    },
    {
      "indent": 0,
      "text": "4. Gen-ART Reviews",
      "section_title": true,
      "zh-CHS": "4. Gen艺术评论"
    },
    {
      "indent": 0,
      "text": "4.1. IETF Last Call Review Process",
      "section_title": true,
      "zh-CHS": "4.1. IETF最后呼叫审查流程"
    },
    {
      "indent": 3,
      "text": "While the original process was meant only for reviews just before the IESG telechat, the decision was made to include IETF Last Call (LC) reviews in early 2005. Over time the latter has proven to be quite effective. Assigning the I-Ds at IETF LC time typically gives a reviewer more time to review an I-D. And, in some cases, the IETF LC version is the one to appear on the telechat. Thus, by the time I-Ds are added to the telechat agenda, a majority (typically at least 70%) have already been reviewed. For those I-Ds that have been up-versioned, the amount of time dedicated to re-review depends upon the review summary for the IETF LC review.",
      "zh-CHS": "虽然最初的流程仅用于IESG telechat之前的审查，但决定在2005年初纳入IETF最后一次呼叫（LC）审查。随着时间的推移，后者已被证明是相当有效的。在IETF LC时间分配I-D通常会给审查者更多的时间来审查I-D。在某些情况下，IETF LC版本会出现在telechat上。因此，当I-D被添加到telechat议程时，大多数（通常至少70%）已经过审查。对于已更新版本的I-D，用于重新审查的时间取决于IETF LC审查的审查摘要。"
    },
    {
      "indent": 3,
      "text": "The assignments at IETF LC time evolved to minimize the gap between LC announcements and assignment time, with the secretary doing LC assignments every Thursday night. This typically allows the reviewer at least one week and sometimes two to three weeks to complete the review. The reviews are obviously most helpful when done on or before the end of the IETF LC.",
      "zh-CHS": "IETF LC时间的任务演变为尽量缩短LC通知和任务时间之间的差距，秘书每周四晚上进行LC任务。这通常允许审核人至少一周，有时两到三周完成审核。当评审在IETF LC结束时或之前进行时，显然最有帮助。"
    },
    {
      "indent": 3,
      "text": "The Last Call assignments are done on a fairly strict round-robin basis to ensure a fair workload amongst all the reviewers. Reviewers that are unavailable (vacations, etc.) during the review period timeframe obviously are excluded from that round of assignments, but remain in the same queue position for the next round. The order is occasionally modified to avoid assigning an editor/author or WG chair their own I-Ds. A reviewer may also NACK an assignment if they feel they may have some bias (although corporate affiliations are not considered to be sources of bias) or they don't feel they can review the I-D in a timely manner.",
      "zh-CHS": "最后一次呼叫分配是在相当严格的循环基础上完成的，以确保所有审阅者之间的工作量公平。在审查期内不可用（休假等）的审查员显然被排除在该轮作业之外，但在下一轮作业中仍处于相同的队列位置。为了避免给编辑/作者或工作组主席分配他们自己的ID，有时会修改顺序。如果审查人员认为他们可能有一些偏见（尽管公司附属关系不被视为偏见的来源），或者他们认为他们不能及时审查身份证明，他们也可以拒绝接受任务。"
    },
    {
      "indent": 3,
      "text": "The assignment process is completely manual, although a spreadsheet tremendously facilitates the process. The details are described in Section 5. Ideally, this process could be automated. However, manual intervention would still be required to maintain the appropriate available reviewer list (unless reviewers took on the task of maintaining their data in some sort of database). Further details on the tools necessary to automate the entire process are provided in Section 8.",
      "zh-CHS": "虽然电子表格极大地简化了分配过程，但分配过程完全是手动的。详细情况见第5节。理想情况下，这一过程可以自动化。然而，仍然需要人工干预来维护适当的可用审查员名单（除非审查员承担起在某种数据库中维护其数据的任务）。第8节提供了自动化整个过程所需工具的更多详细信息。"
    },
    {
      "indent": 0,
      "text": "4.2. IESG Telechat Review Process",
      "section_title": true,
      "zh-CHS": "4.2. IESG Telechat审查流程"
    },
    {
      "indent": 3,
      "text": "The process for reviewing I-Ds when they appear on the IESG agenda is as follows:",
      "zh-CHS": "当I-D出现在IESG议程上时，其审查流程如下："
    },
    {
      "indent": 3,
      "text": "o The \"nearly final\" IESG meeting agenda generally appears on Thursday night, less than one week before the IESG telechat. The Gen-ART secretary uses this as the input for the assignment process.",
      "zh-CHS": "o IESG会议的“几乎最后”议程通常出现在周四晚上，距离IESG电视会议还有不到一周的时间。总艺术秘书将此作为分配过程的输入。"
    },
    {
      "indent": 3,
      "text": "o For I-Ds reviewed at IETF Last Call, a new review is only asked for if the I-D is revised. In this case the reviewer, typically the person who did the Last Call review, only needs to check that any open issues were resolved. Often the draft will not have changed between IETF LC and the IESG telechat review. Section 4.4 provides the step-by-step telechat review assignment process, with specific details on the maintenance of the review assignment data, which is in turn maintained in review spreadsheets (Section 5).",
      "zh-CHS": "o 对于IETF最后一次电话会议上审查的I-D，仅当I-D被修订时才要求进行新的审查。在这种情况下，审核人（通常是最后一次电话审核的人）只需检查是否解决了任何未决问题。在IETF LC和IESG Telecohat审查之间，草案通常不会改变。第4.4节提供了一步一步的telechat评审任务流程，以及评审任务数据维护的具体细节，评审任务数据反过来保存在评审电子表格中（第5节）。"
    },
    {
      "indent": 0,
      "text": "4.3. Form of Review",
      "section_title": true,
      "zh-CHS": "4.3. 覆核表格"
    },
    {
      "indent": 3,
      "text": "Rather than invent new guidelines, the Gen-ART requirements for the form of a review stole liberally from \"Careful Additional Review of Documents (CARD) by Senior IETF Reviewers (SIRS)\" [SIRS], making adaptations for the special \"late, quick review\" case and the nature of the General Area's concerns.",
      "zh-CHS": "Gen ART审查形式的要求没有发明新的指南，而是从“高级IETF审查员（SIRS）对文件（卡片）的仔细额外审查”[SIRS]中大量剽窃，对特殊的“延迟、快速审查”案例和一般领域关注的性质进行了调整。"
    },
    {
      "indent": 3,
      "text": "Each review must start with a summary statement chosen from or adapted from the following list:",
      "zh-CHS": "每次审查必须以从以下列表中选择或改编的摘要声明开始："
    },
    {
      "indent": 3,
      "text": "o This draft is ready for publication as a [type] RFC, where [type] is Informational, Experimental, etc. (In some cases, the review might recommend publication as a different [type] than requested by the author.)",
      "zh-CHS": "o 该草案已准备好作为[type]RFC发布，其中[type]是信息性的、实验性的等（在某些情况下，审查可能会建议以不同于作者要求的[type]发布）"
    },
    {
      "indent": 3,
      "text": "o This draft is basically ready for publication, but has nits that should be fixed before publication.",
      "zh-CHS": "o 该草案基本上已准备好发布，但在发布前应修复NIT。"
    },
    {
      "indent": 3,
      "text": "o This draft is on the right track but has open issues, described in the review.",
      "zh-CHS": "o 该草案走上了正确的轨道，但仍有未解决的问题，如审查中所述。"
    },
    {
      "indent": 3,
      "text": "o This draft has serious issues, described in the review, and needs to be rethought.",
      "zh-CHS": "o 该草案存在审查中所述的严重问题，需要重新思考。"
    },
    {
      "indent": 3,
      "text": "o This draft has very fundamental issues, described in the review, and further work is not recommended.",
      "zh-CHS": "o 该草案有非常基本的问题，如审查中所述，不建议进一步开展工作。"
    },
    {
      "indent": 3,
      "text": "o Unfortunately, I don't have the expertise to review this draft.",
      "zh-CHS": "o 不幸的是，我没有专业知识来审查这个草案。"
    },
    {
      "indent": 3,
      "text": "The length of a review can vary greatly according to circumstances, and it is considered acceptable for purely editorial comments to be sent privately if it's obvious that the I-D needs substantial revision. All substantive comments, however, must be included in the public review. Wherever possible, comments should be written as suggestions for improvement rather than as simple criticism. Explicit references to prior work and prior IETF discussion should be given whenever possible.",
      "zh-CHS": "根据具体情况，评论的长度可能会有很大的变化，如果I-D显然需要实质性修改，则可以私下发送纯编辑评论。但是，所有实质性意见都必须纳入公共审查。在可能的情况下，评论应作为改进建议而不是简单的批评。应尽可能明确提及之前的工作和IETF讨论。"
    },
    {
      "indent": 3,
      "text": "Reviewers are asked to review for all kinds of problems, such as basic architectural or security issues, Internet-wide impact, technical nits, problems of form and format (such as IANA Considerations or incorrect references), and editorial issues. Since these reviews are on I-Ds that are supposed to be finished, the review should consider \"no issue too small\" -- but should cover the whole range, from the general architectural level to the editorial level.",
      "zh-CHS": "审查人员被要求审查各种问题，如基本架构或安全问题、互联网范围的影响、技术细节、形式和格式问题（如IANA注意事项或不正确的引用）以及编辑问题。由于这些评论是在i-DS上完成的，所以评审应该考虑“没有问题太小”——但是应该涵盖整个范围，从一般的架构级别到编辑级别。"
    },
    {
      "indent": 3,
      "text": "All reviews should apply generally agreed-upon IETF criteria, such as:",
      "zh-CHS": "所有评审均应采用公认的IETF标准，例如："
    },
    {
      "indent": 3,
      "text": "o [RFC1958]: \"Architectural Principles of the Internet\"",
      "zh-CHS": "o [RFC1958]：“互联网的架构原则”"
    },
    {
      "indent": 3,
      "text": "o [RFC3426]: \"General Architectural and Policy Considerations\"",
      "zh-CHS": "o [RFC3426]：“总体架构和策略考虑”"
    },
    {
      "indent": 3,
      "text": "o [RFC3439]: \"Some Internet Architectural Guidelines and Philosophy\"",
      "zh-CHS": "o [RFC3439]：“一些互联网架构指南和理念”"
    },
    {
      "indent": 3,
      "text": "o ID-Checklist: The \"ID checklist\" document maintained by the IESG",
      "zh-CHS": "o ID清单：由IESG维护的“ID清单”文件"
    },
    {
      "indent": 3,
      "text": "o [RFC2223bis]: \"Instructions to Request for Comments (RFC) Authors\" as updated by [RFC-STYLE]: \"RFC Document Style\"",
      "zh-CHS": "o [RFC2223bis]：“征求意见（RFC）作者须知”由[RFC-STYLE]更新：“RFC文档样式”"
    },
    {
      "indent": 3,
      "text": "o [RFC5226]: BCP 26 - \"Guidelines for Writing an IANA Considerations Section in RFCs\"",
      "zh-CHS": "o [RFC5226]：BCP 26-“在RFCs中编写IANA注意事项部分的指南”"
    },
    {
      "indent": 3,
      "text": "o [RFC3552]: BCP 72 - \"Guidelines for Writing RFC Text on Security Considerations\"",
      "zh-CHS": "o [RFC3552]：BCP 72-“关于安全注意事项的RFC文本编写指南”"
    },
    {
      "indent": 3,
      "text": "o Any other applicable architectural or procedural documents. It is considered important that reviews give precise references to such criteria when relevant to a comment.",
      "zh-CHS": "o 任何其他适用的建筑或程序文件。重要的是，当与评论相关时，审查应准确参考此类标准。"
    },
    {
      "indent": 3,
      "text": "Of special interest to the General area, because they do not fall under any other area, are:",
      "zh-CHS": "由于不属于任何其他区域，一般区域特别感兴趣的是："
    },
    {
      "indent": 3,
      "text": "o A clear description of why the I-D or protocol is useful to the Internet.",
      "zh-CHS": "o 清楚地说明为什么I-D或协议对Internet有用。"
    },
    {
      "indent": 3,
      "text": "o Adherence to IETF formalities, such as capitalized \"must\", \"should\", etc. in normative statements, per the ID-Checklist.",
      "zh-CHS": "o 根据ID检查表，遵守IETF程序，如规范性声明中大写的“必须”、“应该”等。"
    },
    {
      "indent": 3,
      "text": "o Useful and reasonable IANA considerations. Ensure that all necessary registries are defined/referenced, and ensure definition and compliance with IANA assignment criteria.",
      "zh-CHS": "o 有用且合理的IANA注意事项。确保定义/引用了所有必要的注册，并确保定义和遵守IANA分配标准。"
    },
    {
      "indent": 3,
      "text": "o Correct dependencies for normative references.",
      "zh-CHS": "o 更正规范性引用的依赖关系。"
    },
    {
      "indent": 3,
      "text": "o That the I-D is written in reasonably clear English.",
      "zh-CHS": "o I-D是用相当清晰的英语书写的。"
    },
    {
      "indent": 3,
      "text": "o Checking the updates/obsoletes information.",
      "zh-CHS": "o 检查更新/淘汰信息。"
    },
    {
      "indent": 3,
      "text": "o Running idnits and checking the output.",
      "zh-CHS": "o 运行idnits并检查输出。"
    },
    {
      "indent": 3,
      "text": "o Checking that things imported by reference, especially from other RFCs, make sense (notably definitions of terms, security considerations, and lists of criteria) and ensuring they are used as intended by the referenced document.",
      "zh-CHS": "o 检查通过引用导入的内容，特别是从其他RFC导入的内容是否有意义（尤其是术语定义、安全注意事项和标准列表），并确保它们按照引用文件的预期使用。"
    },
    {
      "indent": 3,
      "text": "o That examples (e.g., Fully Qualified Domain Names (FQDNs), telephone numbers, IP addresses) are taken from the right spaces.",
      "zh-CHS": "o 示例（例如，完全限定域名（FQDN）、电话号码、IP地址）取自正确的空间。"
    },
    {
      "indent": 0,
      "text": "4.4. Gen-ART Process Overview",
      "section_title": true,
      "zh-CHS": "4.4. Gen ART工艺概述"
    },
    {
      "indent": 3,
      "text": "The following provides a general overview of the Gen-ART process along with some basic rules associated with assignments. The very precise details of the secretary's process are provided in Section 5.",
      "zh-CHS": "以下概述了Gen ART流程以及与作业相关的一些基本规则。第5节详细介绍了秘书的工作流程。"
    },
    {
      "indent": 3,
      "text": "o The availability of reviewers and the order of assignments for the next round of Last Call document assignments are updated weekly and are available on the directory where all the assignments and reviews are cached.",
      "zh-CHS": "o 审核人的可用性和下一轮最后通话文档分配的分配顺序每周更新一次，并可在缓存所有分配和审核的目录中找到。"
    },
    {
      "indent": 3,
      "text": "o At telechat assignment time, all previously reviewed I-Ds are assigned to the reviewer who reviewed them previously, assuming that reviewer is available. Otherwise, these I-Ds are assigned to a new person in the process described below.",
      "zh-CHS": "o 在telechat分配时间，所有先前审核的I-D都分配给先前审核过的审核人，假设审核人可用。否则，这些I-d将在下面描述的过程中分配给一个新人。"
    },
    {
      "indent": 3,
      "text": "o The secretary attempts to avoid assigning I-Ds that might conflict with other IETF roles such as WG chairs, other directorates, etc. However, in the cases where the secretary doesn't note the conflict, the reviewer should notify the secretary and Gen-ART mailing list so another reviewer may be assigned.",
      "zh-CHS": "o 秘书长试图避免分配可能与其他IETF角色（如工作组主席、其他董事会等）冲突的I-D。但是，如果秘书长没有注意到冲突，审核人应通知秘书长和Gen ART邮件列表，以便可以分配其他审核人。"
    },
    {
      "indent": 3,
      "text": "o It should be emphasized that assignment is never made according to a reviewer's technical specialty. Even though it happens, when, for example, routing I-Ds fall on routing experts or MIB documents fall on MIB doctors, it is coincidental. To the reviewer, the choice looks random.",
      "zh-CHS": "o 应该强调的是，决不能根据评审员的技术专长进行分配。即使发生这种情况，例如，当路由I-D落在路由专家或MIB文档落在MIB医生身上时，这也是巧合。在评论者看来，选择似乎是随机的。"
    },
    {
      "indent": 3,
      "text": "o There is an attempt to evenly distribute I-Ds amongst reviewers at LC time by using a round-robin process, starting from where the previous week's assignments stopped.",
      "zh-CHS": "o 从上周作业停止的地方开始，通过循环过程，尝试在LC时间将I-D平均分配给评审员。"
    },
    {
      "indent": 3,
      "text": "o Typically, there is no attempt made to actually equalize the load, as the length and complexity of the I-Ds are not taken into account in this process. (Thus, a reviewer could end up with a couple of hundred-page I-Ds, but this is statistically rare.) However, in the case of a reviewer that might receive more than one new LC I-D at one time, the secretary does try to ensure that both are not large I-Ds.",
      "zh-CHS": "o 通常，没有尝试实际均衡负载，因为在该过程中没有考虑I-d的长度和复杂性。（因此，一名审查员最终可能会得到几百页的ID，但这在统计上是罕见的。）但是，如果审查员一次可能收到多个新的LC ID，部长会尽力确保这两个ID都不是大的I-D。"
    },
    {
      "indent": 3,
      "text": "o Once the assignments are made, the web pages that list the reviews and the assignments are posted. Since the telechat agenda is not published until the end of the day on the Thursdays prior to the telechats (i.e., one week prior), the secretary needs to complete the assignments on that Thursday evening. This often requires working later in the evening and also requires an Internet connection even when traveling.",
      "zh-CHS": "o 完成作业后，将发布列出评论和作业的网页。由于telechat议程在telechats之前的星期四（即一周前）结束时才公布，因此秘书需要在该星期四晚上完成作业。这通常需要在晚上晚些时候工作，甚至在旅行时也需要连接互联网。"
    },
    {
      "indent": 3,
      "text": "o If the reviewers notice any problems or conflict of interest, a bargaining process, shifting I-Ds from one reviewer to another, takes place. The secretary updates the assignment files with any new assignments.",
      "zh-CHS": "o 如果审查人员发现任何问题或利益冲突，则会进行谈判过程，将ID从一名审查人员转移到另一名审查人员。秘书用任何新的任务更新任务文件。"
    },
    {
      "indent": 3,
      "text": "o Once the review has been completed, the reviewer sends the review to the Gen-ART list, ideally using the template provided in the review assignment emails. Typically, reviews are also sent to authors, the responsible AD, and the WG chairs/document shepherd. The only case where this might not be done is when there are no issues found for a re-review and none had been found on an initial review. Sending the review to the authors, ADs, and/or WG chairs/ Proto Shepherds was originally voluntary but is now considered standard practice. Reviewers may also send the reviews to the IETF discussion list, but that is entirely at the discretion of the reviewer, in which case the author must be copied on the review to ensure they see any follow-up discussion. Reviewers may also send the comments to the WG; however, this typically causes the review to end up in the moderation queue, as most reviewers do not want to subscribe to the WG lists for the I-Ds they review. Thus, it is expected that any of the original recipients (i.e., authors, WG chairs/document shepherd, or responsible AD) may forward the review to the WG mailing list if they believe it is necessary. In the past, sending these reviews resulted in confusion among the authors, who may not have been expecting a Gen-ART review and may not be familiar with Gen-ART. Thus, reviewers are reminded to prepend to the email the description of Gen-ART and the purpose of the review. This information is part of the standard template provided in the review assignment emails.",
      "zh-CHS": "o 评审完成后，评审员将评审发送至Gen ART列表，最好使用评审分配电子邮件中提供的模板。通常，评审也会发送给作者、负责的广告和工作组主席/文档管理员。唯一不能这样做的情况是，没有发现需要重新审查的问题，也没有在初始审查中发现问题。将评论发送给作者、广告和/或工作组主席/原始牧羊人最初是自愿的，但现在被视为标准做法。评审员也可以将评审发送到IETF讨论列表，但这完全由评审员决定，在这种情况下，必须在评审时抄送作者，以确保他们看到任何后续讨论。评审员也可以将意见发送给工作组；然而，这通常会导致审核最终进入审核队列，因为大多数审核人不想订阅他们审核的I-D的工作组列表。因此，预计任何原始收件人（即作者、工作组主席/文件保管人或负责广告）如果认为有必要，可将审查转发给工作组邮件列表。在过去，发送这些评论会导致作者之间的混淆，他们可能并不期待Gen ART评论，也可能不熟悉Gen ART。因此，提醒评审员在电子邮件中预先说明Gen ART的说明和评审目的。此信息是评审任务电子邮件中提供的标准模板的一部分。"
    },
    {
      "indent": 3,
      "text": "o The secretary gathers the reviews, sometimes edits them for format, and records the review in the spreadsheet on the web pages, including the synopsis. This is typically done on Thursday. This is one aspect of the process that can be easily delegated such that one volunteer uploads all the reviews and then the secretary need only update the fields in the spreadsheet. If the reviewer has not provided a synopsis (\"Summary\" field in the template), the secretary makes a best guess based on the review details. Note that in most cases the reviewers do include a synopsis.",
      "zh-CHS": "o 秘书收集评审，有时编辑评审的格式，并将评审记录在网页的电子表格中，包括概要。这通常在周四完成。这是流程的一个方面，可以很容易地授权，一名志愿者上传所有审查，然后秘书只需更新电子表格中的字段。如果审核人未提供概要（“模板中的摘要”字段），秘书将根据审核细节做出最佳猜测。请注意，在大多数情况下，审阅者都会提供一份摘要。"
    },
    {
      "indent": 3,
      "text": "o Ideally, the reviews should be posted to the Gen-ART mailing list by close of business on the East coast on Tuesday. This is necessary to allow the General AD time to consider the reviews prior to the telechat. If the reviews are received after Tuesday, the review may not be read by the AD before the IESG telechat. Due to time constraints, the spreadsheets containing review summaries/assignments are only updated on Thursday evenings when",
      "zh-CHS": "o 理想情况下，评论应该在周二东海岸停业前发布到Gen ART邮件列表中。这是必要的，以允许一般的广告时间考虑在聊天之前的评论。如果评论是在周二之后收到的，那么在IESG电视会议之前，广告可能不会阅读评论。由于时间限制，包含审核总结/作业的电子表格仅在周四晚上更新，届时"
    },
    {
      "indent": 6,
      "text": "the new LC assignments and upcoming telechat assignments are done. Ideally, the reviews would get uploaded on the Tuesdays prior to the telechat along with the updated spreadsheets.",
      "zh-CHS": "新的LC作业和即将到来的telechat作业已完成。理想情况下，这些评论会在周二电视帽发布前上传，并附上最新的电子表格。"
    },
    {
      "indent": 3,
      "text": "o If the AD concludes that the concerns raised by the reviewer warrant placing a DISCUSS comment on the I-D, the AD will do so, and the DISCUSS must be resolved before the I-D advances. Usually, the reviewer will be involved in the resolution process, but the responsibility for the DISCUSS rests with the AD.",
      "zh-CHS": "o 如果广告认为评审员提出的问题有理由对I-D提出讨论意见，广告将这样做，并且必须在I-D推进之前解决讨论。通常，评审员将参与解决过程，但讨论的责任在于广告。"
    },
    {
      "indent": 0,
      "text": "5. Secretarial Process",
      "section_title": true,
      "zh-CHS": "5. 秘书程序"
    },
    {
      "indent": 3,
      "text": "This section summarizes the details of managing the review materials, including the spreadsheet used to track all reviews and the HTML files containing the review assignments. Please note that these details represent a snapshot of a process that has been implemented -- the details are very likely to change over time, in particular as the needed improvements highlighted in Section 8 are carried out.",
      "zh-CHS": "本节总结了管理评审材料的详细信息，包括用于跟踪所有评审的电子表格和包含评审分配的HTML文件。请注意，这些详细信息代表已实施流程的快照——这些详细信息很可能随着时间的推移而改变，特别是在执行第8节中强调的所需改进时。"
    },
    {
      "indent": 0,
      "text": "5.1. Maintaining Review Spreadsheet",
      "section_title": true,
      "zh-CHS": "5.1. 维护审核电子表格"
    },
    {
      "indent": 3,
      "text": "A spreadsheet is used to enter all the I-Ds at the time of assignment and to capture all the reviews. For IETF LC assignments, the assignments are completed before adding the I-Ds to the spreadsheet as described in Section 5.2. For telechat assignments, I-Ds are obviously only added in the cases where there is no previous LC assignment. For the other I-Ds, the appropriate fields are updated as described in Section 5.3.",
      "zh-CHS": "电子表格用于输入分配时的所有ID，并捕获所有审查。对于IETF LC分配，分配在将I-D添加到电子表格之前完成，如第5.2节所述。对于telechat分配，I-D显然只在之前没有LC分配的情况下添加。对于其他I-D，按照第5.3节所述更新相应字段。"
    },
    {
      "indent": 3,
      "text": "All the reviews can be accessed from the spreadsheet via hyperlinks from specific fields, as summarized below. The following information is maintained in the spreadsheet (in the order listed):",
      "zh-CHS": "所有审查都可以通过特定字段的超链接从电子表格中访问，总结如下。以下信息保存在电子表格中（按列出的顺序）："
    },
    {
      "indent": 3,
      "text": "1. \"Chat/LC Date\": Indicates either the date on which the LC review is due or the date of the telechat.",
      "zh-CHS": "1. “聊天/信用证日期”：表示信用证审查到期的日期或telechat的日期。"
    },
    {
      "indent": 3,
      "text": "2. \"Document\": Filename for the I-D, which includes a hyperlink to the IETF I-D tracker.",
      "zh-CHS": "2. “文档”：I-D的文件名，其中包括指向IETF I-D跟踪器的超链接。"
    },
    {
      "indent": 3,
      "text": "3. \"Assigned\": Name of the reviewer assigned to that I-D.",
      "zh-CHS": "3. “已分配”：分配给该ID的审核人的姓名。"
    },
    {
      "indent": 3,
      "text": "4. \"Category\": This field contains one of the following self-explanatory values: \"Doc - WG\", \"Doc - Ind/AD\", or \"IETF LC\". Note that Gen-ART does not review I-Ds submitted directly to the RFC Editor. The \"IETF LC\" value is of course entered for all I-Ds at LC time. It is changed to one of the other appropriate values, based on the information in the telechat agenda.",
      "zh-CHS": "4. “类别”：此字段包含以下自解释值之一：“Doc-WG”、“Doc-Ind/AD”或“IETF LC”。请注意，Gen ART不会审查直接提交给RFC编辑器的I-D。当然，在LC时间为所有I-D输入“IETF LC”值。根据telechat议程中的信息，将其更改为其他适当的值之一。"
    },
    {
      "indent": 3,
      "text": "5. \"Previous Review\": This includes a link to any previous reviews. For example, when a doc appears on a telechat agenda, if an IETF LC review was done, this field is updated with the review summary for the LC review (i.e., the information from the \"Current Review Summary\" as described below is copied to this column). The field is set to \"New\" when an I-D is first assigned/added to the spreadsheet. In the case of returns, this field has a value of \"Return\" or \"Return/IETF-LC\" for I-Ds for which there is an LC review. It should be noted that since Gen-ART started doing reviews at LC time, there seem to be far fewer returns on the agenda.",
      "zh-CHS": "5. “以前的审查”：这包括到任何以前审查的链接。例如，当文件出现在telechat议程上时，如果完成了IETF LC审查，则该字段将使用LC审查的审查摘要进行更新（即，将下面描述的“当前审查摘要”中的信息复制到此列）。首次向电子表格分配/添加I-D时，该字段设置为“新建”。在返回的情况下，该字段的值为“Return”或“Return/IETF-LC”，用于有LC审查的I-Ds。应该注意的是，由于Gen ART在LC时间开始进行审查，议程上的回报似乎要少得多。"
    },
    {
      "indent": 3,
      "text": "6. \"Current Review Summary\": This field includes the review type and version number of the document that is to be reviewed or has been reviewed (e.g., LC: -02). When the field also contains a review summary after the review type/version number (e.g., Telechat: -06 Ready), the active hyperlink points to the review. Occasionally, a reviewer will re-review an I-D prior to its telechat assignment, in which case it is added to the spreadsheet, but the date does not change to maintain consistency in the date field, since the reviews themselves contain the review date.",
      "zh-CHS": "6. “当前审核摘要”：该字段包括待审核或已审核文件的审核类型和版本号（例如LC:-02）。如果该字段在审阅类型/版本号之后还包含审阅摘要（例如，Telechat:-06 Ready），则活动超链接将指向审阅。有时，审核人会在分配telechat之前重新审核ID，在这种情况下，ID会添加到电子表格中，但日期不会更改以保持日期字段的一致性，因为审核本身包含审核日期。"
    },
    {
      "indent": 3,
      "text": "The following summarizes the steps to add a new I-D to the spreadsheet:",
      "zh-CHS": "以下总结了将新I-D添加到电子表格的步骤："
    },
    {
      "indent": 3,
      "text": "1. In order to optimize steps, blank rows are first inserted for the number of new I-Ds to be added.",
      "zh-CHS": "1. 为了优化步骤，首先为要添加的新I-D的数量插入空行。"
    },
    {
      "indent": 3,
      "text": "2. To minimize data entry, a row with default fields (including the hyperlinks) is kept at the end of the file. There is a separate default row for IETF LC versus telechat assignments. This row is copied into each of the new blank rows. The dates are then entered (this allows double-checking that all I-Ds from the review assignments are accounted for, especially LC).",
      "zh-CHS": "2. 为了最大限度地减少数据输入，在文件末尾保留一个带有默认字段（包括超链接）的行。IETF LC与telechat分配有一个单独的默认行。此行将复制到每个新的空行中。然后输入日期（这允许双重检查来自审查任务的所有I-D，尤其是LC）。"
    },
    {
      "indent": 3,
      "text": "3. The I-D name is then copied to the name field as well as being appended to the hyperlink for the \"Review Summary\" field. The hyperlink is included as part of the default row. This minimizes the steps to enter the reviews in the spreadsheet.",
      "zh-CHS": "3. 然后将ID名称复制到“名称”字段，并附加到“审阅摘要”字段的超链接中。超链接包含在默认行中。这将最小化在电子表格中输入评论的步骤。"
    },
    {
      "indent": 3,
      "text": "4. The data is also sorted by \"Chat/LC Date\", \"Assigned\", and \"Document\". The file is then saved and closed.",
      "zh-CHS": "4. 数据还按“聊天/信用证日期”、“分配”和“文件”进行排序。然后保存并关闭该文件。"
    },
    {
      "indent": 3,
      "text": "5. The file is then reopened and saved as HTML.",
      "zh-CHS": "5. 然后重新打开该文件并将其保存为HTML。"
    },
    {
      "indent": 3,
      "text": "6. The file is opened a second time and sorted by \"Assigned\", \"Chat/LC Date\", and \"Document\" to provide the I-D reviewers an easy way to find any outstanding assignments.",
      "zh-CHS": "6. 第二次打开该文件，并按“已分配”、“聊天/信用证日期”和“文档”进行排序，以便I-D审核人员能够轻松找到任何未完成的任务。"
    },
    {
      "indent": 0,
      "text": "5.2. Last Call Assignment Procedure",
      "section_title": true,
      "zh-CHS": "5.2. 最后呼叫分配程序"
    },
    {
      "indent": 3,
      "text": "The secretary can cache the Last Call assignments as they are announced and/or check the IETF announcement mailing list archives. The assignments are done on Thursday evening, along with any telechat assignments. This optimizes the process in terms of batch changes to files.",
      "zh-CHS": "秘书可以在最后一次呼叫分配被宣布时将其缓存和/或检查IETF公告邮件列表档案。作业在周四晚上完成，同时还有任何telechat作业。这在批量更改文件方面优化了流程。"
    },
    {
      "indent": 3,
      "text": "The assignments are listed in an HTML file. The following are the steps in creating that file:",
      "zh-CHS": "作业列在HTML文件中。以下是创建该文件的步骤："
    },
    {
      "indent": 3,
      "text": "1. The order of assignment is actually created the week before, with the details below. Thus, before starting the new assignments, the current file is saved for editing for the following week. The current file-naming convention is \"reviewersyymmdd-lc.html\" (e.g., for July 8th, 2010, the file reviewers100708-lc.html was created, and the file for the following week is named reviewers100715-lc.html).",
      "zh-CHS": "1. 作业顺序实际上是在前一周创建的，详情如下。因此，在开始新作业之前，将保存当前文件以供下周编辑。当前的文件命名约定为“reviewersyymmdd lc.html”（例如，2010年7月8日，创建了文件Reviewer100708-lc.html，下周的文件名为Reviewer100715 lc.html）。"
    },
    {
      "indent": 3,
      "text": "2. Since the file is already prepared with the appropriate ordering of reviewers, the assignments are done in the order of due dates. The link to the I-D in the Datatracker is copied into the assignment file along with the intended RFC status for each of the new LC I-Ds.",
      "zh-CHS": "2. 由于该文件已经按照审稿人的适当顺序准备好，因此作业是按照截止日期的顺序完成的。Datatracker中I-D的链接与每个新LC I-D的预期RFC状态一起复制到分配文件中。"
    },
    {
      "indent": 3,
      "text": "3. The \"Due Date\" paragraph from the Last Call announcement is shortened as follows: \"IETF LC ends on:\", keeping the date.",
      "zh-CHS": "3. 上次通话公告中的“截止日期”一段缩短如下：“IETF LC结束日期：”，保留日期。"
    },
    {
      "indent": 3,
      "text": "4. Once the assignment file is complete, the new I-Ds are added to the spreadsheet as described above.",
      "zh-CHS": "4. 分配文件完成后，新的I-D将如上所述添加到电子表格中。"
    },
    {
      "indent": 3,
      "text": "5. The assignment file for the next week is then updated to reflect the next reviewer in the round-robin process, by simply cutting and pasting the names in the list in a block and removing any \"one doc per month\" reviewers (annotated with an \"*\") that have already received their monthly assignment. If the next round of assignments occurs at the beginning of a new month, the \"one doc per month\" reviewers are added back into the list (in the normal order -- alphabetically by first name).",
      "zh-CHS": "5. 然后更新下周的工作分配文件，以反映循环过程中的下一位审阅者，方法是简单地将列表中的姓名剪切并粘贴到一个块中，并删除任何已收到每月工作分配的“每月一份”审阅者（用“*”注释）。如果下一轮作业发生在新月初，则“每月一个文档”审阅者将重新添加到列表中（按正常顺序-按名字的字母顺序）。"
    },
    {
      "indent": 3,
      "text": "6. The assignment files and updated spreadsheets are then cached on the Gen-ART server.",
      "zh-CHS": "6. 分配文件和更新的电子表格随后缓存在Gen ART服务器上。"
    },
    {
      "indent": 3,
      "text": "7. An email providing a link to the assignment file along with the updated spreadsheets is sent to the Gen-ART mailing list. This email has a standard form, such that the reviewers can simply cut and paste the template to include the Gen-ART context statement and link to the FAQ.",
      "zh-CHS": "7. 向Gen ART邮件列表发送一封电子邮件，其中提供了到分配文件的链接以及更新的电子表格。这封电子邮件有一个标准的表单，因此，评论员可以简单地剪切和粘贴模板，以包含Gen ART上下文声明和FAQ链接。"
    },
    {
      "indent": 0,
      "text": "5.3. Telechat Assignment Procedure",
      "section_title": true,
      "zh-CHS": "5.3. 电信帽分配程序"
    },
    {
      "indent": 3,
      "text": "Since LC assignments are now the starting point for Gen-ART I-D reviews, the telechat assignments are generally straightforward, as the majority of the I-Ds are already in the spreadsheet. The following details the steps:",
      "zh-CHS": "由于LC分配现在是Gen ART I-D审查的起点，telechat分配通常很简单，因为大部分I-D已经在电子表格中。以下详细说明了这些步骤："
    },
    {
      "indent": 3,
      "text": "1. The telechat agenda is typically available around 6PM PDT. In order to create the assignment HTML file, the agenda is created from the email announcing the upcoming telechat agenda. The filename has the following format, with the date corresponding to the telechat date (versus the date of assignment, as is the case for Last Call assignments): \"reviewersyymmdd.html\".",
      "zh-CHS": "1. telechat议程通常在太平洋夏令时下午6点左右提供。为了创建作业HTML文件，将从宣布即将到来的telechat日程的电子邮件中创建日程。文件名的格式如下，日期与telechat日期相对应（与上次通话分配的情况一样，与分配日期相对）：“reviewersyymmdd.html”。"
    },
    {
      "indent": 3,
      "text": "2. Rows are added to the agenda for the reviewers' names.",
      "zh-CHS": "2. 将为审阅者的姓名将行添加到议程中。"
    },
    {
      "indent": 3,
      "text": "3. The reviewers' names are then added to the weekly assignment file.",
      "zh-CHS": "3. 然后将审阅者的姓名添加到每周作业文件中。"
    },
    {
      "indent": 3,
      "text": "4. As each reviewer is added to the assignment file, the review spreadsheet is updated as follows:",
      "zh-CHS": "4. 随着每个审阅者添加到分配文件，审阅电子表格将更新如下："
    },
    {
      "indent": 7,
      "text": "* \"Chat/LC Date\" is changed to the telechat date.",
      "zh-CHS": "* “聊天/信用证日期”更改为telechat日期。"
    },
    {
      "indent": 7,
      "text": "* The link to the LC review, if available, is copied as the link for the \"Previous Review\" column.",
      "zh-CHS": "* LC审查的链接（如果可用）复制为“先前审查”列的链接。"
    },
    {
      "indent": 7,
      "text": "* The \"text\" for the \"Current Review\" is updated to reflect the new review type (i.e., Telechat) and version.",
      "zh-CHS": "* 更新“当前审查”的“文本”，以反映新的审查类型（即Telechat）和版本。"
    },
    {
      "indent": 3,
      "text": "5. In the case of an I-D that did not go through IETF LC, a reviewer is assigned using the order in the file to be used for Last Call assignments for the next week.",
      "zh-CHS": "5. 对于未通过IETF LC的I-D，将使用文件中用于下周最后一次呼叫分配的顺序分配审核人。"
    },
    {
      "indent": 3,
      "text": "6. Once the reviewer(s) have been determined, the LC assignment file for the next week is updated.",
      "zh-CHS": "6. 确定审核人后，更新下周的LC分配文件。"
    },
    {
      "indent": 3,
      "text": "7. Any new I-Ds are then added to the spreadsheet (and the updates saved) per the steps described in Section 5.1.",
      "zh-CHS": "7. 然后，按照第5.1节中描述的步骤，将任何新的I-D添加到电子表格中（并保存更新）。"
    },
    {
      "indent": 3,
      "text": "8. The assignment files and updated spreadsheets are then cached on the Gen-ART server.",
      "zh-CHS": "8. 分配文件和更新的电子表格随后缓存在Gen ART服务器上。"
    },
    {
      "indent": 3,
      "text": "9. An email providing a link to the assignment file along with the updated spreadsheets is sent to the Gen-ART mailing list. This email has a standard form, such that the reviewers can simply cut and paste the template to include the Gen-ART context statement and link to the FAQ.",
      "zh-CHS": "9. 向Gen ART邮件列表发送一封电子邮件，其中提供了到分配文件的链接以及更新的电子表格。这封电子邮件有一个标准的表单，因此，评论员可以简单地剪切和粘贴模板，以包含Gen ART上下文声明和FAQ链接。"
    },
    {
      "indent": 0,
      "text": "5.4. Capturing Reviews",
      "section_title": true,
      "zh-CHS": "5.4. 获取评论"
    },
    {
      "indent": 3,
      "text": "As noted in Section 4.4, the spreadsheet is typically updated with the review summaries on Thursday evenings just prior to entering the data for that week's LC and any telechat assignments. The following summarizes the steps to capture the reviews:",
      "zh-CHS": "如第4.4节所述，电子表格通常在周四晚上在输入该周LC和任何telechat作业的数据之前更新审查摘要。以下总结了获取评论的步骤："
    },
    {
      "indent": 3,
      "text": "1. Currently, an additional volunteer is assisting the secretary in caching the email reviews as they arrive.",
      "zh-CHS": "1. 目前，另一名志愿者正在协助秘书在邮件评论到达时缓存邮件评论。"
    },
    {
      "indent": 3,
      "text": "2. In the cases where the review is included inline in the body of the email, the review is cut and pasted into a text file and saved with the reviewer's last name appended to the filename -- e.g., draft-ietf-xyz-00-smith.txt.",
      "zh-CHS": "2. 如果审阅内容包含在电子邮件正文中，则会将审阅内容剪切并粘贴到文本文件中，并将审阅者的姓氏附加到文件名后保存--例如，draft-ietf-xyz-00-smith.txt。"
    },
    {
      "indent": 3,
      "text": "3. In the case where the review is included as an attachment to the email, the file can be directly saved and uploaded.",
      "zh-CHS": "3. 如果评论作为电子邮件附件包含，则可以直接保存和上载该文件。"
    },
    {
      "indent": 3,
      "text": "4. The volunteer uploads the reviews by around 5PM CST on Thursdays; thus, they are available to the secretary at the time that week's assignments are done. This sequence is necessary to ensure the information for I-Ds on the upcoming telechat is up to date.",
      "zh-CHS": "4. 志愿者在周四下午5点左右上传评论；因此，在完成一周的作业时，秘书可以使用这些文件。此序列对于确保即将到来的telechat上的I-Ds信息是最新的是必要的。"
    },
    {
      "indent": 3,
      "text": "5. The review summary is entered into the \"Current Summary\" field. Note that the hyperlink to the review (added at assignment time) will automatically work when the file is uploaded.",
      "zh-CHS": "5. 审查摘要将输入“当前摘要”字段。请注意，文件上载时，到审阅的超链接（在分配时间添加）将自动工作。"
    },
    {
      "indent": 3,
      "text": "6. Once all the reviews have been entered and the spreadsheets formatted, the review spreadsheet is saved and files uploaded per the last three steps in Section 5.1.",
      "zh-CHS": "6. 输入所有审核并格式化电子表格后，将按照第5.1节最后三个步骤保存审核电子表格并上传文件。"
    },
    {
      "indent": 0,
      "text": "6. Results",
      "section_title": true,
      "zh-CHS": "6. 后果"
    },
    {
      "indent": 3,
      "text": "Over the past 7 years, the Gen-ART has provided reviewing services to 3 ADs and has done around two thousand publicly available reviews. The reviews have been executed with a team of around a dozen full-time reviewers and other reviewers receiving one I-D assignment each month. There are currently 9 reviewers in the latter category. The full-time reviewers receive 2-3 assignments each month. In terms of improving quality, the number of I-Ds that are now \"Ready\" at the time of the telechat (since the reviews are now initiated at LC time) has increased. The review term \"Ready\" means the reviewer believes that the document has no outstanding editorial or technical issues. Based on the data from 2007, there were over 250 I-Ds assigned at LC time that went through IESG review. Of those 250 I-Ds, 82% of the LC reviews (205 I-Ds) were completed. Of the completed reviews, 70% (144 I-Ds) were \"Ready\" at the time of the telechat. Of those 144 I-Ds, roughly 1/4 had been deemed \"Ready\" (with no nits) at LC time",
      "zh-CHS": "在过去的7年里，Gen ART为3个广告提供了评论服务，并做了大约2000篇公开评论。评审由大约12名全职评审员组成，其他评审员每月接受一次I-D任务。后一类目前有9名审稿人。全职评审员每月收到2-3份作业。在提高质量方面，在telechat时“准备就绪”的I-D数量有所增加（因为审查现在在LC时间启动）。评审术语“准备就绪”是指评审员认为文件没有未决的编辑或技术问题。根据2007年的数据，在LC时间分配的I-D超过250个，通过了IESG审查。在这250个I-D中，82%的LC审查（205个I-D）已完成。在完成的审查中，70%（144个I-D）在telechat发布时已“准备就绪”。在这144个I-D中，约有1/4在LC时被视为“就绪”（无NIT）"
    },
    {
      "indent": 3,
      "text": "(based on a sample of 50 reviews). For the I-Ds that were not reviewed at LC time, only about 1/4 of those were deemed \"Ready\" when they were reviewed for the telechat. So, doing the Gen-ART reviews at Last Call time does seem to improve the quality of the I-Ds for the telechat.",
      "zh-CHS": "（基于50篇评论的样本）。对于LC时未审查的I-D，只有约1/4的I-D在审查telechat时被视为“准备就绪”。因此，在最后一次通话时进行Gen ART审查似乎确实可以提高telechat的I-D质量。"
    },
    {
      "indent": 0,
      "text": "7. Impressions",
      "section_title": true,
      "zh-CHS": "7. 印象"
    },
    {
      "indent": 3,
      "text": "This section is divided into 3 subsections: the impressions as gathered from the Gen-ART, the impressions of the ADs for whom they worked, and the impressions of the secretaries of Gen-ART.",
      "zh-CHS": "本节分为3个小节：从Gen ART收集的印象、他们为之工作的广告的印象以及Gen ART秘书的印象。"
    },
    {
      "indent": 0,
      "text": "7.1. Reviewers' Impressions",
      "section_title": true,
      "zh-CHS": "7.1. 评论员的印象"
    },
    {
      "indent": 3,
      "text": "The following list of comments are excerpted and edited from comments sent in by the reviewers of Gen-ART in response to the request:",
      "zh-CHS": "以下评论列表摘自Gen ART评审员根据请求发送的评论并进行编辑："
    },
    {
      "indent": 3,
      "text": "\"We'd like to ask you each to write a few lines about your personal experience and lessons learned as a Gen-ART reviewer\".",
      "zh-CHS": "“我们想请你们每人写几句话，谈谈你们作为艺术评论家的个人经历和经验教训。”。"
    },
    {
      "indent": 3,
      "text": "o We really do find problems, but we don't find problems with most I-Ds.",
      "zh-CHS": "o 我们确实发现了问题，但大多数I-D都没有发现问题。"
    },
    {
      "indent": 3,
      "text": "o Comments seem to be in three areas: editorial/grammar, editorial/ what-the-heck-does-this-mean, and actual problems. I'm seeing fewer reviews in the first category, which is a good thing.",
      "zh-CHS": "o 评论似乎有三个方面：编辑/语法，编辑/这到底意味着什么，以及实际问题。我在第一类中看到的评论越来越少，这是一件好事。"
    },
    {
      "indent": 3,
      "text": "o It is becoming rarer that we hear back \"these guys have suffered enough; I'm voting no objection\" (I'm remembering an LDAP I-D that had been around so long it had 2119 referenced AS A DRAFT -- some people suffered a lot).",
      "zh-CHS": "o 越来越少的是，我们听到“这些家伙已经受够了；我投反对票”（我记得一个LDAP I-D存在了这么久，它被2119作为草稿引用——有些人受够了）。"
    },
    {
      "indent": 3,
      "text": "o The direct assignment of reviews is necessary and effective. It does not matter much as far as I can tell what scheme is used to actually do the assignment.",
      "zh-CHS": "o 审查的直接分配是必要和有效的。就我所知，这并不重要，实际上是用什么方案来做作业的。"
    },
    {
      "indent": 3,
      "text": "o Folks are very open to the reviews that come out of Gen-ART. This somewhat surprised me, because I have seen resistance to outside reviews in other cases.",
      "zh-CHS": "o 人们对来自Gen ART的评论非常开放。这让我有些吃惊，因为我在其他情况下也看到了对外部评论的抵制。"
    },
    {
      "indent": 3,
      "text": "o The improvements that have come about (for example, one of my latest, an I-D about the SIPPING conference) have made a big difference to the comprehensibility and usability of the I-Ds -- and provide a useful incentive to keep going.",
      "zh-CHS": "o 所带来的改进（例如，我最近的一个关于啜饮会议的I-D）对I-D的可理解性和可用性产生了巨大的影响，并提供了继续进行下去的有效激励。"
    },
    {
      "indent": 3,
      "text": "o Some form of review like this is desperately needed. While most of the stuff we see is good, every once in a while really bad errors have made their way all the way to IESG vote.",
      "zh-CHS": "o 迫切需要某种形式的审查。虽然我们看到的大多数东西都是好的，但偶尔也会有一些非常糟糕的错误出现在IESG的投票中。"
    },
    {
      "indent": 3,
      "text": "o Reading this stuff is interesting. I like having a reason to read a wide range of materials.",
      "zh-CHS": "o 读这些东西很有趣。我喜欢有理由阅读各种各样的材料。"
    },
    {
      "indent": 3,
      "text": "o I am more than convinced that this can be, and is, a valuable process. It is, in my opinion, a pity that Senior IETF Reviewers (SIRS) and so on did not take off, because this late-stage reviewing is a poor substitute for doing the same thing at a much earlier stage. Very few of the drafts that have come past my screen are truly fully ready for IESG review. It is actually a joy to find the occasional nugget that is both well written and is a proper technical job, such that the reviewer really can say \"This is ready\".",
      "zh-CHS": "o 我深信，这可以而且现在是一个有价值的进程。在我看来，令人遗憾的是，IETF高级评审员（SIR）等并没有起飞，因为这种后期评审不能很好地替代在更早的阶段做同样的事情。通过我的屏幕的草稿很少真正完全准备好接受IESG审查。事实上，偶尔能找到既写得好又是一项技术性工作的金块是一件令人高兴的事，这样的话，评论者真的可以说“这已经准备好了”。"
    },
    {
      "indent": 3,
      "text": "o I have certainly found the process intellectually stimulating! It encourages me to take a wider interest in what is going on in the IETF, but consumes a fair bit of time to do a proper job, and requires a very wide knowledge to be able to properly catch the cross-area implications: I hope (believe!) that this is something that one gets better at with experience and doing a few of these reviews.",
      "zh-CHS": "o 我当然发现这个过程在智力上很刺激！它鼓励我对IETF中正在发生的事情有更广泛的兴趣，但做一件适当的工作需要花费相当多的时间，并且需要非常广泛的知识才能正确地抓住跨领域的影响：我希望（相信！）这是一件有经验和做一些这样的评论会更好的事情。"
    },
    {
      "indent": 3,
      "text": "o There is probably a very limited pool of people who have both the time and the inclination to keep on doing these reviews. It does require a fair bit of dedication.",
      "zh-CHS": "o 有时间和意愿继续做这些评论的人可能非常有限。这确实需要一点奉献精神。"
    },
    {
      "indent": 3,
      "text": "o It is difficult to avoid correcting the English, even if that is not really the point: Often, really bad English (whether as a result of non-mother-tongue authors with limited grasp or mother-tongue authors using informal language) obscures/corrupts what is being said or just makes it impossible to read.",
      "zh-CHS": "o 即使这不是重点，也很难避免纠正英语错误：通常，非常糟糕的英语（无论是由于掌握能力有限的非母语作者还是使用非正式语言的母语作者）会模糊/破坏正在说的内容，或者只是使其无法阅读。"
    },
    {
      "indent": 3,
      "text": "o Mostly authors welcome the comments: I think most of them understand the concept of \"ego-free reviewing\", and we have generally been constructive rather than destructive.",
      "zh-CHS": "o 大多数作者欢迎这些评论：我认为他们中的大多数人都理解“自我自由审查”的概念，我们通常是建设性的，而不是破坏性的。"
    },
    {
      "indent": 3,
      "text": "o Part of the job of Gen-ART is to think the unthinkable from another point of view, to challenge (apparently undocumented) assumptions, and apply experience from other fields.",
      "zh-CHS": "o Gen ART的部分工作是从另一个角度思考不可想象的事情，挑战（显然没有记录在案的）假设，并应用其他领域的经验。"
    },
    {
      "indent": 0,
      "text": "7.2. General Area Directors' Impressions",
      "section_title": true,
      "zh-CHS": "7.2. 一般地区总监的印象"
    },
    {
      "indent": 3,
      "text": "It should be noted that these impressions are from multiple General Area Directors; thus, the \"I\"s are not necessarily associated with a specific AD.",
      "zh-CHS": "需要注意的是，这些印象来自多个一般区域主管；因此，“I”不一定与特定AD相关联。"
    },
    {
      "indent": 3,
      "text": "o It's essential. The reviewing load for the IESG <shout>DOES NOT SCALE</shout>.",
      "zh-CHS": "o 这是必要的。IESG<shout>的审查负载不可缩放。"
    },
    {
      "indent": 3,
      "text": "o Without Gen-ART, I would be a much less effective General AD.",
      "zh-CHS": "o 如果没有Gen ART，我将是一个效率更低的普通广告。"
    },
    {
      "indent": 3,
      "text": "o On a single fortnight example, the IESG had 21 drafts on the agenda. It is just impossible (to conscientiously review all the documents), and no wonder we sometimes miss serious issues.",
      "zh-CHS": "o 仅举一个两周的例子，IESG的议程上就有21份草案。（认真审查所有文件）是不可能的，难怪我们有时会忽略严重的问题。"
    },
    {
      "indent": 3,
      "text": "o So I think a distributed review team with about 30 trusted reviewers needs to be institutionalized. I suspect that will need to be formalized in a BCP sooner or later -- with their reviews having a formal position in the standards process, and the expectation that the whole IESG truly reviews all I-Ds being relaxed.",
      "zh-CHS": "o 因此，我认为一个由大约30名可信的评审员组成的分布式评审团队需要制度化。我怀疑这迟早需要在BCP中正式化——他们的审查在标准过程中具有正式的地位，并且整个IESG真正审查所有I-D的期望正在放松。"
    },
    {
      "indent": 3,
      "text": "o We've learned that polite, well reasoned, constructive reviews are very positively received by authors and WGs. Dismissive reviews are counter-productive. And reviews sent in private eventually show up in public, so it's better to go public at the start.",
      "zh-CHS": "o 我们了解到，作者和工作组非常积极地接受礼貌、理性、建设性的评论。轻蔑的评论会适得其反。私下发送的评论最终会公开，所以最好一开始就公开。"
    },
    {
      "indent": 3,
      "text": "o Normally, LC reviews are available in good time for the draft to be revised before reaching the IESG agenda. It is important that this happens, except for an emergency situation where the responsible AD has good reason to place the draft on the agenda immediately. In that case, it would be preferable for the AD to inform the Gen-ART, so that the review can be expedited.",
      "zh-CHS": "o 通常情况下，在提交IESG议程之前，LC审查可及时进行草案修订。这一点很重要，除非在紧急情况下，负责的广告有充分的理由立即将草案列入议程。在这种情况下，广告最好通知ART，以便加快审查。"
    },
    {
      "indent": 3,
      "text": "o The other problem is a big detail -- between late Thursday or early Friday when the secretary sends out the assignments, and Wednesday when the General AD likes to start filling in ballots based on the reviews received by close of business on Tuesday, there are only three work days (plus possible volunteer time over the weekend). Now even with only one I-D to review, that may be a real challenge. Sometimes, a lucky reviewer will get 130 pages (e.g., draft-ietf-nntpext-base-27). That doesn't compute.",
      "zh-CHS": "o 另一个问题是一个很大的细节——从星期四晚些时候或星期五早秘书发出任务，到星期三总广告喜欢根据星期二下班前收到的评论开始填写选票，只有三个工作日（加上周末可能的志愿者时间）。现在，即使只有一个I-D需要审查，这可能是一个真正的挑战。有时，一个幸运的评审员会得到130页（例如，草稿-ietf-nntpext-base-27）。这不算数。"
    },
    {
      "indent": 3,
      "text": "o There are some mechanical issues. The process followed is far too manual. Everything needs to be robotic except for the judgment calls about which reviewer gets which draft. Similarly, the reviewer should be able to just paste the review into a web form, click, and it's sent off to everyone appropriate and posted to the review site.",
      "zh-CHS": "o 有一些机械问题。所遵循的流程过于手工。一切都需要机器人化，除了判断哪位审稿人得到哪份草稿。同样，审阅者应该能够将审阅粘贴到web表单中，单击，然后将其发送给所有适当的人并发布到审阅站点。"
    },
    {
      "indent": 0,
      "text": "7.3. Gen-ART Secretaries' Impressions",
      "section_title": true,
      "zh-CHS": "7.3. 艺术秘书的印象"
    },
    {
      "indent": 3,
      "text": "Serving as the secretary of Gen-ART is a worthwhile experience. From a personal point of view, it gives the secretary an easy way to track all of the work going through the IESG review process and see how the work flowed through that process. Also, by reviewing and sometimes creating the one-line abstracts that go on the review web page, the secretary has an opportunity to really get a survey of the work being approved by the IETF.",
      "zh-CHS": "担任艺术部长是一次值得的经历。从个人角度来看，这为秘书长提供了一种简单的方法来跟踪IESG审查过程中的所有工作，并了解工作如何通过该过程。此外，通过审查，有时在审查网页上创建一行摘要，秘书有机会真正获得IETF批准工作的调查。"
    },
    {
      "indent": 3,
      "text": "The nature of these reviews is informal, and originally the reviews were only intended for the General AD, though they were made public. During 2004, there was little if any interaction between authors and reviewers. There was some discussion during 2004 about trying to expand the role of Gen-ART to a more formal, early-review model, i.e., to evolve it into a form of SIRS. The original Gen-ART secretary was against such a transformation, because she felt it would put at risk something that worked. She believed that there were risks inherent in formalizing the reviews and adding mechanisms for standardizing the resultant review process. Another concern involves the interaction between reviewers and authors. As discussed above, it has become the practice to send reviews to the authors with an explanation about the nature of Gen-ART reviews. While it is clear that this has resulted in improved RFCs, it has also resulted in increased workload for the reviewers.",
      "zh-CHS": "这些评论的性质是非正式的，最初这些评论只针对一般广告，尽管它们是公开的。2004年期间，作者和评论员之间几乎没有互动。2004年期间，曾有一些讨论试图将Gen ART的作用扩展到一个更正式的早期审查模式，即将其演变为SIRS的一种形式。最初的艺术部长反对这样的转变，因为她觉得这会使一些行之有效的东西面临风险。她认为，在使审查正式化和增加使审查过程标准化的机制方面存在固有的风险。另一个问题涉及评论者和作者之间的互动。如上所述，向作者发送评论并解释Gen艺术评论的性质已成为惯例。虽然这显然导致了RFC的改进，但也增加了审查人员的工作量。"
    },
    {
      "indent": 3,
      "text": "The secretary thinks that Gen-ART is an experiment that works well, but she also believes it is fragile. The secretary is often concerned about overburdening reviewers, and feels it is her responsibility to keep them from burning out. Adding additional reviewers to the review team would help to alleviate this concern. In terms of the process, adding additional reviewers has minimal impact.",
      "zh-CHS": "部长认为Gen-ART是一个很好的实验，但她也认为它很脆弱。秘书长经常担心审稿人负担过重，并认为她的责任是防止他们精疲力竭。向审查小组增加更多的审查员将有助于缓解这一担忧。就流程而言，添加其他审阅者的影响最小。"
    },
    {
      "indent": 0,
      "text": "8. Needed Improvements",
      "section_title": true,
      "zh-CHS": "8. 需要改进"
    },
    {
      "indent": 3,
      "text": "The current size of the review team introduces a fairly heavy workload for the individual reviewers that are not on the \"one doc per month\" assignment cycle. Additional reviewers would be really helpful to alleviate this workload. It is also important to note that having additional reviewers adds minimal workload to the",
      "zh-CHS": "审查小组目前的规模为不在“每月一份文件”分配周期内的个别审查员带来了相当繁重的工作量。额外的审查员将真正有助于减轻这一工作量。同样重要的是，需要注意的是，增加额外的审阅者只会将工作量降至最低"
    },
    {
      "indent": 3,
      "text": "secretary's process; thus, the only blocking point is finding the right folks that are interested in this type of volunteer role. As noted in Section 7.2, 30 would be a good size for the review team. This would cut the workload for an individual reviewer in half (given the current model of 9 reviewers on the \"one doc per month\" assignment cycle).",
      "zh-CHS": "秘书程序；因此，唯一的障碍是找到对这种志愿者角色感兴趣的人。如第7.2节所述，30人对于审查小组来说是一个不错的规模。这将把单个审核人的工作量减少一半（考虑到当前模型中“每月一份文件”分配周期中有9名审核人）。"
    },
    {
      "indent": 3,
      "text": "Obviously, automation of the process would be a good thing. However, Gen-ART secretaries are not necessarily highly motivated to transition to a more automated approach until a significant part of the process is automated. In more recent consideration of this situation, it likely would be best to first automate the process of entering the reviews, as that benefits the review team as a whole. This automation should allow the reviewers to enter the reviews via a web interface that would automatically generate the appropriate emails -- quite similar to how the draft \"Upload\" tool currently works. Also, given consistent naming conventions for the review forms, this step would automate some of the process for the secretary, as the reviews would automatically appear via the spreadsheet hyperlinks, although there would still be a need to manually enter the summary. But this would eliminate the need to edit/normalize and upload files and, hopefully, eliminate the problem encountered with unflowed text in emails and getting the review properly formatted using some text editors.",
      "zh-CHS": "显然，过程自动化将是一件好事。然而，在流程的重要部分实现自动化之前，艺术部长们不一定会有很高的动力转向更自动化的方法。在最近对这种情况的考虑中，最好首先自动化进入评审的过程，因为这对整个评审团队都有好处。这种自动化应该允许审阅者通过一个web界面输入审阅，该界面将自动生成相应的电子邮件——与“上传”工具草案目前的工作方式非常类似。此外，鉴于审查表格的命名约定一致，这一步骤将使秘书的某些流程自动化，因为审查将通过电子表格超链接自动显示，尽管仍需要手动输入摘要。但这将消除编辑/规范化和上传文件的需要，并有望消除电子邮件中未流动文本的问题，并使用一些文本编辑器正确格式化评论。"
    },
    {
      "indent": 3,
      "text": "Section 5 was written to facilitate the process of determining tools requirements, by providing the very detailed steps currently applied to the process. As noted above, automating the upload of the reviews could be a good first step. This is somewhat starting at the end of the process. However, it seems that by automating in this direction, we may have optimal results; since one of the earliest steps in the process is the task of assigning reviewers, it likely needs the most manual intervention, even with tools available.",
      "zh-CHS": "第5节通过提供当前应用于该过程的非常详细的步骤来促进确定工具需求的过程。如上所述，自动上传评论可能是很好的第一步。这在某种程度上是从过程的末尾开始的。然而，似乎通过向这个方向自动化，我们可能会得到最佳结果；由于该过程中最早的步骤之一是指派评审员，因此可能需要最手动的干预，即使有可用的工具。"
    },
    {
      "indent": 3,
      "text": "The current SecDir secretary does use some tools for assignments and generating assignment emails. These tools could be considered for use by the Gen-ART secretary. Since the SecDir reviews are not cached and the information maintained for those reviews is less detailed, there would be no reusability of that aspect. However, if the Gen-ART spreadsheet can be automatically populated (with assignments and completed reviews), the SecDir may be able to make use of that same tool.",
      "zh-CHS": "现任SecDir秘书确实使用一些工具来分配任务和生成任务电子邮件。这些工具可供艺术部长使用。由于SecDir审查没有被缓存，并且为这些审查维护的信息不太详细，因此该方面没有可重用性。但是，如果Gen ART电子表格可以自动填充（带有作业和完成的审查），SecDir可能可以使用相同的工具。"
    },
    {
      "indent": 0,
      "text": "9. Applicability",
      "section_title": true,
      "zh-CHS": "9. 适用性"
    },
    {
      "indent": 3,
      "text": "As implemented today, the process has no formal role in the IETF standards process. But as trust in the review team has built, and as the team itself has learned to deliver reviews that are generally well received, they have had a significant impact on I-D quality and on timeliness. Rather than becoming a roadblock, they have (in general) allowed the General AD to feel more confident in reaching decisions and be more precise in resolving issues. Since reviews now typically appear during IETF Last Call, the reviews, like the SecDir reviews, are now generally expected. So, the role of the team has evolved to be more formal than in the past (i.e., when this document was first drafted in 2005). However, the handling of the reviews remains entirely within the scope of the ADs, document shepherds, WG chairs, and authors as they deem appropriate.",
      "zh-CHS": "如今天所实施的，该过程在IETF标准过程中没有正式的作用。但是，随着对审查小组的信任的建立，以及审查小组本身学会了提供普遍受到欢迎的审查，这些审查对I-D质量和及时性产生了重大影响。他们并没有成为一个障碍，而是（总体上）让通用广告在做出决策时更有信心，在解决问题时更加精确。由于评审现在通常出现在IETF最后一次调用期间，因此评审，如SecDir评审，现在通常是预期的。因此，该小组的作用已演变为比过去（即2005年首次起草本文件时）更为正式。然而，审查的处理仍然完全在广告、文档管理员、工作组主席和作者（视情况而定）的范围内。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "zh-CHS": "10. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Since this is an informational I-D about an open process, the security considerations are specific to the process and users involved in the process. The primary concern would be to limit the people that have the ability to create and update the Gen-ART data/ files to ensure that the integrity of the data is maintained. For example, each Gen-ART reviewer should have a unique user name/ password, just as folks do to access any other IETF-maintained data, as appropriate.",
      "zh-CHS": "由于这是一个关于开放流程的信息性ID，因此安全注意事项是特定于流程和流程中涉及的用户的。主要关注的是限制有能力创建和更新Gen ART数据/文件的人员，以确保保持数据的完整性。例如，每一代ART评审员都应该有一个唯一的用户名/密码，就像人们访问任何其他IETF维护的数据一样（视情况而定）。"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgments",
      "section_title": true,
      "zh-CHS": "11. 致谢"
    },
    {
      "indent": 3,
      "text": "Initial comments were received from the members of the Gen-ART, and the experiences discussed in this document were derived from their hard work over the last 7+ years. We thank the past reviewers of the Gen-ART:",
      "zh-CHS": "我们收到了Gen ART成员的初步意见，本文件中讨论的经验来源于他们在过去7年多的辛勤工作。我们感谢《当代艺术》杂志过去的评论员："
    },
    {
      "indent": 6,
      "text": "Mark Allman Harald Alvestrand (creator of Gen-ART) Ron Bonica Scott Brim Gonzalo Camarillo Sharon Chisholm Spencer Dawkins Lakshminath Dondeti Avri Doria (past secretary) Pasi Eronen Dorothy Gellert Eric Gray Avashalom Houri Glenn Kowack",
      "zh-CHS": "马克·奥尔曼·哈拉尔·阿尔韦斯特朗（Gen ART的创作者）罗恩·博尼卡·斯科特·布里姆·冈萨洛·卡马里洛·沙龙·奇肖姆·斯宾塞·道金斯·拉克什米娜·唐德蒂·阿夫里·多里亚（前任秘书）帕西·埃隆·多萝西·盖勒特·埃里克·格雷·阿瓦沙洛姆·霍里·格伦·科瓦克"
    },
    {
      "indent": 6,
      "text": "John Loughney Lucy Lynch Enrico Marocco Michael Patton Stefan Santesson Robert Sparks Tom Taylor Sean Turner Christian Vogt Suzanne Woolf",
      "zh-CHS": "约翰·拉夫尼·露西·林奇·恩里科·马罗科·迈克尔·巴顿·斯特凡·桑特森·罗伯特·斯帕克斯汤姆·泰勒·肖恩·特纳·克里斯蒂安·沃格特·苏珊娜·伍尔夫"
    },
    {
      "indent": 3,
      "text": "We also thank the current team of reviewers/secretary:",
      "zh-CHS": "我们还感谢目前的审查员/秘书团队："
    },
    {
      "indent": 6,
      "text": "Mary Barnes (past secretary, 2005-2010) Richard Barnes David Black Ben Campbell Brian Carpenter (past General AD) Elwyn Davies Francis Dupont Roni Even Miguel-Angel Garcia Vijay Gurbani (assisting secretary to upload reviews) Wassim Haddad Joel Halpern Suresh Krishnan Peter McCann Jean Mahoney (secretary as of Jan. 2011) Alexey Melnikov Kathleen Moriarty",
      "zh-CHS": "玛丽·巴恩斯（前任秘书，2005-2010）理查德·巴恩斯·大卫·布莱克本·坎贝尔·布赖恩·卡彭特（前任总广告）埃尔温·戴维斯·弗朗西斯·杜邦·罗尼甚至米格尔·安吉尔·加西亚·维杰·古巴尼（协助秘书上传评论）瓦西姆·哈达德·乔尔·哈尔佩恩·苏雷什·克里希南·彼得·麦肯·让·马奥尼（2011年1月秘书）亚历克赛·梅尔尼科夫·凯瑟琳·莫里亚蒂"
    },
    {
      "indent": 0,
      "text": "12. Informative References",
      "section_title": true,
      "zh-CHS": "12. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC1958] Carpenter, B., Ed., \"Architectural Principles of the Internet\", RFC 1958, June 1996.",
      "zh-CHS": "[RFC1958]Carpenter，B.，Ed.“互联网的架构原则”，RFC19581996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2223bis] Reynolds, J., Ed., and R. Braden, Ed., \"Instructions to Request for Comments (RFC) Authors\", Work in Progress, August 2004.",
      "zh-CHS": "[RFC2223bis]Reynolds，J.，Ed.，和R.Braden，Ed.，“征求意见（RFC）作者的说明”，正在进行的工作，2004年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC-STYLE] Braden, R., Ginoza, S., and A. Hagens, \"RFC Document Style\", September 2009, <http://www.rfc-editor.org/rfc-style-guide/rfc-style>.",
      "zh-CHS": "[RFC-STYLE]Braden，R.，Ginoza，S.，和A.Hagens，“RFC文档样式”，2009年9月<http://www.rfc-editor.org/rfc-style-guide/rfc-style>."
    },
    {
      "indent": 3,
      "text": "[RFC3426] Floyd, S., \"General Architectural and Policy Considerations\", RFC 3426, November 2002.",
      "zh-CHS": "[RFC3426]Floyd，S.，“一般建筑和政策考虑”，RFC 3426，2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3439] Bush, R. and D. Meyer, \"Some Internet Architectural Guidelines and Philosophy\", RFC 3439, December 2002.",
      "zh-CHS": "[RFC3439]Bush，R.和D.Meyer，“一些互联网架构指南和哲学”，RFC 3439，2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3552] Rescorla, E. and B. Korver, \"Guidelines for Writing RFC Text on Security Considerations\", BCP 72, RFC 3552, July 2003.",
      "zh-CHS": "[RFC3552]Rescorla，E.和B.Korver，“关于安全考虑的RFC文本编写指南”，BCP 72，RFC 3552，2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[SIRS] Carpenter, B. and D. Crocker, \"Careful Additional Review of Documents (CARD) by Senior IETF Reviewers (SIRS)\", Work in Progress, June 2003.",
      "zh-CHS": "[SIRS]Carpenter，B.和D.Crocker，“IETF高级评审员（SIRS）对文件（卡片）的仔细额外评审”，正在进行的工作，2003年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Mary Barnes Polycom TX USA",
      "zh-CHS": "美国德克萨斯州玛丽·巴恩斯宝利通公司"
    },
    {
      "indent": 3,
      "text": "EMail: mary.ietf.barnes@gmail.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Avri Doria Research Consultant Providence, RI USA",
      "zh-CHS": "美国国际扶轮社Avri Doria研究顾问普罗维登斯"
    },
    {
      "indent": 3,
      "text": "EMail: avri@acm.org",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Harald Alvestrand Google Kungsbron 2 11122 Stockholm SE",
      "zh-CHS": "哈拉尔·阿尔维斯特兰谷歌昆斯布朗21122斯德哥尔摩东南部"
    },
    {
      "indent": 3,
      "text": "EMail: harald@alvestrand.no",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Brian E. Carpenter University of Auckland PB 92019 Auckland, 1142 New Zealand",
      "zh-CHS": "Brian E. Carpenter奥克兰大学PB 92019奥克兰，新西兰1142"
    },
    {
      "indent": 3,
      "text": "Phone: EMail: brian.e.carpenter@gmail.com",
      "zh-CHS": "电话：电子邮件：布莱恩。carpenter@gmail.com"
    }
  ]
}