{
  "title": {
    "text": "RFC 6289: A Uniform Resource Name (URN) Namespace for CableLabs",
    "zh-CHS": "RFC 6289"
  },
  "number": 6289,
  "created_at": "2021-11-05 22:19:00.256259+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        E. Cardona\nRequest for Comments: 6289                              S. Channabasappa\nCategory: Informational                                        J-F. Mule\nISSN: 2070-1721                                                CableLabs\n                                                               June 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "A Uniform Resource Name (URN) Namespace for CableLabs",
      "zh-CHS": "CableLabs的统一资源名称（URN）命名空间"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes the Namespace Identifier (NID) 'cablelabs' for Uniform Resource Names (URNs) used to identify resources published by Cable Television Laboratories, Inc. (CableLabs). CableLabs specifies and manages resources that utilize this URN identification model. Management activities for these and other resource types are handled by the manager of the CableLabs' Assigned Names and Numbers registry.",
      "zh-CHS": "本文档描述了统一资源名称（URN）的名称空间标识符（NID）“cablelabs”，用于标识有线电视实验室有限公司（cablelabs）发布的资源。CableLabs指定并管理使用此URN标识模型的资源。这些和其他资源类型的管理活动由CableLabs的分配名称和编号注册表的管理员处理。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6289.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6289."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从该文档中提取的代码组件必须"
    },
    {
      "indent": 3,
      "text": "include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "包括信托法律条款第4.e节中所述的简化BSD许可证文本，且不提供简化BSD许可证中所述的担保。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "zh-CHS": "本文件可能包含2008年11月10日之前发布或公开的IETF文件或IETF贡献中的材料。控制某些材料版权的人员可能未授予IETF信托允许在IETF标准流程之外修改此类材料的权利。在未从控制此类材料版权的人员处获得充分许可的情况下，不得在IETF标准流程之外修改本文件，也不得在IETF标准流程之外创建其衍生作品，除了将其格式化以RFC形式发布或将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  URN Specification for CableLabs . . . . . . . . . . . . . . . . 3\n3.  Example . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n4.  Namespace Considerations  . . . . . . . . . . . . . . . . . . . 5\n5.  Community Considerations  . . . . . . . . . . . . . . . . . . . 5\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 5\n7.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 6\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . . . 6\n  9.2.  Informative References  . . . . . . . . . . . . . . . . . . 6",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "CableLabs is a non-profit research and development consortium that is dedicated to pursuing new cable telecommunications technologies and to helping its cable operator members integrate those technical advancements into their business objectives. Within CableLabs, specification activities are organized into projects such as DOCSIS(R), PacketCable(TM), and OpenCable(TM), and technical work is conducted within focus teams. Product vendors, manufacturers, and cable operator members are invited to join the focus teams that create technical specifications.",
      "zh-CHS": "CableLabs是一家非营利性研发财团，致力于开发新的有线电信技术，并帮助其有线运营商成员将这些技术进步融入其业务目标。在CableLabs中，规范活动被组织到DOCSIS（R）、PacketCable（TM）和OpenCable（TM）等项目中，技术工作在焦点团队中进行。邀请产品供应商、制造商和电缆运营商成员加入创建技术规范的重点团队。"
    },
    {
      "indent": 3,
      "text": "Occasionally, CableLabs specification efforts require identifiers in a managed namespace so that they are unique and persistent. To ensure that the uniqueness is absolute, the registration of a specific Uniform Resource Name (URN) [RFC2141] Namespace Identifier",
      "zh-CHS": "有时，CableLabs规范工作需要托管命名空间中的标识符，以便它们是唯一和持久的。为了确保唯一性是绝对的，需要注册特定的统一资源名（URN）[RFC2141]命名空间标识符"
    },
    {
      "indent": 3,
      "text": "(NID) for use by CableLabs is being specified in this document, in full conformance with the NID registration process specified in [RFC3406].",
      "zh-CHS": "（NID）供CableLabs使用，完全符合[RFC3406]中规定的NID注册流程。"
    },
    {
      "indent": 0,
      "text": "2. URN Specification for CableLabs",
      "section_title": true,
      "zh-CHS": "2. 电缆实验室用URN规范"
    },
    {
      "indent": 3,
      "text": "Namespace ID: cablelabs",
      "zh-CHS": "命名空间ID:cablelabs"
    },
    {
      "indent": 3,
      "text": "Registration information: registration version number: 1 registration date: 2011-04-18",
      "zh-CHS": "注册信息：注册版本号：1注册日期：2011-04-18"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace: Registering organization Name: Cable Television Laboratories, Inc. Address: 858 Coal Creek Circle, Louisville, CO 80027, USA Designated contact Role: Manager, Standards Email: ietf_standards@cablelabs.com",
      "zh-CHS": "名称空间的声明注册人：注册机构名称：有线电视实验室有限公司地址：858 Coal Creek Circle，Louisville，CO 80027，USA指定联系人角色：经理，标准电子邮件：ietf_standards@cablelabs.com"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure: The Namespace Specific String (NSS) of all URNs that use the \"cablelabs\" NID will have the following structure:",
      "zh-CHS": "语法结构声明：使用“cablelabs”NID的所有URN的命名空间特定字符串（NSS）将具有以下结构："
    },
    {
      "indent": 8,
      "text": "{CLclass}:{CLClassSpecificString}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "The \"CLclass\" is a US-ASCII string that conforms to the URN syntax requirements specified in [RFC2141] and defines a specific class of resource type. Each class will have a specific labeling scheme that is covered by \"CLClassSpecificString\", which also conforms to the naming requirements of [RFC2141].",
      "zh-CHS": "“CLclass”是一个US-ASCII字符串，符合[RFC2141]中规定的URN语法要求，并定义了资源类型的特定类。每个类都有一个特定的标签方案，该方案包含在“CLClassSpecificString”中，该方案也符合[RFC2141]的命名要求。"
    },
    {
      "indent": 8,
      "text": "CableLabs maintains the CableLabs' Assigned Names and Numbers [CANN] specification that will contain the assignment of CableLabs' resource classes and the specific registration values assigned for each resource class.",
      "zh-CHS": "CableLabs维护CableLabs的分配名称和编号[CANN]规范，该规范将包含CableLabs资源类的分配以及为每个资源类分配的特定注册值。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation: CableLabs publishes information regarding the registered resources in the CableLabs' Assigned Names and Numbers specification ([CANN]).",
      "zh-CHS": "相关辅助文档：CableLabs在CableLabs的指定名称和编号规范（[CANN]）中发布有关注册资源的信息。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations: CableLabs will manage resource classes using the \"cablelabs\" NID and will be the authority for managing resources and associated subsequent strings. CableLabs is expected to guarantee the uniqueness of the strings themselves, or it may permit secondary responsibility for certain defined resources.",
      "zh-CHS": "标识符唯一性注意事项：CableLabs将使用“CableLabs”NID管理资源类，并将成为管理资源和相关后续字符串的权限。CableLabs应保证字符串本身的唯一性，或者允许对某些定义的资源承担次要责任。"
    },
    {
      "indent": 8,
      "text": "CableLabs could allow the use of experimental type values for testing purposes only. Note that using experimental types may create collisions as multiple users may use the same values for resources and specific strings.",
      "zh-CHS": "CableLabs允许仅出于测试目的使用实验类型值。请注意，使用实验类型可能会产生冲突，因为多个用户可能会对资源和特定字符串使用相同的值。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations: CableLabs will update the CableLabs' Assigned Names and Numbers specification ([CANN]) to document the registered resources that use the \"cablelabs\" NID.",
      "zh-CHS": "标识符持久性注意事项：CableLabs将更新CableLabs的分配名称和编号规范（[CANN]），以记录使用“CableLabs”NID的注册资源。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment: CableLabs will provide procedures for registration of each type of resource that it maintains. Each such resource may have three types of registration activities:",
      "zh-CHS": "标识符分配过程：CableLabs将提供其维护的每种类型资源的注册程序。每个此类资源可能有三种类型的注册活动："
    },
    {
      "indent": 8,
      "text": "1. Registered values associated with CableLabs documents or services 2. Registration of values or sub-trees to other entities 3. Name models for use in experimental purposes",
      "zh-CHS": "1. 与CableLabs文档或服务相关的注册值2。将值或子树注册到其他实体3。命名用于实验目的的模型"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution: The namespace is not listed with a resolution discovery system; this is not applicable for this URN registration.",
      "zh-CHS": "标识符解析过程：命名空间未与解析发现系统一起列出；这不适用于此URN注册。"
    },
    {
      "indent": 3,
      "text": "Rules for lexical equivalence: No special considerations; the rules for lexical equivalence of [RFC2141] apply.",
      "zh-CHS": "词汇对等规则：无特殊考虑；[RFC2141]的词汇对等规则适用。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN syntax: No special considerations.",
      "zh-CHS": "与URN语法的一致性：无需特别考虑。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism: None specified. URN assignment will be handled by procedures implemented in support of CableLabs activities.",
      "zh-CHS": "验证机制：未指定。URN分配将由支持CableLabs活动的程序执行。"
    },
    {
      "indent": 3,
      "text": "Scope: Global",
      "zh-CHS": "范围：全球"
    },
    {
      "indent": 0,
      "text": "3. Example",
      "section_title": true,
      "zh-CHS": "3. 实例"
    },
    {
      "indent": 3,
      "text": "The following example represents a hypothetical URN that could be assigned by CableLabs.",
      "zh-CHS": "以下示例表示CableLabs可以分配的假设URN。"
    },
    {
      "indent": 3,
      "text": "urn:cablelabs:packetcable-example:ue:rst-sample",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This example defines the URN to be used for User Equipment (UE) conforming to the sample Residential SIP Telephony (RST) application specified within CableLabs' PacketCable RST specification suite.",
      "zh-CHS": "此示例定义了用户设备（UE）所使用的URN，该用户设备（UE）符合CableLabs的PacketCable RST规范套件中指定的示例住宅SIP电话（RST）应用程序。"
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "4. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "CableLabs develops specifications that may require the use of data models. URN Namespaces are key constructs to manage the definitions of those data models reliably with persistence and uniqueness.",
      "zh-CHS": "CableLabs制定了可能需要使用数据模型的规范。URN名称空间是可靠地管理这些数据模型定义的关键结构，具有持久性和唯一性。"
    },
    {
      "indent": 3,
      "text": "The use of URNs should also help specification authors to maintain different versions of URNs and dependencies between URNs across different versions of CableLabs specifications if they so wish.",
      "zh-CHS": "URN的使用还应有助于规范作者维护URN的不同版本以及跨CableLabs规范的不同版本的URN之间的依赖关系（如果他们愿意的话）。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "zh-CHS": "5. 社区考虑"
    },
    {
      "indent": 3,
      "text": "Participants involved in the development and usage of CableLabs specifications and cable industry deployments will benefit from the publication of this namespace by providing consistent and reliable names for the XML namespaces, schema locations, and similar identifiers of physical data models published within CableLabs specifications.",
      "zh-CHS": "参与CableLabs规范和电缆行业部署的开发和使用的参与者将受益于该名称空间的发布，他们将为在CableLabs规范中发布的XML名称空间、模式位置和物理数据模型的类似标识符提供一致和可靠的名称。"
    },
    {
      "indent": 3,
      "text": "The CableLabs specifications are publicly available and are licensed to manufacturers on a nondiscriminatory basis. CableLabs will maintain the allocation of resources for the \"cablelabs\" NID within the following specification: \"CableLabs' Assigned Names and Numbers\" [CANN], which will be publicly available for viewing. CableLabs will also maintain the corresponding specifications where the registered resources are referenced or used.",
      "zh-CHS": "CableLabs规范可公开获取，并以非歧视的方式许可给制造商。CableLabs将在以下规范中维护“CableLabs”NID的资源分配：“CableLabs分配的名称和编号”[CANN]，该规范将公开供查看。CableLabs还将维护引用或使用注册资源的相应规范。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document adds a new entry (\"cablelabs\") in the urn-namespaces registry. This is the defining document. The entry can be found in the \"Uniform Resource Names (URN) Namespaces\" registry available from the IANA site (http://www.iana.org) and any associated mirrors.",
      "zh-CHS": "本文档在urn名称空间注册表中添加了一个新条目（“cablelabs”）。这是定义文档。该条目可以在IANA站点提供的“统一资源名称（URN）命名空间”注册表中找到(http://www.iana.org)以及任何相关的镜子。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general, which are described in [RFC1737], [RFC2141], and [RFC3406].",
      "zh-CHS": "除了[RFC1737]、[RFC2141]和[RFC3406]中描述的通常与URN的使用和解析相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Alfred Hoenes, Ted Hardie, and Peter Saint-Andre for their useful comments and suggestions. The authors also acknowledge that the text from [RFC4358] formed the basis for the initial version of this document.",
      "zh-CHS": "作者希望感谢阿尔弗雷德·霍恩斯、特德·哈迪和彼得·圣安德烈提出的有用意见和建议。作者还承认，[RFC4358]中的文本构成了本文件初始版本的基础。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[RFC2141]Moats，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "zh-CHS": "[RFC3406]Daigle，L.，van Gulik，D.，Iannella，R.，和P.Faltstrom，“统一资源名称（URN）命名空间定义机制”，BCP 66，RFC 3406，2002年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[CANN] Cable Television Laboratories Inc., \"CableLabs' Assigned Names and Numbers\", 2011, <http://www.cablelabs.com/specifications/cpSpecs.html>.",
      "zh-CHS": "[CANN]有线电视实验室有限公司，“有线实验室的指定名称和编号”，2011年<http://www.cablelabs.com/specifications/cpSpecs.html>."
    },
    {
      "indent": 3,
      "text": "[RFC1737] Sollins, K. and L. Masinter, \"Functional Requirements for Uniform Resource Names\", RFC 1737, December 1994.",
      "zh-CHS": "[RFC1737]Sollins，K.和L.Masinter，“统一资源名称的功能要求”，RFC 1737，1994年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4358] Smith, D., \"A Uniform Resource Name (URN) Namespace for the Open Mobile Alliance (OMA)\", RFC 4358, January 2006.",
      "zh-CHS": "[RFC4358]Smith，D.“开放移动联盟（OMA）的统一资源名（URN）命名空间”，RFC 4358，2006年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Eduardo Cardona CableLabs 858 Coal Creek Circle Louisville, CO 80027 USA",
      "zh-CHS": "爱德华多·卡多纳电缆实验室858美国科罗拉多州路易斯维尔市煤溪圈80027"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303 661 3375\nEMail: e.cardona@cablelabs.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Sumanth Channabasappa CableLabs 858 Coal Creek Circle Louisville, CO 80027 USA",
      "zh-CHS": "美国科罗拉多州路易斯维尔市煤溪圈858号Sumanth Channabasapa CableLabs 80027"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303 661 3307\nEMail: sumanth@cablelabs.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jean-Francois Mule CableLabs 858 Coal Creek Circle Louisville, CO 80027 USA",
      "zh-CHS": "Jean-Francois Mule CableLabs 858美国科罗拉多州路易斯维尔市煤溪圈80027"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303 661 9100\nEMail: jf.mule@cablelabs.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}