{
  "title": {
    "text": "RFC 6702: Promoting Compliance with Intellectual Property Rights (IPR) Disclosure Rules",
    "zh-CHS": "RFC 6702"
  },
  "number": 6702,
  "created_at": "2021-11-04 01:59:04.452481+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           T. Polk\nRequest for Comments: 6702                                          NIST\nCategory: Informational                                   P. Saint-Andre\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                             August 2012",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Promoting Compliance with Intellectual Property Rights (IPR) Disclosure Rules",
      "zh-CHS": "促进遵守知识产权（IPR）披露规则"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The disclosure process for intellectual property rights (IPR) in documents produced within the IETF stream is essential to the accurate development of community consensus. However, this process is not always followed by IETF participants. Regardless of the cause or motivation, noncompliance with IPR disclosure rules can delay or even derail completion of IETF specifications. This document describes some strategies for promoting compliance with the IPR disclosure rules. These strategies are primarily intended for use by area directors, working group chairs, and working group secretaries.",
      "zh-CHS": "IETF流中产生的文件中的知识产权（IPR）披露流程对于准确形成社区共识至关重要。然而，IETF参与者并不总是遵循这一过程。无论原因或动机如何，不遵守知识产权披露规则都可能延迟甚至破坏IETF规范的完成。本文件描述了促进遵守知识产权披露规则的一些策略。这些策略主要供区域总监、工作组主席和工作组秘书使用。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6702.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6702."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2012 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Terminology ................................................4\n2. Background ......................................................4\n3. Strategies for Working Group Documents ..........................5\n   3.1. Presenting an Internet-Draft at an IETF Meeting ............5\n   3.2. Requesting WG Adoption .....................................6\n   3.3. Requesting WG Last Call ....................................6\n   3.4. AD Review ..................................................7\n   3.5. IETF Last Call .............................................7\n4. Strategies for Individual Submissions ...........................8\n   4.1. Presenting an Internet-Draft at an IETF Meeting ............8\n   4.2. AD Review ..................................................8\n   4.3. IETF Last Call .............................................9\n5. A Note about Preliminary Disclosures ............................9\n6. Conclusions .....................................................9\n7. Security Considerations .........................................9\n8. References .....................................................10\n   8.1. Normative References ......................................10\n   8.2. Informative References ....................................10\nAppendix A. Sample Messages .......................................11\n  A.1. General WG Reminder ........................................11\n  A.2. Reminder to Meeting Presenter ..............................12\n  A.3. Reminder before WG Adoption of an Individual\n       Internet-Draft .............................................13\n  A.4. Reminder before Working Group Last Call ....................14\n  A.5. Reminder to Authors and Listed Contributors of a\n       Working Group Document before IETF Last Call ...............15\n  A.6. Reminder to Author of an Individual Submission before\n       IETF Last Call .............................................15\nAppendix B. Acknowledgements ......................................16",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The disclosure process for intellectual property rights (IPR) in documents produced within the IETF stream [RFC5741] is essential to the efficient and accurate development of community consensus. In particular, ensuring that IETF working groups and participants have as much information as possible regarding IPR constraints, as early as possible in the process, increases the likelihood that the community can develop an informed consensus regarding technical proposals. Statements to that effect appear in both the second and third revisions of the Internet Standards Process ([RFC1602], Section 5.5, Clause (B) and [RFC2026], Section 10.4, Clause (B)).",
      "zh-CHS": "IETF流[RFC5741]中产生的文件中的知识产权（IPR）披露流程对于高效准确地形成社区共识至关重要。特别是，确保IETF工作组和参与者尽早获得关于知识产权限制的尽可能多的信息，增加了社区就技术提案达成知情共识的可能性。互联网标准流程的第二次和第三次修订版（[RFC1602]，第5.5节，第（B）条和[RFC2026]，第10.4节，第（B）条）中都有相关说明。"
    },
    {
      "indent": 3,
      "text": "However, sometimes IPR disclosures do not occur at the earliest possible stage in the IETF process. There are many reasons why an individual might not disclose IPR early in the process: for example, through a simple oversight, to introduce delay, or to subvert the emergence of consensus.",
      "zh-CHS": "然而，有时知识产权披露不会在IETF过程的最早阶段发生。个人不可能在过程的早期披露知识产权的原因有很多：例如，通过简单的监督、引入延迟或破坏共识的出现。"
    },
    {
      "indent": 3,
      "text": "Regardless of the cause or motivation, noncompliance with IPR disclosure rules can delay or even derail completion of IETF specifications. Disclosure of IPR after significant decisions, such as Working Group Last Call (WGLC), might lead to reconsideration of those actions. As one example, a working group (WG) might change course and use a previously rejected technical proposal with less onerous licensing requirements. Such \"course corrections\" produce unnecessary delays in the standardization process.",
      "zh-CHS": "无论原因或动机如何，不遵守知识产权披露规则都可能延迟甚至破坏IETF规范的完成。在作出重大决定后披露知识产权，例如工作组最后一次电话会议（WGLC），可能导致重新考虑这些行动。例如，一个工作组（WG）可能会改变方针，使用以前被拒绝的技术提案，但许可要求不那么苛刻。这种“过程修正”会在标准化过程中产生不必要的延迟。"
    },
    {
      "indent": 3,
      "text": "This document suggests some strategies for promoting compliance with the IETF's IPR disclosure rules and thereby avoiding such delays. These strategies are primarily intended for use by area directors (ADs), WG chairs, and WG secretaries.",
      "zh-CHS": "本文件提出了一些促进遵守IETF知识产权披露规则的策略，从而避免此类延迟。这些策略主要供区域总监（ADs）、工作组主席和工作组秘书使用。"
    },
    {
      "indent": 3,
      "text": "These strategies are focused on promoting early disclosure by document authors, since late disclosure involving authors has historically caused significant delays in the standardization process. Many of these strategies also promote early disclosure by other IETF contributors.",
      "zh-CHS": "这些策略的重点是促进文档作者的早期披露，因为涉及作者的后期披露在历史上造成了标准化过程中的重大延迟。其中许多策略也促进了其他IETF贡献者的早期披露。"
    },
    {
      "indent": 3,
      "text": "Naturally, even if ADs, WG chairs, and WG secretaries do not apply the strategies described in this document, IETF contributors are still bound by the rules defined in BCP 79 (see [RFC3979] and [RFC4879]) and BCP 78 (see [RFC5378]). This document does not modify those rules, nor does it normatively extend those rules; it merely provides suggestions intended to aid ADs, WG chairs, and WG secretaries.",
      "zh-CHS": "当然，即使ADs、工作组主席和工作组秘书不采用本文件中描述的策略，IETF贡献者仍受BCP 79（参见[RFC3979]和[RFC4879]）和BCP 78（参见[RFC5378]）中定义的规则约束。本文件不修改这些规则，也不规范地扩展这些规则；它仅仅提供了一些建议，旨在帮助广告、工作组主席和工作组秘书。"
    },
    {
      "indent": 3,
      "text": "By intent, this document does not claim to define best current practices; instead, it suggests strategies that ADs, WG chairs, and WG secretaries might find useful. With sufficient use and appropriate modification to incorporate the lessons of experience, these strategies might someday form the basis for documentation of best current practices.",
      "zh-CHS": "本文件无意定义当前最佳实践；相反，它提出了广告、工作组主席和工作组秘书可能会发现有用的策略。在充分利用和适当修改以吸收经验教训的情况下，这些战略有朝一日可能成为记录当前最佳做法的基础。"
    },
    {
      "indent": 3,
      "text": "This document does not consider the parallel, but important, issue of potential actions that can be taken by the IETF itself for lack of conformance with the IETF's IPR policy. That topic is discussed in [RFC6701].",
      "zh-CHS": "该文件不考虑IETF本身可能与IETF的知识产权政策不一致所采取的潜在行动的平行但重要的问题。[RFC6701]中讨论了该主题。"
    },
    {
      "indent": 3,
      "text": "At the time of this writing, the Internet Research Task Force (IRTF) follows the same IPR disclosure rules as the IETF (see <http://irtf.org/ipr>); therefore, the strategies described here might also be appropriate for use by IRTF research group chairs.",
      "zh-CHS": "在撰写本文时，互联网研究工作队（IRTF）遵循与IETF相同的知识产权披露规则（参见<http://irtf.org/ipr>); 因此，这里描述的策略可能也适合IRTF研究小组主席使用。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "zh-CHS": "1.1. 术语"
    },
    {
      "indent": 3,
      "text": "This document relies on the definitions provided in Section 1 of [RFC3979].",
      "zh-CHS": "本文件依赖于[RFC3979]第1节中提供的定义。"
    },
    {
      "indent": 3,
      "text": "The term \"formal disclosure\" refers to an IPR disclosure statement that has been officially submitted by using the IPR disclosure tools currently available at <http://www.ietf.org/ipr/file-disclosure> or by sending a message to ietf-ipr@ietf.org. The term \"informal disclosure\" refers to a statement that is provided in a less official manner, such as orally during a presentation, in writing within presentation materials, or posted via email to the relevant discussion list before a presentation.",
      "zh-CHS": "术语“正式披露”是指通过使用目前可在网站上获得的知识产权披露工具正式提交的知识产权披露声明<http://www.ietf.org/ipr/file-disclosure>或者通过向ietf发送消息-ipr@ietf.org. “非正式披露”一词是指以不太正式的方式提供的声明，例如在演示过程中口头提供、在演示材料中以书面形式提供或在演示之前通过电子邮件发送到相关讨论列表。"
    },
    {
      "indent": 3,
      "text": "Since this document is purely informational, by intent it does not use the conformance language described in [RFC2119].",
      "zh-CHS": "由于本文档纯粹是信息性的，因此无意使用[RFC2119]中描述的一致性语言。"
    },
    {
      "indent": 0,
      "text": "2. Background",
      "section_title": true,
      "zh-CHS": "2. 出身背景"
    },
    {
      "indent": 3,
      "text": "The responsibilities of IETF contributors regarding IPR disclosure are documented in [RFC3979] and [RFC4879]. These documents do not assign any further responsibilities to ADs, WG chairs, and WG secretaries, other than those imposed by their roles as contributors or participants. However, late disclosure of IPR has a direct impact on the effectiveness of working groups, WG chairs, and ADs.",
      "zh-CHS": "IETF贡献者关于知识产权披露的责任记录在[RFC3979]和[RFC4879]中。这些文件并未将任何进一步的责任分配给ADs、工作组主席和工作组秘书，但其作为贡献者或参与者的角色所施加的责任除外。然而，知识产权的延迟披露直接影响到工作组、工作组主席和广告的有效性。"
    },
    {
      "indent": 3,
      "text": "According to [RFC2418], WG chairs are responsible for \"making forward progress through a fair and open process\" and ADs are responsible for \"ensuring that working groups in their area produce ... timely output\"; in addition, because WG chairs can appoint one or more WG",
      "zh-CHS": "根据[RFC2418]，工作组主席负责“通过公平和公开的过程取得进展”，ADs负责“确保其所在领域的工作组产生……及时的产出”；此外，由于工作组主席可以任命一个或多个工作组"
    },
    {
      "indent": 3,
      "text": "secretaries to help them with the day-to-day business of running the working group (see [RFC2418]), some of the actions suggested in this document might fall to WG secretaries.",
      "zh-CHS": "秘书为了帮助他们管理工作组的日常事务（见[RFC2418]），本文件中建议的一些行动可能属于工作组秘书。"
    },
    {
      "indent": 3,
      "text": "IPR disclosure at the earliest possible time is an essential feature of a \"fair and open process\", and late disclosure can impede timely output since it can cause the WG to revisit previous decisions, needlessly revise technical specifications, and face the prospect of appeals. To better fulfill their responsibilities in the IETF Standards Process, ADs, WG chairs, and WG secretaries might wish to adopt strategies to encourage early disclosure consistent with the responsibilities established in [RFC3979] and [RFC4879], such as the strategies described in this document.",
      "zh-CHS": "尽早披露知识产权是“公平和公开程序”的一个基本特征，延迟披露可能会妨碍及时输出，因为这可能会导致工作组重新审视以前的决定，不必要地修改技术规范，并面临上诉。为了更好地履行其在IETF标准过程中的职责，ADs、工作组主席和工作组秘书可能希望采用与[RFC3979]和[RFC4879]中规定的职责相一致的策略来鼓励提前披露，如本文件中所述的策略。"
    },
    {
      "indent": 0,
      "text": "3. Strategies for Working Group Documents",
      "section_title": true,
      "zh-CHS": "3. 工作组文件的战略"
    },
    {
      "indent": 3,
      "text": "Building upon the framework provided in [RFC3669], this section identifies opportunities to promote IPR disclosure within the document lifecycle for IETF working group documents. These opportunities are typically encountered during initial public discussion, working group adoption, WGLC, and IETF Last Call. WG chairs might also want to make WG participants aware of the importance of IPR disclosure more generally, as exemplified by the sample message provided under Appendix A.1.",
      "zh-CHS": "基于[RFC3669]中提供的框架，本节确定了在IETF工作组文件的文件生命周期内促进知识产权披露的机会。这些机会通常在最初的公开讨论、工作组采纳、WGLC和IETF最后一次通话中遇到。工作组主席还可能希望让工作组参与者更普遍地意识到知识产权披露的重要性，如附录A.1中提供的示例信息所示。"
    },
    {
      "indent": 3,
      "text": "The strategies described in this section are primarily implemented by WG chairs. (The exceptions are strategies for IETF Last Call, which would be implemented by ADs.) In cases where the WG secretary creates meeting agendas or initiates consensus calls, the secretary might also implement these strategies.",
      "zh-CHS": "本节所述战略主要由工作组主席实施。（例外情况是IETF最后一次呼叫的策略，将由ADs实施。）如果工作组秘书创建会议议程或发起协商一致的呼叫，秘书也可以实施这些策略。"
    },
    {
      "indent": 0,
      "text": "3.1. Presenting an Internet-Draft at an IETF Meeting",
      "section_title": true,
      "zh-CHS": "3.1. 在IETF会议上提交互联网草案"
    },
    {
      "indent": 3,
      "text": "The first opportunity to encourage early IPR disclosure might occur even before a technical proposal becomes a working group document.",
      "zh-CHS": "甚至在技术建议书成为工作组文件之前，就有可能出现鼓励尽早披露知识产权的第一次机会。"
    },
    {
      "indent": 3,
      "text": "When IETF participants wish to promote public discussion of a personal draft in hopes of future adoption by a working group, one common strategy is to request a slot on the agenda at an upcoming face-to-face meeting. Before the community commits resources to reviewing and considering the draft, it is very reasonable for the WG chairs to confirm (often via email) that all IPR disclosures have been submitted. The chairs ought to request confirmation from each of the authors and listed contributors, especially if those individuals are associated with multiple organizations.",
      "zh-CHS": "当IETF参与者希望促进对个人草案的公开讨论，以期工作组将来通过时，一个常见的策略是在即将举行的面对面会议上要求在议程上留出一个时间。在社区投入资源审查和审议草案之前，工作组主席确认（通常通过电子邮件）已提交所有知识产权披露是非常合理的。主席应当要求每一位作者和列出的贡献者予以确认，特别是如果这些人与多个组织有关联。"
    },
    {
      "indent": 3,
      "text": "If the necessary disclosures have not been submitted, the chairs have a choice: deny the agenda slot unless formal IPR disclosure statements are submitted, or insist on informal disclosure. One factor in this decision could be the number of revisions that have occurred: the chairs might wish to permit presentation of a -00 draft with informal disclosure, but not after a draft has gone through multiple revision cycles. If informal disclosure is allowed, the chairs ought to make sure that the disclosure is documented in the minutes, and ought to encourage submission of formal disclosure statements after the meeting.",
      "zh-CHS": "如果没有提交必要的披露，主席有一个选择：除非提交正式的知识产权披露声明，否则拒绝议程，或者坚持非正式披露。这一决定的一个因素可能是已经发生的修订数量：主席们可能希望允许在非正式披露的情况下提交一份-00草案，但不能在草案经过多次修订周期后提交。如果允许非正式披露，主席应确保披露记录在会议记录中，并应鼓励在会议后提交正式披露声明。"
    },
    {
      "indent": 3,
      "text": "In some cases, an IETF participant has not yet submitted an Internet-Draft but might still request a slot on the agenda to discuss a proposal for a new draft, or a new feature for an existing working group document. Here again, it is very reasonable for the WG chairs to confirm, before approving the agenda slot, that all IPR claims have been disclosed (likely in an informal manner as described above, since the participant has not yet made a Contribution as defined by the Internet Standards Process [RFC3979]).",
      "zh-CHS": "在某些情况下，IETF参与者尚未提交互联网草案，但仍可能要求在议程上留出时间讨论新草案提案或现有工作组文件的新功能。在这方面，工作组主席在批准议程之前确认所有知识产权声明均已披露（可能以上述非正式方式披露，因为参与者尚未做出互联网标准流程[RFC3979]定义的贡献），这也是非常合理的。"
    },
    {
      "indent": 3,
      "text": "A sample message of the kind that might be sent at this stage is provided under Appendix A.2.",
      "zh-CHS": "附录A.2中提供了本阶段可能发送的此类信息的示例。"
    },
    {
      "indent": 0,
      "text": "3.2. Requesting WG Adoption",
      "section_title": true,
      "zh-CHS": "3.2. 请求工作组通过"
    },
    {
      "indent": 3,
      "text": "When a technical proposal is considered for adoption by a working group, the chairs have an opportunity to confirm (or reconfirm) IPR compliance with authors and listed contributors. In addition, the chairs might wish to explicitly ask the WG participants if anyone is aware of IPR that is associated with the proposal.",
      "zh-CHS": "当工作组考虑通过技术提案时，主席有机会确认（或再次确认）作者和所列贡献者的知识产权合规性。此外，主席可能希望明确询问工作组参与者是否有人知道与提案相关的知识产权。"
    },
    {
      "indent": 3,
      "text": "A sample message of the kind that might be sent at this stage is provided under Appendix A.3.",
      "zh-CHS": "附录A.3中提供了本阶段可能发送的此类信息的示例。"
    },
    {
      "indent": 0,
      "text": "3.3. Requesting WG Last Call",
      "section_title": true,
      "zh-CHS": "3.3. 请求工作组最后一次呼叫"
    },
    {
      "indent": 3,
      "text": "Working Group Last Call is a particularly significant milestone for a working group document, measuring consensus within the working group one final time. If IPR disclosure statements have not been submitted, the judgement of consensus by the chairs would be less than reliable because it would be based on incomplete assumptions. Even if procedures such as those described above have been implemented to promote IPR disclosure during initial public discussion and adoption, features might have evolved in a way that introduces new IPR concerns. In addition, new participants with knowledge of IPR claims might have become active in the working group. Therefore, the WG chairs might wish to reconfirm with each of the authors and listed contributors that appropriate IPR disclosure",
      "zh-CHS": "工作组最后一次呼吁是工作组文件的一个特别重要的里程碑，它最后一次衡量了工作组内部的共识。如果未提交知识产权披露声明，主席的共识判断将不太可靠，因为它将基于不完整的假设。即使在最初的公开讨论和采纳过程中实施了上述程序以促进知识产权披露，功能也可能以引入新的知识产权关注点的方式发展。此外，了解知识产权权利主张的新参与者可能会积极参与工作组。因此，工作组主席可能希望与每位作者和列出的贡献者再次确认适当的知识产权披露"
    },
    {
      "indent": 3,
      "text": "statements have been filed, even if they all work for the same organization. The chairs might also wish to include a reminder about the importance of IPR disclosures in any WGLC message communicated to the working group. (Note: If IPR disclosure statements have been filed, the chairs might wish to include a link in the WGLC message to ensure that the consensus call reflects this information.)",
      "zh-CHS": "声明已经归档，即使它们都为同一个组织工作。主席们还不妨在传达给工作组的任何工作组信息中，提醒大家知识产权披露的重要性。（注：如果已提交知识产权披露声明，主席可能希望在工作组信息中包含一个链接，以确保共识电话反映了该信息。）"
    },
    {
      "indent": 3,
      "text": "A sample message of the kind that might be sent at this stage is provided under Appendix A.4.",
      "zh-CHS": "附录A.4中提供了本阶段可能发送的此类信息的示例。"
    },
    {
      "indent": 0,
      "text": "3.4. AD Review",
      "section_title": true,
      "zh-CHS": "3.4. 广告评论"
    },
    {
      "indent": 3,
      "text": "After successfully completing WGLC, a working group document is forwarded to the appropriate area director for AD review, with a request that the AD process the document for publication as an RFC. Such a publication request is accompanied by a Document Shepherd Write-Up as required by [RFC4858] using the template found at <http://www.ietf.org/iesg/template/doc-writeup.html>. At the time of this writing, the template asks the document shepherd to answer the following question:",
      "zh-CHS": "在成功完成WGLC后，将工作组文件转发给相应的区域主管进行AD审查，并要求AD处理该文件以作为RFC发布。此类发布请求随附[RFC4858]要求的文件编写，使用在<http://www.ietf.org/iesg/template/doc-writeup.html>. 在撰写本文时，模板要求文档管理员回答以下问题："
    },
    {
      "indent": 6,
      "text": "(7) Has each author confirmed that any and all appropriate IPR disclosures required for full conformance with the provisions of BCP 78 and BCP 79 have already been filed? If not, explain why.",
      "zh-CHS": "(7) 每位作者是否已确认已提交了完全符合BCP 78和BCP 79规定所需的任何和所有适当的知识产权披露？如果没有，请解释原因。"
    },
    {
      "indent": 3,
      "text": "Shepherds ought to be asking authors that question directly. Additionally, the AD can ask the WG chairs whether they took explicit action to promote disclosure of IPR.",
      "zh-CHS": "牧羊人应该直接问作者这个问题。此外，广告可以询问工作组主席是否采取了明确的行动来促进知识产权的披露。"
    },
    {
      "indent": 3,
      "text": "If the answer to the write-up question is not favorable, or if the chairs did not take any of the actions listed above, the AD might choose to contact the authors and listed contributors to confirm that the appropriate IPR disclosure statements have been filed before advancing the document through the publication process.",
      "zh-CHS": "如果对书面问题的回答不满意，或者如果主席没有采取上述任何行动，广告可能会选择联系作者和列出的贡献者，以确认在通过发布过程推进文件之前已提交适当的知识产权披露声明。"
    },
    {
      "indent": 3,
      "text": "A sample message of the kind that might be sent at this stage is provided under Appendix A.5.",
      "zh-CHS": "附录A.5中提供了本阶段可能发送的此类信息的示例。"
    },
    {
      "indent": 0,
      "text": "3.5. IETF Last Call",
      "section_title": true,
      "zh-CHS": "3.5. IETF最后一次呼叫"
    },
    {
      "indent": 3,
      "text": "IETF Last Call is the mechanism used by the AD and the IESG as a whole to gauge IETF-wide consensus. It is critical that the community have easy access to all related IPR statements when considering an Internet-Draft. The current tools automatically include the URL for each IPR statement explicitly linked to the draft when the default IETF Last Call message is generated. If the AD edits this message, the links to IPR disclosure statements ought to be preserved.",
      "zh-CHS": "IETF Last Call是AD和IESG作为一个整体用来衡量IETF广泛共识的机制。在考虑互联网草案时，社区能够轻松访问所有相关的知识产权声明，这一点至关重要。当生成默认的IETF最后一次调用消息时，当前工具会自动包含显式链接到草稿的每个IPR语句的URL。如果广告编辑了此消息，则应保留与知识产权披露声明的链接。"
    },
    {
      "indent": 0,
      "text": "4. Strategies for Individual Submissions",
      "section_title": true,
      "zh-CHS": "4. 个人意见书的策略"
    },
    {
      "indent": 3,
      "text": "This section identifies opportunities to promote IPR disclosure within the IETF document lifecycle for documents that are processed outside the context of a working group (so-called \"individual submissions\"). In general, these opportunities are encountered during initial public discussion, area director review, and IETF Last Call.",
      "zh-CHS": "本节确定了在IETF文件生命周期内促进在工作组范围外处理的文件（所谓的“个人提交”）的知识产权披露的机会。一般来说，这些机会都是在最初的公开讨论、区域主管审查和IETF最后一次通话中遇到的。"
    },
    {
      "indent": 0,
      "text": "4.1. Presenting an Internet-Draft at an IETF Meeting",
      "section_title": true,
      "zh-CHS": "4.1. 在IETF会议上提交互联网草案"
    },
    {
      "indent": 3,
      "text": "When IETF participants wish to promote public discussion of a personal draft not intended for a working group, it is still common to request a slot on the agenda at an upcoming face-to-face meeting. These requests might be made to related working groups or area meetings, or even during plenary time. Before the community commits resources to reviewing and considering the draft, it is very reasonable for the chairs of that meeting (WG chair, AD, IESG chair, or IAB chair) to confirm that all IPR disclosures have been submitted.",
      "zh-CHS": "当IETF参与者希望促进对非工作组个人草案的公开讨论时，在即将召开的面对面会议上要求在议程上留出时间仍然很常见。这些请求可以向相关工作组或地区会议提出，甚至可以在全体会议期间提出。在社区投入资源审查和审议草案之前，该会议的主席（工作组主席、AD、IESG主席或IAB主席）确认已提交所有知识产权披露是非常合理的。"
    },
    {
      "indent": 3,
      "text": "The meeting chairs ought to request confirmation from each of the authors and listed contributors, especially if those individuals are associated with multiple organizations. Where the presentation covers a concept that has not yet been documented as an Internet-Draft, the chairs ought to at least request informal disclosure from the authors and listed contributors, as described above.",
      "zh-CHS": "会议主席应要求每位作者和列出的贡献者确认，特别是如果这些人与多个组织有关联。如果演示文稿涉及的概念尚未记录为互联网草案，主席应至少要求作者和所列撰稿人进行非正式披露，如上所述。"
    },
    {
      "indent": 3,
      "text": "A sample message of the kind that might be sent at this stage is provided under Appendix A.2.",
      "zh-CHS": "附录A.2中提供了本阶段可能发送的此类信息的示例。"
    },
    {
      "indent": 0,
      "text": "4.2. AD Review",
      "section_title": true,
      "zh-CHS": "4.2. 广告评论"
    },
    {
      "indent": 3,
      "text": "When considering the possibility of sponsoring an individual submission, an AD ought to confirm that all IPR disclosures have been submitted. The AD ought to require confirmation from each of the authors and listed contributors, even if those individuals are associated with the same organization. As with WG documents, a Document Shepherd Write-Up is also required for AD-sponsored documents, following the template at <http://www.ietf.org/iesg/template/individual-doc-writeup.html>. At the time of this writing, the template asks the document shepherd to answer the following question:",
      "zh-CHS": "在考虑赞助个人提交的可能性时，广告应确认已提交所有知识产权披露。广告应该要求每个作者和列出的贡献者确认，即使这些人与同一组织有关联。与工作组文件一样，广告赞助文件也需要按照<http://www.ietf.org/iesg/template/individual-doc-writeup.html>. 在撰写本文时，模板要求文档管理员回答以下问题："
    },
    {
      "indent": 6,
      "text": "(7) Has each author confirmed that any and all appropriate IPR disclosures required for full conformance with the provisions of BCP 78 and BCP 79 have already been filed? If not, explain why.",
      "zh-CHS": "(7) 每位作者是否已确认已提交了完全符合BCP 78和BCP 79规定所需的任何和所有适当的知识产权披露？如果没有，请解释原因。"
    },
    {
      "indent": 3,
      "text": "A sample message of the kind that might be sent at this stage is provided under Appendix A.6.",
      "zh-CHS": "附录A.6中提供了本阶段可能发送的此类信息的示例。"
    },
    {
      "indent": 0,
      "text": "4.3. IETF Last Call",
      "section_title": true,
      "zh-CHS": "4.3. IETF最后一次呼叫"
    },
    {
      "indent": 3,
      "text": "As with working group documents, IETF Last Call is the mechanism used by the AD and the IESG as a whole to gauge IETF-wide consensus. It is critical that the community have easy access to all related IPR statements when considering an Internet-Draft. The current tools automatically include the URL for each IPR statement explicitly linked to the draft when the default IETF Last Call message is generated. If the AD edits this message, the links to IPR disclosure statements ought to be preserved.",
      "zh-CHS": "与工作组文件一样，IETF Last Call是AD和IESG作为一个整体用来衡量IETF广泛共识的机制。在考虑互联网草案时，社区能够轻松访问所有相关的知识产权声明，这一点至关重要。当生成默认的IETF最后一次调用消息时，当前工具会自动包含显式链接到草稿的每个IPR语句的URL。如果广告编辑了此消息，则应保留与知识产权披露声明的链接。"
    },
    {
      "indent": 0,
      "text": "5. A Note about Preliminary Disclosures",
      "section_title": true,
      "zh-CHS": "5. 关于初步披露的说明"
    },
    {
      "indent": 3,
      "text": "Early disclosures are not necessarily complete disclosures. Indeed, [RFC3979] can be read as encouraging \"preliminary disclosure\" (e.g., when a new patent application is made), yet a preliminary disclosure might not be updated as new information becomes available later in the standardization process (e.g., when a patent is actually granted). To help prevent early IPR disclosures from becoming stale or incomplete, at important junctures in the standardization process (e.g., at working group adoption, before Working Group Last Call, and before IETF Last Call) WG chairs and ADs are encouraged to request that the Executive Director of the IETF contact those who submitted early IPR disclosures about updating their disclosures.",
      "zh-CHS": "早期披露不一定是完全披露。事实上，[RFC3979]可以理解为鼓励“初步披露”（例如，当提出新的专利申请时），然而，随着标准化过程中的新信息变得可用（例如，当实际授予专利时），初步披露可能不会更新。在标准化过程中的重要关头（例如，在工作组通过时、工作组最后一次呼叫前和IETF最后一次呼叫前），帮助防止早期知识产权披露变得陈旧或不完整鼓励工作组主席和ADs要求IETF执行主任联系提交早期知识产权披露的人员，以更新其披露。"
    },
    {
      "indent": 0,
      "text": "6. Conclusions",
      "section_title": true,
      "zh-CHS": "6. 结论"
    },
    {
      "indent": 3,
      "text": "WG chairs and ADs are not expected to enforce IPR disclosure rules, and this document does not suggest that they take on such a role. However, lack of compliance with IPR disclosure policies can have a significant impact on the Internet Standards Process. To support the efficient development of IETF standards and avoid unnecessary delays, WG chairs and ADs are encouraged to look for opportunities to promote awareness and compliance with the IETF's IPR policies. The strategies in this document promote compliance by raising the question of IPR disclosure at critical junctures in the standardization process.",
      "zh-CHS": "工作组主席和广告不应强制执行知识产权披露规则，本文件也不建议他们扮演这样的角色。然而，不遵守知识产权披露政策可能会对互联网标准流程产生重大影响。为了支持IETF标准的有效制定并避免不必要的延误，鼓励工作组主席和广告寻找机会，提高对IETF知识产权政策的认识和遵守。本文件中的策略通过在标准化过程的关键时刻提出知识产权披露问题来促进合规性。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document suggests strategies for promoting compliance with IPR disclosure rules during the IETF Standards Process. These procedures do not have a direct impact on the security of the Internet.",
      "zh-CHS": "本文件提出了在IETF标准过程中促进遵守知识产权披露规则的策略。这些程序对互联网的安全没有直接影响。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3979] Bradner, S., Ed., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3979, March 2005.",
      "zh-CHS": "[RFC3979]Bradner，S.，Ed.，“IETF技术中的知识产权”，BCP 79，RFC 3979，2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4879] Narten, T., \"Clarification of the Third Party Disclosure Procedure in RFC 3979\", BCP 79, RFC 4879, April 2007.",
      "zh-CHS": "[RFC4879]Narten，T.，“RFC 3979中第三方披露程序的澄清”，BCP 79，RFC 4879，2007年4月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC1602] Internet Architecture Board and Internet Engineering Steering Group, \"The Internet Standards Process -- Revision 2\", RFC 1602, March 1994.",
      "zh-CHS": "[RFC1602]互联网架构委员会和互联网工程指导小组，“互联网标准过程——第2版”，RFC1602，1994年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2418] Bradner, S., \"IETF Working Group Guidelines and Procedures\", BCP 25, RFC 2418, September 1998.",
      "zh-CHS": "[RFC2418]Bradner，S.，“IETF工作组指南和程序”，BCP 25，RFC 2418，1998年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3669] Brim, S., \"Guidelines for Working Groups on Intellectual Property Issues\", RFC 3669, February 2004.",
      "zh-CHS": "[RFC3669]Brim，S.，“知识产权问题工作组指南”，RFC 3669，2004年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4858] Levkowetz, H., Meyer, D., Eggert, L., and A. Mankin, \"Document Shepherding from Working Group Last Call to Publication\", RFC 4858, May 2007.",
      "zh-CHS": "[RFC4858]Levkowetz，H.，Meyer，D.，Eggert，L.，和A.Mankin，“工作组最后一次呼吁出版的文件管理”，RFC 4858，2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5378] Bradner, S., Ed., and J. Contreras, Ed., \"Rights Contributors Provide to the IETF Trust\", BCP 78, RFC 5378, November 2008.",
      "zh-CHS": "[RFC5378]Bradner，S.，Ed.，和J.Contreras，Ed.，“向IETF信托提供的权利出资人”，BCP 78，RFC 5378，2008年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5741] Daigle, L., Ed., Kolkman, O., Ed., and IAB, \"RFC Streams, Headers, and Boilerplates\", RFC 5741, December 2009.",
      "zh-CHS": "[RFC5741]Daigle，L.，Ed.，Kolkman，O.，Ed.，和IAB，“RFC流，标题和样板”，RFC 57412009年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC6701] Farrel, A. and P. Resnick, \"Sanctions Available for Application to Violators of IETF IPR Policy\", RFC 6701, August 2012.",
      "zh-CHS": "[RFC6701]Farrel，A.和P.Resnick，“适用于违反IETF知识产权政策者的制裁”，RFC 6701，2012年8月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Sample Messages",
      "section_title": true,
      "zh-CHS": "附录A.信息示例"
    },
    {
      "indent": 3,
      "text": "This section provides sample messages of the kind that ADs, WG chairs, and WG secretaries can send to meeting presenters, document authors, document editors, listed contributors, and working groups during various stages of the Internet Standards Process. The messages use a hypothetical working group called the \"FOO WG\", hypothetical WG chairs named \"Alice\" and \"Bob\", a hypothetical author named \"Nigel Throckmorton\", a hypothetical AD named \"Christopher\", and hypothetical documents about a hypothetical technology called \"wiffle\"; any resemblance to actual working groups, WG chairs, ADs, or documents is strictly coincidental. The last two messages might be appropriate for sending to individuals who have requested a slot on the agenda during an IETF meeting or who have requested AD sponsorship of an individual submission.",
      "zh-CHS": "本节提供了广告、工作组主席和工作组秘书可在互联网标准过程的各个阶段向会议主持人、文件作者、文件编辑、列出的贡献者和工作组发送的信息示例。这些信息使用了一个名为“FOO WG”的假想工作组，一个名为“Alice”和“Bob”的假想工作组主席，一个名为“Nigel Throckmorton”的假想作者，一个名为“Christopher”的假想广告，以及一个名为“wiffle”的假想技术的假想文档；任何与实际工作组、工作组主席、广告或文件的相似之处都完全是巧合。最后两条消息可能适用于发送给在IETF会议期间要求在议程上占有一席之地的个人，或要求对个人提交进行广告赞助的个人。"
    },
    {
      "indent": 0,
      "text": "A.1. General WG Reminder",
      "section_title": true,
      "zh-CHS": "A.1. 一般工作组提醒"
    },
    {
      "indent": 3,
      "text": "Subject: Reminder about IETF IPR Policy",
      "zh-CHS": "主题：IETF知识产权政策提醒"
    },
    {
      "indent": 3,
      "text": "Dear FOO WG:",
      "zh-CHS": "亲爱的傅工作组："
    },
    {
      "indent": 3,
      "text": "As FOO WG chairs, we would like to minimize or hopefully even eliminate late disclosures relating to documents under consideration within the FOO WG. Therefore, you might see us send \"reminder\" messages in the future to authors or to the FOO WG email list as a whole, asking people whether they know of Intellectual Property Rights (IPR) relating to specific documents. In order to comply with IETF processes and avoid unnecessary delays, document authors and contributors to our discussions in the FOO WG are asked to pay careful attention to these messages and to reply in a timely fashion.",
      "zh-CHS": "作为FOO工作组主席，我们希望尽量减少甚至消除与FOO工作组内正在考虑的文件相关的延迟披露。因此，您可能会看到我们在未来向作者或整个FOO WG电子邮件列表发送“提醒”消息，询问人们是否知道与特定文档相关的知识产权（IPR）。为了遵守IETF流程并避免不必要的延迟，要求文件作者和参与我们在FOO工作组讨论的参与者仔细关注这些信息，并及时回复。"
    },
    {
      "indent": 3,
      "text": "Please note that these messages are only reminders of existing IETF policy, and we are all bound by that policy even in the absence of such reminder messages. Everyone who participates in the Internet Standards Process (whether by posting to IETF mailing lists, authoring documents, attending IETF meetings, or in other ways) needs to be aware of the IETF rules with regard to IPR. These rules are described in BCP 79 and can be referenced through <http://www.ietf.org/ipr/policy.html>. In addition, online tools for filing IPR disclosures can be found at <http://www.ietf.org/ipr/file-disclosure>. Finally, existing disclosures can be searched online at <https://datatracker.ietf.org/ipr/search/>.",
      "zh-CHS": "请注意，这些消息只是现有IETF策略的提醒，即使没有此类提醒消息，我们都受该策略的约束。参与互联网标准过程的每个人（无论是通过张贴到IETF邮件列表、编写文档、参加IETF会议，还是以其他方式）都需要了解IETF关于知识产权的规则。这些规则在BCP 79中有描述，可通过<http://www.ietf.org/ipr/policy.html>. 此外，可以在以下网址找到用于提交知识产权披露的在线工具：<http://www.ietf.org/ipr/file-disclosure>. 最后，可以在线搜索现有披露信息，网址为<https://datatracker.ietf.org/ipr/search/>."
    },
    {
      "indent": 3,
      "text": "Also note that these are personal requirements applying to all IETF participants as individuals, and that these requirements also apply to all participants in the FOO WG.",
      "zh-CHS": "还请注意，这些是适用于所有IETF参与者的个人要求，这些要求也适用于FOO工作组的所有参与者。"
    },
    {
      "indent": 3,
      "text": "Thanks,",
      "zh-CHS": "谢谢"
    },
    {
      "indent": 3,
      "text": "Alice and Bob",
      "zh-CHS": "爱丽丝和鲍勃"
    },
    {
      "indent": 3,
      "text": "(as FOO WG co-chairs)",
      "zh-CHS": "（作为FOO工作组联合主席）"
    },
    {
      "indent": 0,
      "text": "A.2. Reminder to Meeting Presenter",
      "section_title": true,
      "zh-CHS": "A.2. 提醒会议主持人"
    },
    {
      "indent": 3,
      "text": "Subject: IPR about draft-throckmorton-wiffle-bar",
      "zh-CHS": "主题：关于Drawt throckmorton wiffle bar的知识产权"
    },
    {
      "indent": 3,
      "text": "Dear Nigel,",
      "zh-CHS": "亲爱的奈杰尔：，"
    },
    {
      "indent": 3,
      "text": "I have received your request to give a talk about draft-throckmorton-wiffle-bar at the next IETF meeting. Before approving this request, I would like to check whether there are any claims of Intellectual Property Rights (IPR) on this document.",
      "zh-CHS": "我已收到您的请求，在下一次IETF会议上就draft throckmorton wiffle bar发表演讲。在批准此请求之前，我想检查此文档是否存在任何知识产权（IPR）声明。"
    },
    {
      "indent": 3,
      "text": "Are you aware of any IPR that applies to draft-throckmorton-wiffle-bar? If so, has this IPR been disclosed in compliance with IETF IPR rules? (See RFCs 3979, 4879, 3669, and 5378 for more details.)",
      "zh-CHS": "您是否知道适用于draft throckmorton wiffle bar的任何知识产权？如果是，该知识产权是否按照IETF知识产权规则披露？（有关更多详细信息，请参阅RFCs 3979、4879、3669和5378。）"
    },
    {
      "indent": 3,
      "text": "Please reply to this email regardless of whether or not you are personally aware of any relevant IPR. I might not be able to approve your request for a slot on the agenda until I have received a reply from you and any listed contributor.",
      "zh-CHS": "请回复此电子邮件，无论您个人是否了解任何相关知识产权。在收到您和任何列出的投稿人的回复之前，我可能无法批准您在议程上的席位申请。"
    },
    {
      "indent": 3,
      "text": "Online tools for filing IPR disclosures can be found at <http://www.ietf.org/ipr/file-disclosure>.",
      "zh-CHS": "有关提交知识产权披露的在线工具，请访问<http://www.ietf.org/ipr/file-disclosure>."
    },
    {
      "indent": 3,
      "text": "Thanks,",
      "zh-CHS": "谢谢"
    },
    {
      "indent": 3,
      "text": "Alice",
      "zh-CHS": "爱丽丝"
    },
    {
      "indent": 3,
      "text": "(as FOO WG co-chair)",
      "zh-CHS": "（作为FOO工作组联合主席）"
    },
    {
      "indent": 0,
      "text": "A.3. Reminder before WG Adoption of an Individual Internet-Draft",
      "section_title": true,
      "zh-CHS": "A.3. 工作组通过个别互联网草案前的提醒"
    },
    {
      "indent": 3,
      "text": "Subject: Reminder about IPR relating to draft-throckmorton-foo-wiffle",
      "zh-CHS": "主题：throckmorton foo wiffle草案相关知识产权提醒"
    },
    {
      "indent": 3,
      "text": "Dear FOO WG, and Especially Authors and Contributors:",
      "zh-CHS": "尊敬的FOO WG，尤其是作者和贡献者："
    },
    {
      "indent": 3,
      "text": "As you can see from the consensus call the WG chairs have sent out, the authors have asked for draft-throckmorton-foo-wiffle to be considered for adoption as a WG document. We would like to check whether there are claims of Intellectual Property Rights (IPR) on the document that need to be disclosed.",
      "zh-CHS": "从工作组主席发出的共识电话中可以看出，作者要求将throckmorton foo wiffle草案作为工作组文件考虑通过。我们希望检查文件上是否有需要披露的知识产权（IPR）声明。"
    },
    {
      "indent": 3,
      "text": "Are you personally aware of any IPR that applies to draft-throckmorton-foo-wiffle? If so, has this IPR been disclosed in compliance with IETF IPR rules? (See RFCs 3979, 4879, 3669, and 5378 for more details.)",
      "zh-CHS": "您个人是否知道适用于draft throckmorton foo wiffle的任何知识产权？如果是，该知识产权是否按照IETF知识产权规则披露？（有关更多详细信息，请参阅RFCs 3979、4879、3669和5378。）"
    },
    {
      "indent": 3,
      "text": "If you are a document author or listed contributor on this document, please reply to this email message regardless of whether or not you are personally aware of any relevant IPR. We might not be able to advance this document to the next stage until we have received a reply from each author and listed contributor.",
      "zh-CHS": "如果您是本文档的作者或列出的贡献者，请回复此电子邮件，无论您个人是否了解任何相关知识产权。在收到每位作者和列出的贡献者的回复之前，我们可能无法将本文档推进到下一阶段。"
    },
    {
      "indent": 3,
      "text": "If you are on the FOO WG email list but are not an author or listed contributor for this document, you are reminded of your opportunity for a voluntary IPR disclosure under BCP 79. Please do not reply unless you want to make such a voluntary disclosure.",
      "zh-CHS": "如果您在FOO WG电子邮件列表中，但不是本文件的作者或列出的投稿人，则会提醒您根据BCP 79自愿披露知识产权的机会。请不要回复，除非你想自愿披露。"
    },
    {
      "indent": 3,
      "text": "Online tools for filing IPR disclosures can be found at <http://www.ietf.org/ipr/file-disclosure>.",
      "zh-CHS": "有关提交知识产权披露的在线工具，请访问<http://www.ietf.org/ipr/file-disclosure>."
    },
    {
      "indent": 3,
      "text": "Thanks,",
      "zh-CHS": "谢谢"
    },
    {
      "indent": 3,
      "text": "Alice",
      "zh-CHS": "爱丽丝"
    },
    {
      "indent": 3,
      "text": "(as FOO WG co-chair)",
      "zh-CHS": "（作为FOO工作组联合主席）"
    },
    {
      "indent": 0,
      "text": "A.4. Reminder before Working Group Last Call",
      "section_title": true,
      "zh-CHS": "A.4. 工作组最后一次通话前提醒"
    },
    {
      "indent": 3,
      "text": "Subject: Reminder about IPR relating to draft-ietf-foo-wiffle",
      "zh-CHS": "主题：与ietf foo wiffle草案相关的知识产权提醒"
    },
    {
      "indent": 3,
      "text": "Dear FOO WG:",
      "zh-CHS": "亲爱的傅工作组："
    },
    {
      "indent": 3,
      "text": "The authors of draft-ietf-foo-wiffle have asked for a Working Group Last Call. Before issuing the Working Group Last Call, we would like to check whether any claims of Intellectual Property Rights (IPR) on the document have not yet been disclosed.",
      "zh-CHS": "ietf-foo-wiffle草案的作者在最后一次电话会议上要求成立一个工作组。在发出工作组最后一次电话之前，我们想检查是否有任何关于该文件的知识产权（IPR）主张尚未披露。"
    },
    {
      "indent": 3,
      "text": "Are you personally aware of any IPR that applies to draft-ietf-foo-wiffle? If so, has this IPR been disclosed in compliance with IETF IPR rules? (See RFCs 3979, 4879, 3669, and 5378 for more details.)",
      "zh-CHS": "您个人是否知道适用于ietf foo wiffle草案的任何知识产权？如果是，该知识产权是否按照IETF知识产权规则披露？（有关更多详细信息，请参阅RFCs 3979、4879、3669和5378。）"
    },
    {
      "indent": 3,
      "text": "If you are a document author or listed contributor on this document, please reply to this email regardless of whether or not you are personally aware of any relevant IPR. We might not be able to advance this document to the next stage until we have received a reply from each author and listed contributor.",
      "zh-CHS": "如果您是本文档的作者或列出的贡献者，请回复此电子邮件，无论您个人是否了解任何相关知识产权。在收到每位作者和列出的贡献者的回复之前，我们可能无法将本文档推进到下一阶段。"
    },
    {
      "indent": 3,
      "text": "If you are on the FOO WG email list but are not an author or listed contributor for this document, you are reminded of your opportunity for a voluntary IPR disclosure under BCP 79. Please do not reply unless you want to make such a voluntary disclosure.",
      "zh-CHS": "如果您在FOO WG电子邮件列表中，但不是本文件的作者或列出的投稿人，则会提醒您根据BCP 79自愿披露知识产权的机会。请不要回复，除非你想自愿披露。"
    },
    {
      "indent": 3,
      "text": "Online tools for filing IPR disclosures can be found at <http://www.ietf.org/ipr/file-disclosure>.",
      "zh-CHS": "有关提交知识产权披露的在线工具，请访问<http://www.ietf.org/ipr/file-disclosure>."
    },
    {
      "indent": 3,
      "text": "Thanks,",
      "zh-CHS": "谢谢"
    },
    {
      "indent": 3,
      "text": "Bob",
      "zh-CHS": "上下快速移动"
    },
    {
      "indent": 3,
      "text": "(as FOO WG co-chair)",
      "zh-CHS": "（作为FOO工作组联合主席）"
    },
    {
      "indent": 0,
      "text": "A.5. Reminder to Authors and Listed Contributors of a Working Group Document before IETF Last Call",
      "zh-CHS": "A.5. 在IETF最后一次呼叫前提醒工作组文件的作者和列出的贡献者"
    },
    {
      "indent": 3,
      "text": "Subject: Reminder about IPR relating to draft-ietf-foo-wiffle",
      "zh-CHS": "主题：与ietf foo wiffle草案相关的知识产权提醒"
    },
    {
      "indent": 3,
      "text": "Dear Authors and Contributors (Chairs and Shepherd cc'd),",
      "zh-CHS": "尊敬的作者和撰稿人（主席和谢泼德抄送），"
    },
    {
      "indent": 3,
      "text": "Before proceeding with your request to issue an IETF Last Call on draft-ietf-foo-wiffle, I would like to check whether there are any claims of Intellectual Property Rights (IPR) on the document.",
      "zh-CHS": "在继续就IETF foo wiffle草案发出IETF最后一次请求之前，我想检查一下文件上是否有任何知识产权（IPR）主张。"
    },
    {
      "indent": 3,
      "text": "Are you personally aware of any IPR that applies to draft-ietf-foo-wiffle? If so, has this IPR been disclosed in compliance with IETF IPR rules? (See RFCs 3979, 4879, 3669, and 5378 for more details.)",
      "zh-CHS": "您个人是否知道适用于ietf foo wiffle草案的任何知识产权？如果是，该知识产权是否按照IETF知识产权规则披露？（有关更多详细信息，请参阅RFCs 3979、4879、3669和5378。）"
    },
    {
      "indent": 3,
      "text": "Please reply to this email regardless of whether or not you are personally aware of any relevant IPR. I might not be able to advance this document to the next stage until I have received a reply from you and any listed contributor.",
      "zh-CHS": "请回复此电子邮件，无论您个人是否了解任何相关知识产权。在收到您和任何列出的投稿人的回复之前，我可能无法将此文档推进到下一阶段。"
    },
    {
      "indent": 3,
      "text": "Online tools for filing IPR disclosures can be found at <http://www.ietf.org/ipr/file-disclosure>.",
      "zh-CHS": "有关提交知识产权披露的在线工具，请访问<http://www.ietf.org/ipr/file-disclosure>."
    },
    {
      "indent": 3,
      "text": "Thanks,",
      "zh-CHS": "谢谢"
    },
    {
      "indent": 3,
      "text": "Christopher",
      "zh-CHS": "克里斯托弗"
    },
    {
      "indent": 3,
      "text": "(as AD)",
      "zh-CHS": "（作为广告）"
    },
    {
      "indent": 0,
      "text": "A.6. Reminder to Author of an Individual Submission before IETF Last Call",
      "zh-CHS": "A.6. 在IETF最后一次呼叫前提醒作者个人提交"
    },
    {
      "indent": 3,
      "text": "Subject: Reminder about IPR relating to draft-throckmorton-wiffle-bar",
      "zh-CHS": "主题：与draft throckmorton wiffle bar相关的知识产权提醒"
    },
    {
      "indent": 3,
      "text": "Dear Nigel,",
      "zh-CHS": "亲爱的奈杰尔：，"
    },
    {
      "indent": 3,
      "text": "Before proceeding with your request for AD sponsoring of draft-throckmorton-wiffle-bar, I would like to check whether there are any claims of Intellectual Property Rights (IPR) on the document.",
      "zh-CHS": "在您继续请求广告赞助draft throckmorton wiffle bar之前，我想检查一下文件上是否有任何知识产权（IPR）声明。"
    },
    {
      "indent": 3,
      "text": "Are you personally aware of any IPR that applies to draft-throckmorton-wiffle-bar? If so, has this IPR been disclosed in compliance with IETF IPR rules? (See RFCs 3979, 4879, 3669, and 5378 for more details.)",
      "zh-CHS": "您个人是否知道适用于draft throckmorton wiffle bar的任何知识产权？如果是，该知识产权是否按照IETF知识产权规则披露？（有关更多详细信息，请参阅RFCs 3979、4879、3669和5378。）"
    },
    {
      "indent": 3,
      "text": "Please reply to this email regardless of whether or not you are personally aware of any relevant IPR. I might not be able to advance this document to the next stage until I have received a reply from you and any listed contributor.",
      "zh-CHS": "请回复此电子邮件，无论您个人是否了解任何相关知识产权。在收到您和任何列出的投稿人的回复之前，我可能无法将此文档推进到下一阶段。"
    },
    {
      "indent": 3,
      "text": "Online tools for filing IPR disclosures can be found at <http://www.ietf.org/ipr/file-disclosure>.",
      "zh-CHS": "有关提交知识产权披露的在线工具，请访问<http://www.ietf.org/ipr/file-disclosure>."
    },
    {
      "indent": 3,
      "text": "Thanks,",
      "zh-CHS": "谢谢"
    },
    {
      "indent": 3,
      "text": "Christopher",
      "zh-CHS": "克里斯托弗"
    },
    {
      "indent": 3,
      "text": "(as AD)",
      "zh-CHS": "（作为广告）"
    },
    {
      "indent": 0,
      "text": "Appendix B. Acknowledgements",
      "section_title": true,
      "zh-CHS": "附录B.确认书"
    },
    {
      "indent": 3,
      "text": "Thanks to Scott Brim, Stewart Bryant, Benoit Claise, Adrian Farrel, Stephen Farrell, Russ Housley, Subramanian Moonesamy, Thomas Narten, Pete Resnick, and Stephan Wenger for their feedback; to Loa Andersson, Ross Callon, and George Swallow for drafts of some of the sample email messages; and to Stephen Farrell for shepherding the document.",
      "zh-CHS": "感谢Scott Brim、Stewart Bryant、Benoit Claise、Adrian Farrell、Stephen Farrell、Russ Housley、Subramanian Moonesamy、Thomas Narten、Pete Resnick和Stephan Wenger的反馈；向Loa Andersson、Ross Callon和George Swallow索取一些示例电子邮件的草稿；还有斯蒂芬·法雷尔，他负责管理这份文件。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Tim Polk National Institute of Standards and Technology 100 Bureau Drive, MS 8930 Gaithersburg, MD 20899-8930 USA",
      "zh-CHS": "蒂姆·波尔克国家标准与技术研究所美国马里兰州盖瑟斯堡市局道100号，邮编：8930 20899-8930"
    },
    {
      "indent": 3,
      "text": "EMail: tim.polk@nist.gov",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre Cisco Systems, Inc. 1899 Wynkoop Street, Suite 600 Denver, CO 80202 USA",
      "zh-CHS": "Peter Saint Andre Cisco Systems，Inc.美国科罗拉多州丹佛市温库普街1899号600室，邮编：80202"
    },
    {
      "indent": 3,
      "text": "Phone: +1-303-308-3282\nEMail: psaintan@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}