{
  "title": {
    "text": "RFC 6233: IS-IS Registry Extension for Purges",
    "zh-CHS": "RFC 6233"
  },
  "number": 6233,
  "created_at": "2021-11-05 17:12:29.973591+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                             T. Li\nRequest for Comments: 6233                                   L. Ginsberg\nUpdates: 3563, 5304, 5310                            Cisco Systems, Inc.\nCategory: Standards Track                                       May 2011\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 18,
      "text": "IS-IS Registry Extension for Purges",
      "zh-CHS": "用于清除的IS-IS注册表扩展"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "IANA maintains the \"IS-IS TLV Codepoints\" registry. This registry documents which TLVs can appear in different types of IS-IS Protocol Data Units (PDUs), but does not document which TLVs can be found in zero Remaining Lifetime Link State PDUs (LSPs), a.k.a. purges. This document extends the existing registry to record the set of TLVs that are permissible in purges and updates the rules for generating and processing purges in the presence of authentication. This document updates RFC 3563, RFC 5304, and RFC 5310.",
      "zh-CHS": "IANA维护“IS-IS TLV代码点”注册表。该注册表记录了哪些TLV可以出现在不同类型的IS-IS协议数据单元（PDU）中，但没有记录在剩余寿命为零的链路状态PDU（LSP）中可以找到哪些TLV，也称为清除。本文档扩展了现有注册表，以记录清除中允许的TLV集，并更新在存在身份验证时生成和处理清除的规则。本文档更新了RFC 3563、RFC 5304和RFC 5310。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6233.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6233."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Requirements Language ......................................2\n2. Registry Changes ................................................2\n3. Purges and Authentication .......................................3\n4. IANA Considerations .............................................3\n5. Security Considerations .........................................3\n6. Normative References ............................................4",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The IS-IS [ISO-10589] routing protocol maintains a link state database of the topology of its routing domain by flooding a set of Link State Protocol Data Units (LSPs). When the protocol no longer needs the information stored in an LSP, it uses the purge mechanism to cause the Intermediate Systems (ISs) in its domain to discard the information contained in the LSP. The process for generating purges can be found in Section 7.3.16.4 of [ISO-10589]. This process retains only the LSP header, discarding any TLVs that had been carried within the LSP.",
      "zh-CHS": "IS-IS[ISO-10589]路由协议通过淹没一组链路状态协议数据单元（LSP）来维护其路由域拓扑的链路状态数据库。当协议不再需要LSP中存储的信息时，它使用清除机制使其域中的中间系统（ISs）丢弃LSP中包含的信息。产生清洗的过程见[ISO-10589]第7.3.16.4节。此过程仅保留LSP标头，丢弃LSP中携带的任何TLV。"
    },
    {
      "indent": 3,
      "text": "Subsequent enhancements to IS-IS, such as [RFC5304] [RFC5310], amend the process of generating a purge and allow the inclusion of certain TLVs in purges.",
      "zh-CHS": "IS-IS的后续增强功能，如[RFC5304][RFC5310]，修改了生成吹扫的过程，并允许在吹扫中包含某些TLV。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "1.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Registry Changes",
      "section_title": true,
      "zh-CHS": "2. 注册表更改"
    },
    {
      "indent": 3,
      "text": "This document extends the current \"IS-IS TLV Codepoints\" registry, defined in [RFC3563], to record the set of TLVs that MAY be found in purges. All other TLVs MUST NOT appear in purges. This will serve as an aid to subsequent documents, which can then refer to the registry as the definitive list of the TLVs allowed in purges. This will also act as an aid to implementers, providing them with an easily accessible compendium of allowable TLVs.",
      "zh-CHS": "本文档扩展了[RFC3563]中定义的当前“IS-IS TLV代码点”注册表，以记录可能在清除中找到的TLV集。所有其他TLV不得出现在清洗中。这将有助于后续文件，这些文件随后可以将登记册作为清洗中允许的TLV的最终列表。这也将对实施者起到帮助作用，为他们提供易于访问的允许TLV概要。"
    },
    {
      "indent": 3,
      "text": "The purge status defined for a given TLV applies to all sub-TLVs defined for that TLV.",
      "zh-CHS": "为给定TLV定义的清除状态适用于为该TLV定义的所有子TLV。"
    },
    {
      "indent": 0,
      "text": "3. Purges and Authentication",
      "section_title": true,
      "zh-CHS": "3. 清除和认证"
    },
    {
      "indent": 3,
      "text": "Previous documents on authentication [RFC5304] [RFC5310] required that an IS only accept a purge if it only contained the Authentication TLV.",
      "zh-CHS": "先前关于身份验证[RFC5304][RFC5310]的文档要求，只有在仅包含身份验证TLV时，才会接受清除。"
    },
    {
      "indent": 3,
      "text": "This document updates and generalizes that behavior as follows: an implementation that implements authentication MUST NOT accept a purge that contains any TLV listed in the registry that is not acceptable in a purge. An implementation MUST NOT accept a purge that contains a TLV not listed in the registry unless the purge also contains the Purge Originator Identification (POI) TLV [RFC6232]. Purges that are accepted MUST be propagated without removal of TLVs. If multiple purges are received for the same LSP, then the implementation MAY propagate any one of the purges.",
      "zh-CHS": "本文档更新并概括了该行为，如下所示：实现身份验证的实现不得接受包含注册表中列出的、在清除中不可接受的任何TLV的清除。实施不得接受包含未在注册表中列出的TLV的清除，除非该清除还包含清除发起人标识（POI）TLV[RFC6232]。接受的清洗必须在不移除TLV的情况下传播。如果为同一LSP接收到多个清除，则实现可以传播任何一个清除。"
    },
    {
      "indent": 3,
      "text": "If an implementation that implements authentication accepts a purge that does not include the POI TLV and it chooses to insert the POI TLV, it MUST also recompute authentication.",
      "zh-CHS": "如果实现身份验证的实现接受不包括POI TLV的清除，并选择插入POI TLV，则还必须重新计算身份验证。"
    },
    {
      "indent": 3,
      "text": "ISs MUST NOT accept LSPs with a non-zero Remaining Lifetime that contain the POI TLV.",
      "zh-CHS": "ISs不得接受剩余寿命非零且包含POI TLV的LSP。"
    },
    {
      "indent": 3,
      "text": "Purge generation is updated as follows: an implementation that implements authentication generates a purge by first removing any TLVs that are not listed in the registry as being acceptable in purges. The POI TLV MUST be added. Then any other TLVs that MAY be in purges, as shown by the registry, MAY be added. Finally, authentication, if any, is added.",
      "zh-CHS": "清除生成更新如下：实现身份验证的实现通过首先删除注册表中未列为清除中可接受的任何TLV来生成清除。必须添加POI TLV。然后，如注册表所示，可以添加可能处于清洗中的任何其他TLV。最后，添加了身份验证（如果有）。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has modified the \"IS-IS TLV Codepoints\" registry by adding a column in the registry for 'Purge'. A 'y' in this column indicates that the TLV for this row MAY be found in a purge. An 'n' in this column indicates that the TLV for this row MUST NOT be found in a purge.",
      "zh-CHS": "IANA修改了“IS-IS TLV代码点”注册表，在注册表中添加了“清除”列。此列中的“y”表示可以在清除中找到此行的TLV。此列中的“n”表示不能在清除中找到此行的TLV。"
    },
    {
      "indent": 3,
      "text": "The 'Purge' column should initially contain a 'y' for TLV type 10 (Authentication) and for TLV type 137 (Dynamic hostname). All other entries in this column should have an 'n'. Other additions to this registry should explicitly specify their value for this column.",
      "zh-CHS": "对于TLV类型10（身份验证）和TLV类型137（动态主机名），“清除”列最初应包含一个“y”。此列中的所有其他条目应具有“n”。此注册表中的其他添加项应明确为此列指定其值。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security issues.",
      "zh-CHS": "本文档没有引入新的安全问题。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "zh-CHS": "6. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[ISO-10589] ISO, \"Intermediate system to Intermediate system intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode Network Service (ISO 8473)\", ISO/IEC 10589:2002.",
      "zh-CHS": "[ISO-10589]ISO，“与提供无连接模式网络服务协议（ISO 8473）一起使用的中间系统到中间系统域内路由信息交换协议”，ISO/IEC 10589:2002。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3563] Zinin, A., \"Cooperative Agreement Between the ISOC/IETF and ISO/IEC Joint Technical Committee 1/Sub Committee 6 (JTC1/SC6) on IS-IS Routing Protocol Development\", RFC 3563, July 2003.",
      "zh-CHS": "[RFC3563]Zinin，A.“ISO/IETF和ISO/IEC联合技术委员会1/第6分委员会（JTC1/SC6）之间关于IS-IS路由协议开发的合作协议”，RFC 3563，2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, October 2008.",
      "zh-CHS": "[RFC5304]Li，T.和R.Atkinson，“IS-IS加密认证”，RFC 5304，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, February 2009.",
      "zh-CHS": "[RFC5310]Bhatia，M.，Manral，V.，Li，T.，Atkinson，R.，White，R.，和M.Fanto，“IS-IS通用密码认证”，RFC 53102009年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6232] Wei, F., Qin, Y., Li, Z., Li, T., and J. Dong, \"Purge Originator Identification TLV for IS-IS\", RFC 6232, May 2011.",
      "zh-CHS": "[RFC6232]Wei，F.，Qin，Y.，Li，Z.，Li，T.，和J.Dong，“IS-IS的清除发起人识别TLV”，RFC 6232，2011年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Tony Li Cisco Systems, Inc. 170 W. Tasman Dr. San Jose, CA 95134 USA",
      "zh-CHS": "Tony Li Cisco Systems，Inc.170 W.Tasman博士，加利福尼亚州圣何塞，美国95134"
    },
    {
      "indent": 3,
      "text": "EMail: tony.li@tony.li",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Les Ginsberg Cisco Systems, Inc. 170 W. Tasman Dr. San Jose, CA 95134 USA",
      "zh-CHS": "Les Ginsberg Cisco Systems，Inc.美国加利福尼亚州圣何塞市塔斯曼博士170 W.95134"
    },
    {
      "indent": 3,
      "text": "EMail: ginsberg@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}