{
  "title": {
    "text": "RFC 6557: Procedures for Maintaining the Time Zone Database",
    "zh-CHS": "RFC 6557"
  },
  "number": 6557,
  "created_at": "2021-11-03 16:28:33.127083+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           E. Lear\nRequest for Comments: 6557                            Cisco Systems GmbH\nBCP: 175                                                       P. Eggert\nCategory: Best Current Practice                                     UCLA\nISSN: 2070-1721                                            February 2012",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Procedures for Maintaining the Time Zone Database",
      "zh-CHS": "维护时区数据库的程序"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Time zone information serves as a basic protocol element in protocols, such as the calendaring suite and DHCP. The Time Zone (TZ) Database specifies the indices used in various protocols, as well as their semantic meanings, for all localities throughout the world. This database has been meticulously maintained and distributed free of charge by a group of volunteers, coordinated by a single volunteer who is now planning to retire. This memo specifies procedures involved with maintenance of the TZ database and associated code, including how to submit proposed updates, how decisions for inclusion of those updates are made, and the selection of a designated expert by and for the time zone community. The intent of this memo is, to the extent possible, to document existing practice and provide a means to ease succession of the database maintainers.",
      "zh-CHS": "时区信息作为协议（如日历套件和DHCP）中的基本协议元素。时区（TZ）数据库为世界各地指定了各种协议中使用的索引及其语义。该数据库由一组志愿者精心维护并免费分发，由一名计划退休的志愿者负责协调。本备忘录规定了与TZ数据库和相关代码维护相关的程序，包括如何提交建议的更新，如何做出包含这些更新的决定，以及时区社区选择指定专家。本备忘录的目的是尽可能记录现有实践，并提供一种方便数据库维护人员继任的方法。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "zh-CHS": "本备忘录记录了互联网最佳实践。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关BCP的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6557.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6557."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2012 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The IETF has specified several standards that make use of time zone information. Time zone names are used in DHCP to configure devices with correct local time [RFC4833]. Time zone names can appear in the TZID field of calendaring VEVENTs [RFC5545]. The normative reference for these values is the TZ Database [TZDB]. From the early 1980s through 2011, that database, which has been in use on nearly all UNIX systems, Java systems, and other sorts of systems, was hosted at the U.S. National Institutes of Health (NIH). The database consists of both historic and current entries for geographies throughout the world. Associated with the database is a reference implementation of ISO/IEC 9899 C [ISO9899C] and IEEE 1003.1 [IEEE1003.1] POSIX time functions that can be used to convert time values.",
      "zh-CHS": "IETF规定了几个利用时区信息的标准。在DHCP中使用时区名称来配置具有正确本地时间的设备[RFC4833]。时区名称可以出现在日历事件[RFC5545]的TZID字段中。这些值的标准参考是TZ数据库[TZDB]。从20世纪80年代初到2011年，几乎所有UNIX系统、Java系统和其他类型的系统都使用了该数据库，该数据库由美国国立卫生研究院（NIH）托管。该数据库由世界各地的历史和当前条目组成。与数据库相关联的是ISO/IEC 9899 C[ISO9899C]和IEEE 1003.1[IEEE1003.1]POSIX时间函数的参考实现，可用于转换时间值。"
    },
    {
      "indent": 3,
      "text": "The database was previously maintained by volunteers who participated in the <tz@elsie.nci.nih.gov> mailing list that was also hosted at the NIH. The database itself is updated approximately twenty times per year, depending on the year, based on information these experts provide to the maintainer. Arthur David Olson has maintained the database, coordinated the mailing list, and provided a release platform since the database's inception. With his retirement now approaching, it is necessary to provide a means for this good work to continue.",
      "zh-CHS": "该数据库以前是由参与调查的志愿者维护的<tz@elsie.nci.nih.gov>美国国立卫生研究院的邮件列表。根据这些专家提供给维护人员的信息，数据库本身每年大约更新20次，具体取决于年份。自数据库建立以来，Arthur David Olson一直在维护数据库，协调邮件列表，并提供发布平台。随着他即将退休，有必要为这项良好工作的继续提供一种手段。"
    },
    {
      "indent": 3,
      "text": "The time zone community has requested that the IETF adopt the ongoing maintenance of the Time Zone Database. The time zone community would like the IETF to maintain it in a consistent fashion to its administration of the Internet protocol parameters and values.",
      "zh-CHS": "时区社区要求IETF采用时区数据库的持续维护。时区社区希望IETF以一致的方式维护它，以管理互联网协议参数和值。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "zh-CHS": "1.1. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "IANA (Internet Assigned Numbers Authority): For purposes of this RFC, IANA is a role, not an organization. The IANA Considerations defined in this RFC will be provided by the Internet Corporation for Assigned Names and Numbers (ICANN) in accordance with the IETF-ICANN \"Memorandum of Understanding Concerning Technical Work of the Internet Assigned Numbers Authority\", which was signed and ratified in March of 2000[RFC2860].",
      "zh-CHS": "IANA（互联网分配号码管理局）：就本RFC而言，IANA是一个角色，而不是一个组织。本RFC中定义的IANA考虑事项将由互联网名称和号码分配公司（ICANN）根据2000年3月签署和批准的IETF-ICANN“关于互联网分配号码管理局技术工作的谅解备忘录”提供[RFC2860]。"
    },
    {
      "indent": 3,
      "text": "TZ Database: The Time Zone Database, sometimes referred to as the \"Olson Database\". This database consists of information about offsets from UTC for different localities, including daylight saving time (DST) transition information.",
      "zh-CHS": "TZ数据库：时区数据库，有时称为“奥尔森数据库”。该数据库包含不同地区与UTC之间的偏移信息，包括夏令时（DST）转换信息。"
    },
    {
      "indent": 3,
      "text": "TZ Coordinator: The person or people who maintain and manage release of the TZ Database. The TZ Coordinator also has responsibility for managing the TZ mailing list. The TZ Coordinator is an IANA Designated Expert, as defined in Section 3.2 of [RFC5226], except as regards to appeals, as discussed in Section 5 of this document. Roughly speaking, this means that the IESG will choose one or more experts to manage the TZ database, code, and mailing list. The TZ Coordinator will also lead work to develop appropriate service metrics. There SHALL be a single lead individual and at least one backup individual for this function.",
      "zh-CHS": "TZ协调员：维护和管理TZ数据库发布的人员。TZ协调员还负责管理TZ邮件列表。TZ协调员是IANA指定的专家，定义见[RFC5226]第3.2节，本文件第5节讨论的上诉除外。粗略地说，这意味着IESG将选择一名或多名专家来管理TZ数据库、代码和邮件列表。TZ协调员还将领导制定适当服务指标的工作。该功能应有一名领导人员和至少一名后备人员。"
    },
    {
      "indent": 3,
      "text": "TZ mailing list: The forum where matters relating to the TZ database and supporting code are discussed.",
      "zh-CHS": "TZ邮件列表：讨论TZ数据库和支持代码相关事宜的论坛。"
    },
    {
      "indent": 3,
      "text": "The rest of this document specifies the following:",
      "zh-CHS": "本文件其余部分规定了以下内容："
    },
    {
      "indent": 3,
      "text": "1. Transferring and maintenance of the TZ mailing list;",
      "zh-CHS": "1. 传输和维护TZ邮件列表；"
    },
    {
      "indent": 3,
      "text": "2. Procedures for selecting a technical expert who will play the role of TZ Coordinator and release manager for the TZ database;",
      "zh-CHS": "2. 选择技术专家的程序，该专家将担任TZ数据库的TZ协调员和发布经理；"
    },
    {
      "indent": 3,
      "text": "3. Procedures for updating the TZ database;",
      "zh-CHS": "3. 更新TZ数据库的程序；"
    },
    {
      "indent": 3,
      "text": "4. Maintenance and ownership of reference code; and",
      "zh-CHS": "4. 参考代码的维护和所有权；和"
    },
    {
      "indent": 3,
      "text": "5. Ownership of the database.",
      "zh-CHS": "5. 数据库的所有权。"
    },
    {
      "indent": 0,
      "text": "2. The TZ Mailing List",
      "section_title": true,
      "zh-CHS": "2. TZ邮件列表"
    },
    {
      "indent": 3,
      "text": "For many years, the TZ mailing list has been the forum where discussion of changes to the TZ database and support files would take place. In addition, the TZ mailing list is used to announce releases of the database. Currently, the TZ mailing list is administered by the TZ Coordinator.",
      "zh-CHS": "多年来，TZ邮件列表一直是讨论TZ数据库和支持文件更改的论坛。此外，TZ邮件列表用于宣布数据库的发布。目前，TZ邮件列表由TZ协调员管理。"
    },
    {
      "indent": 3,
      "text": "This list membership, formerly at the NIH, has been transitioned to the IANA mail server. Its address, moving forward, is <tz@iana.org>. Subscriptions are processed at <https://mm.icann.org/mailman/listinfo/tz/>. The TZ Coordinator will continue to manage the list. While the TZ Coordinator may establish other rules of governance for the list, members of that list will be informed that a condition of participating on the list is that all contributions to the list are released to the public domain, and that by placing their contribution in the public domain, contributors waive forever any intellectual property claims.",
      "zh-CHS": "该列表成员以前在NIH，现在已经转移到IANA邮件服务器。它的地址是<tz@iana.org>. 订阅在以下位置处理：<https://mm.icann.org/mailman/listinfo/tz/>. TZ协调员将继续管理该名单。虽然TZ协调员可以为名单制定其他治理规则，但该名单的成员将被告知，参与名单的一个条件是，对名单的所有贡献都将公布在公共领域，并且通过将其贡献公布在公共领域，贡献者永远放弃任何知识产权要求。"
    },
    {
      "indent": 3,
      "text": "The list will be used just as it has been: to learn of, discuss, and confirm TZ definition changes, as well as to serve as an announcement list for new versions of the database.",
      "zh-CHS": "该列表将一如既往地使用：用于了解、讨论和确认TZ定义更改，以及作为数据库新版本的公告列表。"
    },
    {
      "indent": 0,
      "text": "3. Making Updates to the TZ Database",
      "section_title": true,
      "zh-CHS": "3. 对TZ数据库进行更新"
    },
    {
      "indent": 3,
      "text": "Updates to the TZ database are made by the TZ Coordinator in consultation with the TZ mailing list. The TZ Coordinator is empowered to decide, as the designated expert, appropriate changes, but SHOULD take into account views expressed on the mailing list.",
      "zh-CHS": "TZ协调员在咨询TZ邮件列表后，对TZ数据库进行更新。TZ协调员有权作为指定专家决定适当的变更，但应考虑邮件列表上表达的观点。"
    },
    {
      "indent": 3,
      "text": "The TZ Coordinator will also decide the timing of database releases. Today, the release itself consists of several archive files that are downloaded from a well-known location.",
      "zh-CHS": "TZ协调员还将决定数据库发布的时间。如今，该版本本身由几个从知名位置下载的归档文件组成。"
    },
    {
      "indent": 3,
      "text": "Moving forward, the TZ database, supporting code, and any appropriate supporting information SHOULD be cryptographically signed prior to release using well known public keys, along with any appropriate supporting information and distributed from <http://www.iana.org/time-zones>.",
      "zh-CHS": "今后，TZ数据库、支持代码和任何适当的支持信息应在发布前使用众所周知的公钥进行加密签名，以及任何适当的支持信息，并从<http://www.iana.org/time-zones>."
    },
    {
      "indent": 3,
      "text": "The criteria for updates to the database include the following:",
      "zh-CHS": "数据库更新的标准包括以下内容："
    },
    {
      "indent": 3,
      "text": "1. New TZ names (e.g., locations) are only to be created when the scope of the region a name was envisioned to cover is no longer accurate.",
      "zh-CHS": "1. 新的TZ名称（如位置）仅在名称所涵盖的区域范围不再准确时创建。"
    },
    {
      "indent": 3,
      "text": "2. In order to correct historical inaccuracies, a new TZ name MAY be added when it is necessary to indicate what was the consensus view at a given time and location. Such TZ names are usually not added when the inaccuracy was prior to 1970.",
      "zh-CHS": "2. 为了纠正历史上的错误，当有必要表明在给定时间和地点的共识观点时，可添加新的TZ名称。当误差在1970年之前时，通常不添加此类TZ名称。"
    },
    {
      "indent": 3,
      "text": "3. Changes to existing entries SHALL reflect the consensus on the ground in the region covered by that entry.",
      "zh-CHS": "3. 对现有条目的更改应反映该条目所涵盖区域的实地共识。"
    },
    {
      "indent": 3,
      "text": "To be clear, the TZ Coordinator SHALL NOT set time zone policy for a region but use judgment and whatever available sources exist to assess what the average person on street would think the time actually is, or in case of historical corrections, was.",
      "zh-CHS": "明确地说，TZ协调员不应为一个地区制定时区政策，而应使用判断和任何现有的可用来源来评估街道上的普通人认为实际时间是什么，或者在历史修正的情况下，时间是什么。"
    },
    {
      "indent": 0,
      "text": "4. Selecting or Replacing a TZ Coordinator",
      "section_title": true,
      "zh-CHS": "4. 选择或替换TZ协调器"
    },
    {
      "indent": 3,
      "text": "From time to time it will be necessary to appoint a new TZ Coordinator. This could occur for a number of reasons:",
      "zh-CHS": "不时有必要任命一名新的TZ协调员。出现这种情况的原因有很多："
    },
    {
      "indent": 3,
      "text": "o The TZ Coordinator is retiring (as Arthur David Olson is) or has announced that he or she will be unable to continue to perform the function;",
      "zh-CHS": "o TZ协调员即将退休（如Arthur David Olson），或已宣布他或她将无法继续履行职能；"
    },
    {
      "indent": 3,
      "text": "o The TZ Coordinator is missing, has become incapacitated, or has died; or",
      "zh-CHS": "o TZ协调员失踪、丧失工作能力或死亡；或"
    },
    {
      "indent": 3,
      "text": "o The TZ Coordinator is not performing the function in accordance with community wishes.",
      "zh-CHS": "o TZ协调员未按照社区意愿履行职能。"
    },
    {
      "indent": 3,
      "text": "In any of these cases, members of the community should raise the issue on the TZ mailing list and attempt to reach consensus on a new candidate to fulfill the role of TZ Coordinator. If rough consensus cannot be reached easily, the Area Directors of the IETF Applications Area should attempt to guide the members of the community to rough consensus. The candidate that is agreed upon by the community through rough consensus shall be presented to the IESG for confirmation. If rough consensus cannot be reached, even with guidance from the Applications Area Directors, the IESG shall use whatever means it has at its disposal to choose a candidate who in its best judgment will be able to fulfill the role of TZ Coordinator.",
      "zh-CHS": "在上述任何情况下，社区成员应在TZ邮件列表上提出问题，并尝试就新候选人达成共识，以履行TZ协调员的职责。如果难以达成大致共识，IETF应用领域的区域主管应尝试引导社区成员达成大致共识。社区通过初步协商一致同意的候选人应提交给IESG确认。如果无法达成大致共识，即使在应用领域主管的指导下，IESG也应使用其拥有的任何手段来选择一位最佳判断能够履行TZ协调员职责的候选人。"
    },
    {
      "indent": 0,
      "text": "5. Appealing Database Decisions",
      "section_title": true,
      "zh-CHS": "5. 吸引人的数据库决策"
    },
    {
      "indent": 3,
      "text": "The TZ Coordinator makes decisions based on expertise, as well as with guidance from the TZ mailing list. If a member of the community has a concern with an individual decision made by the TZ Coordinator with regard to the TZ database, the individual shall proceed as follows:",
      "zh-CHS": "TZ协调员根据专业知识以及TZ邮件列表的指导做出决策。如果社区成员对TZ协调员就TZ数据库做出的个人决定有疑问，则该个人应按照以下步骤进行："
    },
    {
      "indent": 3,
      "text": "1. Attempt to resolve the concern directly with the TZ Coordinator.",
      "zh-CHS": "1. 尝试直接与TZ协调员解决问题。"
    },
    {
      "indent": 3,
      "text": "2. If a resolution cannot be reached directly with the TZ Coordinator, express the concern to the community and attempt to achieve rough consensus regarding a resolution on the TZ mailing list. The Area Directors of the IETF Applications Area may at their discretion attempt to guide the members of the community to rough consensus.",
      "zh-CHS": "2. 如果无法直接与TZ协调员达成决议，请向社区表达关切，并尝试就TZ邮件列表上的决议达成大致共识。IETF应用领域的区域主管可自行决定尝试引导社区成员达成大致共识。"
    },
    {
      "indent": 3,
      "text": "3. As a last resort, if a resolution cannot be reached on the TZ mailing list, appeal to the IESG for a resolution. The appellant must show that the decision made by the TZ Coordinator (a) was materially in error and (b) has caused material harm. In its deliberations regarding an appeal, the IESG shall weigh all the evidence presented to it and use its best judgment in determining a resolution.",
      "zh-CHS": "3. 作为最后手段，如果无法在TZ邮件列表上达成解决方案，请向IESG寻求解决方案。上诉人必须证明TZ协调员做出的决定（a）存在重大错误，（b）造成重大损害。在关于上诉的审议中，IESG应权衡提交给它的所有证据，并在决定解决方案时使用其最佳判断。"
    },
    {
      "indent": 0,
      "text": "6. Maintenance and Distribution of Reference Code",
      "section_title": true,
      "zh-CHS": "6. 参考代码的维护和分发"
    },
    {
      "indent": 3,
      "text": "Currently, the maintainer of the TZ database also maintains reference code, most of which is public domain. The reference implementation shall be distributed along with an associated cryptographic signature verifiable by a public key. Several files from this software are currently distributed under license. Where they exist, licenses SHALL NOT be changed.",
      "zh-CHS": "目前，TZ数据库的维护者也维护参考代码，其中大部分是公共领域的。参考实现应与可通过公钥验证的相关加密签名一起分发。此软件中的多个文件目前在许可证下分发。如果存在许可证，则不得更改许可证。"
    },
    {
      "indent": 0,
      "text": "7. Database Ownership",
      "section_title": true,
      "zh-CHS": "7. 数据库所有权"
    },
    {
      "indent": 3,
      "text": "The TZ database itself is not an IETF Contribution or an IETF document. Rather it is a pre-existing and regularly updated work that is in the public domain, and is intended to remain in the public domain. Therefore, BCPs 78 [RFC5378] and 79 [RFC3979] do not apply to the TZ Database or contributions that individuals make to it. Should any claims be made and substantiated against the TZ Database, the organization that is providing the IANA Considerations defined in this RFC, under the memorandum of understanding with the IETF, currently ICANN, may act in accordance with all competent court orders. No ownership claims will be made by ICANN or the IETF Trust on the database or the code. Any person making a contribution to the database or code waives all rights to future claims in that contribution or in the TZ Database.",
      "zh-CHS": "TZ数据库本身不是IETF贡献或IETF文档。相反，它是一个预先存在并定期更新的工作，属于公共领域，并打算保留在公共领域。因此，BCP 78[RFC5378]和79[RFC3979]不适用于TZ数据库或个人对其作出的贡献。如果针对TZ数据库提出并证实任何索赔，根据与IETF（目前为ICANN）签订的谅解备忘录，提供本RFC中定义的IANA考虑因素的组织可根据所有有管辖权的法院命令行事。ICANN或IETF信托机构不会对数据库或代码提出所有权主张。对数据库或代码作出贡献的任何人放弃对该贡献或TZ数据库中未来索赔的所有权利。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "zh-CHS": "8. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This section documents the following IANA actions:",
      "zh-CHS": "本节记录了以下IANA行动："
    },
    {
      "indent": 3,
      "text": "o Assistance on request of the IESG in selection of the TZ Coordinator, based on the procedures set forth above.",
      "zh-CHS": "o 应IESG的请求，根据上述程序协助选择TZ协调员。"
    },
    {
      "indent": 3,
      "text": "o Maintenance of a repository for the TZ database and associated reference code. The TZ Coordinator SHALL be named by the IESG as described above, and will act as the maintainer of the database and code, as described above.",
      "zh-CHS": "o 维护TZ数据库和相关参考代码的存储库。上述IESG应指定TZ协调员，并担任上述数据库和代码的维护者。"
    },
    {
      "indent": 3,
      "text": "o Creation of appropriate access for the TZ Coordinator to maintain the database, as well as necessary tooling that may be required, so long as no direct software costs are incurred.",
      "zh-CHS": "o 为TZ协调员创建适当的访问权限以维护数据库，以及可能需要的必要工具，只要不产生直接的软件成本。"
    },
    {
      "indent": 3,
      "text": "o Establishment of security of the system upon which the database resides. Both current and historical versions of the database will be stored and distributed via HTTP/HTTPS.",
      "zh-CHS": "o 建立数据库所在系统的安全性。数据库的当前版本和历史版本都将通过HTTP/HTTPS进行存储和分发。"
    },
    {
      "indent": 3,
      "text": "o Maintenance of a cryptographic private key that is used to sign the database and that will survive a change of TZ Coordinator.",
      "zh-CHS": "o 维护用于对数据库进行签名的加密私钥，该私钥在更改TZ协调器后仍然有效。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "zh-CHS": "9. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The distribution of the database is currently not secured. This memo states that the TZ database SHOULD be distributed with a valid cryptographic signature moving forward.",
      "zh-CHS": "数据库的分发目前不安全。该备忘录指出，TZ数据库应随有效的加密签名一起分发。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "zh-CHS": "10. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the TZ mailing list for their remarkable achievements over the many years. Thanks also to Marshall Eubanks, S. Moonesamy, Peter Saint-Andre, Alexey Melenkov, Tony Finch, Elwyn Davies, Alfred Hoenes, Ted Hardie, Barry Leiba, Russ Housley, Pete Resnick, and Elise Gerich for the improvements they made to this document. A special acknowledgment should be given to Arthur David Olson for his excellent stewardship, to Rob Elz for continuing that stewardship, and to the team at ICANN for their good efforts, moving forward.",
      "zh-CHS": "作者要感谢TZ邮件列表多年来取得的显著成就。还要感谢马歇尔·尤班克斯、S.穆内萨米、彼得·圣安德烈、阿列克谢·梅伦科夫、托尼·芬奇、埃尔温·戴维斯、阿尔弗雷德·霍恩斯、特德·哈迪、巴里·莱巴、罗斯·霍斯利、皮特·雷斯尼克和伊莉丝·格里奇对本文件所做的改进。应特别感谢亚瑟·大卫·奥尔森（Arthur David Olson）出色的管理工作，感谢罗布·埃尔兹（Rob Elz）继续这一管理工作，并感谢ICANN团队在前进过程中做出的出色努力。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "zh-CHS": "11. 工具书类"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "zh-CHS": "11.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, June 2000.",
      "zh-CHS": "[RFC2860]Carpenter，B.，Baker，F.和M.Roberts，“关于互联网分配号码管理局技术工作的谅解备忘录”，RFC 28602000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[TZDB] Eggert, P. and A. Olson, \"Sources for Time Zone and Daylight Saving Time Data\", 1987, <ftp://ftp.iana.org/tz/code/tz-link.htm>.",
      "zh-CHS": "[TZDB]Eggert，P.和A.Olson，“时区和夏令时数据源”，1987年<ftp://ftp.iana.org/tz/code/tz-link.htm>."
    },
    {
      "indent": 0,
      "text": "11.2. Informational References",
      "section_title": true,
      "zh-CHS": "11.2. 参考资料"
    },
    {
      "indent": 3,
      "text": "[IEEE1003.1] Institute of Electrical and Electronics Engineers, \"Standard for Information Technology - Portable Operating System Interface (POSIX) - Base Definitions\", IEEE Standard 1003.1-2008, December 2008.",
      "zh-CHS": "[IEEE1003.1]电气和电子工程师协会，“信息技术标准-便携式操作系统接口（POSIX）-基本定义”，IEEE标准1003.1-2008，2008年12月。"
    },
    {
      "indent": 3,
      "text": "[ISO9899C] International Standards Organization, \"Information technology -- Programming languages -- C\", ISO/ IEC Standard 9899:2011, December 2011.",
      "zh-CHS": "[ISO9899C]国际标准组织，“信息技术——编程语言——C”，ISO/IEC标准9899:2011，2011年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3979] Bradner, S., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3979, March 2005.",
      "zh-CHS": "[RFC3979]Bradner，S.，“IETF技术中的知识产权”，BCP 79，RFC 3979，2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4833] Lear, E. and P. Eggert, \"Timezone Options for DHCP\", RFC 4833, April 2007.",
      "zh-CHS": "[RFC4833]Lear，E.和P.Eggert，“DHCP的时区选项”，RFC 4833，2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5378] Bradner, S. and J. Contreras, \"Rights Contributors Provide to the IETF Trust\", BCP 78, RFC 5378, November 2008.",
      "zh-CHS": "[RFC5378]Bradner，S.和J.Contreras，“IETF信托基金的权利出资人”，BCP 78，RFC 5378，2008年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5545] Desruisseaux, B., \"Internet Calendaring and Scheduling Core Object Specification (iCalendar)\", RFC 5545, September 2009.",
      "zh-CHS": "[RFC5545]Desruisseaux，B.“互联网日历和调度核心对象规范（iCalendar）”，RFC 55452009年9月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Eliot Lear Cisco Systems GmbH Richtistrasse 7 CH-8304 Wallisellen Switzerland",
      "zh-CHS": "艾略特·李尔思科系统有限公司瑞士瓦利塞伦Richtistrasse 7 CH-8304"
    },
    {
      "indent": 3,
      "text": "Phone: +41 1 878 9200\nEMail: lear@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Paul Eggert UCLA Computer Science Department 4532J Boelter Hall Los Angeles, CA 90095 USA",
      "zh-CHS": "加州大学洛杉矶分校计算机科学系4532J Boelter Hall洛杉矶，加利福尼亚90095"
    },
    {
      "indent": 3,
      "text": "Phone: +1 310 267 2254\nEMail: eggert@cs.ucla.edu",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}