{
  "title": {
    "text": "RFC 6220: Defining the Role and Function of IETF Protocol Parameter Registry Operators",
    "zh-CHS": "RFC 6220"
  },
  "number": 6220,
  "created_at": "2021-11-05 16:08:29.143974+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                      D. McPherson, Ed.\nRequest for Comments: 6220                               O. Kolkman, Ed.\nCategory: Informational                                  J. Klensin, Ed.\nISSN: 2070-1721                                           G. Huston, Ed.\n                                                              April 2011",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Defining the Role and Function of IETF Protocol Parameter Registry Operators",
      "zh-CHS": "定义IETF协议参数注册表运算符的角色和功能"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "Many Internet Engineering Task Force (IETF) protocols make use of commonly defined values that are passed in messages or packets. To ensure consistent interpretation of these values between independent implementations, there is a need to ensure that the values and associated semantic intent are uniquely defined. The IETF uses registry functions to record assigned protocol parameter values and their associated semantic intentions. For each IETF protocol parameter, it is current practice for the IETF to delegate the role of Protocol Parameter Registry Operator to a nominated entity. This document provides a description of, and the requirements for, these delegated functions.",
      "zh-CHS": "许多Internet工程任务组（IETF）协议使用在消息或数据包中传递的常用定义值。为了确保独立实现之间对这些值的一致解释，需要确保值和相关语义意图的定义是唯一的。IETF使用注册表函数记录分配的协议参数值及其相关语义意图。对于每个IETF协议参数，IETF当前的做法是将协议参数注册操作员的角色委托给指定实体。本文件提供了这些授权职能的说明和要求。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。IAB批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6220.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6220."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2011 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Overview ........................................................2\n2. Roles and Responsibilities Concerning IETF\n   Protocol Parameter Registries ...................................3\n   2.1. Protocol Parameter Registry Operator Role ..................4\n   2.2. IAB Role ...................................................7\n   2.3. IESG Role ..................................................7\n   2.4. Role of the IETF Trust .....................................8\n   2.5. Role of the IAOC ...........................................8\n3. Miscellaneous Considerations ....................................8\n4. Security Considerations .........................................9\n5. IANA Considerations .............................................9\n6. Informative References ..........................................9\n7. Acknowledgements ...............................................10\n8. IAB Members ....................................................10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "zh-CHS": "1. 概述"
    },
    {
      "indent": 3,
      "text": "Many IETF protocols make use of commonly defined values that are passed within messages or packets. To ensure consistent interpretation of these values between independent implementations, there is a need to ensure that the values and associated semantic intent are uniquely defined. The IETF uses registries to record each of the possible values of a protocol parameter and their associated semantic intent. These registries, their registration policy, and the layout of their content are defined in the so-called \"IANA Considerations\" sections of IETF documents.",
      "zh-CHS": "许多IETF协议使用在消息或数据包中传递的通用定义值。为了确保独立实现之间对这些值的一致解释，需要确保值和相关语义意图的定义是唯一的。IETF使用注册表记录协议参数的每个可能值及其相关语义意图。IETF文件中所谓的“IANA注意事项”部分定义了这些注册中心、注册策略及其内容布局。"
    },
    {
      "indent": 3,
      "text": "The organizational separation between the IETF and its Registry Operators parallels ones that are fairly common among standards development organizations (SDOs) although less common among technology consortia and similar bodies. These functions have been separated into different organizations for several reasons. They include dealing with administrative issues, addressing concerns about maintaining an adequate distance between basic policy and specific",
      "zh-CHS": "IETF及其注册运营商之间的组织分离与标准开发组织（SDO）中相当常见的分离相似，尽管在技术联盟和类似机构中不太常见。由于几个原因，这些职能被分为不同的组织。它们包括处理行政问题，解决有关在基本政策和具体政策之间保持适当距离的关切"
    },
    {
      "indent": 3,
      "text": "allocations, and avoiding any potential conflicts of interest that might arise from commercial or organizational relationships. For example, most ISO and ISO/IEC JTC1 standards that require registration activities specify a Registration Authority (RA) or Maintenance Agency (MA) that, in turn, control the actual registration decisions. The databases of what is registered for each standard may then be maintained by a secretariat or database function associated with the RA or MA or, less frequently, by the secretariat of the body that created and maintains the standard itself.",
      "zh-CHS": "分配，避免商业或组织关系可能产生的任何潜在利益冲突。例如，要求进行注册活动的大多数ISO和ISO/IEC JTC1标准都规定了注册机构（RA）或维护机构（MA），从而控制实际的注册决策。然后，可由与RA或MA相关的秘书处或数据库职能部门，或由创建和维护标准本身的机构的秘书处（频率较低）维护每个标准注册内容的数据库。"
    },
    {
      "indent": 3,
      "text": "This structural separation of roles exists within several places in the IETF framework (e.g., the RFC Editor function). The Internet Architecture Board (IAB), on behalf of the IETF, has the responsibility to define and manage the relationship with the Protocol Registry Operator role. This responsibility includes the selection and management of the Protocol Parameter Registry Operator, as well as management of the parameter registration process and the guidelines for parameter allocation.",
      "zh-CHS": "这种角色的结构分离存在于IETF框架中的几个地方（例如，RFC编辑器功能）。互联网体系结构委员会（IAB）代表IETF负责定义和管理与协议注册运营商角色的关系。该职责包括选择和管理协议参数注册操作员，以及管理参数注册过程和参数分配指南。"
    },
    {
      "indent": 3,
      "text": "As with other SDOs, although it may delegate authority for some specific decisions, the IETF asserts authority and responsibility for the management of all of its protocol parameters and their registries, even while it generally remains isolated from the selection of particular values once a registration is approved. This document describes the function of these registries as they apply to individual protocol parameters defined by the IETF Internet Standards Process [RFC2026] to allow for an orderly implementation by the Internet Administrative Oversight Committee (IAOC), and others as needed, under guidance from the IAB.",
      "zh-CHS": "与其他SDO一样，尽管IETF可能会授予某些特定决策的权限，但IETF主张其所有协议参数及其注册表的管理权限和责任，即使在注册获得批准后，IETF通常与特定值的选择保持隔离。本文件描述了这些注册中心的功能，因为它们适用于IETF互联网标准过程[RFC2026]定义的各个协议参数，以便互联网管理监督委员会（IAOC）和其他需要的机构在IAB的指导下有序实施。"
    },
    {
      "indent": 3,
      "text": "Below we provide a description of the requirements for these delegated functions, which the IETF traditionally refers to as the Internet Assigned Numbers Authority (IANA) function.",
      "zh-CHS": "下面，我们将描述这些授权功能的要求，IETF传统上称之为互联网分配号码管理局（IANA）功能。"
    },
    {
      "indent": 0,
      "text": "2. Roles and Responsibilities Concerning IETF Protocol Parameter Registries",
      "zh-CHS": "2. 关于IETF协议参数注册表的角色和责任"
    },
    {
      "indent": 3,
      "text": "The IETF's longstanding practice is to outsource the management and implementation of some important functions (e.g., [RFC5620]). The protocol parameter registry function falls into this category of outsourced functions, and what follows here is the description of the roles and responsibilities with respect to the registration of IETF protocol parameters.",
      "zh-CHS": "IETF的长期实践是将一些重要功能（如[RFC5620]）的管理和实施外包。协议参数注册功能属于这类外包功能，下面是关于注册IETF协议参数的角色和职责的描述。"
    },
    {
      "indent": 3,
      "text": "Specifically, this document describes the operation and role of a delegated IETF Protocol Parameter Registry Operator, to be selected and administered by the IETF Administrative Support Activity (IASA) [RFC4071]. While there is generally a single Protocol Parameter",
      "zh-CHS": "具体而言，本文件描述了由IETF管理支持活动（IASA）[RFC4071]选择和管理的授权IETF协议参数注册表操作员的操作和角色。而通常只有一个协议参数"
    },
    {
      "indent": 3,
      "text": "Registry Operator, additional Operators may be selected to implement specific registries, and that has been done occasionally. Having a single Operator facilitates coordination among registries, even those that are not obviously related, and also makes it easier to have consistency of formats and registry structure, which aids users of the registries and assists with quality control.",
      "zh-CHS": "注册表操作符，可以选择其他操作符来实现特定的注册表，这是偶尔做的。拥有一个单一的运营商有助于登记册之间的协调，即使是那些没有明显关联的登记册，也有助于格式和登记册结构的一致性，这有助于登记册的用户并有助于质量控制。"
    },
    {
      "indent": 3,
      "text": "Many protocols make use of identifiers consisting of constants and other well-known values. Even after a protocol has been defined and deployment has begun, new values may need to be assigned (e.g., for a new option type in DHCP, or a new encryption or authentication algorithm for IPsec). To ensure that such quantities have consistent values and interpretations in different implementations, their assignment must be administered by a central authority. For IETF protocols, that role is provided by a delegated Protocol Parameter Registry Operator. For any particular protocol parameter there is a single delegated Registry Operator.",
      "zh-CHS": "许多协议使用由常量和其他已知值组成的标识符。即使在定义了协议并开始部署之后，也可能需要分配新的值（例如，对于DHCP中的新选项类型，或者对于IPsec的新加密或身份验证算法）。为了确保这些数量在不同的实现中具有一致的值和解释，它们的分配必须由中央当局管理。对于IETF协议，该角色由委托协议参数注册表操作员提供。对于任何特定的协议参数，都有一个委派的注册表运算符。"
    },
    {
      "indent": 0,
      "text": "2.1. Protocol Parameter Registry Operator Role",
      "section_title": true,
      "zh-CHS": "2.1. 协议参数注册表操作员角色"
    },
    {
      "indent": 3,
      "text": "The IETF Protocol Parameter Registry function is undertaken under the auspices of the Internet Architecture Board.",
      "zh-CHS": "IETF协议参数注册功能由互联网体系结构委员会负责。"
    },
    {
      "indent": 3,
      "text": "The roles of the Protocol Parameter Registry Operator are as follows:",
      "zh-CHS": "协议参数注册表操作员的角色如下："
    },
    {
      "indent": 3,
      "text": "o Review and Advise",
      "zh-CHS": "o 检讨及建议"
    },
    {
      "indent": 5,
      "text": "* A Registry Operator may be requested to review Internet-Drafts that are being considered by the Internet Engineering Steering Group (IESG), with the objective of offering advice to the IESG regarding the contents of the \"IANA Considerations\" section, whether such a section, when required, is clear in terms of direction to the Registry Operator, and whether the section is consistent with the current published Registry Operator guidelines.",
      "zh-CHS": "* 可能会要求注册运营商审查互联网工程指导小组（IESG）正在审议的互联网草案，目的是就“IANA注意事项”部分的内容向IESG提供建议，该部分是否在需要时对注册运营商的方向明确，以及该部分是否符合当前发布的注册表操作员指南。"
    },
    {
      "indent": 3,
      "text": "o Registry",
      "zh-CHS": "o 登记处"
    },
    {
      "indent": 5,
      "text": "* To operate a registry of protocol parameter assignments.",
      "zh-CHS": "* 操作协议参数分配的注册表。"
    },
    {
      "indent": 5,
      "text": "* The delegated Registry Operator registers values for Internet protocol parameters only as directed by the criteria and procedures specified in RFCs, including Proposed, Draft, and full Internet Standards, Best Current Practice documents, and other RFCs that require protocol parameter assignment.",
      "zh-CHS": "* 委派的注册中心操作员仅按照RFC中规定的标准和程序（包括提议的、草案的和完整的互联网标准、最佳当前实践文件以及需要协议参数分配的其他RFC）的指示注册互联网协议参数的值。"
    },
    {
      "indent": 7,
      "text": "If values for Internet protocol parameters were not specified, or in case of ambiguity, the Registry Operator will continue to",
      "zh-CHS": "如果未指定Internet协议参数的值，或者在不明确的情况下，注册表操作员将继续"
    },
    {
      "indent": 7,
      "text": "assign and register only those protocol parameters that have already been delegated to the Operator, following past and current practice for such assignments, unless otherwise directed in terms of operating practice by the IESG. In the case of ambiguity, the Registry Operator is expected to identify the ambiguity to the IAB or IESG as appropriate and either suggest better text or ask the appropriate parties for clarification.",
      "zh-CHS": "除非IESG在操作实践方面另有指示，否则仅分配和注册已委托给运营商的协议参数，遵循此类分配的过去和当前实践。在出现歧义的情况下，注册运营商应向IAB或IESG（视情况而定）确认歧义，并建议更好的文本或要求相关方澄清。"
    },
    {
      "indent": 5,
      "text": "* For each protocol parameter, the associated registry includes:",
      "zh-CHS": "* 对于每个协议参数，关联的注册表包括："
    },
    {
      "indent": 7,
      "text": "+ a reference to the RFC document that describes the parameter and the associated \"IANA Considerations\" concerning the parameter, and",
      "zh-CHS": "+ 对RFC文档的引用，该文档描述了参数以及与参数相关的“IANA注意事项”，以及"
    },
    {
      "indent": 7,
      "text": "+ for each registration of a protocol parameter value, the source of the registration and the date of the registration, if the date of registration is known, and",
      "zh-CHS": "+ 对于协议参数值的每次注册，注册来源和注册日期（如果注册日期已知），以及"
    },
    {
      "indent": 7,
      "text": "+ any other information specified as being included in the registration data in the RFC document that describes the parameter.",
      "zh-CHS": "+ 指定为包含在RFC文档中描述参数的注册数据中的任何其他信息。"
    },
    {
      "indent": 7,
      "text": "+ If in doubt or in case of a technical dispute, the Registry Operator will seek and follow technical guidance exclusively from the IESG. Where appropriate, the IESG will appoint an expert to advise the Registry Operator.",
      "zh-CHS": "+ 如果有疑问或出现技术争议，注册运营商将寻求并遵循IESG独家提供的技术指导。在适当情况下，IESG将任命一名专家为登记运营商提供建议。"
    },
    {
      "indent": 5,
      "text": "* The Registry Operator will work with the IETF to develop any missing criteria and procedures over time, which the Registry Operator will adopt when so instructed by the IESG.",
      "zh-CHS": "* 注册运营商将与IETF合作，制定任何缺失的标准和程序，注册运营商将在IESG的指示下采用这些标准和程序。"
    },
    {
      "indent": 5,
      "text": "* Unless special circumstances apply to subsets of the data and specific rules are established by IETF consensus, each protocol parameter registry operates as a public registry, and the contents of the registry are openly available to the public, on-line and free of charge.",
      "zh-CHS": "* 除非特殊情况适用于数据子集，且IETF协商一致制定了具体规则，否则每个协议参数注册表作为公共注册表运行，并且注册表的内容对公众开放、在线和免费。"
    },
    {
      "indent": 5,
      "text": "* The Registry Operator assigns protocol parameter values in accordance with the policy associated with the protocol parameter, such as \"First Come First Served\" or \"Expert Review\" [RFC5226].",
      "zh-CHS": "* 注册表操作员根据与协议参数相关联的策略分配协议参数值，如“先到先得”或“专家评审”[RFC5226]。"
    },
    {
      "indent": 3,
      "text": "o Mailing Lists",
      "zh-CHS": "o 邮件列表"
    },
    {
      "indent": 5,
      "text": "* The Registry Operator maintains public mailing lists as specified in IANA Considerations [RFC5226]. Such lists are designated for the purpose of review of assignment proposals in conjunction with a designated expert review function. In addition, each Protocol",
      "zh-CHS": "* 注册运营商维护IANA注意事项[RFC5226]中规定的公共邮件列表。指定此类名单的目的是与指定的专家审查职能一起审查任务建议书。此外，每个协议"
    },
    {
      "indent": 7,
      "text": "Parameter Registry Operator should maintain a mailing list that enables the registry staff of the Registry Operator to be contacted by email.",
      "zh-CHS": "Parameter Registry Operator应维护一个邮件列表，以便通过电子邮件联系注册表操作员的注册表人员。"
    },
    {
      "indent": 3,
      "text": "o Liaison Activity",
      "zh-CHS": "o 联络活动"
    },
    {
      "indent": 5,
      "text": "* The Registry Operator will nominate a liaison point of contact. The Registry Operator, through this liaison, may be requested to provide advice to the IESG on IETF protocol parameters as well as the \"IANA Considerations\" section of each Internet-Draft that is being reviewed for publication as an RFC. Where appropriate the IESG will appoint an expert to advise the Registry Operator.",
      "zh-CHS": "* 登记处经营者将指定一个联络点。通过这种联络，可能会要求注册运营商向IESG提供有关IETF协议参数的建议，以及正在审查以作为RFC发布的每个互联网草案的“IANA注意事项”部分。在适当情况下，IESG将任命一名专家为登记运营商提供建议。"
    },
    {
      "indent": 3,
      "text": "o Reporting",
      "zh-CHS": "o 报告"
    },
    {
      "indent": 5,
      "text": "* The Registry Operator will submit periodic reports to the IAB concerning the operational performance of the registry function. As an example of the requirements for such reports, the reader is referred to a supplement [IAOC_SUPP] to the \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\" [RFC2860] that provides service level agreement (SLA) guidelines under which ICANN, the current protocol parameter registry, must operate.",
      "zh-CHS": "* 注册运营商将向IAB提交关于注册职能运营绩效的定期报告。作为此类报告要求的一个示例，读者可参考“关于互联网分配号码管理局技术工作的谅解备忘录”[RFC2860]的补充[IAOC_SUPP]，该备忘录提供了服务水平协议（SLA）指南，根据该指南，ICANN（当前的协议参数注册中心）可：，必须操作。"
    },
    {
      "indent": 5,
      "text": "* At the request of the chair of the IETF, IAB, or IAOC, the Registry Operator will undertake periodic reports to IETF Plenary meetings concerning the status of the registry function.",
      "zh-CHS": "* 应IETF、IAB或IAOC主席的请求，注册运营商将定期向IETF全体会议报告注册职能的状态。"
    },
    {
      "indent": 5,
      "text": "* The Registry Operator will publish an annual report describing the status of the function and a summary of performance indicators.",
      "zh-CHS": "* 登记处运营商将发布一份年度报告，说明职能状况和绩效指标摘要。"
    },
    {
      "indent": 3,
      "text": "o Intellectual Property Rights and the Registry Operator",
      "zh-CHS": "o 知识产权与登记运营商"
    },
    {
      "indent": 5,
      "text": "* All assigned values are to be published and made available free of any charges.",
      "zh-CHS": "* 所有指定值均应免费发布和提供。"
    },
    {
      "indent": 5,
      "text": "* The assignment values may be redistributed without modification.",
      "zh-CHS": "* 分配值可以重新分配，无需修改。"
    },
    {
      "indent": 5,
      "text": "* Any intellectual property rights of the IETF protocol parameter assignment information, including the IETF protocol parameter registry and its contents, are to be held by the IETF Trust [RFC4748].",
      "zh-CHS": "* IETF协议参数分配信息的任何知识产权，包括IETF协议参数注册表及其内容，均由IETF信托基金持有[RFC4748]。"
    },
    {
      "indent": 0,
      "text": "2.2. IAB Role",
      "section_title": true,
      "zh-CHS": "2.2. IAB角色"
    },
    {
      "indent": 3,
      "text": "An Operator of an IETF protocol parameter registry undertakes the role as a delegated function under the authority of the IAB.",
      "zh-CHS": "IETF协议参数注册中心的操作员承担IAB授权下的委托职能。"
    },
    {
      "indent": 3,
      "text": "The IAB has the responsibility to review the current description of the registry function from time to time and direct the Registry Operator to adopt amendments relating to its role and mode of operation according to the best interests of the IETF and the Internet community in general.",
      "zh-CHS": "IAB有责任不时审查注册职能的当前描述，并根据IETF和整个互联网社区的最佳利益，指示注册运营商采纳与其角色和运营模式相关的修正案。"
    },
    {
      "indent": 3,
      "text": "The IAB has the responsibility to appoint an organization to undertake the delegated functions of the Protocol Parameter Registry Operator for each IETF protocol parameter. Specifically, the IAB defines the role and requirements for the desired functions. The IAOC is responsible for identifying a potential vendor, and once under agreement, managing the various aspects of the relationships with that vendor. To be clear, the IAB is in the deciding role (e.g., for appointment and termination), but must work in close consultation with the IAOC.",
      "zh-CHS": "IAB有责任指定一个组织承担协议参数注册运营商对每个IETF协议参数的委托职能。具体而言，IAB定义了所需功能的角色和要求。IAOC负责确定潜在供应商，并在达成协议后，管理与该供应商关系的各个方面。需要明确的是，IAB起决定作用（例如，任命和终止），但必须与IAOC密切协商。"
    },
    {
      "indent": 3,
      "text": "The IAB has the responsibility to determine the terms and conditions of this delegated role. Such terms and conditions should ensure that the registry operates in a manner that is fully conformant to the functions described in this document. In addition, such terms and conditions must not restrict the rights and interests of the IETF with respect to the registry contents and maintenance.",
      "zh-CHS": "IAB有责任确定该授权角色的条款和条件。这些条款和条件应确保登记处的运作方式完全符合本文件所述的职能。此外，此类条款和条件不得限制IETF在注册内容和维护方面的权利和利益。"
    },
    {
      "indent": 0,
      "text": "2.3. IESG Role",
      "section_title": true,
      "zh-CHS": "2.3. IESG角色"
    },
    {
      "indent": 3,
      "text": "The IESG is responsible for the technical direction regarding entries into IETF protocol parameter registries and maintaining the policies by which such technical directions are given. Technical direction itself is provided through the adoption of directives within the \"IANA Considerations\" section of IETF Stream RFCs or through stand-alone \"IANA Considerations\" RFCs.",
      "zh-CHS": "IESG负责有关IETF协议参数注册表条目的技术指导，并维护给出此类技术指导的政策。通过采用IETF流RFC“IANA注意事项”部分中的指令或通过独立的“IANA注意事项”RFC提供技术指导。"
    },
    {
      "indent": 3,
      "text": "The IESG shall verify that Internet-Drafts that are offered for publication as IETF Stream RFCs [RFC4844] include \"IANA Considerations\" sections when needed, and that \"IANA Considerations\" sections conform to the current published guidelines.",
      "zh-CHS": "IESG应验证作为IETF流RFC[RFC4844]发布的互联网草案在需要时包括“IANA注意事项”部分，并且“IANA注意事项”部分符合当前发布的指南。"
    },
    {
      "indent": 3,
      "text": "Since technical assessment is not generally a responsibility of the Registry Operator, as part of providing the technical direction the IESG is responsible for identifying the technical experts that are required to, where appropriate, review registration requests or resolve open technical questions that relate to the registration of parameters.",
      "zh-CHS": "由于技术评估通常不是登记处经营者的责任，作为提供技术指导的一部分，IESG负责确定必要的技术专家，以便在适当情况下审查登记请求或解决与参数登记有关的开放性技术问题。"
    },
    {
      "indent": 3,
      "text": "At its discretion, the IESG will organize the liaison activities with the Registry Operator's liaison point of contact so as to facilitate clear communications and effective operation of the registry function.",
      "zh-CHS": "IESG将自行决定组织与登记运营商联络点的联络活动，以促进登记职能的清晰沟通和有效运作。"
    },
    {
      "indent": 0,
      "text": "2.4. Role of the IETF Trust",
      "section_title": true,
      "zh-CHS": "2.4. IETF信托基金的作用"
    },
    {
      "indent": 3,
      "text": "The IETF Trust [RFC4748] was formed to act as the administrative custodian of all copyrights and other intellectual property rights relating to the IETF Standards Process, a function that had previously been performed by the Internet Society (ISOC) and the Corporation for National Research Initiatives (CNRI).",
      "zh-CHS": "IETF信托基金[RFC4748]成立的目的是作为与IETF标准过程相关的所有版权和其他知识产权的行政保管人，这一职能此前由互联网协会（ISOC）和国家研究计划公司（CNRI）履行。"
    },
    {
      "indent": 3,
      "text": "Any intellectual property rights of IETF protocol parameter assignment information, including the registry and its contents, and all registry publications, are to be held by the IETF Trust on behalf of the IETF.",
      "zh-CHS": "IETF协议参数分配信息的任何知识产权，包括注册表及其内容，以及所有注册表出版物，均由IETF信托机构代表IETF持有。"
    },
    {
      "indent": 3,
      "text": "The IETF Trust may make such regulations as appropriate for the redistribution of assignment values and registry publications.",
      "zh-CHS": "IETF信托基金可制定适用于分配值和注册出版物再分配的规定。"
    },
    {
      "indent": 0,
      "text": "2.5. Role of the IAOC",
      "section_title": true,
      "zh-CHS": "2.5. 审咨委的作用"
    },
    {
      "indent": 3,
      "text": "The IAOC is responsible for identifying a potential vendor in a manner of their choosing, based on IAB consultation, and for managing the various aspects of the relationships with that vendor.",
      "zh-CHS": "IAOC负责根据IAB咨询，以其选择的方式确定潜在供应商，并负责管理与该供应商关系的各个方面。"
    },
    {
      "indent": 3,
      "text": "In addition, the IAOC has the responsibility to ensure long-term access, stability, and uniqueness across all such registries. This responsibility is of particular significance in the event that a relation with a Protocol Parameter Registry Operator is terminated.",
      "zh-CHS": "此外，IAOC有责任确保所有此类注册的长期访问、稳定性和唯一性。在与协议参数注册表运算符的关系终止的情况下，此责任特别重要。"
    },
    {
      "indent": 0,
      "text": "3. Miscellaneous Considerations",
      "section_title": true,
      "zh-CHS": "3. 杂项考虑"
    },
    {
      "indent": 3,
      "text": "While this document has focused on the creation of protocols by the IETF, the requirements provided are generically applicable to the extended IETF community as well (e.g., Internet Research Task Force (IRTF)).",
      "zh-CHS": "虽然本文件侧重于IETF创建协议，但提供的要求一般也适用于扩展的IETF社区（例如，互联网研究工作队（IRTF））。"
    },
    {
      "indent": 3,
      "text": "The IESG is responsible for the technical direction of the IETF Protocol Parameter registries and maintaining the policies by which such technical directions are given. The IESG is responsible, as part of the document approval process associated with the IETF Stream RFCs [RFC4844], for \"IANA Considerations\" verification. For the other RFC streams, the approval bodies are responsible for verifying that the documents include \"IANA Considerations\" sections when needed, and that \"IANA Considerations\" sections conform to the",
      "zh-CHS": "IESG负责IETF协议参数注册表的技术指导，并维护给出此类技术指导的政策。作为与IETF流RFC[RFC4844]相关的文件批准流程的一部分，IESG负责“IANA注意事项”验证。对于其他RFC流，审批机构负责在需要时验证文件是否包含“IANA注意事项”章节，以及“IANA注意事项”章节是否符合"
    },
    {
      "indent": 3,
      "text": "current published guidelines. In the case that IANA considerations in non-IETF document streams lead to a dispute, the IAB makes the final decision.",
      "zh-CHS": "目前公布的准则。如果非IETF文件流中的IANA考虑因素导致争议，IAB将做出最终决定。"
    },
    {
      "indent": 3,
      "text": "This document talks about \"Registry Operator\" (singular), and while there are stability and economy-of-scale advantages for one single Operator, this document does not exclude having different Operators for different protocol registries when justified by the circumstances.",
      "zh-CHS": "本文件讨论“注册运营商”（单数），虽然单个运营商具有稳定性和规模经济性优势，但本文件并不排除在情况允许的情况下，为不同的协议注册拥有不同的运营商。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document does not propose any new protocols and does not introduce any new security considerations.",
      "zh-CHS": "本文件未提出任何新协议，也未引入任何新的安全注意事项。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document requires no direct IANA actions in terms of the creation or operation of a protocol parameter registry. However, this document does define the roles and responsibilities of various bodies who are responsible for, and associated with, the operation of protocol parameter registration functions for the IETF.",
      "zh-CHS": "在协议参数注册表的创建或操作方面，本文档不需要直接IANA操作。然而，本文件确实定义了负责IETF协议参数注册功能运行并与之相关的各个机构的角色和职责。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "zh-CHS": "6. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, June 2000.",
      "zh-CHS": "[RFC2860]Carpenter，B.，Baker，F.和M.Roberts，“关于互联网分配号码管理局技术工作的谅解备忘录”，RFC 28602000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4071] Austein, R., Ed., and B. Wijnen, Ed., \"Structure of the IETF Administrative Support Activity (IASA)\", BCP 101, RFC 4071, April 2005.",
      "zh-CHS": "[RFC4071]Austein，R.，Ed.，和B.Wijnen，Ed.，“IETF行政支持活动（IASA）的结构”，BCP 101，RFC 4071，2005年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4748] Bradner, S., Ed., \"RFC 3978 Update to Recognize the IETF Trust\", RFC 4748, October 2006.",
      "zh-CHS": "[RFC4748]Bradner，S.，Ed.，“RFC 3978更新以识别IETF信任”，RFC 4748，2006年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4844] Daigle, L., Ed., and Internet Architecture Board, \"The RFC Series and RFC Editor\", RFC 4844, July 2007.",
      "zh-CHS": "[RFC4844]Daigle，L.，Ed.，和互联网架构委员会，“RFC系列和RFC编辑器”，RFC 48442007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5620] Kolkman, O., Ed., and IAB, \"RFC Editor Model (Version 1)\", RFC 5620, August 2009.",
      "zh-CHS": "[RFC5620]Kolkman，O.，Ed.，和IAB，“RFC编辑器模型（版本1）”，RFC562009年8月。"
    },
    {
      "indent": 3,
      "text": "[IAOC_SUPP] ICANN/IANA-IETF MoU Supplemental Agreement, <http://iaoc.ietf.org/documents/ IETF-ICANN_Supplemental_Agreement.pdf>.",
      "zh-CHS": "[IAOC_SUPP]ICANN/IANA-IETF MoU补充协议<http://iaoc.ietf.org/documents/ IETF-ICANN补充协议.pdf>。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "This document is adapted from \"Guidelines for Writing an IANA Considerations Section in RFCs\" [RFC5226], and has been modified to include explicit reference to Intellectual Property Rights and the roles of the IAB and IESG in relation to the IETF Protocol Parameter Registry function.",
      "zh-CHS": "本文件改编自“在RFCs中编写IANA注意事项部分的指南”[RFC5226]，并进行了修改，以明确提及知识产权以及IAB和IESG在IETF协议参数注册功能方面的作用。"
    },
    {
      "indent": 3,
      "text": "The Internet Architecture Board acknowledges the assistance provided by reviewers of drafts of this document, including Scott Bradner, Brian Carpenter, Leslie Daigle, Adrian Farrel, Alfred Hoenes, Paul Hoffman, Alexey Melnikov, Thomas Narten, and Ray Pelletier.",
      "zh-CHS": "互联网体系结构委员会感谢本文件草稿审查人员提供的协助，包括斯科特·布拉德纳、布赖恩·卡彭特、莱斯利·戴格尔、阿德里安·法雷尔、阿尔弗雷德·霍恩斯、保罗·霍夫曼、阿列克西·梅尔尼科夫、托马斯·纳滕和雷·佩利蒂埃。"
    },
    {
      "indent": 0,
      "text": "8. IAB Members",
      "section_title": true,
      "zh-CHS": "8. 国际律师协会成员"
    },
    {
      "indent": 3,
      "text": "Internet Architecture Board Members at the time this document was approved for publication were:",
      "zh-CHS": "本文件批准发布时，互联网体系结构委员会成员为："
    },
    {
      "indent": 6,
      "text": "Marcelo Bagnulo Ross Callon Spencer Dawkins Russ Housley John Klensin Olaf Kolkman Danny McPherson Jon Peterson Andrei Robachevsky Dave Thaler Hannes Tschofenig",
      "zh-CHS": "马塞洛·巴格鲁·罗斯·卡隆·斯宾塞·道金斯·鲁斯·霍斯利·约翰·克莱森·奥拉夫·科尔克曼·丹尼·麦克弗森·乔恩·彼得森·安德烈·罗巴切夫斯基·戴夫·泰勒·汉内斯·茨霍芬尼"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Danny McPherson, Editor Verisign, Inc. EMail: dmcpherson@verisign.com",
      "zh-CHS": "Danny McPherson，编辑Verisign，Inc.电子邮件：dmcpherson@verisign.com"
    },
    {
      "indent": 3,
      "text": "Olaf M. Kolkman, Editor NLnet Labs EMail: olaf@NLnetLabs.nl",
      "zh-CHS": "NLnet实验室编辑Olaf M.Kolkman电子邮件：olaf@NLnetLabs.nl"
    },
    {
      "indent": 3,
      "text": "John C Klensin, Editor EMail: john+ietf@jck.com",
      "zh-CHS": "约翰·C·克莱森，编辑电子邮件：约翰+ietf@jck.com"
    },
    {
      "indent": 3,
      "text": "Geoff Huston, Editor APNIC EMail: gih@apnic.net",
      "zh-CHS": "杰夫·休斯顿，编辑APNIC电子邮件：gih@apnic.net"
    },
    {
      "indent": 3,
      "text": "Internet Architecture Board EMail: iab@iab.org",
      "zh-CHS": "互联网架构委员会电子邮件：iab@iab.org"
    }
  ]
}