{
  "title": {
    "text": "RFC 6869: vCard KIND:device",
    "zh-CHS": "RFC 6869"
  },
  "number": 6869,
  "created_at": "2021-11-04 13:46:39.971938+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      G. Salgueiro\nRequest for Comments: 6869                                     J. Clarke\nCategory: Standards Track                                 P. Saint-Andre\nISSN: 2070-1721                                            Cisco Systems\n                                                           February 2013",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 27,
      "text": "vCard KIND:device",
      "zh-CHS": "vCard类型：设备"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document defines a value of \"device\" for the vCard KIND property so that the vCard format can be used to represent computing devices such as appliances, computers, or network elements (e.g., a server, router, switch, printer, sensor, or phone).",
      "zh-CHS": "本文档定义vCard种类属性的“设备”值，以便vCard格式可用于表示计算设备，如设备、计算机或网络元素（如服务器、路由器、交换机、打印机、传感器或电话）。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6869.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc6869."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2013 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Scope . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n3.  Example . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n4.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 6\n5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n6.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 7\n  6.1.  Normative References  . . . . . . . . . . . . . . . . . . . 7\n  6.2.  Informative References  . . . . . . . . . . . . . . . . . . 7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Version 4 of the vCard specification [RFC6350] defines a new \"KIND\" property to specify the type of entity that a vCard represents. During its work on the base vCard4 specification, the VCARDDAV Working Group defined values of \"individual\", \"org\", \"group\", and \"location\" for the KIND property.",
      "zh-CHS": "vCard规范的第4版[RFC6350]定义了一个新的“种类”属性，以指定vCard表示的实体类型。在基础vCard4规范的工作中，VCARDDAV工作组为种类属性定义了“个人”、“组织”、“组”和“位置”的值。"
    },
    {
      "indent": 3,
      "text": "During working group discussion of the document that became [RFC6473], consideration was given to defining a more general value of \"thing\", but it was decided to split \"thing\" into software applications and hardware devices and to define only the \"application\" value at that time. Since then, use cases for device vCards have emerged. These use cases involve using vCards as a primer for inventory and asset tracking data specific to network elements. Therefore, this document complements [RFC6473] by defining a value of \"device\" for the KIND property to represent computing devices such as appliances, computers, or network elements. In this context, the concept of a device is constrained to computing devices and thus is distinct from purely mechanical devices such as elevators, electric generators, etc., that cannot communicate in any way over a network. This does not preclude, however, network-attached sensors that are connected to such mechanical devices.",
      "zh-CHS": "在工作组讨论成为[RFC6473]的文件时，考虑了定义更一般的“东西”值，但决定将“东西”分为软件应用程序和硬件设备，并在当时仅定义“应用程序”值。从那时起，设备vCard的用例就出现了。这些用例涉及使用vCard作为特定于网络元素的库存和资产跟踪数据的入门。因此，本文档通过定义种类属性的“设备”值来表示计算设备（如设备、计算机或网络元素），对[RFC6473]进行了补充。在这种情况下，设备的概念仅限于计算设备，因此与无法通过网络以任何方式通信的纯机械设备（如电梯、发电机等）不同。然而，这并不排除连接到此类机械设备的网络连接传感器。"
    },
    {
      "indent": 0,
      "text": "2. Scope",
      "section_title": true,
      "zh-CHS": "2. 范围"
    },
    {
      "indent": 3,
      "text": "When the KIND property has a value of \"device\", the vCard represents a computing device such as an appliance, a computer, or a network element (e.g., a server, router, switch, printer, sensor, or phone). More formally, a \"device\" is functionally equivalent to the \"device\" object class used in the Lightweight Directory Access Protocol [RFC4519] as derived from the Open Systems Interconnection model [X.521] [X.200]. However, whereas [X.521] specifies that devices are \"physical\" elements, a device in this context can also be virtual such as a virtual machine running within another physical element. As one example of the \"device\" KIND, vCards can be embedded into devices at manufacturing time so that basic information such as",
      "zh-CHS": "当种类属性的值为“设备”时，vCard表示计算设备，如设备、计算机或网络元素（例如服务器、路由器、交换机、打印机、传感器或电话）。更正式地说，“设备”在功能上等同于轻量级目录访问协议[RFC4519]中使用的“设备”对象类，该协议源自开放系统互连模型[X.521][X.200]。然而，尽管[X.521]指定设备是“物理”元素，但在此上下文中的设备也可以是虚拟的，例如在另一个物理元素中运行的虚拟机。作为“设备”类型的一个示例，VCARD可以在制造时嵌入到设备中，以便"
    },
    {
      "indent": 3,
      "text": "serial number, support email, and documentation URL can be retrieved upon initial deployment. This vCard can be modified after the device is deployed to contain user-specified data about the device's characteristics. The vCard data can therefore be used for both asset tracking and operational purposes.",
      "zh-CHS": "序列号、支持电子邮件和文档URL可在初始部署时检索。部署设备后，可以修改此vCard，以包含有关设备特性的用户指定数据。因此，vCard数据可用于资产跟踪和运营目的。"
    },
    {
      "indent": 3,
      "text": "A device might have a number of embedded vCards for varying purposes. The process for discovering and accessing these vCards is purposefully left unspecified in this document, as this process could rely on any mechanism that makes sense for the device in question. For example, a device could have one or more of the following vCard instances:",
      "zh-CHS": "一个设备可能有许多嵌入式vCard，用于不同的用途。本文档有意未说明发现和访问这些vCard的过程，因为此过程可能依赖于对所述设备有意义的任何机制。例如，设备可能具有以下一个或多个vCard实例："
    },
    {
      "indent": 3,
      "text": "o The device itself. For example, the FN (\"full name\") property might represent the hostname of a computing device; the URL property might represent a website that contains details on where to find documentation or get further information about the device; the KEY property might represent a digital certificate that was provisioned into the device at the time of manufacture [IEEE.802.1AR], or a public key certificate previously provisioned into the device; and the ADR, GEO, and TZ properties might represent the physical address, geographical location, and time zone where the device is deployed.",
      "zh-CHS": "o 设备本身。例如，FN（“全名”）属性可能表示计算设备的主机名；URL属性可能表示一个网站，其中包含有关在何处查找文档或获取有关设备的更多信息的详细信息；密钥属性可以表示在制造[IEEE.802.1AR]时供应到设备中的数字证书，或者先前供应到设备中的公钥证书；ADR、GEO和TZ属性可能表示设备部署的物理地址、地理位置和时区。"
    },
    {
      "indent": 3,
      "text": "o An organization or person that produces or manufactures the device.",
      "zh-CHS": "o 生产或制造这种装置的组织或个人。"
    },
    {
      "indent": 3,
      "text": "o A person or role that maintains or administers the device.",
      "zh-CHS": "o 维护或管理设备的人或角色。"
    },
    {
      "indent": 3,
      "text": "o Application-level vCards as described in [RFC6473] for each application installed on the device.",
      "zh-CHS": "o 设备上安装的每个应用程序的应用程序级vCard如[RFC6473]所述。"
    },
    {
      "indent": 3,
      "text": "When a device has vCards other than its KIND:device vCard, those vCards can be linked together with RELATED (see the definition of the RELATED organizational property in Section 6.6.6 of [RFC6350]). In multi-vCard instances, the KIND:device vCard would use the RELATED property to express the relationship with the ancillary vCard(s). Those supplementary vCards need not use RELATED to point back to the KIND:device vCard. In this manner, the vCard for the device itself can be easily distinguished from vCards referring to the vendor organization, device administrator, and installed applications.",
      "zh-CHS": "当设备具有不同于其类型的vCard:device vCard时，这些vCard可以与相关vCard链接在一起（参见[RFC6350]第6.6.6节中相关组织属性的定义）。在多vCard实例中，种类：设备vCard将使用相关属性表示与辅助vCard的关系。那些补充vCard不需要使用与点相关的类型：设备vCard。通过这种方式，设备本身的vCard可以很容易地与涉及供应商组织、设备管理员和已安装应用程序的vCard区分开来。"
    },
    {
      "indent": 3,
      "text": "The following base properties make sense for vCards that represent devices (this list is not exhaustive, and other properties might be applicable as well):",
      "zh-CHS": "以下基本属性对于表示设备的vCard是有意义的（此列表并不详尽，其他属性也可能适用）："
    },
    {
      "indent": 6,
      "text": "* ADR * EMAIL * FN * GEO * IMPP * KEY * KIND * LANG * LOGO * NOTE * ORG * PHOTO * RELATED * REV * SOURCE * TEL * TZ * UID * URL",
      "zh-CHS": "* ADR*电子邮件*FN*地理信息*IMPP*钥匙*种类*语言*徽标*备注*组织*照片*相关*版本*来源*电话*TZ*UID*URL"
    },
    {
      "indent": 3,
      "text": "Although it might be desirable to define a more fine-grained taxonomy of devices (e.g., a KIND of \"device\" with a subtype of \"router\" or \"computer\"), such a taxonomy is out of scope for this document.",
      "zh-CHS": "尽管可能需要定义更细粒度的设备分类法（例如，一种具有“路由器”或“计算机”子类型的“设备”），但这种分类法不在本文档的范围之内。"
    },
    {
      "indent": 0,
      "text": "3. Example",
      "section_title": true,
      "zh-CHS": "3. 实例"
    },
    {
      "indent": 3,
      "text": "The following is an example of a router device that contains both manufacturing details as well as post-deployment attributes and uses the XML representation of vCard (xCard) described in [RFC6351]. This vCard points to another, related vCard that contains the details of an administrative contact for the device. This vCard also leverages the extensibility of the xCard format to reference additional namespaces in order to provide richer details about the given device (e.g., the serial number and software version are specified as xCard extensions).",
      "zh-CHS": "以下是一个路由器设备的示例，该路由器设备包含制造详细信息和部署后属性，并使用[RFC6351]中描述的vCard（xCard）的XML表示形式。此vCard指向另一个相关vCard，其中包含设备管理联系人的详细信息。此vCard还利用xCard格式的可扩展性来引用其他名称空间，以便提供有关给定设备的更详细信息（例如，序列号和软件版本被指定为xCard扩展）。"
    },
    {
      "indent": 3,
      "text": "<vcard xmlns=\"urn:ietf:params:xml:ns:vcard-4.0\">\n  <kind><text>device</text></kind>\n  <fn>\n    <parameters>\n      <type><text>x-model-name</text></type>\n    </parameters>\n    <text>RTR1001</text>\n  </fn>\n  <fn><text>core-rtr-1.example.net</text></fn>\n  <url><uri>http://www.example.com/support/index.html</uri></url>\n  <email><text>support@example.com</text></email>\n  <email>\n    <parameters>\n      <type><text>x-local-support</text></type>\n    </parameters>\n    <text>network-support@example.net</text>\n  </email>\n  <impp><uri>xmpp:core-rtr-1@example.net</uri></impp>\n  <related>\n    <parameters>\n      <type><text>contact</text></type>\n    </parameters>\n    <uri>urn:uuid:5CEF1870-0326-11E2-A21F-0800200C9A66</uri>\n  </related>\n  <logo><uri>http://www.example.com/images/logo.png</uri></logo>\n  <geo><uri>geo:35.82,-78.64</uri></geo>\n  <tz><text>America/New_York</text></tz>\n  <rev><timestamp>20120104T213000Z</timestamp></rev>\n  <uid><uri>urn:uuid:00CCFB88-155F-40F6-B9D9-B04D134860C0</uri></uid>\n  <serial-number xmlns='http://example.org/profiles/serial-number'>\n    FTX1234ABCD\n  </serial-number>\n  <note>\n    <parameters>\n      <type><text>x-contract-number</text></type>\n    </parameters>\n    <text>1234567</text>\n  </note>\n  <mac xmlns='http://example.org/profiles/mac'>\n    00-00-5E-00-00-01\n  </mac>\n  <sw-version xmlns='http://example.org/profiles/sw-version'>\n    2.1.5\n  </sw-version>\n</vcard>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has added the following entry to the \"vCard Property Values\" table of the \"vCard Elements\" registry (http://www.iana.org/assignments/vcard-elements):",
      "zh-CHS": "IANA已将以下条目添加到“vCard元素”注册表的“vCard属性值”表中(http://www.iana.org/assignments/vcard-elements):"
    },
    {
      "indent": 16,
      "text": "+----------+--------+---------------------+\n| Property |  Value |      Reference      |\n+----------+--------+---------------------+\n|   KIND   | device | RFC 6869, Section 3 |\n+----------+--------+---------------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "Table 1: IANA Registration of KIND:device vCard Property Value",
      "zh-CHS": "表1:IANA注册种类：设备vCard属性值"
    },
    {
      "indent": 3,
      "text": "In conformance with Section 10.2.6 of [RFC6350], the registration template is as follows:",
      "zh-CHS": "根据[RFC6350]第10.2.6节，注册模板如下："
    },
    {
      "indent": 3,
      "text": "Value: device",
      "zh-CHS": "值：设备"
    },
    {
      "indent": 3,
      "text": "Purpose: The entity represented by the vCard is a computing device such as an appliance, computer, or network element.",
      "zh-CHS": "用途：vCard表示的实体是计算设备，如设备、计算机或网元。"
    },
    {
      "indent": 3,
      "text": "Conformance: This value can be used with the \"KIND\" property.",
      "zh-CHS": "一致性：此值可与“种类”属性一起使用。"
    },
    {
      "indent": 3,
      "text": "Example: See Section 3 of RFC 6869.",
      "zh-CHS": "示例：见RFC 6869第3节。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Registration of this vCard KIND to represent devices does not in itself introduce security considerations beyond those specified for vCards in general as described in [RFC6350]. Nevertheless, risks can arise for vulnerable Internet-connected devices as a result of the publication of the identification details provided by device vCards. Well-known publicly accessible device vCard repositories, while not defined in this document, can increase the probability of an exploitation of an existing vulnerability, especially for devices with no good way to update their software or firmware. It is the responsibility of the device administrator to adhere to best current security practices and employ proper strategies for software upgrades and security patches in order to mitigate vulnerability to attack. Specifications defining device-specific vCard extensions or profiles that might be included in such vCards also need to consider this potential increased risk.",
      "zh-CHS": "注册此类vCard以表示设备本身不会引入超出[RFC6350]中所述vCard一般规定的安全注意事项。然而，由于公布设备vCard提供的识别详细信息，易受攻击的互联网连接设备可能会出现风险。众所周知的可公开访问的设备vCard存储库，虽然本文档中未定义，但会增加利用现有漏洞的可能性，尤其是对于无法更新其软件或固件的设备。设备管理员有责任遵守当前最佳安全实践，并为软件升级和安全修补程序采用适当的策略，以降低易受攻击的漏洞。定义特定设备的VCARE扩展或配置文件可能包含在这样的VCARD中也需要考虑这种潜在的增加的风险。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC6350] Perreault, S., \"vCard Format Specification\", RFC 6350, August 2011.",
      "zh-CHS": "[RFC6350]Perreault，S.，“vCard格式规范”，RFC 63502011年8月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[IEEE.802.1AR] Institute of Electrical and Electronics Engineers, \"Secure Device Identity\", IEEE 802.1AR, 2009.",
      "zh-CHS": "[IEEE.802.1AR]电气和电子工程师协会，“安全设备标识”，IEEE 802.1AR，2009年。"
    },
    {
      "indent": 3,
      "text": "[RFC4519] Sciberras, A., \"Lightweight Directory Access Protocol (LDAP): Schema for User Applications\", RFC 4519, June 2006.",
      "zh-CHS": "[RFC4519]Sciberras，A.，“轻量级目录访问协议（LDAP）：用户应用程序模式”，RFC4519，2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6351] Perreault, S., \"xCard: vCard XML Representation\", RFC 6351, August 2011.",
      "zh-CHS": "[RFC6351]Perreault，S.，“xCard:vCard XML表示”，RFC6351，2011年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6473] Saint-Andre, P., \"vCard KIND:application\", RFC 6473, December 2011.",
      "zh-CHS": "[RFC6473]圣安德烈，P.，“vCard种类：应用”，RFC 64732011年12月。"
    },
    {
      "indent": 3,
      "text": "[X.200] International Telecommunication Union, \"Information Technology - Open Systems Interconnection - Basic Reference Model: The Basic Model\", ITU-T Recommendation X.521, ISO Standard 9594-7, February 2001.",
      "zh-CHS": "[X.200]国际电信联盟，“信息技术-开放系统互连-基本参考模型：基本模型”，ITU-T建议X.521，ISO标准9594-7，2001年2月。"
    },
    {
      "indent": 3,
      "text": "[X.521] International Telecommunication Union, \"Information Technology - Open Systems Interconnection - The Directory: Selected Object Classes\", ITU-T Recommendation X.200, ISO Standard 7498-1, July 1994.",
      "zh-CHS": "[X.521]国际电信联盟，“信息技术-开放系统互连-目录：选定对象类”，ITU-T建议X.200，ISO标准7498-11994年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Gonzalo Salgueiro Cisco Systems 7200-12 Kit Creek Road Research Triangle Park, NC 27709 US",
      "zh-CHS": "Gonzalo Salgueiro思科系统7200-12美国北卡罗来纳州Kit Creek Road研究三角公园，邮编27709"
    },
    {
      "indent": 3,
      "text": "Phone: +1-919-392-3266\nEMail: gsalguei@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Joe Clarke Cisco Systems 7200-12 Kit Creek Road Research Triangle Park, NC 27709 US",
      "zh-CHS": "乔·克拉克思科系统7200-12美国北卡罗来纳州基特克里克路研究三角公园，邮编27709"
    },
    {
      "indent": 3,
      "text": "Phone: +1-919-392-2867\nEMail: jclarke@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre Cisco Systems 1899 Wynkoop Street, Suite 600 Denver, CO 80202 US",
      "zh-CHS": "美国科罗拉多州丹佛市温库普街1899号600室彼得·圣安德烈思科系统公司80202"
    },
    {
      "indent": 3,
      "text": "Phone: +1-303-308-3282\nEMail: psaintan@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}