{
  "title": {
    "text": "RFC 5333: IANA Registration of Enumservices for Internet Calendaring",
    "zh-CHS": "RFC 5333"
  },
  "number": 5333,
  "created_at": "2021-11-11 10:00:39.536333+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            R. Mahy\nRequest for Comments: 5333                                  Unaffiliated\nCategory: Standards Track                                   B. Hoeneisen\n                                                                Swisscom\n                                                            October 2009",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "IANA Registration of Enumservices for Internet Calendaring",
      "zh-CHS": "IANA注册用于Internet日历的枚举服务"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document registers Enumservices for Internet calendaring. Specifically, this document focuses on Enumservices for scheduling with iMIP (iCalendar Message-Based Interoperability Protocol) and for accessing Internet calendaring information with CalDAV (Calendaring Extensions to WebDAV).",
      "zh-CHS": "此文档注册用于Internet日历的枚举服务。具体而言，本文档重点介绍Enumservices，用于使用iMIP（iCalendar基于消息的互操作性协议）进行调度，以及使用CalDAV（WebDAV的日历扩展）访问Internet日历信息。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright and License Notice",
      "zh-CHS": "版权及许可证公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括《信托法律条款》第4.e节中所述的简化BSD许可文本，并且提供BSD许可中所述的代码组件时不提供任何担保。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may",
      "zh-CHS": "本文件可能包含2008年11月10日之前发布或公开的IETF文件或IETF贡献中的材料。控制某些材料版权的人员可能未授予IETF信托允许在IETF标准流程之外修改此类材料的权利。在未从控制此类材料版权的人员处获得充分许可的情况下，不得在IETF标准流程之外修改本文件，其衍生作品可能会"
    },
    {
      "indent": 3,
      "text": "not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "zh-CHS": "不得在IETF标准流程之外创建，除非将其格式化以RFC形式发布，或将其翻译成英语以外的语言。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "ENUM (E.164 Number Mapping, RFC 3761 [1]) is a system that uses DNS (Domain Name System, RFC 1034 [2]) to translate telephone numbers, such as '+12025550100', into URIs (Uniform Resource Identifiers, RFC 3986 [3]), such as 'mailto:user@example.com'. ENUM exists primarily to facilitate the interconnection of systems that rely on telephone numbers with those that use URIs to identify resources. The ENUM registration here could be used to allow phones, for example, to check the free/busy status of a user in their address book or propose a meeting with him or her from the user's phone number.",
      "zh-CHS": "ENUM（E.164数字映射，RFC 3761[1]）是一个使用DNS（域名系统，RFC 1034[2]）将电话号码（如“+12025550100”）转换为URI（统一资源标识符，RFC 3986[3]）的系统，如“mailto:user@example.com'. ENUM的存在主要是为了促进依赖电话号码的系统与使用URI识别资源的系统之间的互连。此处的ENUM注册可用于允许电话，例如，在其通讯簿中检查用户的忙/闲状态，或根据用户的电话号码建议与他或她会面。"
    },
    {
      "indent": 3,
      "text": "The Guide to Internet Calendaring [10] describes the relationship between various Internet calendaring specifications like this: \"iCalendar [4] is the language used to describe calendar objects. iTIP [5] [iCalendar Transport-Independent Interoperability Protocol] describes a way to use the iCalendar language to do scheduling. iMIP [6] [iCalendar Message-Based Interoperability Protocol] describes how to do iTIP scheduling via e-mail\".",
      "zh-CHS": "《互联网日历指南》[10]描述了各种互联网日历规范之间的关系，如下所示：“iCalendar[4]是用于描述日历对象的语言。iTIP[5][iCalendar独立于传输的互操作性协议]描述了使用iCalendar语言进行调度的方法。iMIP[6][iCalendar基于消息的互操作性协议]描述了如何通过电子邮件进行iTIP调度”。"
    },
    {
      "indent": 3,
      "text": "Recently, another Standards Track protocol for calendar and scheduling access has appeared. CalDAV (Calendaring Extensions to WebDAV) [7] is a WebDAV (Web-based Distributed Authoring and Versioning) [8] based mechanism for manipulating Internet calendars, viewing free/busy lists, and via a planned scheduling extension [15], could be used for proposing calendar events as well in the future.",
      "zh-CHS": "最近，出现了另一种用于日历和调度访问的标准跟踪协议。CalDAV（WebDAV的日历扩展）[7]是一种基于WebDAV（基于Web的分布式创作和版本控制）[8]的机制，用于操作Internet日历、查看忙/闲列表，并通过计划的调度扩展[15]，将来也可用于建议日历事件。"
    },
    {
      "indent": 3,
      "text": "The existing 'mailto:' URI scheme (defined in RFC 3986 [3]) is already used to address iMIP compatible Calendar Services. Likewise, the existing 'http:' and 'https:' URI schemes (defined in RFC 2616 [11] and RFC 2818 [12]) are already used to address CalDAV compatible Calendar Services.",
      "zh-CHS": "现有的“mailto:”URI方案（在RFC 3986[3]中定义）已用于解决与iMIP兼容的日历服务。类似地，现有的“http:”和“https:”URI方案（在RFC 2616[11]和RFC 2818[12]中定义）已经用于处理与CalDAV兼容的日历服务。"
    },
    {
      "indent": 3,
      "text": "This document registers Enumservices for scheduling and accessing Internet calendaring information associated with an E.164 number.",
      "zh-CHS": "本文档注册Enumservices，用于调度和访问与E.164号码相关的Internet日历信息。"
    },
    {
      "indent": 0,
      "text": "2. Enumservice Registrations",
      "section_title": true,
      "zh-CHS": "2. 枚举服务注册"
    },
    {
      "indent": 3,
      "text": "As defined in RFC 3761 [1], the following templates cover the information needed for the registration of the Enumservices specified in this document:",
      "zh-CHS": "如RFC 3761[1]中所定义，以下模板涵盖了注册本文档中指定的Enumservices所需的信息："
    },
    {
      "indent": 3,
      "text": "Enumservice Name: \"ical-sched\" Enumservice Type: \"ical-sched\" Enumservice Subtypes: \"mailto\" URI scheme(s): 'mailto:' Functional Specification: This Enumservice indicates that the resource identified can be addressed by the associated URI used for scheduling using Internet calendaring via Internet mail with the iMIP [6] protocol. Security considerations: See Section 4. Intended usage: COMMON Author: Rohan Mahy (rohan@ekabal.com)",
      "zh-CHS": "Enumservice名称：“ical sched”Enumservice类型：“ical sched”Enumservice子类型：“mailto”URI方案：'mailto:'功能规范：此Enumservice表示标识的资源可以由用于通过iMIP[6]协议的Internet邮件使用Internet日历进行调度的关联URI寻址。安全注意事项：见第4节。预期用途：共同作者：Rohan Mahy(rohan@ekabal.com)"
    },
    {
      "indent": 3,
      "text": "Enumservice Name: \"ical-access\" Enumservice Type: \"ical-access\" Enumservice Subtypes: \"http\" URI scheme(s): 'http:' Functional Specification: This Enumservice indicates that the resource identified can be addressed by the associated URI in order to access a user's calendar (for example free/busy status) using the CalDAV [7] protocol for Internet calendaring. Security considerations: See Section 4. Intended usage: COMMON Author: Rohan Mahy (rohan@ekabal.com)",
      "zh-CHS": "Enumservice名称：“ical access”Enumservice类型：“ical access”Enumservice子类型：“http”URI方案：“http:”功能规范：此Enumservice表示标识的资源可以通过关联的URI寻址，以便使用CalDAV访问用户的日历（例如忙/闲状态）[7]互联网日历协议。安全注意事项：见第4节。预期用途：共同作者：Rohan Mahy(rohan@ekabal.com)"
    },
    {
      "indent": 3,
      "text": "Enumservice Name: \"ical-access\" Enumservice Type: \"ical-access\" Enumservice Subtypes: \"https\" URI scheme(s): 'https:' Functional Specification: This Enumservice indicates that the resource identified can be addressed by the associated URI in order to access a user's calendar (for example free/busy status) using the CalDAV [7] protocol for Internet calendaring. Security considerations: See Section 4. Intended usage: COMMON Author: Rohan Mahy (rohan@ekabal.com)",
      "zh-CHS": "Enumservice名称：“ical access”Enumservice类型：“ical access”Enumservice子类型：“https”URI方案：“https:”功能规范：此Enumservice表示可以通过关联的URI寻址标识的资源，以便使用CalDAV访问用户的日历（例如忙/闲状态）[7]互联网日历协议。安全注意事项：见第4节。预期用途：共同作者：Rohan Mahy(rohan@ekabal.com)"
    },
    {
      "indent": 3,
      "text": "Note: These Enumservices use a dash \"-\" in the Type strings. To allow for hierarchical concepts (as required in this case), some kind of boundary needs to be in place. Neither RFC 3761 [1] nor its intended successor [17] foresee the concept of sub-subtyping. The natural solution to address this requirement is the usage of dash \"-\" in Type strings, which is slightly contradictory to RFC 3761 [1]. However, its intended successors [16] [17] clearly allow a dash \"-\" in Type strings, so that using \"-\" is seen as a practical way forward.",
      "zh-CHS": "注意：这些枚举服务在类型字符串中使用破折号“-”。为了允许层次概念（如本例所需），需要有某种边界。RFC 3761[1]及其预期继任者[17]均未预见到子类型的概念。解决此要求的自然解决方案是在类型字符串中使用破折号“-”，这与RFC 3761[1]稍有矛盾。然而，它的预期继承者[16][17]显然允许在类型字符串中使用破折号“-”，因此使用“-”被视为一种切实可行的方法。"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "$ORIGIN 3.2.1.0.5.5.5.2.1.2.1.e164.arpa. @ NAPTR 10 100 \"u\" \"E2U+ical-access:https\" \\ \"!^.*$!https://cal.example.com/home/alice/calendars/!\" .",
      "zh-CHS": "$ORIGIN 3.2.1.0.5.5.5.2.1.2.1.e164.arpa.@NAPTR 10 100“u”E2U+ical访问：https“\\”！^.*$！https://cal.example.com/home/alice/calendars/!\" ."
    },
    {
      "indent": 3,
      "text": "$ORIGIN 3.2.1.0.5.5.5.2.1.2.1.e164.arpa. @ NAPTR 20 100 \"u\" \"E2U+ical-sched:mailto\" \\ \"!^.*$!mailto:alice@example.com!\" .",
      "zh-CHS": "$ORIGIN 3.2.1.0.5.5.5.2.1.2.1.e164.arpa.@NAPTR 20 100“u”E2U+ical附表：mailto“\\”！^.*$！mailto:alice@example.com!\" ."
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The Domain Name System (DNS) does not make policy decisions about which records it provides to a DNS resolver. All DNS records must be assumed to be available to all inquirers at all times. The information provided within an ENUM record set must therefore be considered open to the public -- which is a cause for some privacy considerations.",
      "zh-CHS": "域名系统（DNS）不会就向DNS解析程序提供哪些记录做出策略决定。必须假设所有DNS记录在任何时候都可供所有查询者使用。因此，枚举记录集中提供的信息必须被视为对公众开放——这是一些隐私考虑的原因。"
    },
    {
      "indent": 3,
      "text": "Revealing a calendaring URI by itself is unlikely to introduce many privacy concerns, although, depending on the structure of the URI, it might reveal the full name or employer of the target. The use of anonymous URIs mitigates this risk.",
      "zh-CHS": "单独显示日历URI不太可能引起很多隐私问题，尽管根据URI的结构，它可能会显示目标的全名或雇主。匿名URI的使用减轻了这种风险。"
    },
    {
      "indent": 3,
      "text": "As ENUM uses DNS, which in its current form is an insecure protocol, there is no mechanism for ensuring that the answer returned to a query is authentic. An analysis of threats specific to the dependence of ENUM on the DNS is provided in RFC 3761 [1], and a thorough analysis of threats to the DNS itself is covered in RFC 3833 [14]. Many of these problems are prevented when the resolver verifies the authenticity of answers to its ENUM queries via DNSSEC (DNS Security, RFC 4035 [9]) in zones where it is available.",
      "zh-CHS": "由于ENUM使用DNS（目前的形式是一种不安全的协议），因此没有任何机制来确保返回到查询的答案是真实的。RFC 3761[1]中提供了针对ENUM对DNS依赖性的特定威胁分析，RFC 3833[14]中涵盖了对DNS本身威胁的彻底分析。当解析器在可用区域通过DNSSEC（DNS安全，RFC 4035[9]）验证其枚举查询答案的真实性时，许多问题都可以避免。"
    },
    {
      "indent": 3,
      "text": "More serious security concerns are associated with potential attacks against an underlying calendaring system (for example, unauthorized modification or viewing). For this reason, iTIP discusses a number of security requirements (detailed in RFC 2446 [5]) that call for authentication, integrity and confidentiality properties, and similar measures to prevent such attacks. Any calendaring protocol used in conjunction with a URI scheme currently meets these requirements. The use of CalDAV with the 'https:' scheme makes use of TLS (Transport Layer Security, RFC 5246 [13]) to provide server authentication, confidentiality, and message integrity.",
      "zh-CHS": "更严重的安全问题与对底层日历系统的潜在攻击有关（例如，未经授权的修改或查看）。因此，iTIP讨论了许多安全要求（详见RFC 2446[5]），这些要求要求身份验证、完整性和机密性属性，以及防止此类攻击的类似措施。与URI方案结合使用的任何日历协议目前都满足这些要求。将CalDAV与“https:”方案结合使用，利用TLS（传输层安全，RFC 5246[13]）提供服务器身份验证、机密性和消息完整性。"
    },
    {
      "indent": 3,
      "text": "Unlike a traditional telephone number, the resource identified by an calendaring URI is often already guessable, and it often requires that users provide cryptographic credentials for authentication and authorization before calendar data can be exchanged. Despite the public availability of ENUM records, the use of this information to reveal an unprotected calendaring resource is unlikely in practice.",
      "zh-CHS": "与传统的电话号码不同，日历URI标识的资源通常已经可以猜测，并且它通常要求用户在交换日历数据之前提供用于身份验证和授权的加密凭据。尽管枚举记录已公开，但在实践中不太可能使用此信息来显示未受保护的日历资源。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "zh-CHS": "5. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document requests registration of the \"ical-sched\" and \"ical-access\" Enumservices according to the definitions in Section 2 of this document and RFC 3761 [1].",
      "zh-CHS": "本文件要求根据本文件第2节和RFC 3761[1]中的定义注册“ical sched”和“ical access”Enumservices。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Faltstrom, P. and M. Mealling, \"The E.164 to Uniform Resource Identifiers (URI) Dynamic Delegation Discovery System (DDDS) Application (ENUM)\", RFC 3761, April 2004.",
      "zh-CHS": "[1] Faltstrom，P.和M.Mealling，“E.164到统一资源标识符（URI）动态委托发现系统（DDDS）应用程序（ENUM）”，RFC 3761，2004年4月。"
    },
    {
      "indent": 3,
      "text": "[2] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, November 1987.",
      "zh-CHS": "[2] Mockapetris，P.，“域名-概念和设施”，STD 13，RFC 1034，1987年11月。"
    },
    {
      "indent": 3,
      "text": "[3] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "zh-CHS": "[3] Berners Lee，T.，Fielding，R.，和L.Masinter，“统一资源标识符（URI）：通用语法”，STD 66，RFC 3986，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Dawson, F. and Stenerson, D., \"Internet Calendaring and Scheduling Core Object Specification (iCalendar)\", RFC 2445, November 1998.",
      "zh-CHS": "[4] Dawson，F.和Stenerson，D.，“互联网日历和调度核心对象规范（iCalendar）”，RFC 24451998年11月。"
    },
    {
      "indent": 3,
      "text": "[5] Silverberg, S., Mansour, S., Dawson, F., and R. Hopson, \"iCalendar Transport-Independent Interoperability Protocol (iTIP) Scheduling Events, BusyTime, To-dos and Journal Entries\", RFC 2446, November 1998.",
      "zh-CHS": "[5] Silverberg，S.，Mansour，S.，Dawson，F.，和R.Hopson，“iCalendar传输独立互操作性协议（iTIP）调度事件，繁忙时间，待办事项和日志条目”，RFC 24461998年11月。"
    },
    {
      "indent": 3,
      "text": "[6] Dawson, F., Mansour, S., and S. Silverberg, \"iCalendar Message-Based Interoperability Protocol (iMIP)\", RFC 2447, November 1998.",
      "zh-CHS": "[6] Dawson，F.，Mansour，S.和S.Silverberg，“iCalendar基于消息的互操作性协议（iMIP）”，RFC 2447，1998年11月。"
    },
    {
      "indent": 3,
      "text": "[7] Daboo, C., Desruisseaux, B., and L. Dusseault, \"Calendaring Extensions to WebDAV (CalDAV)\", RFC 4791, March 2007.",
      "zh-CHS": "[7] Daboo，C.，Desruisseaux，B.，和L.Dusseault，“WebDAV的日历扩展（CalDAV）”，RFC 47912007年3月。"
    },
    {
      "indent": 3,
      "text": "[8] Dusseault, L., \"HTTP Extensions for Web Distributed Authoring and Versioning (WebDAV)\", RFC 4918, June 2007.",
      "zh-CHS": "[8] Dusseault，L.，“用于Web分布式创作和版本控制（WebDAV）的HTTP扩展”，RFC4918，2007年6月。"
    },
    {
      "indent": 3,
      "text": "[9] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"Protocol Modifications for the DNS Security Extensions\", RFC 4035, March 2005.",
      "zh-CHS": "[9] Arends，R.，Austein，R.，Larson，M.，Massey，D.，和S.Rose，“DNS安全扩展的协议修改”，RFC 4035，2005年3月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[10] Mahoney, B., Babics, G., and A. Taler, \"Guide to Internet Calendaring\", RFC 3283, June 2002.",
      "zh-CHS": "[10] Mahoney，B.，Babics，G.，和A.Taler，“互联网日历指南”，RFC 3283，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[11] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "zh-CHS": "[11] 菲尔丁，R.，盖蒂斯，J.，莫卧儿，J.，弗莱斯蒂克，H.，马斯特，L.，利奇，P.，和T.伯纳斯李，“超文本传输协议——HTTP/1.1”，RFC2616，1999年6月。"
    },
    {
      "indent": 3,
      "text": "[12] Rescorla, E., \"HTTP Over TLS\", RFC 2818, May 2000.",
      "zh-CHS": "[12] Rescorla，E.，“TLS上的HTTP”，RFC 2818，2000年5月。"
    },
    {
      "indent": 3,
      "text": "[13] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, August 2008.",
      "zh-CHS": "[13] Dierks，T.和E.Rescorla，“传输层安全（TLS）协议版本1.2”，RFC 5246，2008年8月。"
    },
    {
      "indent": 3,
      "text": "[14] Atkins, D. and R. Austein, \"Threat Analysis of the Domain Name System (DNS)\", RFC 3833, August 2004.",
      "zh-CHS": "[14] Atkins，D.和R.Austein，“域名系统（DNS）的威胁分析”，RFC 38332004年8月。"
    },
    {
      "indent": 3,
      "text": "[15] Daboo, C. and B. Desruisseaux, \"CalDAV Scheduling Extensions to WebDAV\", Work in Progress, August 2009.",
      "zh-CHS": "[15] Daboo，C.和B.Desruisseaux，“网络DAV的CalDAV调度扩展”，正在进行的工作，2009年8月。"
    },
    {
      "indent": 3,
      "text": "[16] Bradner, S., Conroy, L., and K. Fujiwara, \"The E.164 to Uniform Resource Identifiers (URI) Dynamic Delegation Discovery System (DDDS) Application (ENUM)\", Work in Progress, May 2009.",
      "zh-CHS": "[16] Bradner，S.，Conroy，L.，和K.Fujiwara，“E.164到统一资源标识符（URI）动态委托发现系统（DDDS）应用程序（ENUM）”，正在进行的工作，2009年5月。"
    },
    {
      "indent": 3,
      "text": "[17] Hoeneisen, B., Mayrhofer, A., and J. Livingood, \"IANA Registration of Enumservices: Guide, Template and IANA Considerations\", Work in Progress, September 2009.",
      "zh-CHS": "[17] Hoeneisen，B.，Mayrhofer，A.，和J.Livingood，“Enumservices的IANA注册：指南，模板和IANA注意事项”，正在进行的工作，2009年9月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgments",
      "section_title": true,
      "zh-CHS": "附录A.确认书"
    },
    {
      "indent": 3,
      "text": "Thanks to Lisa Dusseault and Alexander Mayrhofer for reviewing this document.",
      "zh-CHS": "感谢Lisa Dusseault和Alexander Mayrhofer审阅本文件。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Rohan Mahy Unaffiliated",
      "zh-CHS": "Rohan Mahy非附属公司"
    },
    {
      "indent": 3,
      "text": "EMail: rohan@ekabal.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Bernie Hoeneisen Swisscom CH-8000 Zuerich Switzerland",
      "zh-CHS": "伯尼·霍内森瑞士公司CH-8000瑞士祖里希"
    },
    {
      "indent": 3,
      "text": "EMail: bernie@ietf.hoeneisen.ch (bernhard.hoeneisen@swisscom.com)\nURI:   http://www.swisscom.com/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}