{
  "title": {
    "text": "RFC 5378: Rights Contributors Provide to the IETF Trust",
    "zh-CHS": "RFC 5378"
  },
  "number": 5378,
  "created_at": "2021-11-11 12:54:32.384160+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    S. Bradner, Ed.\nRequest for Comments: 5378                            Harvard University\nBCP: 78                                                J. Contreras, Ed.\nObsoletes: 3978, 4748                                         WilmerHale\nUpdates: 2026                                              November 2008\nCategory: Best Current Practice",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Rights Contributors Provide to the IETF Trust",
      "zh-CHS": "出资人向IETF信托基金提供的权利"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2008 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2008 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.translate error, please retry"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The IETF policies about rights in Contributions to the IETF are designed to ensure that such Contributions can be made available to the IETF and Internet communities while permitting the authors to retain as many rights as possible. This memo details the IETF policies on rights in Contributions to the IETF. It also describes the objectives that the policies are designed to meet. This memo obsoletes RFCs 3978 and 4748 and, with BCP 79 and RFC 5377, replaces Section 10 of RFC 2026.",
      "zh-CHS": "IETF关于IETF稿件权利的政策旨在确保IETF和互联网社区可以获得此类稿件，同时允许作者保留尽可能多的权利。本备忘录详细说明了IETF关于向IETF捐款的权利的政策。它还描述了政策旨在实现的目标。本备忘录废除了RFC 3978和4748，并用BCP 79和RFC 5377取代RFC 2026第10节。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Definitions .....................................................3\n2. Introduction ....................................................5\n   2.1. No Retroactive Effect ......................................5\n3. Exposition of Why These Procedures Are the Way They Are .........6\n   3.1. Rights Granted in Contributions ............................6\n   3.2. Rights to Use Contributions ................................6\n   3.3. Right to Produce Derivative Works ..........................6\n   3.4. Rights to Use Trademarks ...................................8\n   3.5. Contributions Not Subject to Copyright .....................8\n   3.6. Copyright in RFCs ..........................................9\n4. Non-IETF Documents ..............................................9\n5. Rights in Contributions .........................................9\n   5.1. General Policy .............................................9\n   5.2. Confidentiality Obligations ...............................10\n   5.3. Rights Granted by Contributors to the IETF Trust ..........10\n   5.4. Sublicenses by the IETF Trust .............................11\n   5.5. No Patent License .........................................11\n   5.6. Representations and Warranties ............................11\n   5.7. No Duty to Publish ........................................12\n   5.8. Trademarks ................................................12\n   5.9. Copyright in RFCs .........................................12\n   5.10. Contributors' Retention of Rights ........................12\n6. Legends, Notices and Other Standardized Text in IETF\n   Documents ......................................................13\n7. Security Considerations ........................................13\n8. References .....................................................14\n   8.1. Normative References ......................................14\n   8.2. Informative References ....................................14\n9. Acknowledgments ................................................15\n10. Changes since RFC 3978 ........................................15\n11. Declaration from the IAB ......................................16",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Definitions",
      "section_title": true,
      "zh-CHS": "1. 定义"
    },
    {
      "indent": 3,
      "text": "The following definitions are for terms used in the context of this document. Other terms, including \"IESG\", \"ISOC\", \"IAB\", and \"RFC Editor\" are defined in [RFC2028].",
      "zh-CHS": "以下定义适用于本文件中使用的术语。[RFC2028]中定义了其他术语，包括“IESG”、“ISOC”、“IAB”和“RFC编辑器”。"
    },
    {
      "indent": 3,
      "text": "a. \"Contribution\": any submission to the IETF intended by the Contributor for publication as all or part of an Internet-Draft or RFC (except for RFC Editor Contributions described in Section 4 below) and any statement made within the context of an IETF activity. Such statements include oral statements in IETF sessions as well as written and electronic communications, made at any time or place, that are addressed to:",
      "zh-CHS": "a. “贡献”：贡献者向IETF提交的任何拟作为互联网草案或RFC的全部或部分发布的文件（下文第4节所述的RFC编辑贡献除外）以及在IETF活动背景下所作的任何声明。此类声明包括在IETF会议上的口头声明以及在任何时间或地点进行的书面和电子通信，其目的是："
    },
    {
      "indent": 6,
      "text": "o the IETF plenary session, o any IETF working group or portion thereof, o any Birds of a Feather (BOF) session, o the IESG, or any member thereof on behalf of the IESG, o the IAB, or any member thereof on behalf of the IAB, o any IETF mailing list, including the IETF list itself, any working group or design team list, or any other list functioning under IETF auspices, o the RFC Editor or the Internet-Drafts function (except for RFC Editor Contributions, as described in Section 4 below).",
      "zh-CHS": "o IETF全体会议、任何IETF工作组或其部分、任何羽毛鸟（BOF）会议、IESG或代表IESG的任何成员、IAB或代表IAB的任何成员、任何IETF邮件列表，包括IETF列表本身、任何工作组或设计团队列表，或在IETF主持下运行的任何其他列表，或RFC编辑器或互联网草稿功能（RFC编辑器贡献除外，如下文第4节所述）。"
    },
    {
      "indent": 6,
      "text": "Statements made outside of an IETF session, mailing list, or other function, that are clearly not intended to be input to an IETF activity, group, or function are not IETF Contributions in the context of this document.",
      "zh-CHS": "在IETF会话、邮件列表或其他功能之外所做的声明，显然不打算输入到IETF活动、组或功能中，在本文件的上下文中，这些声明不属于IETF贡献。"
    },
    {
      "indent": 3,
      "text": "b. \"Contributor\": an individual submitting a Contribution.",
      "zh-CHS": "b. “贡献者”：提交贡献的个人。"
    },
    {
      "indent": 3,
      "text": "c. \"Indirect Contributor\": any person who has materially or substantially contributed to a Contribution without being personally involved in its submission to the IETF.",
      "zh-CHS": "c. “间接贡献者”：对贡献作出实质性或实质性贡献而未亲自参与向IETF提交贡献的任何人。"
    },
    {
      "indent": 3,
      "text": "d. \"Copyright\": the legal right granted to an author in a document or other work of authorship under applicable law. A \"copyright\" is not equivalent to a \"right to copy\". Rather a copyright encompasses all of the exclusive rights that an author has in a work, such as the rights to copy, publish, distribute and create derivative works of the work. An author often cedes these rights to his or her employer or other parties as a condition of employment or compensation.",
      "zh-CHS": "d. “版权”：根据适用法律授予作者在文件或其他作者作品中的合法权利。“版权”并不等同于“复制权”。相反，版权包括作者在作品中拥有的所有专有权利，如复制、出版、发行和创作作品衍生作品的权利。作者通常将这些权利让与其雇主或其他当事方，作为雇用或补偿的条件。"
    },
    {
      "indent": 3,
      "text": "e. \"IETF\": in the context of this document, the IETF includes all individuals who participate in meetings, working groups, mailing lists, functions, and other activities that are organized or",
      "zh-CHS": "e. “IETF”：在本文件中，IETF包括所有参加会议、工作组、邮件列表、职能和其他组织或活动的个人"
    },
    {
      "indent": 6,
      "text": "initiated by ISOC, the IESG, or the IAB under the general designation of the Internet Engineering Task Force (IETF), but solely to the extent of such participation.",
      "zh-CHS": "由互联网工程任务组（IETF）指定的ISOC、IESG或IAB发起，但仅限于此类参与范围。"
    },
    {
      "indent": 3,
      "text": "f. \"IETF Documents\": RFCs and Internet-Drafts that are used in the IETF Standards Process as defined in 1(g). This is identical to the \"IETF stream\" defined in [RFC4844].",
      "zh-CHS": "f. “IETF文件”：1（g）中定义的IETF标准过程中使用的RFC和互联网草案。这与[RFC4844]中定义的“IETF流”相同。"
    },
    {
      "indent": 3,
      "text": "g. \"IETF Standards Process\": the activities undertaken by the IETF in any of the settings described in 1(a) above.",
      "zh-CHS": "g. “IETF标准过程”：IETF在上述第1（a）条所述的任何环境中开展的活动。"
    },
    {
      "indent": 3,
      "text": "h. \"IETF Trust\": a trust established under the laws of the Commonwealth of Virginia, USA, in order to hold and administer intellectual property rights for the benefit of the IETF.",
      "zh-CHS": "h. “IETF信托”：根据美国弗吉尼亚州联邦法律设立的信托，旨在为IETF的利益持有和管理知识产权。"
    },
    {
      "indent": 3,
      "text": "i. \"Internet-Draft\": temporary documents used in the IETF Standards Process. Internet-Drafts are posted on the IETF web site by the IETF Secretariat. As noted in Section 2.2 of RFC 2026, Internet-Drafts have a nominal maximum lifetime of six months in the IETF Secretariat's public directory.",
      "zh-CHS": "i. “互联网草案”：IETF标准过程中使用的临时文件。互联网草案由IETF秘书处发布在IETF网站上。如RFC 2026第2.2节所述，互联网草案在IETF秘书处的公共目录中的名义最长使用期限为六个月。"
    },
    {
      "indent": 3,
      "text": "j. \"Legend Instructions\": the standardized text that is maintained by the IETF Trust and is included in IETF Documents and the instructions and requirements for including that standardized text in IETF Documents. The text and instructions are posted from time to time at http://trustee.ietf.org/license-info.",
      "zh-CHS": "j. “图例说明”：由IETF信托基金维护并包含在IETF文件中的标准化文本，以及将该标准化文本包含在IETF文件中的说明和要求。文本和说明不时发布在http://trustee.ietf.org/license-info."
    },
    {
      "indent": 3,
      "text": "k. \"RFC\": the publication series used by the IETF among others. RFCs are published by the RFC Editor. Although RFCs may be superseded in whole or in part by subsequent RFCs, the text of an RFC is not altered once published in RFC form. (See [RFC2026] Section 2.1.)",
      "zh-CHS": "k. “RFC”：IETF使用的出版物系列。RFC由RFC编辑器发布。尽管RFC可能被后续RFC全部或部分取代，但RFC的文本在以RFC形式发布后不会更改。（见[RFC2026]第2.1节。）"
    },
    {
      "indent": 3,
      "text": "l. \"Reasonably and personally known\": something an individual knows personally or, because of the job the individual holds, would reasonably be expected to know. This wording is used to indicate that an organization cannot purposely keep an individual in the dark about certain information just to avoid the disclosure requirement.",
      "zh-CHS": "l. “合理和个人知晓”：个人知道的事情，或由于个人所从事的工作，合理地期望知道的事情。该措辞用于表示组织不能为了避免披露要求而故意对个人隐瞒某些信息。"
    },
    {
      "indent": 3,
      "text": "m. \"Non-IETF documents\": Internet-Drafts that are submitted to the RFC Editor independently of the IETF Standards Process. (See Section 4.)",
      "zh-CHS": "m. “非IETF文件”：独立于IETF标准流程提交给RFC编辑器的互联网草案。（见第4节。）"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "zh-CHS": "2. 介绍"
    },
    {
      "indent": 3,
      "text": "In all matters of copyright and document procedures, the intent is to benefit the Internet community and the public at large, while respecting the legitimate rights of others.",
      "zh-CHS": "在版权和文件程序的所有事项中，目的是使互联网社区和广大公众受益，同时尊重他人的合法权利。"
    },
    {
      "indent": 3,
      "text": "Under the laws of most countries and current international treaties (for example the \"Berne Convention for the Protection of Literary and Artistic Work\" [Berne]), authors obtain numerous rights in the works they produce automatically upon producing them. These rights include copyrights, moral rights, and other rights. In many cases, if the author produces a work within the scope of his or her employment, most of those rights are usually assigned to the employer, either by operation of law or, in many cases, under contract. (The Berne Convention names some rights as \"inalienable\", which means that the author retains them in all cases.)",
      "zh-CHS": "根据大多数国家的法律和现行国际条约（例如《伯尔尼保护文学和艺术作品公约》[Berne]），作者在创作作品时自动获得作品的多项权利。这些权利包括版权、道德权利和其他权利。在许多情况下，如果作者在其受雇范围内创作作品，这些权利中的大多数通常通过法律或在许多情况下根据合同转让给雇主。（伯尔尼公约将某些权利命名为“不可剥夺”，这意味着提交人在所有情况下都保留这些权利。）"
    },
    {
      "indent": 3,
      "text": "In order for Contributions to be used within the IETF Standards Process, including when they are published as Internet-Drafts or RFCs, certain limited rights must be granted to the IETF Trust, which then grants the necessary rights to the IETF. In addition, Contributors must make representations to the IETF Trust and the IETF regarding their ability to grant these rights.",
      "zh-CHS": "为了在IETF标准过程中使用贡献，包括当它们作为互联网草案或RFC发布时，必须向IETF信托授予某些有限的权利，然后IETF信托将必要的权利授予IETF。此外，贡献者必须向IETF信托基金和IETF陈述其授予这些权利的能力。"
    },
    {
      "indent": 3,
      "text": "Section 1 provides definitions used in these policies. Sections 3 and 4 of this document explain the rationale for these provisions. Sections 1, 2, 5, and 6 of this document are normative, the other sections are informative. RFC 3979 (BCP 79) [RFC3979] deals with rights, including possible patent rights, in technologies developed or specified as part of the IETF Standards Process. This document is not intended to address those issues. This memo obsoletes RFCs 3978 [RFC3978] and 4748 [RFC4748] and, with RFC 3979 (BCP 79) and [RFC5377], replaces Section 10 of RFC 2026 [RFC2026].",
      "zh-CHS": "第1节提供了这些政策中使用的定义。本文件第3节和第4节解释了这些规定的基本原理。本文件第1、2、5和6节为规范性章节，其他章节为资料性章节。RFC 3979（BCP 79）[RFC3979]涉及作为IETF标准过程一部分开发或指定的技术的权利，包括可能的专利权。本文件无意解决这些问题。本备忘录废除了RFC 3978[RFC3978]和4748[RFC4748]，并用RFC 3979（BCP 79）和[RFC5377]取代RFC 2026[RFC2026]第10节。"
    },
    {
      "indent": 3,
      "text": "This document is not intended as legal advice. Readers are advised to consult their own legal advisors if they would like a legal interpretation of their rights or the rights of the IETF Trust [RFC4371] in any Contributions they make.",
      "zh-CHS": "本文件不作为法律意见。如果读者希望对其权利或IETF信托基金[RFC4371]在其任何贡献中的权利进行法律解释，建议读者咨询自己的法律顾问。"
    },
    {
      "indent": 0,
      "text": "2.1. No Retroactive Effect",
      "section_title": true,
      "zh-CHS": "2.1. 无追溯效力"
    },
    {
      "indent": 3,
      "text": "This memo does not retroactively obtain additional rights from Contributions that predate the date that the IETF Trust announces the adoption of these procedures.",
      "zh-CHS": "本备忘录不追溯至IETF信托基金宣布采用这些程序之前的捐款获得额外权利。"
    },
    {
      "indent": 0,
      "text": "3. Exposition of Why These Procedures Are the Way They Are",
      "section_title": true,
      "zh-CHS": "3. 解释为什么这些程序是这样的"
    },
    {
      "indent": 0,
      "text": "3.1. Rights Granted in Contributions",
      "section_title": true,
      "zh-CHS": "3.1. 在捐款中授予的权利"
    },
    {
      "indent": 3,
      "text": "The IETF Trust and the IETF must obtain the right to publish an IETF Contribution as an RFC or an Internet-Draft from the Contributors.",
      "zh-CHS": "IETF信托基金和IETF必须从贡献者处获得将IETF贡献作为RFC或互联网草稿发布的权利。"
    },
    {
      "indent": 3,
      "text": "A primary objective of this policy is to obtain from the document authors only the non-exclusive rights that are needed to develop and publish IETF Documents and to use IETF Contributions in the IETF Standards Process and potentially elsewhere.",
      "zh-CHS": "本政策的主要目标是仅从文件作者处获得开发和发布IETF文件所需的非排他性权利，以及在IETF标准过程中以及其他地方使用IETF贡献所需的非排他性权利。"
    },
    {
      "indent": 3,
      "text": "The authors retain all other rights, but cannot withdraw the above rights from the IETF Trust and the IETF.",
      "zh-CHS": "作者保留所有其他权利，但不能从IETF信托和IETF撤销上述权利。"
    },
    {
      "indent": 3,
      "text": "It is important to note that under this document, Contributors are required to grant certain rights to the IETF Trust (see Section 5.3.), which holds all IETF-related intellectual property on behalf of the IETF community. The IETF Trust will, in turn, grant a sublicense of these rights to all IETF participants for use in the IETF Standards Process (see Section 5.4.). This sublicense is necessary for the standards development work of the IETF to continue. In addition, the IETF Trust may grant certain other sublicenses of the rights that it is granted under this document. In granting such other sublicenses, the IETF Trust will be guided and bound by documents such as [RFC5377].",
      "zh-CHS": "需要注意的是，根据本文件，贡献者必须向IETF信托授予某些权利（见第5.3节），该信托代表IETF社区持有所有与IETF相关的知识产权。反过来，IETF信托将向所有IETF参与者授予这些权利的再许可，以用于IETF标准过程（见第5.4节）。该分许可证对于IETF的标准开发工作的继续是必要的。此外，IETF信托可授予其根据本文件授予的权利的某些其他分许可。在授予此类其他分许可时，IETF信托将受到[RFC5377]等文件的指导和约束。"
    },
    {
      "indent": 0,
      "text": "3.2. Rights to Use Contributions",
      "section_title": true,
      "zh-CHS": "3.2. 使用捐款的权利"
    },
    {
      "indent": 3,
      "text": "It is important that the IETF receive assurances from all Contributors that they have the authority to grant the IETF the rights that they claim to grant because, under the laws of most countries and applicable international treaties, copyright rights come into existence when a work of authorship is created (but see Section 3.5 below regarding public domain documents), and the IETF cannot make use of IETF Contributions if it does not have sufficient rights with respect to these copyright rights. The IETF and its participants would run a greater risk of liability to the owners of these rights without this assurance. To this end, the IETF asks Contributors to give the assurances in Section 5.6 below. These assurances are requested, however, only to the extent of the Contributor's reasonable and personal knowledge. (See Section 1(l).)",
      "zh-CHS": "IETF必须得到所有贡献者的保证，即他们有权授予IETF他们声称授予的权利，因为根据大多数国家的法律和适用的国际条约，版权权在创作作者作品时即存在（但有关公共领域文件，请参见下文第3.5节），如果IETF没有足够的版权权利，则IETF不能使用IETF贡献。如果没有此保证，IETF及其参与者将承担对这些权利所有者的更大责任风险。为此，IETF要求贡献者在下文第5.6节中作出保证。这些保证但是，仅在供款人合理和个人了解的范围内，才要求提供补偿。（见第1（l）节）"
    },
    {
      "indent": 0,
      "text": "3.3. Right to Produce Derivative Works",
      "section_title": true,
      "zh-CHS": "3.3. 创作衍生作品的权利"
    },
    {
      "indent": 3,
      "text": "The IETF needs to be able to evolve IETF Documents in response to experience gained in the deployment of the technologies described in such IETF Documents, to incorporate developments in research, and to",
      "zh-CHS": "IETF需要能够根据在此类IETF文件中描述的技术部署过程中获得的经验，发展IETF文件，以纳入研究开发，并"
    },
    {
      "indent": 3,
      "text": "react to changing conditions on the Internet and other IP networks. The IETF may also decide to permit others to develop derivative works based on Contributions. In order to do this, the IETF must be able to produce derivatives of its documents; thus, the IETF must obtain the right from Contributors to produce derivative works. Note that the right to produce translations is required before any Contribution can be published as an RFC, to ensure the widest possible distribution of the material in RFCs. The right to produce derivative works, in addition to translations, is required for all IETF Standards Track documents and for most IETF non-Standards Track documents. There are two exceptions to this requirement: documents describing proprietary technologies and documents that are republications of the work of other standards organizations.",
      "zh-CHS": "对Internet和其他IP网络上不断变化的条件作出反应。IETF还可以决定允许其他人根据贡献开发衍生作品。为了做到这一点，IETF必须能够生成其文档的派生版本；因此，IETF必须从贡献者那里获得创作衍生作品的权利。请注意，在任何稿件可以作为RFC出版之前，需要有翻译权，以确保在RFC中尽可能广泛地分发材料。除翻译外，所有IETF标准跟踪文件和大多数IETF非标准跟踪文件都要求有权制作衍生作品。此要求有两个例外：描述专有技术的文件和其他标准组织工作的再版文件。"
    },
    {
      "indent": 3,
      "text": "The right to produce derivative works must be granted in order for an IETF working group to accept a Contribution as a working group document or otherwise work on it. For non-working group Contributions where the Contributor requests publication as a Standards Track RFC, the right to produce derivative works must be granted before the IESG will issue an IETF Last Call and, for most non-Standards Track, non-working group Contributions, before the IESG will consider the Internet-Draft for publication. Occasionally a Contributor may not want to grant publication rights or the right to produce derivative works before finding out if a Contribution has been accepted for development in the IETF Standards Process. In these cases, the Contributor may include a limitation on the right to make derivative works in the form specified in the Legend Instructions. A working group can discuss the Contribution with the aim to decide if it should become a working group document, even though the right to produce derivative works or to publish the Contribution as an RFC has not yet been granted. However, if the Contribution is accepted for development, the Contributor must resubmit the Contribution without the limitation notices before a working group can formally adopt the Contribution as a working group document. The IETF Trust may establish different policies for granting sublicenses with respect to different types of Contributions and content within Contributions (such as executable code versus descriptive text or references to third-party materials). The IETF Trust's policies concerning the granting of sublicenses to make derivative works will be guided by RFC [RFC5377].",
      "zh-CHS": "为了让IETF工作组接受作为工作组文件的贡献或以其他方式对其进行工作，必须授予制作衍生作品的权利。对于非工作组捐款，贡献者要求出版作为标准轨道RFC，在IEESG将发出IETF最后呼叫之前，必须授予生产衍生作品的权利，并且对于大多数非标准轨道，非工作组贡献，在IESG将考虑互联网出版的草案之前。有时，撰稿人可能不想授予出版权或创作衍生作品的权利，直到发现在IETF标准过程中是否接受了某一贡献的开发。在这些情况下，撰稿人可能会限制以图例说明中规定的形式制作衍生作品的权利。工作组可以讨论该贡献，以决定该贡献是否应成为工作组文件，即使尚未授予制作衍生作品或以RFC形式发布该贡献的权利。但是，如果捐款被接受用于开发，则在工作组正式将捐款作为工作组文件采纳之前，捐款人必须重新提交捐款，而无限制通知。IETF信托可针对不同类型的贡献和贡献中的内容（如可执行代码与描述性文本或对第三方材料的引用）制定不同的政策，以授予分许可。IETF信托基金关于授予衍生作品再许可的政策将以RFC[RFC5377]为指导。"
    },
    {
      "indent": 3,
      "text": "The IETF has historically encouraged organizations to publish details of their technologies, even when the technologies are proprietary, because understanding how existing technology is being used helps when developing new technology. But organizations that publish information about proprietary technologies are frequently not willing to have the IETF produce revisions of the technologies and then possibly claim that the IETF version is the \"new version\" of the",
      "zh-CHS": "IETF历来鼓励组织发布其技术的详细信息，即使这些技术是专有的，因为了解现有技术的使用方式有助于开发新技术。但是，发布专有技术信息的组织通常不愿意让IETF对这些技术进行修订，然后可能声称IETF版本是这些技术的“新版本”"
    },
    {
      "indent": 3,
      "text": "organization's technology. Organizations that feel this way can specify that a Contribution be published with the other rights granted under this document but may withhold the right to produce derivative works other than translations.",
      "zh-CHS": "组织的技术。有这种想法的组织可以规定，发表的稿件应具有本文件授予的其他权利，但可以保留制作除翻译以外的衍生作品的权利。"
    },
    {
      "indent": 3,
      "text": "In addition, IETF Documents frequently make normative references to standards or recommendations developed by other standards organizations. Since the publications of some standards organizations are not public documents, it can be quite helpful to the IETF to republish, with the permission of the other standards organization, some of these documents as RFCs so that the IETF community can have open access to them to better understand what they are referring to. In these cases, the RFCs can be published without the right for the IETF to produce derivative works. In both of the above cases, in which the production of derivative works is excluded, the Contributor must include a special legend in the Contribution, as specified in the Legend Instructions, in order to notify IETF participants about this restriction.",
      "zh-CHS": "此外，IETF文件经常引用其他标准组织制定的标准或建议。由于一些标准组织的出版物不是公共文件，因此，在其他标准组织的许可下，将其中一些文件重新发布为RFC对IETF非常有帮助，以便IETF社区可以公开访问这些文件，以便更好地理解它们所指的内容。在这些情况下，RFC可以在没有IETF制作衍生作品权利的情况下发布。在上述两种情况下，如果衍生作品的制作被排除在外，则投稿人必须按照图例说明中的规定，在投稿中加入特殊图例，以便将此限制通知IETF参与者。"
    },
    {
      "indent": 0,
      "text": "3.4. Rights to Use Trademarks",
      "section_title": true,
      "zh-CHS": "3.4. 商标使用权"
    },
    {
      "indent": 3,
      "text": "Contributors may wish to seek trademark or service mark protection on any terms that are coined or used in their Contributions. The IETF makes no judgment about the validity of any such trademark rights. However, the IETF requires each Contributor, under the licenses described in Section 5.3 below, to grant the IETF Trust a perpetual license to use any such trademarks or service marks solely in exercising rights to reproduce, publish, discuss, and modify the IETF Contribution. This license does not authorize the IETF or others to use any trademark or service mark in connection with any product or service offering.",
      "zh-CHS": "投稿人可能希望根据其投稿中创造或使用的任何条款寻求商标或服务商标保护。IETF不对任何此类商标权的有效性做出判断。然而，IETF要求每个贡献者根据下文第5.3节所述的许可，授予IETF信托永久许可，仅在行使复制、发布、讨论和修改IETF贡献的权利时使用任何此类商标或服务标记。本许可证不授权IETF或其他人在任何产品或服务提供中使用任何商标或服务标志。"
    },
    {
      "indent": 0,
      "text": "3.5. Contributions Not Subject to Copyright",
      "section_title": true,
      "zh-CHS": "3.5. 不受版权限制的贡献"
    },
    {
      "indent": 3,
      "text": "Certain documents, including those produced by the U.S. government and those which are in the public domain, may not be protected by the same copyright and other legal rights as other documents. Nevertheless, we ask each Contributor to grant to the IETF the same rights he or she would grant, and to make the same representations, as though the IETF Contribution were protected by the same legal rights as other documents, and as though the Contributor could be able to grant these rights. We ask for these grants and representations only to the extent that the Contribution may be protected. We believe they are necessary to protect the ISOC, the IETF Trust, the IETF, the IETF Standards Process, and all IETF participants, and because the IETF does not have the resources or wherewithal to make any independent investigation as to the actual proprietary status of any document submitted to it.",
      "zh-CHS": "某些文件，包括美国政府制作的文件和属于公共领域的文件，可能不受与其他文件相同的版权和其他法律权利的保护。尽管如此，我们要求每位贡献者向IETF授予他或她将授予的相同权利，并做出相同的陈述，就好像IETF贡献与其他文件一样受到相同法律权利的保护，就好像贡献者能够授予这些权利一样。我们仅在捐款可能受到保护的情况下才要求这些赠款和陈述。我们认为，它们对于保护ISOC、IETF信托基金、IETF、IETF标准流程和所有IETF参与者是必要的，因为IETF没有资源或资金对提交给它的任何文件的实际所有权状态进行任何独立调查。"
    },
    {
      "indent": 0,
      "text": "3.6. Copyright in RFCs",
      "section_title": true,
      "zh-CHS": "3.6. RFCs中的版权"
    },
    {
      "indent": 3,
      "text": "As noted above, Contributors to the IETF (or their employers) retain ownership of the copyright in their Contributions. This includes Internet-Drafts and all other Contributions made within the IETF Standards Process (e.g., via e-mail, oral comment, and otherwise). However, it is important that the IETF (through the IETF Trust) own the copyright in documents that are published as RFCs (other than Informational RFCs and RFCs that are submitted as RFC Editor Contributions). Ownership of the copyright in an RFC does not diminish the Contributors' rights in their underlying contributions, but it does prevent anyone other than the IETF Trust (and its licensees) from republishing or modifying an RFC in RFC format. In this respect, Contributors are treated the same as anybody else: though they may extract and republish their own Contributions without limitation, they may not do so in the RFC format used by the IETF. And while this principle (which is included in Section 5.9 below) may appear to be new to the IETF, it actually reflects historical practice and has been observed for many years through the inclusion of an ISOC or IETF Trust copyright notice on all RFC documents since the publication of RFC 2026.",
      "zh-CHS": "如上所述，IETF的贡献者（或其雇主）保留其贡献的版权所有权。这包括互联网草案和IETF标准过程中的所有其他贡献（例如，通过电子邮件、口头评论等）。但是，重要的是，IETF（通过IETF信托基金）拥有作为RFC发布的文档的版权（信息RFC和作为RFC编辑器贡献提交的RFC除外）。RFC中版权的所有权不会减少贡献者在其基础贡献中的权利，但会阻止IETF信托基金（及其许可证持有人）以外的任何人以RFC格式重新发布或修改RFC。在这方面，贡献者被视为与其他任何人一样：尽管他们可以不受限制地提取和重新发布自己的贡献，但他们不能以IETF使用的RFC格式这样做。虽然这一原则（包含在下面的第5.9节中）对IETF来说可能是新的，但它实际上反映了历史实践，并且自RFC 2026发布以来，通过在所有RFC文件上包含ISOC或IETF信托版权通知，已被遵守多年。"
    },
    {
      "indent": 0,
      "text": "4. Non-IETF Documents",
      "section_title": true,
      "zh-CHS": "4. 非IETF文件"
    },
    {
      "indent": 3,
      "text": "This document only relates to Contributions made as part of the IETF Processes. Other documents that are referred to as Internet-Drafts and RFCs may be submitted to and published by the RFC Editor independently of the IETF Standards Process. Such documents are not covered by this document, unless the controlling entity for that document stream, as described in [RFC4844] chooses to apply these rules. Non-IETF Contributions must be marked appropriately as described in the Legend Instructions. See the RFC Editor web page for information about the policies concerning rights in RFC Editor Documents; for other document streams, the controlling entity must be contacted. See Section 11 for a declaration from the IAB on this matter.",
      "zh-CHS": "本文件仅涉及作为IETF过程一部分所做的贡献。被称为互联网草案和RFC的其他文件可独立于IETF标准流程提交给RFC编辑器并由其发布。除非[RFC4844]中所述的文档流的控制实体选择应用这些规则，否则此类文档不在本文档范围内。非IETF贡献必须按照图例说明中的说明进行适当标记。有关RFC编辑器文档中权限的策略信息，请参见RFC编辑器网页；对于其他文档流，必须联系控制实体。参见第11节，了解IAB关于该事项的声明。"
    },
    {
      "indent": 0,
      "text": "5. Rights in Contributions",
      "section_title": true,
      "zh-CHS": "5. 捐款权"
    },
    {
      "indent": 0,
      "text": "5.1. General Policy",
      "section_title": true,
      "zh-CHS": "5.1. 总方针"
    },
    {
      "indent": 3,
      "text": "By submission of a Contribution, each person actually submitting the Contribution and each named co-Contributor is deemed to have read and understood the rules and requirements set forth in this document. Each Contributor is deemed, by the act of submitting a Contribution, to enter into a legally-binding agreement to comply with the terms and conditions set forth in this document.",
      "zh-CHS": "通过提交出资，实际提交出资的每个人和每个指定共同出资人被视为已阅读并理解本文件中规定的规则和要求。通过提交出资，每位出资人均被视为签订了具有法律约束力的协议，以遵守本文件规定的条款和条件。"
    },
    {
      "indent": 3,
      "text": "The Contributor is further deemed to have agreed that he/she has obtained the necessary permissions to enter into such an agreement from any party that the Contributor reasonably and personally knows may have rights in the Contribution, including, but not limited to, the Contributor's sponsor or employer.",
      "zh-CHS": "出资人还应被视为已同意，他/她已从任何一方获得必要的许可，以签订出资人合理且个人知道可能对出资享有权利的协议，包括但不限于出资人的担保人或雇主。"
    },
    {
      "indent": 3,
      "text": "No further acknowledgment, signature, or other action is required to bind a Contributor to these terms and conditions. The operation of the IETF and the work conducted by its many participants is dependent on such agreement by each Contributor, and each IETF participant expressly relies on the agreement of each Contributor to the terms and conditions set forth in this document.",
      "zh-CHS": "不需要进一步的确认、签名或其他行动来约束贡献者遵守这些条款和条件。IETF的运行及其众多参与者开展的工作取决于每个参与者的此类协议，每个IETF参与者明确依赖于每个参与者对本文件中规定的条款和条件的协议。"
    },
    {
      "indent": 0,
      "text": "5.2. Confidentiality Obligations",
      "section_title": true,
      "zh-CHS": "5.2. 保密义务"
    },
    {
      "indent": 3,
      "text": "No information or document that is subject to any requirement of confidentiality or any restriction on its dissemination may be submitted as a Contribution or otherwise considered in any part of the IETF Standards Process, and there must be no assumption of any confidentiality obligation with respect to any Contribution. Each Contributor agrees that any statement in a Contribution, whether generated automatically or otherwise, that states or implies that the Contribution is confidential or subject to any privilege, can be disregarded for all purposes, and will be of no force or effect.",
      "zh-CHS": "受保密要求或传播限制的任何信息或文件不得作为贡献提交，或在IETF标准过程的任何部分中以其他方式考虑，且不得承担任何贡献的保密义务。每位供款人同意，供款中任何声明，无论是自动生成的还是以其他方式生成的，声明或暗示该供款是保密的或受任何特权约束的，均可出于所有目的不予理会，且不具有任何效力。"
    },
    {
      "indent": 0,
      "text": "5.3. Rights Granted by Contributors to the IETF Trust",
      "section_title": true,
      "zh-CHS": "5.3. IETF信托出资人授予的权利"
    },
    {
      "indent": 3,
      "text": "To the extent that a Contribution or any portion thereof is protected by copyright or other rights of authorship, the Contributor and each named co-Contributor grant a perpetual, irrevocable, non-exclusive, royalty-free, world-wide, sublicensable right and license to the IETF Trust under all such copyrights and other rights in the Contribution:",
      "zh-CHS": "如果贡献或其任何部分受版权或其他作者权利的保护，贡献者和每个指定的共同贡献者根据贡献中的所有此类版权和其他权利向IETF信托授予永久、不可撤销、非排他性、免版税、全球范围、可分许可的权利和许可："
    },
    {
      "indent": 3,
      "text": "a. to copy, publish, display, and distribute the Contribution, in whole or in part,",
      "zh-CHS": "a. 复制、发布、显示和分发全部或部分贡献，"
    },
    {
      "indent": 3,
      "text": "b. to prepare translations of the Contribution into languages other than English, in whole or in part, and to copy, publish, display, and distribute such translations or portions thereof,",
      "zh-CHS": "b. 将稿件的全部或部分翻译成英语以外的语言，并复制、出版、展示和分发此类翻译或部分翻译，"
    },
    {
      "indent": 3,
      "text": "c. to modify or prepare derivative works (in addition to translations) that are based on or incorporate all or part of the Contribution, and to copy, publish, display, and distribute such derivative works, or portions thereof unless explicitly disallowed in the notices contained in a Contribution (in the form specified by the Legend Instructions), and",
      "zh-CHS": "c. 修改或准备基于或包含全部或部分稿件的衍生作品（除翻译外），并复制、出版、展示和分发此类衍生作品或其部分，除非稿件中包含的通知明确禁止（采用图例说明规定的形式），和"
    },
    {
      "indent": 3,
      "text": "d. to reproduce any trademarks, service marks, or trade names which are included in the Contribution solely in connection with the reproduction, distribution, or publication of the Contribution and derivative works thereof as permitted by this Section 5.3, provided that when reproducing Contributions, trademark and service mark identifiers used in the Contribution, including TM and (R), will be preserved.",
      "zh-CHS": "d. 根据第5.3节的规定，复制本贡献书中包含的任何商标、服务商标或商号，仅与复制、分发或出版本贡献书及其衍生作品有关，前提是复制本贡献书时，贡献中使用的商标和服务标记标识符，包括商标和（R）将被保留。"
    },
    {
      "indent": 0,
      "text": "5.4. Sublicenses by the IETF Trust",
      "section_title": true,
      "zh-CHS": "5.4. IETF信托的分许可"
    },
    {
      "indent": 3,
      "text": "The IETF Trust will sublicense the rights granted to it under Section 5.3 to all IETF participants for use within the IETF Standards Process. This license is expressly granted under a license agreement issued by the IETF Trust, which can be found at http://trustee.ietf.org/license-info.",
      "zh-CHS": "IETF信托将根据第5.3节授予其的权利再授权给所有IETF参与者，以便在IETF标准过程中使用。本许可证是根据IETF信托发行的许可协议明确授予的，可在http://trustee.ietf.org/license-info."
    },
    {
      "indent": 3,
      "text": "This license is expressly granted under a license agreement issued by the IETF Trust and must contain a pointer to the full IETF Trust agreement.",
      "zh-CHS": "本许可证根据IETF信托发行的许可协议明确授予，并且必须包含指向完整IETF信托协议的指针。"
    },
    {
      "indent": 3,
      "text": "In addition, the IETF Trust may grant additional sublicenses of the licenses granted to it hereunder. In doing so, the IETF Trust will comply with the guidance provided under RFC 5377 [RFC5377].",
      "zh-CHS": "此外，IETF信托可授予本协议项下授予其的许可证的额外分许可证。在此过程中，IETF信托基金将遵守RFC 5377[RFC5377]下提供的指南。"
    },
    {
      "indent": 0,
      "text": "5.5. No Patent License",
      "section_title": true,
      "zh-CHS": "5.5. 无专利许可证"
    },
    {
      "indent": 3,
      "text": "The licenses granted in Section 5.3 shall not be deemed to grant any right under any patent, patent application, or other similar intellectual property right disclosed by the Contributor under BCP 79 [RFC3979] or otherwise.",
      "zh-CHS": "第5.3节中授予的许可不应被视为授予任何专利、专利申请或其他类似知识产权项下的任何权利，这些权利由贡献者根据BCP 79[RFC3979]或其他规定披露。"
    },
    {
      "indent": 0,
      "text": "5.6. Representations and Warranties",
      "section_title": true,
      "zh-CHS": "5.6. 陈述和保证"
    },
    {
      "indent": 3,
      "text": "With respect to each Contribution, each Contributor represents that, to the best of his or her knowledge and ability:",
      "zh-CHS": "关于每项贡献，每名贡献者表示，尽其所知所能："
    },
    {
      "indent": 3,
      "text": "a. The Contribution properly acknowledges all Contributors, including Indirect Contributors.",
      "zh-CHS": "a. 该贡献正确承认所有贡献者，包括间接贡献者。"
    },
    {
      "indent": 3,
      "text": "b. No information in the Contribution is confidential, and the IETF, IETF Trust, ISOC, and its affiliated organizations may freely disclose any information in the Contribution.",
      "zh-CHS": "b. 贡献中的任何信息均不保密，IETF、IETF信托基金、ISOC及其附属组织可自由披露贡献中的任何信息。"
    },
    {
      "indent": 3,
      "text": "c. There are no limits to the Contributor's ability to make the grants, acknowledgments, and agreements herein that are reasonably and personally known to the Contributor.",
      "zh-CHS": "c. 供款人在本协议中做出供款人合理且亲自知晓的授予、确认和协议的能力不受限制。"
    },
    {
      "indent": 3,
      "text": "d. The Contributor has not intentionally included in the Contribution any material that is defamatory or untrue or which is illegal under the laws of the jurisdiction in which the Contributor has his or her principal place of business or residence.",
      "zh-CHS": "d. 出资人未故意在出资中包含任何诽谤性或不真实的材料，或根据出资人主要营业地或居住地所在司法管辖区的法律属于非法的材料。"
    },
    {
      "indent": 3,
      "text": "e. All trademarks, trade names, service marks, and other proprietary names used in the Contribution that are reasonably and personally known to the Contributor are clearly designated as such where reasonable.",
      "zh-CHS": "e. 出资人合理且个人知晓的出资中使用的所有商标、商号、服务商标和其他专有名称在合理情况下均明确指定为此类名称。"
    },
    {
      "indent": 0,
      "text": "5.7. No Duty to Publish",
      "section_title": true,
      "zh-CHS": "5.7. 没有出版的义务"
    },
    {
      "indent": 3,
      "text": "The Contributor, and each named co-Contributor, acknowledges that the IETF has no duty to publish or otherwise use or disseminate any Contribution. The IETF reserves the right to withdraw or cease using any Contribution that does not comply with the requirements of this Section 5.",
      "zh-CHS": "投稿人和各指定共同投稿人承认，IETF没有义务发布或以其他方式使用或传播任何投稿。IETF保留撤回或停止使用任何不符合第5节要求的出资的权利。"
    },
    {
      "indent": 0,
      "text": "5.8. Trademarks",
      "section_title": true,
      "zh-CHS": "5.8. 商标"
    },
    {
      "indent": 3,
      "text": "Contributors who claim trademark rights in terms used in their IETF Contributions are requested to state specifically what conditions apply to implementers of the technology relative to the use of such trademarks. Such statements should be submitted in the same way as is done for other intellectual property claims. (See [RFC3979] Section 6.)",
      "zh-CHS": "要求声称其IETF贡献中使用的术语具有商标权的贡献者具体说明与使用此类商标相关的技术实现者适用的条件。提交此类声明的方式应与提交其他知识产权权利要求的方式相同。（参见[RFC3979]第6节。）"
    },
    {
      "indent": 0,
      "text": "5.9. Copyright in RFCs",
      "section_title": true,
      "zh-CHS": "5.9. RFCs中的版权"
    },
    {
      "indent": 3,
      "text": "Subject to each Contributor's (or its sponsor's) ownership of its underlying Contributions as described in Section 5.6 (which ownership is qualified by the irrevocable licenses granted under Section 5.3), each Contributor hereby acknowledges that the copyright in any RFC in which such Contribution is included, other than an RFC that is an RFC Editor Contribution, shall be owned by the IETF Trust. Such Contributor shall be deemed to assign to the IETF Trust such Contributor's copyright interest in the collective work constituting",
      "zh-CHS": "根据第5.6节所述的每位出资人（或其发起人）对其基础出资的所有权（该所有权由第5.3节授予的不可撤销许可证限定），每位出资人特此承认，包含该出资的任何RFC的版权，除作为RFC编辑贡献的RFC外，应归IETF信托所有。该贡献者应被视为将该贡献者在集体作品中的版权权益转让给IETF信托"
    },
    {
      "indent": 3,
      "text": "such RFC upon the submission of such RFC for publication, and acknowledges that a copyright notice acknowledging the IETF Trust's ownership of the copyright in such RFC will be included in the published RFC.",
      "zh-CHS": "该RFC应在提交该RFC以供发布时生效，并确认已发布的RFC中将包含承认IETF信托对该RFC版权所有权的版权通知。"
    },
    {
      "indent": 0,
      "text": "5.10. Contributors' Retention of Rights",
      "section_title": true,
      "zh-CHS": "5.10. 出资人保留权利"
    },
    {
      "indent": 3,
      "text": "Although Contributors provide specific rights to the IETF, it is not intended that this should deprive them of their right to exploit their Contributions. To underscore this principle, the IETF Trust is",
      "zh-CHS": "尽管贡献者向IETF提供了特定的权利，但这并不意味着剥夺了他们利用贡献的权利。为了强调这一原则，IETF信托基金"
    },
    {
      "indent": 3,
      "text": "directed to issue a license or assurance to Contributors, which confirms that they may each make use of their Contributions as published in an RFC in any way they wish, subject only to the restriction that no Contributor has the right to represent any document as an RFC, or equivalent of an RFC, if it is not a full and complete copy or translation of the published RFC.",
      "zh-CHS": "指示向投稿人颁发许可证或保证书，确认投稿人可按其意愿以任何方式使用其在RFC中发布的投稿，但仅限于任何投稿人无权将任何文件表示为RFC或RFC的同等文件，如果不是已发布RFC的完整副本或译本。"
    },
    {
      "indent": 0,
      "text": "6. Legends, Notices and Other Standardized Text in IETF Documents",
      "section_title": true,
      "zh-CHS": "6. IETF文件中的图例、通知和其他标准文本"
    },
    {
      "indent": 3,
      "text": "The IETF requires that certain standardized text be reproduced verbatim in certain IETF Documents (including copies, derivative works, and translations of IETF Documents). Some of this standardized text may be mandatory (e.g., copyright notices and disclaimers that must be included in all RFCs) and some may be optional (e.g., limitations on the right to make derivative works). The text itself, as well as the rules that explain when and how it must be used, is contained in the Legend Instructions. The Legend Instructions may be updated from time to time, and the version of the standardized text that must be included in IETF Documents is that which was posted in the Legend Instructions on the date of publication.",
      "zh-CHS": "IETF要求在某些IETF文件（包括IETF文件的副本、衍生作品和翻译）中逐字复制某些标准文本。其中一些标准文本可能是强制性的（例如，版权声明和免责声明必须包含在所有RFC中），而一些可能是可选的（例如，对制作衍生作品的权利的限制）。图例说明中包含文字本身以及解释何时以及如何使用文字的规则。图例说明可能会不时更新，IETF文件中必须包含的标准文本版本是在出版之日发布在图例说明中的版本。"
    },
    {
      "indent": 3,
      "text": "The IETF reserves the right to refuse to publish Contributions that do not include the legends and notices required by the Legend Instructions.",
      "zh-CHS": "IETF保留拒绝发布不包含图例说明要求的图例和通知的贡献的权利。"
    },
    {
      "indent": 3,
      "text": "It is important to note that each Contributor grants the IETF Trust rights pursuant to this document and the policies described herein. The legends and notices included in certain written Contributions such as Internet-Drafts do not themselves convey any rights. They are simply included to inform the reader (whether or not part of the IETF) about certain legal rights and limitations associated with such documents.",
      "zh-CHS": "需要注意的是，每位出资人根据本文件和本文所述政策授予IETF信托权利。某些书面稿件（如互联网草稿）中包含的图例和通知本身并不传达任何权利。包括这些文件只是为了向读者（无论是否为IETF的一部分）告知与此类文件相关的某些法律权利和限制。"
    },
    {
      "indent": 3,
      "text": "It is also important to note that additional copyright notices are not permitted in IETF Documents except in the case where such document is the product of a joint development effort between the IETF and another standards development organization or is a republication of the work of another standards development organization. Such exceptions must be approved on an individual basis by the IAB.",
      "zh-CHS": "同样重要的是要注意，IETF文件中不允许附加版权声明，除非该文件是IETF和另一标准开发组织联合开发工作的产物，或者是另一标准开发组织工作的再版。此类例外情况必须由IAB单独批准。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This memo relates to the IETF process, not any particular technology. There are security considerations when adopting any technology, but there are no known issues of security with IETF Contribution rights policies.",
      "zh-CHS": "本备忘录涉及IETF过程，而非任何特定技术。采用任何技术时都会考虑到安全问题，但IETF贡献权策略不存在已知的安全问题。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2028] Hovey, R. and S. Bradner, \"The Organizations Involved in the IETF Standards Process\", BCP 11, RFC 2028, October 1996.",
      "zh-CHS": "[RFC2028]Hovey，R.和S.Bradner，“参与IETF标准过程的组织”，BCP 11，RFC 2028，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3979] Bradner, S., Ed., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3979, March 2005.",
      "zh-CHS": "[RFC3979]Bradner，S.，Ed.，“IETF技术中的知识产权”，BCP 79，RFC 3979，2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4371] Carpenter, B., Ed., and L. Lynch, Ed., \"BCP 101 Update for IPR Trust\", BCP 101, RFC 4371, January 2006.",
      "zh-CHS": "[RFC4371]Carpenter，B.，Ed.，和L.Lynch，Ed.，“知识产权信托的BCP 101更新”，BCP 101，RFC 4371，2006年1月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3978] Bradner, S., Ed., \"IETF Rights in Contributions\", BCP 78, RFC 3978, March 2005.",
      "zh-CHS": "[RFC3978]Bradner，S.，Ed.，“IETF在贡献中的权利”，BCP 78，RFC 3978，2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4748] Bradner, S., Ed., \"RFC 3978 Update to Recognize the IETF Trust\", BCP 78, RFC 4748, October 2006.",
      "zh-CHS": "[RFC4748]Bradner，S.，Ed.，“RFC 3978更新以识别IETF信任”，BCP 78，RFC 4748，2006年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4844] Daigle, L., Ed., and Internet Architecture Board, \"The RFC Series and RFC Editor\", RFC 4844, July 2007.",
      "zh-CHS": "[RFC4844]Daigle，L.，Ed.，和互联网架构委员会，“RFC系列和RFC编辑器”，RFC 48442007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5377] Halpern, J., Ed., \"Advice to the Trustees of the IETF Trust on Rights to be Granted in IETF Documents\", RFC 5377, November 2008.",
      "zh-CHS": "[RFC5377]Halpern，J.，Ed.，“就IETF文件中授予的权利向IETF信托受托人提供建议”，RFC 5377，2008年11月。"
    },
    {
      "indent": 3,
      "text": "[Berne] \"Berne Convention for the Protection of Literary and Artistic Work\", http://www.wipo.int/treaties/en/ip/berne/ trtdocs_wo001.html.",
      "zh-CHS": "[伯尔尼]“伯尔尼保护文学和艺术作品公约”，http://www.wipo.int/treaties/en/ip/berne/ trtdocs_wo001.html。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "zh-CHS": "9. 致谢"
    },
    {
      "indent": 3,
      "text": "The editors would like to acknowledge the help the IETF IPR Working Group provided during the development of the document.",
      "zh-CHS": "编辑们要感谢IETF知识产权工作组在文件编制过程中提供的帮助。"
    },
    {
      "indent": 0,
      "text": "10. Changes since RFC 3978",
      "section_title": true,
      "zh-CHS": "10. 自RFC 3978以来的变化"
    },
    {
      "indent": 3,
      "text": "This document represents a significant reorganization and rewording of RFC 3978, along with a number of substantive changes.",
      "zh-CHS": "本文件对RFC 3978进行了重大重组和改写，并进行了一些实质性更改。"
    },
    {
      "indent": 3,
      "text": "The most basic change is to limit this document to the rights that a Contributor grants to the IETF Trust when making a Contribution. All sublicenses of rights for the use of IETF Documents must be provided by the IETF Trust. (See Section 5.4.)",
      "zh-CHS": "最基本的变化是将本文件限制为出资人在出资时授予IETF信托的权利。IETF信托机构必须提供IETF文件使用权的所有分许可证。（见第5.4节。）"
    },
    {
      "indent": 3,
      "text": "Material added from RFC 4748 that recognized the IETF Trust.",
      "zh-CHS": "从RFC 4748中添加的材料，承认IETF信任。"
    },
    {
      "indent": 3,
      "text": "Most of the material relating to RFC Editor documents has been removed since the RFC Editor maintains their own rules and processes for RFC Editor documents. Renamed these documents to \"non-IETF documents\". Added section 11 from the IAB discussing this topic.",
      "zh-CHS": "由于RFC编辑器为RFC编辑器文档维护自己的规则和流程，因此与RFC编辑器文档相关的大部分材料都已删除。将这些文件重命名为“非IETF文件”。增加了IAB中讨论此主题的第11节。"
    },
    {
      "indent": 3,
      "text": "Changes in the definitions section include defining the terms \"Contribution\", \"Indirect Contributor\", \"Copyright\", \"IETF Trust\", and \"Legend Instructions\", as well as minor tweaks to some of the other definitions.",
      "zh-CHS": "定义部分的更改包括定义术语“贡献”、“间接贡献者”、“版权”、“IETF信任”和“图例说明”，以及对一些其他定义的细微调整。"
    },
    {
      "indent": 3,
      "text": "The responsibility for the text of notices has been given to the IETF Trust and removed from this document. (See Section 6.)",
      "zh-CHS": "已将通知文本的责任交给IETF信托，并从本文件中删除。（见第6节。）"
    },
    {
      "indent": 3,
      "text": "Clarified that Contributors enter into a legally binding contract when they submit a Contribution. (See Section 5.1.)",
      "zh-CHS": "阐明出资人在提交出资时签订具有法律约束力的合同。（见第5.1节。）"
    },
    {
      "indent": 3,
      "text": "The right to produce derivative works provided by the Contributor to the IETF Trust is not limited to being within the IETF Standards Process.",
      "zh-CHS": "向IETF信托基金捐款人提供衍生作品的权利不限于在IETF标准流程内。"
    },
    {
      "indent": 3,
      "text": "Made it clear that this document does not deal with patent licenses. (See Section 5.5.)",
      "zh-CHS": "明确表示本文件不涉及专利许可。（见第5.5节。）"
    },
    {
      "indent": 3,
      "text": "Clarified the ownership of the Copyrights to IETF Documents. (See Section 5.9.)",
      "zh-CHS": "阐明了IETF文件版权的所有权。（见第5.9节。）"
    },
    {
      "indent": 3,
      "text": "Clarified the rights retained by authors of IETF Contributions. (See Section 5.10.)",
      "zh-CHS": "阐明IETF贡献作者保留的权利。（见第5.10节。）"
    },
    {
      "indent": 0,
      "text": "11. Declaration from the IAB",
      "section_title": true,
      "zh-CHS": "11. IAB的声明"
    },
    {
      "indent": 3,
      "text": "The IAB discussed the IPR documents during its most recent call. It unanimously decided that the IAB stream is to be covered by the incoming IPR document. It is our understanding that IAB stream documents' IPR are then automatically covered by the outbound rights that the IETF Trust will establish based on the advice in [RFC5377].",
      "zh-CHS": "IAB在最近的电话会议上讨论了知识产权文件。它一致决定，IAB流将包含在传入的IPR文档中。我们的理解是，IAB流文档的IPR将自动包含在IETF信托将根据[RFC5377]中的建议建立的出站权限中。"
    },
    {
      "indent": 3,
      "text": "We also want to stress that, for any change in the inbound rights for streams other than the IETF and IAB streams, there needs to be a stream-dependent discussion and approval process, as indicated in RFC 4844, \"The RFC Series and RFC Editor\" [RFC4844], section 4.2.3.",
      "zh-CHS": "我们还想强调，对于IETF和IAB流以外的流的入站权限的任何更改，需要有一个依赖于流的讨论和批准流程，如RFC 4844“RFC系列和RFC编辑器”[RFC4844]第4.2.3节所示。"
    },
    {
      "indent": 3,
      "text": "To that extent, section 4 of the document should explicitly mention that the IRTF, the Independent, and any possible future streams are not covered by the document.",
      "zh-CHS": "在这种程度上，文件第4节应明确提及IRTF、独立和任何可能的未来流不在文件范围内。"
    },
    {
      "indent": 3,
      "text": "For the IAB,",
      "zh-CHS": "对于IAB，"
    },
    {
      "indent": 3,
      "text": "Olaf Kolkman April 4, 2008",
      "zh-CHS": "奥拉夫·科尔克曼2008年4月4日"
    },
    {
      "indent": 0,
      "text": "Editors' Addresses",
      "zh-CHS": "编辑地址"
    },
    {
      "indent": 3,
      "text": "Scott Bradner Harvard University 29 Oxford St. Cambridge MA, 02138 USA",
      "zh-CHS": "斯科特·布拉德纳哈佛大学美国马萨诸塞州牛津圣剑桥29号，邮编02138"
    },
    {
      "indent": 3,
      "text": "Phone: +1 617 495 3864\nEMail: sob@harvard.edu",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Jorge L. Contreras WilmerHale 1875 Pennsylvania Avenue NW Washington, DC 20006 USA",
      "zh-CHS": "美国华盛顿特区西北宾夕法尼亚大道1875号豪尔赫·L·孔特雷拉斯·威尔默海尔，邮编：20006"
    },
    {
      "indent": 3,
      "text": "Phone: +1 202 663 6872\nEMail: jorge.contreras@wilmerhale.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}