{
  "title": {
    "text": "RFC 5633: Nominating Committee Process: Earlier Announcement of Open Positions and Solicitation of Volunteers",
    "zh-CHS": "RFC 5633"
  },
  "number": 5633,
  "created_at": "2021-11-08 05:58:49.052681+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    S. Dawkins, Ed.\nRequest for Comments: 5633                                  Huawei (USA)\nBCP: 10                                                      August 2009\nUpdates: 3777\nCategory: Best Current Practice",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 1,
      "text": " Nominating Committee Process: Earlier Announcement of Open Positions and Solicitation of Volunteers",
      "zh-CHS": "提名委员会程序：提前宣布空缺职位和招募志愿者"
    },
    {
      "indent": 0,
      "text": "Abstract This document updates RFC 3777, Section 4, Bullet 13 to allow announcement of open positions and solicitation of volunteers to be issued before a Nominating and Recall Committee Chair has been named by the Internet Society President.",
      "zh-CHS": "摘要本文件更新了RFC 3777第4节第13项，以允许在互联网协会主席任命提名和召回委员会主席之前发布空缺职位公告和招募志愿者。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的最佳现行做法，并要求进行讨论和提出改进建议。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托在本文件出版之日生效的与IETF文件有关的法律规定的约束(http://trustee.ietf.org/license-info). 请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Background ......................................................2\n3. Discussion ......................................................3\n4. Updated Text from RFC 3777 ......................................4\n5. Possible Topics for Later Discussion ............................4\n6. Security Considerations .........................................5\n7. Acknowledgements ................................................5\n8. References ......................................................5\n   8.1. Normative References .......................................5\n   8.2. Informative References .....................................5",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The Internet Engineering Steering Group (IESG), the Internet Architecture Board (IAB), and the at-large IETF representatives to the IETF Administrative Oversight Committee (IAOC) are selected by a \"Nominating and Recall Committee\" (universally abbreviated as \"NomCom\"). [RFC3777] defines how the NomCom is selected and the processes it follows as it selects candidates for these positions.",
      "zh-CHS": "互联网工程指导小组（IESG）、互联网架构委员会（IAB）以及IETF行政监督委员会（IAOC）的IETF代表由“提名和召回委员会”（普遍缩写为“NomCom”）选出。[RFC3777]定义如何选择NomCom，以及为这些职位选择候选人时遵循的流程。"
    },
    {
      "indent": 3,
      "text": "This document describes an issue with [RFC3777] that causes an avoidable delay in the NomCom process and specifies a normative update to resolve the issue.",
      "zh-CHS": "本文件描述了[RFC3777]的一个问题，该问题导致NomCom过程中可避免的延迟，并指定了解决该问题的规范更新。"
    },
    {
      "indent": 0,
      "text": "2. Background",
      "section_title": true,
      "zh-CHS": "2. 出身背景"
    },
    {
      "indent": 3,
      "text": "[RFC3777] is the latest in a series of revisions to the NomCom process. [RFC3777] has been updated once since 2004, but the update ([RFC5078]) did not change normative text (it replaced a sample timeline).",
      "zh-CHS": "[RFC3777]是NomCom流程一系列修订中的最新版本。[RFC3777]自2004年以来已更新过一次，但更新（[RFC5078]）并未改变规范性文本（它取代了一个时间线样本）。"
    },
    {
      "indent": 3,
      "text": "[RFC5078] identifies a serial delay in the process described in [RFC3777], in Section 4 (\"Nominating Committee Selection\"), Bullet 13, which states:",
      "zh-CHS": "[RFC5078]确定了[RFC3777]第4节（“提名委员会选择”）项目符号13中所述过程中的串行延迟，其中说明："
    },
    {
      "indent": 6,
      "text": "The Chair obtains the list of IESG and IAB positions to be reviewed and announces it along with a solicitation for names of volunteers from the IETF community willing to serve on the nominating committee.",
      "zh-CHS": "主席获得要审查的IESG和IAB职位列表，并宣布该列表，同时邀请IETF社区愿意为提名委员会服务的志愿者姓名。"
    },
    {
      "indent": 6,
      "text": "The solicitation must permit the community at least 30 days during which they may choose to volunteer to be selected for the nominating committee.",
      "zh-CHS": "征集必须允许社区至少30天，在此期间他们可以选择自愿被选为提名委员会成员。"
    },
    {
      "indent": 6,
      "text": "The list of open positions is published with the solicitation to facilitate community members choosing between volunteering for an open position and volunteering for the nominating committee.",
      "zh-CHS": "公开职位的名单随邀请函一起公布，以便于社区成员在自愿申请公开职位和自愿参加提名委员会之间进行选择。"
    },
    {
      "indent": 3,
      "text": "The result is that the Incoming NomCom Chair is the only person who can announce the list of open positions and solicitation for names of volunteers, a process that requires 30 days for public solicitation.",
      "zh-CHS": "结果是，即将上任的NomCom主席是唯一能够公布空缺职位名单和征集志愿者姓名的人，这一过程需要30天的公开征集时间。"
    },
    {
      "indent": 3,
      "text": "Since this is the first step in organizing the NomCom, delays in selecting the Incoming NomCom Chair translate directly into delays in issuing the solicitation and organizing the NomCom.",
      "zh-CHS": "由于这是组织NomCom的第一步，选择新的NomCom主席的延迟直接转化为发布招标和组织NomCom的延迟。"
    },
    {
      "indent": 3,
      "text": "This proved problematic in practice in 2008-2009, when Joel Halpern was named NomCom Chair less than 30 days prior to the second IETF meeting of the year. If the 30-day solicitation had already taken",
      "zh-CHS": "这在2008-2009年的实践中证明是有问题的，当时Joel Halpern在本年度第二次IETF会议前不到30天被任命为NomCom主席。如果30天的邀约已经完成"
    },
    {
      "indent": 3,
      "text": "place, the NomCom could have conducted face-to-face interviews at the second IETF meeting, but since the required 30-day solicitation didn't start until Joel was named, Joel was unable to assemble his NomCom before the second IETF meeting, and the NomCom had to carry out these interviews using email and conference calls.",
      "zh-CHS": "在第二次IETF会议上，NomCom本可以进行面对面访谈，但由于在Joel被提名之前，所需的30天邀约才开始，Joel无法在第二次IETF会议之前召集他的NomCom，NomCom必须通过电子邮件和电话会议进行这些访谈。"
    },
    {
      "indent": 3,
      "text": "It is desirable to allow the solicitation and announcement to take place in a timely manner so that when an Incoming NomCom Chair is named, the NomCom Chair can immediately begin executing the NomCom process.",
      "zh-CHS": "希望能够及时进行招标和公告，以便在任命新任NomCom主席时，NomCom主席能够立即开始执行NomCom流程。"
    },
    {
      "indent": 0,
      "text": "3. Discussion",
      "section_title": true,
      "zh-CHS": "3. 讨论"
    },
    {
      "indent": 3,
      "text": "This document proposes that four weeks after the first IETF meeting each year, the Internet Society President will either announce an Incoming NomCom Chair, or will direct the IETF Executive Director to issue the announcement of open positions and the solicitation for names of volunteers on behalf of the Incoming NomCom Chair. This allows the search for the Incoming NomCom Chair and volunteers to proceed in parallel.",
      "zh-CHS": "本文件建议，在每年第一次IETF会议后四周，互联网协会主席将宣布新任NomCom主席，或指示IETF执行董事代表新任NomCom主席发布空缺职位公告和志愿者名单征集。这允许搜索即将到来的NomCom主席和志愿者并行进行。"
    },
    {
      "indent": 3,
      "text": "This process change covers only the announcement of open positions and solicitation for names of volunteers. This process change does not allow the NomCom process to move to completion without an Incoming NomCom Chair; it is only to ensure that the Incoming NomCom Chair can begin executing the NomCom process without an avoidable delay and can use face-to-face time at the second IETF meeting effectively for this purpose.",
      "zh-CHS": "这一过程的变化仅包括公布空缺职位和征求志愿者姓名。该流程变更不允许在没有新任NomCom主席的情况下，NomCom流程进入完成阶段；这只是为了确保即将上任的NomCom主席能够开始执行NomCom过程，而不会出现可避免的延迟，并且能够为此目的在第二次IETF会议上有效地使用面对面的时间。"
    },
    {
      "indent": 3,
      "text": "During discussions in the IETF 74 timeframe, it was suggested that we also allow the Secretariat to perform other clerical tasks that aren't called out specifically in the NomCom process but that clearly do not require NomCom Chair judgment. This document does not provide guidance about specific clerical tasks that would be appropriate for the Secretariat to carry out. Instead, either the Incoming NomCom Chair (if one has been selected) or the Outgoing NomCom Chair (if the search for an Incoming NomCom Chair is still underway) may request the Secretariat to perform these tasks, with appropriate notification to the community.",
      "zh-CHS": "在IETF 74时间范围内的讨论中，有人建议，我们还允许秘书处执行其他文书任务，这些任务在NomCom流程中没有明确要求，但显然不需要NomCom主席的判断。本文件没有就秘书处应执行的具体文书工作提供指导。相反，新任NomCom主席（如果已选定）或即将卸任的NomCom主席（如果仍在寻找新任NomCom主席）可要求秘书处执行这些任务，并向社区发出适当通知。"
    },
    {
      "indent": 0,
      "text": "4. Updated Text from RFC 3777",
      "section_title": true,
      "zh-CHS": "4. RFC 3777的更新文本"
    },
    {
      "indent": 3,
      "text": "[RFC3777], Section 4 (\"Nominating Committee Selection\"), Bullet 13, states:",
      "zh-CHS": "[RFC3777]第4节（“提名委员会甄选”）第13号项目符号规定："
    },
    {
      "indent": 6,
      "text": "The Chair obtains the list of IESG and IAB positions to be reviewed and announces it along with a solicitation for names of volunteers from the IETF community willing to serve on the nominating committee.",
      "zh-CHS": "主席获得要审查的IESG和IAB职位列表，并宣布该列表，同时邀请IETF社区愿意为提名委员会服务的志愿者姓名。"
    },
    {
      "indent": 3,
      "text": "This text is replaced with the following text:",
      "zh-CHS": "此文本替换为以下文本："
    },
    {
      "indent": 6,
      "text": "The Chair (or the IETF Executive Director, if no Chair has been named four weeks after the first IETF meeting of the year) obtains the list of positions to be reviewed and announces it along with a solicitation for names of volunteers from the IETF community willing to serve on the nominating committee.",
      "zh-CHS": "主席（或IETF执行董事，如果在本年度第一次IETF会议四周后没有任命主席）获得要审查的职位列表，并在征求IETF社区愿意为提名委员会服务的志愿者姓名的同时予以公布。"
    },
    {
      "indent": 6,
      "text": "If the IETF Executive Director issues the solicitation for volunteers, the IETF Executive Director must also collect responses to the solicitation and provide the names of volunteers to the Incoming NomCom Chair when the Incoming NomCom Chair is named.",
      "zh-CHS": "如果IETF执行董事发布了志愿者征集，IETF执行董事还必须收集对征集的回复，并在提名即将上任的NomCom主席时，向即将上任的NomCom主席提供志愿者的姓名。"
    },
    {
      "indent": 6,
      "text": "At the Chair's request, the IETF Secretariat may perform other clerical support tasks, as long as the task being performed does not require NomCom Chair judgment, in the NomCom Chair's opinion, and as long as the community is appropriately notified that this request is being made. This request may come from the Incoming NomCom Chair (if one has been selected for this NomCom cycle) or the Outgoing NomCom Chair (if the search for an Incoming NomCom Chair is still underway).",
      "zh-CHS": "根据主席的要求，IETF秘书处可以执行其他文书支持任务，只要NomCom主席认为执行的任务不需要NomCom主席的判断，并且只要适当通知社区该请求正在提出。该请求可能来自即将上任的NomCom主席（如果已为该NomCom周期选择了一位主席）或即将离任的NomCom主席（如果仍在搜索即将上任的NomCom主席）。"
    },
    {
      "indent": 3,
      "text": "Note: This text no longer specifies the list of bodies that NomCom reviews, rather than adding IAOC to the list of bodies in the text, so that this text need not change further when NomCom responsibilities change.",
      "zh-CHS": "注：本文本不再指定NomCom审查的机构列表，而不是将IAOC添加到文本中的机构列表中，因此，当NomCom职责发生变化时，本文本无需进一步更改。"
    },
    {
      "indent": 0,
      "text": "5. Possible Topics for Later Discussion",
      "section_title": true,
      "zh-CHS": "5. 以后讨论的可能主题"
    },
    {
      "indent": 3,
      "text": "This section contains topics that came up during discussion of this document but were ruled out of scope, because the goal for this document was incremental improvement, and these topics were more than incremental changes. They may be discussed further, or not, but we're less likely to forget them completely if we write them down.",
      "zh-CHS": "本节包含在讨论本文档时提出但被排除在范围之外的主题，因为本文档的目标是增量改进，而这些主题不仅仅是增量更改。它们可能会被进一步讨论，也可能不会，但如果我们把它们写下来，我们就不太可能完全忘记它们。"
    },
    {
      "indent": 3,
      "text": "[RFC3777] tightly couples the announcement of open positions and call for volunteers, and this document didn't try to unravel these two separate actions. We had a request during discussion to separate them, so that a NomCom could consider the management structure of the IETF and the position descriptions that the leadership bodies provide, before announcing the positions being reviewed.",
      "zh-CHS": "[RFC3777]将空缺职位的宣布和志愿者的招募紧密结合在一起，本文件并未试图解释这两个单独的行动。我们在讨论过程中提出了将它们分开的要求，以便一个NoMcom可以考虑IETF的管理结构和领导机构提供的职位描述，然后再宣布被审查的职位。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This specification describes issues with the current IETF Nominating Committee process [RFC3777] and proposes an update to avoid a serial delay. No security considerations apply.",
      "zh-CHS": "本规范描述了当前IETF提名委员会程序[RFC3777]的问题，并提出了一个更新建议，以避免串行延迟。没有安全考虑。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The editor thanks the following folks who have provided useful observations and guidance on previous versions of this document: Scott Bradner (who suggested that the IETF Secretariat have this responsibility), Brian Carpenter, Ralph Droms, Jim Galvin, Joel Halpern, Danny McPherson, and Pekka Savola.",
      "zh-CHS": "编辑感谢以下人员，他们对本文件的前几个版本提供了有用的观察和指导：斯科特·布拉德纳（他建议IETF秘书处承担这一责任）、布赖恩·卡彭特、拉尔夫·德罗姆斯、吉姆·加尔文、乔尔·哈尔佩恩、丹尼·麦克弗森和佩卡·萨沃拉。"
    },
    {
      "indent": 3,
      "text": "The editor also thanks the Wednesday evening plenary session participants during IETF 74 who provided useful feedback on previous versions of this document [w74plen].",
      "zh-CHS": "编辑还感谢IETF 74期间周三晚上的全体会议参与者，他们提供了关于本文件先前版本的有用反馈[w74plen]。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3777] Galvin, J., \"IAB and IESG Selection, Confirmation, and Recall Process: Operation of the Nominating and Recall Committees\", BCP 10, RFC 3777, June 2004.",
      "zh-CHS": "[RFC3777]Galvin，J.，“IAB和IESG选择、确认和召回流程：提名和召回委员会的运作”，BCP 10，RFC 3777，2004年6月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC5078] Dawkins, S., \"IAB and IESG Selection, Confirmation, and Recall Process: Revision of the Nominating and Recall Committees Timeline\", RFC 5078, October 2007.",
      "zh-CHS": "[RFC5078]Dawkins，S.，“IAB和IESG选择、确认和召回流程：提名和召回委员会时间表的修订”，RFC 5078，2007年10月。"
    },
    {
      "indent": 3,
      "text": "[w74plen] \"IETF 74 Wednesday Evening Plenary Minutes\", March 2009.",
      "zh-CHS": "[w74plen]“IETF 74周三晚间全体会议记录”，2009年3月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Spencer Dawkins (editor) Huawei Technologies (USA)",
      "zh-CHS": "斯宾塞·道金斯（编辑）华为技术（美国）"
    },
    {
      "indent": 3,
      "text": "Phone: +1 214 755 3870\nEMail: spencer@wonderhamster.org",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}