{
  "title": {
    "text": "RFC 5817: Graceful Shutdown in MPLS and Generalized MPLS Traffic Engineering Networks",
    "zh-CHS": "RFC 5817"
  },
  "number": 5817,
  "created_at": "2021-11-08 23:17:01.684677+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                            Z. Ali\nRequest for Comments: 5817                                   JP. Vasseur\nCategory: Informational                                        A. Zamfir\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                               J. Newton\n                                                      Cable and Wireless\n                                                              April 2010",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Graceful Shutdown in MPLS and Generalized MPLS Traffic Engineering Networks",
      "zh-CHS": "MPLS和广义MPLS流量工程网络中的优雅关机"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "MPLS-TE Graceful Shutdown is a method for explicitly notifying the nodes in a Traffic Engineering (TE) enabled network that the TE capability on a link or on an entire Label Switching Router (LSR) is going to be disabled. MPLS-TE graceful shutdown mechanisms are tailored toward addressing planned outage in the network.",
      "zh-CHS": "MPLS-TE优雅关机是一种明确通知启用流量工程（TE）的网络中的节点链路或整个标签交换路由器（LSR）上的TE功能将被禁用的方法。MPLS-TE优雅关机机制是为解决网络中的计划中断而定制的。"
    },
    {
      "indent": 3,
      "text": "This document provides requirements and protocol mechanisms to reduce or eliminate traffic disruption in the event of a planned shutdown of a network resource. These operations are equally applicable to both MPLS-TE and its Generalized MPLS (GMPLS) extensions.",
      "zh-CHS": "本文档提供了在计划关闭网络资源时减少或消除通信中断的要求和协议机制。这些操作同样适用于MPLS-TE及其广义MPLS（GMPLS）扩展。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5817.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc5817."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2010 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "zh-CHS": "本文件可能包含2008年11月10日之前发布或公开的IETF文件或IETF贡献中的材料。控制某些材料版权的人员可能未授予IETF信托允许在IETF标准流程之外修改此类材料的权利。在未从控制此类材料版权的人员处获得充分许可的情况下，不得在IETF标准流程之外修改本文件，也不得在IETF标准流程之外创建其衍生作品，除了将其格式化以RFC形式发布或将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................3\n3. Requirements for Graceful Shutdown ..............................4\n4. Mechanisms for Graceful Shutdown ................................5\n   4.1. OSPF / IS-IS Mechanisms for Graceful Shutdown ..............5\n   4.2. RSVP-TE Signaling Mechanisms for Graceful Shutdown .........6\n5. Manageability Considerations ....................................8\n6. Security Considerations .........................................8\n7. Acknowledgments .................................................8\n8. References ......................................................9\n   8.1. Normative References .......................................9\n   8.2. Informative References .....................................9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "When outages in a network are planned (e.g., for maintenance purposes), some mechanisms can be used to avoid traffic disruption. This is in contrast with unplanned network element failure, where traffic disruption can be minimized thanks to recovery mechanisms, but may not be avoided. Therefore, a Service Provider may desire to gracefully (temporarily or indefinitely) remove a TE link, a group of TE links, or an entire node for administrative reasons such as link maintenance, software/hardware upgrade at a node, or significant TE configuration changes. In all these cases, the goal is to minimize the impact on the traffic carried over TE LSPs in the network by triggering notifications so as to gracefully reroute such flows before the administrative procedures are started.",
      "zh-CHS": "当计划网络中断时（例如，出于维护目的），可以使用一些机制来避免通信中断。这与计划外网元故障形成对比，在计划外网元故障中，由于恢复机制，流量中断可以最小化，但可能无法避免。因此，服务提供商可能希望出于管理原因（例如链路维护、节点处的软件/硬件升级或重大TE配置更改）优雅地（临时或无限期地）移除TE链路、TE链路组或整个节点。在所有这些情况下，目标是通过触发通知来最小化对网络中通过TE LSP传输的流量的影响，以便在管理程序开始之前优雅地重新路由此类流量。"
    },
    {
      "indent": 3,
      "text": "These operations are equally applicable to both MPLS-TE [RFC3209] and its Generalized MPLS (GMPLS) extensions [RFC3471] [RFC3473].",
      "zh-CHS": "这些操作同样适用于MPLS-TE[RFC3209]及其通用MPLS（GMPLS）扩展[RFC3471][RFC3473]。"
    },
    {
      "indent": 3,
      "text": "This document describes the mechanisms that can be used to gracefully shut down MPLS-TE / GMPLS-TE on a resource such as a TE link, a component link within a bundled TE link, a label resource, or an entire TE node.",
      "zh-CHS": "本文档描述了可用于正常关闭资源（如TE链路、捆绑TE链路中的组件链路、标签资源或整个TE节点）上的MPLS-TE/GMPLS-TE的机制。"
    },
    {
      "indent": 3,
      "text": "Graceful shutdown of a resource may require several steps. These steps can be broadly divided into two sets: disabling the resource in the control plane and disabling the resource in the data plane. The node initiating the graceful shutdown condition introduces a delay between the two sets to allow the control plane to gracefully divert the traffic away from the resource being gracefully shut down. The trigger for the graceful shutdown event is a local matter at the node initiating the graceful shutdown. Typically, graceful shutdown is triggered for administrative reasons, such as link maintenance or software/hardware upgrade.",
      "zh-CHS": "正常关闭资源可能需要几个步骤。这些步骤大致可分为两组：禁用控制平面中的资源和禁用数据平面中的资源。启动正常关闭条件的节点在两组之间引入延迟，以允许控制平面正常地将流量从正常关闭的资源中转移出去。正常关机事件的触发器是启动正常关机的节点上的局部事件。通常，出于管理原因（如链路维护或软件/硬件升级）会触发正常关机。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "LSR: Label Switching Router. The terms node and LSR are used interchangeably in this document.",
      "zh-CHS": "标签交换路由器。术语节点和LSR在本文档中互换使用。"
    },
    {
      "indent": 3,
      "text": "GMPLS: The term GMPLS is used in this document to refer to packet MPLS-TE, as well as GMPLS extensions to MPLS-TE.",
      "zh-CHS": "GMPLS：本文件中使用的术语GMPLS指的是数据包MPLS-TE，以及MPLS-TE的GMPLS扩展。"
    },
    {
      "indent": 3,
      "text": "TE Link: The term TE link refers to a single link or a bundle of physical links or FA-LSPs (see below) on which traffic engineering is enabled.",
      "zh-CHS": "TE链路：术语TE链路是指启用流量工程的单个链路或物理链路束或FA LSP（见下文）。"
    },
    {
      "indent": 3,
      "text": "TE LSP: A Traffic Engineered Label Switched Path.",
      "zh-CHS": "TE LSP：一种流量工程标签交换路径。"
    },
    {
      "indent": 3,
      "text": "S-LSP: A segment of a TE LSP.",
      "zh-CHS": "S-LSP：TE LSP的一段。"
    },
    {
      "indent": 3,
      "text": "FA-LSP (Forwarding Adjacency LSP): An LSP that is announced as a TE link into the same instance of the GMPLS control plane as the one that was used to create the LSP [RFC4206].",
      "zh-CHS": "FA-LSP（转发邻接LSP）：作为TE链路被宣布为GMPLS控制平面的同一实例的LSP，该实例与用于创建LSP的实例相同[RFC4206]。"
    },
    {
      "indent": 3,
      "text": "ISIS-LSP: Link State Packet that is generated by IS-IS routers and that contains routing information.",
      "zh-CHS": "ISIS-LSP：由is-is路由器生成的包含路由信息的链路状态包。"
    },
    {
      "indent": 3,
      "text": "LSA: Link State Advertisement that is generated by OSPF routers and that contains routing information.",
      "zh-CHS": "LSA：由OSPF路由器生成的包含路由信息的链路状态播发。"
    },
    {
      "indent": 3,
      "text": "TE LSA / TE-IS-IS-LSP: The traffic engineering extensions to OSPF / IS-IS.",
      "zh-CHS": "TE LSA/TE-IS-IS-LSP：OSPF/IS-IS的流量工程扩展。"
    },
    {
      "indent": 3,
      "text": "Head-end node: Ingress LSR that initiated signaling for the Path.",
      "zh-CHS": "前端节点：为路径启动信令的入口LSR。"
    },
    {
      "indent": 3,
      "text": "Border node: Ingress LSR of a TE LSP segment (S-LSP).",
      "zh-CHS": "边界节点：TE LSP段（S-LSP）的入口LSR。"
    },
    {
      "indent": 3,
      "text": "PCE (Path Computation Element): An entity that computes the routes on behalf of its clients (PCC) [RFC4655].",
      "zh-CHS": "PCE（路径计算元素）：代表其客户端（PCC）计算路由的实体[RFC4655]。"
    },
    {
      "indent": 3,
      "text": "Last-resort resource: If a path to a destination from a given head-end node cannot be found upon removal of a resource (e.g., TE link, TE node), the resource is called \"last resort\" to reach that destination from the given head-end node.",
      "zh-CHS": "最后手段资源：如果在移除资源（例如TE链路、TE节点）后无法找到从给定前端节点到目的地的路径，则该资源称为从给定前端节点到达该目的地的“最后手段”。"
    },
    {
      "indent": 0,
      "text": "3. Requirements for Graceful Shutdown",
      "section_title": true,
      "zh-CHS": "3. 正常关机的要求"
    },
    {
      "indent": 3,
      "text": "This section lists the requirements for graceful shutdown in the context of GMPLS.",
      "zh-CHS": "本节列出了GMPLS环境下的正常停机要求。"
    },
    {
      "indent": 3,
      "text": "- Graceful shutdown is required to address graceful removal of one TE link, one component link within a bundled TE link, a set of TE links, a set of component links, label resources, or an entire node.",
      "zh-CHS": "- 优雅关闭需要解决一个TE链接、捆绑TE链接中的一个组件链接、一组TE链接、一组组件链接、标签资源或整个节点的优雅删除问题。"
    },
    {
      "indent": 3,
      "text": "- Once an operator has initiated graceful shutdown of a network resource, no new TE LSPs may be set up that use the resource. Any signaling message for a new TE LSP that explicitly specifies the resource, or that would require the use of the resource due to local constraints, is required to be rejected as if the resource were unavailable.",
      "zh-CHS": "- 一旦运营商启动了网络资源的正常关闭，就不能设置使用该资源的新TE LSP。对于显式指定资源的新TE LSP的任何信令消息，或者由于本地约束而需要使用资源的任何信令消息，都需要被拒绝，就像资源不可用一样。"
    },
    {
      "indent": 3,
      "text": "- It is desirable for new TE LSP set-up attempts that would be rejected because of graceful shutdown of a resource (as described in the previous requirement) to avoid any attempt to use the resource by selecting an alternate route or other resources.",
      "zh-CHS": "- 希望新的TE LSP设置尝试因资源正常关闭（如前一要求所述）而被拒绝，以避免通过选择备用路由或其他资源来使用资源的任何尝试。"
    },
    {
      "indent": 3,
      "text": "- If the resource being shut down is a last-resort resource, based on a local decision, the node initiating the graceful shutdown procedure can cancel the shutdown operation.",
      "zh-CHS": "- 如果要关闭的资源是最后的资源，则基于本地决策，启动正常关闭过程的节点可以取消关闭操作。"
    },
    {
      "indent": 3,
      "text": "- It is required to give the ingress node the opportunity to take actions in order to reduce or eliminate traffic disruption on the TE LSPs that are using the network resources that are about to be shut down.",
      "zh-CHS": "- 需要为入口节点提供采取措施的机会，以减少或消除正在使用即将关闭的网络资源的TE LSP上的流量中断。"
    },
    {
      "indent": 3,
      "text": "- Graceful shutdown mechanisms are equally applicable to intra-domain TE LSPs and those spanning multiple domains, as defined in [RFC4726]. Examples of such domains include IGP areas and Autonomous Systems.",
      "zh-CHS": "- 优雅关闭机制同样适用于域内TE LSP和跨多个域的TE LSP，如[RFC4726]中所定义。此类域的示例包括IGP区域和自治系统。"
    },
    {
      "indent": 3,
      "text": "- Graceful shutdown is equally applicable to packet and non-packet networks.",
      "zh-CHS": "- 优雅关机同样适用于分组和非分组网络。"
    },
    {
      "indent": 3,
      "text": "- In order to make rerouting effective, it is required that when a node initiates the graceful shutdown of a resource, it notifies all other network nodes about the TE resource under graceful shutdown.",
      "zh-CHS": "- 为了使重路由有效，要求当节点启动资源的正常关闭时，它将正常关闭下的TE资源通知所有其他网络节点。"
    },
    {
      "indent": 3,
      "text": "- Depending on switching technology, it may be possible to shut down a label resource, e.g., shutting down a lambda in a Lambda Switch Capable (LSC) node.",
      "zh-CHS": "- 根据交换技术，可以关闭标签资源，例如，关闭支持lambda交换（LSC）节点中的lambda。"
    },
    {
      "indent": 0,
      "text": "4. Mechanisms for Graceful Shutdown",
      "section_title": true,
      "zh-CHS": "4. 优雅关机机制"
    },
    {
      "indent": 3,
      "text": "An IGP-only solution based on [RFC3630], [RFC5305], [RFC4203] and [RFC5307] is not applicable when dealing with inter-area and inter-AS traffic engineering, as IGP flooding is restricted to IGP areas/levels. An RSVP-based solution is proposed in this document to handle TE LSPs spanning multiple domains. In addition, in order to discourage nodes from establishing new TE LSPs through the resources being shut down, existing IGP mechanisms are used for the shutdown notification.",
      "zh-CHS": "当处理区域间和AS间流量工程时，基于[RFC3630]、[RFC5305]、[RFC4203]和[RFC5307]的仅IGP解决方案不适用，因为IGP洪泛仅限于IGP区域/级别。本文提出了一种基于RSVP的解决方案，用于处理跨多个域的TE LSP。此外，为了阻止节点通过被关闭的资源建立新的TE lsp，现有的IGP机制用于关闭通知。"
    },
    {
      "indent": 3,
      "text": "A node where a link or the whole node is being shut down first triggers the IGP updates as described in Section 4.1 and then, with some delay to allow network convergence, uses the signaling mechanism described in Section 4.2.",
      "zh-CHS": "链路或整个节点被关闭的节点首先触发第4.1节中所述的IGP更新，然后在允许网络融合的延迟时间内，使用第4.2节中所述的信令机制。"
    },
    {
      "indent": 0,
      "text": "4.1. OSPF / IS-IS Mechanisms for Graceful Shutdown",
      "section_title": true,
      "zh-CHS": "4.1. OSPF/IS-IS优雅关机机制"
    },
    {
      "indent": 3,
      "text": "This section describes the use of existing OSPF and IS-IS mechanisms for the graceful shutdown in GMPLS networks.",
      "zh-CHS": "本节介绍如何使用现有OSPF和IS-IS机制在GMPLS网络中实现正常关机。"
    },
    {
      "indent": 3,
      "text": "The OSPF and IS-IS procedures for graceful shutdown of TE links are similar to the graceful restart of OSPF and IS-IS as described in [RFC4203] and [RFC5307], respectively. Specifically, the node where graceful shutdown of a link is desired originates the TE LSA or IS-IS-LSP containing a Link TLV for the link under graceful shutdown with the Traffic Engineering metric set to 0xffffffff, 0 as unreserved bandwidth. If the TE link has LSC or FSC as its Switching Capability, then it also has 0 in the \"Max LSP Bandwidth\" field of the Interface Switching Capability Descriptor (ISCD) sub-TLV. A node may also specify a value that is greater than the available bandwidth in the \"Minimum LSP bandwidth\" field of the same ISCD sub-TLV. This would discourage new TE LSP establishment through the link under graceful shutdown.",
      "zh-CHS": "TE链路正常关闭的OSPF和IS-IS程序类似于[RFC4203]和[RFC5307]中分别描述的OSPF和IS-IS的正常重启。具体地说，期望链路正常关闭的节点发起TE-LSA或is-is-LSP，其中包含正常关闭下链路的链路TLV，流量工程度量设置为0xffffff，0作为未保留带宽。如果TE链路具有LSC或FSC作为其交换能力，则在接口交换能力描述符（ISCD）子TLV的“最大LSP带宽”字段中也具有0。节点还可以在同一ISCD子TLV的“最小LSP带宽”字段中指定大于可用带宽的值。这将阻止在正常关闭情况下通过链路建立新的TE LSP。"
    },
    {
      "indent": 3,
      "text": "If the graceful shutdown procedure is performed for a component link within a TE link bundle and it is not the last component link available within the TE link, the link attributes associated with the TE link are recomputed. Similarly, if the graceful shutdown procedure is performed on a label resource within a TE link, the link attributes associated with the TE link are recomputed. If the removal of the component link or label resource results in a significant bandwidth change event, a new LSA is originated with the new traffic parameters. If the last component link is being shut down, the routing procedure related to TE link removal is used.",
      "zh-CHS": "如果对TE链接束中的组件链接执行了正常关闭过程，并且该组件链接不是TE链接中可用的最后一个组件链接，则将重新计算与TE链接关联的链接属性。类似地，如果对TE链接内的标签资源执行正常关闭过程，则会重新计算与TE链接关联的链接属性。如果删除组件链接或标签资源导致重大带宽更改事件，则使用新流量参数生成新的LSA。如果关闭最后一个组件链路，则使用与TE链路移除相关的路由过程。"
    },
    {
      "indent": 3,
      "text": "Neighbors of the node where graceful shutdown procedure is in progress continue to advertise the actual unreserved bandwidth of the TE links from the neighbors to that node, without any routing adjacency change.",
      "zh-CHS": "正在进行优雅关闭过程的节点的邻居继续公布从邻居到该节点的TE链路的实际未保留带宽，而不改变任何路由邻接。"
    },
    {
      "indent": 3,
      "text": "When graceful shutdown at node level is desired, the node in question follows the procedure specified in the previous section for all TE links.",
      "zh-CHS": "当需要在节点级别正常关闭时，所讨论的节点遵循上一节中为所有TE链路指定的过程。"
    },
    {
      "indent": 0,
      "text": "4.2 RSVP-TE Signaling Mechanisms for Graceful Shutdown",
      "section_title": true,
      "zh-CHS": "4.2 用于正常关机的RSVP-TE信号机制"
    },
    {
      "indent": 3,
      "text": "As discussed in Section 3, one of the requirements for the signaling mechanism for graceful shutdown is to carry information about the resource under graceful shutdown. For this purpose, the graceful shutdown procedure uses TE LSP rerouting mechanism as defined in [RFC5710].",
      "zh-CHS": "如第3节所述，正常关机信号机制的一个要求是在正常关机情况下携带有关资源的信息。为此，正常关机程序使用[RFC5710]中定义的TE LSP重路由机制。"
    },
    {
      "indent": 3,
      "text": "Specifically, the node where graceful shutdown of an unbundled TE link or an entire bundled TE link is desired triggers a PathErr message with the error code \"Notify\" and error value \"Local link maintenance required\", for all affected TE LSPs. Similarly, the node that is being gracefully shut down triggers a PathErr message with the error code \"Notify\" and error value \"Local node maintenance",
      "zh-CHS": "具体而言，需要正常关闭未绑定的TE链路或整个绑定的TE链路的节点会为所有受影响的TE LSP触发一条PathErr消息，其中包含错误代码“Notify”和错误值“Local link maintenance required”。类似地，正常关闭的节点会触发一条PathErr消息，错误代码为“Notify”，错误值为“Local node maintenance”"
    },
    {
      "indent": 3,
      "text": "required\", for all TE LSPs. For graceful shutdown of a node, an unbundled TE link, or an entire bundled TE link, the PathErr message may contain either an [RFC2205] format ERROR_SPEC object or an IF_ID [RFC3473] format ERROR_SPEC object. In either case, it is the address and TLVs carried by the ERROR_SPEC object and not the error value that indicate the resource that is to be gracefully shut down.",
      "zh-CHS": "对于所有TE LSP，必需”。要正常关闭节点、未绑定的TE链接或整个绑定的TE链接，PathErr消息可能包含[RFC2205]格式错误\\u SPEC对象或IF\\u ID[RFC3473]格式化ERROR_SPEC对象。在任何一种情况下，都是ERROR_SPEC对象携带的地址和TLV，而不是ERROR值指示要正常关闭的资源。"
    },
    {
      "indent": 3,
      "text": "MPLS-TE link bundling [RFC4201] requires that an TE LSP is pinned down to a component link. Consequently, graceful shutdown of a component link in a bundled TE link differs from graceful shutdown of unbundled TE link or entire bundled TE link. Specifically, in the former case, when only a subset of component links and not the entire bundled TE link is being shut down, the remaining component links of the bundled TE link may still be able to admit new TE LSPs. The node where graceful shutdown of a component link is desired triggers a PathErr message with the error code \"Notify\" and error value of \"Local link maintenance required\". The rest of the ERROR_SPEC object is constructed using Component Reroute Request procedure defined in [RFC5710].",
      "zh-CHS": "MPLS-TE链路绑定[RFC4201]要求将TE LSP固定到组件链路。因此，捆绑TE链路中组件链路的正常关闭不同于未捆绑TE链路或整个捆绑TE链路的正常关闭。具体地，在前一种情况下，当仅关闭组件链路的子集而不是关闭整个捆绑TE链路时，捆绑TE链路的其余组件链路可能仍然能够接纳新的TE lsp。需要正常关闭组件链接的节点会触发PathErr消息，错误代码为“Notify”，错误值为“Local link maintenance required”。ERROR_SPEC对象的其余部分使用[RFC5710]中定义的组件重路由请求过程构造。"
    },
    {
      "indent": 3,
      "text": "If graceful shutdown of a label resource is desired, the node initiating this action triggers a PathErr message with the error codes and error values of \"Notify/Local link maintenance required\". The rest of the ERROR_SPEC object is constructed using the Label Reroute Request procedure defined in [RFC5710].",
      "zh-CHS": "如果需要正常关闭标签资源，发起此操作的节点将触发一条PathErr消息，其中包含错误代码和错误值“Notify/Local link maintenance required”。ERROR_SPEC对象的其余部分使用[RFC5710]中定义的标签重路由请求过程构造。"
    },
    {
      "indent": 3,
      "text": "When a head-end node, a transit node, or a border node receives a PathErr message with the error code \"Notify\" and error value \"Local link maintenance required\" or \"Local node maintenance required\", it follows the procedures defined in [RFC5710] to reroute the traffic around the resource being gracefully shut down. When performing path computation for the new TE LSP, the head-end node or border node avoids using the TE resources identified by the ERROR_SPEC object. If the PCE is used for path computation, the head-end (or border) node acting as PCC specifies in its requests to the PCE that path computation should avoid the resource being gracefully shut down. The amount of time the head-end node or border node avoids using the TE resources identified by the IP address contained in the PathErr is based on a local decision at that node.",
      "zh-CHS": "当前端节点、传输节点或边界节点接收到错误代码为“Notify”且错误值为“Local link maintenance required”或“Local node maintenance required”的PathErr消息时，它将遵循[RFC5710]中定义的过程，在正常关闭的资源周围重新路由流量。在为新TE LSP执行路径计算时，前端节点或边界节点避免使用由ERROR_SPEC对象标识的TE资源。如果PCE用于路径计算，则充当PCC的前端（或边界）节点在其对PCE的请求中指定路径计算应避免资源正常关闭。前端节点或边界节点避免使用PathErr中包含的IP地址标识的TE资源的时间量基于该节点的本地决定。"
    },
    {
      "indent": 3,
      "text": "If the node initiating the graceful shutdown procedure receives a path setup request for a new tunnel-using resource being gracefully shut down, it sends a PathErr message with \"Notify\" error code in the ERROR SPEC object and an error value consistent with the type of resource being gracefully shut down. However, based on a local decision, if an existing tunnel continues to use the resource being gracefully shut down, the node initiating the graceful shutdown procedure may allow that resource being gracefully shut down to be",
      "zh-CHS": "如果启动正常关闭过程的节点接收到使用正常关闭的资源的新隧道的路径设置请求，它将发送一条PathErr消息，其中错误规范对象中包含“Notify”错误代码和与正常关闭的资源类型一致的错误值。但是，根据本地决定，如果现有隧道继续使用正常关闭的资源，则启动正常关闭过程的节点可以允许正常关闭该资源"
    },
    {
      "indent": 3,
      "text": "used as a \"last resort\". The node initiating the graceful shutdown procedure can distinguish between new and existing tunnels by inspecting the SENDER TEMPLATE and SESSION objects.",
      "zh-CHS": "用作“最后手段”。启动正常关闭过程的节点可以通过检查发送方模板和会话对象来区分新隧道和现有隧道。"
    },
    {
      "indent": 3,
      "text": "If the resource being shut down is a last-resort resource, it can be used; i.e., based on a local decision, the node initiating the graceful shutdown procedure can cancel the shutdown operation. Similarly, based on a local decision, the node initiating the graceful shutdown procedure can delay the actual removal of resource for forwarding. This is to give time to the network to move traffic from the resource being shut down. For this purpose, the node initiating graceful shutdown procedure follows the Reroute Request Timeout procedure defined in [RFC5710].",
      "zh-CHS": "如果被关闭的资源是最后手段，则可以使用它；i、 例如，根据本地决定，启动正常关机过程的节点可以取消关机操作。类似地，基于本地决定，发起优雅关闭过程的节点可以延迟用于转发的资源的实际移除。这是为了让网络有时间从被关闭的资源转移流量。为此，启动正常关机过程的节点遵循[RFC5710]中定义的重路由请求超时过程。"
    },
    {
      "indent": 0,
      "text": "5. Manageability Considerations",
      "section_title": true,
      "zh-CHS": "5. 可管理性考虑"
    },
    {
      "indent": 3,
      "text": "When a TE link is being shut down, a linkDown trap as defined in [RFC2863] should be generated for the TE link. Similarly, if a bundled TE link is being shut down, a linkDown trap as defined in [RFC2863] should be generated for the bundled TE link, as well as for each of its component links. If a TE node is being shut down, a linkDown trap as defined in [RFC2863] should be generated for all TE links at the node.",
      "zh-CHS": "关闭TE链路时，应为TE链路生成[RFC2863]中定义的链路关闭陷阱。类似地，如果捆绑TE链路正在关闭，则应为捆绑TE链路及其每个组件链路生成[RFC2863]中定义的链路关闭陷阱。如果关闭TE节点，则应为该节点上的所有TE链路生成[RFC2863]中定义的链路关闭陷阱。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security considerations as it describes usage of existing formats and mechanisms. This document relies on existing procedures for advertisement of TE LSA / IS-IS-LSPs containing Link TLVs. Tampering with TE LSAs / IS-IS-LSPs may have an effect on traffic engineering computations, and it is suggested that any mechanisms used for securing the transmission of normal LSAs / IS-IS-LSPs be applied equally to all Opaque LSAs / IS-IS-LSPs that this document uses. Existing security considerations specified in [RFC3630], [RFC5305], [RFC4203], [RFC5307], and [MPLS-GMPLS-SEC] remain relevant and suffice. Furthermore, the Security Considerations section in [RFC5710] and section 9 of [RFC4736] should be used for understanding the security considerations related to the formats and mechanisms used in this document.",
      "zh-CHS": "本文档没有介绍新的安全注意事项，因为它描述了现有格式和机制的用法。本文件依赖于包含链接TLV的TE LSA/IS LSP广告的现有程序。篡改TE LSA/IS LSP可能会对流量工程计算产生影响，建议将用于确保正常LSA/IS LSP传输的任何机制平等地应用于本文件使用的所有不透明LSA/IS LSP。[RFC3630]、[RFC5305]、[RFC4203]、[RFC5307]和[MPLS-GMPLS-SEC]中规定的现有安全注意事项仍然相关且足够。此外，[RFC5710]中的安全注意事项部分和[RFC4736]中的第9部分应用于理解与本文件中使用的格式和机制相关的安全注意事项。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Adrian Farrel for his detailed comments and suggestions. The authors would also like to acknowledge useful comments from David Ward, Sami Boutros, and Dimitri Papadimitriou.",
      "zh-CHS": "作者要感谢Adrian Farrel的详细评论和建议。作者还想感谢David Ward、Sami Boutros和Dimitri Papadimitriou的有用评论。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Ed., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "zh-CHS": "[RFC2205]Braden，R.，Ed.，Zhang，L.，Berson，S.，Herzog，S.，和S.Jamin，“资源预留协议（RSVP）——版本1功能规范”，RFC 22052997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5710] Berger, L., Papadimitriou, D., and JP. Vasseur, \"PathErr Message Triggered MPLS and GMPLS LSP Reroutes\", RFC 5710, January 2010.",
      "zh-CHS": "[RFC5710]伯杰，L.，帕帕迪米特里奥，D.，和JP。Vasseur，“PathErr消息触发MPLS和GMPLS LSP重路由”，RFC 5710，2010年1月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "zh-CHS": "[RFC3209]Awduche，D.，Berger，L.，Gan，D.，Li，T.，Srinivasan，V.，和G.Swallow，“RSVP-TE：LSP隧道RSVP的扩展”，RFC 3209，2001年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4736] Vasseur, JP., Ed., Ikejiri, Y., and R. Zhang, \"Reoptimization of Multiprotocol Label Switching (MPLS) Traffic Engineering (TE) Loosely Routed Label Switched Path (LSP)\", RFC 4736, November 2006.",
      "zh-CHS": "[RFC4736]Vasseur，JP.，Ed.，Ikejiri，Y.，和R.Zhang，“多协议标签交换（MPLS）流量工程（TE）松路由标签交换路径（LSP）的再优化”，RFC 47362006年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3630] Katz, D., Kompella, K., and D. Yeung, \"Traffic Engineering (TE) Extensions to OSPF Version 2\", RFC 3630, September 2003.",
      "zh-CHS": "[RFC3630]Katz，D.，Kompella，K.，和D.Yeung，“OSPF版本2的交通工程（TE）扩展”，RFC 3630，2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5305] Li, T. and H. Smit, \"IS-IS Extensions for Traffic Engineering\", RFC 5305, October 2008.",
      "zh-CHS": "[RFC5305]Li，T.和H.Smit，“交通工程的IS-IS扩展”，RFC 5305，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4203] Kompella, K., Ed., and Y. Rekhter, Ed., \"OSPF Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4203, October 2005.",
      "zh-CHS": "[RFC4203]Kompella，K.，Ed.，和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的OSPF扩展”，RFC 4203，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5307] Kompella, K., Ed., and Y. Rekhter, Ed., \"IS-IS Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 5307, October 2008.",
      "zh-CHS": "[RFC5307]Kompella，K.，Ed.，和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的IS-IS扩展”，RFC 5307，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, January 2003.",
      "zh-CHS": "[RFC3471]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令功能描述”，RFC 3471，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003.",
      "zh-CHS": "[RFC3473]Berger，L.，Ed.“通用多协议标签交换（GMPLS）信令资源预留协议流量工程（RSVP-TE）扩展”，RFC 3473，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4726] Farrel, A., Vasseur, J.-P., and A. Ayyangar, \"A Framework for Inter-Domain Multiprotocol Label Switching Traffic Engineering\", RFC 4726, November 2006.",
      "zh-CHS": "[RFC4726]Farrel，A.，Vasseur，J.-P.，和A.Ayyangar，“域间多协议标签交换流量工程框架”，RFC 4726，2006年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4201] Kompella, K., Rekhter, Y., and L. Berger, \"Link Bundling in MPLS Traffic Engineering (TE)\", RFC 4201, October 2005.",
      "zh-CHS": "[RFC4201]Kompella，K.，Rekhter，Y.，和L.Berger，“MPLS流量工程（TE）中的链路捆绑”，RFC 42012005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4206] Kompella, K. and Y. Rekhter, \"Label Switched Paths (LSP) Hierarchy with Generalized Multi-Protocol Label Switching (GMPLS) Traffic Engineering (TE)\", RFC 4206, October 2005.",
      "zh-CHS": "[RFC4206]Kompella，K.和Y.Rekhter，“具有通用多协议标签交换（GMPLS）流量工程（TE）的标签交换路径（LSP）层次结构”，RFC 4206，2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4655] Farrel, A., Vasseur, J.-P., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, August 2006.",
      "zh-CHS": "[RFC4655]Farrel，A.，Vasseur，J.-P.，和J.Ash，“基于路径计算元素（PCE）的体系结构”，RFC 46552006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "zh-CHS": "[RFC2863]McCloghrie，K.和F.Kastenholz，“接口组MIB”，RFC 28632000年6月。"
    },
    {
      "indent": 3,
      "text": "[MPLS-GMPLS-SEC] Luyuan F., Ed., \"Security Framework for PLS and GMPLS Networks\", Work in Progress, March 2010.",
      "zh-CHS": "[MPLS-GMPLS-SEC]陆源F.，编辑，“PLS和GMPLS网络的安全框架”，正在进行的工作，2010年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Zafar Ali Cisco systems, Inc., 2000 Innovation Drive Kanata, Ontario, K2K 3E8 Canada EMail: zali@cisco.com",
      "zh-CHS": "Zafar Ali Cisco systems，Inc.，安大略省卡纳塔市创新大道2000号，K2K 3E8加拿大电子邮件：zali@cisco.com"
    },
    {
      "indent": 3,
      "text": "Jean Philippe Vasseur Cisco Systems, Inc. 300 Beaver Brook Road Boxborough, MA 01719 USA EMail: jpv@cisco.com",
      "zh-CHS": "Jean-Philippe Vasseur Cisco Systems，Inc.地址：美国马萨诸塞州Boxborough市比弗布鲁克路300号电子邮件：01719jpv@cisco.com"
    },
    {
      "indent": 3,
      "text": "Anca Zamfir Cisco Systems, Inc. 2000 Innovation Drive Kanata, Ontario, K2K 3E8 Canada EMail: ancaz@cisco.com",
      "zh-CHS": "安卡·赞菲尔思科系统公司，安大略省卡纳塔市创新大道2000号，K2K 3E8加拿大电子邮件：ancaz@cisco.com"
    },
    {
      "indent": 3,
      "text": "Jonathan Newton Cable and Wireless EMail: jonathan.newton@cw.com",
      "zh-CHS": "乔纳森·牛顿有线和无线电子邮件：乔纳森。newton@cw.com"
    }
  ]
}