{
  "title": {
    "text": "RFC 5788: IMAP4 Keyword Registry",
    "zh-CHS": "RFC 5788"
  },
  "number": 5788,
  "created_at": "2021-11-08 20:14:37.464936+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       A. Melnikov\nRequest for Comments: 5788                                   D. Cridland\nCategory: Standards Track                                  Isode Limited\nISSN: 2070-1721                                               March 2010",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "IMAP4 Keyword Registry",
      "zh-CHS": "IMAP4关键字注册表"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The aim of this document is to establish a new IANA registry for IMAP keywords and to define a procedure for keyword registration, in order to improve interoperability between different IMAP clients.",
      "zh-CHS": "本文档的目的是为IMAP关键字建立一个新的IANA注册表，并定义关键字注册程序，以改进不同IMAP客户端之间的互操作性。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5788.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc5788."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2010 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括信托法律条款第4.e节中所述的简化BSD许可证文本，并提供简化BSD许可证中所述的无担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions Used in This Document ...............................2\n3. IANA Considerations .............................................3\n   3.1. Review Guidelines for the Designated Expert Reviewer .......4\n   3.2. Comments on IMAP Keywords' Registrations ...................5\n   3.3. Change Control .............................................5\n   3.4. Initial Registrations ......................................6\n        3.4.1. $MDNSent IMAP Keyword Registration ..................6\n        3.4.2. $Forwarded IMAP Keyword Registration ................7\n        3.4.3. $SubmitPending IMAP Keyword Registration ............8\n        3.4.4. $Submitted IMAP Keyword Registration ................9\n4. Security Considerations ........................................10\n5. Acknowledgements ...............................................10\n6. References .....................................................10\n   6.1. Normative References ......................................10\n   6.2. Informative References ....................................11",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "IMAP keywords [RFC3501] are boolean named flags that can be used by clients to annotate messages in an IMAP mailbox. Although IMAP keywords are an optional feature of IMAP, the majority of IMAP servers can store arbitrary keywords. Many mainstream IMAP clients use a limited set of specific keywords, and some can manage (create, edit, display) arbitrary IMAP keywords.",
      "zh-CHS": "IMAP关键字[RFC3501]是布尔命名的标志，客户端可以使用这些标志为IMAP邮箱中的邮件添加注释。尽管IMAP关键字是IMAP的可选功能，但大多数IMAP服务器都可以存储任意关键字。许多主流IMAP客户端使用有限的特定关键字集，有些客户端可以管理（创建、编辑、显示）任意IMAP关键字。"
    },
    {
      "indent": 3,
      "text": "Over the years, some IMAP keywords have become de-facto standards, with some specific semantics associated with them. In some cases, different client implementors decided to define and use keywords with different names, but the same semantics. Some server implementors decided to map such keywords automatically in order to improve cross-client interoperability.",
      "zh-CHS": "多年来，一些IMAP关键字已成为事实上的标准，并具有一些特定的语义。在某些情况下，不同的客户机实现人员决定定义和使用具有不同名称但语义相同的关键字。一些服务器实现者决定自动映射这些关键字，以提高跨客户端的互操作性。"
    },
    {
      "indent": 3,
      "text": "In other cases, the same keywords have been used with different semantics, thus causing interoperability problems.",
      "zh-CHS": "在其他情况下，相同的关键字使用了不同的语义，从而导致互操作性问题。"
    },
    {
      "indent": 3,
      "text": "This document attempts to prevent further incompatible uses of IMAP keywords by establishing an \"IMAP Keywords\" registry and allocating a special prefix for standardized keywords.",
      "zh-CHS": "本文档试图通过建立“IMAP关键字”注册表并为标准化关键字分配特殊前缀来防止IMAP关键字的进一步不兼容使用。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "2. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [Kwds].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[Kwds]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "zh-CHS": "3. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has established a new registry for IMAP keywords.",
      "zh-CHS": "IANA为IMAP关键字建立了一个新的注册表。"
    },
    {
      "indent": 3,
      "text": "Registration of an IMAP keyword is requested by filling in the following template and following the instructions on the IANA pages for the registry to submit it to IANA:",
      "zh-CHS": "通过填写以下模板并遵循IANA页面上的说明，注册IMAP关键字，以便注册中心将其提交给IANA："
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword X",
      "zh-CHS": "主题：注册IMAP关键字X"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name:",
      "zh-CHS": "IMAP关键字名称："
    },
    {
      "indent": 3,
      "text": "Purpose (description):",
      "zh-CHS": "目的（说明）："
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: (One of PRIVATE, SHARED, or BOTH. PRIVATE means that each different user has a distinct copy of the keyword. SHARED means that all different users see the same value of the keyword. BOTH means that an IMAP server can have the keyword as either private or shared.)",
      "zh-CHS": "服务器上的Private或Shared：（Private、Shared或两者中的一个。Private表示每个不同的用户都有一个关键字的不同副本。Shared表示所有不同的用户都看到相同的关键字值。两者都表示IMAP服务器可以将关键字设为Private或Shared。）"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action:",
      "zh-CHS": "它是一个建议关键字还是可能导致自动操作："
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared:",
      "zh-CHS": "设置/清除关键字的时间/人员："
    },
    {
      "indent": 3,
      "text": "Related keywords: (for example, \"mutually exclusive with keywords Y and Z\")",
      "zh-CHS": "相关关键字：（例如，“与关键字Y和Z相互排斥”）"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities:",
      "zh-CHS": "相关IMAP功能："
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "zh-CHS": "安全考虑："
    },
    {
      "indent": 3,
      "text": "Published specification (recommended):",
      "zh-CHS": "已发布规范（推荐）："
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "zh-CHS": "联系人和电子邮件地址，以获取更多信息："
    },
    {
      "indent": 3,
      "text": "Intended usage: (One of COMMON, LIMITED USE, or DEPRECATED (i.e., not recommended for use))",
      "zh-CHS": "预期用途：（常用、有限用途或弃用（即不推荐使用））"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: (MUST be \"IESG\" for any \"common use\" keyword registration specified in an IETF Review document. See definition of \"common use\" below in this section. When the Owner/Change controller is not a Standardization Organization, the registration request MUST make it clear if",
      "zh-CHS": "所有者/变更控制者：（对于IETF审查文件中规定的任何“通用”关键字注册，必须为“IESG”。请参阅本节下文中“通用”的定义。当所有者/变更控制者不是标准化组织时，注册请求必须明确"
    },
    {
      "indent": 29,
      "text": "the registration is controlled by a company, or the individual performing the registration.)",
      "zh-CHS": "注册由公司或进行注册的个人控制。）"
    },
    {
      "indent": 3,
      "text": "Note: (Any other information that the author deems interesting may be added here, for example, if the keyword(s) is supported by existing clients.)",
      "zh-CHS": "注：（作者认为有趣的任何其他信息可以添加到此处，例如，如果现有客户端支持关键字。）"
    },
    {
      "indent": 3,
      "text": "Registration of an IMAP keyword requires Expert Review [RFC5226]. Registration of any IMAP keyword is initiated by posting a registration request to the Message Organization WG mailing list <morg@ietf.org> (or its replacement as chosen by the responsible Application Area Director) and CCing IANA (<iana@iana.org>). After allowing for at least two weeks for community input on the designated mailing list, the expert will determine the appropriateness of the registration request and either approve or disapprove the request with notice to the requestor, the mailing list, and IANA. Any refusal must come with a clear explanation.",
      "zh-CHS": "IMAP关键字的注册需要专家审查[RFC5226]。任何IMAP关键字的注册都是通过向消息组织WG邮件列表发布注册请求来启动的<morg@ietf.org>（或由负责的应用领域总监选择的替代品）和CCing IANA(<iana@iana.org>). 在指定邮件列表上留出至少两周的社区输入时间后，专家将确定注册请求的适当性，并向请求者、邮件列表和IANA发出通知，批准或不批准该请求。任何拒绝都必须有明确的解释。"
    },
    {
      "indent": 3,
      "text": "The IESG appoints one or more Expert Reviewers for the IMAP keyword registry established by this document.",
      "zh-CHS": "IESG为本文件建立的IMAP关键字注册表指定一名或多名专家评审员。"
    },
    {
      "indent": 3,
      "text": "The Expert Reviewer should strive for timely reviews. The Expert Reviewer should take no longer than six weeks to make and announce the decision, or notify the mailing list that more time is required.",
      "zh-CHS": "专家评审员应力求及时评审。专家评审员做出并宣布决定的时间不得超过六周，或通知邮件列表需要更多时间。"
    },
    {
      "indent": 3,
      "text": "Decisions (or lack of) made by an Expert Reviewer can be first appealed to Application Area Directors and, if the appellant is not satisfied with the response, to the full IESG.",
      "zh-CHS": "专家评审员做出的决定（或缺乏）可首先向申请区域主管提出上诉，如果上诉人对答复不满意，可向完整的IESG提出上诉。"
    },
    {
      "indent": 3,
      "text": "There are two types of IMAP keywords in the \"IMAP Keywords\" registry: intended for \"common use\" and vendor-/organization-specific use (also known as \"limited use\"). An IMAP keyword is said to be for \"common use\" if it is reasonably expected to be implemented in at least two independent client implementations. The two types of IMAP keywords have different levels of requirements for registration (see below).",
      "zh-CHS": "“IMAP关键字”注册表中有两种类型的IMAP关键字：用于“通用”和供应商/组织特定用途（也称为“有限用途”）。如果合理地预期IMAP关键字将在至少两个独立的客户端实现中实现，则称其为“通用”。这两种类型的IMAP关键字对注册的要求不同（见下文）。"
    },
    {
      "indent": 0,
      "text": "3.1. Review Guidelines for the Designated Expert Reviewer",
      "section_title": true,
      "zh-CHS": "3.1. 指定专家审评员的审评指南"
    },
    {
      "indent": 3,
      "text": "Expert Reviewers should focus on the following requirements.",
      "zh-CHS": "专家评审员应关注以下要求。"
    },
    {
      "indent": 3,
      "text": "Registration of a vendor-/organization-specific (\"limited use\") IMAP keyword is easier. The Expert Reviewer only needs to check that the requested name doesn't conflict with an already registered name, and that the name is not too generic, misleading, etc. The Expert Reviewer MAY request the IMAP keyword name change before approving",
      "zh-CHS": "注册特定于供应商/组织（“有限使用”）的IMAP关键字更容易。专家评审员只需检查请求的名称是否与已注册的名称冲突，以及名称是否过于通用、误导等。专家评审员可在批准前请求更改IMAP关键字名称"
    },
    {
      "indent": 3,
      "text": "the registration. The Expert Reviewer SHOULD refuse a registration if there is an already registered IMAP keyword that serves the same purpose, but has a different name.",
      "zh-CHS": "注册。如果已注册的IMAP关键字具有相同的用途，但名称不同，专家评审员应拒绝注册。"
    },
    {
      "indent": 3,
      "text": "When registering an IMAP keyword for \"common use\", the Expert Reviewer performs the checks described for vendor-/ organization-specific IMAP keywords, plus additional checks as detailed below.",
      "zh-CHS": "注册“通用”IMAP关键字时，专家评审员将执行供应商/组织特定IMAP关键字的检查，以及以下详细说明的其他检查。"
    },
    {
      "indent": 3,
      "text": "Keywords intended for \"common use\" SHOULD start with the \"$\" prefix. (Note that this is a SHOULD because some of the commonly used IMAP keywords in widespread use don't follow this convention.)",
      "zh-CHS": "用于“常用”的关键字应以“$”前缀开头。（请注意，这是一个“应该”，因为广泛使用的一些常用IMAP关键字不遵循此约定。）"
    },
    {
      "indent": 3,
      "text": "IMAP keywords intended for \"common use\" SHOULD be standardized in IETF Review [RFC5226] documents. (Note that IETF Review documents still require Expert Review.)",
      "zh-CHS": "IETF评审[RFC5226]文件中应标准化用于“通用”的IMAP关键字。（请注意，IETF审查文件仍需要专家审查。）"
    },
    {
      "indent": 3,
      "text": "Values in the \"IMAP Keywords\" IANA registry intended for \"common use\" must be clearly documented and likely to ensure interoperability. They must be useful, not harmful to the Internet. In cases when an IMAP keyword being registered is already deployed, Expert Reviewers should favor registering it over requiring perfect documentation and/or requesting a change to the name of the IMAP keyword.",
      "zh-CHS": "“IMAP关键字”IANA注册表中用于“通用”的值必须明确记录，并可能确保互操作性。它们必须是有用的，而不是对互联网有害的。如果已经部署了正在注册的IMAP关键字，专家评审员应该倾向于注册它，而不是要求完善的文档和/或请求更改IMAP关键字的名称。"
    },
    {
      "indent": 3,
      "text": "The Expert Reviewer MAY automatically \"upgrade\" registration requests for a \"limited use\" IMAP keyword to \"common use\" level. The Expert Reviewer MAY also request that a registration targeted for \"common use\" be registered as \"limited use\" instead.",
      "zh-CHS": "专家评审员可以自动将“有限使用”IMAP关键字的注册请求“升级”到“通用”级别。专家审评员还可要求将“通用”登记改为“有限使用”。"
    },
    {
      "indent": 0,
      "text": "3.2. Comments on IMAP Keywords' Registrations",
      "section_title": true,
      "zh-CHS": "3.2. 关于IMAP关键字注册的评论"
    },
    {
      "indent": 3,
      "text": "Comments on registered IMAP keywords should be sent to both the \"owner\" of the mechanism and to the mailing list designated to IMAP keyword review (see Section 3). This improves the chances of getting a timely response.",
      "zh-CHS": "关于注册IMAP关键字的评论应发送给机制的“所有者”和指定给IMAP关键字审查的邮件列表（见第3节）。这提高了获得及时响应的机会。"
    },
    {
      "indent": 3,
      "text": "Submitters of comments may, after a reasonable attempt to contact the owner and after soliciting comments on the IMAP mailing list, request the designated Expert Reviewer to attach their comment to the IMAP keyword registration itself. The procedure is similar to requesting an Expert Review for the affected keyword.",
      "zh-CHS": "在合理尝试联系所有者并在IMAP邮件列表上征求意见后，意见提交人可要求指定专家评审员将其意见附在IMAP关键字注册本身上。该程序类似于请求专家审查受影响的关键字。"
    },
    {
      "indent": 0,
      "text": "3.3. Change Control",
      "section_title": true,
      "zh-CHS": "3.3. 变更控制"
    },
    {
      "indent": 3,
      "text": "Once an IMAP keyword registration has been published by IANA, the owner may request a change to its definition. The change request (including a change to the \"intended usage\" field) follows the same procedure as the initial registration request, with the exception of",
      "zh-CHS": "IANA发布IMAP关键字注册后，所有者可以请求更改其定义。变更请求（包括对“预期用途”字段的变更）遵循与初始注册请求相同的程序，但以下情况除外："
    },
    {
      "indent": 3,
      "text": "changes to the \"Person & email address to contact for further information\" and \"Owner/Change controller\" fields. The latter can be changed by the owner by informing IANA; this can be done without discussion or review.",
      "zh-CHS": "更改“联系人和电子邮件地址以获取更多信息”和“所有者/变更控制者”字段。业主可通过通知IANA变更后者；这可以在不进行讨论或审查的情况下完成。"
    },
    {
      "indent": 3,
      "text": "The IESG may reassign responsibility for an IMAP keyword. The most common case of this will be to enable clarifications to be made to keywords where the owner of the registration has died, moved out of contact, or is otherwise unable to make changes that are important to the community.",
      "zh-CHS": "IESG可以重新分配IMAP关键字的责任。最常见的情况是，如果注册所有者去世、失去联系或无法进行对社区重要的更改，则可以对关键字进行澄清。"
    },
    {
      "indent": 3,
      "text": "IMAP keyword registrations MUST NOT be deleted; keywords that are no longer believed appropriate for use can be declared DEPRECATED by a change to their \"intended usage\" field.",
      "zh-CHS": "不得删除IMAP关键字注册；不再被认为适合使用的关键字可以通过更改其“预期用途”字段声明为不推荐使用。"
    },
    {
      "indent": 3,
      "text": "The IESG is considered the owner of all \"common use\" IMAP keywords that are published in an IETF Review document.",
      "zh-CHS": "IESG被认为是IETF审查文件中发布的所有“常用”IMAP关键字的所有者。"
    },
    {
      "indent": 0,
      "text": "3.4. Initial Registrations",
      "section_title": true,
      "zh-CHS": "3.4. 初次登记"
    },
    {
      "indent": 3,
      "text": "IANA has registered the IMAP keywords specified in following subsections in the registry established by this document.",
      "zh-CHS": "IANA已在本文件建立的注册表中注册了以下小节中指定的IMAP关键字。"
    },
    {
      "indent": 0,
      "text": "3.4.1. $MDNSent IMAP Keyword Registration",
      "section_title": true,
      "zh-CHS": "3.4.1. $MDNSent IMAP关键字注册"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword $MDNSent",
      "zh-CHS": "主题：注册IMAP关键字$MDNSent"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $MDNSent",
      "zh-CHS": "IMAP关键字名称：$MDNSent"
    },
    {
      "indent": 3,
      "text": "Purpose (description): Specifies that a Message Disposition Notification (MDN) must not be sent for any message annotated with the $MDNSent IMAP keyword.",
      "zh-CHS": "用途（说明）：指定不得为任何带有$MDNSent IMAP关键字注释的邮件发送邮件处置通知（MDN）。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: SHARED",
      "zh-CHS": "服务器上的专用或共享：共享"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: This keyword can cause automatic action by the client. See [RFC3503] for more details.",
      "zh-CHS": "它是一个咨询关键字还是可能导致自动操作：此关键字可能导致客户端自动操作。有关更多详细信息，请参见[RFC3503]。"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword is set by an IMAP client when it decides to act on an MDN request, or when uploading a sent or draft message. It can also be set by a delivery agent. Once set, the flag SHOULD NOT be cleared.",
      "zh-CHS": "何时/由谁设置/清除关键字：当IMAP客户端决定对MDN请求采取行动时，或在上载已发送或草稿消息时，该关键字由IMAP客户端设置。它也可以由送货代理设置。设置后，不应清除该标志。"
    },
    {
      "indent": 3,
      "text": "Related keywords: None",
      "zh-CHS": "相关关键词：无"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None",
      "zh-CHS": "相关IMAP功能：无"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 6 of [RFC3503]",
      "zh-CHS": "安全注意事项：见[RFC3503]第6节"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC3503]",
      "zh-CHS": "已发布规范（推荐）：[RFC3503]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "zh-CHS": "所有者/变更控制员：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "zh-CHS": "注:"
    },
    {
      "indent": 0,
      "text": "3.4.2. $Forwarded IMAP Keyword Registration",
      "section_title": true,
      "zh-CHS": "3.4.2. $IMAP关键字注册"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of the IMAP keyword $Forwarded",
      "zh-CHS": "主题：注册IMAP关键字$Forwarded"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $Forwarded",
      "zh-CHS": "IMAP关键字名称：$Forwarded"
    },
    {
      "indent": 3,
      "text": "Purpose (description): $Forwarded is used by several IMAP clients to specify that the message was resent to another email address, embedded within or attached to a new message. This keyword is set by the mail client when it successfully forwards the message to another email address. Typical usage of this keyword is to show a different (or additional) icon for a message that has been forwarded.",
      "zh-CHS": "用途（说明）：$Forwarded被多个IMAP客户端用于指定将邮件重新发送到另一个电子邮件地址，嵌入或附加到新邮件中。当邮件客户端成功地将邮件转发到另一个电子邮件地址时，会设置此关键字。此关键字的典型用法是为已转发的邮件显示不同（或附加）图标。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: BOTH",
      "zh-CHS": "服务器上的私有或共享：两者"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: advisory",
      "zh-CHS": "它是一个advisory关键字还是可能导致自动操作：advisory"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword can be set by either a delivery agent or a mail client. Once set, the flag SHOULD NOT be cleared. Notes: There is no way to tell if a message with $Forwarded keyword set was forwarded more than once.",
      "zh-CHS": "设置/清除关键字的时间/人：此关键字可以由传递代理或邮件客户端设置。设置后，不应清除该标志。注意：无法判断设置了$Forwarded关键字的邮件是否转发了多次。"
    },
    {
      "indent": 3,
      "text": "Related keywords: None",
      "zh-CHS": "相关关键词：无"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None",
      "zh-CHS": "相关IMAP功能：无"
    },
    {
      "indent": 3,
      "text": "Security considerations: A server implementing this keyword as a shared keyword may disclose that a confidential message was forwarded.",
      "zh-CHS": "安全注意事项：将此关键字作为共享关键字实现的服务器可能会披露转发了机密消息。"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC5550]",
      "zh-CHS": "已发布规范（推荐）：[RFC5550]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "zh-CHS": "所有者/变更控制员：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "zh-CHS": "注:"
    },
    {
      "indent": 0,
      "text": "3.4.3. $SubmitPending IMAP Keyword Registration",
      "section_title": true,
      "zh-CHS": "3.4.3. $SubmitPending IMAP关键字注册"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword $SubmitPending",
      "zh-CHS": "主题：注册IMAP关键字$SubmitPending"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $SubmitPending",
      "zh-CHS": "IMAP关键字名称：$SubmitPending"
    },
    {
      "indent": 3,
      "text": "Purpose (description): The $SubmitPending IMAP keyword designates the message as awaiting to be submitted. This keyword allows storing messages waiting to be submitted in the same mailbox where messages that were already submitted and/or are being edited are stored.",
      "zh-CHS": "用途（说明）$SubmitPending IMAP关键字将消息指定为等待提交。此关键字允许在存储已提交和/或正在编辑的邮件的同一邮箱中存储等待提交的邮件。"
    },
    {
      "indent": 27,
      "text": "A message that has both $Submitted and $SubmitPending IMAP keywords set is a message being actively submitted.",
      "zh-CHS": "设置了$Submitted和$SubmitPending IMAP关键字的邮件是正在主动提交的邮件。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: SHARED",
      "zh-CHS": "服务器上的专用或共享：共享"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: This keyword can cause automatic action by the client. See Section 5.10 of [RFC5550] for more details.",
      "zh-CHS": "它是一个咨询关键字还是可能导致自动操作：此关键字可能导致客户端自动操作。详见[RFC5550]第5.10节。"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword is set by a mail client when it decides that the message needs to be sent out.",
      "zh-CHS": "何时/由谁设置/清除关键字：邮件客户端在决定需要发送邮件时设置此关键字。"
    },
    {
      "indent": 3,
      "text": "Related keywords: $Submitted",
      "zh-CHS": "相关关键字：$Submitted"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None",
      "zh-CHS": "相关IMAP功能：无"
    },
    {
      "indent": 3,
      "text": "Security considerations: A server implementing this keyword as a shared keyword may disclose that a confidential message is scheduled to be sent out or is being actively sent out.",
      "zh-CHS": "安全注意事项：将此关键字作为共享关键字实现的服务器可能会泄露机密消息已计划发送或正在主动发送。"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC5550]",
      "zh-CHS": "已发布规范（推荐）：[RFC5550]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "zh-CHS": "所有者/变更控制员：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "zh-CHS": "注:"
    },
    {
      "indent": 0,
      "text": "3.4.4. $Submitted IMAP Keyword Registration",
      "section_title": true,
      "zh-CHS": "3.4.4. $IMAP关键字注册已提交"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword $Submitted",
      "zh-CHS": "主题：注册IMAP关键字$Submitted"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $Submitted",
      "zh-CHS": "IMAP关键字名称：$Submitted"
    },
    {
      "indent": 3,
      "text": "Purpose (description): The $Submitted IMAP keyword designates the message as being sent out.",
      "zh-CHS": "用途（说明）：$Submitted IMAP关键字将消息指定为已发送。"
    },
    {
      "indent": 27,
      "text": "A message that has both $Submitted and $SubmitPending IMAP keywords set is a message being actively submitted.",
      "zh-CHS": "设置了$Submitted和$SubmitPending IMAP关键字的邮件是正在主动提交的邮件。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: SHARED",
      "zh-CHS": "服务器上的专用或共享：共享"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: This keyword can cause automatic action by the client. See Section 5.10 of [RFC5550] for more details.",
      "zh-CHS": "它是一个咨询关键字还是可能导致自动操作：此关键字可能导致客户端自动操作。详见[RFC5550]第5.10节。"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword is set by a mail client when it decides to start sending it.",
      "zh-CHS": "设置/清除关键字的时间/人：邮件客户端决定开始发送关键字时，会设置该关键字。"
    },
    {
      "indent": 3,
      "text": "Related keywords: $SubmitPending",
      "zh-CHS": "相关关键字：$SubmitPending"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None",
      "zh-CHS": "相关IMAP功能：无"
    },
    {
      "indent": 3,
      "text": "Security considerations: A server implementing this keyword as a shared keyword may disclose that a confidential message was sent or is being actively sent out.",
      "zh-CHS": "安全注意事项：将此关键字作为共享关键字实现的服务器可能会泄露机密消息已发送或正在被主动发送。"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC5550]",
      "zh-CHS": "已发布规范（推荐）：[RFC5550]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "zh-CHS": "预期用途：普通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "zh-CHS": "所有者/变更控制员：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "zh-CHS": "注:"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 4,
      "text": "IMAP keywords are one of the base IMAP features [RFC3501]. This document doesn't change their behavior, so it does not add new security issues.",
      "zh-CHS": "IMAP关键字是基本IMAP功能之一[RFC3501]。此文档不会更改它们的行为，因此不会添加新的安全问题。"
    },
    {
      "indent": 4,
      "text": "A particular IMAP keyword might have specific security considerations, which are documented in the IMAP keyword registration template standardized by this document.",
      "zh-CHS": "特定IMAP关键字可能具有特定的安全注意事项，这些注意事项记录在本文档标准化的IMAP关键字注册模板中。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "The creation of this document was prompted by one of many discussions on the IMAP mailing list.",
      "zh-CHS": "本文档的创建是由IMAP邮件列表上的众多讨论之一促成的。"
    },
    {
      "indent": 3,
      "text": "John Neystadt co-authored the first version of this document.",
      "zh-CHS": "John Neystadt是本文件第一版的合著者。"
    },
    {
      "indent": 3,
      "text": "Special thanks to Chris Newman, David Harris, Lyndon Nerenberg, Mark Crispin, Samuel Weiler, Alfred Hoenes, Lars Eggert, and Cullen Jennings for reviewing different versions of this document. However, all errors or omissions must be attributed to the authors of this document.",
      "zh-CHS": "特别感谢Chris Newman、David Harris、Lyndon Nerenberg、Mark Crispin、Samuel Weiler、Alfred Hoenes、Lars Eggert和Cullen Jennings审阅了本文件的不同版本。但是，所有错误或遗漏必须归咎于本文件的作者。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank the developers of Mozilla mail clients for providing food for thought.",
      "zh-CHS": "作者还想感谢Mozilla邮件客户端的开发人员提供了思考的素材。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[Kwds] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[Kwds]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3501] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, March 2003.",
      "zh-CHS": "[RFC3501]Crispin，M.，“互联网消息访问协议-版本4rev1”，RFC 35012003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3503] Melnikov, A., \"Message Disposition Notification (MDN) profile for Internet Message Access Protocol (IMAP)\", RFC 3503, March 2003.",
      "zh-CHS": "[RFC3503]Melnikov，A.，“互联网消息访问协议（IMAP）的消息处置通知（MDN）配置文件”，RFC 3503，2003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5550] Cridland, D., Melnikov, A., and S. Maes, \"The Internet Email to Support Diverse Service Environments (Lemonade) Profile\", RFC 5550, August 2009.",
      "zh-CHS": "[RFC5550]Cridland，D.，Melnikov，A.，和S.Maes，“支持多样化服务环境（柠檬水）配置文件的互联网电子邮件”，RFC 55502009年8月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Alexey Melnikov Isode Limited 5 Castle Business Village 36 Station Road Hampton, Middlesex TW12 2BX UK",
      "zh-CHS": "英国米德尔塞克斯郡汉普顿车站路36号城堡商业村5号Alexey Melnikov Isode Limited TW12 2BX"
    },
    {
      "indent": 3,
      "text": "EMail: Alexey.Melnikov@isode.com\nURI:   http://www.melnikov.ca/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Dave Cridland Isode Limited 5 Castle Business Village 36 Station Road Hampton, Middlesex TW12 2BX UK",
      "zh-CHS": "Dave Cridland Isode Limited 5城堡商业村英国米德尔塞克斯郡汉普顿车站路36号TW12 2BX"
    },
    {
      "indent": 3,
      "text": "EMail: dave.cridland@isode.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}