{
  "title": {
    "text": "RFC 5530: IMAP Response Codes",
    "zh-CHS": "RFC 5530"
  },
  "number": 5530,
  "created_at": "2021-11-07 21:06:57.456464+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     A. Gulbrandsen\nRequest for Comments: 5530                        Oryx Mail Systems GmbH\nCategory: Standards Track                                       May 2009",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 26,
      "text": "IMAP Response Codes",
      "zh-CHS": "IMAP响应码"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托在本文件出版之日生效的与IETF文件有关的法律规定的约束(http://trustee.ietf.org/license-info). 请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "IMAP responses consist of a response type (OK, NO, BAD), an optional machine-readable response code, and a human-readable text.",
      "zh-CHS": "IMAP响应由响应类型（OK、NO、BAD）、可选的机器可读响应代码和人类可读文本组成。"
    },
    {
      "indent": 3,
      "text": "This document collects and documents a variety of machine-readable response codes, for better interoperation and error reporting.",
      "zh-CHS": "本文档收集并记录各种机器可读的响应代码，以实现更好的互操作和错误报告。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Section 7.1 of [RFC3501] defines a number of response codes that can help tell an IMAP client why a command failed. However, experience has shown that more codes are useful. For example, it is useful for a client to know that an authentication attempt failed because of a server problem as opposed to a password problem.",
      "zh-CHS": "[RFC3501]的第7.1节定义了一些响应代码，这些代码有助于告知IMAP客户端命令失败的原因。然而，经验表明，更多的代码是有用的。例如，客户机知道身份验证尝试失败是因为服务器问题，而不是密码问题，这是很有用的。"
    },
    {
      "indent": 3,
      "text": "Currently, many IMAP servers use English-language, human-readable text to describe these errors, and a few IMAP clients attempt to translate this text into the user's language.",
      "zh-CHS": "目前，许多IMAP服务器使用英语、人类可读文本来描述这些错误，少数IMAP客户端尝试将这些文本翻译成用户的语言。"
    },
    {
      "indent": 3,
      "text": "This document names a variety of errors as response codes. It is based on errors that have been checked and reported on in some IMAP server implementations, and on the needs of some IMAP clients.",
      "zh-CHS": "本文档将各种错误命名为响应代码。它基于一些IMAP服务器实现中检查和报告的错误，以及一些IMAP客户端的需要。"
    },
    {
      "indent": 3,
      "text": "This document doesn't require any servers to test for these errors or any clients to test for these names. It only names errors for better reporting and handling.",
      "zh-CHS": "本文档不需要任何服务器来测试这些错误，也不需要任何客户端来测试这些名称。它只命名错误，以便更好地报告和处理。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "2. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "Formal syntax is defined by [RFC5234] as modified by [RFC3501].",
      "zh-CHS": "形式语法由[RFC5234]定义，并由[RFC3501]修改。"
    },
    {
      "indent": 3,
      "text": "Example lines prefaced by \"C:\" are sent by the client and ones prefaced by \"S:\" by the server. \"[...]\" means elision.",
      "zh-CHS": "以“C:”开头的示例行由客户端发送，以“S:”开头的示例行由服务器发送。“[……]”是指省略。"
    },
    {
      "indent": 0,
      "text": "3. Response Codes",
      "section_title": true,
      "zh-CHS": "3. 响应代码"
    },
    {
      "indent": 3,
      "text": "This section defines all the new response codes. Each definition is followed by one or more examples.",
      "zh-CHS": "本节定义了所有新的响应代码。每个定义后面都有一个或多个示例。"
    },
    {
      "indent": 3,
      "text": "UNAVAILABLE Temporary failure because a subsystem is down. For example, an IMAP server that uses a Lightweight Directory Access Protocol (LDAP) or Radius server for authentication might use this response code when the LDAP/Radius server is down.",
      "zh-CHS": "不可用的临时故障，因为子系统已关闭。例如，使用轻型目录访问协议（LDAP）或Radius服务器进行身份验证的IMAP服务器在LDAP/Radius服务器关闭时可能会使用此响应代码。"
    },
    {
      "indent": 9,
      "text": "C: a LOGIN \"fred\" \"foo\"\nS: a NO [UNAVAILABLE] User's backend down for maintenance",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "AUTHENTICATIONFAILED Authentication failed for some reason on which the server is unwilling to elaborate. Typically, this includes \"unknown user\" and \"bad password\".",
      "zh-CHS": "AUTHENTICATIONFAILED身份验证由于服务器不愿详细说明的某些原因而失败。通常，这包括“未知用户”和“错误密码”。"
    },
    {
      "indent": 9,
      "text": "This is the same as not sending any response code, except that when a client sees AUTHENTICATIONFAILED, it knows that the problem wasn't, e.g., UNAVAILABLE, so there's no point in trying the same login/password again later.",
      "zh-CHS": "这与不发送任何响应代码相同，只是当客户机看到AUTHENTICATIONFAILED时，它知道问题不是，例如不可用，因此以后再尝试相同的登录/密码没有意义。"
    },
    {
      "indent": 9,
      "text": "C: b LOGIN \"fred\" \"foo\"\nS: b NO [AUTHENTICATIONFAILED] Authentication failed",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "AUTHORIZATIONFAILED Authentication succeeded in using the authentication identity, but the server cannot or will not allow the authentication identity to act as the requested authorization identity. This is only applicable when the authentication and authorization identities are different.",
      "zh-CHS": "AUTHORIZATIONFAILED身份验证成功使用身份验证标识，但服务器无法或将不允许身份验证标识作为请求的身份验证标识。这仅适用于身份验证和授权标识不同的情况。"
    },
    {
      "indent": 9,
      "text": "C: c1 AUTHENTICATE PLAIN\n[...]\nS: c1 NO [AUTHORIZATIONFAILED] No such authorization-ID",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "C: c2 AUTHENTICATE PLAIN\n[...]\nS: c2 NO [AUTHORIZATIONFAILED] Authenticator is not an admin",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "EXPIRED Either authentication succeeded or the server no longer had the necessary data; either way, access is no longer permitted using that passphrase. The client or user should get a new passphrase.",
      "zh-CHS": "过期身份验证成功或服务器不再具有必要的数据；无论哪种方式，都不再允许使用该密码短语进行访问。客户端或用户应获得新的密码短语。"
    },
    {
      "indent": 9,
      "text": "C: d login \"fred\" \"foo\"\nS: d NO [EXPIRED] That password isn't valid any more",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "PRIVACYREQUIRED The operation is not permitted due to a lack of privacy. If Transport Layer Security (TLS) is not in use, the client could try STARTTLS (see Section 6.2.1 of [RFC3501]) and then repeat the operation.",
      "zh-CHS": "privacy Required由于缺乏隐私，因此不允许该操作。如果未使用传输层安全性（TLS），则客户端可以尝试STARTTLS（参见[RFC3501]第6.2.1节），然后重复该操作。"
    },
    {
      "indent": 9,
      "text": "C: d login \"fred\" \"foo\"\nS: d NO [PRIVACYREQUIRED] Connection offers no privacy",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "C: d select inbox\nS: d NO [PRIVACYREQUIRED] Connection offers no privacy",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "CONTACTADMIN The user should contact the system administrator or support desk.",
      "zh-CHS": "CONTACTADMIN用户应联系系统管理员或支持台。"
    },
    {
      "indent": 9,
      "text": "C: e login \"fred\" \"foo\"\nS: e OK [CONTACTADMIN]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "NOPERM The access control system (e.g., Access Control List (ACL), see [RFC4314]) does not permit this user to carry out an operation, such as selecting or creating a mailbox.",
      "zh-CHS": "NOPERM访问控制系统（例如，访问控制列表（ACL），请参见[RFC4314]）不允许该用户执行操作，例如选择或创建邮箱。"
    },
    {
      "indent": 9,
      "text": "C: f select \"/archive/projects/experiment-iv\"\nS: f NO [NOPERM] Access denied",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "INUSE An operation has not been carried out because it involves sawing off a branch someone else is sitting on. Someone else may be holding an exclusive lock needed for this operation, or the operation may involve deleting a resource someone else is using, typically a mailbox.",
      "zh-CHS": "因为需要锯下别人坐着的树枝，所以没有进行任何操作。其他人可能持有此操作所需的独占锁，或者该操作可能涉及删除其他人正在使用的资源，通常是邮箱。"
    },
    {
      "indent": 9,
      "text": "The operation may succeed if the client tries again later.",
      "zh-CHS": "如果客户端稍后重试，该操作可能会成功。"
    },
    {
      "indent": 9,
      "text": "C: g delete \"/archive/projects/experiment-iv\"\nS: g NO [INUSE] Mailbox in use",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "EXPUNGEISSUED Someone else has issued an EXPUNGE for the same mailbox. The client may want to issue NOOP soon. [RFC2180] discusses this subject in depth.",
      "zh-CHS": "删除已被起诉其他人已为同一邮箱发出删除。客户可能希望尽快发布NOOP。[RFC2180]深入讨论了这个主题。"
    },
    {
      "indent": 9,
      "text": "C: h search from fred@example.com\nS: * SEARCH 1 2 3 5 8 13 21 42\nS: h OK [EXPUNGEISSUED] Search completed",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "CORRUPTION The server discovered that some relevant data (e.g., the mailbox) are corrupt. This response code does not include any information about what's corrupt, but the server can write that to its logfiles.",
      "zh-CHS": "损坏服务器发现某些相关数据（例如邮箱）已损坏。此响应代码不包含任何有关损坏内容的信息，但服务器可以将其写入日志文件。"
    },
    {
      "indent": 9,
      "text": "C: i select \"/archive/projects/experiment-iv\"\nS: i NO [CORRUPTION] Cannot open mailbox",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "SERVERBUG The server encountered a bug in itself or violated one of its own invariants.",
      "zh-CHS": "SERVERBUG服务器本身遇到错误或违反了自身的一个不变量。"
    },
    {
      "indent": 9,
      "text": "C: j select \"/archive/projects/experiment-iv\"\nS: j NO [SERVERBUG] This should not happen",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "CLIENTBUG The server has detected a client bug. This can accompany all of OK, NO, and BAD, depending on what the client bug is.",
      "zh-CHS": "客户端错误服务器检测到客户端错误。这可能伴随着所有OK、NO和BAD，这取决于客户端bug是什么。"
    },
    {
      "indent": 9,
      "text": "C: k1 select \"/archive/projects/experiment-iv\"\n[...]\nS: k1 OK [READ-ONLY] Done\nC: k2 status \"/archive/projects/experiment-iv\" (messages)\n[...]\nS: k2 OK [CLIENTBUG] Done",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "CANNOT The operation violates some invariant of the server and can never succeed.",
      "zh-CHS": "无法执行此操作，因为该操作违反了服务器的某些不变量，因此永远不会成功。"
    },
    {
      "indent": 9,
      "text": "C: l create \"///////\"\nS: l NO [CANNOT] Adjacent slashes are not supported",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "LIMIT The operation ran up against an implementation limit of some kind, such as the number of flags on a single message or the number of flags used in a mailbox.",
      "zh-CHS": "限制操作遇到某种实现限制，例如单个邮件上的标志数或邮箱中使用的标志数。"
    },
    {
      "indent": 9,
      "text": "C: m STORE 42 FLAGS f1 f2 f3 f4 f5 ... f250\nS: m NO [LIMIT] At most 32 flags in one mailbox supported",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "OVERQUOTA The user would be over quota after the operation. (The user may or may not be over quota already.)",
      "zh-CHS": "超额用户在操作后将超额。（用户可能已超过配额，也可能未超过配额。）"
    },
    {
      "indent": 9,
      "text": "Note that if the server sends OVERQUOTA but doesn't support the IMAP QUOTA extension defined by [RFC2087], then there is a quota, but the client cannot find out what the quota is.",
      "zh-CHS": "请注意，如果服务器发送超额配额，但不支持[RFC2087]定义的IMAP配额扩展，则存在配额，但客户端无法找到配额是什么。"
    },
    {
      "indent": 9,
      "text": "C: n1 uid copy 1:* oldmail\nS: n1 NO [OVERQUOTA] Sorry",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "C: n2 uid copy 1:* oldmail\nS: n2 OK [OVERQUOTA] You are now over your soft quota",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ALREADYEXISTS The operation attempts to create something that already exists, such as when the CREATE or RENAME directories attempt to create a mailbox and there is already one of that name.",
      "zh-CHS": "ALREADYEXISTS该操作尝试创建已存在的内容，例如当创建或重命名目录尝试创建邮箱时，该名称已经存在。"
    },
    {
      "indent": 9,
      "text": "C: o RENAME this that\nS: o NO [ALREADYEXISTS] Mailbox \"that\" already exists",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "NONEXISTENT The operation attempts to delete something that does not exist. Similar to ALREADYEXISTS.",
      "zh-CHS": "不存在该操作尝试删除不存在的内容。类似于已经存在的人。"
    },
    {
      "indent": 9,
      "text": "C: p RENAME this that\nS: p NO [NONEXISTENT] No such mailbox",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Formal Syntax",
      "section_title": true,
      "zh-CHS": "4. 形式语法"
    },
    {
      "indent": 3,
      "text": "The following syntax specification uses the Augmented Backus-Naur Form (ABNF) notation as specified in [RFC5234]. [RFC3501] defines the non-terminal \"resp-text-code\".",
      "zh-CHS": "以下语法规范使用[RFC5234]中指定的增广巴科斯诺尔形式（ABNF）表示法。[RFC3501]定义了非终端“resp文本代码”。"
    },
    {
      "indent": 3,
      "text": "Except as noted otherwise, all alphabetic characters are case-insensitive. The use of upper or lowercase characters to define token strings is for editorial clarity only.",
      "zh-CHS": "除非另有说明，否则所有字母字符都不区分大小写。使用大写或小写字符定义标记字符串仅为编辑目的。"
    },
    {
      "indent": 8,
      "text": "resp-text-code =/ \"UNAVAILABLE\" / \"AUTHENTICATIONFAILED\" /\n                 \"AUTHORIZATIONFAILED\" / \"EXPIRED\" /\n                 \"PRIVACYREQUIRED\" / \"CONTACTADMIN\" / \"NOPERM\" /\n                 \"INUSE\" / \"EXPUNGEISSUED\" / \"CORRUPTION\" /\n                 \"SERVERBUG\" / \"CLIENTBUG\" / \"CANNOT\" /\n                 \"LIMIT\" / \"OVERQUOTA\" / \"ALREADYEXISTS\" /\n                 \"NONEXISTENT\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Revealing information about a passphrase to unauthenticated IMAP clients causes bad karma.",
      "zh-CHS": "向未经身份验证的IMAP客户端透露有关密码短语的信息会导致不良后果。"
    },
    {
      "indent": 3,
      "text": "Response codes are easier to parse than human-readable text. This can amplify the consequences of an information leak. For example, selecting a mailbox can fail because the mailbox doesn't exist, because the user doesn't have the \"l\" right (right to know the mailbox exists) or \"r\" right (right to read the mailbox). If the server sent different responses in the first two cases in the past, only malevolent clients would discover it. With response codes it's possible, perhaps probable, that benevolent clients will forward the",
      "zh-CHS": "响应代码比人类可读的文本更容易解析。这会放大信息泄漏的后果。例如，选择邮箱可能会失败，因为邮箱不存在，因为用户没有“l”权限（知道邮箱存在的权限）或“r”权限（读取邮箱的权限）。如果服务器在过去的前两种情况下发送了不同的响应，那么只有恶意客户端才会发现它。有了响应代码，仁慈的客户就有可能（也许是可能）转发消息"
    },
    {
      "indent": 3,
      "text": "leaked information to the user. Server authors are encouraged to be particularly careful with the NOPERM and authentication-related responses.",
      "zh-CHS": "泄露给用户的信息。鼓励服务器作者特别小心NOPERM和身份验证相关的响应。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA has created the IMAP Response Codes registry. The registry has been populated with the following codes:",
      "zh-CHS": "IANA已创建IMAP响应代码注册表。注册表已填充以下代码："
    },
    {
      "indent": 6,
      "text": "NEWNAME RFC 2060 (obsolete) REFERRAL RFC 2221 ALERT RFC 3501 BADCHARSET RFC 3501 PARSE RFC 3501 PERMANENTFLAGS RFC 3501 READ-ONLY RFC 3501 READ-WRITE RFC 3501 TRYCREATE RFC 3501 UIDNEXT RFC 3501 UIDVALIDITY RFC 3501 UNSEEN RFC 3501 UNKNOWN-CTE RFC 3516 UIDNOTSTICKY RFC 4315 APPENDUID RFC 4315 COPYUID RFC 4315 URLMECH RFC 4467 TOOBIG RFC 4469 BADURL RFC 4469 HIGHESTMODSEQ RFC 4551 NOMODSEQ RFC 4551 MODIFIED RFC 4551 COMPRESSIONACTIVE RFC 4978 CLOSED RFC 5162 NOTSAVED RFC 5182 BADCOMPARATOR RFC 5255 ANNOTATE RFC 5257 ANNOTATIONS RFC 5257 TEMPFAIL RFC 5259 MAXCONVERTMESSAGES RFC 5259 MAXCONVERTPARTS RFC 5259 NOUPDATE RFC 5267 METADATA RFC 5464 NOTIFICATIONOVERFLOW RFC 5465 BADEVENT RFC 5465 UNDEFINED-FILTER RFC 5466 UNAVAILABLE RFC 5530 AUTHENTICATIONFAILED RFC 5530 AUTHORIZATIONFAILED RFC 5530",
      "zh-CHS": "新名称RFC 2060（已过时）参考RFC 2221警报RFC 3501坏字符集RFC 3501解析RFC 3501永久标志RFC 3501只读RFC 3501读写RFC 3501尝试创建RFC 3501 UID下一个RFC 3501 UID有效性RFC 3501不可见RFC 3501未知-CTE RFC 3516 UID粘性RFC 4315附录UID RFC 4315 COPYUID RFC 4315 URL MECH RFC 4467 TOOBIG RFC 4469 BADURL RFC 4469 HIGHESTMODSEQRFC 4551 NOMODSEQ RFC 4551修改RFC 4551压缩活动RFC 4978关闭RFC 5162未保存RFC 5182 BADCOMPARATOR RFC 5255注释RFC 5257临时失效RFC 5259 MAXCONVERTMESSAGES RFC 5259 MAXCONVERTPARTS RFC 5259 NOUPDATE RFC 5267元数据RFC 5464通知溢出RFC 5465 BADEVENT RFC 5465未定义过滤器RFC 5466不可用的RFC 5530身份验证失败的RFC 5530授权失败的RFC 5530"
    },
    {
      "indent": 6,
      "text": "EXPIRED RFC 5530 PRIVACYREQUIRED RFC 5530 CONTACTADMIN RFC 5530 NOPERM RFC 5530 INUSE RFC 5530 EXPUNGEISSUED RFC 5530 CORRUPTION RFC 5530 SERVERBUG RFC 5530 CLIENTBUG RFC 5530 CANNOT RFC 5530 LIMIT RFC 5530 OVERQUOTA RFC 5530 ALREADYEXISTS RFC 5530 NONEXISTENT RFC 5530",
      "zh-CHS": "过期的RFC 5530 Privacy Required RFC 5530 CONTACTADMIN RFC 5530 NOPERM RFC 5530 INUSE RFC 5530 EXPUNGEISSUED RFC 5530 Corrupt RFC 5530 SERVERBUG RFC 5530 CLIENTBUG RFC 5530无法RFC 5530 LIMIT RFC 5530 OVERQUOTA RFC 5530已存在RFC 5530不存在RFC 5530"
    },
    {
      "indent": 3,
      "text": "The new registry can be extended by sending a registration request to IANA. IANA will forward this request to a Designated Expert, appointed by the responsible IESG Area Director, CCing it to the IMAP Extensions mailing list at <ietf-imapext@imc.org> (or a successor designated by the Area Director). After either allowing 30 days for community input on the IMAP Extensions mailing list or a successful IETF Last Call, the expert will determine the appropriateness of the registration request and either approve or disapprove the request by sending a notice of the decision to the requestor, CCing the IMAP Extensions mailing list and IANA. A denial notice must be justified by an explanation, and, in cases where it is possible, concrete suggestions on how the request can be modified so as to become acceptable should be provided.",
      "zh-CHS": "可以通过向IANA发送注册请求来扩展新注册中心。IANA将此请求转发给IESG区域负责人任命的指定专家，并将其发送到<ietf的IMAP扩展邮件列表中-imapext@imc.org>（或区域总监指定的继任者）。在允许社区在IMAP扩展邮件列表上输入30天或IETF最后一次呼叫成功后，专家将确定注册请求的适当性，并根据IMAP扩展邮件列表和IANA向请求者发送决定通知，批准或不批准该请求。拒绝通知必须以解释为理由，在可能的情况下，应提供具体建议，说明如何修改请求以使其成为可接受的请求。"
    },
    {
      "indent": 3,
      "text": "For each response code, the registry contains a list of relevant RFCs that describe (or extend) the response code and an optional response code status description, such as \"obsolete\" or \"reserved to prevent collision with deployed software\". (Note that in the latter case, the RFC number can be missing.) Presence of the response code status description means that the corresponding response code is NOT RECOMMENDED for widespread use.",
      "zh-CHS": "对于每个响应代码，注册表包含描述（或扩展）响应代码的相关RFC列表和可选响应代码状态描述，如“过时”或“保留以防止与已部署软件冲突”。（注意，在后一种情况下，RFC编号可能会丢失。）响应代码状态描述的存在意味着不建议广泛使用相应的响应代码。"
    },
    {
      "indent": 3,
      "text": "The intention is that any future allocation will be accompanied by a published RFC (including direct submissions to the RFC Editor). But in order to allow for the allocation of values prior to the RFC being approved for publication, the Designated Expert can approve allocations once it seems clear that an RFC will be published, for example, before requesting IETF LC for the document.",
      "zh-CHS": "其目的是，未来的任何分配都将附带一份已发布的RFC（包括直接提交给RFC编辑）。但是，为了允许在批准发布RFC之前分配值，一旦确定RFC将发布，指定专家可以批准分配，例如，在请求文件的IETF LC之前。"
    },
    {
      "indent": 3,
      "text": "The Designated Expert can also approve registrations for response codes used in deployed software when no RFC exists. Such registrations must be marked as \"reserved to prevent collision with deployed software\".",
      "zh-CHS": "当不存在RFC时，指定专家还可以批准已部署软件中使用的响应代码的注册。此类注册必须标记为“保留以防止与已部署软件发生冲突”。"
    },
    {
      "indent": 3,
      "text": "Response code registrations may not be deleted; response codes that are no longer believed appropriate for use (for example, if there is a problem with the syntax of said response code or if the specification describing it was moved to Historic) should be marked \"obsolete\" in the registry, clearly marking the lists published by IANA.",
      "zh-CHS": "不得删除响应代码注册；不再被认为适合使用的响应代码（例如，如果所述响应代码的语法有问题，或者如果描述该代码的规范被移至历史规范）应在注册表中标记为“过时”，明确标记IANA发布的列表。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "Peter Coates, Mark Crispin, Philip Guenther, Alexey Melnikov, Ken Murchison, Chris Newman, Timo Sirainen, Philip Van Hoof, Dale Wiggins, and Sarah Wilkin helped with this document.",
      "zh-CHS": "Peter Coates、Mark Crispin、Philip Guenther、Alexey Melnikov、Ken Murchison、Chris Newman、Timo Sirainen、Philip Van Hoof、Dale Wiggins和Sarah Wilkin帮助编写了这份文件。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC3501] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, March 2003.",
      "zh-CHS": "[RFC3501]Crispin，M.，“互联网消息访问协议-版本4rev1”，RFC 35012003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "zh-CHS": "[RFC5234]Crocker，D.，Ed.，和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，2008年1月。"
    },
    {
      "indent": 0,
      "text": "9. Informative References",
      "section_title": true,
      "zh-CHS": "9. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2087] Myers, J., \"IMAP4 QUOTA extension\", RFC 2087, January 1997.",
      "zh-CHS": "[RFC2087]迈尔斯，J.，“IMAP4配额延长”，RFC2087，1997年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2180] Gahrns, M., \"IMAP4 Multi-Accessed Mailbox Practice\", RFC 2180, July 1997.",
      "zh-CHS": "[RFC2180]Gahrns，M.，“IMAP4多址邮箱实践”，RFC21801997年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4314] Melnikov, A., \"IMAP4 Access Control List (ACL) Extension\", RFC 4314, December 2005.",
      "zh-CHS": "[RFC4314]Melnikov，A.，“IMAP4访问控制列表（ACL）扩展”，RFC 4314，2005年12月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Arnt Gulbrandsen Oryx Mail Systems GmbH Schweppermannstr. 8 D-81671 Muenchen Germany",
      "zh-CHS": "Arnt Gulbrandsen Oryx邮件系统有限公司Schweppermannstr。德国慕尼黑8D-81671"
    },
    {
      "indent": 3,
      "text": "Fax: +49 89 4502 9758\nEMail: arnt@oryx.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}