{
  "title": {
    "text": "RFC 5149: Service Selection for Mobile IPv6",
    "zh-CHS": "RFC 5149"
  },
  "number": 5149,
  "created_at": "2021-11-10 07:47:49.670493+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        J. Korhonen\nRequest for Comments: 5149                                    U. Nilsson\nCategory: Informational                                      TeliaSonera\n                                                          V. Devarapalli\n                                                                  Azaire\n                                                           February 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Service Selection for Mobile IPv6",
      "zh-CHS": "移动IPv6的服务选择"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "In some Mobile IPv6 deployments, identifying the mobile node or the mobility service subscriber is not enough to distinguish between multiple services possibly provisioned to the said mobile node and its mobility service subscription. A capability to specify different services in addition to the mobile node identity can be leveraged to provide flexibility for mobility service providers on provisioning multiple services to one mobility service subscription. This document describes a Service Selection Mobility Option for both conventional Mobile IPv6 and Proxy Mobile IPv6 that is intended to assist home agents to make a specific service selection for the mobility service subscription during the binding registration procedure.",
      "zh-CHS": "在一些移动IPv6部署中，识别移动节点或移动服务订户不足以区分可能提供给所述移动节点的多个服务及其移动服务订阅。除了移动节点标识之外，还可以利用指定不同服务的能力来为移动服务提供商提供灵活性，以便将多个服务提供给一个移动服务订阅。本文档描述了传统移动IPv6和代理移动IPv6的服务选择移动选项，旨在帮助归属代理在绑定注册过程中为移动服务订阅进行特定服务选择。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Requirements  . . . . . . . . . . . . . . . . . . . . . . . . . 3\n3.  Service Selection Mobility Option . . . . . . . . . . . . . . . 3\n4.  Processing Considerations . . . . . . . . . . . . . . . . . . . 4\n  4.1.  Mobile Node Considerations  . . . . . . . . . . . . . . . . 4\n  4.2.  Home Agent Considerations . . . . . . . . . . . . . . . . . 5\n  4.3.  Correspondent Node Considerations . . . . . . . . . . . . . 5\n5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 6\n7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 6\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . . . 6\n  8.2.  Informative References  . . . . . . . . . . . . . . . . . . 7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Mobile IPv6 [2] can identify mobile nodes in various ways, including home addresses [2], Network Access Identifiers (NAIs) [6][7], and credentials suitable for the Internet Key Exchange Protocol version 2 (IKEv2) [10]. In some Mobile IPv6 deployments, identifying the mobile node or the mobility service subscriber via a Proxy Mobile IPv6 client [5] (hereafter, the mobile node and the Proxy Mobile IPv6 client are used interchangeably) is not enough to distinguish between multiple services possibly provisioned to the said mobile node and its mobility service subscription.",
      "zh-CHS": "移动IPv6[2]可以以各种方式识别移动节点，包括家庭地址[2]、网络访问标识符（NAI）[6][7]和适用于Internet密钥交换协议版本2（IKEv2）[10]的凭据。在一些移动IPv6部署中，通过代理移动IPv6客户端识别移动节点或移动服务订户[5]（以下，移动节点和代理移动IPv6客户端可互换使用）不足以区分可能提供给所述移动节点的多个服务及其移动服务订阅。"
    },
    {
      "indent": 3,
      "text": "The capability to specify different services in addition to the mobile node identity can be leveraged to provide flexibility for mobility service providers to provide multiple services within the same mobility service subscription. For example:",
      "zh-CHS": "除了移动节点标识之外，还可以利用指定不同服务的能力来为移动服务提供商提供灵活性，以便在相同的移动服务订阅中提供多个服务。例如："
    },
    {
      "indent": 3,
      "text": "o Provide an enterprise data access for which the mobility service provider hosts connectivity and mobility services on behalf of the enterprise.",
      "zh-CHS": "o 提供企业数据访问，移动服务提供商代表企业为其托管连接和移动服务。"
    },
    {
      "indent": 3,
      "text": "o Provide access to service domains that are otherwise not accessible from public networks because of some mobility service provider's business reasons.",
      "zh-CHS": "o 提供对由于某些移动服务提供商的业务原因而无法从公共网络访问的服务域的访问。"
    },
    {
      "indent": 3,
      "text": "o Provide simultaneous access to different service domains that are separated based on policies of the mobility service provider.",
      "zh-CHS": "o 提供对基于移动服务提供商的策略分离的不同服务域的同时访问。"
    },
    {
      "indent": 3,
      "text": "o Enable easier policy and quality of service assignment for mobility service providers based on the subscribed services.",
      "zh-CHS": "o 基于订阅的服务，为移动服务提供商实现更轻松的策略和服务质量分配。"
    },
    {
      "indent": 3,
      "text": "o In the absence of a specifically indicated service, the home agent MUST act as if the default service, plain Internet access, had been requested. There is no absolute requirement that this default service be allowed to all subscribers, but it is highly RECOMMENDED in order to avoid having normal subscribers employ operator-specific configuration values in order to get basic service.",
      "zh-CHS": "o 在没有特别指明的服务的情况下，归属代理必须像请求了默认服务（普通Internet访问）一样工作。没有绝对要求允许所有订阅者使用此默认服务，但强烈建议使用此默认服务，以避免普通订阅者为了获得基本服务而使用特定于运营商的配置值。"
    },
    {
      "indent": 3,
      "text": "This document describes a Service Selection Mobility Option for Mobile IPv6 that is intended to assist home agents to make specific service selections for the mobility service subscription during the binding registration procedure. The service selection may affect home agent routing decisions, Home Address or Home Network Prefix assignment policies, firewall settings, and security policies. The Service Selection option should be used in every Binding Update that makes a new registration to the home agent.",
      "zh-CHS": "本文档描述了移动IPv6的服务选择移动选项，旨在帮助归属代理在绑定注册过程中为移动服务订阅做出特定的服务选择。服务选择可能会影响归属代理路由决策、归属地址或归属网络前缀分配策略、防火墙设置和安全策略。服务选择选项应在每次向归属代理进行新注册的绑定更新中使用。"
    },
    {
      "indent": 3,
      "text": "Some of the potential use-cases were listed earlier in this section. The general aim is better manageability of services and service provisioning from the point of view of both operators and service providers. However, it should be understood that there are potential deployment possibilities where selecting a certain service may restrict simultaneous access to other services from a user's point of view. For example, services may be located in different administrative domains or external customer networks that practice excessive filtering of inbound and outbound traffic.",
      "zh-CHS": "本节前面列出了一些潜在用例。总体目标是从运营商和服务提供商的角度来看，提高服务和服务供应的可管理性。然而，应当理解，存在潜在的部署可能性，其中从用户的角度选择特定服务可能会限制对其他服务的同时访问。例如，服务可能位于对入站和出站流量进行过度过滤的不同管理域或外部客户网络中。"
    },
    {
      "indent": 0,
      "text": "2. Requirements",
      "section_title": true,
      "zh-CHS": "2. 要求"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [1].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[1]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Service Selection Mobility Option",
      "section_title": true,
      "zh-CHS": "3. 服务选择移动选项"
    },
    {
      "indent": 3,
      "text": "At most one Service Selection Mobility Option MAY be included in any Binding Update message. If the Binding Update message includes any authorization-related options (such as the Binding Authorization Data option [2]) or authentication related options (such as the Mobility Message Authentication option [8]), then the Service Selection option MUST appear before any mobility message authorization- or authentication-related options.",
      "zh-CHS": "在任何绑定更新消息中最多可以包括一个服务选择移动选项。如果绑定更新消息包括任何与授权相关的选项（例如绑定授权数据选项[2]）或与身份验证相关的选项（例如移动消息身份验证选项[8]），则服务选择选项必须出现在任何移动消息授权或与身份验证相关的选项之前。"
    },
    {
      "indent": 3,
      "text": "The Service Selection option SHOULD NOT be sent to a correspondent node. The mobile node cannot assume that the correspondent node has any knowledge about a specific service selection made between the mobile node and the home agent.",
      "zh-CHS": "服务选择选项不应发送到对应节点。移动节点不能假定对应节点具有关于在移动节点和归属代理之间进行的特定服务选择的任何知识。"
    },
    {
      "indent": 3,
      "text": "The Service Selection option has no alignment requirement as such.",
      "zh-CHS": "服务选择选项本身没有对齐要求。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                |  Type = 20    |   Length      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Identifier...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "Service Selection Mobility Option",
      "zh-CHS": "服务选择移动选项"
    },
    {
      "indent": 3,
      "text": "o Type: 8-bit identifier set to 20 of the type of the skipable mobility option.",
      "zh-CHS": "o 类型：8位标识符，设置为可滑动移动选项类型的20位。"
    },
    {
      "indent": 3,
      "text": "o Length: 8-bit unsigned integer, representing the length of the Service Selection Mobility Option in octets, excluding the Option Type and Option Length fields. A value of zero (0) is not allowed.",
      "zh-CHS": "o 长度：8位无符号整数，以八位字节表示服务选择移动选项的长度，不包括选项类型和选项长度字段。不允许值为零（0）。"
    },
    {
      "indent": 3,
      "text": "o Identifier: A variable-length encoded service identifier string used to identify the requested service. The identifier string length is between 1 and 255 octets. This specification allows international identifier strings that are based on the use of Unicode characters, encoded as UTF-8 [3], and formatted using Normalization Form KC (NFKC) as specified in [4].",
      "zh-CHS": "o 标识符：用于标识请求服务的可变长度编码服务标识符字符串。标识符字符串长度介于1到255个八位字节之间。本规范允许使用基于Unicode字符的国际标识符字符串，编码为UTF-8[3]，并使用[4]中规定的规范化格式KC（NFKC）进行格式化。"
    },
    {
      "indent": 6,
      "text": "'ims', 'voip', and 'voip.companyxyz.example.com' are valid examples of Service Selection option Identifiers. At minimum, the Identifier MUST be unique among the home agents to which the mobile node is authorized to register.",
      "zh-CHS": "“ims”、“voip”和“voip.companyxyz.example.com”是服务选择选项标识符的有效示例。至少，该标识符在移动节点被授权注册到的归属代理中必须是唯一的。"
    },
    {
      "indent": 0,
      "text": "4. Processing Considerations",
      "section_title": true,
      "zh-CHS": "4. 处理注意事项"
    },
    {
      "indent": 0,
      "text": "4.1. Mobile Node Considerations",
      "section_title": true,
      "zh-CHS": "4.1. 移动节点注意事项"
    },
    {
      "indent": 3,
      "text": "A mobile node or a Proxy Mobile IPv6 client MAY include, at most, one Service Selection Mobility Option into a Binding Update message. The option is used to identify the service to be associated with the binding registration and SHOULD only be included into the initial Binding Update message sent to a home agent. If the mobile node wishes to change the selected service, it is RECOMMENDED that the mobile node de-register the existing binding with the home agent before proceeding with a binding registration for a different service. The provisioning of the service identifiers to the mobile node or to the Proxy Mobile IPv6 client is out of the scope of this specification.",
      "zh-CHS": "移动节点或代理移动IPv6客户端最多可以在绑定更新消息中包括一个服务选择移动选项。该选项用于标识与绑定注册关联的服务，并且仅应包含在发送给归属代理的初始绑定更新消息中。如果移动节点希望更改所选服务，建议移动节点在继续为不同服务进行绑定注册之前，先向归属代理注销现有绑定。向移动节点或代理移动IPv6客户端提供服务标识符超出了本规范的范围。"
    },
    {
      "indent": 3,
      "text": "The placement of the Service Selection option is as follows: when present, this option MUST appear after the Mobile Node-Network Access Identifier (MN-NAI) option, if the MN-NAI option is present, and before any authorization- and authentication-related options. The Service Selection option can be used with any mobile node identification method such as a home address, an MN-NAI, and credentials suitable for IKEv2.",
      "zh-CHS": "服务选择选项的位置如下：当存在时，此选项必须出现在移动节点网络访问标识符（MN-NAI）选项之后（如果存在MN-NAI选项），以及任何授权和认证相关选项之前。服务选择选项可与任何移动节点标识方法一起使用，例如家庭地址、MN-NAI和适合IKEv2的凭证。"
    },
    {
      "indent": 3,
      "text": "If the mobile node receives a Binding Acknowledgement with a Status Code set to SERVICE_AUTHORIZATION_FAILED and the mobile node has an existing binding with the Home Address or the Home Network Prefix used in the failed Binding Update message, the mobile node MUST",
      "zh-CHS": "如果移动节点接收到状态代码设置为SERVICE_AUTHORIZATION_FAILED的绑定确认，并且移动节点具有与失败绑定更新消息中使用的家庭地址或家庭网络前缀的现有绑定，则移动节点必须"
    },
    {
      "indent": 3,
      "text": "delete the existing binding. If there is no existing binding, the mobile node proceeds as with any failed initial binding registration.",
      "zh-CHS": "删除现有绑定。如果没有现有绑定，移动节点将继续进行任何失败的初始绑定注册。"
    },
    {
      "indent": 0,
      "text": "4.2. Home Agent Considerations",
      "section_title": true,
      "zh-CHS": "4.2. 国内代理考虑事项"
    },
    {
      "indent": 3,
      "text": "Upon receiving a Binding Update message with a Service Selection option, the home agent authenticates and authorizes the mobile node. If the home agent supports the Service Selection, it MUST also verify that the mobile node is authorized for the service it included in the Service Selection option. The services the mobile node is authorized for SHOULD be part of the general mobile node subscription profile. If the mobile node is not authorized for the service, the home agent MUST deny the registration and send a Binding Acknowledgement with a Status Code set to SERVICE_AUTHORIZATION_FAILED (151).",
      "zh-CHS": "在接收到具有服务选择选项的绑定更新消息时，归属代理认证和授权移动节点。如果归属代理支持服务选择，则它还必须验证移动节点是否被授权使用服务选择选项中包含的服务。移动节点被授权使用的服务应该是通用移动节点订阅配置文件的一部分。如果移动节点未被授权用于该服务，则归属代理必须拒绝该注册并发送具有设置为“服务\\授权\\失败”的状态码的绑定确认（151）。"
    },
    {
      "indent": 3,
      "text": "The Service Selection option is used to assist the authorization and identifies a specific service that is to be authorized. The Service Selection option MAY also affect the Home Address or the Home Network Prefix allocation when, for example, used with the MN-NAI option. For example, for the same NAI there MAY be different Home Addresses or Home Network Prefixes depending on the identified service. Furthermore, the Service Selection option MAY also affect the routing of the outbound IP packets in the home agent depending on the selected service. The home agent MAY also apply different policy or quality of service treatment to traffic flows based on the selected service.",
      "zh-CHS": "服务选择选项用于协助授权，并标识要授权的特定服务。例如，当与MN-NAI选项一起使用时，服务选择选项还可能影响归属地址或归属网络前缀分配。例如，对于同一NAI，根据所识别的服务，可能存在不同的家庭地址或家庭网络前缀。此外，服务选择选项还可根据所选服务影响归属代理中出站IP分组的路由。归属代理还可以基于所选服务对业务流应用不同的策略或服务质量处理。"
    },
    {
      "indent": 3,
      "text": "If the newly arrived Binding Update message with a Service Selection option indicates a change in the selected service, then the home agent MUST re-authorize the mobile node. Depending on the home agent policies, the services policies, Home Address or Home Network Prefix allocation policies, and the subscription policies, the home agent may or may not be able to authorize the mobile node to the new service. For example, the existing service and the new service could require different Home Network Prefixes. If the authorization fails, then the home agent MUST deny the registration, delete any binding with the existing Home Address or Home Network Prefix, and send a Binding Acknowledgement with a Status Code set to SERVICE_AUTHORIZATION_FAILED (151).",
      "zh-CHS": "如果带有服务选择选项的新到达的绑定更新消息指示所选服务中的更改，则归属代理必须重新授权移动节点。根据归属代理策略、服务策略、归属地址或归属网络前缀分配策略以及订阅策略，归属代理可能能够也可能不能将移动节点授权给新服务。例如，现有服务和新服务可能需要不同的家庭网络前缀。如果授权失败，则归属代理必须拒绝注册，删除与现有归属地址或归属网络前缀的任何绑定，并发送一个绑定确认，状态代码设置为SERVICE_authorization_FAILED（151）。"
    },
    {
      "indent": 0,
      "text": "4.3. Correspondent Node Considerations",
      "section_title": true,
      "zh-CHS": "4.3. 对应节点注意事项"
    },
    {
      "indent": 3,
      "text": "Unless the correspondent node and the home agent share the same knowledge about mobility services, the Service Selection option is more or less useless information to the correspondent node. The correspondent node SHOULD silently ignore the Service Selection option in this case.",
      "zh-CHS": "除非对应节点和归属代理共享关于移动服务的相同知识，否则服务选择选项对于对应节点来说或多或少是无用的信息。在这种情况下，对应节点应该以静默方式忽略服务选择选项。"
    },
    {
      "indent": 3,
      "text": "There are deployment cases where the home agent and a correspondent node, for example, belong to the same administrative domain. In this case, it is possible that the correspondent node shares the same knowledge of the services as the home agent. Therefore, the correspondent node is, for example, able to provide service-based traffic handling to mobile nodes.",
      "zh-CHS": "例如，在部署情况下，归属代理和对应节点属于同一管理域。在这种情况下，对应节点可能与归属代理共享相同的服务知识。因此，对应节点例如能够向移动节点提供基于服务的业务处理。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The protection for the Service Selection Mobility Option depends on the service that is being identified and eventually selected. If the service selection information should not be revealed on the wire, Binding Updates and Binding Acknowledgements should use Encapsulating Security Payload (ESP) [9] in transport mode with a non-null encryption transform to provide message confidentiality.",
      "zh-CHS": "服务选择移动选项的保护取决于正在识别和最终选择的服务。如果服务选择信息不应在线路上显示，则绑定更新和绑定确认应使用传输模式下的封装安全有效负载（ESP）[9]和非空加密转换来提供消息机密性。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "A new Mobile IPv6 Mobility Option type has been assigned for the following new mobility option described in Section 3:",
      "zh-CHS": "已为第3节中描述的以下新移动选项分配了新的移动IPv6移动选项类型："
    },
    {
      "indent": 7,
      "text": "Service Selection Mobility Option is set to 20",
      "zh-CHS": "服务选择移动选项设置为20"
    },
    {
      "indent": 3,
      "text": "A new Mobile IPv6 registration denied by home agent Status Code has been assigned. The Status Code was allocated from the range 128-255:",
      "zh-CHS": "已分配由归属代理状态代码拒绝的新移动IPv6注册。状态代码的分配范围为128-255："
    },
    {
      "indent": 7,
      "text": "SERVICE_AUTHORIZATION_FAILED is set to 151",
      "zh-CHS": "服务\\授权\\失败设置为151"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "Jouni Korhonen would like to thank the TEKES MERCoNe project for providing funding to work on this document. The authors would like to thank Jari Arkko for his thorough review.",
      "zh-CHS": "Jouni Korhonen感谢TEKES MERCoNe项目为编写本文件提供资金。作者要感谢Jari Arkko的全面评论。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Johnson, D., Perkins, C., and J. Arkko, \"Mobility Support in IPv6\", RFC 3775, June 2004.",
      "zh-CHS": "[2] Johnson，D.，Perkins，C.，和J.Arkko，“IPv6中的移动支持”，RFC 37752004年6月。"
    },
    {
      "indent": 3,
      "text": "[3] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "zh-CHS": "[3] Yergeau，F.，“UTF-8，ISO 10646的转换格式”，STD 63，RFC 3629，2003年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Davis, M. and M. Duerst, \"Unicode Standard Annex #15; Unicode Normalization Forms\", Unicode 5.0.0, October 2006.",
      "zh-CHS": "[4] Davis，M.和M.Duerst，“Unicode标准附录#15；Unicode规范化格式”，Unicode 5.0.0，2006年10月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[5] Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", Work in Progress, December 2007.",
      "zh-CHS": "[5] Gundavelli，S.，Leung，K.，Devarapalli，V.，Chowdhury，K.，和B.Patil，“代理移动IPv6”，正在进行的工作，2007年12月。"
    },
    {
      "indent": 3,
      "text": "[6] Aboba, B., Beadles, M., Arkko, J., and P. Eronen, \"The Network Access Identifier\", RFC 4282, December 2005.",
      "zh-CHS": "[6] Aboba，B.，Beadles，M.，Arkko，J.，和P.Eronen，“网络接入标识符”，RFC 42822005年12月。"
    },
    {
      "indent": 3,
      "text": "[7] Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury, \"Mobile Node Identifier Option for Mobile IPv6 (MIPv6)\", RFC 4283, November 2005.",
      "zh-CHS": "[7] Patel，A.，Leung，K.，Khalil，M.，Akhtar，H.，和K.Chowdhury，“移动IPv6的移动节点标识符选项（MIPv6）”，RFC 42832005年11月。"
    },
    {
      "indent": 3,
      "text": "[8] Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury, \"Authentication Protocol for Mobile IPv6\", RFC 4285, January 2006.",
      "zh-CHS": "[8] Patel，A.，Leung，K.，Khalil，M.，Akhtar，H.，和K.Chowdhury，“移动IPv6认证协议”，RFC 42852006年1月。"
    },
    {
      "indent": 3,
      "text": "[9] Kent, S., \"IP Encapsulating Security Payload (ESP)\", RFC 4303, December 2005.",
      "zh-CHS": "[9] Kent，S.，“IP封装安全有效载荷（ESP）”，RFC 4303，2005年12月。"
    },
    {
      "indent": 3,
      "text": "[10] Devarapalli, V. and F. Dupont, \"Mobile IPv6 Operation with IKEv2 and the Revised IPsec Architecture\", RFC 4877, April 2007.",
      "zh-CHS": "[10] Devarapalli，V.和F.Dupont，“使用IKEv2的移动IPv6操作和修订的IPsec架构”，RFC 4877，2007年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Jouni Korhonen TeliaSonera Corporation P.O. Box 970 FIN-00051 Sonera Finland",
      "zh-CHS": "Jouni Korhonen TeliaSonera Corporation邮政信箱970 FIN-00051芬兰索内拉"
    },
    {
      "indent": 3,
      "text": "EMail: jouni.korhonen@teliasonera.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Ulf Nilsson TeliaSonera Corporation Marbackagatan 11 S-123 86 Farsta Sweden",
      "zh-CHS": "Ulf Nilsson TeliaSonera Corporation Marbackagatan 11 S-123 86瑞典法尔斯塔"
    },
    {
      "indent": 3,
      "text": "EMail: ulf.s.nilsson@teliasonera.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Vijay Devarapalli Azaire Networks 4800 Great America Pkwy Santa Clara, CA 95054 USA",
      "zh-CHS": "Vijay Devarapalli Azaire Networks 4800大美洲圣克拉拉Pkwy，加利福尼亚州，美国95054"
    },
    {
      "indent": 3,
      "text": "EMail: vijay.devarapalli@azairenet.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "zh-CHS": "版权所有（C）IETF信托基金（2008年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    }
  ]
}