{
  "title": {
    "text": "RFC 5301: Dynamic Hostname Exchange Mechanism for IS-IS",
    "zh-CHS": "RFC 5301"
  },
  "number": 5301,
  "created_at": "2021-11-10 19:55:14.298903+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       D. McPherson\nRequest for Comments: 5301                                Arbor Networks\nObsoletes: 2763                                                  N. Shen\nCategory: Standards Track                                  Cisco Systems\n                                                            October 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Dynamic Hostname Exchange Mechanism for IS-IS",
      "zh-CHS": "IS-IS的动态主机名交换机制"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "RFC 2763 defined a simple and dynamic mechanism for routers running IS-IS to learn about symbolic hostnames. RFC 2763 defined a new TLV that allows the IS-IS routers to flood their name-to-systemID mapping information across the IS-IS network.",
      "zh-CHS": "RFC2763为运行IS-IS的路由器定义了一种简单而动态的机制，以了解符号主机名。RFC 2763定义了一个新的TLV，该TLV允许IS-IS路由器在IS-IS网络上将其名称泛洪到systemID映射信息。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 2763. This document moves the capability provided by RFC 2763 to the Standards Track.",
      "zh-CHS": "本文件淘汰了RFC 2763。本文档将RFC 2763提供的功能转移到标准轨道。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Specification of Requirements ..............................2\n2. Possible Solutions ..............................................2\n3. Dynamic Hostname TLV ............................................3\n4. Implementation ..................................................4\n5. Security Considerations .........................................4\n6. Acknowledgments .................................................4\n7. IANA Considerations .............................................4\n8. Informative References ..........................................4",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "IS-IS uses a variable 1-8 byte system ID (normally 6 bytes) to represent a node in the network. For management and operation reasons, network operators need to check the status of IS-IS adjacencies, entries in the routing table, and the content of the IS-IS link state database. It is obvious that, when looking at diagnostics information, hexadecimal representations of system IDs and Link State Protocol Data Unit (LSP) identifiers are less clear than symbolic names.",
      "zh-CHS": "IS-IS使用1-8字节的可变系统ID（通常为6字节）来表示网络中的节点。出于管理和操作原因，网络运营商需要检查IS-IS邻接的状态、路由表中的条目以及IS-IS链路状态数据库的内容。很明显，在查看诊断信息时，系统ID和链路状态协议数据单元（LSP）标识符的十六进制表示形式不如符号名称清晰。"
    },
    {
      "indent": 3,
      "text": "One way to overcome this problem is to define a name-to-systemID mapping on a router. This mapping can be used bidirectionally, e.g., to find symbolic names for system IDs and to find system IDs for symbolic names. One way to build this table of mappings is by static definitions. Among network administrators who use IS-IS as their IGP, it is current practice to define such static mappings.",
      "zh-CHS": "克服此问题的一种方法是在路由器上定义名称到systemID的映射。此映射可以双向使用，例如，查找系统ID的符号名和查找符号名的系统ID。构建此映射表的一种方法是通过静态定义。在使用IS-IS作为IGP的网络管理员中，目前的做法是定义此类静态映射。"
    },
    {
      "indent": 3,
      "text": "Thus, every router has to maintain a statically-configured table with mappings between router names and system IDs. These tables need to contain the names and system IDs of all routers in the network, and must be modified each time an addition, deletion, or change occurs.",
      "zh-CHS": "因此，每个路由器都必须维护一个静态配置的表，其中包含路由器名称和系统ID之间的映射。这些表需要包含网络中所有路由器的名称和系统ID，并且必须在每次添加、删除或更改时进行修改。"
    },
    {
      "indent": 3,
      "text": "There are several ways one could build such a table. One is via static configurations. Another scheme that could be implemented is via DNS lookups. In this document, we provide a third solution, which in wide-scale implementation and deployment has proven to be easier and more manageable than static mapping or DNS schemes.",
      "zh-CHS": "有几种方法可以建立这样一个表。一种是通过静态配置。另一个可以实现的方案是通过DNS查找。在本文中，我们提供了第三种解决方案，在大规模实施和部署中，它已被证明比静态映射或DNS方案更容易管理。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification of Requirements",
      "section_title": true,
      "zh-CHS": "1.1. 需求说明"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Possible Solutions",
      "section_title": true,
      "zh-CHS": "2. 可能的解决方案"
    },
    {
      "indent": 3,
      "text": "The obvious drawback of static configuration of mappings is the issue of scalability and maintainability. The network operators have to maintain the name tables. They have to maintain an entry in the table for every router in the network, on every router in the network. The effort to create and maintain these static tables grows with the total number of routers on the network. Changing the name or system ID of one router, or adding a new router will affect the configurations of all the other routers on the network. This will make it very likely that those static tables are outdated.",
      "zh-CHS": "映射的静态配置的明显缺点是可伸缩性和可维护性问题。网络运营商必须维护名称表。他们必须在表中为网络中的每个路由器、网络中的每个路由器维护一个条目。创建和维护这些静态表的工作量随着网络上路由器的总数的增加而增加。更改一个路由器的名称或系统ID，或添加新路由器将影响网络上所有其他路由器的配置。这将使这些静态表很可能已经过时。"
    },
    {
      "indent": 3,
      "text": "Having one table that can be updated in a centralized place would be helpful. One could imagine using the DNS system for this. A drawback is that during the time of network problems, the response time of DNS services might not be satisfactory or the DNS services might not even be available. Another possible drawback might be the added complexity of DNS. Also, some DNS implementations might not support A and PTR records for Connection Network Service (CLNS) Network Service Access Points (NSAPs).",
      "zh-CHS": "有一个可以在集中的地方更新的表会很有帮助。可以想象使用DNS系统来实现这一点。缺点是，在网络出现问题期间，DNS服务的响应时间可能不令人满意，或者DNS服务甚至可能不可用。另一个可能的缺点可能是DNS的复杂性增加。此外，某些DNS实现可能不支持连接网络服务（CLNS）网络服务访问点（NSAP）的A和PTR记录。"
    },
    {
      "indent": 3,
      "text": "A third way to build dynamic mappings would be to use the transport mechanism of the routing protocol itself to advertise symbolic names in IS-IS link-state PDUs. This document defines a new TLV that allows the IS-IS routers to include the name-to-systemID mapping data in their LSPs. This will allow simple and reliable transport of name mapping information across the IS-IS network.",
      "zh-CHS": "构建动态映射的第三种方法是使用路由协议本身的传输机制在IS-IS链路状态PDU中公布符号名。本文档定义了一个新的TLV，该TLV允许IS-IS路由器在其LSP中包含名称到systemID的映射数据。这将允许通过IS-IS网络简单可靠地传输名称映射信息。"
    },
    {
      "indent": 0,
      "text": "3. Dynamic Hostname TLV",
      "section_title": true,
      "zh-CHS": "3. 动态主机名TLV"
    },
    {
      "indent": 3,
      "text": "The Dynamic hostname TLV is defined here as TLV type 137.",
      "zh-CHS": "动态主机名TLV在这里定义为TLV类型137。"
    },
    {
      "indent": 9,
      "text": "Length - total length of the value field.",
      "zh-CHS": "Length—值字段的总长度。"
    },
    {
      "indent": 9,
      "text": "Value - a string of 1 to 255 bytes.",
      "zh-CHS": "值-1到255字节的字符串。"
    },
    {
      "indent": 3,
      "text": "The Dynamic hostname TLV is optional. This TLV may be present in any fragment of a non-pseudonode LSP. The value field identifies the symbolic name of the router originating the LSP. This symbolic name can be the FQDN for the router, it can be a subset of the FQDN, or it can be any string operators want to use for the router. The use of FQDN or a subset of it is strongly recommended. The content of this value is a domain name, see [RFC2181]. The string is not null-terminated. The system ID of this router can be derived from the LSP identifier.",
      "zh-CHS": "动态主机名TLV是可选的。该TLV可存在于非伪节点LSP的任何片段中。值字段标识发起LSP的路由器的符号名称。此符号名可以是路由器的FQDN，也可以是FQDN的子集，也可以是希望用于路由器的任何字符串运算符。强烈建议使用FQDN或其子集。此值的内容是域名，请参见[RFC2181]。字符串不是以null结尾的。此路由器的系统ID可以从LSP标识符派生。"
    },
    {
      "indent": 3,
      "text": "If this TLV is present in a pseudonode LSP, then it SHOULD NOT be interpreted as the DNS hostname of the router.",
      "zh-CHS": "如果此TLV存在于伪节点LSP中，则不应将其解释为路由器的DNS主机名。"
    },
    {
      "indent": 3,
      "text": "The Value field is encoded in 7-bit ASCII. If a user-interface for configuring or displaying this field permits Unicode characters, that user-interface is responsible for applying the ToASCII and/or ToUnicode algorithm as described in [RFC3490] to achieve the correct format for transmission or display.",
      "zh-CHS": "值字段以7位ASCII编码。如果用于配置或显示此字段的用户界面允许使用Unicode字符，则该用户界面负责应用[RFC3490]中所述的ToASCII和/或ToUnicode算法，以获得正确的传输或显示格式。"
    },
    {
      "indent": 0,
      "text": "4. Implementation",
      "section_title": true,
      "zh-CHS": "4. 实施"
    },
    {
      "indent": 3,
      "text": "The Dynamic hostname TLV is optional. When originating an LSP, a router may decide to include this TLV in its LSP. Upon receipt of an LSP with the Dynamic hostname TLV, a router may decide to ignore this TLV, or to install the symbolic name and system ID in its hostname mapping table for the IS-IS network.",
      "zh-CHS": "动态主机名TLV是可选的。当发起LSP时，路由器可决定将该TLV包括在其LSP中。在收到带有动态主机名TLV的LSP后，路由器可能会决定忽略此TLV，或者在IS-IS网络的主机名映射表中安装符号名和系统ID。"
    },
    {
      "indent": 3,
      "text": "A router may also optionally insert this TLV in its pseudonode LSP for the association of a symbolic name to a local LAN.",
      "zh-CHS": "路由器还可以选择性地将该TLV插入其伪节点LSP中，以便将符号名称关联到本地LAN。"
    },
    {
      "indent": 3,
      "text": "If a system receives a mapping for a name or system ID that is different from the mapping in the local cache, an implementation SHOULD replace the existing mapping with the latest information.",
      "zh-CHS": "如果系统接收到与本地缓存中的映射不同的名称或系统ID映射，则实现应使用最新信息替换现有映射。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Since the name-to-systemID mapping relies on information provided by the routers themselves, a misconfigured or compromised router can inject false mapping information. Thus, this information needs to be treated with suspicion when, for example, doing diagnostics about a suspected security incident.",
      "zh-CHS": "由于名称到系统ID的映射依赖于路由器本身提供的信息，因此配置错误或受损的路由器可能会注入错误的映射信息。因此，例如，在对可疑的安全事件进行诊断时，需要对这些信息进行怀疑。"
    },
    {
      "indent": 3,
      "text": "This document raises no other new security issues for IS-IS. Security issues with IS-IS are discussed in [RFC5304].",
      "zh-CHS": "本文档没有为IS-IS提出其他新的安全问题。IS-IS的安全问题在[RFC5304]中讨论。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The original efforts and corresponding acknowledgements provided in [RFC2763] have enabled this work. In particular, we'd like to acknowledge Henk Smit as an author of that document.",
      "zh-CHS": "[RFC2763]中提供的原始工作和相应的确认支持了这项工作。特别是，我们要感谢Henk Smit是该文档的作者。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document specifies TLV 137, \"Dynamic Name\". This TLV has already been allocated and reserved [RFC2763]. As such, no new actions are required on the part of IANA.",
      "zh-CHS": "本文件规定了TLV 137“动态名称”。此TLV已被分配和保留[RFC2763]。因此，IANA不需要采取新的行动。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "zh-CHS": "8. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2181] Elz, R. and R. Bush, \"Clarifications to the DNS Specification\", RFC 2181, July 1997.",
      "zh-CHS": "[RFC2181]Elz，R.和R.Bush，“DNS规范的澄清”，RFC 21811997年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC2763] Shen, N. and H. Smit, \"Dynamic Hostname Exchange Mechanism for IS-IS\", RFC 2763, February 2000.",
      "zh-CHS": "[RFC2763]Shen，N.和H.Smit，“IS-IS的动态主机名交换机制”，RFC2763，2000年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3490] Faltstrom, P., Hoffman, P., and A. Costello, \"Internationalizing Domain Names in Applications (IDNA)\", RFC 3490, March 2003.",
      "zh-CHS": "[RFC3490]Faltstrom，P.，Hoffman，P.，和A.Costello，“应用程序中的域名国际化（IDNA）”，RFC 34902003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, October 2008.",
      "zh-CHS": "[RFC5304]Li，T.和R.Atkinson，“IS-IS加密认证”，RFC 5304，2008年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Danny McPherson Arbor Networks, Inc. EMail: danny@arbor.net",
      "zh-CHS": "Danny McPherson Arbor Networks，Inc.电子邮件：danny@arbor.net"
    },
    {
      "indent": 3,
      "text": "Naiming Shen Cisco Systems, Inc. EMail: naiming@cisco.com",
      "zh-CHS": "沈乃明思科系统有限公司电子邮件：naiming@cisco.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "zh-CHS": "版权所有（C）IETF信托基金（2008年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    }
  ]
}