{
  "title": {
    "text": "RFC 5491: GEOPRIV Presence Information Data Format Location Object (PIDF-LO) Usage Clarification, Considerations, and Recommendations",
    "zh-CHS": "RFC 5491"
  },
  "number": 5491,
  "created_at": "2021-11-11 23:13:59.556206+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    J. Winterbottom\nRequest for Comments: 5491                                    M. Thomson\nUpdates: 4119                                         Andrew Corporation\nCategory: Standards Track                                  H. Tschofenig\n                                                  Nokia Siemens Networks\n                                                              March 2009",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "GEOPRIV Presence Information Data Format Location Object (PIDF-LO) Usage Clarification, Considerations, and Recommendations",
      "zh-CHS": "GEOPRIV状态信息数据格式位置对象（PIDF-LO）使用说明、注意事项和建议"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托在本文件出版之日生效的与IETF文件有关的法律规定的约束(http://trustee.ietf.org/license-info). 请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Presence Information Data Format Location Object (PIDF-LO) specification provides a flexible and versatile means to represent location information. There are, however, circumstances that arise when information needs to be constrained in how it is represented. In these circumstances, the range of options that need to be implemented are reduced. There is growing interest in being able to use location information contained in a PIDF-LO for routing applications. To allow successful interoperability between applications, location information needs to be normative and more tightly constrained than is currently specified in RFC 4119 (PIDF-LO). This document makes recommendations on how to constrain, represent, and interpret locations in a PIDF-LO. It further recommends a subset of Geography Markup Language (GML) 3.1.1 that is mandatory to implement by applications involved in location-based routing.",
      "zh-CHS": "存在信息数据格式位置对象（PIDF-LO）规范为表示位置信息提供了灵活和通用的方法。但是，在某些情况下，信息的表示方式需要加以限制。在这些情况下，需要实施的选项范围会缩小。能够使用PIDF-LO中包含的位置信息进行路由应用的兴趣越来越大。为了实现应用程序之间的成功互操作性，位置信息需要规范化，并且比RFC 4119（PIDF-LO）中当前规定的约束更严格。本文档就如何约束、表示和解释PIDF-LO中的位置提出了建议。它进一步推荐了地理标记语言（GML）3.1.1的子集，这是参与基于位置路由的应用程序必须实现的。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................3\n3. Using Location Information ......................................4\n   3.1. Single Civic Location Information ..........................7\n   3.2. Civic and Geospatial Location Information ..................7\n   3.3. Manual/Automatic Configuration of Location Information .....8\n   3.4. Multiple Location Objects in a Single PIDF-LO ..............9\n4. Geodetic Coordinate Representation .............................10\n5. Geodetic Shape Representation ..................................10\n   5.1. Polygon Restrictions ......................................12\n   5.2. Shape Examples ............................................13\n        5.2.1. Point ..............................................13\n        5.2.2. Polygon ............................................14\n        5.2.3. Circle .............................................17\n        5.2.4. Ellipse ............................................17\n        5.2.5. Arc Band ...........................................19\n        5.2.6. Sphere .............................................21\n        5.2.7. Ellipsoid ..........................................22\n        5.2.8. Prism ..............................................24\n6. Security Considerations ........................................26\n7. Acknowledgments ................................................26\n8. References .....................................................26\n   8.1. Normative References ......................................26\n   8.2. Informative References ....................................27",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The Presence Information Data Format Location Object (PIDF-LO) [RFC4119] is the recommended way of encoding location information and associated privacy policies. Location information in a PIDF-LO may be described in a geospatial manner based on a subset of Geography Markup Language (GML) 3.1.1 [OGC-GML3.1.1] or as civic location information [RFC5139]. A GML profile for expressing geodetic shapes in a PIDF-LO is described in [GeoShape]. Uses for the PIDF-LO are envisioned in the context of numerous location-based applications. This document makes recommendations for formats and conventions to make interoperability less problematic.",
      "zh-CHS": "状态信息数据格式位置对象（PIDF-LO）[RFC4119]是编码位置信息和相关隐私策略的推荐方式。PIDF-LO中的位置信息可以基于地理标记语言（GML）3.1.1[OGC-GML3.1.1]的子集或作为城市位置信息[RFC5139]以地理空间方式描述。用于在PIDF-LO中表示大地测量形状的GML剖面在[GeoShape]中描述。PIDF-LO的用途是在众多基于位置的应用程序的上下文中设想的。本文档对格式和约定提出了建议，以减少互操作性问题。"
    },
    {
      "indent": 3,
      "text": "The PIDF-LO provides a general presence format for representing location information, and permits specification of location information relating to a whole range of aspects of a Target. The general presence data model is described in [RFC4479] and caters to a presence document to describe different aspects of the reachability of a presentity. Continuing this approach, a presence document may contain several GEOPRIV objects that specify different locations and aspects of reachability relating to a presentity. This degree of flexibility is important, and recommendations in this document make no attempt to forbid the usage of a PIDF-LO in this manner. This document provides a specific set of guidelines for building presence documents when it is important to unambiguously convey exactly one location.",
      "zh-CHS": "PIDF-LO提供用于表示位置信息的通用存在格式，并允许指定与目标的整个方面相关的位置信息。一般存在数据模型在[RFC4479]中描述，并与存在文档相适应，以描述存在实体的可达性的不同方面。继续这种方法，状态文档可能包含多个GeoDriv对象，这些对象指定与状态实体相关的不同位置和可达性方面。这种程度的灵活性很重要，本文件中的建议并不试图禁止以这种方式使用PIDF-LO。本文档为构建状态文档提供了一套特定的指导原则，当明确传达一个位置非常重要时。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "The definition for \"Target\" is taken from [RFC3693].",
      "zh-CHS": "“目标”的定义取自[RFC3693]。"
    },
    {
      "indent": 3,
      "text": "In this document a \"discrete location\" is defined as a place, point, area, or volume in which a Target can be found.",
      "zh-CHS": "在本文件中，“离散位置”定义为可找到目标的位置、点、区域或体积。"
    },
    {
      "indent": 3,
      "text": "The term \"compound location\" is used to describe location information represented by a composite of both civic and geodetic information. An example of compound location might be a geodetic polygon describing the perimeter of a building and a civic element representing the floor in the building.",
      "zh-CHS": "术语“复合位置”用于描述由城市和大地测量信息的组合表示的位置信息。复合位置的一个示例可能是描述建筑周长的大地多边形和表示建筑中楼层的Civil图元。"
    },
    {
      "indent": 3,
      "text": "The term \"method\" in this document refers to the mechanism used to determine the location of a Target. This may be something employed by a location information server (LIS), or by the Target itself. It",
      "zh-CHS": "本文件中的术语“方法”指用于确定目标位置的机制。这可能是位置信息服务器（LIS）或目标本身使用的东西。信息技术"
    },
    {
      "indent": 3,
      "text": "specifically does not refer to the location configuration protocol (LCP) used to deliver location information either to the Target or the Recipient.",
      "zh-CHS": "具体而言，未提及用于向目标或接收方传递位置信息的位置配置协议（LCP）。"
    },
    {
      "indent": 3,
      "text": "The term \"source\" is used to refer to the LIS, node, or device from which a Recipient (Target or Third-Party) obtains location information.",
      "zh-CHS": "术语“源”用于指接收者（目标或第三方）从中获取位置信息的LIS、节点或设备。"
    },
    {
      "indent": 0,
      "text": "3. Using Location Information",
      "section_title": true,
      "zh-CHS": "3. 使用位置信息"
    },
    {
      "indent": 3,
      "text": "The PIDF format provides for an unbounded number of <tuple>, <device>, and <person> elements. Each of these elements contains a single <status> element that may contain more than one <geopriv> element as a child. Each <geopriv> element must contain at least the following two child elements: <location-info> element and <usage-rules> element. One or more elements containing location information are contained inside a <location-info> element.",
      "zh-CHS": "PIDF格式提供了无限数量的<tuple>、<device>和<person>元素。这些元素中的每一个都包含一个<status>元素，该元素可以作为子元素包含多个<geopriv>元素。每个<geopriv>元素必须至少包含以下两个子元素：<location info>元素和<usage rules>元素。包含位置信息的一个或多个元素包含在<location info>元素中。"
    },
    {
      "indent": 3,
      "text": "Hence, a single PIDF document may contain an arbitrary number of location objects, some or all of which may be contradictory or complementary. Graphically, the structure of a PIDF-LO document can be depicted as shown in Figure 1.",
      "zh-CHS": "因此，单个PIDF文档可能包含任意数量的位置对象，其中一些或所有对象可能相互矛盾或互补。从图形上看，PIDF-LO文档的结构如图1所示。"
    },
    {
      "indent": 3,
      "text": "<presence>\n   <tuple> -- #1\n      <status>\n         <geopriv> -- #1\n            <location-info>\n               location element #1\n               location element #2\n               ...\n               location element #n\n            <usage-rules>\n         </geopriv>\n         <geopriv> -- #2\n         <geopriv> -- #3\n         ...\n         <geopriv> -- #m\n      </status>\n   </tuple>\n   <device>\n      <geopriv> -- #1\n         <location-info>\n            location element(s)\n         <usage-rules>\n      </geopriv>\n      <geopriv> -- #2\n      ...\n      <geopriv> -- #m\n   </device>\n   <person>\n      <geopriv> -- #1\n         <location-info>\n            location element(s)\n         <usage-rules>\n      </geopriv>\n      <geopriv> -- #2\n      ...\n      <geopriv> -- #m\n   </person>\n   <tuple> -- #2\n   <device> -- #2\n   <person> -- #2\n   ...\n   <tuple> -- #o\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 1: Structure of a PIDF-LO Document",
      "zh-CHS": "图1:PIDF-LO文档的结构"
    },
    {
      "indent": 3,
      "text": "All of these potential sources and storage places for location lead to confusion for the generators, conveyors, and consumers of location information. Practical experience within the United States National Emergency Number Association (NENA) in trying to solve these ambiguities led to a set of conventions being adopted. These rules do not have any particular order, but should be followed by creators and consumers of location information contained in a PIDF-LO to ensure that a consistent interpretation of the data can be achieved.",
      "zh-CHS": "所有这些潜在的位置来源和存储位置都会导致位置信息的生成器、输送机和使用者产生混淆。美国国家紧急号码协会（NENA）在试图解决这些歧义方面的实际经验导致了一系列公约的通过。这些规则没有任何特定的顺序，但PIDF-LO中包含的位置信息的创建者和使用者应遵循这些规则，以确保能够对数据进行一致的解释。"
    },
    {
      "indent": 3,
      "text": "Rule #1: A <geopriv> element MUST describe a discrete location.",
      "zh-CHS": "规则#1:<geopriv>元素必须描述离散位置。"
    },
    {
      "indent": 3,
      "text": "Rule #2: Where a discrete location can be uniquely described in more than one way, each location description SHOULD reside in a separate <tuple>, <device>, or <person> element; only one geopriv element per tuple.",
      "zh-CHS": "规则#2：如果一个离散位置可以用多种方式唯一描述，则每个位置描述应位于单独的<tuple>、<device>或<person>元素中；每个元组只有一个geopriv元素。"
    },
    {
      "indent": 3,
      "text": "Rule #3: Providing more than one <geopriv> element in a single presence document (PIDF) MUST only be done if the locations refer to the same place or are put into different element types. For example, one location in a <tuple>, a second location in a <device> element, and a third location in a <person> element.",
      "zh-CHS": "规则#3：仅当位置指同一位置或放置在不同的元素类型中时，才能在单个存在文档（PIDF）中提供多个<geopriv>元素。例如，<tuple>中的一个位置、<device>元素中的第二个位置以及<person>元素中的第三个位置。"
    },
    {
      "indent": 9,
      "text": "This may occur if a Target's location is determined using a series of different techniques or if the Target wishes to represent her location as well as the location of her PC. In general, avoid putting more than one location into a document unless it makes sense to do so.",
      "zh-CHS": "如果目标的位置是使用一系列不同的技术确定的，或者如果目标希望表示其位置以及其PC的位置，则可能会发生这种情况。通常，避免在文档中放入多个位置，除非这样做有意义。"
    },
    {
      "indent": 3,
      "text": "Rule #4: Providing more than one location chunk in a single <location-info> element SHOULD be avoided where possible. Rule #5 and Rule #6 provide further refinement.",
      "zh-CHS": "规则#4：应尽可能避免在单个<location info>元素中提供多个位置块。规则5和规则6提供了进一步的细化。"
    },
    {
      "indent": 3,
      "text": "Rule #5: When providing more than one location chunk in a single <location-info> element, the locations MUST be provided by a common source at the same time and by the same location determination method.",
      "zh-CHS": "规则#5：当在单个<location info>元素中提供多个位置块时，位置必须由一个公共源同时以相同的位置确定方法提供。"
    },
    {
      "indent": 3,
      "text": "Rule #6: Providing more than one location chunk in a single <location-info> element SHOULD only be used for representing compound location referring to the same place.",
      "zh-CHS": "规则#6：在单个<location info>元素中提供多个位置块只能用于表示引用同一位置的复合位置。"
    },
    {
      "indent": 9,
      "text": "For example, a geodetic location describing a point, and a civic location indicating the floor in a building.",
      "zh-CHS": "例如，描述一个点的大地测量位置，以及指示建筑中楼层的城市位置。"
    },
    {
      "indent": 3,
      "text": "Rule #7: Where the compound location is provided in a single <location-info> element, the coarse location information MUST be provided first.",
      "zh-CHS": "规则#7：如果在单个<location info>元素中提供复合位置，则必须首先提供粗略位置信息。"
    },
    {
      "indent": 9,
      "text": "For example, a geodetic location describing an area and a civic location indicating the floor should be represented with the area first followed by the civic location.",
      "zh-CHS": "例如，描述一个区域的大地测量位置和指示楼层的市政位置应表示为首先是该区域，然后是市政位置。"
    },
    {
      "indent": 3,
      "text": "Rule #8: Where a PIDF document contains more than one <geopriv> element, the priority of interpretation is given to the first <device> element in the document containing a location. If no <device> element containing a location is present in the document, then priority is given to the first <tuple> element containing a location. Locations contained in <person> tuples SHOULD only be used as a last resort.",
      "zh-CHS": "规则#8：如果PIDF文档包含多个<geopriv>元素，则解释的优先级将给予包含位置的文档中的第一个<device>元素。如果文档中不存在包含位置的<device>元素，则会优先考虑包含位置的第一个<tuple>元素。<person>元组中包含的位置只能作为最后手段使用。"
    },
    {
      "indent": 3,
      "text": "Rule #9: Where multiple PIDF documents can be sent or received together, say in a multi-part MIME body, and current location information is required by the recipient, then document selection SHOULD be based on document order, with the first document considered first.",
      "zh-CHS": "规则#9：如果多个PIDF文档可以一起发送或接收，比如在多部分MIME正文中，并且收件人需要当前位置信息，那么文档选择应该基于文档顺序，首先考虑第一个文档。"
    },
    {
      "indent": 3,
      "text": "The following examples illustrate the application of these rules.",
      "zh-CHS": "以下示例说明了这些规则的应用。"
    },
    {
      "indent": 0,
      "text": "3.1. Single Civic Location Information",
      "section_title": true,
      "zh-CHS": "3.1. 单一城市位置信息"
    },
    {
      "indent": 3,
      "text": "Jane is at a coffee shop on the ground floor of a large shopping mall. Jane turns on her laptop and connects to the coffee shop's WiFi hotspot; Jane obtains a complete civic address for her current location, for example, using the DHCP civic mechanism defined in [RFC4776]. A Location Object is constructed consisting of a single PIDF document, with a single <tuple> or <device> element, a single <status> element, a single <geopriv> element, and a single location chunk residing in the <location-info> element. This document is unambiguous, and should be interpreted consistently by receiving nodes if sent over the network.",
      "zh-CHS": "简在一家大型购物中心一楼的咖啡馆里。简打开笔记本电脑，连接到咖啡店的WiFi热点；例如，Jane使用[RFC4776]中定义的DHCP civic机制获取其当前位置的完整civic地址。位置对象由单个PIDF文档、单个<tuple>或<device>元素、单个<status>元素、单个<geopriv>元素和驻留在<Location info>元素中的单个位置块组成。此文档是明确的，如果通过网络发送，则接收节点应一致地解释此文档。"
    },
    {
      "indent": 0,
      "text": "3.2. Civic and Geospatial Location Information",
      "section_title": true,
      "zh-CHS": "3.2. 城市和地理空间位置信息"
    },
    {
      "indent": 3,
      "text": "Mike is visiting his Seattle office and connects his laptop into the Ethernet port in a spare cube. In this case, location information is geodetic location, with the altitude represented as a building floor number. Mike's main location is the point specified by the geodetic coordinates. Further, Mike is on the second floor of the building located at these coordinates. Applying rules #6 and #7, the resulting compound location information is shown in Figure 2.",
      "zh-CHS": "迈克正在西雅图办公室访问，并将他的笔记本电脑连接到备用立方体中的以太网端口。在这种情况下，位置信息是大地测量位置，高度表示为建筑楼层编号。Mike的主要位置是大地坐标指定的点。此外，迈克在位于这些坐标的大楼二楼。应用规则#6和#7，得到的复合位置信息如图2所示。"
    },
    {
      "indent": 4,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:dm=\"urn:ietf:params:xml:ns:pidf:data-model\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:cl=\"urn:ietf:params:xml:ns:pidf:geopriv10:civicAddr\"\n          entity=\"pres:mike@seattle.example.com\">\n  <dm:device id=\"mikepc\">\n    <gp:geopriv>\n      <gp:location-info>\n        <gml:Point srsName=\"urn:ogc:def:crs:EPSG::4326\">\n          <gml:pos>-43.5723 153.21760</gml:pos>\n        </gml:Point>\n        <cl:civicAddress>\n          <cl:FLR>2</cl:FLR>\n        </cl:civicAddress>\n      </gp:location-info>\n      <gp:usage-rules/>\n      <gp:method>Wiremap</gp:method>\n    </gp:geopriv>\n    <dm:deviceID>mac:8asd7d7d70cf</dm:deviceID>\n    <dm:timestamp>2007-06-22T20:57:29Z</dm:timestamp>\n  </dm:device>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 13,
      "text": "Figure 2: PIDF-LO Containing a Compound Location",
      "zh-CHS": "图2：包含复合位置的PIDF-LO"
    },
    {
      "indent": 0,
      "text": "3.3. Manual/Automatic Configuration of Location Information",
      "section_title": true,
      "zh-CHS": "3.3. 位置信息的手动/自动配置"
    },
    {
      "indent": 3,
      "text": "Loraine has a predefined civic location stored in her laptop, since she normally lives in Sydney, the address is for her Sydney-based apartment. Loraine decides to visit sunny San Francisco, and when she gets there, she plugs in her laptop and makes a call. Loraine's laptop receives a new location from the visited network in San Francisco. As this system cannot be sure that the preexisting and new location both describe the same place, Loraine's computer generates a new PIDF-LO and will use this to represent Loraine's location. If Loraine's computer were to add the new location to her existing PIDF location document (breaking rule #3), then the correct information may still be interpreted by the Location Recipient providing Loraine's system applies rule #9. In this case, the resulting order of location information in the PIDF document should be San Francisco first, followed by Sydney. Since the information is provided by different sources, rule #8 should also be applied and the information placed in different tuples with the tuple containing the San Francisco location first.",
      "zh-CHS": "Loraine的笔记本电脑中存储了一个预定义的城市位置，因为她通常居住在悉尼，地址是她的悉尼公寓。Loraine决定去阳光灿烂的旧金山，当她到达那里时，她插上她的笔记本电脑打电话。Loraine的笔记本电脑从旧金山访问的网络接收到新的位置。由于该系统无法确保先前存在的位置和新位置都描述了同一个位置，Loraine的计算机生成了一个新的PIDF-LO，并将使用该PIDF-LO表示Loraine的位置。如果Loraine的计算机将新位置添加到其现有的PIDF位置文档中（违反规则3），则位置接收者仍可解释正确的信息，前提是Loraine的系统应用规则9。在这种情况下，PIDF文档中的位置信息的顺序应该是旧金山首先，其次是悉尼。由于信息是由不同的来源提供的，规则8也应该被应用，并且信息放置在不同元组中，其中元组首先包含旧金山位置。"
    },
    {
      "indent": 0,
      "text": "3.4. Multiple Location Objects in a Single PIDF-LO",
      "section_title": true,
      "zh-CHS": "3.4. 单个PIDF-LO中的多个位置对象"
    },
    {
      "indent": 3,
      "text": "Vanessa has her PC with her at the park, but due to a misconfiguration, her PC reports her location as being in the office. The resulting PIDF-LO will have a <device> element showing the location of Vanessa's PC as the park, and a <person> element saying that Vanessa is in her office.",
      "zh-CHS": "Vanessa在公园里带着她的电脑，但由于配置错误，她的电脑将她的位置报告为在办公室。生成的PIDF-LO将有一个<device>元素显示Vanessa的PC作为公园的位置，还有一个<person>元素表示Vanessa在她的办公室。"
    },
    {
      "indent": 4,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:dm=\"urn:ietf:params:xml:ns:pidf:data-model\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:ca=\"urn:ietf:params:xml:ns:pidf:geopriv10:civicAddr\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:gs=\"http://www.opengis.net/pidflo/1.0\"\n          entity=\"pres:ness@example.com\">\n  <dm:device id=\"nesspc-1\">\n    <gp:geopriv>\n      <gp:location-info>\n        <ca:civicAddress xml:lang=\"en-AU\">\n          <ca:country>AU</ca:country>\n          <ca:A1>NSW</ca:A1>\n          <ca:A3>     Wollongong\n          </ca:A3><ca:A4>North Wollongong\n        </ca:A4>\n        <ca:RD>Flinders</ca:RD><ca:STS>Street</ca:STS>\n        <ca:RDBR>Campbell Street</ca:RDBR>\n        <ca:LMK>\n          Gilligan's Island\n          </ca:LMK> <ca:LOC>Corner</ca:LOC>\n          <ca:NAM> Video Rental Store </ca:NAM>\n          <ca:PC>2500</ca:PC>\n          <ca:ROOM> Westerns and Classics </ca:ROOM>\n          <ca:PLC>store</ca:PLC>\n          <ca:POBOX>Private Box 15</ca:POBOX>\n        </ca:civicAddress>\n      </gp:location-info>\n      <gp:usage-rules/>\n      <gp:method>GPS</gp:method>\n    </gp:geopriv>\n    <dm:deviceID>mac:1234567890ab</dm:deviceID>\n    <dm:timestamp>2007-06-22T20:57:29Z</dm:timestamp>\n  </dm:device>\n  <dm:person id=\"ness\">\n    <gp:geopriv>\n      <gp:location-info>\n        <gs:Circle srsName=\"urn:ogc:def:crs:EPSG::4326\">\n          <gml:pos>-34.410649 150.87651</gml:pos>\n          <gs:radius uom=\"urn:ogc:def:uom:EPSG::9001\">",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "            30\n          </gs:radius>\n        </gs:Circle>\n      </gp:location-info>\n      <gp:usage-rules/>\n      <gp:method>Manual</gp:method>\n    </gp:geopriv>\n    <dm:timestamp>2007-06-24T12:28:04Z</dm:timestamp>\n  </dm:person>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Figure 3: PIDF-LO Containing Multiple Location Objects",
      "zh-CHS": "图3：包含多个位置对象的PIDF-LO"
    },
    {
      "indent": 0,
      "text": "4. Geodetic Coordinate Representation",
      "section_title": true,
      "zh-CHS": "4. 大地坐标表示法"
    },
    {
      "indent": 3,
      "text": "The geodetic examples provided in RFC 4119 [RFC4119] are illustrated using the <gml:location> element, which uses the <gml:coordinates> element inside the <gml:Point> element, and this representation has several drawbacks. Firstly, it has been deprecated in later versions of GML (3.1 and beyond) making it inadvisable to use for new applications. Secondly, the format of the coordinates type is opaque and so can be difficult to parse and interpret to ensure consistent results, as the same geodetic location can be expressed in a variety of ways. The PIDF-LO Geodetic Shapes specification [GeoShape] provides a specific GML profile for expressing commonly used shapes using simple GML representations. The shapes defined in [GeoShape] are the recommended shapes to ensure interoperability.",
      "zh-CHS": "RFC 4119[RFC4119]中提供的大地测量示例使用<gml:location>元素进行说明，该元素在<gml:Point>元素中使用<gml:coordinates>元素，这种表示方式有几个缺点。首先，它在GML（3.1及更高版本）的更高版本中被弃用，因此不适合用于新的应用程序。其次，坐标类型的格式不透明，因此很难解析和解释以确保结果一致，因为同一大地测量位置可以用多种方式表示。PIDF-LO大地测量形状规范[GeoShape]提供了一个特定的GML配置文件，用于使用简单的GML表示来表示常用形状。[GeoShape]中定义的形状是推荐的形状，以确保互操作性。"
    },
    {
      "indent": 0,
      "text": "5. Geodetic Shape Representation",
      "section_title": true,
      "zh-CHS": "5. 大地形状表示法"
    },
    {
      "indent": 3,
      "text": "The cellular mobile world today makes extensive use of geodetic-based location information for emergency and other location-based applications. Generally, these locations are expressed as a point (either in two or three dimensions) and an area or volume of uncertainty around the point. In theory, the area or volume represents a coverage in which the user has a relatively high probability of being found, and the point is a convenient means of defining the centroid for the area or volume. In practice, most systems use the point as an absolute value and ignore the uncertainty. It is difficult to determine if systems have been implemented in this manner for simplicity, and even more difficult to predict if uncertainty will play a more important role in the future. An important decision is whether an uncertainty area should be specified.",
      "zh-CHS": "今天的蜂窝移动世界将基于大地测量的位置信息广泛用于紧急情况和其他基于位置的应用。通常，这些位置表示为一个点（二维或三维）以及该点周围的不确定区域或体积。理论上，区域或体积表示用户被发现的概率相对较高的覆盖范围，点是定义区域或体积质心的方便方法。在实践中，大多数系统使用点作为绝对值，忽略不确定性。为了简单起见，很难确定系统是否以这种方式实现，更难预测不确定性是否会在未来发挥更重要的作用。一个重要的决定是是否应该指定一个不确定区域。"
    },
    {
      "indent": 3,
      "text": "The PIDF-LO Geodetic Shapes specification [GeoShape] defines eight shape types, most of which are easily translated into shape definitions used in other applications and protocols, such as the Open Mobile Alliance (OMA) Mobile Location Protocol (MLP). For completeness, the shapes defined in [GeoShape] are listed below:",
      "zh-CHS": "PIDF-LO大地测量形状规范[GeoShape]定义了八种形状类型，其中大多数可以轻松转换为其他应用程序和协议中使用的形状定义，如开放移动联盟（OMA）移动定位协议（MLP）。为完整起见，[GeoShape]中定义的形状如下所示："
    },
    {
      "indent": 3,
      "text": "o Point (2d and 3d)",
      "zh-CHS": "o 点（二维和三维）"
    },
    {
      "indent": 3,
      "text": "o Polygon (2d)",
      "zh-CHS": "o 多边形（2d）"
    },
    {
      "indent": 3,
      "text": "o Circle (2d)",
      "zh-CHS": "o 圆形（2d）"
    },
    {
      "indent": 3,
      "text": "o Ellipse (2d)",
      "zh-CHS": "o 椭圆（2d）"
    },
    {
      "indent": 3,
      "text": "o Arc band (2d)",
      "zh-CHS": "o 弧带（2d）"
    },
    {
      "indent": 3,
      "text": "o Sphere (3d)",
      "zh-CHS": "o 球体（3d）"
    },
    {
      "indent": 3,
      "text": "o Ellipsoid (3d)",
      "zh-CHS": "o 椭球体（3d）"
    },
    {
      "indent": 3,
      "text": "o Prism (3d)",
      "zh-CHS": "o 棱镜（3d）"
    },
    {
      "indent": 3,
      "text": "The above-listed shapes MUST be implemented.",
      "zh-CHS": "必须实现上面列出的形状。"
    },
    {
      "indent": 3,
      "text": "The GeoShape specification [GeoShape] also describes a standard set of coordinate reference systems (CRS), unit of measure (UoM) and conventions relating to lines and distances. The use of the world geodetic system 1984 (WGS84) [WGS84] coordinate reference system and the usage of European petroleum survey group (EPSG) code 4326 (as identified by the URN urn:ogc:def:crs:EPSG::4326, [CRS-URN]) for two-dimensional (2d) shape representations and EPSG 4979 (as identified by the URN urn:ogc:def:crs:EPSG::4979) for three-dimensional (3d) volume representations is mandated. Distance and heights are expressed in meters using EPSG 9001 (as identified by the URN urn:ogc:def:uom:EPSG::9001). Angular measures MUST use either degrees or radians. Measures in degrees MUST be identified by the URN urn:ogc:def:uom:EPSG::9102, measures in radians MUST be identified by the URN urn:ogc:def:uom:EPSG::9101. Angles representing bearings are measured in a clockwise direction from Northing, as defined by the WGS84 CRS, not magnetic north.",
      "zh-CHS": "GeoShape规范[GeoShape]还描述了一套标准的坐标参考系（CRS）、测量单位（UoM）以及与直线和距离相关的约定。使用1984年世界大地测量系统（WGS84）[WGS84]坐标参考系和欧洲石油测量集团（EPSG）代码4326（由URN:ogc:def:crs:EPSG:：4326[crs-URN]标识）进行二维（2d）形状表示和EPSG 4979（由URN:ogc:def:crs:EPSG:：4979标识）对于三维（3d）体积表示是强制性的。距离和高度使用EPSG 9001以米表示（由URN URN:ogc:def:uom:EPSG:：9001标识）。角度度量必须使用度或弧度。以度为单位的度量值必须由URN URN:ogc:def:uom:EPSG:：9102标识，以弧度为单位的度量值必须由URN URN:ogc:def:uom:EPSG:：9101标识。代表轴承的角度是从WGS84 CRS定义的北向顺时针方向测量的，而不是磁北。"
    },
    {
      "indent": 3,
      "text": "Implementations MUST specify the CRS using the srsName attribute on the outermost geometry element. The CRS MUST NOT be respecified or changed for any sub-elements. The srsDimension attribute SHOULD be omitted, since the number of dimensions in these CRSs is known. A CRS MUST be specified using the above URN notation only; implementations do not need to support user-defined CRSs.",
      "zh-CHS": "实现必须使用最外层几何体元素上的srsName属性指定CRS。不得为任何子元素重新指定或更改CRS。srsDimension属性应该省略，因为这些CRS中的维度数量是已知的。必须仅使用上述URN符号指定CRS；实现不需要支持用户定义的CRS。"
    },
    {
      "indent": 3,
      "text": "Numerical values for coordinates and measures are expressed using the lexical representation for \"double\" defined in [W3C.REC-xmlschema-2-20041028]. Leading zeros and trailing zeros past the decimal point are not significant; for instance \"03.07500\" is equivalent to \"3.075\".",
      "zh-CHS": "坐标和度量值的数值使用[W3C.REC-xmlschema-2-20041028]中定义的“double”的词汇表示法表示。超过小数点的前导零和尾随零不重要；例如，“03.07500”相当于“3.075”。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that uncertainty is expressed at a confidence of 95% or higher. Specifying a convention for confidence enables better use of uncertainty values.",
      "zh-CHS": "建议以95%或更高的置信度表示不确定度。通过指定置信度惯例，可以更好地使用不确定性值。"
    },
    {
      "indent": 0,
      "text": "5.1. Polygon Restrictions",
      "section_title": true,
      "zh-CHS": "5.1. 多边形限制"
    },
    {
      "indent": 3,
      "text": "The polygon shape type defined in [GeoShape] intentionally does not place any constraints on the number of vertices that may be included to define the bounds of a polygon. This allows arbitrarily complex shapes to be defined and conveyed in a PIDF-LO. However, where location information is to be used in real-time processing applications, such as location-dependent routing, having arbitrarily complex shapes consisting of tens or even hundreds of points could result in significant performance impacts. To mitigate this risk, Polygon shapes SHOULD be restricted to a maximum of 15 points (16 including the repeated point) when the location information is intended for use in real-time applications. This limit of 15 points is chosen to allow moderately complex shape definitions while at the same time enabling interoperation with other location transporting protocols such as those defined in the 3rd Generation Partnership Project (3GPP) (see [3GPP.23.032]) and OMA where the 15-point limit is already imposed.",
      "zh-CHS": "[GeoShape]中定义的多边形形状类型有意不对定义多边形边界可能包含的顶点数量施加任何约束。这允许在PIDF-LO中定义和传输任意复杂形状。然而，当位置信息用于实时处理应用程序（如位置相关路由）时，具有由数十个甚至数百个点组成的任意复杂形状可能会导致显著的性能影响。为了降低这种风险，当位置信息用于实时应用程序时，多边形形状应限制为最多15个点（16个点包括重复点）。选择15个点的限制是为了允许中等复杂的形状定义，同时实现与其他位置传输协议的互操作，如第三代合作伙伴关系项目（3GPP）（参见[3GPP.23.032]）和OMA中定义的那些协议，其中15个点的限制已经实施。"
    },
    {
      "indent": 3,
      "text": "The edges of a polygon are defined by the shortest path between two points in space (not a geodesic curve). Two-dimensional points MAY be interpreted as having a zero value for their altitude component. To avoid significant errors arising from potential geodesic interpolation, the length between adjacent vertices SHOULD be restricted to a maximum of 130 km. More information relating to this restriction is provided in [GeoShape].",
      "zh-CHS": "多边形的边由空间中两点之间的最短路径（不是测地曲线）定义。二维点可以解释为其高度分量为零值。为避免潜在测地插值产生的重大误差，相邻顶点之间的长度应限制在130 km以内。有关此限制的更多信息，请参见[GeoShape]。"
    },
    {
      "indent": 3,
      "text": "A connecting line SHALL NOT cross another connecting line of the same Polygon.",
      "zh-CHS": "一条连接线不得与同一多边形的另一条连接线交叉。"
    },
    {
      "indent": 3,
      "text": "Polygons MUST be defined with the upward normal pointing up. This is accomplished by defining the vertices in a counter-clockwise direction.",
      "zh-CHS": "多边形的定义必须使向上法线指向上。这是通过逆时针方向定义顶点来实现的。"
    },
    {
      "indent": 3,
      "text": "Points specified in a polygon using three-dimensional coordinates MUST all have the same altitude.",
      "zh-CHS": "使用三维坐标在多边形中指定的点必须具有相同的高度。"
    },
    {
      "indent": 0,
      "text": "5.2. Shape Examples",
      "section_title": true,
      "zh-CHS": "5.2. 形状示例"
    },
    {
      "indent": 3,
      "text": "This section provides some examples of where some of the more complex shapes are used, how they are determined, and how they are represented in a PIDF-LO. Complete details on all of the GeoShape types are provided in [GeoShape].",
      "zh-CHS": "本节提供了一些示例，说明在何处使用一些更复杂的形状、如何确定它们以及如何在PIDF-LO中表示它们。[GeoShape]中提供了所有GeoShape类型的完整详细信息。"
    },
    {
      "indent": 0,
      "text": "5.2.1. Point",
      "section_title": true,
      "zh-CHS": "5.2.1. 指向"
    },
    {
      "indent": 3,
      "text": "The point shape type is the simplest form of geodetic location information (LI), which is natively supported by GML. The gml:Point element is used when there is no known uncertainty. A point also forms part of a number of other geometries. A point may be specified using either WGS 84 (latitude, longitude) or WGS 84 (latitude, longitude, altitude). Figure 4 shows a 2d point:",
      "zh-CHS": "点形状类型是大地测量位置信息（LI）的最简单形式，GML本机支持该信息。当不存在已知的不确定性时，使用gml:Point元素。点还构成许多其他几何图形的一部分。可以使用WGS 84（纬度、经度）或WGS 84（纬度、经度、高度）指定点。图4显示了一个二维点："
    },
    {
      "indent": 4,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:dm=\"urn:ietf:params:xml:ns:pidf:data-model\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:cl=\"urn:ietf:params:xml:ns:pidf:geopriv10:civicAddr\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          entity=\"pres:point2d@example.com\">\n  <dm:device id=\"point2d\">\n    <gp:geopriv>\n      <gp:location-info>\n        <gml:Point srsName=\"urn:ogc:def:crs:EPSG::4326\">\n          <gml:pos>-34.407 150.883</gml:pos>\n        </gml:Point>\n      </gp:location-info>\n      <gp:usage-rules/>\n      <gp:method>Wiremap</gp:method>\n    </gp:geopriv>\n    <dm:deviceID>mac:1234567890ab</dm:deviceID>\n    <dm:timestamp>2007-06-22T20:57:29Z</dm:timestamp>\n  </dm:device>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Figure 4: PIDF-LO Containing a Two-Dimensional Point",
      "zh-CHS": "图4：包含二维点的PIDF-LO"
    },
    {
      "indent": 3,
      "text": "Figure 5 shows a 3d point:",
      "zh-CHS": "图5显示了一个3d点："
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:dm=\"urn:ietf:params:xml:ns:pidf:data-model\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          entity=\"pres:point3d@example.com\">\n  <dm:device id=\"point3d\">\n    <gp:geopriv>\n      <gp:location-info>\n        <gml:Point srsName=\"urn:ogc:def:crs:EPSG::4979\"\n                   xmlns:gml=\"http://www.opengis.net/gml\">\n          <gml:pos>-34.407 150.883 24.8</gml:pos>\n        </gml:Point>\n      </gp:location-info>\n      <gp:usage-rules/>\n      <gp:method>Wiremap</gp:method>\n    </gp:geopriv>\n    <dm:deviceID>mac:1234567890ab</dm:deviceID>\n    <dm:timestamp>2007-06-22T20:57:29Z</dm:timestamp>\n  </dm:device>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Figure 5: PIDF-LO Containing a Three-Dimensional Point",
      "zh-CHS": "图5：包含三维点的PIDF-LO"
    },
    {
      "indent": 0,
      "text": "5.2.2. Polygon",
      "section_title": true,
      "zh-CHS": "5.2.2. 多边形"
    },
    {
      "indent": 3,
      "text": "The polygon shape type may be used to represent a building outline or coverage area. The first and last points of the polygon have to be the same. For example, looking at the hexagon in Figure 6 with vertices, A, B, C, D, E, and F. The resulting polygon will be defined with 7 points, with the first and last points both having the coordinates of point A.",
      "zh-CHS": "多边形形状类型可用于表示建筑轮廓或覆盖区域。多边形的第一个点和最后一个点必须相同。例如，查看图6中带有顶点A、B、C、D、E和F的六边形。生成的多边形将由7个点定义，第一个点和最后一个点都具有点A的坐标。"
    },
    {
      "indent": 3,
      "text": "    F--------------E\n   /                \\\n  /                  \\\n /                    \\\nA                      D\n \\                    /\n  \\                  /\n   \\                /\n    B--------------C",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "Figure 6: Example of a Polygon",
      "zh-CHS": "图6：多边形示例"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          entity=\"pres:hexagon@example.com\">\n  <tuple id=\"polygon-pos\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gml:Polygon srsName=\"urn:ogc:def:crs:EPSG::4326\">\n            <gml:exterior>\n              <gml:LinearRing>\n                <gml:pos>43.311 -73.422</gml:pos> <!--A-->\n                <gml:pos>43.111 -73.322</gml:pos> <!--F-->\n                <gml:pos>43.111 -73.222</gml:pos> <!--E-->\n                <gml:pos>43.311 -73.122</gml:pos> <!--D-->\n                <gml:pos>43.411 -73.222</gml:pos> <!--C-->\n                <gml:pos>43.411 -73.322</gml:pos> <!--B-->\n                <gml:pos>43.311 -73.422</gml:pos> <!--A-->\n              </gml:LinearRing>\n            </gml:exterior>\n          </gml:Polygon>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>Wiremap</gp:method>\n      </gp:geopriv>\n    </status>\n    <timestamp>2007-06-22T20:57:29Z</timestamp>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 18,
      "text": "Figure 7: PIDF-LO Containing a Polygon",
      "zh-CHS": "图7：包含多边形的PIDF-LO"
    },
    {
      "indent": 3,
      "text": "In addition to the form shown in Figure 7, GML supports a posList that provides a more compact representation for the coordinates of the Polygon vertices than the discrete pos elements. The more compact form is shown in Figure 8. Both forms are permitted.",
      "zh-CHS": "除了图7所示的形式之外，GML还支持posList，它为多边形顶点的坐标提供了比离散pos元素更紧凑的表示。更紧凑的形式如图8所示。这两种形式都是允许的。"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          entity=\"pres:hexagon@example.com\">\n  <tuple id=\"polygon-poslist\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gml:Polygon srsName=\"urn:ogc:def:crs:EPSG::4326\">\n            <gml:exterior>\n              <gml:LinearRing>\n                <gml:posList>\n                  43.311 -73.422 43.111 -73.322\n                  43.111 -73.222 43.311 -73.122\n                  43.411 -73.222 43.411 -73.322\n                  43.311 -73.422\n                </gml:posList>\n              </gml:LinearRing>\n            </gml:exterior>\n          </gml:Polygon>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>Wiremap</gp:method>\n      </gp:geopriv>\n    </status>\n    <timestamp>2007-06-22T20:57:29Z</timestamp>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 8,
      "text": "Figure 8: Compact Form of a Polygon Expressed in a PIDF-LO",
      "zh-CHS": "图8：用PIDF-LO表示的多边形的紧凑形式"
    },
    {
      "indent": 0,
      "text": "5.2.3. Circle",
      "section_title": true,
      "zh-CHS": "5.2.3. 圆圈"
    },
    {
      "indent": 3,
      "text": "The circular area is used for coordinates in two-dimensional CRSs to describe uncertainty about a point. The definition is based on the one-dimensional geometry in GML, gml:CircleByCenterPoint. The center point of a circular area is specified by using a two-dimensional CRS; in three dimensions, the orientation of the circle cannot be specified correctly using this representation. A point with uncertainty that is specified in three dimensions should use the sphere shape type.",
      "zh-CHS": "圆形区域用于二维CRS中的坐标，以描述点的不确定性。该定义基于GML中的一维几何，GML:CircleByCenter。通过使用二维CRS指定圆形区域的中心点；在三维中，无法使用此表示法正确指定圆的方向。三维中指定的具有不确定性的点应使用球体形状类型。"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:gs=\"http://www.opengis.net/pidflo/1.0\"\n          entity=\"pres:circle@example.com\">\n  <tuple id=\"circle\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gs:Circle srsName=\"urn:ogc:def:crs:EPSG::4326\">\n            <gml:pos>42.5463 -73.2512</gml:pos>\n            <gs:radius uom=\"urn:ogc:def:uom:EPSG::9001\">\n              850.24\n            </gs:radius>\n          </gs:Circle>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>OTDOA</gp:method>\n      </gp:geopriv>\n    </status>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Figure 9: PIDF-LO Containing a Circle",
      "zh-CHS": "图9：包含圆的PIDF-LO"
    },
    {
      "indent": 0,
      "text": "5.2.4. Ellipse",
      "section_title": true,
      "zh-CHS": "5.2.4. 椭圆"
    },
    {
      "indent": 3,
      "text": "An elliptical area describes an ellipse in two-dimensional space. The ellipse is described by a center point, the length of its semi-major and semi-minor axes, and the orientation of the semi-major axis. Like the circular area (Circle), the ellipse MUST be specified using the two-dimensional CRS.",
      "zh-CHS": "椭圆区域描述二维空间中的椭圆。椭圆由一个中心点、其半长轴和半短轴的长度以及半长轴的方向来描述。与圆形区域（圆形）一样，必须使用二维CRS指定椭圆。"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:gs=\"http://www.opengis.net/pidflo/1.0\"\n          entity=\"pres:Ellipse@somecell.example.com\">\n  <tuple id=\"ellipse\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gs:Ellipse srsName=\"urn:ogc:def:crs:EPSG::4326\">\n            <gml:pos>42.5463 -73.2512</gml:pos>\n            <gs:semiMajorAxis uom=\"urn:ogc:def:uom:EPSG::9001\">\n              1275\n            </gs:semiMajorAxis>\n            <gs:semiMinorAxis uom=\"urn:ogc:def:uom:EPSG::9001\">\n              670\n            </gs:semiMinorAxis>\n            <gs:orientation uom=\"urn:ogc:def:uom:EPSG::9102\">\n              43.2\n            </gs:orientation>\n          </gs:Ellipse>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>Device-Assisted_A-GPS</gp:method>\n      </gp:geopriv>\n    </status>\n    <timestamp>2007-06-22T20:57:29Z</timestamp>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 10: PIDF-LO Containing an Ellipse",
      "zh-CHS": "图10：包含椭圆的PIDF-LO"
    },
    {
      "indent": 3,
      "text": "The gml:pos element indicates the position of the center, or origin, of the ellipse. The gs:semiMajorAxis and gs:semiMinorAxis elements are the length of the semi-major and semi-minor axes, respectively. The gs:orientation element is the angle by which the semi-major axis is rotated from the first axis of the CRS towards the second axis. For WGS 84, the orientation indicates rotation from Northing to Easting, which, if specified in degrees, is roughly equivalent to a compass bearing (if magnetic north were the same as the WGS north pole). Note: An ellipse with equal major and minor axis lengths is a circle.",
      "zh-CHS": "gml:pos元素表示椭圆的中心或原点的位置。gs:semi-majoraxis和gs:semi-minoraxis元素分别是半长轴和半短轴的长度。方向元素是半长轴从CRS的第一个轴向第二个轴旋转的角度。对于WGS 84，方向表示从北向东旋转，如果以度为单位指定，则大致相当于罗盘方位（如果磁北与WGS北极相同）。注：长轴和短轴长度相等的椭圆是圆。"
    },
    {
      "indent": 0,
      "text": "5.2.5. Arc Band",
      "section_title": true,
      "zh-CHS": "5.2.5. 弧带"
    },
    {
      "indent": 3,
      "text": "The arc band shape type is commonly generated in wireless systems where timing advance or code offsets sequences are used to compensate for distances between handsets and the access point. The arc band is represented as two radii emanating from a central point, and two angles that represent the starting angle and the opening angle of the arc. In a cellular environment, the central point is nominally the location of the cell tower, the two radii are determined by the extent of the timing advance, and the two angles are generally provisioned information.",
      "zh-CHS": "弧形频带形状通常在无线系统中生成，其中定时提前或代码偏移序列用于补偿手机与接入点之间的距离。弧带表示为从中心点发出的两个半径，以及表示弧的起始角和开口角的两个角度。在蜂窝环境中，中心点名义上是蜂窝塔的位置，两个半径由定时提前的程度确定，并且两个角度通常是提供的信息。"
    },
    {
      "indent": 3,
      "text": "For example, Paul is using a cellular wireless device and is 7 timing advance symbols away from the cell tower. For a GSM-based network, this would place Paul roughly between 3,594 meters and 4,148 meters from the cell tower, providing the inner and outer radius values. If the start angle is 20 degrees from north, and the opening angle is 120 degrees, an arc band representing Paul's location would look similar to Figure 11.",
      "zh-CHS": "例如，Paul正在使用蜂窝无线设备，并且正在远离蜂窝基站7个定时提前符号。对于基于GSM的网络，这将使Paul距离蜂窝塔大约3594米到4148米，提供内外半径值。如果起始角与北面成20度角，且开口角为120度，则表示Paul位置的弧形条带将类似于图11。"
    },
    {
      "indent": 8,
      "text": " N ^        ,.__\n   | a(s)  /     `-.\n   | 20   /         `-.\n   |--.  /             `.\n   |   `/                \\\n   |   /__                \\\n   |  .   `-.              \\\n   | .       `.             \\\n   |. \\        \\             .\n---c-- a(o) -- |             | -->\n   |.  / 120   '             |   E\n   |  .       /              '\n   |    .    /              ;\n          .,'              /\n       r(i)`.             /\n    (3594m)  `.          /\n               `.      ,'\n                 `.  ,'\n               r(o)`'\n             (4148m)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 21,
      "text": "Figure 11: Example of an Arc Band",
      "zh-CHS": "图11：弧带示例"
    },
    {
      "indent": 3,
      "text": "The resulting PIDF-LO is shown in Figure 12.",
      "zh-CHS": "产生的PIDF-LO如图12所示。"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:gs=\"http://www.opengis.net/pidflo/1.0\"\n          entity=\"pres:paul@somecell.example.com\">\n  <tuple id=\"arcband\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gs:ArcBand srsName=\"urn:ogc:def:crs:EPSG::4326\">\n            <gml:pos>-43.5723 153.21760</gml:pos>\n            <gs:innerRadius uom=\"urn:ogc:def:uom:EPSG::9001\">\n              3594\n            </gs:innerRadius>\n            <gs:outerRadius uom=\"urn:ogc:def:uom:EPSG::9001\">\n              4148\n            </gs:outerRadius>\n            <gs:startAngle uom=\"urn:ogc:def:uom:EPSG::9102\">\n              20\n            </gs:startAngle>\n            <gs:openingAngle uom=\"urn:ogc:def:uom:EPSG::9102\">\n              20\n            </gs:openingAngle>\n          </gs:ArcBand>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>TA-NMR</gp:method>\n      </gp:geopriv>\n    </status>\n    <timestamp>2007-06-22T20:57:29Z</timestamp>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 12: PIDF-LO Containing an Arc Band",
      "zh-CHS": "图12：包含电弧带的PIDF-LO"
    },
    {
      "indent": 3,
      "text": "An important note to make on the arc band is that the center point used in the definition of the shape is not included in resulting enclosed area, and that Target may be anywhere in the defined area of the arc band.",
      "zh-CHS": "在弧带上需要注意的一点是，形状定义中使用的中心点不包括在生成的封闭区域中，目标可能位于弧带定义区域中的任何位置。"
    },
    {
      "indent": 0,
      "text": "5.2.6. Sphere",
      "section_title": true,
      "zh-CHS": "5.2.6. 球"
    },
    {
      "indent": 3,
      "text": "The sphere is a volume that provides the same information as a circle in three dimensions. The sphere has to be specified using a three-dimensional CRS. Figure 13 shows the sphere shape type, which is identical to the circle example, except for the addition of an altitude in the provided coordinates.",
      "zh-CHS": "球体是一个提供与三维圆相同信息的体积。必须使用三维CRS指定球体。图13显示了球体形状类型，除了在提供的坐标中添加高度外，它与圆形示例相同。"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:gs=\"http://www.opengis.net/pidflo/1.0\"\n          entity=\"pres:sphere@example.com\">\n  <tuple id=\"sphere\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gs:Sphere srsName=\"urn:ogc:def:crs:EPSG::4979\">\n            <gml:pos>42.5463 -73.2512 26.3</gml:pos>\n            <gs:radius uom=\"urn:ogc:def:uom:EPSG::9001\">\n              850.24\n            </gs:radius>\n          </gs:Sphere>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>Device-Based_A-GPS</gp:method>\n      </gp:geopriv>\n    </status>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 18,
      "text": "Figure 13: PIDF-LO Containing a Sphere",
      "zh-CHS": "图13：包含球体的PIDF-LO"
    },
    {
      "indent": 0,
      "text": "5.2.7. Ellipsoid",
      "section_title": true,
      "zh-CHS": "5.2.7. 椭球体"
    },
    {
      "indent": 3,
      "text": "The ellipsoid is the volume most commonly produced by GPS systems. It is used extensively in navigation systems and wireless location networks. The ellipsoid is constructed around a central point specified in three dimensions, and three axes perpendicular to one another are extended outwards from this point. These axes are defined as the semi-major (M) axis, the semi-minor (m) axis, and the vertical (v) axis, respectively. An angle is used to express the orientation of the ellipsoid. The orientation angle is measured in degrees from north, and represents the direction of the semi-major axis from the center point.",
      "zh-CHS": "椭球体是GPS系统最常用的体积。它广泛应用于导航系统和无线定位网络中。椭球体围绕三维中指定的中心点构造，三条相互垂直的轴从该点向外延伸。这些轴分别定义为半长轴（M）、半短轴（M）和垂直轴（v）。角度用于表示椭球体的方向。方向角以度为单位从北测量，表示半长轴从中心点的方向。"
    },
    {
      "indent": 12,
      "text": "      \\\n    _.-\\\"\"\"\"^\"\"\"\"\"-._\n  .'    \\   |        `.\n /       v  m          \\\n|         \\ |           |\n|          -c ----M---->|\n|                       |\n \\                     /\n  `._               _.'\n     `-...........-'",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 14: Example of an Ellipsoid",
      "zh-CHS": "图14：椭球体示例"
    },
    {
      "indent": 3,
      "text": "A PIDF-LO containing an ellipsoid appears as shown in Figure 15.",
      "zh-CHS": "包含椭球体的PIDF-LO如图15所示。"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:gs=\"http://www.opengis.net/pidflo/1.0\"\n          entity=\"pres:somone@gpsreceiver.example.com\">\n  <tuple id=\"ellipsoid\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gs:Ellipsoid srsName=\"urn:ogc:def:crs:EPSG::4979\">\n            <gml:pos>42.5463 -73.2512 26.3</gml:pos>\n            <gs:semiMajorAxis uom=\"urn:ogc:def:uom:EPSG::9001\">\n              7.7156\n            </gs:semiMajorAxis>\n            <gs:semiMinorAxis uom=\"urn:ogc:def:uom:EPSG::9001\">\n              3.31\n            </gs:semiMinorAxis>\n            <gs:verticalAxis uom=\"urn:ogc:def:uom:EPSG::9001\">\n              28.7\n            </gs:verticalAxis>\n            <gs:orientation uom=\"urn:ogc:def:uom:EPSG::9102\">\n              90\n            </gs:orientation>\n          </gs:Ellipsoid>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>Hybrid_A-GPS</gp:method>\n      </gp:geopriv>\n    </status>\n    <timestamp>2007-06-22T20:57:29Z</timestamp>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Figure 15: PIDF-LO Containing an Ellipsoid",
      "zh-CHS": "图15：包含椭球体的PIDF-LO"
    },
    {
      "indent": 0,
      "text": "5.2.8. Prism",
      "section_title": true,
      "zh-CHS": "5.2.8. 棱镜"
    },
    {
      "indent": 3,
      "text": "A prism may be used to represent a section of a building or range of floors of building. The prism extrudes a polygon by providing a height element. It consists of a base made up of coplanar points defined in 3 dimensions all at the same altitude. The prism is then an extrusion from this base to the value specified in the height element. The height of the Prism MUST be a positive value. The first and last points of the polygon have to be the same.",
      "zh-CHS": "棱柱体可用于表示建筑物的一部分或建筑物的一系列楼层。棱柱体通过提供高度元素来拉伸多边形。它由一个由3维定义的共面点组成的基座组成，所有这些共面点位于同一高度。然后，棱柱是从该基准向高度元素中指定值的拉伸。棱镜的高度必须为正值。多边形的第一个点和最后一个点必须相同。"
    },
    {
      "indent": 3,
      "text": "For example, looking at the cube in Figure 16: if the prism is extruded from the bottom up, then the polygon forming the base of the prism is defined with the points A, B, C, D, A. The height of the prism is the distance between point A and point E in meters.",
      "zh-CHS": "例如，查看图16中的立方体：如果棱柱从下至上挤出，则构成棱柱底部的多边形由点A、B、C、D、A定义。棱柱的高度是点A和点E之间的距离，单位为米。"
    },
    {
      "indent": 11,
      "text": "   G-----F\n  /|    /|\n / |   / |\nH--+--E  |\n|  C--|--B\n| /   | /\n|/    |/\nD-----A",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "Figure 16: Example of a Prism",
      "zh-CHS": "图16：棱镜示例"
    },
    {
      "indent": 3,
      "text": "The resulting PIDF-LO is shown in Figure 17.",
      "zh-CHS": "产生的PIDF-LO如图17所示。"
    },
    {
      "indent": 5,
      "text": "<presence xmlns=\"urn:ietf:params:xml:ns:pidf\"\n          xmlns:gp=\"urn:ietf:params:xml:ns:pidf:geopriv10\"\n          xmlns:gml=\"http://www.opengis.net/gml\"\n          xmlns:gs=\"http://www.opengis.net/pidflo/1.0\"\n          entity=\"pres:mike@someprism.example.com\">\n  <tuple id=\"prism\">\n    <status>\n      <gp:geopriv>\n        <gp:location-info>\n          <gs:Prism srsName=\"urn:ogc:def:crs:EPSG::4979\">\n            <gs:base>\n              <gml:Polygon>\n                <gml:exterior>\n                  <gml:LinearRing>\n                    <gml:posList>\n                      42.556844 -73.248157 36.6 <!--A-->\n                      42.656844 -73.248157 36.6 <!--B-->\n                      42.656844 -73.348157 36.6 <!--C-->\n                      42.556844 -73.348157 36.6 <!--D-->\n                      42.556844 -73.248157 36.6 <!--A-->\n                    </gml:posList>\n                  </gml:LinearRing>\n                </gml:exterior>\n              </gml:Polygon>\n            </gs:base>\n            <gs:height uom=\"urn:ogc:def:uom:EPSG::9001\">\n              2.4\n            </gs:height>\n          </gs:Prism>\n        </gp:location-info>\n        <gp:usage-rules/>\n        <gp:method>Wiremap</gp:method>\n      </gp:geopriv>\n    </status>\n    <timestamp>2007-06-22T20:57:29Z</timestamp>\n  </tuple>\n</presence>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 19,
      "text": "Figure 17: PIDF-LO Containing a Prism",
      "zh-CHS": "图17：包含棱镜的PIDF-LO"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The primary security considerations relate to how location information is conveyed and used, which are outside the scope of this document. This document is intended to serve only as a set of guidelines as to which elements MUST or SHOULD be implemented by systems wishing to perform location dependent routing. The ramification of such recommendations is that they extend to devices and clients that wish to make use of such services.",
      "zh-CHS": "主要的安全注意事项涉及如何传达和使用位置信息，这超出了本文档的范围。本文件仅作为一套指南，说明希望执行位置相关路由的系统必须或应该实施哪些要素。这些建议的后果是，它们扩展到希望使用这些服务的设备和客户机。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the GEOPRIV working group for their discussions in the context of PIDF-LO, in particular Carl Reed, Ron Lake, James Polk, Henning Schulzrinne, Jerome Grenier, Roger Marshall and Robert Sparks. Furthermore, we would like to thank Jon Peterson as the author of PIDF-LO and Nadine Abbott for her constructive comments in clarifying some aspects of the document.",
      "zh-CHS": "作者要感谢GEOPRIV工作组在PIDF-LO背景下进行的讨论，特别是Carl Reed、Ron Lake、James Polk、Henning Schulzrinne、Jerome Grenier、Roger Marshall和Robert Sparks。此外，我们要感谢PIDF-LO的作者Jon Peterson和Nadine Abbott在澄清文件某些方面的建设性评论。"
    },
    {
      "indent": 3,
      "text": "Thanks to Karen Navas for pointing out some omissions in the examples.",
      "zh-CHS": "感谢Karen Navas指出示例中的一些遗漏。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[GeoShape] Thomson, M. and C. Reed, \"GML 3.1.1 PIDF-LO Shape Application Schema for use by the Internet Engineering Task Force (IETF)\", Candidate OpenGIS Implementation Specification 06-142r1, Version: 1.0, April 2007.",
      "zh-CHS": "[GeoShape]Thomson，M.和C.Reed，“互联网工程任务组（IETF）使用的GML 3.1.1 PIDF-LO形状应用模式”，候选OpenGIS实施规范06-142r1，版本：1.0，2007年4月。"
    },
    {
      "indent": 3,
      "text": "[OGC-GML3.1.1] Portele, C., Cox, S., Daisy, P., Lake, R., and A. Whiteside, \"Geography Markup Language (GML) 3.1.1\", OGC 03-105r1, July 2003.",
      "zh-CHS": "[OGC-GML3.1.1]Portele，C.，Cox，S.，Daisy，P.，Lake，R.，和A.Whiteside，“地理标记语言（GML）3.1.1”，OGC 03-105r1，2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4119] Peterson, J., \"A Presence-based GEOPRIV Location Object Format\", RFC 4119, December 2005.",
      "zh-CHS": "[RFC4119]Peterson，J.，“一种基于状态的GEOPRIV定位对象格式”，RFC41192005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4479] Rosenberg, J., \"A Data Model for Presence\", RFC 4479, July 2006.",
      "zh-CHS": "[RFC4479]Rosenberg，J.，“存在的数据模型”，RFC 4479，2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5139] Thomson, M. and J. Winterbottom, \"Revised Civic Location Format for Presence Information Data Format Location Object (PIDF-LO)\", RFC 5139, February 2008.",
      "zh-CHS": "[RFC5139]Thomson，M.和J.Winterbottom，“状态信息数据格式位置对象（PIDF-LO）的修订公民位置格式”，RFC 5139，2008年2月。"
    },
    {
      "indent": 3,
      "text": "[W3C.REC-xmlschema-2-20041028] Biron, P. and A. Malhotra, \"XML Schema Part 2: Datatypes Second Edition\", World Wide Web Consortium Recommendation REC-xmlschema-2-20041028, October 2004, <http://www.w3.org/TR/2004/REC-xmlschema-2-20041028>.",
      "zh-CHS": "[W3C.REC-xmlschema-2-20041028]Biron，P.和A.Malhotra，“XML模式第2部分：数据类型第二版”，万维网联盟建议REC-xmlschema-2-20041028，2004年10月<http://www.w3.org/TR/2004/REC-xmlschema-2-20041028>."
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[3GPP.23.032] 3rd Generation Partnership Project, \"Universal Geographical Area Description (GAD)\", 3GPP TS 23.032 V6.0.0, January 2005, <http://www.3gpp.org/ftp/Specs/html-info/23032.htm>.",
      "zh-CHS": "[3GPP.23.032]第三代合作伙伴项目，“通用地理区域描述（GAD）”，3GPP TS 23.032 V6.0.0，2005年1月<http://www.3gpp.org/ftp/Specs/html-info/23032.htm>."
    },
    {
      "indent": 3,
      "text": "[CRS-URN] Whiteside, A., \"GML 3.1.1 Common CRSs Profile\", OGC 03- 105r1, November 2005.",
      "zh-CHS": "[CRS-URN]Whiteside，A.，“GML 3.1.1通用CRS配置文件”，OGC 03-105r1，2005年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3693] Cuellar, J., Morris, J., Mulligan, D., Peterson, J., and J. Polk, \"Geopriv Requirements\", RFC 3693, February 2004.",
      "zh-CHS": "[RFC3693]Cuellar，J.，Morris，J.，Mulligan，D.，Peterson，J.，和J.Polk，“地质驱动要求”，RFC 3693，2004年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4776] Schulzrinne, H., \"Dynamic Host Configuration Protocol (DHCPv4 and DHCPv6) Option for Civic Addresses Configuration Information\", RFC 4776, November 2006.",
      "zh-CHS": "[RFC4776]Schulzrinne，H.，“Civic地址配置信息的动态主机配置协议（DHCPv4和DHCPv6）选项”，RFC 4776，2006年11月。"
    },
    {
      "indent": 3,
      "text": "[WGS84] US National Imagery and Mapping Agency, \"Department of Defense (DoD) World Geodetic System 1984 (WGS 84), Third Edition\", NIMA TR8350.2, January 2000.",
      "zh-CHS": "[WGS84]美国国家图像和测绘局，“国防部1984年世界大地测量系统（WGS 84），第三版”，NIMA TR8350.22000年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "James Winterbottom Andrew Corporation Wollongong NSW Australia",
      "zh-CHS": "James Winterbottom Andrew公司澳大利亚新南威尔士州卧龙岗"
    },
    {
      "indent": 3,
      "text": "EMail: james.winterbottom@andrew.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Martin Thomson Andrew Corporation Wollongong NSW Australia",
      "zh-CHS": "澳大利亚新南威尔士州卧龙岗马丁·汤姆森·安德鲁公司"
    },
    {
      "indent": 3,
      "text": "EMail: martin.thomson@andrew.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Hannes Tschofenig Nokia Siemens Networks Linnoitustie 6 Espoo 02600 Finland",
      "zh-CHS": "Hannes Tschofenig诺基亚西门子网络公司芬兰Linnoitustie 6 Espoo 02600"
    },
    {
      "indent": 3,
      "text": "Phone: +358 (50) 4871445\nEMail: Hannes.Tschofenig@gmx.net\nURI:   http://www.tschofenig.priv.at",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}