{
  "title": {
    "text": "RFC 5741: RFC Streams, Headers, and Boilerplates",
    "zh-CHS": "RFC 5741"
  },
  "number": 5741,
  "created_at": "2021-11-08 16:16:49.048557+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                         L. Daigle, Ed.\nRequest for Comments: 5741                               O. Kolkman, Ed.\nUpdates: 2223, 4844                                          For the IAB\nCategory: Informational                                    December 2009\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "RFC Streams, Headers, and Boilerplates",
      "zh-CHS": "RFC流、标题和样板"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "RFC documents contain a number of fixed elements such as the title page header, standard boilerplates, and copyright/IPR statements. This document describes them and introduces some updates to reflect current usage and requirements of RFC publication. In particular, this updated structure is intended to communicate clearly the source of RFC creation and review.",
      "zh-CHS": "RFC文档包含许多固定元素，如标题页标题、标准样板和版权/知识产权声明。本文档描述了它们，并介绍了一些更新，以反映RFC出版物的当前使用情况和要求。特别是，此更新结构旨在明确传达RFC创建和审查的来源。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。IAB批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5741.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc5741."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括《信托法律条款》第4.e节中所述的简化BSD许可文本，并且提供BSD许可中所述的代码组件时不提供任何担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  RFC Streams and Internet Standards . . . . . . . . . . . . . .  3\n3.  RFC Structural Elements  . . . . . . . . . . . . . . . . . . .  3\n  3.1.  The Title Page Header  . . . . . . . . . . . . . . . . . .  3\n  3.2.  The Status of this Memo  . . . . . . . . . . . . . . . . .  5\n    3.2.1.  Paragraph 1  . . . . . . . . . . . . . . . . . . . . .  6\n    3.2.2.  Paragraph 2  . . . . . . . . . . . . . . . . . . . . .  6\n    3.2.3.  Paragraph 3  . . . . . . . . . . . . . . . . . . . . .  8\n    3.2.4.  Noteworthy . . . . . . . . . . . . . . . . . . . . . .  9\n  3.3.  Additional Notes . . . . . . . . . . . . . . . . . . . . .  9\n  3.4.  Other Structural Information in RFCs . . . . . . . . . . .  9\n4.  Security Considerations  . . . . . . . . . . . . . . . . . . .  9\n5.  RFC Editor Considerations  . . . . . . . . . . . . . . . . . . 10\n6.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n  6.1.  Normative References . . . . . . . . . . . . . . . . . . . 10\n  6.2.  Informative References . . . . . . . . . . . . . . . . . . 10\nAppendix A.  Some Example 'Status of This Memo' Boilerplates . . . 12\n  A.1.  IETF Standards Track . . . . . . . . . . . . . . . . . . . 12\n  A.2.  IETF Experimental, with Consensus Call . . . . . . . . . . 12\n  A.3.  IETF Experimental, No Consensus Call . . . . . . . . . . . 13\n  A.4.  IAB Informational  . . . . . . . . . . . . . . . . . . . . 13\n  A.5.  IRTF Experimental, No Consensus Call . . . . . . . . . . . 14\n  A.6.  Independent Submission Informational . . . . . . . . . . . 15\nAppendix B.  IAB Members at Time of Approval . . . . . . . . . . . 15\nAppendix C.  Acknowledgements  . . . . . . . . . . . . . . . . . . 15",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Previously, RFCs (e.g., [RFC4844]) contained a number of elements that were there for historical, practical, and legal reasons. They also contained boilerplate material to clearly indicate the status of the document and possibly contained \"Notes\" to indicate how the document interacts with IETF Standards Track documents.",
      "zh-CHS": "在此之前，RFC（例如，[RFC4844]）包含许多出于历史、实践和法律原因而存在的元素。它们还包含样板材料，以清楚地指示文档的状态，可能还包含“注释”，以指示文档如何与IETF标准跟踪文档交互。"
    },
    {
      "indent": 3,
      "text": "As the RFC Series has evolved over the years, there has been increasing concern over appropriate labeling of the publications to make clear the status of each RFC and the status of the work it describes. Chiefly, there is a requirement that RFCs published as part of the IETF's review process not be easily confused with RFCs that may have had a very different review and approval process. Various adjustments have been made over the years, including evolving text of \"Notes\" included in the published RFC.",
      "zh-CHS": "随着RFC系列多年来的发展，人们越来越关注出版物的适当标签，以明确每个RFC的状态及其描述的工作状态。主要的要求是，作为IETF审查过程的一部分发布的RFC不容易与可能具有非常不同的审查和批准过程的RFC混淆。多年来进行了各种调整，包括在已发布的RFC中不断演变的“注释”文本。"
    },
    {
      "indent": 3,
      "text": "With the definition of the different RFC streams [RFC4844], it is appropriate to formalize the definition of the various pieces of standard RFC boilerplate and introduce some adjustments to ensure",
      "zh-CHS": "根据不同RFC流[RFC4844]的定义，可以将各种标准RFC样板的定义形式化，并引入一些调整以确保"
    },
    {
      "indent": 3,
      "text": "better clarity of expression of document status, aligned with the review and approval processes defined for each stream.",
      "zh-CHS": "文档状态的表达更加清晰，与为每个流定义的审核和批准流程保持一致。"
    },
    {
      "indent": 3,
      "text": "This memo identifies and describes the common elements of RFC boilerplate structure, and provides a comprehensive approach to updating and using those elements to communicate, with clarity, RFC document and content status. Most of the historical structure information is collected from [RFC2223].",
      "zh-CHS": "本备忘录确定并描述了RFC样板结构的常见元素，并提供了更新和使用这些元素以清晰地传达RFC文档和内容状态的综合方法。大部分历史结构信息从[RFC2223]收集。"
    },
    {
      "indent": 3,
      "text": "The changes introduced by this memo should be implemented as soon as practically possible after the document has been approved for publication.",
      "zh-CHS": "本备忘录引入的变更应在批准发布文件后尽快实施。"
    },
    {
      "indent": 0,
      "text": "2. RFC Streams and Internet Standards",
      "section_title": true,
      "zh-CHS": "2. RFC流和互联网标准"
    },
    {
      "indent": 3,
      "text": "Users of RFCs should be aware that while all Internet Standards-related documents are published as RFCs, not all RFCs are Internet Standards-related documents.",
      "zh-CHS": "RFC的用户应意识到，虽然所有与互联网标准相关的文件都作为RFC发布，但并非所有RFC都是与互联网标准相关的文件。"
    },
    {
      "indent": 3,
      "text": "The IETF is responsible for maintaining the Internet Standards Process, which includes the requirements for developing, reviewing, and approving Standards Track and BCP RFCs. The IETF also produces non-Standards-Track documents (Informational, Experimental, and Historic). All documents published as part of the IETF Stream are reviewed by the appropriate IETF bodies.",
      "zh-CHS": "IETF负责维护互联网标准流程，包括制定、审查和批准标准跟踪和BCP RFC的要求。IETF还生成非标准跟踪文档（信息性、实验性和历史性）。作为IETF流一部分发布的所有文件均由适当的IETF机构审查。"
    },
    {
      "indent": 3,
      "text": "Documents published in streams other than the IETF Stream are not generally reviewed by the IETF for such things as security, congestion control, or inappropriate interaction with deployed protocols. They have also not been subject to approval by the Internet Engineering Steering Group (IESG), including an IETF-wide last call. Therefore, the IETF disclaims, for any of the non-IETF Stream documents, any knowledge of the fitness of those RFCs for any purpose.",
      "zh-CHS": "IETF通常不会审查IETF流以外的流中发布的文档的安全性、拥塞控制或与已部署协议的不当交互。它们也没有得到互联网工程指导小组（IESG）的批准，包括IETF范围内的最后一次呼叫。因此，对于任何非IETF流文件，IETF不承认这些RFC适用于任何目的的任何知识。"
    },
    {
      "indent": 3,
      "text": "Refer to [RFC2026], [RFC5742], and [RFC4844] and their successors for current details of the IETF process and RFC streams.",
      "zh-CHS": "参考[RFC2026]、[RFC5742]和[RFC4844]及其后续文件，了解IETF流程和RFC流的当前详细信息。"
    },
    {
      "indent": 0,
      "text": "3. RFC Structural Elements",
      "section_title": true,
      "zh-CHS": "3. RFC结构元件"
    },
    {
      "indent": 0,
      "text": "3.1. The Title Page Header",
      "section_title": true,
      "zh-CHS": "3.1. 标题页标题"
    },
    {
      "indent": 3,
      "text": "This section describes the elements that are commonly found in RFCs published today. For the sake of clarity, this document specifies the elements precisely as a specification. However, this is not intended to specify a single, static format. Details of formatting are decided by the RFC Editor. Substantive changes to the header and",
      "zh-CHS": "本节介绍了今天发布的RFC中常见的元素。为清楚起见，本文件将元素精确地指定为规范。但是，这并不是为了指定单一的静态格式。格式的详细信息由RFC编辑器决定。标题和标题的实质性更改"
    },
    {
      "indent": 3,
      "text": "boilerplate structure and content may be undertaken in the future, and are subject to general oversight and review by the IAB.",
      "zh-CHS": "样板结构和内容可能在将来进行，并受到IAB的一般监督和审查。"
    },
    {
      "indent": 3,
      "text": "An RFC title page header can be described as follows:",
      "zh-CHS": "RFC标题页标题可描述如下："
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\n<document source>                                          <author name>\nRequest for Comments: <RFC number>                [<author affiliation>]\n[<subseries ID> <subseries number>]    [more author info as appropriate]\n[<RFC relation>:<RFC number[s]>]\nCategory: <category>\n                                                            <month year>\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For example, a sample earlier RFC header is as follows:",
      "zh-CHS": "例如，早期RFC标题示例如下所示："
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\nNetwork Working Group                                          T. Dierks\nRequest for Comments: 4346                                   Independent\nObsoletes: 2246                                              E. Rescorla\nCategory: Standards Track                                     RTFM, Inc.\n                                                              April 2006\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The right column contains author name and affiliation information as well as the RFC publication month. Conventions and restrictions for these elements are described in RFC style norms and some individual stream definitions.",
      "zh-CHS": "右栏包含作者姓名和从属关系信息以及RFC出版月份。RFC样式规范和一些单独的流定义中描述了这些元素的约定和限制。"
    },
    {
      "indent": 3,
      "text": "This section is primarily concerned with the information in the left column:",
      "zh-CHS": "本节主要关注左栏中的信息："
    },
    {
      "indent": 3,
      "text": "<document source> This describes the area where the work originates. Historically, all RFCs were labeled Network Working Group. \"Network Working Group\" refers to the original version of today's IETF when people from the original set of ARPANET sites and whomever else was interested -- the meetings were open -- got together to discuss, design, and document proposed protocols [RFC0003]. Here, we obsolete the term \"Network Working Group\" in order to indicate the originating stream.",
      "zh-CHS": "<document source>这描述了工作的起始区域。历史上，所有RFC都被标记为网络工作组。“网络工作组”指的是今天IETF的原始版本，当时来自原始ARPANET站点的人们以及其他感兴趣的人——会议是开放的——聚集在一起讨论、设计和记录提议的协议[RFC0003]。在这里，我们废弃了术语“网络工作组”，以指示原始流。"
    },
    {
      "indent": 6,
      "text": "The <document source> is the name of the RFC stream, as defined in [RFC4844] and its successors. At the time of this publication, the streams, and therefore the possible entries are:",
      "zh-CHS": "<document source>是[RFC4844]及其后续文件中定义的RFC流的名称。在本出版物发布时，流以及可能的条目为："
    },
    {
      "indent": 6,
      "text": "* Internet Engineering Task Force (IETF)",
      "zh-CHS": "* 互联网工程任务组（IETF）"
    },
    {
      "indent": 6,
      "text": "* Internet Architecture Board (IAB)",
      "zh-CHS": "* 互联网架构委员会（IAB）"
    },
    {
      "indent": 6,
      "text": "* Internet Research Task Force (IRTF)",
      "zh-CHS": "* 互联网研究工作队（IRTF）"
    },
    {
      "indent": 6,
      "text": "* Independent Submission",
      "zh-CHS": "* 独立提交"
    },
    {
      "indent": 3,
      "text": "Request for Comments: <RFC number> This indicates the RFC number, assigned by the RFC Editor upon publication of the document. This element is unchanged.",
      "zh-CHS": "征求意见：<RFC编号>这表示RFC编辑器在发布文档时分配的RFC编号。这个元素没有改变。"
    },
    {
      "indent": 3,
      "text": "<subseries ID> <subseries number> Some document categories are also labeled as a subseries of RFCs. These elements appear as appropriate for such categories, indicating the subseries and the documents number within that series. Currently, there are subseries for BCPs [RFC2026], STDs [RFC1311], and FYIs [RFC1150]. These subseries numbers may appear in several RFCs. For example, when a new RFC obsoletes or updates an old one, the same subseries number is used. Also, several RFCs may be assigned the same subseries number: a single STD, for example, may be composed of several RFCs, each of which will bear the same STD number. This element is unchanged.",
      "zh-CHS": "<subseries ID><subseries number>某些文档类别也被标记为RFC的子系列。这些元素适用于此类类别，表示该系列中的子系列和文档编号。目前，有BCP[RFC2026]、STD[RFC1311]和FYIs[RFC1150]的子系列。这些子系列编号可能出现在多个RFC中。例如，当新RFC淘汰或更新旧RFC时，使用相同的子系列编号。此外，多个RFC可被分配相同的子序列号：例如，单个STD可由多个RFC组成，每个RFC将具有相同的STD号。这个元素没有改变。"
    },
    {
      "indent": 3,
      "text": "[<RFC relation>: <RFC number[s]>] Some relations between RFCs in the series are explicitly noted in the RFC header. For example, a new RFC may update one or more earlier RFCs. Currently two relationships are defined: \"Updates\" and \"Obsoletes\" [RFC2223]. Alternatives like \"Obsoleted by\" are also used (e.g., in [RFC5143]). Other types of relationships may be defined by the RFC Editor and may appear in future RFCs.",
      "zh-CHS": "[<RFC relationship>：<RFC number[s]>]序列中RFC之间的一些关系在RFC标题中明确指出。例如，新的RFC可以更新一个或多个早期RFC。目前定义了两种关系：“更新”和“淘汰”[RFC2223]。还使用了诸如“被淘汰”之类的替代方案（例如，在[RFC5143]中）。其他类型的关系可能由RFC编辑器定义，并可能出现在未来的RFC中。"
    },
    {
      "indent": 3,
      "text": "Category: <category> This indicates the initial RFC document category of the publication. These are defined in [RFC2026]. Currently, this is always one of: Standards Track, Best Current Practice, Experimental, Informational, or Historic. This element is unchanged.",
      "zh-CHS": "类别：<Category>表示出版物的初始RFC文档类别。这些在[RFC2026]中定义。目前，这始终是其中之一：标准跟踪、最佳当前实践、实验性、信息性或历史性。这个元素没有改变。"
    },
    {
      "indent": 0,
      "text": "3.2. The Status of this Memo",
      "section_title": true,
      "zh-CHS": "3.2. 此备忘录的状态"
    },
    {
      "indent": 3,
      "text": "The \"Status of This Memo\" describes the category of the RFC, including the distribution statement. This text is included irrespective of the source stream of the RFC.",
      "zh-CHS": "“本备忘录的状态”描述了RFC的类别，包括分配声明。无论RFC的源流是什么，都会包含此文本。"
    },
    {
      "indent": 3,
      "text": "The \"Status of This Memo\" will start with a single sentence describing the status. It will also include a statement describing the stream-specific review of the material (which is stream-",
      "zh-CHS": "“本备忘录的状态”将以描述状态的一句话开头。它还将包括一个描述材料流特定审查的声明（即流）-"
    },
    {
      "indent": 3,
      "text": "dependent). This is an important component of status, insofar as it clarifies the breadth and depth of review, and gives the reader an understanding of how to consider its content.",
      "zh-CHS": "依赖的）。这是状态的一个重要组成部分，它阐明了审查的广度和深度，并给读者一个如何考虑其内容的理解。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Paragraph 1",
      "section_title": true,
      "zh-CHS": "3.2.1. 第1款"
    },
    {
      "indent": 3,
      "text": "The first paragraph of the Status of this Memo section contains a single sentence, clearly standing out. It depends on the category of the document.",
      "zh-CHS": "本备忘录状态部分的第一段包含一句话，明显突出。这取决于文档的类别。"
    },
    {
      "indent": 3,
      "text": "For 'Standards Track' documents: \"This is an Internet Standards Track document.\"",
      "zh-CHS": "对于“标准跟踪”文档：“这是一个Internet标准跟踪文档。”"
    },
    {
      "indent": 3,
      "text": "For 'Best Current Practices' documents: \"This memo documents an Internet Best Current Practice.\"",
      "zh-CHS": "对于“当前最佳实践”文档：“本备忘录记录了互联网当前最佳实践。”"
    },
    {
      "indent": 3,
      "text": "For other categories: \"This document is not an Internet Standards Track specification; <it is published for other purposes>.\"",
      "zh-CHS": "对于其他类别：“本文档不是Internet标准跟踪规范；<为其他目的发布>”"
    },
    {
      "indent": 3,
      "text": "For Informational, Experimental, Historic and future categories of RFCs, the RFC Editor will maintain an appropriate text for <it is published for other purposes>. Suggested initial values are:",
      "zh-CHS": "对于RFC的信息类、实验类、历史类和未来类，RFC编辑器将为<it is published For other purposes>保留适当的文本。建议的初始值为："
    },
    {
      "indent": 3,
      "text": "Informational: \"it is published for informational purposes.\"",
      "zh-CHS": "信息性：“它是为了提供信息而发布的。”"
    },
    {
      "indent": 3,
      "text": "Historic: \"it is published for the historical record.\"",
      "zh-CHS": "历史：“它是为了历史记录而出版的。”"
    },
    {
      "indent": 3,
      "text": "Experimental: \"it is published for examination, experimental implementation, and evaluation.\"",
      "zh-CHS": "实验：“它是为检查、实验实施和评估而出版的。”"
    },
    {
      "indent": 0,
      "text": "3.2.2. Paragraph 2",
      "section_title": true,
      "zh-CHS": "3.2.2. 第2款"
    },
    {
      "indent": 3,
      "text": "The second paragraph of the \"Status of This Memo\" will now include a paragraph describing the type of review and exposure the document has received. This is defined on a per-stream basis, subject to general review and oversight by the RFC Editor and IAB. There is a specific structure defined here to ensure there is clarity about review processes and document types. These paragraphs will need to be defined and maintained as part of RFC stream definitions. Suggested initial text, for current streams, is provided below.",
      "zh-CHS": "“本备忘录的状态”的第二段现在将包括一段描述该文件收到的审查和披露类型。这是在每个流的基础上定义的，受RFC编辑和IAB的一般审查和监督。这里定义了一个特定的结构，以确保审查过程和文档类型的清晰性。这些段落需要作为RFC流定义的一部分进行定义和维护。下面提供了当前流的建议初始文本。"
    },
    {
      "indent": 3,
      "text": "The paragraph may include some text that is specific to the initial document category; when a document is Experimental or Historic, the second paragraph opens with:",
      "zh-CHS": "该段可能包括一些特定于初始文件类别的文本；当文件是实验性的或历史性的时，第二段以以下内容开头："
    },
    {
      "indent": 3,
      "text": "Experimental: \"This document defines an Experimental Protocol for the Internet community.\"",
      "zh-CHS": "实验性：“本文档为互联网社区定义了一个实验性协议。”"
    },
    {
      "indent": 3,
      "text": "Historic: \"This document defines a Historic Document for the Internet community.\"",
      "zh-CHS": "历史：“本文档定义了互联网社区的历史文档。”"
    },
    {
      "indent": 3,
      "text": "The text that follows is stream dependent -- these are suggested initial values and may be updated by stream definition document updates.",
      "zh-CHS": "下面的文本依赖于流——这些是建议的初始值，可以通过流定义文档更新进行更新。"
    },
    {
      "indent": 3,
      "text": "IETF Stream: \"This document is a product of the Internet Engineering Task Force (IETF).\"",
      "zh-CHS": "IETF流：“本文件是互联网工程任务组（IETF）的产品。”"
    },
    {
      "indent": 6,
      "text": "If there has been an IETF consensus call per IETF process, an additional sentence should be added:",
      "zh-CHS": "如果每个IETF流程都有IETF共识呼叫，则应增加一句话："
    },
    {
      "indent": 9,
      "text": "\"It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG).\"",
      "zh-CHS": "“它代表了IETF社区的共识。它已经得到了公众的审查，并且已经被互联网工程指导小组（IESG）批准出版。”"
    },
    {
      "indent": 6,
      "text": "If there has not been such a consensus call, then this simply reads:",
      "zh-CHS": "如果没有达成这样的共识，那么这只是简单地说："
    },
    {
      "indent": 9,
      "text": "\"It has been approved for publication by the Internet Engineering Steering Group (IESG).\"",
      "zh-CHS": "“它已被互联网工程指导小组（IESG）批准出版。”"
    },
    {
      "indent": 3,
      "text": "IAB Stream: \"This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record.\"",
      "zh-CHS": "IAB Stream：“本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。”"
    },
    {
      "indent": 3,
      "text": "IRTF Stream: \"This document is a product of the Internet Research Task Force (IRTF). The IRTF publishes the results of Internet-related research and development activities. These results might not be suitable for deployment.\"",
      "zh-CHS": "IRTF Stream：“本文件是互联网研究工作组（IRTF）的产品。IRTF发布了与互联网相关的研究和开发活动的结果。这些结果可能不适合部署。”"
    },
    {
      "indent": 6,
      "text": "In addition, a sentence indicating the consensus base within the IRTF may be added:",
      "zh-CHS": "此外，还可添加一句话，说明IRTF内的共识基础："
    },
    {
      "indent": 9,
      "text": "\"This RFC represents the consensus of the <insert_name> Research Group of the Internet Research Task Force (IRTF).\"",
      "zh-CHS": "“本RFC代表了互联网研究工作队（IRTF）的<insert_name>研究小组的共识。”"
    },
    {
      "indent": 6,
      "text": "or alternatively",
      "zh-CHS": "或者"
    },
    {
      "indent": 9,
      "text": "\"This RFC represents the individual opinion(s) of one or more members of the <insert_name> Research Group of the Internet Research Task Force (IRTF).\"",
      "zh-CHS": "“本RFC代表互联网研究工作组（IRTF）的<insert_name>研究小组的一名或多名成员的个人意见。”"
    },
    {
      "indent": 3,
      "text": "Independent Stream: \"This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment.\"",
      "zh-CHS": "独立流：“这是对RFC系列的贡献，独立于任何其他RFC流。RFC编辑器已自行决定发布此文档，并且未对其实现或部署价值做出任何声明。”"
    },
    {
      "indent": 3,
      "text": "For non-IETF stream documents, a reference to Section 2 of this RFC is added with the following sentence:",
      "zh-CHS": "对于非IETF流文件，参考本RFC第2节，添加以下句子："
    },
    {
      "indent": 6,
      "text": "\"Documents approved for publication by the [stream approver -- currently, one of: \"IAB\", \"IRSG\", or \"RFC Editor\"] are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.\"",
      "zh-CHS": "“由[stream approver]批准发布的文件——目前，“IAB”、“IRSG”或“RFC Editor”中的一个文件不适用于任何级别的互联网标准；请参阅RFC 5741第2节。”"
    },
    {
      "indent": 3,
      "text": "For IETF stream documents, a similar reference is added for BCP and Standards Track documents:",
      "zh-CHS": "对于IETF流文件，为BCP和标准跟踪文件添加了类似的参考："
    },
    {
      "indent": 6,
      "text": "\"Further information on [BCPs or Internet Standards] is available in Section 2 of RFC 5741.\"",
      "zh-CHS": "“有关[BCP或互联网标准]的更多信息，请参见RFC 5741第2节。”"
    },
    {
      "indent": 3,
      "text": "For all other categories:",
      "zh-CHS": "对于所有其他类别："
    },
    {
      "indent": 6,
      "text": "\"Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.\"",
      "zh-CHS": "“并非IESG批准的所有文件都适用于任何级别的互联网标准；请参阅RFC 5741第2节。”"
    },
    {
      "indent": 0,
      "text": "3.2.3. Paragraph 3",
      "section_title": true,
      "zh-CHS": "3.2.3. 第3款"
    },
    {
      "indent": 3,
      "text": "The boilerplate ends with a reference to where further relevant information can be found. This information may include, subject to the RFC Editor's discretion, information about whether the RFC has been updated or obsoleted, the RFC's origin, a listing of possible errata, information about how to provide feedback and suggestion, and information on how to submit errata as described in [RFC-ERRATA]. The exact wording and URL is subject to change (at the RFC Editor's discretion), but current text is:",
      "zh-CHS": "样板文件结尾提到了可以找到更多相关信息的地方。根据RFC编辑的判断，该信息可能包括关于RFC是否已更新或废弃的信息、RFC的来源、可能的勘误表列表、关于如何提供反馈和建议的信息，以及关于如何提交[RFC-勘误表]中所述勘误表的信息。确切的措辞和URL可能会发生变化（由RFC编辑自行决定），但当前文本为："
    },
    {
      "indent": 6,
      "text": "\"Information about the current status of this document, any\nerrata, and how to provide feedback on it may be obtained at\nhttp://www.rfc-editor.org/info/rfc<rfc-no>.\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "3.2.4. Noteworthy",
      "section_title": true,
      "zh-CHS": "3.2.4. 值得注意的"
    },
    {
      "indent": 3,
      "text": "Note that the text in paragraph 1 and 2 of the boilerplate indicate the initial status of a document. During their lifetime, documents can change status to e.g., Historic. This cannot be reflected in the document itself and will need be reflected in the information referred to in Section 3.2.3.",
      "zh-CHS": "请注意，样板第1段和第2段中的文本表示文档的初始状态。文档在其生命周期内可以将状态更改为历史状态。这不能反映在文件本身中，需要反映在第3.2.3节中提到的信息中。"
    },
    {
      "indent": 0,
      "text": "3.3. Additional Notes",
      "section_title": true,
      "zh-CHS": "3.3. 附加说明"
    },
    {
      "indent": 3,
      "text": "Exceptionally, a review and publication process may prescribe additional notes that will appear as labeled notes after the \"Status of This Memo\".",
      "zh-CHS": "例外情况下，审查和发布流程可能会规定附加注释，这些注释将在“本备忘录的状态”之后显示为标记注释。"
    },
    {
      "indent": 3,
      "text": "While this has been a common feature of recent RFCs, it is the goal of this document to make the overall RFC structure adequately clear to remove the need for such notes, or at least make their usage truly exceptional.",
      "zh-CHS": "虽然这是最近RFC的一个共同特点，但本文件的目标是使整个RFC结构足够清晰，以消除对此类注释的需要，或至少使其使用真正例外。"
    },
    {
      "indent": 0,
      "text": "3.4. Other Structural Information in RFCs",
      "section_title": true,
      "zh-CHS": "3.4. RFCs中的其他结构信息"
    },
    {
      "indent": 3,
      "text": "RFCs contain other structural informational elements. The RFC Editor is responsible for the positioning and layout of these structural elements. Note also that new elements may be introduced or obsoleted using a process consistent with [RFC4844]. These additions may or may not require documentation in an RFC.",
      "zh-CHS": "RFC包含其他结构信息元素。RFC编辑器负责这些结构元素的定位和布局。还应注意，新元素可采用与[RFC4844]一致的流程引入或淘汰。这些添加可能需要也可能不需要RFC中的文档。"
    },
    {
      "indent": 3,
      "text": "Currently the following structural information is available or is being considered for inclusion in RFCs:",
      "zh-CHS": "目前，以下结构信息可用或正在考虑纳入RFC："
    },
    {
      "indent": 3,
      "text": "Copyright Notice A copyright notice with a reference to BCP 78 [BCP78] and an Intellectual Property statement referring to BCP 78 and BCP 79 [BCP79]. The content of these statements are defined by those BCPs.",
      "zh-CHS": "版权声明提及BCP 78[BCP78]的版权声明以及提及BCP 78和BCP 79[BCP79]的知识产权声明。这些语句的内容由这些BCP定义。"
    },
    {
      "indent": 3,
      "text": "ISSN The International Standard Serial Number [ISO3297]: ISSN 2070-1721. The ISSN uniquely identifies the RFC series as title regardless of language or country in which it is published. The ISSN itself has no significance other than the unique identification of a serial publication.",
      "zh-CHS": "ISSN国际标准序列号[ISO3297]：ISSN 2070-1721。ISSN将RFC系列唯一标识为标题，而不考虑其出版的语言或国家。ISSN本身除了对系列出版物进行唯一标识外，没有其他意义。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "zh-CHS": "4. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This document tries to clarify the descriptions of the status of an RFC. Misunderstanding the status of a memo could cause interoperability problems, hence security and stability problems.",
      "zh-CHS": "本文件试图澄清RFC状态的描述。误解备忘录的状态可能会导致互操作性问题，从而导致安全性和稳定性问题。"
    },
    {
      "indent": 0,
      "text": "5. RFC Editor Considerations",
      "section_title": true,
      "zh-CHS": "5. RFC编辑器注意事项"
    },
    {
      "indent": 3,
      "text": "The RFC Editor is responsible for maintaining the consistency of the RFC series. To that end the RFC Editor maintains a style manual [RFC-style]. In this memo we mention a few explicit structural elements that the RFC Editor needs to maintain. The conventions for the content and use of all current and future elements are to be documented in the style manual.",
      "zh-CHS": "RFC编辑器负责维护RFC系列的一致性。为此，RFC编辑器维护样式手册[RFC style]。在本备忘录中，我们提到了RFC编辑器需要维护的几个明确的结构元素。所有当前和未来元素的内容和使用约定将记录在样式手册中。"
    },
    {
      "indent": 3,
      "text": "Adding a reference to the stream in the header of RFCs is only one method for clarifying from which stream an RFC originated. The RFC Editor is encouraged to add such indication in e.g., indices and interfaces.",
      "zh-CHS": "在RFC头中添加对流的引用只是澄清RFC来自哪个流的一种方法。建议RFC编辑器在索引和接口中添加此类指示。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "zh-CHS": "6. 工具书类"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "zh-CHS": "6.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5742] Alvestrand, H. and R. Housley, \"IESG Procedures for Handling of Independent and IRTF Stream Submissions\", BCP 92, RFC 5742, December 2009.",
      "zh-CHS": "[RFC5742]Alvestrand，H.和R.Housley，“IESG处理独立和IRTF流提交的程序”，BCP 92，RFC 5742，2009年12月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "zh-CHS": "6.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[ISO3297] Technical Committee ISO/TC 46, Information and documentation, Subcommittee SC 9, Identification and description., \"Information and documentation - International standard serial number (ISSN)\", 09 2007.",
      "zh-CHS": "[ISO3297]技术委员会ISO/TC 46，信息和文件，小组委员会SC 9，识别和描述，“信息和文件-国际标准序列号（ISSN）”，2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC0003] Crocker, S., \"Documentation conventions\", RFC 3, April 1969.",
      "zh-CHS": "[RFC0003]Crocker，S.，“文件惯例”，RFC 3，1969年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1311] Postel, J., \"Introduction to the STD Notes\", RFC 1311, March 1992.",
      "zh-CHS": "[RFC1311]Postel，J.，“标准说明简介”，RFC13111992年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC1150] Malkin, G. and J. Reynolds, \"FYI on FYI: Introduction to the FYI Notes\", RFC 1150, March 1990.",
      "zh-CHS": "[RFC1150]Malkin，G.和J.Reynolds，“关于FYI的FYI：FYI注释简介”，RFC 1150，1990年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2223] Postel, J. and J. Reynolds, \"Instructions to RFC Authors\", RFC 2223, October 1997.",
      "zh-CHS": "[RFC2223]Postel，J.和J.Reynolds，“RFC作者须知”，RFC 2223，1997年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2629] Rose, M., \"Writing I-Ds and RFCs using XML\", RFC 2629, June 1999.",
      "zh-CHS": "[RFC2629]Rose，M.，“使用XML编写I-D和RFC”，RFC 26292999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4844] Daigle, L. and Internet Architecture Board, \"The RFC Series and RFC Editor\", RFC 4844, July 2007.",
      "zh-CHS": "[RFC4844]Daigle，L.和互联网架构委员会，“RFC系列和RFC编辑器”，RFC 48442007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5143] Malis, A., Brayley, J., Shirron, J., Martini, L., and S. Vogelsang, \"Synchronous Optical Network/Synchronous Digital Hierarchy (SONET/SDH) Circuit Emulation Service over MPLS (CEM) Encapsulation\", RFC 5143, February 2008.",
      "zh-CHS": "[RFC5143]Malis，A.，Brayley，J.，Shirron，J.，Martini，L.，和S.Vogelsang，“基于MPLS（CEM）封装的同步光网络/同步数字体系（SONET/SDH）电路仿真服务”，RFC 51432008年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC-ERRATA] Hagens, A., Ginoza, S., and R. Braden, \"RFC Editor Proposal for Handling RFC Errata\", Work in Progress, May 2008.",
      "zh-CHS": "[RFC-勘误表]Hagens，A.，Ginoza，S.，和R.Braden，“处理RFC勘误表的RFC编辑建议书”，正在进行的工作，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[BCP78] Bradner, S., Ed. and J. Contreras, Ed., \"Rights Contributors Provide to the IETF Trust\", BCP 78, RFC 5378, November 2008.",
      "zh-CHS": "[BCP78]Bradner，S.，Ed.和J.Contreras，Ed.，“IETF信托的权利出资人”，BCP 78，RFC 5378，2008年11月。"
    },
    {
      "indent": 3,
      "text": "[BCP79] Bradner, S., Ed. and T. Narten, Ed., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3979, April 2007.",
      "zh-CHS": "[BCP79]Bradner，S.，Ed.和T.Narten，Ed.，“IETF技术中的知识产权”，BCP 79，RFC 3979，2007年4月。"
    },
    {
      "indent": 17,
      "text": "Narten, T., \"Clarification of the Third Party Disclosure Procedure in RFC 3979\", BCP 79, RFC 4879, April 2007.",
      "zh-CHS": "Narten，T.，“RFC 3979中第三方披露程序的澄清”，BCP 79，RFC 4879，2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC-style] RFC Editor, \"RFC Style Guide\", <http://www.rfc-editor.org/styleguide.html>.",
      "zh-CHS": "[RFC样式]RFC编辑器，“RFC样式指南”<http://www.rfc-editor.org/styleguide.html>."
    },
    {
      "indent": 0,
      "text": "Appendix A. Some Example 'Status of This Memo' Boilerplates",
      "section_title": true,
      "zh-CHS": "附录A.一些示例“本备忘录的状态”样板"
    },
    {
      "indent": 0,
      "text": "A.1. IETF Standards Track",
      "section_title": true,
      "zh-CHS": "A.1. IETF标准跟踪"
    },
    {
      "indent": 3,
      "text": "The boilerplate for a Standards Track document that (by definition) has been subject to an IETF consensus call.",
      "zh-CHS": "标准跟踪文档的样板文件（根据定义）已通过IETF共识调用。"
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\nStatus of This Memo",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "zh-CHS": "这是一份互联网标准跟踪文件。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关互联网标准的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 0,
      "text": "   Information about the current status of this document, any\n   errata, and how to provide feedback on it may be obtained at\n   http://www.rfc-editor.org/info/rfc<rfc-no>.\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "A.2. IETF Experimental, with Consensus Call",
      "section_title": true,
      "zh-CHS": "A.2. IETF实验性，具有共识呼叫"
    },
    {
      "indent": 3,
      "text": "The boilerplate for an Experimental document that has been subject to an IETF consensus call.",
      "zh-CHS": "已通过IETF协商一致要求的实验文件样板。"
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\nStatus of This Memo",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为检查、实验实施和评估而发布的。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文档为互联网社区定义了一个实验协议。本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 0,
      "text": "   Information about the current status of this document, any\n   errata, and how to provide feedback on it may be obtained at\n   http://www.rfc-editor.org/info/rfc<rfc-no>.\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "A.3. IETF Experimental, No Consensus Call",
      "section_title": true,
      "zh-CHS": "A.3. IETF实验性，没有一致意见"
    },
    {
      "indent": 3,
      "text": "The boilerplate for an Experimental document that not has been subject to an IETF consensus call.",
      "zh-CHS": "未经IETF协商一致调用的实验文件样板。"
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\nStatus of This Memo",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为检查、实验实施和评估而发布的。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文档为互联网社区定义了一个实验协议。本文件是互联网工程任务组（IETF）的产品。互联网工程指导小组（IESG）已批准将其出版。并非IESG批准的所有文件都适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 0,
      "text": "   Information about the current status of this document, any\n   errata, and how to provide feedback on it may be obtained at\n   http://www.rfc-editor.org/info/rfc<rfc-no>.\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "A.4. IAB Informational",
      "section_title": true,
      "zh-CHS": "A.4. IAB信息"
    },
    {
      "indent": 3,
      "text": "The boilerplate for an Informational IAB document.",
      "zh-CHS": "信息性IAB文档的样板文件。"
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\nStatus of This Memo",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网体系结构委员会（IAB）的产品，代表IAB认为有价值提供永久记录的信息。IAB批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 0,
      "text": "   Information about the current status of this document, any\n   errata, and how to provide feedback on it may be obtained at\n   http://www.rfc-editor.org/info/rfc<rfc-no>.\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "A.5. IRTF Experimental, No Consensus Call",
      "section_title": true,
      "zh-CHS": "A.5. IRTF实验性，没有一致意见"
    },
    {
      "indent": 3,
      "text": "The boilerplate for an Experimental document that has been produced by the IRTF and for which there was no RG consensus. This variation is the most verbose boilerplate in the current set.",
      "zh-CHS": "IRTF制作的实验性文件样板，没有达成一致意见。此变体是当前集合中最详细的样板文件。"
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\nStatus of This Memo",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为检查、实验实施和评估而发布的。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Research Task Force (IRTF). The IRTF publishes the results of Internet-related research and development activities. These results might not be suitable for deployment. This RFC represents the individual opinion(s) of one or more members of the <insert_name> Research Group of the Internet Research Task Force (IRTF). Documents approved for publication by the IRSG are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "本文档为互联网社区定义了一个实验协议。本文件是互联网研究工作组（IRTF）的产品。IRTF发布互联网相关研究和开发活动的结果。这些结果可能不适合部署。本RFC代表互联网研究工作组（IRTF）的<insert_name>研究小组的一名或多名成员的个人意见。IRSG批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 0,
      "text": "   Information about the current status of this document, any\n   errata, and how to provide feedback on it may be obtained at\n   http://www.rfc-editor.org/info/rfc<rfc-no>.\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "A.6. Independent Submission Informational",
      "section_title": true,
      "zh-CHS": "A.6. 独立提交信息"
    },
    {
      "indent": 3,
      "text": "The boilerplate for an Informational document that has been produced by the Independent Submission stream.",
      "zh-CHS": "由独立提交流生成的信息文档的样板文件。"
    },
    {
      "indent": 0,
      "text": "------------------------------------------------------------------------\nStatus of This Memo",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "zh-CHS": "本文件不是互联网标准跟踪规范；它是为了提供信息而发布的。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "zh-CHS": "这是对RFC系列的贡献，独立于任何其他RFC流。RFC编辑器已选择自行发布此文档，并且未声明其对实现或部署的价值。RFC编辑批准发布的文件不适用于任何级别的互联网标准；见RFC 5741第2节。"
    },
    {
      "indent": 0,
      "text": "   Information about the current status of this document, any\n   errata, and how to provide feedback on it may be obtained at\n   http://www.rfc-editor.org/info/rfc<rfc-no>.\n------------------------------------------------------------------------",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Appendix B. IAB Members at Time of Approval",
      "section_title": true,
      "zh-CHS": "附录B.批准时的IAB成员"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time this memo was approved were (in alphabetical order): Loa Andersson, Gonzalo Camarillo, Stuart Cheshire, Russ Housley, Olaf Kolkman, Gregory Lebovitz, Barry Leiba, Kurtis Lindqvist, Andrew Malis, Danny McPherson, David Oran, Dave Thaler, and Lixia Zhang. In addition, the IAB included two ex-officio members: Dow Street, who was serving as the IAB Executive Director, and Aaron Falk, who was serving as the IRTF Chair.",
      "zh-CHS": "在本备忘录获得批准时，IAB成员（按字母顺序排列）：Loa Andersson、Gonzalo Camarillo、Stuart Cheshire、Russ Housley、Olaf Kolkman、Gregory Lebovitz、Barry Leiba、Kurtis Lindqvist、Andrew Malis、Danny McPherson、David Oran、Dave Thaler和Lixia Zhang。此外，IAB还包括两名当然成员：担任IAB执行董事的陶氏街和担任IRTF主席的亚伦·福克。"
    },
    {
      "indent": 0,
      "text": "Appendix C. Acknowledgements",
      "section_title": true,
      "zh-CHS": "附录C.确认书"
    },
    {
      "indent": 3,
      "text": "Thanks to Bob Braden, Brian Carpenter, Steve Crocker, Sandy Ginoza, and John Klensin who provided background information and inspiration.",
      "zh-CHS": "感谢提供背景信息和灵感的鲍勃·布拉登、布赖恩·卡彭特、史蒂夫·克罗克、桑迪·吉诺萨和约翰·克伦辛。"
    },
    {
      "indent": 3,
      "text": "Various people have made suggestions that improved the document. Among them are: Lars Eggert, Alfred Hoenes, and Joe Touch.",
      "zh-CHS": "许多人提出了改进该文件的建议。其中包括：拉尔斯·艾格特、阿尔弗雷德·霍恩斯和乔·图奇。"
    },
    {
      "indent": 3,
      "text": "This document was produced using the xml2rfc tool [RFC2629].",
      "zh-CHS": "本文档是使用xml2rfc工具[RFC2629]生成的。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Leslie Daigle (editor) EMail: daigle@isoc.org, leslie@thinkingcat.com",
      "zh-CHS": "Leslie Daigle（编辑）电子邮件：daigle@isoc.org, leslie@thinkingcat.com"
    },
    {
      "indent": 3,
      "text": "Olaf M. Kolkman (editor) EMail: olaf@nlnetlabs.nl",
      "zh-CHS": "Olaf M.Kolkman（编辑）电子邮件：olaf@nlnetlabs.nl"
    },
    {
      "indent": 3,
      "text": "Internet Architecture Board EMail: iab@iab.org",
      "zh-CHS": "互联网架构委员会电子邮件：iab@iab.org"
    }
  ]
}