{
  "title": {
    "text": "RFC 5644: IP Performance Metrics (IPPM): Spatial and Multicast",
    "zh-CHS": "RFC 5644"
  },
  "number": 5644,
  "created_at": "2021-11-08 06:34:54.616542+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         E. Stephan\nRequest for Comments: 5644                                France Telecom\nCategory: Standards Track                                       L. Liang\n                                                    University of Surrey\n                                                               A. Morton\n                                                               AT&T Labs\n                                                            October 2009",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "IP Performance Metrics (IPPM): Spatial and Multicast",
      "zh-CHS": "IP性能指标（IPPM）：空间和多播"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The IETF has standardized IP Performance Metrics (IPPM) for measuring end-to-end performance between two points. This memo defines two new categories of metrics that extend the coverage to multiple measurement points. It defines spatial metrics for measuring the performance of segments of a source to destination path, and metrics for measuring the performance between a source and many destinations in multiparty communications (e.g., a multicast tree).",
      "zh-CHS": "IETF制定了标准化IP性能指标（IPPM），用于测量两点之间的端到端性能。本备忘录定义了两种新的度量类别，将覆盖范围扩展到多个测量点。它定义了用于测量源到目的地路径段性能的空间度量，以及用于测量多方通信（例如，多播树）中源和多个目的地之间的性能的度量。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括《信托法律条款》第4.e节中所述的简化BSD许可文本，并且提供BSD许可中所述的代码组件时不提供任何担保。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow",
      "zh-CHS": "本文件可能包含2008年11月10日之前发布或公开的IETF文件或IETF贡献中的材料。控制某些材料版权的人可能没有授予IETF信托允许的权利"
    },
    {
      "indent": 3,
      "text": "modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "zh-CHS": "在IETF标准过程之外修改此类材料。在未从控制此类材料版权的人员处获得充分许可的情况下，不得在IETF标准流程之外修改本文件，也不得在IETF标准流程之外创建其衍生作品，除了将其格式化以RFC形式发布或将其翻译成英语以外的其他语言。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction and Scope ..........................................3\n2. Terminology .....................................................4\n3. Brief Metric Descriptions .......................................7\n4. Motivations ....................................................10\n5. Spatial Vector Metrics Definitions .............................12\n6. Spatial Segment Metrics Definitions ............................19\n7. One-to-Group Metrics Definitions ...............................27\n8. One-to-Group Sample Statistics .................................30\n9. Measurement Methods: Scalability and Reporting .................40\n10. Manageability Considerations ..................................44\n11. Security Considerations .......................................49\n12. Acknowledgments ...............................................50\n13. IANA Considerations ...........................................50\n14. References ....................................................56\n   14.1. Normative References .....................................56\n   14.2. Informative References ...................................57",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction and Scope",
      "section_title": true,
      "zh-CHS": "1. 导言和范围"
    },
    {
      "indent": 3,
      "text": "IETF has standardized IP Performance Metrics (IPPM) for measuring end-to-end performance between two points. This memo defines two new categories of metrics that extend the coverage to multiple measurement points. It defines spatial metrics for measuring the performance of segments of a source to destination path, and metrics for measuring the performance between a source and many destinations in multiparty communications (e.g., a multicast tree).",
      "zh-CHS": "IETF有标准化的IP性能度量（IPPM），用于测量两点之间的端到端性能。本备忘录定义了两种新的度量类别，将覆盖范围扩展到多个测量点。它定义了用于测量源到目的地路径段性能的空间度量，以及用于测量多方通信（例如，多播树）中源和多个目的地之间的性能的度量。"
    },
    {
      "indent": 3,
      "text": "The purpose of this memo is to define metrics to fulfill the new requirements of measurement involving multiple measurement points. Spatial metrics measure the performance of each segment along a path. One-to-group metrics measure the performance for a group of users. These metrics are derived from one-way end-to-end metrics, all of which follow the IPPM framework [RFC2330].",
      "zh-CHS": "本备忘录旨在定义指标，以满足涉及多个测量点的新测量要求。空间度量度量沿路径测量每个分段的性能。一对一指标衡量一组用户的性能。这些指标源自单向端到端指标，所有这些指标都遵循IPPM框架[RFC2330]。"
    },
    {
      "indent": 3,
      "text": "This memo is organized as follows: Section 2 introduces new terms that extend the original IPPM framework [RFC2330]. Section 3 briefly introduces the new metrics, and Section 4 motivates each metric category. Sections 5 through 8 develop each category of metrics with definitions and statistics. Then the memo discusses the impact of the measurement methods on the scalability and proposes an information model for reporting the measurements. Finally, the memo discusses security aspects related to measurement and registers the metrics in the IANA IP Performance Metrics Registry [RFC4148].",
      "zh-CHS": "本备忘录组织如下：第2节介绍了扩展原始IPPM框架[RFC2330]的新术语。第3节简要介绍了新指标，第4节介绍了每个指标类别。第5节至第8节用定义和统计数据开发了每一类指标。然后，备忘录讨论了度量方法对可伸缩性的影响，并提出了报告度量的信息模型。最后，备忘录讨论了与度量相关的安全方面，并在IANA IP性能度量注册表[RFC4148]中注册度量。"
    },
    {
      "indent": 3,
      "text": "The scope of this memo is limited to metrics using a single source packet or stream, and observations of corresponding packets along the path (spatial), at one or more destinations (one-to-group), or both. Note that all the metrics defined herein are based on observations of packets dedicated to testing, a process that is called active measurement. Passive measurement (for example, a spatial metric based on the observation of user traffic) is beyond the scope of this memo.",
      "zh-CHS": "本备忘录的范围仅限于使用单个源数据包或数据流的度量，以及沿路径（空间）、在一个或多个目的地（一对一）或两者的对应数据包的观察。注意，本文定义的所有度量都基于对专用于测试的数据包的观察，该过程称为主动测量。被动测量（例如，基于用户流量观测的空间度量）超出了本备忘录的范围。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "zh-CHS": "1.1. 需求语言"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 0,
      "text": "2.1. Naming of the Metrics",
      "section_title": true,
      "zh-CHS": "2.1. 指标的命名"
    },
    {
      "indent": 3,
      "text": "The names of the metrics, including capitalized letters, are as close as possible of the names of the one-way end-to-end metrics they are derived from.",
      "zh-CHS": "度量的名称（包括大写字母）尽可能接近其派生的单向端到端度量的名称。"
    },
    {
      "indent": 0,
      "text": "2.2. Terms Defined Elsewhere",
      "section_title": true,
      "zh-CHS": "2.2. 其他地方定义的术语"
    },
    {
      "indent": 3,
      "text": "host: section 5 of RFC 2330",
      "zh-CHS": "主持人：RFC 2330第5节"
    },
    {
      "indent": 3,
      "text": "router: section 5 of RFC 2330",
      "zh-CHS": "路由器：RFC 2330第5节"
    },
    {
      "indent": 3,
      "text": "loss threshold: section 2.8.2 of RFC 2680",
      "zh-CHS": "损失阈值：RFC 2680第2.8.2节"
    },
    {
      "indent": 3,
      "text": "path: section 5 of RFC 2330",
      "zh-CHS": "路径：RFC 2330第5节"
    },
    {
      "indent": 3,
      "text": "sample: section 11 of RFC 2330",
      "zh-CHS": "样本：RFC 2330第11节"
    },
    {
      "indent": 3,
      "text": "singleton: section 11 of RFC 2330",
      "zh-CHS": "单身人士：RFC 2330第11节"
    },
    {
      "indent": 0,
      "text": "2.3. Routers Digest",
      "section_title": true,
      "zh-CHS": "2.3. 路由器文摘"
    },
    {
      "indent": 3,
      "text": "The list of the routers on the path from the source to the destination that act as points of interest, also referred to as the routers digest.",
      "zh-CHS": "从源到目标路径上作为关注点的路由器列表，也称为路由器摘要。"
    },
    {
      "indent": 0,
      "text": "2.4. Multiparty Metric",
      "section_title": true,
      "zh-CHS": "2.4. 多方度量"
    },
    {
      "indent": 3,
      "text": "A metric is said to be multiparty if the topology involves more than one measurement collection point. All multiparty metrics designate a set of hosts as \"points of interest\", where one host is the source and other hosts are the measurement collection points. For example, if the set of points of interest is < ha, hb, hc, ..., hn >, where ha is the source and < hb, hc, ..., hn > are the destinations, then measurements may be conducted between < ha, hb>, < ha, hc>, ..., <ha, hn >.",
      "zh-CHS": "如果拓扑涉及多个度量收集点，则称度量为多方。所有多方度量都将一组主机指定为“关注点”，其中一个主机是源主机，其他主机是度量收集点。例如，如果关注点集是<ha，hb，hc，…，hn>，其中ha是源，<hb，hc，…，hn>是目的地，则可以在<ha，hb>，<ha，hc>，…，<ha，hn>之间进行测量。"
    },
    {
      "indent": 3,
      "text": "For the purposes of this memo (reflecting the scope of a single source), the only multiparty metrics are one-to-group metrics.",
      "zh-CHS": "就本备忘录而言（反映单一来源的范围），唯一的多方指标是一对一指标。"
    },
    {
      "indent": 0,
      "text": "2.5. Spatial Metric",
      "section_title": true,
      "zh-CHS": "2.5. 空间度量"
    },
    {
      "indent": 3,
      "text": "A metric is said to be spatial if one of the hosts (measurement collection points) involved is neither the source nor a destination of the measured packet(s). Such measurement hosts will usually be routers that are members of the routers digest.",
      "zh-CHS": "如果所涉及的主机（测量收集点）之一既不是所测量数据包的源也不是目的地，则称度量为空间度量。此类测量主机通常是属于路由器摘要的路由器。"
    },
    {
      "indent": 0,
      "text": "2.6. One-to-Group Metric",
      "section_title": true,
      "zh-CHS": "2.6. 一对群度量"
    },
    {
      "indent": 3,
      "text": "A metric is said to be one-to-group if the measured packet is sent by one source and (potentially) received by more than one destination. Thus, the topology of the communication group can be viewed as a center-distributed or server-client topology with the source as the center/server in the topology.",
      "zh-CHS": "如果测量数据包由一个源发送并且（可能）由多个目的地接收，则称度量为一对一分组。因此，可以将通信组的拓扑视为中心分布式拓扑或服务器-客户端拓扑，其中源为拓扑中的中心/服务器。"
    },
    {
      "indent": 0,
      "text": "2.7. Points of Interest",
      "section_title": true,
      "zh-CHS": "2.7. 兴趣点"
    },
    {
      "indent": 3,
      "text": "Points of interest are the hosts (as per the RFC 2330 definition, \"hosts\" include routing nodes) that are measurement collection points, which are a sub-set of the set of hosts involved in the delivery of the packets (in addition to the source itself).",
      "zh-CHS": "感兴趣的点是作为测量收集点的主机（根据RFC 2330定义，“主机”包括路由节点），该测量收集点是数据包交付所涉及的主机集的子集（除了源本身）。"
    },
    {
      "indent": 3,
      "text": "For spatial metrics, points of interest are a (possibly arbitrary) sub-set of all the routers involved in the path.",
      "zh-CHS": "对于空间度量，关注点是路径中涉及的所有路由器的子集（可能是任意的）。"
    },
    {
      "indent": 3,
      "text": "Points of interest of one-to-group metrics are the intended destination hosts for packets from the source (in addition to the source itself).",
      "zh-CHS": "“一对一”度量的关注点是源数据包的预期目标主机（除了源本身）。"
    },
    {
      "indent": 25,
      "text": "Src                   Dst\n`.          ,-.\n  `.      ,'   `...... 1\n    `.   ;       :\n      `. ;       :\n        ;         :... 2\n        |         |\n        :         ;\n         :       ;.... 3\n         :       ;\n          `.   ,'\n            `-'....... I",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 1: One-to-Group Points of Interest",
      "zh-CHS": "图1：一组兴趣点"
    },
    {
      "indent": 3,
      "text": "A candidate point of interest for spatial metrics is a router from the set of routers involved in the delivery of the packets from source to destination.",
      "zh-CHS": "空间度量的候选关注点是一组路由器中的路由器，该路由器涉及从源到目的地的分组交付。"
    },
    {
      "indent": 25,
      "text": "Src ------.           Hosts\n           \\\n            `---X   --- 1\n                \\\n                 x\n                /\n     .---------X   ---- 2\n   /\n  x\n   ...\n   `---X           ---- ...\n          \\\n           \\\n            \\\n             X     ---- J\n              \\\n               \\\n                \\\n                 `---- Dst",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Note: 'X' are nodes that are points of interest, 'x' are nodes that are not points of interest",
      "zh-CHS": "注意：“X”是指感兴趣的节点，“X”是指非感兴趣的节点"
    },
    {
      "indent": 19,
      "text": "Figure 2: Spatial Points of Interest",
      "zh-CHS": "图2：感兴趣的空间点"
    },
    {
      "indent": 0,
      "text": "2.8. Reference Point",
      "section_title": true,
      "zh-CHS": "2.8. 参考点"
    },
    {
      "indent": 3,
      "text": "A reference point is defined as the server where the statistical calculations will be carried out. It is usually a centralized server in the measurement architecture that is controlled by a network operator, where measurement data can be collected for further processing. The reference point is distinctly different from hosts at measurement collection points, where the actual measurements are carried out (e.g., points of interest).",
      "zh-CHS": "参考点定义为进行统计计算的服务器。它通常是测量体系结构中由网络运营商控制的集中式服务器，可在其中收集测量数据以供进一步处理。参考点与测量采集点处的主机明显不同，在采集点进行实际测量（例如，关注点）。"
    },
    {
      "indent": 0,
      "text": "2.9. Vector",
      "section_title": true,
      "zh-CHS": "2.9. 矢量"
    },
    {
      "indent": 3,
      "text": "A vector is a set of singletons (single atomic results) comprised of observations corresponding to a single source packet at different hosts in a network. For instance, if the one-way delay singletons observed at N receivers for Packet P sent by the source Src are dT1, dT2,..., dTN, then a vector V with N elements can be organized as {dT1, dT2,..., dTN}. The element dT1 is distinct from all others as the singleton at receiver 1 in response to a packet sent from the source at a specific time. The complete vector gives information over the dimension of space, a set of N receivers in this example.",
      "zh-CHS": "向量是一组单例（单原子结果），由与网络中不同主机上的单个源数据包相对应的观测值组成。例如，如果在源Src发送的分组P的N个接收器处观察到的单向延迟单例是dT1，dT2，…，dTN，则具有N个元素的向量V可以被组织为{dT1，dT2，…，dTN}。元素dT1与所有其他元素不同，作为接收器1处响应于在特定时间从源发送的分组的单例。完整向量给出了空间维度上的信息，在本例中是一组N个接收器。"
    },
    {
      "indent": 3,
      "text": "The singleton elements of any vector are distinctly different from each other in terms of their measurement collection point. Different vectors for common measurement points of interest are distinguished by the source packet sending time.",
      "zh-CHS": "任何向量的单态元素在其测量收集点方面都明显不同。通过源数据包发送时间来区分感兴趣的公共测量点的不同向量。"
    },
    {
      "indent": 0,
      "text": "2.10. Matrix",
      "section_title": true,
      "zh-CHS": "2.10. 矩阵"
    },
    {
      "indent": 3,
      "text": "Several vectors form a matrix, which contains results observed over a sampling interval at different places in a network at different times. For example, the one-way delay vectors V1={dT11, dT12,..., dT1N}, V2={dT21, dT22,..., dT2N},..., Vm={dTm1, dTm2,..., dTmN} for Packet P1, P2,...,Pm, form a one-way delay Matrix {V1, V2,...,Vm}. The matrix organizes the vector information to present network performance in both space and time.",
      "zh-CHS": "多个向量构成一个矩阵，其中包含在网络中不同位置、不同时间的采样间隔内观察到的结果。例如，分组P1、P2、…、Pm的单向延迟向量V1={dT11、dT12、…、dT1N}、V2={dT21、dT22、…、dT2N}、…、Vm={dTm1、dTm2、…、dTmN}形成单向延迟矩阵{V1、V2、…、Vm}。矩阵组织矢量信息，以呈现网络在空间和时间上的性能。"
    },
    {
      "indent": 3,
      "text": "A one-dimensional matrix (row) corresponds to a sample in simple point-to-point measurement.",
      "zh-CHS": "一维矩阵（行）对应于简单点到点测量中的样本。"
    },
    {
      "indent": 3,
      "text": "The relationship among singleton, sample, vector, and matrix is illustrated in Figure 3.",
      "zh-CHS": "单例、样本、向量和矩阵之间的关系如图3所示。"
    },
    {
      "indent": 10,
      "text": "       points of        singleton\n       interest           /       samples(time)\n        ,----.    ^      /\n       /   R1.....|  / R1dT1   R1dT2   R1dT3 ... R3dTk \\\n      /         \\ | |                                   |\n     ;  R2........| |  R2dT1   R2dT2   R2dT3 ... R3dTk  |\nSrc  |           || |                                   |\n     |      R3....| |  R3dT1   R3dT2   R3dT3 ... R3dTk  |\n     |           || |                                   |\n     :           ;| |                                   |\n      \\         / | |                                   |\n       \\  Rn......|  \\ RndT1   RndT2   RndT3 ... RndTk /\n        `-----'   +-------------------------------------> time",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 31,
      "text": " vector matrix (space) (time and space)",
      "zh-CHS": "向量矩阵（空间）（时间和空间）"
    },
    {
      "indent": 5,
      "text": "Figure 3: Relationship between Singletons, Samples, Vectors, and Matrix",
      "zh-CHS": "图3：单例、样本、向量和矩阵之间的关系"
    },
    {
      "indent": 0,
      "text": "3. Brief Metric Descriptions",
      "section_title": true,
      "zh-CHS": "3. 简要度量说明"
    },
    {
      "indent": 3,
      "text": "The metrics for spatial and one-to-group measurement are based on the source-to-destination, or end-to-end metrics defined by IETF in [RFC2679], [RFC2680], [RFC3393], and [RFC3432].",
      "zh-CHS": "空间和一对一组测量的度量基于源到目的地或IETF在[RFC2679]、[RFC2680]、[RFC3393]和[RFC3432]中定义的端到端度量。"
    },
    {
      "indent": 3,
      "text": "This memo defines seven new spatial metrics using the [RFC2330] framework of parameters, units of measure, and measurement methodologies. Each definition includes a section that describes measurement constraints and issues, and provides guidance to increase the accuracy of the results.",
      "zh-CHS": "本备忘录使用[RFC2330]参数、度量单位和度量方法框架定义了七个新的空间度量。每个定义都包含一个部分，描述测量约束和问题，并提供提高结果准确性的指南。"
    },
    {
      "indent": 3,
      "text": "The spatial metrics are:",
      "zh-CHS": "空间指标包括："
    },
    {
      "indent": 3,
      "text": "o Type-P-Spatial-One-way-Delay-Vector divides the end-to-end Type-P-One-way-Delay [RFC2679] into a spatial vector of one-way delay singletons.",
      "zh-CHS": "o Type-P-spatical-One-way-Delay-Vector将端到端Type-P-One-way-Delay[RFC2679]划分为单向延迟单态的空间向量。"
    },
    {
      "indent": 3,
      "text": "o Type-P-Spatial-One-way-Packet-Loss-Vector divides an end-to-end Type-P-One-way-Packet-Loss [RFC2680] into a spatial vector of packet loss singletons.",
      "zh-CHS": "o Type-P-spatical-One-way-Packet-Loss-Vector将端到端Type-P-One-way-Packet-Loss[RFC2680]划分为分组丢失单态的空间向量。"
    },
    {
      "indent": 3,
      "text": "o Type-P-Spatial-One-way-ipdv-Vector divides an end-to-end Type-P-One-way-ipdv into a spatial vector of ipdv (IP Packet Delay Variation) singletons.",
      "zh-CHS": "o P-Spatial-One-way-ipdv-Vector类型将端到端P-One-way-ipdv类型划分为ipdv（IP分组延迟变化）单态的空间向量。"
    },
    {
      "indent": 3,
      "text": "o Using elements of the Type-P-Spatial-One-way-Delay-Vector metric, a sample called Type-P-Segment-One-way-Delay-Stream collects one-way delay metrics between two points of interest on the path over time.",
      "zh-CHS": "o 使用类型P-空间-单向延迟-向量度量的元素，称为类型P-段-单向延迟-流的样本收集路径上随时间变化的两个关注点之间的单向延迟度量。"
    },
    {
      "indent": 3,
      "text": "o Likewise, using elements of the Type-P-Spatial-Packet-Loss-Vector metric, a sample called Type-P-Segment-Packet-Loss-Stream collects one-way delay metrics between two points of interest on the path over time.",
      "zh-CHS": "o 类似地，使用Type-P-Spatial-Packet-Loss-Vector度量的元素，称为Type-P-Segment-Packet-Loss-Stream的样本收集路径上两个关注点之间随时间变化的单向延迟度量。"
    },
    {
      "indent": 3,
      "text": "o Using the Type-P-Spatial-One-way-Delay-Vector metric, a sample called Type-P-Segment-ipdv-prev-Stream will be introduced to compute ipdv metrics (using the previous packet selection function) between two points of interest on the path over time.",
      "zh-CHS": "o 使用Type-P-spatical-One-way-Delay-Vector度量，将引入称为Type-P-Segment-ipdv-prev-Stream的样本来计算路径上随时间变化的两个关注点之间的ipdv度量（使用先前的分组选择函数）。"
    },
    {
      "indent": 3,
      "text": "o Again using the Type-P-Spatial-One-way-Delay-Vector metric, a sample called Type-P-Segment-ipdv-min-Stream will define another set of ipdv metrics (using the minimum delay packet selection function) between two points of interest on the path over time.",
      "zh-CHS": "o 再次使用Type-P-spatical-One-way-Delay-Vector度量，称为Type-P-Segment-ipdv-min-Stream的样本将在路径上随时间变化的两个关注点之间定义另一组ipdv度量（使用最小延迟分组选择函数）。"
    },
    {
      "indent": 3,
      "text": "The memo also defines three one-to-group metrics to measure the one-way performance between a source and a group of receivers. They are:",
      "zh-CHS": "备忘录还定义了三个一对一指标，用于衡量一个源和一组接收器之间的单向性能。他们是："
    },
    {
      "indent": 3,
      "text": "o Type-P-One-to-group-Delay-Vector which collects the set of Type-P-One-way-Delay singletons between one sender and N receivers;",
      "zh-CHS": "o P型一对群延迟向量，用于收集一个发送方和N个接收方之间的P型单向延迟单例集合；"
    },
    {
      "indent": 3,
      "text": "o Type-P-One-to-group-Packet-Loss-Vector which collects the set of Type-P-One-way-Packet-Loss singletons between one sender and N receivers; and",
      "zh-CHS": "o Type-P-One-to-group-Packet-Loss-Vector，它收集一个发送方和N个接收方之间的一组Type-P-One-way-Packet-Loss单例；和"
    },
    {
      "indent": 3,
      "text": "o Type-P-One-to-group-ipdv-Vector which collects the set of Type-P-One-way-ipdv singletons between one sender and N receivers.",
      "zh-CHS": "o Type-P-One-to-group-ipdv-Vector收集一个发送方和N个接收方之间的一组Type-P-One-way-ipdv单例。"
    },
    {
      "indent": 3,
      "text": "Finally, based on the one-to-group vector metrics listed above, statistics are defined to capture single receiver performance, group performance, and the relative performance for a multiparty communication:",
      "zh-CHS": "最后，基于上面列出的一对一向量度量，定义统计信息以捕获多方通信的单接收机性能、组性能和相对性能："
    },
    {
      "indent": 3,
      "text": "o Using the Type-P-One-to-group-Delay-Vector, a metric called Type-P-One-to-group-Receiver-n-Mean-Delay, or RnMD, presents the mean of delays between one sender and a single receiver 'n'. From this metric, three additional metrics are defined to characterize the mean delay over the entire group of receivers during the same time interval:",
      "zh-CHS": "o 使用P-One-to-group-Delay-Vector类型，称为Type-P-One-to-group-Receiver-n-Mean-Delay或RnMD的度量表示一个发送方和单个接收方“n”之间的延迟平均值。根据该指标，定义了三个附加指标，以表征同一时间间隔内整个接收机组的平均延迟："
    },
    {
      "indent": 6,
      "text": "* Type-P-One-to-group-Mean-Delay, or GMD, presents the mean of delays;",
      "zh-CHS": "* P型一对群平均延迟，或GMD，表示延迟的平均值；"
    },
    {
      "indent": 6,
      "text": "* Type-P-One-to-group-Range-Mean-Delay, or GRMD, presents the range of mean delays; and",
      "zh-CHS": "* P型一对群范围平均延迟，或GRMD，表示平均延迟的范围；和"
    },
    {
      "indent": 6,
      "text": "* Type-P-One-to-group-Max-Mean-Delay, or GMMD, presents the maximum of mean delays.",
      "zh-CHS": "* 类型-P-One-to-group-Max-Mean-Delay或GMMD表示平均延迟的最大值。"
    },
    {
      "indent": 3,
      "text": "o Using the Type-P-One-to-group-Packet-Loss-Vector, a metric called Type-P-One-to-group-Receiver-n-Loss-Ratio, or RnLR, captures the packet loss ratio between one sender and a single receiver 'n'. Based on this definition, two more metrics are defined to characterize packet loss over the entire group during the same time interval:",
      "zh-CHS": "o 使用Type-P-One-to-group-Packet-Loss-Vector，一个称为Type-P-One-to-group-Receiver-n-Loss-Ratio或RnLR的度量值捕获一个发送方和单个接收方“n”之间的分组丢失率。基于此定义，定义了另外两个度量来描述整个组在相同时间间隔内的数据包丢失："
    },
    {
      "indent": 6,
      "text": "* Type-P-One-to-group-Loss-Ratio, or GLR, captures the overall packet loss ratio for the entire group of receivers; and",
      "zh-CHS": "* Type-P-One-to-group-Loss-Ratio，或GLR，捕获整个接收机组的总体分组丢失率；和"
    },
    {
      "indent": 6,
      "text": "* Type-P-One-to-group-Range-Loss-Ratio, or GRLR, presents the comparative packet loss ratio during the test interval between one sender and N receivers.",
      "zh-CHS": "* 类型-P-一对群范围丢失率，或GRLR，表示一个发送方和N个接收方之间的测试间隔期间的比较数据包丢失率。"
    },
    {
      "indent": 3,
      "text": "o Using the Type-P-One-to-group-Packet-Loss-Vector, a metric called Type-P-One-to-group-Receiver-n-Comp-Loss-Ratio, or RnCLR, computes a packet loss ratio using the maximum number of packets received at any receiver.",
      "zh-CHS": "o 使用Type-P-One-to-group-Packet-Loss-Vector，一个称为Type-P-One-to-group-Receiver-n-Comp-Loss-Ratio或RnCLR的度量，使用任何接收器接收的最大数据包数计算数据包丢失率。"
    },
    {
      "indent": 3,
      "text": "o Using Type-P-One-to-group-ipdv-Vector, a metric called Type-P-One-to-group-Range-Delay-Variation, or GRDV, presents the range of delay variation between one sender and a group of receivers.",
      "zh-CHS": "o 使用P-One-to-group-ipdv-Vector类型，称为P-One-to-group-Range-Delay-Variation（GRDV）类型的度量表示一个发送方和一组接收方之间的延迟变化范围。"
    },
    {
      "indent": 0,
      "text": "4. Motivations",
      "section_title": true,
      "zh-CHS": "4. 动机"
    },
    {
      "indent": 3,
      "text": "All existing IPPM metrics are defined for end-to-end (source-to-destination) measurement of point-to-point paths. It is logical to extend them to multiparty situations such as one-to-one trajectory metrics and one-to-multipoint metrics.",
      "zh-CHS": "所有现有IPPM度量都是为点到点路径的端到端（源到目标）度量而定义的。将其扩展到多方情况是合乎逻辑的，例如一对一轨迹度量和一对多点度量。"
    },
    {
      "indent": 0,
      "text": "4.1. Motivations for Spatial Metrics",
      "section_title": true,
      "zh-CHS": "4.1. 空间度量的动机"
    },
    {
      "indent": 3,
      "text": "Spatial metrics are needed for:",
      "zh-CHS": "以下方面需要空间度量："
    },
    {
      "indent": 3,
      "text": "o Decomposing the performance of an inter-domain path to quantify the per-AS (Autonomous System) contribution to the end-to-end performance.",
      "zh-CHS": "o 分解域间路径的性能以量化per AS（自治系统）对端到端性能的贡献。"
    },
    {
      "indent": 3,
      "text": "o Traffic engineering and troubleshooting, which benefit from spatial views of one-way delay and ipdv consumption, or identification of the path segment where packets were lost.",
      "zh-CHS": "o 流量工程和故障排除，受益于单向延迟和ipdv消耗的空间视图，或数据包丢失路径段的识别。"
    },
    {
      "indent": 3,
      "text": "o Monitoring the decomposed performance of a multicast tree based on MPLS point-to-multipoint communications.",
      "zh-CHS": "o 监控基于MPLS点对多点通信的多播树的分解性能。"
    },
    {
      "indent": 3,
      "text": "o Dividing end-to-end metrics, so that some segment measurements can be re-used and help measurement systems reach large-scale coverage. Spatial measures could characterize the performance of an intra-domain segment and provide an elementary piece of information needed to estimate inter-domain performance to another destination using Spatial Composition metrics [SPATIAL].",
      "zh-CHS": "o 划分端到端度量，以便某些细分度量可以重复使用，并帮助度量系统实现大规模覆盖。空间度量可以表征域内段的性能，并提供使用空间组合度量来估计到另一个目的地的域间性能所需的基本信息[Spatial]。"
    },
    {
      "indent": 0,
      "text": "4.2. Motivations for One-to-group Metrics",
      "section_title": true,
      "zh-CHS": "4.2. 一对一指标的动机"
    },
    {
      "indent": 3,
      "text": "While the node-to-node-based spatial measures can provide very useful data in the view of each connection, we also need measures to present the performance of a multiparty communication topology. A simple point-to-point metric cannot completely describe the multiparty situation. New one-to-group metrics assess performance of the multiple paths for further statistical analysis. The new metrics are named one-to-group performance metrics, and they are based on the unicast metrics defined in IPPM RFCs. One-to-group metrics are one-way metrics from one source to a group of destinations or receivers. The metrics are helpful for judging the overall performance of a multiparty communications network and for describing the performance variation across a group of destinations.",
      "zh-CHS": "虽然基于节点到节点的空间度量可以在每个连接的视图中提供非常有用的数据，但我们还需要度量来表示多方通信拓扑的性能。一个简单的点对点度量不能完全描述多方情况。新的一组指标评估多个路径的性能，以进行进一步的统计分析。新的度量称为一对一性能度量，它们基于IPPM RFCs中定义的单播度量。一对一指标是从一个来源到一组目的地或接收者的单向指标。这些指标有助于判断多方通信网络的总体性能，并有助于描述一组目的地之间的性能变化。"
    },
    {
      "indent": 3,
      "text": "One-to-group performance metrics are needed for:",
      "zh-CHS": "以下各项需要一个到一个组的绩效指标："
    },
    {
      "indent": 3,
      "text": "o Designing and engineering multicast trees and MPLS point-to-multipoint Label Switched Paths (LSPs).",
      "zh-CHS": "o 设计和工程多播树和MPLS点对多点标签交换路径（LSP）。"
    },
    {
      "indent": 3,
      "text": "o Evaluating and controlling the quality of multicast services, including inter-domain multicast.",
      "zh-CHS": "o 评估和控制多播服务的质量，包括域间多播。"
    },
    {
      "indent": 3,
      "text": "o Presenting and evaluating the performance requirements for multiparty communications and overlay multicast.",
      "zh-CHS": "o 介绍和评估多方通信和覆盖多播的性能要求。"
    },
    {
      "indent": 3,
      "text": "To understand the packet transfer performance between one source and any one receiver in the multiparty communication group, we need to collect instantaneous end-to-end metrics, or singletons. This gives a very detailed view into the performance of each branch of the multicast tree, and can provide clear and helpful information for engineers to identify the branch with problems in a complex multiparty routing tree.",
      "zh-CHS": "为了了解多方通信组中一个源和任何一个接收器之间的数据包传输性能，我们需要收集瞬时端到端度量或单例。这为多播树的每个分支的性能提供了非常详细的视图，并且可以为工程师识别复杂多方路由树中存在问题的分支提供清晰而有用的信息。"
    },
    {
      "indent": 3,
      "text": "The one-to-group metrics described in this memo introduce the multiparty topology into the IPPM framework, and they describe the performance delivered to a group receiving packets from the same source. The concept extends the \"path\" of the point-to-point measurement to \"path tree\" to cover one-to-many topologies. If applied to one-to-one topology, the one-to-group metrics provide exactly the same results as the corresponding one-to-one metrics.",
      "zh-CHS": "本备忘录中描述的一对一指标将多方拓扑引入IPPM框架，它们描述了从同一来源接收数据包的组的性能。该概念将点到点测量的“路径”扩展为“路径树”，以覆盖一对多拓扑。如果应用于一对一拓扑，一对组度量将提供与相应的一对一度量完全相同的结果。"
    },
    {
      "indent": 0,
      "text": "4.3. Discussion on Group-to-One and Group-to-Group Metrics",
      "section_title": true,
      "zh-CHS": "4.3. 关于组对一和组对组指标的讨论"
    },
    {
      "indent": 3,
      "text": "We note that points of interest can also be selected to define measurements on group-to-one and group-to-group topologies. These topologies are beyond the scope of this memo, because they would involve multiple packets launched from different sources. However, this section gives some insights on these two cases.",
      "zh-CHS": "我们注意到，还可以选择关注点来定义组对一和组对组拓扑的测量。这些拓扑超出了本备忘录的范围，因为它们将涉及从不同来源启动的多个数据包。然而，本节给出了关于这两个案例的一些见解。"
    },
    {
      "indent": 3,
      "text": "The measurements for group-to-one topology can be easily derived from the one-to-group measurement. The measurement point is the host that is acting as a receiver while all other hosts act as sources in this case.",
      "zh-CHS": "一对一拓扑的度量可以很容易地从一对一度量中导出。在这种情况下，测量点是充当接收器的主机，而所有其他主机充当源。"
    },
    {
      "indent": 3,
      "text": "The group-to-group communication topology has no obvious focal point: the sources and the measurement collection points can be anywhere. However, it is possible to organize the problem by applying measurements in one-to-group or group-to-one topologies for each host in a uniform way (without taking account of how the real",
      "zh-CHS": "组对组通信拓扑没有明显的焦点：源和测量收集点可以在任何地方。但是，可以通过以统一的方式为每个主机应用一对一拓扑或一对一拓扑中的测量来组织问题（不考虑实际情况）"
    },
    {
      "indent": 3,
      "text": "communication might be carried out). For example, one group of hosts < ha, hb, hc, ..., hn > might act as sources to send data to another group of hosts < Ha, Hb, Hc, ..., Hm >, and they can be organized into n sets of points of interest for one-to-group communications:",
      "zh-CHS": "可以进行通信）。例如，一组主机<ha，hb，hc，…，hn>可以作为源向另一组主机<ha，hb，hc，…，Hm>发送数据，并且可以将它们组织成n组兴趣点，用于一对一通信："
    },
    {
      "indent": 3,
      "text": "< ha, Ha, Hb, Hc, ..., Hm >, < hb, Ha, Hb, Hc, ..., Hm >, <hc, Ha, Hb, Hc, ..., Hm >, ..., < hn, Ha, Hb, Hc, ..., Hm >.",
      "zh-CHS": "<ha，ha，Hb，Hc，…，Hm>，<Hb，ha，Hb，Hc，…，Hm>，<Hc，ha，Hb，Hc>，…，<hn，ha，Hb，Hc，…，Hm>。"
    },
    {
      "indent": 0,
      "text": "5. Spatial Vector Metrics Definitions",
      "section_title": true,
      "zh-CHS": "5. 空间向量度量定义"
    },
    {
      "indent": 3,
      "text": "This section defines vectors for the spatial decomposition of end-to-end singleton metrics over a path.",
      "zh-CHS": "本节定义了路径上端到端单例度量的空间分解向量。"
    },
    {
      "indent": 3,
      "text": "Spatial vector metrics are based on the decomposition of standard end-to-end metrics defined by the IPPM WG in [RFC2679], [RFC2680], [RFC3393], and [RFC3432].",
      "zh-CHS": "空间向量度量基于IPPM工作组在[RFC2679]、[RFC2680]、[RFC3393]和[RFC3432]中定义的标准端到端度量的分解。"
    },
    {
      "indent": 3,
      "text": "The spatial vector definitions are coupled with the corresponding end-to-end metrics. Measurement methodology aspects are common to all the vectors defined and are consequently discussed in a common section.",
      "zh-CHS": "空间向量定义与相应的端到端度量相耦合。测量方法方面对于所有定义的向量都是通用的，因此在通用部分中讨论。"
    },
    {
      "indent": 0,
      "text": "5.1. A Definition for Spatial One-Way Delay Vector",
      "section_title": true,
      "zh-CHS": "5.1. 空间单向延迟向量的定义"
    },
    {
      "indent": 3,
      "text": "This section is coupled with the definition of Type-P-One-way-Delay in section 3 of [RFC2679]. When a parameter from the definition in [RFC2679] is re-used in this section, the first instance will be tagged with a trailing asterisk.",
      "zh-CHS": "本节与[RFC2679]第3节中的P型单向延迟定义相结合。当[RFC2679]中定义的参数在本节中重新使用时，第一个实例将被标记为尾随星号。"
    },
    {
      "indent": 3,
      "text": "Sections 3.5 to 3.8 of [RFC2679] give requirements and applicability statements for end-to-end one-way delay measurements. They are applicable to each point of interest, Hi, involved in the measure. Spatial one-way delay measurements MUST respect them, especially those related to methodology, clock, uncertainties, and reporting.",
      "zh-CHS": "[RFC2679]第3.5至3.8节给出了端到端单向延迟测量的要求和适用性声明。它们适用于测量中涉及的每个关注点Hi。空间单向延迟测量必须尊重它们，特别是与方法、时钟、不确定性和报告相关的测量。"
    },
    {
      "indent": 0,
      "text": "5.1.1. Metric Name",
      "section_title": true,
      "zh-CHS": "5.1.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-Spatial-One-way-Delay-Vector",
      "zh-CHS": "P型空间单向延迟向量"
    },
    {
      "indent": 0,
      "text": "5.1.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "5.1.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src*, the IP address of the sender.",
      "zh-CHS": "o Src*，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst*, the IP address of the receiver.",
      "zh-CHS": "o Dst*，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o i, an integer in the ordered list <1,2,...,n> of routers in the path.",
      "zh-CHS": "o i、 路径中路由器的有序列表<1,2，…，n>中的整数。"
    },
    {
      "indent": 3,
      "text": "o Hi, a router of the routers digest.",
      "zh-CHS": "o 你好，路由器文摘的路由器。"
    },
    {
      "indent": 3,
      "text": "o T*, a time, the sending (or initial observation) time for a measured packet.",
      "zh-CHS": "o T*，时间，测量数据包的发送（或初始观察）时间。"
    },
    {
      "indent": 3,
      "text": "o dT*, a delay, the one-way delay for a measured packet.",
      "zh-CHS": "o dT*，延迟，测量数据包的单向延迟。"
    },
    {
      "indent": 3,
      "text": "o dTi, a delay, the one-way delay for a measured packet from the source to router Hi.",
      "zh-CHS": "o dTi，延迟，测量数据包从源到路由器Hi的单向延迟。"
    },
    {
      "indent": 3,
      "text": "o <dT1,... dTi,... dTn> a list of n delay singletons.",
      "zh-CHS": "o <dT1，。。。dTi，。。。dTn>n个延迟单例的列表。"
    },
    {
      "indent": 3,
      "text": "o Type-P*, the specification of the packet type.",
      "zh-CHS": "o Type-P*，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o <H1, H2,..., Hn> the routers digest.",
      "zh-CHS": "o <H1，H2，…，Hn>路由器摘要。"
    },
    {
      "indent": 0,
      "text": "5.1.3. Metric Units",
      "section_title": true,
      "zh-CHS": "5.1.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of Type-P-Spatial-One-way-Delay-Vector is a sequence of times (a real number in the dimension of seconds with sufficient resolution to convey the results).",
      "zh-CHS": "P-Spatial-One-way-Delay-Vector类型的值是一个时间序列（以秒为单位的实数，分辨率足以传达结果）。"
    },
    {
      "indent": 0,
      "text": "5.1.4. Definition",
      "section_title": true,
      "zh-CHS": "5.1.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given a Type-P packet sent by the Src at wire-time (first bit) T to the receiver Dst on the path <H1, H2,..., Hn>. There is a sequence of values <T+dT1,T+dT2,...,T+dTn,T+dT> such that dT is the Type-P-One-way-Delay from Src to Dst, and for each Hi of the path, T+dTi is either a real number corresponding to the wire-time the packet passes (last bit received) Hi, or undefined if the packet does not pass Hi within a specified loss threshold* time.",
      "zh-CHS": "给定Src在连线时间（第一位）T向路径<H1，H2，…，Hn>上的接收器Dst发送的P型数据包。存在一系列值<T+dT1，T+dT2，…，T+dTn，T+dT>，使得dT是从Src到Dst的P型单向延迟，并且对于路径的每个Hi，T+dTi是对应于分组通过（接收的最后一位）Hi的连线时间的实数，或者如果分组在指定的丢失阈值*时间内没有通过Hi，则未定义。"
    },
    {
      "indent": 3,
      "text": "Type-P-Spatial-One-way-Delay-Vector metric is defined for the path <Src, H1, H2,..., Hn, Dst> as the sequence of values <T,dT1,dT2,...,dTn,dT>.",
      "zh-CHS": "路径<Src，H1，H2，…，Hn，Dst>的类型-P-空间-单向延迟向量度量定义为值序列<T，dT1，dT2，…，dTn，dT>。"
    },
    {
      "indent": 0,
      "text": "5.1.5. Discussion",
      "section_title": true,
      "zh-CHS": "5.1.5. 讨论"
    },
    {
      "indent": 3,
      "text": "Some specific issues that may occur are as follows:",
      "zh-CHS": "可能出现的一些具体问题如下："
    },
    {
      "indent": 3,
      "text": "o the delay singletons \"appear\" to decrease: dTi > dTi+1. This may occur despite being physically impossible with the definition used.",
      "zh-CHS": "o 延迟单态“出现”减少：dTi>dTi+1。尽管使用的定义在物理上不可能实现，但仍可能发生这种情况。"
    },
    {
      "indent": 6,
      "text": "* This is frequently due to a measurement clock synchronization issue. This point is discussed in section 3.7.1 \"Errors or uncertainties related to Clocks\" of [RFC2679]. Consequently, the values of delays measured at multiple routers may not match the order of those routers on the path.",
      "zh-CHS": "* 这通常是由于测量时钟同步问题造成的。[RFC2679]第3.7.1节“与时钟相关的误差或不确定性”中讨论了这一点。因此，在多个路由器上测量的延迟值可能与路径上这些路由器的顺序不匹配。"
    },
    {
      "indent": 6,
      "text": "* The actual order of routers on the path may change due to reconvergence (e.g., recovery from a link failure).",
      "zh-CHS": "* 路径上路由器的实际顺序可能因重新聚合（例如，从链路故障中恢复）而改变。"
    },
    {
      "indent": 6,
      "text": "* The location of the measurement collection point in the device influences the result. If the packet is not observed directly on the input interface, the delay includes buffering time and consequently an uncertainty due to the difference between 'wire-time' and 'host time'.",
      "zh-CHS": "* 测量采集点在设备中的位置会影响结果。如果未在输入接口上直接观察到数据包，则延迟包括缓冲时间，以及由于“连线时间”和“主机时间”之间的差异而产生的不确定性。"
    },
    {
      "indent": 0,
      "text": "5.2. A Definition for Spatial Packet Loss Vector",
      "section_title": true,
      "zh-CHS": "5.2. 空间丢包向量的定义"
    },
    {
      "indent": 3,
      "text": "This section is coupled with the definition of Type-P-One-way-Packet-Loss. When a parameter from section 2 of [RFC2680] is used in this section, the first instance will be tagged with a trailing asterisk.",
      "zh-CHS": "本节与类型P单向分组丢失的定义相结合。在本节中使用[RFC2680]第2节中的参数时，第一个实例将被标记为尾随星号。"
    },
    {
      "indent": 3,
      "text": "Sections 2.5 to 2.8 of [RFC2680] give requirements and applicability statements for end-to-end one-way packet loss measurements. They are applicable to each point of interest, Hi, involved in the measure. Spatial packet loss measurement MUST respect them, especially those related to methodology, clock, uncertainties, and reporting.",
      "zh-CHS": "[RFC2680]第2.5至2.8节给出了端到端单向丢包测量的要求和适用性声明。它们适用于测量中涉及的每个关注点Hi。空间数据包丢失测量必须尊重它们，特别是与方法、时钟、不确定性和报告相关的数据包丢失测量。"
    },
    {
      "indent": 3,
      "text": "The following sections define the spatial loss vector, adapt some of the points above, and introduce points specific to spatial loss measurement.",
      "zh-CHS": "以下各节定义了空间损耗向量，调整了上面的一些点，并介绍了特定于空间损耗测量的点。"
    },
    {
      "indent": 0,
      "text": "5.2.1. Metric Name",
      "section_title": true,
      "zh-CHS": "5.2.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-Spatial-Packet-Loss-Vector",
      "zh-CHS": "P型空间丢包向量"
    },
    {
      "indent": 0,
      "text": "5.2.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "5.2.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src*, the IP address of the sender.",
      "zh-CHS": "o Src*，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst*, the IP address of the receiver.",
      "zh-CHS": "o Dst*，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o i, an integer in the ordered list <1,2,...,n> of routers in the path.",
      "zh-CHS": "o i、 路径中路由器的有序列表<1,2，…，n>中的整数。"
    },
    {
      "indent": 3,
      "text": "o Hi, a router of the routers digest.",
      "zh-CHS": "o 你好，路由器文摘的路由器。"
    },
    {
      "indent": 3,
      "text": "o T*, a time, the sending time for a measured packet.",
      "zh-CHS": "o T*，时间，测量数据包的发送时间。"
    },
    {
      "indent": 3,
      "text": "o dTi, a delay, the one-way delay for a measured packet from the source to host Hi.",
      "zh-CHS": "o dTi，延迟，从源到主机Hi的测量数据包的单向延迟。"
    },
    {
      "indent": 3,
      "text": "o <dT1,..., dTn>, list of n delay singletons.",
      "zh-CHS": "o <dT1，…，dTn>，n个延迟单例的列表。"
    },
    {
      "indent": 3,
      "text": "o Type-P*, the specification of packet type.",
      "zh-CHS": "o Type-P*，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o <H1, H2,..., Hn>, the routers digest.",
      "zh-CHS": "o <H1，H2，…，Hn>，路由器文摘。"
    },
    {
      "indent": 3,
      "text": "o <L1, L2, ...,Ln>, a list of Boolean values.",
      "zh-CHS": "o <L1，L2，…，Ln>，布尔值列表。"
    },
    {
      "indent": 0,
      "text": "5.2.3. Metric Units",
      "section_title": true,
      "zh-CHS": "5.2.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of Type-P-Spatial-Packet-Loss-Vector is a sequence of Boolean values.",
      "zh-CHS": "P-Spatial-Packet-Loss-Vector类型的值是一系列布尔值。"
    },
    {
      "indent": 0,
      "text": "5.2.4. Definition",
      "section_title": true,
      "zh-CHS": "5.2.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given a Type-P packet sent by the Src at time T to the receiver Dst on the path <H1, H2, ..., Hn>. For the sequence of times <T+dT1,T+ dT2,..., T+dTi, ...,T+dTn> the packet passes in <H1, H2, ..., Hi, ..., Hn>, define the Type-P-Packet-Loss-Vector metric as the sequence of values <T, L1, L2, ..., Ln> such that for each Hi of the path, a value of 0 for Li means that dTi is a finite value, and a value of 1 means that dTi is undefined.",
      "zh-CHS": "给定Src在时间T向路径<H1，H2，…，Hn>上的接收器Dst发送的P型数据包。对于时间序列<T+dT1，T+dT2，…，T+dTi，…，T+dTn>，分组在<H1，H2，…，Hi，…，Hn>中通过，将Type-P-packet-Loss-Vector度量定义为值序列<T，L1，L2，…，Ln>，使得对于路径的每个Hi，Li的值0表示dTi是有限值，而值1表示dTi是未定义的。"
    },
    {
      "indent": 0,
      "text": "5.2.5. Discussion",
      "section_title": true,
      "zh-CHS": "5.2.5. 讨论"
    },
    {
      "indent": 3,
      "text": "Some specific issues that may occur are as follows:",
      "zh-CHS": "可能出现的一些具体问题如下："
    },
    {
      "indent": 3,
      "text": "o The result might include the sequence of values 1,0. Although this appears physically impossible (a packet is lost, then re-appears later on the path):",
      "zh-CHS": "o 结果可能包括值1,0的序列。虽然这在物理上是不可能的（数据包丢失，然后在路径上重新出现）："
    },
    {
      "indent": 6,
      "text": "* The actual routers on the path may change due to reconvergence (e.g., recovery from a link failure).",
      "zh-CHS": "* 路径上的实际路由器可能因重新聚合（例如，从链路故障中恢复）而改变。"
    },
    {
      "indent": 6,
      "text": "* The order of routers on the path may change due to reconvergence.",
      "zh-CHS": "* 路径上路由器的顺序可能会因重新聚合而改变。"
    },
    {
      "indent": 6,
      "text": "* A packet may not be observed in a router due to some buffer or CPU overflow at the measurement collection point.",
      "zh-CHS": "* 由于测量收集点的缓冲区或CPU溢出，路由器中可能无法观察到数据包。"
    },
    {
      "indent": 0,
      "text": "5.3. A Definition for Spatial One-Way ipdv Vector",
      "section_title": true,
      "zh-CHS": "5.3. 空间单向ipdv矢量的定义"
    },
    {
      "indent": 3,
      "text": "When a parameter from section 2 of [RFC3393] (the definition of Type-P-One-way-ipdv) is used in this section, the first instance will be tagged with a trailing asterisk.",
      "zh-CHS": "当[RFC3393]（类型-P-One-way-ipdv的定义）第2节中的参数用于本节时，第一个实例将被标记为尾随星号。"
    },
    {
      "indent": 3,
      "text": "The following sections define the spatial ipdv vector, adapt some of the points above, and introduce points specific to spatial ipdv measurement.",
      "zh-CHS": "以下各节定义了空间ipdv向量，调整了上面的一些点，并介绍了空间ipdv测量的特定点。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Metric Name",
      "section_title": true,
      "zh-CHS": "5.3.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-Spatial-One-way-ipdv-Vector",
      "zh-CHS": "P型空间单向ipdv矢量"
    },
    {
      "indent": 0,
      "text": "5.3.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "5.3.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src*, the IP address of the sender.",
      "zh-CHS": "o Src*，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst*, the IP address of the receiver.",
      "zh-CHS": "o Dst*，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o i, an integer in the ordered list <1,2,...,n> of routers in the path.",
      "zh-CHS": "o i、 路径中路由器的有序列表<1,2，…，n>中的整数。"
    },
    {
      "indent": 3,
      "text": "o Hi, a router of the routers digest.",
      "zh-CHS": "o 你好，路由器文摘的路由器。"
    },
    {
      "indent": 3,
      "text": "o T1*, a time, the sending time for a first measured packet.",
      "zh-CHS": "o T1*，时间，第一个测量数据包的发送时间。"
    },
    {
      "indent": 3,
      "text": "o T2*, a time, the sending time for a second measured packet.",
      "zh-CHS": "o T2*，时间，第二个测量数据包的发送时间。"
    },
    {
      "indent": 3,
      "text": "o dT*, a delay, the one-way delay for a measured packet.",
      "zh-CHS": "o dT*，延迟，测量数据包的单向延迟。"
    },
    {
      "indent": 3,
      "text": "o dTi, a delay, the one-way delay for a measured packet from the source to router Hi.",
      "zh-CHS": "o dTi，延迟，测量数据包从源到路由器Hi的单向延迟。"
    },
    {
      "indent": 3,
      "text": "o Type-P*, the specification of the packet type.",
      "zh-CHS": "o Type-P*，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o P1, the first packet sent at time T1.",
      "zh-CHS": "o P1，在时间T1发送的第一个数据包。"
    },
    {
      "indent": 3,
      "text": "o P2, the second packet sent at time T2.",
      "zh-CHS": "o P2，在时刻T2发送的第二分组。"
    },
    {
      "indent": 3,
      "text": "o <H1, H2,..., Hn>, the routers digest.",
      "zh-CHS": "o <H1，H2，…，Hn>，路由器文摘。"
    },
    {
      "indent": 3,
      "text": "o <T1,dT1.1, dT1.2,..., dT1.n,dT1>, the Type-P-Spatial-One-way-Delay-Vector for a packet sent at time T1.",
      "zh-CHS": "o <T1，dT1.1，dT1.2，…，dT1.n，dT1>，在时间T1发送的数据包的P-spatical-One-way-Delay-Vector类型。"
    },
    {
      "indent": 3,
      "text": "o <T2,dT2.1, dT2.2,..., dT2.n,dT2>, the Type-P-Spatial-One-way-Delay-Vector for a packet sent at time T2.",
      "zh-CHS": "o <T2，dT2.1，dT2.2，…，dT2.n，dT2>，在时间T2发送的数据包的类型-P-spatical-One-way-Delay-Vector。"
    },
    {
      "indent": 3,
      "text": "o L*, a packet length in bits. The packets of a Type-P packet stream from which the Type-P-Spatial-One-way-Delay-Vector metric is taken MUST all be of the same length.",
      "zh-CHS": "o L*，以位为单位的数据包长度。从中获取类型P空间单向延迟向量度量的类型P分组流的分组必须具有相同的长度。"
    },
    {
      "indent": 0,
      "text": "5.3.3. Metric Units",
      "section_title": true,
      "zh-CHS": "5.3.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of Type-P-Spatial-One-way-ipdv-Vector is a sequence of times (a real number in the dimension of seconds with sufficient resolution to convey the results).",
      "zh-CHS": "类型-P-Spatial-One-way-ipdv-Vector的值是一个时间序列（秒维的实数，分辨率足以传达结果）。"
    },
    {
      "indent": 0,
      "text": "5.3.4. Definition",
      "section_title": true,
      "zh-CHS": "5.3.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given P1 the Type-P packet sent by the sender Src at wire-time (first bit) T1 to the receiver Dst. Given <T1, dT1.1, dT1.2,..., dT1.n, dT1> the Type-P-Spatial-One-way-Delay-Vector of P1 over the sequence of routers <H1, H2,..., Hn>.",
      "zh-CHS": "给定P1发送方Src在连线时间（第一位）T1向接收方Dst发送的P型数据包。给定路由器序列<H1，H2，…，Hn>上P1的P型空间单向延迟向量<T1，dT1.1，dT1.2，…，dT1.n，dT1>。"
    },
    {
      "indent": 3,
      "text": "Given P2 the Type-P packet sent by the sender Src at wire-time (first bit) T2 to the receiver Dst. Given <T2, dT2.1, dT2.2,..., dT2.n, dT2> the Type-P-Spatial-One-way-Delay-Vector of P2 over the same path.",
      "zh-CHS": "给定P2发送方Src在连线时间（第一位）T2向接收方Dst发送的P型数据包。给定同一路径上P2的P型空间单向延迟向量<T2，dT2.1，dT2.2，…，dT2.n，dT2>。"
    },
    {
      "indent": 3,
      "text": "The Type-P-Spatial-One-way-ipdv-Vector metric is defined as the sequence of values <T1, T2, dT2.1-dT1.1, dT2.2-dT1.2 ,..., dT2.n-dT1.n, dT2-dT1> such that for each Hi of the sequence of routers <H1, H2,..., Hn>, dT2.i-dT1.i is either a real number if the packets P1 and P2 pass Hi at wire-time (last bit) dT1.i and dT2.i respectively, or undefined if at least one of them never passes Hi (and the respective one-way delay is undefined). The T1,T2* pair indicates the inter-packet emission interval and dT2-dT1 is ddT* the Type-P-One-way-ipdv.",
      "zh-CHS": "P-spatical-One-way-ipdv-Vector度量被定义为值序列<T1，T2，dT2.1-dT1.1，dT2.2-dT1.2，…，dT2.n-dT1.n，dT2-dT1>，使得对于路由器序列<H1，H2，…，Hn>，dT2.i-dT1.i的每个Hi，如果分组P1和P2分别在有线时间（最后一位）dT1.i和dT2.i通过Hi，则i是实数，或者，如果其中至少有一个从未通过Hi（且相应的单向延迟未定义），则为未定义。T1、T2*对表示包间发射间隔，dT2-dT1为ddT*类型-P-单向-ipdv。"
    },
    {
      "indent": 0,
      "text": "5.4. Spatial Methodology",
      "section_title": true,
      "zh-CHS": "5.4. 空间方法"
    },
    {
      "indent": 3,
      "text": "The methodology, reporting specifications, and uncertainties specified in section 3 of [RFC2679] apply to each point of interest (or measurement collection point), Hi, measuring an element of a spatial delay vector.",
      "zh-CHS": "[RFC2679]第3节中规定的方法、报告规范和不确定性适用于测量空间延迟向量元素的每个关注点（或测量收集点）。"
    },
    {
      "indent": 3,
      "text": "Likewise, the methodology, reporting specifications, and uncertainties specified in section 2 of [RFC2680] apply to each point of interest, Hi, measuring an element of a spatial packet loss vector.",
      "zh-CHS": "类似地，[RFC2680]第2节中规定的方法、报告规范和不确定性适用于测量空间分组丢失向量元素的每个关注点Hi。"
    },
    {
      "indent": 3,
      "text": "Sections 3.5 to 3.7 of [RFC3393] give requirements and applicability statements for end-to-end One-way ipdv measurements. They are applicable to each point of interest, Hi, involved in the measure. Spatial One-way ipdv measurement MUST respect the methodology, clock, uncertainties, and reporting aspects given there.",
      "zh-CHS": "[RFC3393]第3.5至3.7节给出了端到端单向ipdv测量的要求和适用性声明。它们适用于测量中涉及的每个关注点Hi。空间单向ipdv测量必须尊重其中给出的方法、时钟、不确定性和报告方面。"
    },
    {
      "indent": 3,
      "text": "Generally, for a given Type-P packet of length L at a specific Hi, the methodology for spatial vector metrics may proceed as follows:",
      "zh-CHS": "通常，对于特定Hi处长度为L的给定P型分组，空间向量度量的方法可以如下进行："
    },
    {
      "indent": 3,
      "text": "o At each Hi, points of interest/measurement collection points prepare to capture the packet sent at time T, record a timestamp Ti', and determine the internal delay correction dTi' (see section 3.7.1. \"Errors or uncertainties related to Clocks\" of [RFC2679]);",
      "zh-CHS": "o 在每个Hi，关注点/测量收集点准备捕获在时间T发送的数据包，记录时间戳Ti'，并确定内部延迟校正dTi'（参见[RFC2679]第3.7.1节“与时钟相关的错误或不确定性”）；"
    },
    {
      "indent": 3,
      "text": "o Each Hi extracts the path ordering information from the packet (e.g., time-to-live (TTL));",
      "zh-CHS": "o 每个Hi从分组中提取路径排序信息（例如，生存时间（TTL））；"
    },
    {
      "indent": 3,
      "text": "o Each Hi computes the corrected wire-time from Src to Hi: Ti = Ti' - dTi'. This arrival time is undefined if the packet is not detected after the 'loss threshold' duration;",
      "zh-CHS": "o 每个Hi计算从Src到Hi的校正导线时间：Ti=Ti'-dTi'。如果在“丢失阈值”持续时间之后未检测到数据包，则该到达时间未定义；"
    },
    {
      "indent": 3,
      "text": "o Each Hi extracts the timestamp T from the packet;",
      "zh-CHS": "o 每个Hi从分组中提取时间戳T；"
    },
    {
      "indent": 3,
      "text": "o Each Hi computes the one-way delay from Src to Hi: dTi = Ti - T;",
      "zh-CHS": "o 每个Hi计算从Src到Hi的单向延迟：dTi=Ti-T；"
    },
    {
      "indent": 3,
      "text": "o The reference point gathers the result of each Hi and arranges them according to the path ordering information received to build the Type-P spatial one-way vector (e.g., Type-P-Spatial-One-way-Delay-Vector metric <T, dT1, dT2,..., dTn, dT>) over the path <Src, H1, H2,..., Hn, Dst> at time T.",
      "zh-CHS": "o 参考点收集每个Hi的结果，并根据接收到的路径排序信息对其进行排列，以在时间T在路径<Src，H1，H2，…，Hn，Dst>上构建P型空间单向向量（例如，P型空间单向延迟向量度量<T，dT1，dT2，…，dTn，dT>）。"
    },
    {
      "indent": 0,
      "text": "5.4.1. Packet Loss Detection",
      "section_title": true,
      "zh-CHS": "5.4.1. 丢包检测"
    },
    {
      "indent": 3,
      "text": "In a pure end-to-end measurement, packet losses are detected by the receiver only. A packet is lost when Type-P-One-way-Delay is undefined or very large (see sections 2.4 and 2.5 of [RFC2680] and section 3.5 of [RFC2680]). A packet is deemed lost by the receiver after a duration that starts at the time the packet is sent. This timeout value is chosen by a measurement process. It determines the threshold between recording a long packet transfer time as a finite value or an undefined value.",
      "zh-CHS": "在纯端到端测量中，数据包丢失仅由接收器检测。当P型单向延迟未定义或非常大时，数据包丢失（参见[RFC2680]第2.4节和第2.5节以及[RFC2680]第3.5节）。在数据包发送时开始的持续时间之后，接收方认为数据包丢失。此超时值由测量过程选择。它确定将长数据包传输时间记录为有限值或未定义值之间的阈值。"
    },
    {
      "indent": 3,
      "text": "In a spatial measurement, packet losses may be detected at several measurement collection points. Depending on the consistency of the packet loss detections among the points of interest, a packet may be considered as lost at one point despite having a finite delay at another, or it may be observed by the last measurement collection point of the path but considered lost by Dst.",
      "zh-CHS": "在空间测量中，可以在多个测量收集点处检测分组丢失。取决于感兴趣点之间的分组丢失检测的一致性，分组可被视为在一点丢失，尽管在另一点具有有限延迟，或者它可被路径的最后测量收集点观察到，但被Dst视为丢失。"
    },
    {
      "indent": 3,
      "text": "There is a risk of misinterpreting such results: has the path changed? Did the packet arrive at the destination or was it lost on the very last link?",
      "zh-CHS": "这样的结果有被误解的风险：路径改变了吗？数据包是到达目的地还是在最后一个链路上丢失了？"
    },
    {
      "indent": 3,
      "text": "The same concern applies to one-way delay measures: a delay measured may be computed as infinite by one observation point but as a real value by another one, or may be measured as a real value by the last observation point of the path but designated as undefined by Dst.",
      "zh-CHS": "同样的问题也适用于单向延迟测量：测量的延迟可由一个观测点计算为无限，但另一个观测点计算为实值，或可由路径的最后一个观测点测量为实值，但Dst未定义。"
    },
    {
      "indent": 3,
      "text": "The observation/measurement collection points and the destination SHOULD use consistent methods to detect packets losses. The methods and parameters must be systematically reported to permit careful comparison and to avoid introducing any confounding factors in the analysis.",
      "zh-CHS": "观测/测量收集点和目的地应使用一致的方法检测数据包丢失。必须系统地报告方法和参数，以便进行仔细比较，避免在分析中引入任何混杂因素。"
    },
    {
      "indent": 0,
      "text": "5.4.2. Routers Digest",
      "section_title": true,
      "zh-CHS": "5.4.2. 路由器文摘"
    },
    {
      "indent": 3,
      "text": "The methodology given above relies on knowing the order of the router/measurement collection points on the path [RFC2330].",
      "zh-CHS": "上述方法依赖于了解路径[RFC2330]上路由器/测量收集点的顺序。"
    },
    {
      "indent": 3,
      "text": "Path instability might cause a test packet to be observed more than once by the same router, resulting in the repetition of one or more routers in the routers digest.",
      "zh-CHS": "路径不稳定可能导致同一路由器多次观察测试数据包，从而导致路由器摘要中的一个或多个路由器重复。"
    },
    {
      "indent": 3,
      "text": "For example, repeated observations may occur during rerouting phases that introduce temporary micro loops. During such an event, the routers digest for a packet crossing Ha and Hb may include the pattern <Hb, Ha, Hb, Ha, Hb>, meaning that Ha ended the computation of the new path before Hb and that the initial path was from Ha to Hb, and that the new path is from Hb to Ha.",
      "zh-CHS": "例如，在引入临时微环的重路由阶段可能会发生重复观测。在这样的事件期间，跨越Ha和Hb的分组的路由器摘要可以包括模式<Hb，Ha，Hb，Ha，Hb>，这意味着Ha在Hb之前结束了新路径的计算，并且初始路径是从Ha到Hb的，并且新路径是从Hb到Ha的。"
    },
    {
      "indent": 3,
      "text": "Consequently, duplication of routers in the routers digest of a vector MUST be identified before computation of statistics to avoid producing corrupted information.",
      "zh-CHS": "因此，在计算统计数据之前，必须识别向量的路由器摘要中的路由器重复，以避免产生损坏的信息。"
    },
    {
      "indent": 0,
      "text": "6. Spatial Segment Metrics Definitions",
      "section_title": true,
      "zh-CHS": "6. 空间段度量定义"
    },
    {
      "indent": 3,
      "text": "This section defines samples to measure the performance of a segment of a path over time. The definitions rely on the matrix of the spatial vector metrics defined above.",
      "zh-CHS": "本节定义用于测量路径段随时间变化的性能的示例。这些定义依赖于上面定义的空间向量度量矩阵。"
    },
    {
      "indent": 3,
      "text": "First, this section defines a sample of one-way delay, Type-P-Segment-One-way-Delay-Stream, and a sample of packet loss, Type-P-Segment-Packet-Loss-Stream.",
      "zh-CHS": "首先，本节定义单向延迟的样本，类型为P段单向延迟流，以及分组丢失的样本，类型为P段分组丢失流。"
    },
    {
      "indent": 3,
      "text": "Then, it defines two different samples of ipdv: Type-P-Segment-ipdv-prev-Stream uses the current and previous packets as the selection function, and Type-P-Segment-ipdv-min-Stream uses the minimum delay as one of the selected packets in every pair.",
      "zh-CHS": "然后，它定义了两个不同的ipdv样本：Type-P-Segment-ipdv-prev-Stream使用当前和以前的数据包作为选择函数，Type-P-Segment-ipdv-min-Stream使用最小延迟作为每对中选择的数据包之一。"
    },
    {
      "indent": 0,
      "text": "6.1. A Definition of a Sample of One-Way Delay of a Segment of the Path",
      "section_title": true,
      "zh-CHS": "6.1. 路径段单向延迟样本的定义"
    },
    {
      "indent": 3,
      "text": "This metric defines a sample of one-way delays over time between a pair of routers on a path. Since it is very close semantically to the metric Type-P-One-way-Delay-Poisson-Stream defined in section 4 of [RFC2679], sections 4.5 to 4.8 of [RFC2679] are integral parts of the definition text below.",
      "zh-CHS": "该度量定义了一条路径上一对路由器之间的单向延迟样本。由于它在语义上非常接近[RFC2679]第4节中定义的度量类型-P-单向延迟-泊松流，[RFC2679]第4.5至4.8节是以下定义文本的组成部分。"
    },
    {
      "indent": 0,
      "text": "6.1.1. Metric Name",
      "section_title": true,
      "zh-CHS": "6.1.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-Segment-One-way-Delay-Stream",
      "zh-CHS": "P型段单向延迟流"
    },
    {
      "indent": 0,
      "text": "6.1.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "6.1.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of the sender.",
      "zh-CHS": "o Src，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of the receiver.",
      "zh-CHS": "o Dst，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Type-P, the specification of the packet type.",
      "zh-CHS": "o Type-P，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o i, an integer in the ordered list <1,2,...,n> of routers in the path.",
      "zh-CHS": "o i、 路径中路由器的有序列表<1,2，…，n>中的整数。"
    },
    {
      "indent": 3,
      "text": "o k, an integer that orders the packets sent.",
      "zh-CHS": "o k、 对发送的数据包进行排序的整数。"
    },
    {
      "indent": 3,
      "text": "o a and b, two integers where b > a.",
      "zh-CHS": "o a和b，两个整数，其中b>a。"
    },
    {
      "indent": 3,
      "text": "o Hi, a router of the routers digest.",
      "zh-CHS": "o 你好，路由器文摘的路由器。"
    },
    {
      "indent": 3,
      "text": "o  <H1,..., Ha, ..., Hb, ...., Hn>, the routers digest.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "o <T1, T2, ..., Tm>, a list of times.",
      "zh-CHS": "o <T1，T2，…，Tm>，时间列表。"
    },
    {
      "indent": 0,
      "text": "6.1.3. Metric Units",
      "section_title": true,
      "zh-CHS": "6.1.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-Segment-One-way-Delay-Stream is a pair of:",
      "zh-CHS": "类型P段单向延迟流的值为一对："
    },
    {
      "indent": 6,
      "text": "A list of times <T1, T2, ..., Tm>; and",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "A sequence of delays.",
      "zh-CHS": "一系列的延迟。"
    },
    {
      "indent": 0,
      "text": "6.1.4. Definition",
      "section_title": true,
      "zh-CHS": "6.1.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given two routers, Ha and Hb, of the path <H1, H2,..., Ha, ..., Hb, ..., Hn>, and the matrix of Type-P-Spatial-One-way-Delay-Vector for the packets sent from Src to Dst at times <T1, T2, ..., Tm-1, Tm> :",
      "zh-CHS": "给定路径<H1，H2，…，Ha，…，Hb，…，Hn>的两个路由器Ha和Hb，以及时间<T1，T2，…，Tm-1，Tm>从Src发送到Dst的数据包的P型空间单向延迟向量矩阵："
    },
    {
      "indent": 6,
      "text": "<T1, dT1.1, dT1.2, ..., dT1.a, ..., dT1.b,..., dT1.n, dT1>;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "<T2, dT2.1, dT2.2, ..., dT2.a, ..., dT2.b,..., dT2.n, dT2>;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "...",
      "zh-CHS": "..."
    },
    {
      "indent": 6,
      "text": "<Tm, dTm.1, dTm.2, ..., dTm.a, ..., dTm.b,..., dTm.n, dTm>.",
      "zh-CHS": "<Tm，dTm.1，dTm.2，…，dTm.a，…，dTm.b，…，dTm.n，dTm>。"
    },
    {
      "indent": 3,
      "text": "We define the sample Type-P-Segment-One-way-Delay-Stream as the sequence <dT1.ab, dT2.ab, ..., dTk.ab, ..., dTm.ab> such that for each time Tk, 'dTk.ab' is either the real number 'dTk.b - dTk.a', if the packet sent at the time Tk passes Ha and Hb, or is undefined if this packet never passes Ha or (inclusive) never passes Hb.",
      "zh-CHS": "我们将样本类型-P段-单向延迟流定义为序列<dT1.ab，dT2.ab，…，dTk.ab，…，dTm.ab>，这样，对于每个时间Tk，“dTk.ab”要么是实数“dTk.b-dTk.a”，如果在Tk通过Ha和Hb时发送的数据包，要么是未定义的，如果该数据包从未通过Ha或（包括）从未通过Hb。"
    },
    {
      "indent": 0,
      "text": "6.1.5. Discussion",
      "section_title": true,
      "zh-CHS": "6.1.5. 讨论"
    },
    {
      "indent": 3,
      "text": "Some specific issues that may occur are as follows:",
      "zh-CHS": "可能出现的一些具体问题如下："
    },
    {
      "indent": 3,
      "text": "o the delay singletons \"appear\" to decrease: dTi > DTi+1, and is discussed in section 5.1.5.",
      "zh-CHS": "o 延迟单态“出现”减少：dTi>dTi+1，第5.1.5节对此进行了讨论。"
    },
    {
      "indent": 6,
      "text": "* This could also occur when the clock resolution of one measurement collection point is larger than the minimum delay of a path. For example, the minimum delay of a 500 km path through optical fiber facilities is 2.5 ms, but the measurement collection point has a clock resolution of 8 ms.",
      "zh-CHS": "* 当一个测量采集点的时钟分辨率大于路径的最小延迟时，也可能发生这种情况。例如，通过光纤设施的500 km路径的最小延迟为2.5 ms，但测量采集点的时钟分辨率为8 ms。"
    },
    {
      "indent": 3,
      "text": "The metric SHALL be invalid for times < T1 , T2, ..., Tm-1, Tm> if the following conditions occur:",
      "zh-CHS": "如果出现以下情况，则在时间<T1，T2，…，Tm-1，Tm>内，该度量应无效："
    },
    {
      "indent": 3,
      "text": "o Ha or Hb disappears from the path due to some routing change.",
      "zh-CHS": "o 由于某些路由更改，Ha或Hb从路径中消失。"
    },
    {
      "indent": 3,
      "text": "o The order of Ha and Hb changes in the path.",
      "zh-CHS": "o Ha和Hb的顺序在路径中发生变化。"
    },
    {
      "indent": 0,
      "text": "6.2. A Definition of a Sample of Packet Loss of a Segment of the Path",
      "section_title": true,
      "zh-CHS": "6.2. 路径段的数据包丢失示例的定义"
    },
    {
      "indent": 3,
      "text": "This metric defines a sample of packet loss over time between a pair of routers of a path. Since it is very close semantically to the metric Type-P-Packet-loss-Stream defined in section 3 of [RFC2680], sections 3.5 to 3.8 of [RFC2680] are integral parts of the definition text below.",
      "zh-CHS": "该度量定义了路径的一对路由器之间随时间的数据包丢失样本。由于它在语义上非常接近[RFC2680]第3节中定义的度量类型-P-分组丢失流，[RFC2680]第3.5至3.8节是以下定义文本的组成部分。"
    },
    {
      "indent": 0,
      "text": "6.2.1. Metric Name",
      "section_title": true,
      "zh-CHS": "6.2.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-Segment-Packet-Loss-Stream",
      "zh-CHS": "类型P段丢包流"
    },
    {
      "indent": 0,
      "text": "6.2.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "6.2.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of the sender.",
      "zh-CHS": "o Src，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of the receiver.",
      "zh-CHS": "o Dst，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Type-P, the specification of the packet type.",
      "zh-CHS": "o Type-P，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o k, an integer that orders the packets sent.",
      "zh-CHS": "o k、 对发送的数据包进行排序的整数。"
    },
    {
      "indent": 3,
      "text": "o n, an integer that orders the routers on the path.",
      "zh-CHS": "o n、 对路径上的路由器进行排序的整数。"
    },
    {
      "indent": 3,
      "text": "o a and b, two integers where b > a.",
      "zh-CHS": "o a和b，两个整数，其中b>a。"
    },
    {
      "indent": 3,
      "text": "o <H1, H2, ..., Ha, ..., Hb, ...,Hn>, the routers digest.",
      "zh-CHS": "o <H1，H2，…，Ha，…，Hb，…，Hn>，路由器文摘。"
    },
    {
      "indent": 3,
      "text": "o Hi, a router of the routers digest.",
      "zh-CHS": "o 你好，路由器文摘的路由器。"
    },
    {
      "indent": 3,
      "text": "o <T1, T2, ..., Tm>, a list of times.",
      "zh-CHS": "o <T1，T2，…，Tm>，时间列表。"
    },
    {
      "indent": 3,
      "text": "o <L1, L2, ..., Ln>, a list of Boolean values.",
      "zh-CHS": "o <L1，L2，…，Ln>，布尔值列表。"
    },
    {
      "indent": 0,
      "text": "6.2.3. Metric Units",
      "section_title": true,
      "zh-CHS": "6.2.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-Segment-Packet-Loss-Stream is a pair of:",
      "zh-CHS": "类型P段丢包流的值是一对："
    },
    {
      "indent": 6,
      "text": "The list of times <T1, T2, ..., Tm>; and",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "A sequence of Boolean values.",
      "zh-CHS": "一系列布尔值。"
    },
    {
      "indent": 0,
      "text": "6.2.4. Definition",
      "section_title": true,
      "zh-CHS": "6.2.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given two routers, Ha and Hb, of the path <H1, H2,..., Ha, ..., Hb, ..., Hn> and the matrix of Type-P-Spatial-Packet-Loss-Vector for the packets sent from Src to Dst at times <T1, T2, ..., Tm-1, Tm> :",
      "zh-CHS": "给定路径<H1，H2，…，Ha，…，Hb，…，Hn>的两个路由器Ha和Hb，以及时间<T1，T2，…，Tm-1，Tm>从Src发送到Dst的分组的P型空间分组丢失向量矩阵："
    },
    {
      "indent": 6,
      "text": "<T1, L1.1, L1.2,..., L1.a, ..., L1.b, ..., L1.n, L>,",
      "zh-CHS": "<T1，L1.1，L1.2，…，L1.a，…，L1.b，…，L1.n，L>，"
    },
    {
      "indent": 6,
      "text": "<T2, L2.1, L2.2,..., L2.a, ..., L2.b, ..., L2.n, L>,",
      "zh-CHS": "<T2，L2.1，L2.2，…，L2.a，…，L2.b，…，L2.n，L>，"
    },
    {
      "indent": 6,
      "text": "...,",
      "zh-CHS": "...,"
    },
    {
      "indent": 6,
      "text": "<Tm, Lm.1, Lm.2,..., Lma, ..., Lm.b, ..., Lm.n, L>.",
      "zh-CHS": "<Tm，Lm.1，Lm.2，…，Lma，…，Lm.b，…，Lm.n，L>。"
    },
    {
      "indent": 3,
      "text": "We define the value of the sample Type-P-Segment-Packet-Loss-Stream from Ha to Hb as the sequence of Booleans <L1.ab, L2.ab,..., Lk.ab, ..., Lm.ab> such that for each Tk:",
      "zh-CHS": "我们将样本类型-P段-Packet-Loss-Stream从Ha到Hb的值定义为布尔序列<L1.ab，L2.ab，…，Lk.ab，…，Lm.ab>，以便对于每个Tk："
    },
    {
      "indent": 3,
      "text": "o A value of Lk of 0 means that Ha and Hb observed the packet sent at time Tk (both Lk.a and Lk.b have a value of 0).",
      "zh-CHS": "o Lk的值为0表示Ha和Hb观察到在时间Tk发送的数据包（Lk.A和Lk.b的值均为0）。"
    },
    {
      "indent": 3,
      "text": "o A value of Lk of 1 means that Ha observed the packet sent at time Tk (Lk.a has a value of 0) and that Hb did not observe the packet sent at time Tk (Lk.b has a value of 1).",
      "zh-CHS": "o Lk的值为1表示Ha观察到在时间Tk发送的数据包（Lk.A的值为0），Hb没有观察到在时间Tk发送的数据包（Lk.b的值为1）。"
    },
    {
      "indent": 3,
      "text": "o The value of Lk is undefined when neither Ha nor Hb observed the packet (both Lk.a and Lk.b have a value of 1).",
      "zh-CHS": "o 当Ha和Hb均未观察到数据包时，Lk的值未定义（Lk.a和Lk.b的值均为1）。"
    },
    {
      "indent": 0,
      "text": "6.2.5. Discussion",
      "section_title": true,
      "zh-CHS": "6.2.5. 讨论"
    },
    {
      "indent": 3,
      "text": "Unlike Type-P-Packet-loss-Stream, Type-P-Segment-Packet-Loss-Stream relies on the stability of the routers digest. The metric SHALL be invalid for times < T1 , T2, ..., Tm-1, Tm> if the following conditions occur:",
      "zh-CHS": "与P-Packet-loss-Stream类型不同，P-Segment-Packet-loss-Stream类型依赖于路由器摘要的稳定性。如果出现以下情况，则在时间<T1，T2，…，Tm-1，Tm>内，该度量应无效："
    },
    {
      "indent": 3,
      "text": "o Ha or Hb disappears from the path due to some routing change.",
      "zh-CHS": "o 由于某些路由更改，Ha或Hb从路径中消失。"
    },
    {
      "indent": 3,
      "text": "o The order of Ha and Hb changes in the path.",
      "zh-CHS": "o Ha和Hb的顺序在路径中发生变化。"
    },
    {
      "indent": 3,
      "text": "o Lk.a or Lk.b is undefined.",
      "zh-CHS": "o Lk.a或Lk.b未定义。"
    },
    {
      "indent": 3,
      "text": "o Lk.a has the value 1 (not observed) and Lk.b has the value 0 (observed).",
      "zh-CHS": "o Lk.a的值为1（未观察到），Lk.b的值为0（观察到）。"
    },
    {
      "indent": 3,
      "text": "o L has the value 0 (the packet was received by Dst) and Lk.ab has the value 1 (the packet was lost between Ha and Hb).",
      "zh-CHS": "o L的值为0（数据包由Dst接收），Lk.ab的值为1（数据包在Ha和Hb之间丢失）。"
    },
    {
      "indent": 0,
      "text": "6.3. A Definition of a Sample of ipdv of a Segment Using the Previous Packet Selection Function",
      "zh-CHS": "6.3. 使用前一个数据包选择函数定义段的ipdv样本"
    },
    {
      "indent": 3,
      "text": "This metric defines a sample of ipdv [RFC3393] over time between a pair of routers using the previous packet as the selection function.",
      "zh-CHS": "该度量定义了一对路由器之间ipdv[RFC3393]随时间的样本，使用前一个数据包作为选择函数。"
    },
    {
      "indent": 0,
      "text": "6.3.1. Metric Name",
      "section_title": true,
      "zh-CHS": "6.3.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-Segment-ipdv-prev-Stream",
      "zh-CHS": "类型-P-段-ipdv-prev-流"
    },
    {
      "indent": 0,
      "text": "6.3.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "6.3.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of the sender.",
      "zh-CHS": "o Src，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of the receiver.",
      "zh-CHS": "o Dst，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Type-P, the specification of the packet type.",
      "zh-CHS": "o Type-P，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o k, an integer that orders the packets sent.",
      "zh-CHS": "o k、 对发送的数据包进行排序的整数。"
    },
    {
      "indent": 3,
      "text": "o n, an integer that orders the routers on the path.",
      "zh-CHS": "o n、 对路径上的路由器进行排序的整数。"
    },
    {
      "indent": 3,
      "text": "o a and b, two integers where b > a.",
      "zh-CHS": "o a和b，两个整数，其中b>a。"
    },
    {
      "indent": 3,
      "text": "o <H1, H2, ..., Ha, ..., Hb, ...,Hn>, the routers digest.",
      "zh-CHS": "o <H1，H2，…，Ha，…，Hb，…，Hn>，路由器文摘。"
    },
    {
      "indent": 3,
      "text": "o <T1, T2, ..., Tm-1, Tm>, a list of times.",
      "zh-CHS": "o <T1，T2，…，Tm-1，Tm>，时间列表。"
    },
    {
      "indent": 3,
      "text": "o <Tk, dTk.1, dTk.2, ..., dTk.a, ..., dTk.b,..., dTk.n, dTk>, a Type-P-Spatial-One-way-Delay-Vector.",
      "zh-CHS": "o <Tk，dTk.1，dTk.2，…，dTk.a，…，dTk.b，…，dTk.n，dTk>，一种P型空间单向延迟向量。"
    },
    {
      "indent": 0,
      "text": "6.3.3. Metric Units",
      "section_title": true,
      "zh-CHS": "6.3.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-Segment-ipdv-prev-Stream is a pair of:",
      "zh-CHS": "类型-P-段-ipdv-prev-流的值为一对："
    },
    {
      "indent": 6,
      "text": "The list of <T1, T2, ..., Tm-1, Tm>; and",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "A list of pairs of interval of times and delays;",
      "zh-CHS": "时间间隔和延迟对的列表；"
    },
    {
      "indent": 0,
      "text": "6.3.4. Definition",
      "section_title": true,
      "zh-CHS": "6.3.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given two routers, Ha and Hb, of the path <H1, H2,..., Ha, ..., Hb, ..., Hn> and the matrix of Type-P-Spatial-One-way-Delay-Vector for the packets sent from Src to Dst at times <T1, T2, ..., Tm-1, Tm> :",
      "zh-CHS": "给定路径<H1，H2，…，Ha，…，Hb，…，Hn>的两个路由器Ha和Hb，以及时间<T1，T2，…，Tm-1，Tm>从Src发送到Dst的数据包的P型空间单向延迟向量矩阵："
    },
    {
      "indent": 6,
      "text": "<T1, dT1.1, dT1.2, ..., dT1.a, ..., dT1.b,..., dT1.n, dT1>,",
      "zh-CHS": "<T1，dT1.1，dT1.2，…，dT1.a，…，dT1.b，…，dT1.n，dT1>，"
    },
    {
      "indent": 6,
      "text": "<T2, dT2.1, dT2.2, ..., dT2.a, ..., dT2.b,..., dT2.n, dT2>,",
      "zh-CHS": "<T2，dT2.1，dT2.2，…，dT2.a，…，dT2.b，…，dT2.n，dT2>，"
    },
    {
      "indent": 6,
      "text": "...",
      "zh-CHS": "..."
    },
    {
      "indent": 6,
      "text": "<Tm, dTm.1, dTm.2, ..., dTm.a, ..., dTm.b,..., dTm.n, dTm>.",
      "zh-CHS": "<Tm，dTm.1，dTm.2，…，dTm.a，…，dTm.b，…，dTm.n，dTm>。"
    },
    {
      "indent": 3,
      "text": "We define the Type-P-Segment-ipdv-prev-Stream as the sequence of packet time pairs and delay variations",
      "zh-CHS": "我们将类型P-Segment-ipdv-prev-Stream定义为分组时间对和延迟变化序列"
    },
    {
      "indent": 3,
      "text": "<(T1, T2 , dT2.ab - dT1.ab) ,...,",
      "zh-CHS": "<（T1，T2，dT2.ab-dT1.ab），。。。，"
    },
    {
      "indent": 3,
      "text": "(Tk-1, Tk, dTk.ab - dTk-1.ab), ...,",
      "zh-CHS": "（Tk-1，Tk，dTk.ab-dTk-1.ab）。。。，"
    },
    {
      "indent": 3,
      "text": "(Tm-1, Tm, dTm.ab - dTm-1.ab)>",
      "zh-CHS": "（Tm-1，Tm，dTm.ab-dTm-1.ab）>"
    },
    {
      "indent": 3,
      "text": "For any pair, Tk, Tk-1 in k=1 through m, the difference dTk.ab - dTk-1.ab is undefined if:",
      "zh-CHS": "对于k=1到m中的任何一对Tk，Tk-1，如果："
    },
    {
      "indent": 3,
      "text": "o the delay dTk.a or the delay dTk-1.a is undefined, OR",
      "zh-CHS": "o 延迟dTk.a或延迟dTk-1.a未定义，或"
    },
    {
      "indent": 3,
      "text": "o the delay dTk.b or the delay dTk-1.b is undefined.",
      "zh-CHS": "o 延迟dTk.b或延迟dTk-1.b未定义。"
    },
    {
      "indent": 0,
      "text": "6.3.5. Discussion",
      "section_title": true,
      "zh-CHS": "6.3.5. 讨论"
    },
    {
      "indent": 3,
      "text": "This metric belongs to the family of inter-packet delay variation metrics (IPDV in uppercase) whose results are extremely sensitive to the inter-packet interval in practice.",
      "zh-CHS": "该度量属于包间延迟变化度量（大写IPDV）家族，其结果在实践中对包间间隔极其敏感。"
    },
    {
      "indent": 3,
      "text": "The inter-packet interval of an end-to-end IPDV metric is under the control of the source (ingress point of interest). In contrast, the inter-packet interval of a segment IPDV metric is not under the control the ingress point of interest of the measure, Ha. The interval will certainly vary if there is delay variation between the Source and Ha. Therefore, the ingress inter-packet interval must be known at Ha in order to fully comprehend the delay variation between Ha and Hb.",
      "zh-CHS": "端到端IPDV度量的包间间隔由源（感兴趣的入口点）控制。相反，段IPDV度量的包间间隔不受度量的入口关注点Ha的控制。如果源和Ha之间存在延迟变化，则间隔肯定会变化。因此，为了充分理解Ha和Hb之间的延迟变化，必须知道Ha处的入口数据包间隔。"
    },
    {
      "indent": 0,
      "text": "6.4. A Definition of a Sample of ipdv of a Segment Using the Minimum Delay Selection Function",
      "zh-CHS": "6.4. 使用最小延迟选择函数定义段的ipdv样本"
    },
    {
      "indent": 3,
      "text": "This metric defines a sample of ipdv [RFC3393] over time between a pair of routers on a path using the minimum delay as one of the selected packets in every pair.",
      "zh-CHS": "该度量定义了路径上的一对路由器之间ipdv[RFC3393]随时间的样本，使用最小延迟作为每对路由器中选定的数据包之一。"
    },
    {
      "indent": 0,
      "text": "6.4.1. Metric Name",
      "section_title": true,
      "zh-CHS": "6.4.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-Segment-One-way-ipdv-min-Stream",
      "zh-CHS": "类型-P-段-单向-ipdv-min-Stream"
    },
    {
      "indent": 0,
      "text": "6.4.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "6.4.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of the sender.",
      "zh-CHS": "o Src，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of the receiver.",
      "zh-CHS": "o Dst，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Type-P, the specification of the packet type.",
      "zh-CHS": "o Type-P，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o k, an integer that orders the packets sent.",
      "zh-CHS": "o k、 对发送的数据包进行排序的整数。"
    },
    {
      "indent": 3,
      "text": "o i, an integer that identifies a packet sent.",
      "zh-CHS": "o i、 标识发送的数据包的整数。"
    },
    {
      "indent": 3,
      "text": "o n, an integer that orders the routers on the path.",
      "zh-CHS": "o n、 对路径上的路由器进行排序的整数。"
    },
    {
      "indent": 3,
      "text": "o a and b, two integers where b > a.",
      "zh-CHS": "o a和b，两个整数，其中b>a。"
    },
    {
      "indent": 3,
      "text": "o <H1, H2, ..., Ha, ..., Hb, ...,Hn>, the routers digest.",
      "zh-CHS": "o <H1，H2，…，Ha，…，Hb，…，Hn>，路由器文摘。"
    },
    {
      "indent": 3,
      "text": "o <T1, T2, ..., Tm-1, Tm>, a list of times.",
      "zh-CHS": "o <T1，T2，…，Tm-1，Tm>，时间列表。"
    },
    {
      "indent": 3,
      "text": "o <Tk, dTk.1, dTk.2, ..., dTk.a, ..., dTk.b,..., dTk.n, dTk>, a Type-P-Spatial-One-way-Delay-Vector.",
      "zh-CHS": "o <Tk，dTk.1，dTk.2，…，dTk.a，…，dTk.b，…，dTk.n，dTk>，一种P型空间单向延迟向量。"
    },
    {
      "indent": 0,
      "text": "6.4.3. Metric Units",
      "section_title": true,
      "zh-CHS": "6.4.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-Segment-One-way-ipdv-min-Stream is a pair of:",
      "zh-CHS": "类型P-段-单向-ipdv-min-流的值为一对："
    },
    {
      "indent": 6,
      "text": "The list of <T1, T2, ..., Tm-1, Tm>; and",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "A list of times.",
      "zh-CHS": "一份时间清单。"
    },
    {
      "indent": 0,
      "text": "6.4.4. Definition",
      "section_title": true,
      "zh-CHS": "6.4.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given two routers, Ha and Hb, of the path <H1, H2,..., Ha, ..., Hb, ..., Hn> and the matrix of Type-P-Spatial-One-way-Delay-Vector for the packets sent from Src to Dst at times <T1, T2, ..., Tm-1, Tm> :",
      "zh-CHS": "给定路径<H1，H2，…，Ha，…，Hb，…，Hn>的两个路由器Ha和Hb，以及时间<T1，T2，…，Tm-1，Tm>从Src发送到Dst的数据包的P型空间单向延迟向量矩阵："
    },
    {
      "indent": 6,
      "text": "<T1, dT1.1, dT1.2, ..., dT1.a, ..., dT1.b,..., dT1.n, dT1>,",
      "zh-CHS": "<T1，dT1.1，dT1.2，…，dT1.a，…，dT1.b，…，dT1.n，dT1>，"
    },
    {
      "indent": 6,
      "text": "<T2, dT2.1, dT2.2, ..., dT2.a, ..., dT2.b,..., dT2.n, dT2>,",
      "zh-CHS": "<T2，dT2.1，dT2.2，…，dT2.a，…，dT2.b，…，dT2.n，dT2>，"
    },
    {
      "indent": 6,
      "text": "...",
      "zh-CHS": "..."
    },
    {
      "indent": 6,
      "text": "<Tm, dTm.1, dTm.2, ..., dTm.a, ..., dTm.b,..., dTm.n, dTm>.",
      "zh-CHS": "<Tm，dTm.1，dTm.2，…，dTm.a，…，dTm.b，…，dTm.n，dTm>。"
    },
    {
      "indent": 3,
      "text": "We define the Type-P-Segment-One-way-ipdv-min-Stream as the sequence of times <dT1.ab - min(dTi.ab) ,..., dTk.ab - min(dTi.ab), ..., dTm.ab - min(dTi.ab)> where:",
      "zh-CHS": "我们将类型-P-段-单向-ipdv-min-Stream定义为时间序列<dT1.ab-min（dTi.ab），…，dTk.ab-min（dTi.ab），…，dTm.ab-min（dTi.ab）>，其中："
    },
    {
      "indent": 3,
      "text": "o min(dTi.ab) is the minimum value of the tuples (dTk.b - dTk.a);",
      "zh-CHS": "o min（dTi.ab）是元组（dTk.b-dTk.a）的最小值；"
    },
    {
      "indent": 3,
      "text": "o for each time Tk, dTk.ab is undefined if dTk.a or (inclusive) dTk.b is undefined, or the real number (dTk.b - dTk.a) is undefined.",
      "zh-CHS": "o 对于每次Tk，如果dTk.a或（包括）dTk.b未定义，或者实数（dTk.b-dTk.a）未定义，则dTk.ab未定义。"
    },
    {
      "indent": 0,
      "text": "6.4.5. Discussion",
      "section_title": true,
      "zh-CHS": "6.4.5. 讨论"
    },
    {
      "indent": 3,
      "text": "This metric belongs to the family of packet delay variation metrics (PDV). PDV distributions have less sensitivity to inter-packet interval variations than IPDV values, as discussed above.",
      "zh-CHS": "该度量属于包延迟变化度量（PDV）家族。如上所述，与IPDV值相比，PDV分布对包间间隔变化的敏感性更低。"
    },
    {
      "indent": 3,
      "text": "In principle, the PDV distribution reflects the variation over many different inter-packet intervals, from the smallest inter-packet interval, up to the length of the evaluation interval, Tm - T1. Therefore, when delay variation occurs and disturbs the packet spacing observed at Ha, the PDV results will likely compare favorably to a PDV measurement where the source is Ha and the destination is Hb, because a wide range of spacings are reflected in any PDV distribution.",
      "zh-CHS": "原则上，PDV分布反映了许多不同的包间间隔的变化，从最小的包间间隔到评估间隔的长度Tm-T1。因此，当延迟变化发生并干扰在Ha处观察到的分组间隔时，PDV结果可能会比源为Ha而目的地为Hb的PDV测量更有利，因为在任何PDV分布中都反映了大范围的间隔。"
    },
    {
      "indent": 0,
      "text": "7. One-to-Group Metrics Definitions",
      "section_title": true,
      "zh-CHS": "7. 一组度量定义"
    },
    {
      "indent": 3,
      "text": "This section defines performance metrics between a source and a group of receivers.",
      "zh-CHS": "本节定义了一个源和一组接收器之间的性能指标。"
    },
    {
      "indent": 0,
      "text": "7.1. A Definition for One-to-Group Delay",
      "section_title": true,
      "zh-CHS": "7.1. 一对群时延的定义"
    },
    {
      "indent": 3,
      "text": "This section defines a metric for one-way delay between a source and a group of receivers.",
      "zh-CHS": "本节定义了一个源和一组接收器之间单向延迟的度量。"
    },
    {
      "indent": 0,
      "text": "7.1.1. Metric Name",
      "section_title": true,
      "zh-CHS": "7.1.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-Delay-Vector",
      "zh-CHS": "P型一对群延迟向量"
    },
    {
      "indent": 0,
      "text": "7.1.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "7.1.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host acting as the source.",
      "zh-CHS": "o Src，作为源的主机的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Recv1,..., RecvN, the IP addresses of the N hosts acting as receivers.",
      "zh-CHS": "o Recv1，…，RecvN，作为接收器的N个主机的IP地址。"
    },
    {
      "indent": 3,
      "text": "o T, a time.",
      "zh-CHS": "o T、 一段时间。"
    },
    {
      "indent": 3,
      "text": "o dT1,...,dTn a list of times.",
      "zh-CHS": "o dT1，…，dTn时间列表。"
    },
    {
      "indent": 3,
      "text": "o Type-P, the specification of the packet type.",
      "zh-CHS": "o Type-P，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o Gr, the receiving group identifier. The parameter Gr is the multicast group address if the measured packets are transmitted over IP multicast. This parameter is to differentiate the measured traffic from other unicast and multicast traffic. It is OPTIONAL for this metric to avoid losing any generality, i.e., to make the metric also applicable to unicast measurement where there is only one receiver.",
      "zh-CHS": "o Gr，接收组标识符。如果测量的数据包是通过IP多播传输的，则参数Gr是多播组地址。此参数用于区分测量的流量与其他单播和多播流量。该度量是可选的，以避免失去任何通用性，即，使该度量也适用于只有一个接收机的单播测量。"
    },
    {
      "indent": 0,
      "text": "7.1.3. Metric Units",
      "section_title": true,
      "zh-CHS": "7.1.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-One-to-group-Delay-Vector is a set of Type-P-One-way-Delay singletons [RFC2679], that is a sequence of times (a real number in the dimension of seconds with sufficient resolution to convey the results).",
      "zh-CHS": "P型一对群延迟向量的值是一组P型单向延迟单态[RFC2679]，这是一个时间序列（具有足够分辨率以传递结果的秒为单位的实数）。"
    },
    {
      "indent": 0,
      "text": "7.1.4. Definition",
      "section_title": true,
      "zh-CHS": "7.1.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given a Type-P packet sent by the source Src at time T, and the N\nhosts { Recv1,...,RecvN } which receive the packet at the time {\nT+dT1,...,T+dTn }, or the packet does not pass a receiver within a\nspecified loss threshold time, then the Type-P-One-to-group-Delay-",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Vector is defined as the set of the Type-P-One-way-Delay singletons between Src and each receiver with value of { dT1, dT2,...,dTn }, where any of the singletons may be undefined if the packet did not pass the corresponding receiver within a specified loss threshold time.",
      "zh-CHS": "向量被定义为Src和每个接收器之间的P型单向延迟单例集，其值为{dT1，dT2，…，dTn}，其中，如果数据包在指定的丢失阈值时间内没有通过相应的接收器，则任何单例都可能未定义。"
    },
    {
      "indent": 0,
      "text": "7.2. A Definition for One-to-Group Packet Loss",
      "section_title": true,
      "zh-CHS": "7.2. 一对一分组丢包的定义"
    },
    {
      "indent": 0,
      "text": "7.2.1. Metric Name",
      "section_title": true,
      "zh-CHS": "7.2.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-Packet-Loss-Vector",
      "zh-CHS": "P型一对群丢包向量"
    },
    {
      "indent": 0,
      "text": "7.2.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "7.2.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host acting as the source.",
      "zh-CHS": "o Src，作为源的主机的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Recv1,..., RecvN, the IP addresses of the N hosts acting as receivers.",
      "zh-CHS": "o Recv1，…，RecvN，作为接收器的N个主机的IP地址。"
    },
    {
      "indent": 3,
      "text": "o T, a time.",
      "zh-CHS": "o T、 一段时间。"
    },
    {
      "indent": 3,
      "text": "o Type-P, the specification of the packet type.",
      "zh-CHS": "o Type-P，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o Gr, the receiving group identifier, OPTIONAL.",
      "zh-CHS": "o Gr，接收组标识符，可选。"
    },
    {
      "indent": 0,
      "text": "7.2.3. Metric Units",
      "section_title": true,
      "zh-CHS": "7.2.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-One-to-group-Packet-Loss-Vector is a set of Type-P-One-way-Packet-Loss singletons [RFC2680].",
      "zh-CHS": "P-One-to-group-Packet-Loss-Vector类型的值是一组P-One-way-Packet-Loss-singleton类型[RFC2680]。"
    },
    {
      "indent": 3,
      "text": "o T, time the source packet was sent.",
      "zh-CHS": "o T、 发送源数据包的时间。"
    },
    {
      "indent": 3,
      "text": "o L1,...,LN a list of Boolean values.",
      "zh-CHS": "o L1，…，在布尔值列表中。"
    },
    {
      "indent": 0,
      "text": "7.2.4. Definition",
      "section_title": true,
      "zh-CHS": "7.2.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given a Type-P packet sent by the source Src at T and the N hosts, Recv1,...,RecvN, the Type-P-One-to-group-Packet-Loss-Vector is defined as a set of the Type-P-One-way-Packet-Loss singletons between Src and each of the receivers:",
      "zh-CHS": "给定由T处的源Src和N个主机Recv1，…，RecvN发送的P型分组，P型一对组分组丢失向量被定义为Src和每个接收机之间的P型单向分组丢失单例的集合："
    },
    {
      "indent": 3,
      "text": "{T, <L1=0|1>,<L2=0|1>,..., <LN=0|1>},",
      "zh-CHS": "{T，<L1=0 | 1>，<L2=0 | 1>，…，<LN=0 | 1>，"
    },
    {
      "indent": 3,
      "text": "where the Boolean value 0|1 depends on receiving the packet at a particular receiver within a loss threshold time.",
      "zh-CHS": "其中，布尔值0 | 1取决于在丢失阈值时间内在特定接收器处接收数据包。"
    },
    {
      "indent": 0,
      "text": "7.3. A Definition for One-to-Group ipdv",
      "section_title": true,
      "zh-CHS": "7.3. 一组ipdv的定义"
    },
    {
      "indent": 0,
      "text": "7.3.1. Metric Name",
      "section_title": true,
      "zh-CHS": "7.3.1. 度量名称"
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-ipdv-Vector",
      "zh-CHS": "类型-P-一对群-ipdv-载体"
    },
    {
      "indent": 0,
      "text": "7.3.2. Metric Parameters",
      "section_title": true,
      "zh-CHS": "7.3.2. 度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host acting as the source.",
      "zh-CHS": "o Src，作为源的主机的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Recv1,..., RecvN, the IP addresses of the N hosts acting as receivers.",
      "zh-CHS": "o Recv1，…，RecvN，作为接收器的N个主机的IP地址。"
    },
    {
      "indent": 3,
      "text": "o T1, a time.",
      "zh-CHS": "o T1，一次。"
    },
    {
      "indent": 3,
      "text": "o T2, a time.",
      "zh-CHS": "o T2，一次。"
    },
    {
      "indent": 3,
      "text": "o ddT1, ...,ddTn, a list of times.",
      "zh-CHS": "o ddT1，…，ddTn，时间列表。"
    },
    {
      "indent": 3,
      "text": "o Type-P, the specification of the packet type.",
      "zh-CHS": "o Type-P，数据包类型的规范。"
    },
    {
      "indent": 3,
      "text": "o F, a selection function non-ambiguously defining the two packets from the stream selected for the metric.",
      "zh-CHS": "o F、 选择函数从为度量选择的流中非含糊地定义两个数据包。"
    },
    {
      "indent": 3,
      "text": "o Gr, the receiving group identifier. The parameter Gr is the multicast group address if the measured packets are transmitted over IP multicast. This parameter is to differentiate the measured traffic from other unicast and multicast traffic. It is OPTIONAL in the metric to avoid losing any generality, i.e., to make the metric also applicable to unicast measurement where there is only one receiver.",
      "zh-CHS": "o Gr，接收组标识符。如果测量的数据包是通过IP多播传输的，则参数Gr是多播组地址。此参数用于区分测量的流量与其他单播和多播流量。在度量中是可选的，以避免失去任何通用性，即，使度量也适用于只有一个接收机的单播测量。"
    },
    {
      "indent": 0,
      "text": "7.3.3. Metric Units",
      "section_title": true,
      "zh-CHS": "7.3.3. 公制单位"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-One-to-group-ipdv-Vector is a set of Type-P-One-way-ipdv singletons [RFC3393].",
      "zh-CHS": "类型-P-One-to-group-ipdv-Vector的值是一组类型-P-One-way-ipdv单例[RFC3393]。"
    },
    {
      "indent": 0,
      "text": "7.3.4. Definition",
      "section_title": true,
      "zh-CHS": "7.3.4. 释义"
    },
    {
      "indent": 3,
      "text": "Given a Type-P packet stream, Type-P-One-to-group-ipdv-Vector is defined for two packets transferred from the source Src to the N hosts {Recv1,...,RecvN }, which are selected by the selection function F as the difference between the value of the Type-P-One-to-group-Delay-Vector from Src to { Recv1,..., RecvN } at time T1 and the value of the Type-P-One-to-group-Delay-Vector from Src to { Recv1,...,RecvN } at time T2. T1 is the wire-time at which Src sent",
      "zh-CHS": "给定P型分组流，为从源Src传输到N个主机{Recv1，…，RecvN}的两个分组定义P型一对群ipdv-Vector，选择函数F将其选择为从Src到{Recv1，…，RecvN}的P型一对群延迟向量的值之间的差值在时间T1处，以及在时间T2处从Src到{Recv1，…，RecvN}的P型一对群延迟向量的值。T1是Src发送的连线时间"
    },
    {
      "indent": 3,
      "text": "the first bit of the first packet, and T2 is the wire-time at which Src sent the first bit of the second packet. This metric is derived from the Type-P-One-to-group-Delay-Vector metric.",
      "zh-CHS": "第一分组的第一位，T2是Src发送第二分组的第一位的连线时间。该度量源自P型一对群延迟向量度量。"
    },
    {
      "indent": 3,
      "text": "For a set of real numbers {ddT1,...,ddTn}, the Type-P-One-to-group-ipdv-Vector from Src to { Recv1,...,RecvN } at T1, T2 is {ddT1,...,ddTn} means that Src sent two packets, the first at wire-time T1 (first bit), and the second at wire-time T2 (first bit) and the packets were received by { Recv1,...,RecvN } at wire-time {dT1+ T1,...,dTn+T1}(last bit of the first packet), and at wire-time {dT'1+ T2,...,dT'n+T2} (last bit of the second packet), and that {dT'1- dT1,...,dT'n-dTn} ={ddT1,...,ddTn}.",
      "zh-CHS": "对于一组实数{ddT1，…，ddTn}，在T1，T2处从Src到{Recv1，…，RecvN}的P-One-to-group-ipdv-Vector类型是{ddT1，…，ddTn}，这意味着Src发送了两个包，第一个包在连线时间T1（第一位），第二个包在连线时间T2（第一位），并且包在连线时间{dT1+T1，…，dTn+T1}处被{Recv1，…，RecvN}接收（第一个包的最后一位），并且在连线时间{dT'1+T2，…，dT'n+T2}（第二个包的最后一位），并且{dT'1-dT1，…，dT'n-dTn}={ddT1，…，ddTn}。"
    },
    {
      "indent": 3,
      "text": "For any pair of selected packets, the difference dT'n-dTn is undefined if:",
      "zh-CHS": "对于任何一对选定的数据包，如果："
    },
    {
      "indent": 3,
      "text": "o the delay dTn to Receiver n is undefined, OR",
      "zh-CHS": "o 到接收器n的延迟dTn未定义，或"
    },
    {
      "indent": 3,
      "text": "o the delay dT'n to Receiver n is undefined.",
      "zh-CHS": "o 到接收器n的延迟dT'n未定义。"
    },
    {
      "indent": 0,
      "text": "8. One-to-Group Sample Statistics",
      "section_title": true,
      "zh-CHS": "8. 一组样本统计"
    },
    {
      "indent": 3,
      "text": "The one-to-group metrics defined above are directly achieved by collecting relevant unicast one-way metrics measurements results and by gathering them per group of receivers. They produce network performance information that guides engineers toward potential problems that may have happened on any branch of a multicast routing tree.",
      "zh-CHS": "通过收集相关的单播单向度量测量结果并将其收集到每组接收机，可以直接实现上面定义的一对一组度量。它们产生网络性能信息，指导工程师解决可能发生在多播路由树的任何分支上的潜在问题。"
    },
    {
      "indent": 3,
      "text": "The results of these metrics are not directly usable to present the performance of a group because each result is made of a huge number of singletons that are difficult to read and analyze. As an example, delays are not comparable because the distance between receiver and sender differs. Furthermore, they don't capture relative performance situations in a multiparty communication.",
      "zh-CHS": "这些指标的结果不能直接用于表示组的性能，因为每个结果都由大量难以读取和分析的单例组成。例如，延迟是不可比较的，因为接收器和发送器之间的距离不同。此外，它们不会捕获多方通信中的相对性能情况。"
    },
    {
      "indent": 3,
      "text": "From the performance point of view, the multiparty communication services not only require the support of absolute performance information but also information on \"relative performance\". \"Relative performance\" means the difference between absolute performance of all users. Directly using the one-way metrics cannot present the relative performance situation. However, if we use the variations of all users' one-way parameters, we can have new metrics to measure the difference of the absolute performance and hence provide the threshold value of relative performance that a multiparty service might demand. A very good example of the high relative performance requirement is online gaming. A very small difference in delay might result in failure in the game. We have to use multicast-",
      "zh-CHS": "从性能角度来看，多方通信服务不仅需要绝对性能信息的支持，还需要“相对性能”信息的支持。“相对性能”是指所有用户的绝对性能之间的差异。直接使用单向指标无法呈现相对性能状况。然而，如果我们使用所有用户单向参数的变化，我们可以有新的度量来测量绝对性能的差异，从而提供多方服务可能需要的相对性能阈值。相对性能要求较高的一个很好的例子是在线游戏。延迟上的微小差异可能导致游戏失败。我们必须使用多播-"
    },
    {
      "indent": 3,
      "text": "specific statistic metrics to define the relative delay required by online gaming. There are many other services, e.g., online biding, online stock market, etc., that require multicast metrics in order to evaluate the network against their requirements. Therefore, we can see the importance of new, multicast specific, statistic metrics to feed this need.",
      "zh-CHS": "用于定义在线游戏所需相对延迟的特定统计指标。还有许多其他服务，如在线竞价、在线股票市场等，需要多播度量，以便根据其需求评估网络。因此，我们可以看到新的、特定于多播的统计指标满足这一需求的重要性。"
    },
    {
      "indent": 3,
      "text": "We might also use some one-to-group statistic conceptions to present and report the group performance and relative performance to save the report transmission bandwidth. Statistics have been defined for One-way metrics in corresponding RFCs. They provide the foundation of definition for performance statistics. For instance, there are definitions for minimum and maximum one-way delay in [RFC2679]. However, there is a dramatic difference between the statistics for one-to-one communications and for one-to-many communications. The former one only has statistics over the time dimension while the later one can have statistics over both time and space dimensions. This space dimension is introduced by the Matrix concept as illustrated in Figure 4. For a Matrix M, each row is a set of one-way singletons spreading over the time dimension and each column is another set of One-way singletons spreading over the space dimension.",
      "zh-CHS": "我们还可以使用一些一组统计概念来表示和报告组性能和相对性能，以节省报告传输带宽。在相应的RFC中定义了单向度量的统计信息。它们为性能统计提供了定义的基础。例如，[RFC2679]中有最小和最大单向延迟的定义。然而，一对一通信和一对多通信的统计数据之间存在巨大差异。前者只包含时间维度的统计信息，而后者可以包含时间维度和空间维度的统计信息。该空间维度由矩阵概念引入，如图4所示。对于矩阵M，每一行是一组单向单态分布在时间维度上，每一列是另一组单向单态分布在空间维度上。"
    },
    {
      "indent": 12,
      "text": "Receivers\n Space\n   ^\n 1 |    / R1dT1   R1dT2     R1dT3 ... R1dTk \\\n   |   |                                     |\n 2 |   |  R2dT1   R2dT2     R2dT3 ... R2dTk  |\n   |   |                                     |\n 3 |   |  R3dT1   R3dT2     R3dT3 ... R3dTk  |\n . |   |                                     |\n . |   |                                     |\n . |   |                                     |\n n |    \\ RndT1   RndT2     RndT3 ... RndTk /\n   +--------------------------------------------> time\n  T0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 25,
      "text": "Figure 4: Matrix M (n*m)",
      "zh-CHS": "图4：矩阵M（n*M）"
    },
    {
      "indent": 3,
      "text": "In Matrix M, each element is a one-way delay singleton. Each column is a delay vector. It contains the one-way delays of the same packet observed at n points of interest. It implies the geographical factor of the performance within a group. Each row is a set of one-way delays observed during a sampling interval at one of the points of interest. It presents the delay performance at a receiver over the time dimension.",
      "zh-CHS": "在矩阵M中，每个元素都是单向延迟单体。每列都是一个延迟向量。它包含在n个关注点观察到的同一数据包的单向延迟。它意味着一个群体内表现的地理因素。每一行是在一个关注点的采样间隔期间观察到的一组单向延迟。它表示接收机在时间维度上的延迟性能。"
    },
    {
      "indent": 3,
      "text": "Therefore, one can either calculate statistics by rows over the space dimension or by columns over the time dimension. It's up to the operators or service providers in which dimension they are interested. For example, a TV broadcast service provider might want to know the statistical performance of each user in a long-term run to make sure their services are acceptable and stable. While for an online gaming service provider, he might be more interested in knowing if all users are served fairly by calculating the statistics over the space dimension. This memo does not intend to recommend which of the statistics are better than the others.",
      "zh-CHS": "因此，可以通过空间维度上的行或时间维度上的列来计算统计信息。这取决于运营商或服务提供商对哪个维度感兴趣。例如，电视广播服务提供商可能希望了解每个用户在长期运行中的统计性能，以确保其服务可接受且稳定。而对于在线游戏服务提供商来说，他可能更感兴趣的是通过计算空间维度的统计数据来了解是否所有用户都得到了公平的服务。本备忘录并不打算建议哪一项统计数据优于其他统计数据。"
    },
    {
      "indent": 3,
      "text": "To save the report transmission bandwidth, each point of interest can send statistics in a pre-defined time interval to the reference point rather than sending every one-way singleton it observed. As long as an appropriate time interval is decided, appropriate statistics can represent the performance in a certain accurate scale. How to decide the time interval and how to bootstrap all points of interest and the reference point depend on applications. For instance, applications with a lower transmission rate can have the time interval be longer, and ones with higher transmission rate can have the time interval be shorter. However, this is out of the scope of this memo.",
      "zh-CHS": "为了节省报告传输带宽，每个关注点可以在预定义的时间间隔内向参考点发送统计信息，而不是发送它观察到的每个单向单态。只要确定适当的时间间隔，适当的统计数据就可以在一定的准确范围内表示性能。如何确定时间间隔以及如何引导所有关注点和参考点取决于应用程序。例如，具有较低传输速率的应用可以具有较长的时间间隔，而具有较高传输速率的应用可以具有较短的时间间隔。但是，这超出了本备忘录的范围。"
    },
    {
      "indent": 3,
      "text": "Moreover, after knowing the statistics over the time dimension, one might want to know how these statistics are distributed over the space dimension. For instance, a TV broadcast service provider had the performance Matrix M and calculated the one-way delay mean over the time dimension to obtain a delay Vector as {V1,V2,..., VN}. He then calculated the mean of all the elements in the Vector to see what level of delay he has served to all N users. This new delay mean gives information on how well the service has been delivered to a group of users during a sampling interval in terms of delay. It requires twice as much calculation to have this statistic over both time and space dimensions. These kinds of statistics are referred to as 2-level statistics to distinguish them from 1-level statistics calculated over either space or time dimension. It can be easily proven that no matter over which dimension a 2-level statistic is calculated first, the results are the same. That is, one can calculate the 2-level delay mean using the Matrix M by having the 1-level delay mean over the time dimension first and then calculate the mean of the obtained vector to find out the 2-level delay mean. Or, he can do the 1-level statistic calculation over the space dimension first and then have the 2-level delay mean. Both results will be exactly the same. Therefore, when defining a 2-level statistic, there is no need to specify the order in which the calculation is executed.",
      "zh-CHS": "此外，在了解了时间维度上的统计信息之后，您可能想知道这些统计信息在空间维度上是如何分布的。例如，电视广播服务提供商具有性能矩阵M并计算时间维度上的单向延迟平均值以获得延迟向量{V1，V2，…，VN}。然后，他计算向量中所有元素的平均值，以查看他为所有N个用户提供的延迟水平。这个新的延迟平均值给出了在一个采样间隔内，服务在延迟方面交付给一组用户的情况。在时间和空间维度上都需要两倍的计算才能得到此统计数据。这类统计称为2级统计，以区别于在空间或时间维度上计算的1级统计。可以很容易地证明，无论在哪个维度上首先计算两级统计量，结果都是相同的。也就是说，可以使用矩阵M通过首先在时间维度上具有1级延迟平均值来计算2级延迟平均值，然后计算所获得向量的平均值以找出2级延迟平均值。或者，他可以先对空间维度进行一级统计计算，然后得到二级延迟平均值。两个结果将完全相同。因此，在定义两级统计时，不需要指定执行计算的顺序。"
    },
    {
      "indent": 3,
      "text": "Many statistics can be defined for the proposed one-to-group metrics over the space dimension, the time dimension, or both. This memo treats the case where a stream of packets from the Source results in a sample at each of the Receivers in the Group, and these samples are each summarized with the usual statistics employed in one-to-one communication. New statistic definitions are presented, which summarize the one-to-one statistics over all the Receivers in the Group.",
      "zh-CHS": "可以为提议的一组度量定义许多统计信息，包括空间维度、时间维度或两者。此备忘录处理来自源的数据包流在组中的每个接收器处产生样本的情况，并且这些样本用一对一通信中使用的常用统计数据进行汇总。提出了新的统计定义，总结了组中所有接收者的一对一统计。"
    },
    {
      "indent": 0,
      "text": "8.1. Discussion on the Impact of Packet Loss on Statistics",
      "section_title": true,
      "zh-CHS": "8.1. 分组丢失对统计的影响探讨"
    },
    {
      "indent": 3,
      "text": "Packet loss does have effects on one-way metrics and their statistics. For example, a lost packet can result in an infinite one-way delay. It is easy to handle the problem by simply ignoring the infinite value in the metrics and in the calculation of the corresponding statistics. However, the packet loss has such a strong impact on the statistics calculation for the one-to-group metrics that it can not be solved by the same method used for one-way",
      "zh-CHS": "数据包丢失确实会对单向度量及其统计数据产生影响。例如，丢失的数据包可能导致无限单向延迟。通过简单地忽略度量和相应统计计算中的无穷大值，很容易处理该问题。然而，数据包丢失对一对一组度量的统计计算有很大的影响，因此不能用用于单向分组的相同方法来解决"
    },
    {
      "indent": 3,
      "text": "metrics. This is due to the complexity of building a matrix, which is needed for calculation of the statistics proposed in this memo.",
      "zh-CHS": "韵律学。这是因为构建矩阵的复杂性，这是计算本备忘录中提出的统计数据所需的。"
    },
    {
      "indent": 3,
      "text": "The situation is that measurement results obtained by different end\nusers might have different packet loss pattern.  For example, for\nUser1, packet A was observed to be lost.  And for User2, packet A was\nsuccessfully received, but packet B was lost.  If the method to\novercome the packet loss for one-way metrics is applied, the two\nsingleton sets reported by User1 and User2 will be different in terms\nof the transmitted packets.  Moreover, if User1 and User2 have a\ndifferent number of lost packets, the size of the results will be\ndifferent.  Therefore, for the centralized calculation, the reference\npoint will not be able to use these two results to build up the group\nMatrix and cannot calculate the statistics.  The extreme situation\nbeing the case when no packets arrive at any user.  One of the\npossible solutions is to replace the infinite/undefined delay value\nby the average of the two adjacent values.  For example, if the\nresult reported by User1 is { R1dT1 R1dT2 R1dT3 ...  R1dTK-1 UNDEF\nR1dTK+1...  R1MD } where \"UNDEF\" is an undefined value, the reference\npoint can replace it by R1dTK = {(R1dTK-1)+( R1dTK+1)}/2.  Therefore,\nthis result can be used to build up the group Matrix with an\nestimated value R1dTK.  There are other possible solutions, such as\nusing the overall mean of the whole result to replace the infinite/\nundefined value, and so on.  However, this is out of the scope of\nthis memo.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "For the distributed calculation, the reported statistics might have different \"weight\" to present the group performance, which is especially true for delay and ipdv relevant metrics. For example,",
      "zh-CHS": "对于分布式计算，报告的统计数据可能具有不同的“权重”来表示组性能，对于延迟和ipdv相关度量尤其如此。例如"
    },
    {
      "indent": 3,
      "text": "User1 calculates the Type-P-Finite-One-way-Delay-Mean R1MD as shown in Figure 7 without any packet loss, and User2 calculates the R2MD with N-2 packet loss. The R1MD and R2MD should not be treated with equal weight because R2MD was calculated only based on two delay values in the whole sample interval. One possible solution is to use a weight factor to mark every statistic value sent by users and use this factor for further statistic calculation.",
      "zh-CHS": "User1计算类型P-Finite-One-way-Delay-Mean R1MD，如图7所示，无任何数据包丢失，User2计算具有N-2数据包丢失的R2MD。R1MD和R2MD的权重不应相等，因为R2MD仅基于整个样本间隔内的两个延迟值进行计算。一种可能的解决方案是使用权重因子标记用户发送的每个统计值，并使用该因子进行进一步的统计计算。"
    },
    {
      "indent": 0,
      "text": "8.2. General Metric Parameters",
      "section_title": true,
      "zh-CHS": "8.2. 一般度量参数"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host.",
      "zh-CHS": "o Src，主机的IP地址。"
    },
    {
      "indent": 3,
      "text": "o G, the receiving group identifier.",
      "zh-CHS": "o G、 接收组标识符。"
    },
    {
      "indent": 3,
      "text": "o N, the number of Receivers (Recv1, Recv2, ... RecvN).",
      "zh-CHS": "o N、 接收器的数量（Recv1、Recv2、RecvN）。"
    },
    {
      "indent": 3,
      "text": "o T, a time (start of test interval).",
      "zh-CHS": "o T、 时间（测试间隔的开始）。"
    },
    {
      "indent": 3,
      "text": "o Tf, a time (end of test interval).",
      "zh-CHS": "o Tf，一个时间（测试间隔结束）。"
    },
    {
      "indent": 3,
      "text": "o K, the number of packets sent from the source during the test interval.",
      "zh-CHS": "o K、 测试间隔期间从源发送的数据包数。"
    },
    {
      "indent": 3,
      "text": "o J[n], the number of packets received at a particular Receiver, n, where 1<=n<=N.",
      "zh-CHS": "o J[n]，在特定接收器接收的数据包数量，n，其中1<=n<=n。"
    },
    {
      "indent": 3,
      "text": "o lambda, a rate in reciprocal seconds (for Poisson Streams).",
      "zh-CHS": "o lambda，以倒数秒为单位的速率（对于泊松流）。"
    },
    {
      "indent": 3,
      "text": "o incT, the nominal duration of inter-packet interval, first bit to first bit (for Periodic Streams).",
      "zh-CHS": "o incT，数据包间隔的标称持续时间，从第一位到第一位（对于周期性流）。"
    },
    {
      "indent": 3,
      "text": "o T0, a time that MUST be selected at random from the interval [T, T+I] to start generating packets and taking measurements (for Periodic Streams).",
      "zh-CHS": "o T0，必须从间隔[T，T+I]中随机选择以开始生成分组和进行测量（对于周期流）的时间。"
    },
    {
      "indent": 3,
      "text": "o TstampSrc, the wire-time of the packet as measured at MP(Src) (the Source Measurement Point).",
      "zh-CHS": "o TstampSrc，在MP（Src）（源测量点）测量的数据包的连线时间。"
    },
    {
      "indent": 3,
      "text": "o TstampRecv, the wire-time of the packet as measured at MP(Recv), assigned to packets that arrive within a \"reasonable\" time.",
      "zh-CHS": "o TstampRecv，在MP（Recv）处测量的数据包的连线时间，分配给在“合理”时间内到达的数据包。"
    },
    {
      "indent": 3,
      "text": "o Tmax, a maximum waiting time for packets at the destination, set sufficiently long to disambiguate packets with long delays from packets that are discarded (lost); thus, the distribution of delay is not truncated.",
      "zh-CHS": "o Tmax，目的地数据包的最大等待时间，设置为足够长，以消除丢弃（丢失）数据包的长延迟数据包的歧义；因此，延迟的分布不会被截断。"
    },
    {
      "indent": 3,
      "text": "o dT, shorthand notation for a one-way delay singleton value.",
      "zh-CHS": "o dT，单向延迟单态值的简写符号。"
    },
    {
      "indent": 3,
      "text": "o L, shorthand notation for a one-way loss singleton value, either zero or one, where L=1 indicates loss and L=0 indicates arrival at the destination within TstampSrc + Tmax, may be indexed over n Receivers.",
      "zh-CHS": "o 五十、 单向损耗单态值（零或一）的简写符号，其中L=1表示损耗，L=0表示到达TstampSrc+Tmax内的目的地，可在n个接收机上编制索引。"
    },
    {
      "indent": 3,
      "text": "o DV, shorthand notation for a one-way delay variation singleton value.",
      "zh-CHS": "o DV，单向延迟变化单态值的简写符号。"
    },
    {
      "indent": 0,
      "text": "8.3. One-to-Group Delay Statistics",
      "section_title": true,
      "zh-CHS": "8.3. 一对一分组时延统计"
    },
    {
      "indent": 3,
      "text": "This section defines the overall one-way delay statistics for a receiver and for an entire group as illustrated by the matrix below.",
      "zh-CHS": "本节定义了接收机和整个组的整体单向延迟统计信息，如下表所示。"
    },
    {
      "indent": 6,
      "text": "Recv    /----------- Sample -------------\\   Stats      Group Stat",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "1 R1dT1 R1dT2 R1dT3 ... R1dTk R1MD \\ | 2 R2dT1 R2dT2 R2dT3 ... R2dTk R2MD | | 3 R3dT1 R3dT2 R3dT3 ... R3dTk R3MD > Group Delay . | . | . | n RndT1 RndT2 RndT3 ... RndTk RnMD /",
      "zh-CHS": "1 R1dT1 R1dT2 R1dT3。。。R1dTk R1MD\\| 2 R2dT1 R2dT2 R2dT3。。。R2dTk R2MD | | 3 R3dT1 R3dT2 R3dT3。。。R3dTk R3MD>群延迟n RndT1 RndT2 RndT3。。。RndTk RnMD/"
    },
    {
      "indent": 49,
      "text": "Receiver-n Delay",
      "zh-CHS": "接收机n延迟"
    },
    {
      "indent": 21,
      "text": "Figure 5: One-to-Group Mean Delay",
      "zh-CHS": "图5：一对一组平均延迟"
    },
    {
      "indent": 3,
      "text": "Statistics are computed on the finite one-way delays of the matrix above.",
      "zh-CHS": "统计数据是根据上述矩阵的有限单向延迟计算的。"
    },
    {
      "indent": 3,
      "text": "All one-to-group delay statistics are expressed in seconds with sufficient resolution to convey three significant digits.",
      "zh-CHS": "所有一对群延迟统计数据均以秒为单位表示，分辨率足以传输三个有效数字。"
    },
    {
      "indent": 0,
      "text": "8.3.1. Type-P-One-to-group-Receiver-n-Mean-Delay",
      "section_title": true,
      "zh-CHS": "8.3.1. P型一对群接收机n平均时延"
    },
    {
      "indent": 3,
      "text": "This section defines Type-P-One-to-group-Receiver-n-Mean-Delay, the Delay Mean, at each Receiver N, also named RnMD.",
      "zh-CHS": "本节定义了类型P-One-to-group-Receiver-n-Mean-Delay，即每个接收器n处的延迟平均值，也称为RnMD。"
    },
    {
      "indent": 3,
      "text": "We obtain the value of Type-P-One-way-Delay singleton for all packets sent during the test interval at each Receiver (Destination), as per [RFC2679]. For each packet that arrives within Tmax of its sending time, TstampSrc, the one-way delay singleton (dT) will be the finite value TstampRecv[i] - TstampSrc[i] in units of seconds. Otherwise, the value of the singleton is Undefined.",
      "zh-CHS": "根据[RFC2679]，我们获得每个接收器（目的地）在测试间隔期间发送的所有数据包的P型单向延迟单例值。对于在其发送时间Tmax内到达的每个分组，TstampSrc，单向延迟单例（dT）将是以秒为单位的有限值TstampRecv[i]-TstampSrc[i]。否则，singleton的值是未定义的。"
    },
    {
      "indent": 11,
      "text": "                J[n]\n                ---\n           1    \\\nRnMD =    --- *  >  TstampRecv[i] - TstampSrc[i]\n          J[n]  /\n                ---\n                i = 1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Note: RnMD value is Undefined when J[n] = 0 for all n.",
      "zh-CHS": "注：当所有n的J[n]=0时，RnMD值未定义。"
    },
    {
      "indent": 12,
      "text": "Figure 6: Type-P-One-to-group-Receiver-n-Mean-Delay",
      "zh-CHS": "图6:P型一对群接收机n平均延迟"
    },
    {
      "indent": 3,
      "text": "where all packets i= 1 through J[n] have finite singleton delays.",
      "zh-CHS": "其中，所有数据包i=1到J[n]具有有限的单态延迟。"
    },
    {
      "indent": 0,
      "text": "8.3.2. Type-P-One-to-group-Mean-Delay",
      "section_title": true,
      "zh-CHS": "8.3.2. P型一对群平均延迟"
    },
    {
      "indent": 3,
      "text": "This section defines Type-P-One-to-group-Mean-Delay, the Mean one-way Delay calculated over the entire Group, also named GMD.",
      "zh-CHS": "本节定义了P型单对群平均延迟，即在整个群上计算的平均单向延迟，也称为GMD。"
    },
    {
      "indent": 28,
      "text": "             N\n            ---\n       1    \\\nGMD =  - *   >   RnMD\n       N    /\n            ---\n            n = 1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 7: Type-P-One-to-group-Mean-Delay",
      "zh-CHS": "图7:P型一对群平均延迟"
    },
    {
      "indent": 3,
      "text": "Note that the Group Mean Delay can also be calculated by summing the finite one-way delay singletons in the matrix, and dividing by the number of finite one-way delay singletons.",
      "zh-CHS": "请注意，也可以通过将矩阵中的有限单向延迟单例相加，然后除以有限单向延迟单例数来计算组平均延迟。"
    },
    {
      "indent": 0,
      "text": "8.3.3. Type-P-One-to-group-Range-Mean-Delay",
      "section_title": true,
      "zh-CHS": "8.3.3. P型一对群距离平均延迟"
    },
    {
      "indent": 3,
      "text": "This section defines a metric for the Range of Mean Delays over all N receivers in the Group (R1MD, R2MD...RnMD).",
      "zh-CHS": "本节定义了组中所有N个接收机（R1MD、R2MD…RnMD）的平均延迟范围的度量。"
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-Range-Mean-Delay = GRMD = max(RnMD) - min(RnMD)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8.3.4. Type-P-One-to-group-Max-Mean-Delay",
      "section_title": true,
      "zh-CHS": "8.3.4. P型一对群最大平均时延"
    },
    {
      "indent": 3,
      "text": "This section defines a metric for the Maximum of Mean Delays over all N receivers in the Group (R1MD, R2MD,...RnMD).",
      "zh-CHS": "本节定义了组中所有N个接收机（R1MD、R2MD、…RnMD）的最大平均延迟的度量。"
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-Max-Mean-Delay = GMMD = max(RnMD)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8.4. One-to-Group Packet Loss Statistics",
      "section_title": true,
      "zh-CHS": "8.4. 一组数据包丢失统计数据"
    },
    {
      "indent": 3,
      "text": "This section defines the overall one-way loss statistics for a receiver and for an entire group as illustrated by the matrix below.",
      "zh-CHS": "本节定义了接收机和整个组的整体单向损耗统计数据，如下表所示。"
    },
    {
      "indent": 4,
      "text": "Recv    /----------- Sample ----------\\   Stats     Group Stat",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "1 R1L1 R1L2 R1L3 ... R1Lk R1LR \\ | 2 R2L1 R2L2 R2L3 ... R2Lk R2LR | | 3 R3L1 R3L2 R3L3 ... R3Lk R3LR > Group Loss Ratio . | . | . | n RnL1 RnL2 RnL3 ... RnLk RnLR /",
      "zh-CHS": "1 R1L1 R1L2 R1L3。。。R1Lk R1LR\\| 2 R2L1 R2L2 R2L3。。。R2Lk R2LR | | 3 R3L1 R3L2 R3L3。。。R3Lk R3LR>集团损失率n RnL1 RnL2 RnL3。。。RnLk RnLR/"
    },
    {
      "indent": 43,
      "text": "Receiver-n Loss Ratio",
      "zh-CHS": "接收机n损耗比"
    },
    {
      "indent": 21,
      "text": "Figure 8: One-to-Group Loss Ratio",
      "zh-CHS": "图8：一对一损失率"
    },
    {
      "indent": 3,
      "text": "Statistics are computed on the sample of Type-P-One-way-Packet-Loss [RFC2680] of the matrix above.",
      "zh-CHS": "统计数据是根据上述矩阵的P型单向丢包[RFC2680]样本计算的。"
    },
    {
      "indent": 3,
      "text": "All loss ratios are expressed in units of packets lost to total packets sent.",
      "zh-CHS": "所有丢失率均以丢失的数据包与发送的数据包总数之比表示。"
    },
    {
      "indent": 0,
      "text": "8.4.1. Type-P-One-to-group-Receiver-n-Loss-Ratio",
      "section_title": true,
      "zh-CHS": "8.4.1. P型一对群接收机n损耗比"
    },
    {
      "indent": 3,
      "text": "Given a Matrix of loss singletons as illustrated above, determine the Type-P-One-way-Packet-Loss-Average for the sample at each receiver, according to the definitions and method of [RFC2680]. The Type-P-One-way-Packet-Loss-Average and the Type-P-One-to-group-Receiver-n-Loss-Ratio, also named RnLR, are equivalent metrics. In terms of the parameters used here, these metrics definitions can be expressed as",
      "zh-CHS": "给出如上所示的损失单例矩阵，根据[RFC2680]的定义和方法，确定每个接收器处样本的类型-P-单向-Packet-loss-Average。P-One-way-Packet-Loss-Average类型和P-One-to-group-Receiver-n-Loss-Ratio类型（也称为RnLR）是等效的度量。根据这里使用的参数，这些度量定义可以表示为"
    },
    {
      "indent": 29,
      "text": "              K\n             ---\n        1    \\\nRnLR =  - *   >   RnLk\n        K    /\n             ---\n            k = 1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Figure 9: Type-P-One-to-group-Receiver-n-Loss-Ratio",
      "zh-CHS": "图9:P型一对群接收机n损耗比"
    },
    {
      "indent": 0,
      "text": "8.4.2. Type-P-One-to-group-Receiver-n-Comp-Loss-Ratio",
      "section_title": true,
      "zh-CHS": "8.4.2. P型一对群接收机n补偿损耗比"
    },
    {
      "indent": 3,
      "text": "Usually, the number of packets sent is used in the denominator of packet loss ratio metrics. For the comparative metrics defined here, the denominator is the maximum number of packets received at any receiver for the sample and test interval of interest. The numerator is the sum of the losses at receiver n.",
      "zh-CHS": "通常，发送的数据包数量用于数据包丢失率度量的分母。对于此处定义的比较度量，分母是任何接收器接收的感兴趣的样本和测试间隔的最大数据包数。分子是接收器n处损失的总和。"
    },
    {
      "indent": 3,
      "text": "The Comparative Loss Ratio, also named, RnCLR, is defined as",
      "zh-CHS": "比较损失率（也称为RnCLR）的定义如下："
    },
    {
      "indent": 12,
      "text": "                      K\n                     ---\n                     \\\n                      >   Ln(k)\n                     /\n                     ---\n                     k=1\nRnCLR =  -----------------------------\n                  /    K         \\\n                  |   ---        |\n                  |   \\          |\n          K - Min |    >   Ln(k) |\n                  |   /          |\n                  |   ---        |\n                  \\   k=1        / N",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 12,
      "text": "Note: Ln is a set of one-way loss values at receiver n. There is one value for each of the K packets sent.",
      "zh-CHS": "注：Ln是接收器n处的一组单向损耗值。发送的K个数据包中的每一个都有一个值。"
    },
    {
      "indent": 9,
      "text": "Figure 10: Type-P-One-to-group-Receiver-n-Comp-Loss-Ratio",
      "zh-CHS": "图10:P型一对群接收机n补偿损耗比"
    },
    {
      "indent": 0,
      "text": "8.4.3. Type-P-One-to-group-Loss-Ratio",
      "section_title": true,
      "zh-CHS": "8.4.3. P型一组损耗比"
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-Loss-Ratio, the overall Group Loss Ratio, also named GLR, is defined as:",
      "zh-CHS": "P型一对一损失率，整体集团损失率，也称为GLR，定义为："
    },
    {
      "indent": 28,
      "text": "             K,N\n             ---\n       1     \\\nGLR = --- *   >   Ln(k)\n      K*N    /\n             ---\n            k,n = 1",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 17,
      "text": "Figure 11: Type-P-One-to-group-Loss-Ratio",
      "zh-CHS": "图11:P型一对一损失率"
    },
    {
      "indent": 3,
      "text": "Where the sum includes all of the Loss singletons, Ln(k), over the N receivers and K packets sent, in a ratio with the total packets over all receivers.",
      "zh-CHS": "其中，总和包括N个接收机上的所有丢失单例Ln（k）和发送的k个分组，与所有接收机上的总分组成比例。"
    },
    {
      "indent": 0,
      "text": "8.4.4. Type-P-One-to-group-Range-Loss-Ratio",
      "section_title": true,
      "zh-CHS": "8.4.4. P型一对群测距损耗比"
    },
    {
      "indent": 3,
      "text": "The One-to-group Loss Ratio Range is defined as:",
      "zh-CHS": "一对一损失率范围定义为："
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-Range-Loss-Ratio = max(RnLR) - min(RnLR)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "It is most effective to indicate the range by giving both the maximum and minimum loss ratios for the Group, rather than only reporting the difference between them.",
      "zh-CHS": "最有效的方法是通过给出集团的最大和最小损失率来指示范围，而不是只报告两者之间的差异。"
    },
    {
      "indent": 0,
      "text": "8.5. One-to-group Delay Variation Statistics",
      "section_title": true,
      "zh-CHS": "8.5. 一对群时延变化统计"
    },
    {
      "indent": 3,
      "text": "This section defines one-way delay variation (DV) statistics for an entire group as illustrated by the matrix below.",
      "zh-CHS": "本节定义了整个组的单向延迟变化（DV）统计信息，如下表所示。"
    },
    {
      "indent": 4,
      "text": "Recv    /------------- Sample --------------\\   Stats",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 5,
      "text": "1 R1ddT1 R1ddT2 R1ddT3 ... R1ddTk R1DV \\ | 2 R2ddT1 R2ddT2 R2ddT3 ... R2ddTk R2DV | | 3 R3ddT1 R3ddT2 R3ddT3 ... R3ddTk R3DV > Group Stat . | . | . | n RnddT1 RnddT2 RnddT3 ... RnddTk RnDV /",
      "zh-CHS": "1 R1ddT1 R1ddT2 R1ddT3。。。R1ddTk R1DV\\| 2 R2ddT1 R2ddT2 R2ddT3。。。R2ddTk R2DV | | 3 R3ddT1 R3ddT2 R3ddT3。。。R3ddTk R3DV>组统计n RnddT1 RnddT2 RnddT3。。。RnddTk RnDV/"
    },
    {
      "indent": 11,
      "text": "Figure 12: One-to-group Delay Variation Matrix (DVMa)",
      "zh-CHS": "图12：一对群延迟变化矩阵（DVMa）"
    },
    {
      "indent": 3,
      "text": "Statistics are computed on the sample of Type-P-One-way-ipdv singletons of the group delay variation matrix above where RnddTk is the Type-P-One-way-ipdv singleton evaluated at Receiver n for the packet k and where RnDV is the point-to-point one-way packet delay variation for Receiver n.",
      "zh-CHS": "在上面的群延迟变化矩阵的P-One-way-ipdv类型单例样本上计算统计信息，其中RnddTk是在接收器n处针对数据包k评估的P-One-way-ipdv类型单例，其中RnDV是接收器n的点对点单向数据包延迟变化。"
    },
    {
      "indent": 3,
      "text": "All One-to-group delay variation statistics are expressed in seconds with sufficient resolution to convey three significant digits.",
      "zh-CHS": "所有一对群延迟变化统计数据均以秒为单位表示，分辨率足以传输三个有效数字。"
    },
    {
      "indent": 0,
      "text": "8.5.1. Type-P-One-to-group-Range-Delay-Variation",
      "section_title": true,
      "zh-CHS": "8.5.1. P型一对群范围延迟变化"
    },
    {
      "indent": 3,
      "text": "This section defines a metric for the Range of Delay Variation over all N receivers in the Group.",
      "zh-CHS": "本节定义了组中所有N个接收机的延迟变化范围的度量。"
    },
    {
      "indent": 3,
      "text": "Maximum DV and minimum DV over all receivers summarize the performance over the Group (where DV is a point-to-point metric). For each receiver, the DV is usually expressed as the 1-10^(-3) quantile of one-way delay minus the minimum one-way delay.",
      "zh-CHS": "所有接收机上的最大DV和最小DV总结了整个组的性能（其中DV是点对点度量）。对于每个接收机，DV通常表示为单向延迟的1-10^（-3）分位数减去最小单向延迟。"
    },
    {
      "indent": 3,
      "text": "Type-P-One-to-group-Range-Delay-Variation = GRDV =",
      "zh-CHS": "P型一对群范围延迟变化=GRDV="
    },
    {
      "indent": 3,
      "text": "= max(RnDV) - min(RnDV) for all n receivers",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "This range is determined from the minimum and maximum values of the point-to-point one-way IP Packet Delay Variation for the set of Destinations in the group and a population of interest, using the Packet Delay Variation expressed as the 1-10^-3 quantile of one-way delay minus the minimum one-way delay. If a more demanding service is considered, one alternative is to use the 1-10^-5 quantile, and in either case, the quantile used should be recorded with the results. Both the minimum and the maximum delay variation are recorded, and both values are given to indicate the location of the range.",
      "zh-CHS": "使用表示为单向延迟的1-10^-3分位数减去最小单向延迟的分组延迟变化，根据组中的目的地集合和感兴趣的总体的点对点单向IP分组延迟变化的最小值和最大值来确定该范围。如果考虑要求更高的服务，一种替代方法是使用1-10^-5分位数，在任何一种情况下，使用的分位数都应与结果一起记录。记录最小和最大延迟变化，并给出两个值以指示范围的位置。"
    },
    {
      "indent": 0,
      "text": "9. Measurement Methods: Scalability and Reporting",
      "section_title": true,
      "zh-CHS": "9. 测量方法：可伸缩性和报告"
    },
    {
      "indent": 3,
      "text": "Virtually all the guidance on measurement processes supplied by the earlier IPPM RFCs (such as [RFC2679] and [RFC2680]) for one-to-one scenarios is applicable here in the spatial and multiparty measurement scenario. The main difference is that the spatial and multiparty configurations require multiple points of interest where a stream of singletons will be collected. The amount of information requiring storage grows with both the number of metrics and the points of interest, so the scale of the measurement architecture multiplies the number of singleton results that must be collected and processed.",
      "zh-CHS": "实际上，早期IPPM RFC（如[RFC2679]和[RFC2680]）为一对一方案提供的所有测量过程指南均适用于空间和多方测量方案。主要区别在于，空间配置和多方配置需要多个关注点，在这些关注点中，将收集一个单件流。需要存储的信息量随着度量和关注点的数量而增长，因此度量体系结构的规模乘以必须收集和处理的单个结果的数量。"
    },
    {
      "indent": 3,
      "text": "It is possible that the architecture for results collection involves a single reference point with connectivity to all the points of interest. In this case, the number of points of interest determines both storage capacity and packet transfer capacity of the host acting as the reference point. However, both the storage and transfer capacity can be reduced if the points of interest are capable of computing the summary statistics that describe each measurement interval. This is consistent with many operational monitoring architectures today, where even the individual singletons may not be stored at each point of interest.",
      "zh-CHS": "结果收集的体系结构可能涉及一个单一的参考点，该点与所有感兴趣的点相连。在这种情况下，关注点的数量决定了作为参考点的主机的存储容量和分组传输容量。然而，如果关注点能够计算描述每个测量间隔的汇总统计信息，则存储和传输容量都可以降低。这与当今的许多操作监控体系结构是一致的，在这些体系结构中，即使是单个的单例也可能不会存储在每个感兴趣的点上。"
    },
    {
      "indent": 3,
      "text": "In recognition of the likely need to minimize the form of the results for storage and communication, the Group metrics above have been constructed to allow some computations on a per-Receiver basis. This",
      "zh-CHS": "认识到可能需要最小化存储和通信结果的形式，已构建上述组度量，以允许在每个接收器的基础上进行一些计算。这"
    },
    {
      "indent": 3,
      "text": "means that each Receiver's statistics would normally have an equal weight with all other Receivers in the Group (regardless of the number of packets received).",
      "zh-CHS": "意味着每个接收器的统计数据通常与组中的所有其他接收器具有相同的权重（无论接收的数据包数量如何）。"
    },
    {
      "indent": 0,
      "text": "9.1. Computation Methods",
      "section_title": true,
      "zh-CHS": "9.1. 计算方法"
    },
    {
      "indent": 3,
      "text": "The scalability issue can be raised when there are thousands of points of interest in a group who are trying to send back the measurement results to the reference point for further processing and analysis. The points of interest can send either the whole measured sample or only the calculated statistics. The former is a centralized statistic calculation method and the latter is a distributed statistic calculation method. The sample should include all metrics parameters, the values, and the corresponding sequence numbers. The transmission of the whole sample can cost much more bandwidth than the transmission of the statistics that should include all statistic parameters specified by policies and the additional information about the whole sample, such as the size of the sample, the group address, the address of the point of interest, the ID of the sample session, and so on. Apparently, the centralized calculation method can require much more bandwidth than the distributed calculation method when the sample size is big. This is especially true when the measurement has a very large number of the points of interest. It can lead to a scalability issue at the reference point by overloading the network resources.",
      "zh-CHS": "当一个组中有数千个关注点试图将测量结果发送回参考点进行进一步处理和分析时，可能会出现可伸缩性问题。兴趣点可以发送整个测量样本，也可以只发送计算的统计数据。前者是集中式统计计算方法，后者是分布式统计计算方法。样本应包括所有度量参数、值和相应的序列号。整个样本的传输可能比统计数据的传输花费更多的带宽，统计数据应包括策略指定的所有统计参数以及关于整个样本的附加信息，如样本大小、组地址、关注点地址、样本会话ID、，等等显然，当样本量较大时，集中式计算方法比分布式计算方法需要更多的带宽。当测量有大量感兴趣的点时，这一点尤其正确。它会导致网络资源过载，从而导致参考点的可伸缩性问题。"
    },
    {
      "indent": 3,
      "text": "The distributed calculation method can save much more bandwidth and mitigate issues arising from scalability at the reference point side.",
      "zh-CHS": "分布式计算方法可以节省更多的带宽，并缓解因参考点端的可伸缩性而产生的问题。"
    },
    {
      "indent": 3,
      "text": "However, it may result in a loss of information. As not all measured singletons are available for building up the group matrix, the real performance over time can be hidden from the result. For example, the loss pattern can be missed by simply accepting the loss ratio. This tradeoff between bandwidth consumption and information acquisition has to be taken into account when designing the measurement approach.",
      "zh-CHS": "但是，这可能会导致信息丢失。由于并非所有测量的单例都可用于构建组矩阵，因此随着时间的推移，实际性能可能会从结果中隐藏。例如，仅通过接受损失率就可以忽略损失模式。在设计测量方法时，必须考虑带宽消耗和信息获取之间的权衡。"
    },
    {
      "indent": 3,
      "text": "One possible solution could be to transmit the statistic parameters to the reference point first to obtain the general information of the group performance. If detailed results are required, the reference point should send the requests to the points of interest, which could be particular ones or the whole group. This procedure can happen in the off peak time and can be well scheduled to avoid delivery of too many points of interest at the same time. Compression techniques can also be used to minimize the bandwidth required by the transmission. This could be a measurement protocol to report the measurement results. However, this is out of the scope of this memo.",
      "zh-CHS": "一种可能的解决方案是首先将统计参数传输到参考点，以获得组性能的一般信息。如果需要详细的结果，参考点应将请求发送给感兴趣的点，这些点可以是特定的点或整个组。此过程可能发生在非高峰时间，并且可以很好地安排，以避免同时交付过多的关注点。压缩技术也可用于最小化传输所需的带宽。这可以是报告测量结果的测量协议。但是，这超出了本备忘录的范围。"
    },
    {
      "indent": 0,
      "text": "9.2. Measurement",
      "section_title": true,
      "zh-CHS": "9.2. 测量"
    },
    {
      "indent": 3,
      "text": "To prevent any bias in the result, the configuration of a one-to-many measure must take into consideration that more packets will be routed than sent (copies of a packet sent are expected to arrive at many destination points) and select a test packet rate that will not impact the network performance.",
      "zh-CHS": "为了防止结果中出现任何偏差，一对多措施的配置必须考虑到路由的数据包将多于发送的数据包（发送的数据包的副本预计将到达多个目的地），并选择不会影响网络性能的测试数据包速率。"
    },
    {
      "indent": 0,
      "text": "9.3. Effect of Time and Space Aggregation Order on Stats",
      "section_title": true,
      "zh-CHS": "9.3. 时间和空间聚集顺序对统计数据的影响"
    },
    {
      "indent": 3,
      "text": "This section presents the impact of the aggregation order on the scalability of the reporting and of the computation. It makes the hypothesis that receivers are not co-located and that results are gathered in a point of reference for further usages.",
      "zh-CHS": "本节介绍聚合顺序对报告和计算的可伸缩性的影响。它假设接收者不在同一地点，并将结果收集到一个参考点以供进一步使用。"
    },
    {
      "indent": 3,
      "text": "Multimetric samples are represented in a matrix as illustrated below",
      "zh-CHS": "多尺度样本在矩阵中表示，如下所示"
    },
    {
      "indent": 6,
      "text": "Point of Interest 1 R1S1 R1S1 R1S1 ... R1Sk \\ | 2 R2S1 R2S2 R2S3 ... R2Sk | | 3 R3S1 R3S2 R3S3 ... R3Sk > Sample over Space . | . | . | n RnS1 RnS2 RnS3 ... RnSk /",
      "zh-CHS": "兴趣点1 R1S1 R1S1 R1S1。。。R1Sk\\| 2 R2S1 R2S2 R2S3。。。R2Sk | | 3 R3S1 R3S2 R3S3。。。R3Sk>空间上的样本。|。|。|n RnS1 RnS2 RnS3。。。RnSk/"
    },
    {
      "indent": 15,
      "text": "S1M S2M S3M ... SnM Stats over Space",
      "zh-CHS": "S1M S2M S3M。。。空间上的SnM统计"
    },
    {
      "indent": 15,
      "text": "\\-------------  ------------/\n              \\/\n  Stats over Space and Time",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 7,
      "text": "Figure 13: Impact of Space Aggregation on Multimetrics Stats",
      "zh-CHS": "图13：空间聚合对Multimetrics统计数据的影响"
    },
    {
      "indent": 3,
      "text": "Two methods are available to compute statistics on a matrix:",
      "zh-CHS": "有两种方法可用于计算矩阵上的统计信息："
    },
    {
      "indent": 3,
      "text": "o Method 1: The statistic metric is computed over time and then over space; or",
      "zh-CHS": "o 方法1：先在时间上，然后在空间上计算统计度量；或"
    },
    {
      "indent": 3,
      "text": "o Method 2: The statistic metric is computed over space and then over time.",
      "zh-CHS": "o 方法2：在空间上计算统计度量，然后在时间上计算。"
    },
    {
      "indent": 3,
      "text": "These two methods differ only by the order of the aggregation. The order does not impact the computation resources required. It does not change the value of the result. However, it impacts severely the minimal volume of data to report:",
      "zh-CHS": "这两种方法仅在聚合顺序上有所不同。该顺序不影响所需的计算资源。它不会更改结果的值。但是，它严重影响了要报告的最小数据量："
    },
    {
      "indent": 3,
      "text": "o Method 1: Each point of interest periodically computes statistics over time to lower the volume of data to report. They are reported to the reference point for subsequent computations over the spatial dimension. This volume no longer depends on the number of samples. It is only proportional to the computation period.",
      "zh-CHS": "o 方法1：每个关注点定期计算统计数据，以减少要报告的数据量。它们将报告给参考点，以便在空间维度上进行后续计算。该体积不再取决于样本数量。它只与计算周期成正比。"
    },
    {
      "indent": 3,
      "text": "o Method 2: The volume of data to report is proportional to the number of samples. Each sample, RiSi, must be reported to the reference point for computing statistic over space and statistic over time. The volume increases with the number of samples. It is proportional to the number of test packets;",
      "zh-CHS": "o 方法2：报告的数据量与样本数量成正比。每个样本RiSi必须报告给参考点，以计算空间统计和时间统计。体积随着样本数量的增加而增加。它与测试数据包的数量成正比；"
    },
    {
      "indent": 3,
      "text": "Method 2 has severe drawbacks in terms of security and dimensioning:",
      "zh-CHS": "方法2在安全性和尺寸方面存在严重缺陷："
    },
    {
      "indent": 3,
      "text": "o Increasing the rate of the test packets may result in a Denial of Service (DoS) toward the points of reference;",
      "zh-CHS": "o 增加测试数据包的速率可能导致朝向参考点的拒绝服务（DoS）；"
    },
    {
      "indent": 3,
      "text": "o The dimensioning of a measurement system is quite impossible to validate because any increase of the rate of the test packets will increase the bandwidth requested to collect the raw results.",
      "zh-CHS": "o 测量系统的尺寸确定很难验证，因为测试数据包速率的任何增加都会增加收集原始结果所需的带宽。"
    },
    {
      "indent": 3,
      "text": "The computation period over time period (commonly named the aggregation period) provides the reporting side with a control of various collecting aspects such as bandwidth, computation, and storage capacities. So this document defines metrics based on method 1.",
      "zh-CHS": "一段时间内的计算周期（通常称为聚合周期）为报告方提供了对各种收集方面的控制，如带宽、计算和存储容量。因此，本文档定义了基于方法1的度量。"
    },
    {
      "indent": 0,
      "text": "9.3.1. Impact on Spatial Statistics",
      "section_title": true,
      "zh-CHS": "9.3.1. 对空间统计的影响"
    },
    {
      "indent": 3,
      "text": "Two methods are available to compute spatial statistics:",
      "zh-CHS": "有两种方法可用于计算空间统计信息："
    },
    {
      "indent": 3,
      "text": "o Method 1: Spatial segment metrics and statistics are preferably computed over time for each points of interest;",
      "zh-CHS": "o 方法1：优选随时间为每个关注点计算空间段度量和统计；"
    },
    {
      "indent": 3,
      "text": "o Method 2: Vectors metrics are intrinsically instantaneous space metrics, which must be reported using Method 2 whenever instantaneous metrics information is needed.",
      "zh-CHS": "o 方法2：向量度量本质上是瞬时空间度量，每当需要瞬时度量信息时，必须使用方法2报告。"
    },
    {
      "indent": 0,
      "text": "9.3.2. Impact on One-to-Group Statistics",
      "section_title": true,
      "zh-CHS": "9.3.2. 对一对一统计数据的影响"
    },
    {
      "indent": 3,
      "text": "Two methods are available to compute group statistics:",
      "zh-CHS": "有两种方法可用于计算组统计信息："
    },
    {
      "indent": 3,
      "text": "o Method 1: Figure 5 and Figure 8 illustrate the method. The one-to-one statistic is computed per interval of time before the computation of the mean over the group of receivers.",
      "zh-CHS": "o 方法1：图5和图8说明了该方法。在计算接收器组的平均值之前，按时间间隔计算一对一统计。"
    },
    {
      "indent": 3,
      "text": "o Method 2: Figure 13 presents the second method. The metric is computed over space and then over time.",
      "zh-CHS": "o 方法2：图13显示了第二种方法。度量在空间上计算，然后在时间上计算。"
    },
    {
      "indent": 0,
      "text": "10. Manageability Considerations",
      "section_title": true,
      "zh-CHS": "10. 可管理性考虑"
    },
    {
      "indent": 3,
      "text": "This section defines the reporting of all the metrics introduced in the document.",
      "zh-CHS": "本节定义了文档中介绍的所有指标的报告。"
    },
    {
      "indent": 3,
      "text": "Information models of spatial metrics and of one-to-group metrics are similar except that points of interests of spatial vectors MUST be ordered.",
      "zh-CHS": "空间度量和一对一度量的信息模型相似，只是空间向量的兴趣点必须排序。"
    },
    {
      "indent": 3,
      "text": "The complexity of the reporting relies on the number of points of interest.",
      "zh-CHS": "报告的复杂性取决于关注点的数量。"
    },
    {
      "indent": 0,
      "text": "10.1. Reporting Spatial Metric",
      "section_title": true,
      "zh-CHS": "10.1. 报告空间度量"
    },
    {
      "indent": 3,
      "text": "The reporting of spatial metrics shares a lot of aspects with RFC 2679 and RFC 2680. New ones are common to all the definitions and are mostly related to the reporting of the path and of methodology parameters that may bias raw results analysis. This section presents these specific parameters and then lists exhaustively the parameters that SHOULD be reported.",
      "zh-CHS": "空间度量的报告与RFC 2679和RFC 2680有许多共同之处。新的定义在所有定义中都是通用的，并且主要与路径和方法参数的报告有关，这些参数可能会使原始结果分析产生偏差。本节介绍这些特定参数，然后详细列出应报告的参数。"
    },
    {
      "indent": 0,
      "text": "10.1.1. Path",
      "section_title": true,
      "zh-CHS": "10.1.1. 路径"
    },
    {
      "indent": 3,
      "text": "End-to-end metrics can't determine the path of the measure despite the fact that IPPM RFCs recommend it be reported (see section 3.8.4 of [RFC2679]). Spatial metrics vectors provide this path. The report of a spatial vector MUST include the points of interests involved: the sub-set of the routers of the path participating to the instantaneous measure.",
      "zh-CHS": "尽管IPPM RFC建议报告，但端到端度量无法确定度量路径（见[RFC2679]第3.8.4节）。空间度量向量提供了这条路径。空间向量的报告必须包括所涉及的兴趣点：参与瞬时测量的路径路由器的子集。"
    },
    {
      "indent": 0,
      "text": "10.1.2. Host Order",
      "section_title": true,
      "zh-CHS": "10.1.2. 主订单"
    },
    {
      "indent": 3,
      "text": "A spatial vector MUST order the points of interest according to their order in the path. The ordering MAY be based on information from the TTL in IPv4, the Hop Limit in IPv6, or the corresponding information in MPLS.",
      "zh-CHS": "空间向量必须根据其在路径中的顺序对感兴趣的点进行排序。排序可以基于来自IPv4中TTL的信息、IPv6中的跃点限制或MPLS中的相应信息。"
    },
    {
      "indent": 3,
      "text": "The report of a spatial vector MUST include the ordered list of the hosts involved in the instantaneous measure.",
      "zh-CHS": "空间向量的报告必须包括瞬时测量所涉及的主机的有序列表。"
    },
    {
      "indent": 0,
      "text": "10.1.3. Timestamping Bias",
      "section_title": true,
      "zh-CHS": "10.1.3. 时间戳偏差"
    },
    {
      "indent": 3,
      "text": "The location of the point of interest inside a node influences the timestamping skew and accuracy. As an example, consider that some internal machinery delays the timestamping up to three milliseconds; then the minimal uncertainty reported be 3 ms if the internal delay is unknown at the time of the timestamping.",
      "zh-CHS": "兴趣点在节点内的位置会影响时间戳倾斜和准确性。作为一个例子，考虑到一些内部机械延迟时间戳高达三毫秒；如果时间戳时内部延迟未知，则报告的最小不确定度为3 ms。"
    },
    {
      "indent": 3,
      "text": "The report of a spatial vector MUST include the uncertainty of the timestamping compared to wire-time.",
      "zh-CHS": "空间向量的报告必须包括时间戳相对于导线时间的不确定性。"
    },
    {
      "indent": 0,
      "text": "10.1.4. Reporting Spatial One-Way Delay",
      "section_title": true,
      "zh-CHS": "10.1.4. 报告空间单向延迟"
    },
    {
      "indent": 3,
      "text": "The reporting includes information to report for one-way delay as section 3.6 of [RFC2679]. The same applies for packet loss and ipdv.",
      "zh-CHS": "报告包括需报告单向延迟的信息，如[RFC2679]第3.6节所述。这同样适用于数据包丢失和ipdv。"
    },
    {
      "indent": 0,
      "text": "10.2. Reporting One-to-Group Metric",
      "section_title": true,
      "zh-CHS": "10.2. 向集团报告一个指标"
    },
    {
      "indent": 3,
      "text": "All reporting rules described in [RFC2679] and [RFC2680] apply to the corresponding One-to-group metrics. The following are specific parameters that SHOULD be reported.",
      "zh-CHS": "[RFC2679]和[RFC2680]中描述的所有报告规则适用于相应的一对一集团指标。以下是应报告的具体参数。"
    },
    {
      "indent": 0,
      "text": "10.2.1. Path",
      "section_title": true,
      "zh-CHS": "10.2.1. 路径"
    },
    {
      "indent": 3,
      "text": "As suggested by [RFC2679] and [RFC2680], the path traversed by the packet SHOULD be reported, if possible. For One-to-group metrics, the path tree between the source and the destinations or the set of paths between the source and each destination SHOULD be reported.",
      "zh-CHS": "正如[RFC2679]和[RFC2680]所建议的，如果可能，应该报告数据包经过的路径。对于一到一组度量，应报告源和目标之间的路径树或源和每个目标之间的路径集。"
    },
    {
      "indent": 3,
      "text": "The path tree might not be as valuable as individual paths because an incomplete path might be difficult to identify in the path tree. For example, how many points of interest are reached by a packet traveling along an incomplete path?",
      "zh-CHS": "路径树可能不如单个路径有价值，因为在路径树中可能很难识别不完整的路径。例如，一个数据包沿着一条不完整的路径旅行，可以到达多少个兴趣点？"
    },
    {
      "indent": 0,
      "text": "10.2.2. Group Size",
      "section_title": true,
      "zh-CHS": "10.2.2. 组大小"
    },
    {
      "indent": 3,
      "text": "The group size SHOULD be reported as one of the critical management parameters. One-to-group metrics, unlike spatial metrics, don't require the ordering of the points of interests because group members receive the packets in parallel.",
      "zh-CHS": "集团规模应作为关键管理参数之一进行报告。与空间度量不同，单到组度量不需要对兴趣点进行排序，因为组成员并行接收数据包。"
    },
    {
      "indent": 0,
      "text": "10.2.3. Timestamping Bias",
      "section_title": true,
      "zh-CHS": "10.2.3. 时间戳偏差"
    },
    {
      "indent": 3,
      "text": "It is the same as described in section 10.1.3.",
      "zh-CHS": "与第10.1.3节所述相同。"
    },
    {
      "indent": 0,
      "text": "10.2.4. Reporting One-to-group One-way Delay",
      "section_title": true,
      "zh-CHS": "10.2.4. 报告一对一组单向延迟"
    },
    {
      "indent": 3,
      "text": "It is the same as described in section 10.1.4.",
      "zh-CHS": "与第10.1.4节所述相同。"
    },
    {
      "indent": 0,
      "text": "10.2.5. Measurement Method",
      "section_title": true,
      "zh-CHS": "10.2.5. 测量方法"
    },
    {
      "indent": 3,
      "text": "As explained in section 9, the measurement method will have impact on the analysis of the measurement result. Therefore, it SHOULD be reported.",
      "zh-CHS": "如第9节所述，测量方法将对测量结果的分析产生影响。因此，应予以报告。"
    },
    {
      "indent": 0,
      "text": "10.3. Metric Identification",
      "section_title": true,
      "zh-CHS": "10.3. 度量识别"
    },
    {
      "indent": 3,
      "text": "IANA assigns each metric defined by the IPPM WG a unique identifier as per [RFC4148] in the IANA-IPPM-METRICS-REGISTRY-MIB.",
      "zh-CHS": "IANA根据IANA-IPPM-METRICS-REGISTRY-MIB中的[RFC4148]为IPPM工作组定义的每个度量分配一个唯一标识符。"
    },
    {
      "indent": 0,
      "text": "10.4. Information Model",
      "section_title": true,
      "zh-CHS": "10.4. 信息模型"
    },
    {
      "indent": 3,
      "text": "This section presents the elements of information and the usage of the information reported for network performance analysis. It is out of the scope of this section to define how the information is reported.",
      "zh-CHS": "本节介绍用于网络性能分析的信息要素和报告信息的使用情况。定义如何报告信息超出了本节的范围。"
    },
    {
      "indent": 3,
      "text": "The information model is built with pieces of information introduced and explained in the sections of [RFC2679] , [RFC2680] , [RFC3393], and [RFC3432] that define the IPPM metrics and from any of the sections named \"Reporting the metric\" , \"Methodology\", and \"Errors and Uncertainties\" whenever they exist in these documents.",
      "zh-CHS": "信息模型由[RFC2679]、[RFC2680]、[RFC3393]和[RFC3432]中定义IPPM度量的章节以及这些文档中任何名为“报告度量”、“方法论”和“错误和不确定性”的章节中介绍和解释的信息组成。"
    },
    {
      "indent": 3,
      "text": "The following are the elements of information taken from end-to-end metrics definitions referred to in this memo and from spatial and multicast metrics it defines:",
      "zh-CHS": "以下是从本备忘录中提及的端到端指标定义及其定义的空间和多播指标中获取的信息元素："
    },
    {
      "indent": 3,
      "text": "o Packet_type, the Type-P of test packets (Type-P).",
      "zh-CHS": "o 数据包类型，测试数据包的类型P（类型P）。"
    },
    {
      "indent": 3,
      "text": "o Packet_length, a packet length in bits (L).",
      "zh-CHS": "o 数据包长度，以位（L）为单位的数据包长度。"
    },
    {
      "indent": 3,
      "text": "o Src_host, the IP address of the sender.",
      "zh-CHS": "o Src_host，发送方的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Dst_host, the IP address of the receiver.",
      "zh-CHS": "o Dst_主机，接收器的IP地址。"
    },
    {
      "indent": 3,
      "text": "o Hosts_series: <H1, H2,..., Hn>, a list of points of interest participating in the instantaneous measure. They are routers in the case of spatial metrics or receivers in the case of one-to-group metrics.",
      "zh-CHS": "o Hosts_系列：<H1，H2，…，Hn>，参与瞬时测量的兴趣点列表。对于空间度量，它们是路由器；对于一对一度量，它们是接收器。"
    },
    {
      "indent": 3,
      "text": "o Loss_threshold, the threshold of infinite delay.",
      "zh-CHS": "o 损失阈值，无限延迟的阈值。"
    },
    {
      "indent": 3,
      "text": "o Systematic_error, constant delay between wire-time and timestamping.",
      "zh-CHS": "o 系统错误，导线时间和时间戳之间的恒定延迟。"
    },
    {
      "indent": 3,
      "text": "o Calibration_error, maximal uncertainty.",
      "zh-CHS": "o 校准误差，最大不确定度。"
    },
    {
      "indent": 3,
      "text": "o Src_time, the sending time for a measured packet.",
      "zh-CHS": "o Src_time，测量数据包的发送时间。"
    },
    {
      "indent": 3,
      "text": "o Dst_time, the receiving time for a measured packet.",
      "zh-CHS": "o Dst_time，测量数据包的接收时间。"
    },
    {
      "indent": 3,
      "text": "o Result_status, an indicator of usability of a result 'Resource exhaustion' 'infinite', 'lost'.",
      "zh-CHS": "o 结果_状态，表示结果“资源耗尽”、“无限”、“丢失”的可用性。"
    },
    {
      "indent": 3,
      "text": "o Delays_series, <dT1,..., dTn>, a list of delays.",
      "zh-CHS": "o 延迟\\u系列，<dT1，…，dTn>，延迟列表。"
    },
    {
      "indent": 3,
      "text": "o Losses_series, <B1, B2, ..., Bi, ..., Bn>, a list of Boolean values (spatial) or a set of Boolean values (one-to-group).",
      "zh-CHS": "o loss_系列，<B1，B2，…，Bi，…，Bn>，布尔值列表（空间）或一组布尔值（一对一）。"
    },
    {
      "indent": 3,
      "text": "o Result_status_series, a list of results status.",
      "zh-CHS": "o 结果\\状态\\系列，结果状态列表。"
    },
    {
      "indent": 3,
      "text": "o dT, a delay.",
      "zh-CHS": "o dT，延迟。"
    },
    {
      "indent": 3,
      "text": "o Singleton_number, a number of singletons.",
      "zh-CHS": "o 单例数，单例数。"
    },
    {
      "indent": 3,
      "text": "o Observation_duration, an observation duration.",
      "zh-CHS": "o 观察持续时间，观察持续时间。"
    },
    {
      "indent": 3,
      "text": "o metric_identifier.",
      "zh-CHS": "o 度量单位标识符。"
    },
    {
      "indent": 3,
      "text": "The following is the information of each vector that SHOULD be available to compute samples:",
      "zh-CHS": "以下是应可用于计算样本的每个向量的信息："
    },
    {
      "indent": 3,
      "text": "o Packet_type;",
      "zh-CHS": "o 包类型；"
    },
    {
      "indent": 3,
      "text": "o Packet_length;",
      "zh-CHS": "o 数据包长度；"
    },
    {
      "indent": 3,
      "text": "o Src_host, the sender of the packet;",
      "zh-CHS": "o Src_主机，数据包的发送方；"
    },
    {
      "indent": 3,
      "text": "o Dst_host, the receiver of the packet, apply only for spatial vectors;",
      "zh-CHS": "o 数据包的接收器Dst_主机仅适用于空间向量；"
    },
    {
      "indent": 3,
      "text": "o Hosts_series, not ordered for one-to-group;",
      "zh-CHS": "o 主机_系列，不为一组订购；"
    },
    {
      "indent": 3,
      "text": "o Src_time, the sending time for the measured packet;",
      "zh-CHS": "o Src_time，测量数据包的发送时间；"
    },
    {
      "indent": 3,
      "text": "o dT, the end-to-end one-way delay for the measured packet, apply only for spatial vectors;",
      "zh-CHS": "o dT，被测分组的端到端单向延迟，仅适用于空间向量；"
    },
    {
      "indent": 3,
      "text": "o Delays_series, apply only for delays and ipdv vector, not ordered for one-to-group;",
      "zh-CHS": "o 延迟_系列，仅适用于延迟和ipdv向量，不适用于一对一组；"
    },
    {
      "indent": 3,
      "text": "o Losses_series, apply only for packets loss vector, not ordered for one-to-group;",
      "zh-CHS": "o loss_系列，仅适用于丢包向量，不适用于一对一分组；"
    },
    {
      "indent": 3,
      "text": "o Result_status_series;",
      "zh-CHS": "o 结果\\状态\\序列；"
    },
    {
      "indent": 3,
      "text": "o Observation_duration, the difference between the time of the last singleton and the time of the first singleton.",
      "zh-CHS": "o 观察持续时间，最后一个单体时间和第一个单体时间之间的差异。"
    },
    {
      "indent": 3,
      "text": "Following is the context information (measure, points of interests) that SHOULD be available to compute samples:",
      "zh-CHS": "以下是可用于计算样本的上下文信息（度量、兴趣点）："
    },
    {
      "indent": 3,
      "text": "o Loss threshold;",
      "zh-CHS": "o 损失阈值；"
    },
    {
      "indent": 3,
      "text": "o Systematic error, constant delay between wire-time and timestamping;",
      "zh-CHS": "o 系统误差，导线时间和时间戳之间的恒定延迟；"
    },
    {
      "indent": 3,
      "text": "o Calibration error, maximal uncertainty.",
      "zh-CHS": "o 校准误差，最大不确定度。"
    },
    {
      "indent": 3,
      "text": "A spatial or a one-to-group sample is a collection of singletons giving the performance from the sender to a single point of interest.",
      "zh-CHS": "空间或一对一组样本是从发送者到单个兴趣点给出性能的单例集合。"
    },
    {
      "indent": 3,
      "text": "The following is the information that SHOULD be available for each sample to compute statistics:",
      "zh-CHS": "以下是用于计算统计数据的每个样本的可用信息："
    },
    {
      "indent": 3,
      "text": "o Packet_type;",
      "zh-CHS": "o 包类型；"
    },
    {
      "indent": 3,
      "text": "o Packet_length;",
      "zh-CHS": "o 数据包长度；"
    },
    {
      "indent": 3,
      "text": "o Src_host, the sender of the packet;",
      "zh-CHS": "o Src_主机，数据包的发送方；"
    },
    {
      "indent": 3,
      "text": "o Dst_host, the receiver of the packet;",
      "zh-CHS": "o Dst_主机，数据包的接收器；"
    },
    {
      "indent": 3,
      "text": "o Start_time, the sending time of the first packet;",
      "zh-CHS": "o 开始时间，第一个数据包的发送时间；"
    },
    {
      "indent": 3,
      "text": "o Delays_series, apply only for delays and ipdv samples;",
      "zh-CHS": "o Delays_系列，仅适用于Delays和ipdv样品；"
    },
    {
      "indent": 3,
      "text": "o Losses_series, apply only for packets loss samples;",
      "zh-CHS": "o loss_系列，仅适用于包丢失样本；"
    },
    {
      "indent": 3,
      "text": "o Result_status_series;",
      "zh-CHS": "o 结果\\状态\\序列；"
    },
    {
      "indent": 3,
      "text": "o Observation_duration, the difference between the time of the last singleton of the last sample and the time of the first singleton of the first sample.",
      "zh-CHS": "o 观察持续时间，最后一个样本的最后一个单体时间与第一个样本的第一个单体时间之间的差异。"
    },
    {
      "indent": 3,
      "text": "The following is the context information (measure, points of interests) that SHOULD be available to compute statistics:",
      "zh-CHS": "以下是可用于计算统计数据的上下文信息（度量、兴趣点）："
    },
    {
      "indent": 3,
      "text": "o Loss threshold;",
      "zh-CHS": "o 损失阈值；"
    },
    {
      "indent": 3,
      "text": "o Systematic error, constant delay between wire-time and timestamping;",
      "zh-CHS": "o 系统误差，导线时间和时间戳之间的恒定延迟；"
    },
    {
      "indent": 3,
      "text": "o Calibration error, maximal uncertainty;",
      "zh-CHS": "o 校准误差，最大不确定度；"
    },
    {
      "indent": 3,
      "text": "The following is the information of each statistic that SHOULD be reported:",
      "zh-CHS": "以下是应报告的各项统计数据的信息："
    },
    {
      "indent": 3,
      "text": "o Result;",
      "zh-CHS": "o 后果"
    },
    {
      "indent": 3,
      "text": "o Start_time;",
      "zh-CHS": "o 开始时间；"
    },
    {
      "indent": 3,
      "text": "o Duration;",
      "zh-CHS": "o 期间"
    },
    {
      "indent": 3,
      "text": "o Result_status;",
      "zh-CHS": "o 结果(1)状态;；"
    },
    {
      "indent": 3,
      "text": "o Singleton_number, the number of singletons on which the statistic is computed;",
      "zh-CHS": "o Singleton_number，计算统计数据的单件数；"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "zh-CHS": "11. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Spatial and one-to-group metrics are defined on the top of end-to-end metrics. Security considerations discussed in the one-way delay metrics definitions of [RFC2679], in packet loss metrics definitions of [RFC2680] and in IPDV metrics definitions of [RFC3393] and [RFC3432] apply to metrics defined in this memo.",
      "zh-CHS": "在端到端度量的顶部定义了空间度量和一对一度量。[RFC2679]的单向延迟度量定义、[RFC2680]的丢包度量定义以及[RFC3393]和[RFC3432]的IPDV度量定义中讨论的安全注意事项适用于本备忘录中定义的度量。"
    },
    {
      "indent": 3,
      "text": "Someone may spoof the identity of a point of interest identity and intentionally send corrupt results in order to remotely orient the traffic engineering decisions.",
      "zh-CHS": "有人可能伪造兴趣点身份，并故意发送损坏的结果，以便远程确定流量工程决策。"
    },
    {
      "indent": 3,
      "text": "A point of interest could intentionally corrupt its results in order to remotely orient the traffic engineering decisions.",
      "zh-CHS": "利益点可能故意破坏其结果，以便远程确定交通工程决策的方向。"
    },
    {
      "indent": 0,
      "text": "11.1. Spatial Metrics",
      "section_title": true,
      "zh-CHS": "11.1. 空间度量"
    },
    {
      "indent": 3,
      "text": "Malicious generation of packets that systematically match the hash function used to detect the packets may lead to a DoS attack toward the point of reference.",
      "zh-CHS": "恶意生成的数据包系统地匹配用于检测数据包的哈希函数，可能导致对参考点的DoS攻击。"
    },
    {
      "indent": 3,
      "text": "Spatial measurement results carry the performance of individual segments of the path and the identity of nodes. An attacker may infer from this information the points of weakness of a network (e.g., congested node) that would require the least amount of additional attacking traffic to exploit. Therefore, monitoring information should be carried in a way that prevents unintended",
      "zh-CHS": "空间测量结果反映了路径各个分段的性能和节点的身份。攻击者可以从该信息推断出需要最少额外攻击流量才能利用的网络弱点（例如，拥塞节点）。因此，监控信息的传输方式应能防止意外情况"
    },
    {
      "indent": 3,
      "text": "recipients from inspecting the measurement reports. A straightforward solution is to restrict access to the reports using encrypted sessions or secured networks.",
      "zh-CHS": "收件人不必检查测量报告。一个简单的解决方案是使用加密会话或安全网络限制对报告的访问。"
    },
    {
      "indent": 0,
      "text": "11.2. One-to-Group Metrics",
      "section_title": true,
      "zh-CHS": "11.2. 一组指标"
    },
    {
      "indent": 3,
      "text": "Reporting of measurement results from a huge number of probes may overload reference point resources (network, network interfaces, computation capacities, etc.).",
      "zh-CHS": "报告大量探头的测量结果可能会使参考点资源（网络、网络接口、计算能力等）过载。"
    },
    {
      "indent": 3,
      "text": "The configuration of a measurement must take into consideration that implicitly more packets will be routed than sent and select a test packet rate accordingly. Collecting statistics from a huge number of probes may overload any combination of the network to which the measurement controller is attached, measurement controller network interfaces, and measurement controller computation capacities.",
      "zh-CHS": "测量的配置必须考虑到路由的数据包将隐含地多于发送的数据包，并相应地选择测试数据包速率。从大量探头收集统计数据可能会使测量控制器连接的网络、测量控制器网络接口和测量控制器计算能力的任何组合过载。"
    },
    {
      "indent": 3,
      "text": "One-to-group metric measurements should consider using source authentication protocols, standardized in the MSEC group, to avoid fraud packet in the sampling interval. The test packet rate could be negotiated before any measurement session to avoid denial-of-service attacks.",
      "zh-CHS": "一个到组度量度量应该考虑使用MSEC组中标准化的源认证协议，以避免采样间隔中的欺诈分组。测试数据包速率可以在任何测量会话之前协商，以避免拒绝服务攻击。"
    },
    {
      "indent": 3,
      "text": "A point of interest could intentionally degrade its results in order to remotely increase the quality of the network on the branches of the multicast tree to which it is connected.",
      "zh-CHS": "兴趣点可以故意降低其结果，以便远程提高其所连接的多播树分支上的网络质量。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgments",
      "section_title": true,
      "zh-CHS": "12. 致谢"
    },
    {
      "indent": 3,
      "text": "Lei would like to acknowledge Professor Zhili Sun from CCSR, University of Surrey, for his instruction and helpful comments on this work.",
      "zh-CHS": "李磊感谢塞瑞大学CCSR的支丽隼教授对这项工作的指导和有益的意见。"
    },
    {
      "indent": 0,
      "text": "13. IANA Considerations",
      "section_title": true,
      "zh-CHS": "13. IANA考虑"
    },
    {
      "indent": 3,
      "text": "Metrics defined in this memo have been registered in the IANA IPPM METRICS REGISTRY as described in the initial version of the registry [RFC4148]:",
      "zh-CHS": "本备忘录中定义的指标已在IANA IPPM指标注册中心注册，如注册中心初始版本[RFC4148]所述："
    },
    {
      "indent": 3,
      "text": "IANA has registered the following metrics in the IANA-IPPM-METRICS-REGISTRY-MIB:",
      "zh-CHS": "IANA已在IANA-IPPM-metrics-REGISTRY-MIB中注册了以下指标："
    },
    {
      "indent": 3,
      "text": "ietfSpatialOneWayDelayVector OBJECT-IDENTITY",
      "zh-CHS": "ietfSpatialOneWayDelayVector对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-Spatial-One-way-Delay-Vector\"",
      "zh-CHS": "“类型-P-空间-单向-延迟-向量”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 5.1.\"",
      "zh-CHS": "“RFC 5644，第5.1节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 52 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfSpatialPacketLossVector OBJECT-IDENTITY",
      "zh-CHS": "IETFSPATIALPACKETTLOSSVECTOR对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-Spatial-Packet-Loss-Vector\"",
      "zh-CHS": "“Type-P-Spatial-Packet-Loss-Vector”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 5.2.\"",
      "zh-CHS": "“RFC 5644，第5.2节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 53 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfSpatialOneWayIpdvVector OBJECT-IDENTITY",
      "zh-CHS": "ietfSpatialOneWayIpdvVector对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-Spatial-One-way-ipdv-Vector\"",
      "zh-CHS": "“类型-P-空间-单向-ipdv-向量”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 5.3.\"",
      "zh-CHS": "“RFC 5644，第5.3节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 54 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfSegmentOneWayDelayStream OBJECT-IDENTITY",
      "zh-CHS": "ietfSegmentOneWayDelayStream对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-Segment-One-way-Delay-Stream\"",
      "zh-CHS": "“类型-P-段-单向-延迟-流”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 6.1.\"",
      "zh-CHS": "“RFC 5644，第6.1节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 55 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfSegmentPacketLossStream OBJECT-IDENTITY",
      "zh-CHS": "ietfSegmentPacketLossStream对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-Segment-Packet-Loss-Stream\"",
      "zh-CHS": "“类型-P-段-丢包-流”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 6.2.\"",
      "zh-CHS": "“RFC 5644，第6.2节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 56 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfSegmentIpdvPrevStream OBJECT-IDENTITY",
      "zh-CHS": "ietfSegmentIpdvPrevStream对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-Segment-ipdv-prev-Stream\"",
      "zh-CHS": "“类型-P-段-ipdv-prev-Stream”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 6.3.\"",
      "zh-CHS": "“RFC 5644，第6.3节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 57 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfSegmentIpdvMinStream OBJECT-IDENTITY",
      "zh-CHS": "ietfSegmentIpdvMinStream对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-Segment-ipdv-min-Stream\"",
      "zh-CHS": "“类型-P-段-ipdv-min-Stream”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 6.4.\"",
      "zh-CHS": "“RFC 5644，第6.4节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 58 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- One-to-group metrics",
      "zh-CHS": "--一组指标"
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupDelayVector OBJECT-IDENTITY",
      "zh-CHS": "ietfOneToGroupDelayVector对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Delay-Vector\"",
      "zh-CHS": "“P型一对群延迟向量”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 7.1.\"",
      "zh-CHS": "“RFC 5644，第7.1节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 59 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupPacketLossVector OBJECT-IDENTITY",
      "zh-CHS": "ietfOneToGroupPacketLossVector对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Packet-Loss-Vector\"",
      "zh-CHS": "“类型-P-One-to-group-Packet-Loss-Vector”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 7.2.\"",
      "zh-CHS": "“RFC 5644，第7.2节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 60 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupIpdvVector OBJECT-IDENTITY",
      "zh-CHS": "ietfOneToGroupIpdvVector对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-ipdv-Vector\"",
      "zh-CHS": "“类型-P-One-to-group-ipdv-Vector”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 7.3.\"",
      "zh-CHS": "“RFC 5644，第7.3节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 61 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "-- One to group statistics",
      "zh-CHS": "--一组统计数据"
    },
    {
      "indent": 3,
      "text": "--",
      "zh-CHS": "--"
    },
    {
      "indent": 3,
      "text": "ietfOnetoGroupReceiverNMeanDelay OBJECT-IDENTITY",
      "zh-CHS": "IETFONETOGroupReceivenMeandLay对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Receiver-n-Mean-Delay\"",
      "zh-CHS": "“P型一对群接收机n平均延迟”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.3.1.\"",
      "zh-CHS": "“RFC 5644，第8.3.1节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 62 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupMeanDelay OBJECT-IDENTITY",
      "zh-CHS": "IETFONEToGroupMean延迟对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Mean-Delay\"",
      "zh-CHS": "“P型一对群平均延迟”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.3.2.\"",
      "zh-CHS": "“RFC 5644，第8.3.2节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 63 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupRangeMeanDelay OBJECT-IDENTITY",
      "zh-CHS": "IETFONETOGroupRangeMean延迟对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Range-Mean-Delay\"",
      "zh-CHS": "“P型一对群距离平均延迟”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.3.3.\"",
      "zh-CHS": "“RFC 5644，第8.3.3节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 64 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupMaxMeanDelay OBJECT-IDENTITY",
      "zh-CHS": "ietfOneToGroupMaxMeanDelay对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Max-Mean-Delay\"",
      "zh-CHS": "“P型一对一组最大平均延迟”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.3.4.\"",
      "zh-CHS": "“RFC 5644，第8.3.4节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 65 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupReceiverNLossRatio OBJECT-IDENTITY",
      "zh-CHS": "IETFONETOGroupReceiverNLOSRatio对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Receiver-n-Loss-Ratio\"",
      "zh-CHS": "“类型-P-一对群-接收机-n-损耗比”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.4.1.\"",
      "zh-CHS": "“RFC 5644，第8.4.1节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 66 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "--",
      "zh-CHS": "--"
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupReceiverNCompLossRatio OBJECT-IDENTITY",
      "zh-CHS": "IETFONETOGroupReceivenComplossRatio对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Receiver-n-Comp-Loss-Ratio\"",
      "zh-CHS": "“类型-P-一对一组-接收器-n-补偿-损耗比”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.4.2.\"",
      "zh-CHS": "“RFC 5644，第8.4.2节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 67 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupLossRatio OBJECT-IDENTITY",
      "zh-CHS": "ietfOneToGroupLossRatio对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Loss-Ratio\"",
      "zh-CHS": "“P型一对一损失率”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.4.3.\"",
      "zh-CHS": "“RFC 5644，第8.4.3节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 68 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "--",
      "zh-CHS": "--"
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupRangeLossRatio OBJECT-IDENTITY",
      "zh-CHS": "IETFONETOGroupRangeSratio对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Range-Loss-Ratio\"",
      "zh-CHS": "“P型一对一组量程损耗比”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.4.4.\"",
      "zh-CHS": "“RFC 5644，第8.4.4节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 69 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "ietfOneToGroupRangeDelayVariation OBJECT-IDENTITY",
      "zh-CHS": "ietfOneToGroupRangeDelayVariation对象标识"
    },
    {
      "indent": 6,
      "text": "STATUS current",
      "zh-CHS": "现状"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION",
      "zh-CHS": "描述"
    },
    {
      "indent": 9,
      "text": "\"Type-P-One-to-group-Range-Delay-Variation\"",
      "zh-CHS": "“P型一对群范围延迟变化”"
    },
    {
      "indent": 6,
      "text": "REFERENCE",
      "zh-CHS": "参考"
    },
    {
      "indent": 9,
      "text": "\"RFC 5644, section 8.5.1.\"",
      "zh-CHS": "“RFC 5644，第8.5.1节。”"
    },
    {
      "indent": 6,
      "text": ":= { ianaIppmMetrics 70 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "--",
      "zh-CHS": "--"
    },
    {
      "indent": 0,
      "text": "14. References",
      "section_title": true,
      "zh-CHS": "14. 工具书类"
    },
    {
      "indent": 0,
      "text": "14.1. Normative References",
      "section_title": true,
      "zh-CHS": "14.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2679] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Delay Metric for IPPM\", RFC 2679, September 1999.",
      "zh-CHS": "[RFC2679]Almes，G.，Kalidini，S.，和M.Zekauskas，“IPPM的单向延迟度量”，RFC 2679，1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2680] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Packet Loss Metric for IPPM\", RFC 2680, September 1999.",
      "zh-CHS": "[RFC2680]Almes，G.，Kalidini，S.，和M.Zekauskas，“IPPM的单向数据包丢失度量”，RFC 2680，1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3393] Demichelis, C. and P. Chimento, \"IP Packet Delay Variation Metric for IP Performance Metrics (IPPM)\", RFC 3393, November 2002.",
      "zh-CHS": "[RFC3393]Demichelis，C.和P.Chimento，“IP性能度量的IP数据包延迟变化度量（IPPM）”，RFC 3393，2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4148] Stephan, E., \"IP Performance Metrics (IPPM) Metrics Registry\", BCP 108, RFC 4148, August 2005.",
      "zh-CHS": "[RFC4148]Stephan，E.“IP性能度量（IPPM）度量注册表”，BCP 108，RFC 4148，2005年8月。"
    },
    {
      "indent": 0,
      "text": "14.2. Informative References",
      "section_title": true,
      "zh-CHS": "14.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC2330] Paxson, V., Almes, G., Mahdavi, J., and M. Mathis, \"Framework for IP Performance Metrics\", RFC 2330, May 1998.",
      "zh-CHS": "[RFC2330]Paxson，V.，Almes，G.，Mahdavi，J.，和M.Mathis，“IP性能度量框架”，RFC 2330，1998年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3432] Raisanen, V., Grotefeld, G., and A. Morton, \"Network performance measurement with periodic streams\", RFC 3432, November 2002.",
      "zh-CHS": "[RFC3432]Raisanen，V.，Grotefeld，G.，和A.Morton，“周期流的网络性能测量”，RFC 3432，2002年11月。"
    },
    {
      "indent": 3,
      "text": "[SPATIAL] Morton, A. and E. Stephan, \"Spatial Composition of Metrics\", Work in Progress, June 2009.",
      "zh-CHS": "[空间]Morton，A.和E.Stephan，“度量的空间构成”，正在进行的工作，2009年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Stephan Emile France Telecom Division R&D 2 avenue Pierre Marzin Lannion F-22307 France",
      "zh-CHS": "Stephan Emile法国电信部研发2大道Pierre Marzin Lannion F-22307法国"
    },
    {
      "indent": 3,
      "text": "Fax:   +33 2 96 05 18 52\nEMail: emile.stephan@orange-ftgroup.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Lei Liang CCSR, University of Surrey Guildford Surrey GU2 7XH UK",
      "zh-CHS": "Lei Liang CCSR，塞瑞大学"
    },
    {
      "indent": 3,
      "text": "Fax:   +44 1483 683641\nEMail: L.Liang@surrey.ac.uk",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Al Morton 200 Laurel Ave. South Middletown, NJ 07748 USA",
      "zh-CHS": "美国新泽西州南米德尔敦劳雷尔大道200号艾尔·莫顿07748"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 1571\nEMail: acmorton@att.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}