{
  "title": {
    "text": "RFC 5735: Special Use IPv4 Addresses",
    "zh-CHS": "RFC 5735"
  },
  "number": 5735,
  "created_at": "2021-11-08 16:01:53.550196+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         M. Cotton\nRequest for Comments: 5735                                     L. Vegoda\nBCP: 153                                                           ICANN\nObsoletes: 3330                                             January 2010\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 23,
      "text": "Special Use IPv4 Addresses",
      "zh-CHS": "特殊用途IPv4地址"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 3330. It describes the global and other specialized IPv4 address blocks that have been assigned by the Internet Assigned Numbers Authority (IANA). It does not address IPv4 address space assigned to operators and users through the Regional Internet Registries, nor does it address IPv4 address space assigned directly by IANA prior to the creation of the Regional Internet Registries. It also does not address allocations or assignments of IPv6 addresses or autonomous system numbers.",
      "zh-CHS": "本文件淘汰RFC 3330。它描述了Internet分配号码管理局（IANA）分配的全局和其他专用IPv4地址块。它不寻址通过区域互联网注册中心分配给运营商和用户的IPv4地址空间，也不寻址IANA在创建区域互联网注册中心之前直接分配的IPv4地址空间。它也不处理IPv6地址或自治系统号的分配或分配。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "zh-CHS": "本备忘录记录了互联网最佳实践。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "zh-CHS": "本文件是互联网工程任务组（IETF）的产品。它代表了IETF社区的共识。它已经接受了公众审查，并已被互联网工程指导小组（IESG）批准出版。有关BCP的更多信息，请参见RFC 5741第2节。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5735.",
      "zh-CHS": "有关本文件当前状态、任何勘误表以及如何提供反馈的信息，请访问http://www.rfc-editor.org/info/rfc5735."
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2010 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从该文档中提取的代码组件必须"
    },
    {
      "indent": 3,
      "text": "include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "zh-CHS": "包括信托法律条款第4.e节中所述的简化BSD许可证文本，且不提供简化BSD许可证中所述的担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 0,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n3.  Global and Other Specialized Address Blocks  . . . . . . . . .  3\n4.  Summary Table  . . . . . . . . . . . . . . . . . . . . . . . .  6\n5.  Assignments of IPv4 Blocks for New Specialized Uses  . . . . .  6\n6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  6\n7.  Security Considerations  . . . . . . . . . . . . . . . . . . .  7\n8.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . .  7\n9.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  7\n  9.1.  Normative References . . . . . . . . . . . . . . . . . . .  7\n  9.2.  Informative References . . . . . . . . . . . . . . . . . .  7\nAppendix A.  Differences between This Document and RFC 3330  . . . 10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "Throughout its history, the Internet has employed a central Internet Assigned Numbers Authority (IANA) responsible for the allocation and assignment of various identifiers needed for the operation of the Internet [RFC1174]. In the case of the IPv4 address space, the IANA allocates parts of the address space to Regional Internet Registries (RIRs) according to their established needs. These RIRs are responsible for the registration of IPv4 addresses to operators and users of the Internet within their regions.",
      "zh-CHS": "在其整个历史过程中，互联网使用了一个中央互联网分配号码管理局（IANA），负责分配和分配互联网运行所需的各种标识符[RFC1174]。在IPv4地址空间的情况下，IANA根据其既定需求将部分地址空间分配给区域互联网注册中心（RIR）。这些RIR负责向其区域内的互联网运营商和用户注册IPv4地址。"
    },
    {
      "indent": 3,
      "text": "On an ongoing basis, the IANA has been designated by the IETF to make assignments in support of the Internet Standards Process [RFC2860]. Section 4 of that document describes that assignment process.",
      "zh-CHS": "IETF一直指定IANA进行任务分配，以支持互联网标准过程[RFC2860]。该文件第4节描述了分配过程。"
    },
    {
      "indent": 3,
      "text": "Small portions of the IPv4 address space have been allocated or assigned directly by the IANA for global or other specialized purposes. These allocations and assignments have been documented in a variety of RFCs and other documents. This document is intended to collect these scattered references and provide a current list of special use IPv4 addresses.",
      "zh-CHS": "小部分IPv4地址空间由IANA直接分配或分配，用于全局或其他专用目的。这些分配和分配已记录在各种RFC和其他文件中。本文档旨在收集这些零散的参考资料，并提供特殊用途IPv4地址的当前列表。"
    },
    {
      "indent": 3,
      "text": "This document is a revision of RFC 3330 [RFC3330], which it obsoletes; its primary purpose is to reflect the changes to the list of special IPv4 assignments since the publication of RFC 3330. It is a companion to [RFC5156], which describes special IPv6 addresses.",
      "zh-CHS": "本文件是RFC 3330[RFC3330]的修订版，已被废弃；其主要目的是反映自RFC 3330发布以来对特殊IPv4分配列表的更改。它是[RFC5156]的补充，后者描述了特殊的IPv6地址。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照BCP 14、[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Global and Other Specialized Address Blocks",
      "section_title": true,
      "zh-CHS": "3. 全局和其他专用地址块"
    },
    {
      "indent": 3,
      "text": "0.0.0.0/8 - Addresses in this block refer to source hosts on \"this\" network. Address 0.0.0.0/32 may be used as a source address for this host on this network; other addresses within 0.0.0.0/8 may be used to refer to specified hosts on this network ([RFC1122], Section 3.2.1.3).",
      "zh-CHS": "0.0.0.0/8-此块中的地址指“此”网络上的源主机。地址0.0.0.0/32可用作此网络上此主机的源地址；0.0.0.0/8范围内的其他地址可用于指代该网络上的指定主机（[RFC1122]，第3.2.1.3节）。"
    },
    {
      "indent": 3,
      "text": "10.0.0.0/8 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. As described in that RFC, addresses within this block do not legitimately appear on the public Internet. These addresses can be used without any coordination with IANA or an Internet registry.",
      "zh-CHS": "10.0.0.0/8-此块用于专用网络。其预期用途记录在[RFC1918]中。如RFC中所述，此块中的地址不会合法地出现在公共Internet上。这些地址可以在不与IANA或Internet注册表进行任何协调的情况下使用。"
    },
    {
      "indent": 3,
      "text": "127.0.0.0/8 - This block is assigned for use as the Internet host loopback address. A datagram sent by a higher-level protocol to an address anywhere within this block loops back inside the host. This is ordinarily implemented using only 127.0.0.1/32 for loopback. As described in [RFC1122], Section 3.2.1.3, addresses within the entire 127.0.0.0/8 block do not legitimately appear on any network anywhere.",
      "zh-CHS": "127.0.0.0/8-分配此块用作Internet主机环回地址。由高级协议发送到该块中任意地址的数据报在主机内部循环。这通常仅使用127.0.0.1/32实现环回。如[RFC1122]第3.2.1.3节所述，整个127.0.0.0/8块中的地址不合法地出现在任何网络上。"
    },
    {
      "indent": 3,
      "text": "169.254.0.0/16 - This is the \"link local\" block. As described in [RFC3927], it is allocated for communication between hosts on a single link. Hosts obtain these addresses by auto-configuration, such as when a DHCP server cannot be found.",
      "zh-CHS": "169.254.0.0/16-这是“链接本地”块。如[RFC3927]所述，它被分配用于单个链路上主机之间的通信。主机通过自动配置获得这些地址，例如当找不到DHCP服务器时。"
    },
    {
      "indent": 3,
      "text": "172.16.0.0/12 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. As described in that RFC, addresses within this block do not legitimately appear on the public Internet. These addresses can be used without any coordination with IANA or an Internet registry.",
      "zh-CHS": "172.16.0.0/12-此块用于专用网络。其预期用途记录在[RFC1918]中。如RFC中所述，此块中的地址不会合法地出现在公共Internet上。这些地址可以在不与IANA或Internet注册表进行任何协调的情况下使用。"
    },
    {
      "indent": 3,
      "text": "192.0.0.0/24 - This block is reserved for IETF protocol assignments. At the time of writing this document, there are no current assignments. Allocation policy for future assignments is given in [RFC5736].",
      "zh-CHS": "192.0.0.0/24-此块保留用于IETF协议分配。在编写本文档时，没有当前的作业。[RFC5736]中给出了未来分配的分配策略。"
    },
    {
      "indent": 3,
      "text": "192.0.2.0/24 - This block is assigned as \"TEST-NET-1\" for use in documentation and example code. It is often used in conjunction with domain names example.com or example.net in vendor and protocol documentation. As described in [RFC5737], addresses within this block do not legitimately appear on the public Internet and can be used without any coordination with IANA or an Internet registry. See [RFC1166].",
      "zh-CHS": "192.0.2.0/24-此块被指定为“TEST-NET-1”，用于文档和示例代码中。在供应商和协议文档中，它通常与域名example.com或example.net结合使用。如[RFC5737]所述，该区块内的地址不合法地出现在公共互联网上，可以在不与IANA或互联网注册中心进行任何协调的情况下使用。见[RFC1166]。"
    },
    {
      "indent": 3,
      "text": "192.88.99.0/24 - This block is allocated for use as 6to4 relay anycast addresses, in [RFC3068]. In contrast with previously described blocks, packets destined to addresses from this block do appear in the public Internet. [RFC3068], Section 7, describes operational practices to prevent the malicious use of this block in routing protocols.",
      "zh-CHS": "192.88.99.0/24-在[RFC3068]中，该块被分配用作6to4中继选播地址。与前面描述的块相比，发送到来自该块的地址的包确实出现在公共因特网中。[RFC3068]第7节描述了防止在路由协议中恶意使用此块的操作实践。"
    },
    {
      "indent": 3,
      "text": "192.168.0.0/16 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. As described in that RFC, addresses within this block do not legitimately appear on the public Internet. These addresses can be used without any coordination with IANA or an Internet registry.",
      "zh-CHS": "192.168.0.0/16-此块用于专用网络。其预期用途记录在[RFC1918]中。如RFC中所述，此块中的地址不会合法地出现在公共Internet上。这些地址可以在不与IANA或Internet注册表进行任何协调的情况下使用。"
    },
    {
      "indent": 3,
      "text": "198.18.0.0/15 - This block has been allocated for use in benchmark tests of network interconnect devices. [RFC2544] explains that this range was assigned to minimize the chance of conflict in case a",
      "zh-CHS": "198.18.0.0/15-此块已分配用于网络互连设备的基准测试。[RFC2544]解释说，分配此范围是为了最大限度地减少发生冲突的可能性"
    },
    {
      "indent": 3,
      "text": "testing device were to be accidentally connected to part of the Internet. Packets with source addresses from this range are not meant to be forwarded across the Internet.",
      "zh-CHS": "测试设备被意外连接到互联网的一部分。源地址在此范围内的数据包不打算通过Internet转发。"
    },
    {
      "indent": 3,
      "text": "198.51.100.0/24 - This block is assigned as \"TEST-NET-2\" for use in documentation and example code. It is often used in conjunction with domain names example.com or example.net in vendor and protocol documentation. As described in [RFC5737], addresses within this block do not legitimately appear on the public Internet and can be used without any coordination with IANA or an Internet registry.",
      "zh-CHS": "198.51.100.0/24-此块被指定为“TEST-NET-2”，用于文档和示例代码中。在供应商和协议文档中，它通常与域名example.com或example.net结合使用。如[RFC5737]所述，该区块内的地址不合法地出现在公共互联网上，可以在不与IANA或互联网注册中心进行任何协调的情况下使用。"
    },
    {
      "indent": 3,
      "text": "203.0.113.0/24 - This block is assigned as \"TEST-NET-3\" for use in documentation and example code. It is often used in conjunction with domain names example.com or example.net in vendor and protocol documentation. As described in [RFC5737], addresses within this block do not legitimately appear on the public Internet and can be used without any coordination with IANA or an Internet registry.",
      "zh-CHS": "203.0.113.0/24-该块被指定为“TEST-NET-3”，用于文件和示例代码中。在供应商和协议文档中，它通常与域名example.com或example.net结合使用。如[RFC5737]所述，该区块内的地址不合法地出现在公共互联网上，可以在不与IANA或互联网注册中心进行任何协调的情况下使用。"
    },
    {
      "indent": 3,
      "text": "224.0.0.0/4 - This block, formerly known as the Class D address space, is allocated for use in IPv4 multicast address assignments. The IANA guidelines for assignments from this space are described in [RFC3171].",
      "zh-CHS": "224.0.0.0/4-此块以前称为D类地址空间，分配用于IPv4多播地址分配。[RFC3171]中描述了IANA在此空间分配的指南。"
    },
    {
      "indent": 3,
      "text": "240.0.0.0/4 - This block, formerly known as the Class E address space, is reserved for future use; see [RFC1112], Section 4.",
      "zh-CHS": "240.0.0.0/4-此块以前称为E类地址空间，保留供将来使用；见[RFC1112]，第4节。"
    },
    {
      "indent": 3,
      "text": "The one exception to this is the \"limited broadcast\" destination address 255.255.255.255. As described in [RFC0919] and [RFC0922], packets with this destination address are not forwarded at the IP layer.",
      "zh-CHS": "唯一的例外是“有限广播”目标地址255.255.255.255。如[RFC0919]和[RFC0922]所述，具有此目标地址的数据包不会在IP层转发。"
    },
    {
      "indent": 0,
      "text": "4. Summary Table",
      "section_title": true,
      "zh-CHS": "4. 汇总表"
    },
    {
      "indent": 0,
      "text": "Address Block       Present Use                Reference\n------------------------------------------------------------------\n0.0.0.0/8           \"This\" Network             RFC 1122, Section 3.2.1.3\n10.0.0.0/8          Private-Use Networks       RFC 1918\n127.0.0.0/8         Loopback                   RFC 1122, Section 3.2.1.3\n169.254.0.0/16      Link Local                 RFC 3927\n172.16.0.0/12       Private-Use Networks       RFC 1918\n192.0.0.0/24        IETF Protocol Assignments  RFC 5736\n192.0.2.0/24        TEST-NET-1                 RFC 5737\n192.88.99.0/24      6to4 Relay Anycast         RFC 3068\n192.168.0.0/16      Private-Use Networks       RFC 1918\n198.18.0.0/15       Network Interconnect\n                    Device Benchmark Testing   RFC 2544\n198.51.100.0/24     TEST-NET-2                 RFC 5737\n203.0.113.0/24      TEST-NET-3                 RFC 5737\n224.0.0.0/4         Multicast                  RFC 3171\n240.0.0.0/4         Reserved for Future Use    RFC 1112, Section 4\n255.255.255.255/32  Limited Broadcast          RFC 919, Section 7\n                                               RFC 922, Section 7",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5. Assignments of IPv4 Blocks for New Specialized Uses",
      "section_title": true,
      "zh-CHS": "5. 为新的专门用途分配IPv4块"
    },
    {
      "indent": 3,
      "text": "The IANA has responsibility for making assignments of protocol parameters used in the Internet according to the requirements of the \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\" [RFC2860]. Among other things, [RFC2860] requires that protocol parameters be assigned according to the criteria and procedures specified in RFCs, including Proposed, Draft, and full Internet Standards and Best Current Practice documents, and any other RFC that calls for IANA assignment.",
      "zh-CHS": "IANA负责根据“关于互联网分配号码管理局技术工作的谅解备忘录”[RFC2860]的要求分配互联网中使用的协议参数。除其他事项外，[RFC2860]要求根据RFC中规定的标准和程序分配协议参数，包括提议的、草案的和完整的互联网标准和最佳实践文件，以及要求IANA分配的任何其他RFC。"
    },
    {
      "indent": 3,
      "text": "The domain name and IP address spaces involve policy issues (in addition to technical issues) so that the requirements of [RFC2860] do not apply generally to those spaces. Nonetheless, the IANA is responsible for ensuring assignments of IPv4 addresses as needed in support of the Internet Standards Process. When a portion of the IPv4 address space is specifically required by an RFC, the technical requirements (e.g., size, prefix length) for the portion should be described [RFC5226]. Immediately before the RFC is published, the IANA will, in consultation with the Regional Internet Registries, make the necessary assignment and notify the RFC Editor of the particulars for inclusion in the RFC as published.",
      "zh-CHS": "域名和IP地址空间涉及政策问题（除技术问题外），因此[RFC2860]的要求通常不适用于这些空间。尽管如此，IANA仍负责确保根据需要分配IPv4地址，以支持互联网标准过程。当RFC明确要求IPv4地址空间的一部分时，应说明该部分的技术要求（例如大小、前缀长度）[RFC5226]。在RFC发布之前，IANA将与区域互联网注册处协商，进行必要的分配，并将发布的RFC中包含的细节通知RFC编辑。"
    },
    {
      "indent": 3,
      "text": "As required by [RFC2860], the IANA will also make necessary experimental assignments of IPv4 addresses, also in consultation with the Regional Internet Registries.",
      "zh-CHS": "根据[RFC2860]的要求，IANA还将对IPv4地址进行必要的实验性分配，并与区域互联网注册中心协商。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document describes the IANA's past and current practices and does not create any new requirements for assignments or allocations by the IANA.",
      "zh-CHS": "本文件描述了IANA过去和当前的实践，并未对IANA的分配或分配提出任何新要求。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The particular assigned values of special use IPv4 addresses cataloged in this document do not directly raise security issues. However, the Internet does not inherently protect against abuse of these addresses. If you expect (for instance) that all packets from a private address space such as the 10.0.0.0/8 block or the link local block 169.254.0.0/16 originate within your subnet, all routers at the border of your network should filter such packets that originate from outside your network. Attacks have been mounted that depend on the unexpected use of some of these addresses.",
      "zh-CHS": "本文档中编目的特殊用途IPv4地址的特定赋值不会直接引起安全问题。然而，互联网本身并不能防止这些地址被滥用。如果您期望（例如）来自专用地址空间（如10.0.0.0/8块或链路本地块169.254.0.0/16）的所有数据包都源自您的子网，则网络边界处的所有路由器都应过滤源自网络外部的此类数据包。由于某些地址的意外使用，已发起攻击。"
    },
    {
      "indent": 3,
      "text": "It should also be noted that some of these address spaces may be used legitimately outside a single administrative domain, and may appear on the global Internet. Security policy SHOULD NOT blindly filter all of these address spaces without due consideration, and network operators are encouraged to review this document, and references contained therein, and determine what security policies should be associated with each of these address blocks within their specific operating environments.",
      "zh-CHS": "还应注意，其中一些地址空间可能在单个管理域之外合法使用，并且可能出现在全球互联网上。安全策略不应在未经适当考虑的情况下盲目过滤所有这些地址空间，鼓励网络运营商查看本文档及其所含参考资料，并确定应在其特定操作环境中与每个地址块关联的安全策略。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "zh-CHS": "8. 致谢"
    },
    {
      "indent": 3,
      "text": "Many people have made comments on draft versions of this document. The authors would especially like to thank Scott Bradner, Randy Bush, Harald Alvestrand, Peter Koch, Alfred Hoenes, and Jari Arkko for their constructive feedback and comments. They would also like to offer a special note of thanks to APNIC, which nominated 198.51.100.0/24 and 203.0.113.0/24.",
      "zh-CHS": "许多人对这份文件的草稿发表了意见。作者特别感谢斯科特·布拉德纳、兰迪·布什、哈拉尔德·阿尔韦斯特朗、彼得·科赫、阿尔弗雷德·霍恩斯和贾里·阿尔科的建设性反馈和评论。他们还想特别感谢提名198.51.100.0/24和203.0.113.0/24的APNIC。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "zh-CHS": "9. 工具书类"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "zh-CHS": "9.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "zh-CHS": "9.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC0919] Mogul, J., \"Broadcasting Internet Datagrams\", STD 5, RFC 919, October 1984.",
      "zh-CHS": "[RFC0919]Mogul，J.，“广播互联网数据报”，STD 5，RFC 919，1984年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC0922] Mogul, J., \"Broadcasting Internet datagrams in the presence of subnets\", STD 5, RFC 922, October 1984.",
      "zh-CHS": "[RFC0922]Mogul，J.，“在存在子网的情况下广播互联网数据报”，STD 5，RFC 922，1984年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1112] Deering, S., \"Host extensions for IP multicasting\", STD 5, RFC 1112, August 1989.",
      "zh-CHS": "[RFC1112]Deering，S.，“IP多播的主机扩展”，STD 5，RFC11121989年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, October 1989.",
      "zh-CHS": "[RFC1122]Braden，R.，“互联网主机的要求-通信层”，标准3，RFC 1122，1989年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1166] Kirkpatrick, S., Stahl, M., and M. Recker, \"Internet numbers\", RFC 1166, July 1990.",
      "zh-CHS": "[RFC1166]Kirkpatrick，S.，Stahl，M.和M.Recker，“互联网号码”，RFC1166，1990年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1174] Cerf, V., \"IAB recommended policy on distributing internet identifier assignment and IAB recommended policy change to internet \"connected\" status\", RFC 1174, August 1990.",
      "zh-CHS": "[RFC1174]Cerf，V.，“IAB建议的分配互联网标识符的政策和IAB建议的互联网“连接”状态的政策变更”，RFC 1174，1990年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1700] Reynolds, J. and J. Postel, \"Assigned Numbers\", RFC 1700, October 1994.",
      "zh-CHS": "[RFC1700]Reynolds，J.和J.Postel，“分配的数字”，RFC1700，1994年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, R., Karrenberg, D., Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "zh-CHS": "[RFC1918]Rekhter，Y.，Moskowitz，R.，Karrenberg，D.，Groot，G.，和E.Lear，“私人互联网地址分配”，BCP 5，RFC 1918，1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2544] Bradner, S. and J. McQuaid, \"Benchmarking Methodology for Network Interconnect Devices\", RFC 2544, March 1999.",
      "zh-CHS": "[RFC2544]Bradner，S.和J.McQuaid，“网络互连设备的基准测试方法”，RFC 2544，1999年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, June 2000.",
      "zh-CHS": "[RFC2860]Carpenter，B.，Baker，F.和M.Roberts，“关于互联网分配号码管理局技术工作的谅解备忘录”，RFC 28602000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3068] Huitema, C., \"An Anycast Prefix for 6to4 Relay Routers\", RFC 3068, June 2001.",
      "zh-CHS": "[RFC3068]Huitema，C.，“6to4中继路由器的选播前缀”，RFC3068，2001年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3171] Albanna, Z., Almeroth, K., Meyer, D., and M. Schipper, \"IANA Guidelines for IPv4 Multicast Address Assignments\", BCP 51, RFC 3171, August 2001.",
      "zh-CHS": "[RFC3171]Albanna，Z.，Almeroth，K.，Meyer，D.，和M.Schipper，“IPv4多播地址分配的IANA指南”，BCP 51，RFC 3171，2001年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3330] IANA, \"Special-Use IPv4 Addresses\", RFC 3330, September 2002.",
      "zh-CHS": "[RFC3330]IANA，“特殊用途IPv4地址”，RFC33302002年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3927] Cheshire, S., Aboba, B., and E. Guttman, \"Dynamic Configuration of IPv4 Link-Local Addresses\", RFC 3927, May 2005.",
      "zh-CHS": "[RFC3927]Cheshire，S.，Aboba，B.和E.Guttman，“IPv4链路本地地址的动态配置”，RFC 3927，2005年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5156] Blanchet, M., \"Special-Use IPv6 Addresses\", RFC 5156, April 2008.",
      "zh-CHS": "[RFC5156]Blanchet，M.，“特殊用途IPv6地址”，RFC 5156，2008年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5736] Huston, G., Cotton, M., and L. Vegoda, \"IANA IPv4 Special Purpose Address Registry\", RFC 5736, January 2010.",
      "zh-CHS": "[RFC5736]Huston，G.，Cotton，M.和L.Vegoda，“IANA IPv4专用地址注册”，RFC 57362010年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5737] Arkko, J., Cotton, M., and L. Vegoda, \"IPv4 Address Blocks Reserved for Documentation\", RFC 5737, January 2010.",
      "zh-CHS": "[RFC5737]Arkko，J.，Cotton，M.和L.Vegoda，“为文档保留的IPv4地址块”，RFC 5737，2010年1月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Differences between This Document and RFC 3330",
      "section_title": true,
      "zh-CHS": "附录A.本文件与RFC 3330之间的差异"
    },
    {
      "indent": 3,
      "text": "Address blocks that were reserved for a special purpose in RFC 3330 but are no longer reserved for any special purpose and are available for allocation are no longer listed in Sections 4 or 5. The following blocks have become available:",
      "zh-CHS": "在RFC 3330中为特殊目的保留但不再为任何特殊目的保留且可供分配的地址块不再列在第4节或第5节中。以下模块已可用："
    },
    {
      "indent": 3,
      "text": "- 14.0.0.0/8 is no longer set aside for assignments to the international system of Public Data Networks [RFC1700], page 181. It is now available for allocation to RIRs in the normal way.",
      "zh-CHS": "- 14.0.0.0/8不再用于分配给国际公共数据网络系统[RFC1700]，第181页。现在可以按正常方式分配给RIR。"
    },
    {
      "indent": 3,
      "text": "- 24.0.0.0/8 is no longer listed as the addresses in that block have been managed by the American Registry for Internet Numbers (ARIN) in the normal way since 2001.",
      "zh-CHS": "- 24.0.0.0/8不再列出，因为该区块中的地址自2001年以来一直由美国互联网号码注册中心（ARIN）以正常方式管理。"
    },
    {
      "indent": 3,
      "text": "- 39.0.0.0/8 is no longer listed as it has been subject to allocation to an RIR for assignment in the normal manner since 2001.",
      "zh-CHS": "- 39.0.0.0/8不再列出，因为自2001年以来，它一直以正常方式分配给RIR进行分配。"
    },
    {
      "indent": 3,
      "text": "- 128.0.0.0/16 is not reserved and is subject to future allocation by a Regional Internet Registry for assignment in the normal manner.",
      "zh-CHS": "- 128.0.0.0/16不保留，由区域互联网注册处以正常方式分配。"
    },
    {
      "indent": 3,
      "text": "- 191.255.0.0/16 is not reserved and is subject to future allocation by a RIR for assignment in the normal manner.",
      "zh-CHS": "- 191.255.0.0/16未被保留，未来将由RIR以正常方式分配。"
    },
    {
      "indent": 3,
      "text": "- 198.51.100.0/24 is assigned as \"TEST-NET-2\" for use in documentation and example code.",
      "zh-CHS": "- 198.51.100.0/24被指定为“TEST-NET-2”，用于文件和示例代码中。"
    },
    {
      "indent": 3,
      "text": "- 203.0.113.0/24 is assigned as \"TEST-NET-3\" for use in documentation and example code.",
      "zh-CHS": "- 203.0.113.0/24被指定为“TEST-NET-3”，用于文件和示例代码中。"
    },
    {
      "indent": 3,
      "text": "- 223.255.255.0/24 is not reserved and is subject to future allocation by an RIR for assignment in the normal manner.",
      "zh-CHS": "- 223.255.255.0/24未被保留，未来将由RIR以正常方式分配。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Michelle Cotton Internet Corporation for Assigned Names and Numbers 4676 Admiralty Way, Suite 330 Marina del Rey, CA 90292 USA",
      "zh-CHS": "Michelle Cotton互联网公司，地址：美国加利福尼亚州玛丽娜·德雷市金钟路4676号330室，邮编：90292"
    },
    {
      "indent": 3,
      "text": "Phone: +1-310-823-9358\nEMail: michelle.cotton@icann.org\nURI:   http://www.iana.org/",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Leo Vegoda Internet Corporation for Assigned Names and Numbers 4676 Admiralty Way, Suite 330 Marina del Rey, CA 90292 USA",
      "zh-CHS": "利奥·维戈达互联网名称和编号分配公司美国加利福尼亚州马里纳·德雷市海军部路4676号330室，邮编90292"
    },
    {
      "indent": 3,
      "text": "Phone: +1-310-823-9358\nEMail: leo.vegoda@icann.org\nURI:   http://www.iana.org/",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}