{
  "title": {
    "text": "RFC 5745: Procedures for Rights Handling in the RFC IAB Stream",
    "zh-CHS": "RFC 5745"
  },
  "number": 5745,
  "created_at": "2021-11-08 16:24:09.140193+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      A. Malis, Ed.\nRequest for Comments: 5745                                   For the IAB\nUpdates: 4846                                              December 2009\nCategory: Informational",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Procedures for Rights Handling in the RFC IAB Stream",
      "zh-CHS": "RFC IAB流中的权限处理过程"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 0,
      "text": "This document specifies the procedures by which authors of RFC IAB stream documents grant the community \"incoming\" rights for copying and using the text. It also specifies the \"outgoing\" rights the community grants to readers and users of those documents, and it requests that the IETF Trust manage the outgoing rights to effect this result.",
      "zh-CHS": "本文档规定了RFC IAB流文档的作者授予社区复制和使用文本的“传入”权限的程序。它还指定了社区授予这些文档的读者和用户的“传出”权限，并要求IETF信任管理传出权限以实现此结果。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文件中提取的代码组件必须包括《信托法律条款》第4.e节中所述的简化BSD许可文本，并且提供BSD许可中所述的代码组件时不提供任何担保。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Background  . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n3.  Goals . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n4.  Rules for Submission and Use of Material  . . . . . . . . . . . 3\n5.  Procedures Requested of the IETF Trust  . . . . . . . . . . . . 4\n6.  Patent and Trademark Rules for the IAB Stream . . . . . . . . . 4\n7.  Security Considerations . . . . . . . . . . . . . . . . . . . . 5\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . . . 5\n  8.2.  Informative References  . . . . . . . . . . . . . . . . . . 5\n9. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . . 6\n10. IAB Members at the Time of This Writing . . . . . . . . . . . . 6",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As the IETF has grown, the process and the community have become more careful about defining the rights relating to copying documents that are granted by authors to the community, and the corresponding rights that are granted by the community to readers and users of these documents. The creation of the IETF Trust [RFC4371], with its special role in managing intellectual property rights (IPR), has also increased the need to be explicit about these rights and decisions.",
      "zh-CHS": "随着IETF的发展，流程和社区在定义作者授予社区的复制文档相关权利以及社区授予这些文档的读者和用户的相应权利时变得更加谨慎。IETF信托基金[RFC4371]的成立及其在管理知识产权（IPR）方面的特殊作用也增加了明确这些权利和决定的需要。"
    },
    {
      "indent": 3,
      "text": "This document defines the copyright procedures for RFC IAB stream documents. It parallels the procedures for IETF-produced documents defined in RFC 5377 [RFC5377] and RFC 5378 [RFC5378].",
      "zh-CHS": "本文档定义了RFC IAB流文档的版权程序。它与RFC 5377[RFC5377]和RFC 5378[RFC5378]中定义的IETF生成文档的过程相似。"
    },
    {
      "indent": 3,
      "text": "In summary, submissions in the IAB stream use the same submission procedures and mechanisms that are defined in RFC 5378, and hence require the same \"incoming rights\" as IETF-stream documents. This document provides advice to the Trustees of the IETF Trust on \"outgoing\" rights to be granted to readers and users of IAB stream documents, and it explicitly requests the IETF Trust to manage the rights in accordance with this advice.",
      "zh-CHS": "总之，IAB流中的提交使用RFC 5378中定义的相同提交程序和机制，因此需要与IETF流文档相同的“传入权限”。本文件就授予IAB流文件读者和用户的“传出”权利向IETF信托受托人提供建议，并明确要求IETF信托根据本建议管理权利。"
    },
    {
      "indent": 3,
      "text": "This document also specifies the policies with regard to the disclosure of Patents and Trademarks that may be relevant to a submission intended for the IAB stream.",
      "zh-CHS": "本文件还规定了与IAB流提交相关的专利和商标披露政策。"
    },
    {
      "indent": 0,
      "text": "2. Background",
      "section_title": true,
      "zh-CHS": "2. 出身背景"
    },
    {
      "indent": 3,
      "text": "The concept of RFC streams in general, and the IAB stream in particular, is described in Section 5 of RFC 4844 [RFC4844].",
      "zh-CHS": "RFC 4844[RFC4844]第5节中描述了RFC流的一般概念，特别是IAB流。"
    },
    {
      "indent": 3,
      "text": "Section 8 of RFC 4846 [RFC4846] presented the copyright rules for the Independent Submission stream. The present document is intended to",
      "zh-CHS": "RFC 4846[RFC4846]第8节介绍了独立提交流的版权规则。本文件旨在："
    },
    {
      "indent": 3,
      "text": "be fully consistent with that section, and to update it by clarifying the formal procedures that the IETF Trust will use to effect those rules. In particular, it is the intention of this document to make the copyright rules for IAB stream documents identical to those for Independent Submission stream documents.",
      "zh-CHS": "与该节完全一致，并通过澄清IETF信托将用于实施这些规则的正式程序来更新该节。特别是，本文件旨在使IAB流文件的版权规则与独立提交流文件的版权规则相同。"
    },
    {
      "indent": 0,
      "text": "3. Goals",
      "section_title": true,
      "zh-CHS": "3. 目标"
    },
    {
      "indent": 3,
      "text": "The goal of the IAB stream of RFCs is to publish information from the IAB to the Internet community. Consistent with the principle stated for the Independent Submission stream in Section 8 of RFC 4846, this objective will best be met with a liberal copyright policy on IAB stream documents. Therefore, the IAB stream policy is to allow any individual reading such documents to use the content thereof in any manner. The only restriction is that proper credit (\"attribution\") must be given. Lawyers describe this liberal policy by saying that this stream normally permits \"unlimited derivative works\". The only additional restriction for the use of IAB documents is that proper credit (\"attribution\") must be given.",
      "zh-CHS": "RFC的IAB流的目标是将信息从IAB发布到互联网社区。与RFC 4846第8节中规定的独立提交流的原则一致，IAB流文件的自由版权政策将最好地满足这一目标。因此，IAB流策略是允许阅读此类文档的任何个人以任何方式使用其内容。唯一的限制是必须给予适当的信用（“归属”）。律师们描述这一自由政策时说，这一潮流通常允许“无限衍生作品”。使用IAB文件的唯一附加限制是必须给予适当的信用（“归属”）。"
    },
    {
      "indent": 3,
      "text": "However, for a small subset of documents published as IAB stream documents, such as output from other standards bodies, it is not reasonable to permit unlimited derivative works. In such cases, authors are permitted to request that the published IAB stream documents permit no derivative works.",
      "zh-CHS": "然而，对于作为IAB流文件发布的一小部分文件，如其他标准机构的输出，允许无限衍生作品是不合理的。在这种情况下，作者可以要求出版的IAB流文件不允许衍生作品。"
    },
    {
      "indent": 3,
      "text": "Note also that this unlimited derivative works policy applies to all parts of an IAB stream document, including any code. Therefore, no separate licensing procedure is required for extracting and adapting code that is contained in an IAB stream document submitted under the (preferred) unlimited derivative works terms. On the other hand, code may not be extracted and adapted from IAB stream documents submitted under the \"no derivative works\" terms.",
      "zh-CHS": "还请注意，此无限制衍生产品工作政策适用于IAB流文档的所有部分，包括任何代码。因此，提取和修改根据（首选）无限衍生产品条款提交的IAB流文件中包含的代码不需要单独的许可程序。另一方面，代码不得从根据“无衍生作品”条款提交的IAB流文件中提取和改编。"
    },
    {
      "indent": 0,
      "text": "4. Rules for Submission and Use of Material",
      "section_title": true,
      "zh-CHS": "4. 材料的提交和使用规则"
    },
    {
      "indent": 3,
      "text": "IAB stream authors will submit their material as Internet-Drafts. These drafts will be submitted to, and stored in, the IETF Internet-Drafts repository in the same fashion as IETF Internet-Drafts.",
      "zh-CHS": "IAB流作者将以互联网草稿的形式提交他们的材料。这些草案将以与IETF互联网草案相同的方式提交并存储在IETF互联网草案存储库中。"
    },
    {
      "indent": 3,
      "text": "During Internet-Draft submission, authors who intend to submit their document for publication in the IAB stream will grant rights as described in [RFC5378]. To request that the contribution be published as an RFC that permits no derivative works, an author may use the form specified for use with RFC 5378.",
      "zh-CHS": "在互联网草案提交期间，打算提交其文件以在IAB流中发布的作者将授予[RFC5378]中所述的权利。为了要求以RFC的形式出版稿件，不允许衍生作品，作者可以使用RFC 5378指定的格式。"
    },
    {
      "indent": 3,
      "text": "The IETF Trust will publish rules that provide that the Trust grants to readers and users of material from IAB stream RFCs the right to",
      "zh-CHS": "IETF信托将发布规则，规定信托授予IAB流RFC材料的读者和用户"
    },
    {
      "indent": 3,
      "text": "make unlimited derivative works, unless the RFC specifies that no derivative works are permitted. This will permit anyone to copy, extract, modify, or otherwise use material from IAB stream RFCs as long as suitable attribution is given.",
      "zh-CHS": "制作无限衍生作品，除非RFC规定不允许衍生作品。这将允许任何人复制、提取、修改或以其他方式使用IAB流RFC中的材料，只要给出适当的属性。"
    },
    {
      "indent": 3,
      "text": "Contributors of Internet-Drafts intended for the IAB stream will include the appropriate boilerplate defined by the IETF Trust. This boilerplate shall indicate compliance with RFC 5378 and shall explicitly indicate either that no derivative works can be based on the contribution, or, as is preferred, that unlimited derivative works may be crafted from the contribution.",
      "zh-CHS": "用于IAB流的互联网草案的贡献者将包括IETF信托定义的适当样板。该样板文件应表明符合RFC 5378的要求，并应明确说明不得基于该贡献创作任何衍生作品，或者，如首选，可根据该贡献创作无限衍生作品。"
    },
    {
      "indent": 0,
      "text": "5. Procedures Requested of the IETF Trust",
      "section_title": true,
      "zh-CHS": "5. IETF信托要求的程序"
    },
    {
      "indent": 3,
      "text": "The IAB requests that the IETF Trust and its Trustees assist in meeting the goals and procedures set forth in this document.",
      "zh-CHS": "IAB要求IETF信托基金及其受托人协助实现本文件规定的目标和程序。"
    },
    {
      "indent": 3,
      "text": "The Trustees are requested to publicly confirm their willingness and ability to accept responsibility for the Intellectual Property Rights for the IAB stream.",
      "zh-CHS": "受托人被要求公开确认其愿意并有能力承担IAB流的知识产权责任。"
    },
    {
      "indent": 3,
      "text": "Specifically, the Trustees are asked to develop the necessary boilerplate to enable the suitable marking of documents so that the IETF Trust receives the rights as specified in RFC 5378. These procedures need to also allow authors to indicate either no rights to make derivative works, or preferentially, the right to make unlimited derivative works from the documents. It is left to the Trust to specify exactly how this shall be clearly indicated in each document.",
      "zh-CHS": "具体而言，受托人被要求开发必要的样板文件，以便对文件进行适当标记，从而使IETF信托获得RFC 5378中规定的权利。这些程序还需要允许作者表明没有制作衍生作品的权利，或者优先表示有权根据文件制作无限衍生作品。信托基金应明确规定如何在每份文件中明确说明这一点。"
    },
    {
      "indent": 0,
      "text": "6. Patent and Trademark Rules for the IAB Stream",
      "section_title": true,
      "zh-CHS": "6. IAB流的专利和商标规则"
    },
    {
      "indent": 3,
      "text": "As specified above, contributors of documents for the IAB stream are expected to use the IETF Internet-Draft process, complying therein with the rules specified in the latest version of BCP 9, whose version at the time of writing was [RFC2026]. This includes the disclosure of Patent and Trademark issues that are known, or can be reasonably expected to be known, to the contributor.",
      "zh-CHS": "如上所述，IAB流文件的投稿人应使用IETF互联网草稿流程，遵守BCP 9最新版本中规定的规则，其在撰写本文时的版本为[RFC2026]。这包括向投稿人披露已知或合理预期已知的专利和商标问题。"
    },
    {
      "indent": 3,
      "text": "Disclosure of license terms for patents is also requested, as specified in the most recent version of BCP 79. The version of BCP 79 at the time of this writing was [RFC3979], updated by [RFC4879]. The IAB stream has chosen to use the IETF's IPR disclosure mechanism, www.ietf.org/ipr/, for this purpose. The IAB would prefer the most liberal terms possible be made available for IAB stream documents. Terms that do not require fees or licensing are preferable. Non-discriminatory terms are strongly preferred over those that discriminate among users. However, although disclosure is required and the IAB may consider disclosures and terms in making a decision",
      "zh-CHS": "根据BCP 79最新版本的规定，还要求披露专利许可条款。撰写本文时，BCP 79的版本为[RFC3979]，更新为[RFC4879]。IAB流已选择使用IETF的知识产权披露机制（www.IETF.org/IPR/）来实现这一目的。IAB希望为IAB流文件提供尽可能宽松的条款。不需要收费或许可的条款更可取。非歧视性条款比歧视用户的条款更受欢迎。然而，虽然需要披露，IAB可以考虑披露和作出决定的条件。"
    },
    {
      "indent": 3,
      "text": "as to whether to submit a document for publication, there are no specific requirements on the licensing terms for intellectual property related to IAB stream publication.",
      "zh-CHS": "至于是否提交文件以供发布，IAB流媒体发布相关知识产权的许可条款没有具体要求。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The integrity and quality of the IAB stream are the responsibility of the IAB. This document does not change those responsibilities.",
      "zh-CHS": "IAB流的完整性和质量由IAB负责。本文件不会改变这些责任。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "zh-CHS": "[RFC2026]Bradner，S.，“互联网标准过程——第3版”，BCP 9，RFC 2026，1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3979] Bradner, S., Ed., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3979, March 2005.",
      "zh-CHS": "[RFC3979]Bradner，S.，Ed.，“IETF技术中的知识产权”，BCP 79，RFC 3979，2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4371] Carpenter, B., Ed., and L. Lynch, Ed., \"BCP 101 Update for IPR Trust\", BCP 101, RFC 4371, January 2006.",
      "zh-CHS": "[RFC4371]Carpenter，B.，Ed.，和L.Lynch，Ed.，“知识产权信托的BCP 101更新”，BCP 101，RFC 4371，2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4844] Daigle, L., Ed., and Internet Architecture Board, \"The RFC Series and RFC Editor\", RFC 4844, July 2007.",
      "zh-CHS": "[RFC4844]Daigle，L.，Ed.，和互联网架构委员会，“RFC系列和RFC编辑器”，RFC 48442007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4846] Klensin, J., Ed., and D. Thaler, Ed., \"Independent Submissions to the RFC Editor\", RFC 4846, July 2007.",
      "zh-CHS": "[RFC4846]Klensin，J.，Ed.，和D.Thaler，Ed.，“向RFC编辑提交的独立意见”，RFC 48462007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4879] Narten, T., \"Clarification of the Third Party Disclosure Procedure in RFC 3979\", BCP 79, RFC 4879, April 2007.",
      "zh-CHS": "[RFC4879]Narten，T.，“RFC 3979中第三方披露程序的澄清”，BCP 79，RFC 4879，2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5378] Bradner, S., Ed., and J. Contreras, Ed., \"Rights Contributors Provide to the IETF Trust\", BCP 78, RFC 5378, November 2008.",
      "zh-CHS": "[RFC5378]Bradner，S.，Ed.，和J.Contreras，Ed.，“向IETF信托提供的权利出资人”，BCP 78，RFC 5378，2008年11月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC5377] Halpern, J., Ed., \"Advice to the Trustees of the IETF Trust on Rights to Be Granted in IETF Documents\", RFC 5377, November 2008.",
      "zh-CHS": "[RFC5377]Halpern，J.，Ed.，“就IETF文件中授予的权利向IETF信托受托人提供建议”，RFC 5377，2008年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5744] Braden, R. and J. Halpern, \"Procedures for Rights Handling in the RFC Independent Submission Stream\", RFC 5744, December 2009.",
      "zh-CHS": "[RFC5744]Braden，R.和J.Halpern，“RFC独立提交流中的权限处理程序”，RFC 57442009年12月。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "zh-CHS": "9. 致谢"
    },
    {
      "indent": 3,
      "text": "The author wishes to acknowledge that the majority of text of this document was derived from [RFC5744], and wishes to thank the authors of that document.",
      "zh-CHS": "作者希望承认，本文件的大部分文本来源于[RFC5744]，并感谢该文件的作者。"
    },
    {
      "indent": 0,
      "text": "10. IAB Members at the Time of This Writing",
      "section_title": true,
      "zh-CHS": "10. 撰写本文时的IAB成员"
    },
    {
      "indent": 3,
      "text": "Marcelo Bagnulo Gonzalo Camarillo Stuart Cheshire Vijay Gill Russ Housley John Klensin Olaf Kolkman Gregory Lebovitz Andrew Malis Danny McPherson David Oran Jon Peterson Dave Thaler",
      "zh-CHS": "马塞洛·巴格努洛·冈萨洛·卡马里洛·斯图尔特·切希尔·维杰·吉尔·罗斯·霍斯利·约翰·克莱森·奥拉夫·科尔克曼·格雷戈里·勒博维茨·安德鲁·马里·丹尼·麦克弗森·大卫·奥兰·乔恩·彼得森·戴夫·泰勒"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Andrew G. Malis Verizon Communications 117 West St. Waltham, MA 02451 USA",
      "zh-CHS": "Andrew G.Malis Verizon Communications 117美国马萨诸塞州西圣沃尔瑟姆02451"
    },
    {
      "indent": 3,
      "text": "EMail: andrew.g.malis@verizon.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IAB",
      "zh-CHS": "IAB"
    },
    {
      "indent": 3,
      "text": "EMail: iab@iab.org",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}