{
  "title": {
    "text": "RFC 5174: A Uniform Resource Name (URN) Namespace for the European Broadcasting Union (EBU)",
    "zh-CHS": "RFC 5174"
  },
  "number": 5174,
  "created_at": "2021-11-10 09:15:10.748495+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         J-P. Evain\nRequest for Comments: 5174                                           EBU\nCategory: Informational                                         May 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "A Uniform Resource Name (URN) Namespace for the European Broadcasting Union (EBU)",
      "zh-CHS": "欧洲广播联盟（EBU）的统一资源名称（URN）命名空间"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace for the European Broadcasting Union (EBU) for naming persistent resources defined within EBU technical documentation and Internet resources. Example resources include technical documents and specifications, eXtensible Markup Language (XML) Schemas, classification schemes, XML Document Type Definitions (DTDs), namespaces, style sheets, media assets, and other types of resources produced or managed by the EBU.",
      "zh-CHS": "本文档描述了欧洲广播联盟（EBU）的统一资源名（URN）命名空间，用于命名EBU技术文档和Internet资源中定义的持久资源。示例资源包括技术文档和规范、可扩展标记语言（XML）模式、分类方案、XML文档类型定义（DTD）、名称空间、样式表、媒体资产以及EBU生成或管理的其他类型的资源。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Specification Template ..........................................2\n3. Examples ........................................................4\n4. Namespace Considerations ........................................4\n5. Community Considerations ........................................5\n6. Security Considerations .........................................6\n7. IANA Considerations .............................................6\n8. Normative References ............................................6",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The European Broadcasting Union (EBU) is the largest non-for profit professional association of broadcasters worldwide and was established in 1950. The Union has more than 70 active members in 55 countries in Europe, North Africa, and the Middle East, and more than 40 associate members in 25 countries further afield. The EBU negotiates broadcasting rights for major sport events, operates the Eurovision and Euroradio networks, organizes program exchanges and co-productions, and provides other operational and legal support. It provides technical advice to its members and favors the adoption of standardized solutions in broadcast systems from content ingest to end-user delivery. EBU activities cover traditional broadcast and new delivery medias, such as the Internet, for which a growing number of resources are being developed.",
      "zh-CHS": "欧洲广播联盟（EBU）成立于1950年，是全球最大的非营利专业广播协会。欧盟在欧洲、北非和中东55个国家拥有70多个活跃成员，在25个更远的国家拥有40多个准成员。EBU谈判重大体育赛事的转播权，运营欧洲电视和欧洲广播网络，组织节目交换和联合制作，并提供其他运营和法律支持。它向其成员提供技术建议，并支持在广播系统中采用从内容接收到最终用户交付的标准化解决方案。EBU活动包括传统广播和新的交付媒体，如互联网，正在为其开发越来越多的资源。"
    },
    {
      "indent": 3,
      "text": "The EBU would like to assign unique, permanent, location-independent names based on URNs for some resources it produces or manages.",
      "zh-CHS": "EBU希望基于URN为其生成或管理的某些资源分配唯一、永久、位置独立的名称。"
    },
    {
      "indent": 3,
      "text": "This namespace specification is for a formal namespace.",
      "zh-CHS": "此名称空间规范适用于正式名称空间。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "zh-CHS": "2. 规范模板"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 6,
      "text": "\"ebu\"",
      "zh-CHS": "“ebu”"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "Version: 1 Date: 2007-02-20",
      "zh-CHS": "版本：1日期：2007-02-20"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "Name: Jean-Pierre Evain Title: Senior Engineer Affiliation: European Broadcasting Union (EBU) Address: Ancienne Route 17a CH-1218 Geneva SWITZERLAND Phone: +41 22 717 2734 Email: evain@ebu.ch",
      "zh-CHS": "姓名：Jean-Pierre Evain职务：高级工程师所属单位：欧洲广播联盟（EBU）地址：Ancienne Route 17a CH-1218瑞士日内瓦电话：+41 22 717 2734电子邮件：evain@ebu.ch"
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "zh-CHS": "结构声明："
    },
    {
      "indent": 6,
      "text": "URNs assigned by the EBU will have the following hierarchical structure based on the organizational structure of the EBU resources:",
      "zh-CHS": "根据EBU资源的组织结构，EBU分配的URN将具有以下层次结构："
    },
    {
      "indent": 25,
      "text": "urn:ebu:{category}:{string}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "where \"{category}\" is a US-ASCII string that conforms to the syntax of the <NID>, and \"{string}\" is a US-ASCII string that conforms to the syntax of the <NSS> [RFC2141].",
      "zh-CHS": "其中，{category}是符合<NID>语法的US-ASCII字符串，{string}是符合<NSS>[RFC2141]语法的US-ASCII字符串。"
    },
    {
      "indent": 6,
      "text": "The individual URNs will be assigned by the EBU through the development process of EBU resources.",
      "zh-CHS": "EBU将通过EBU资源的开发过程分配各个URN。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "More information on the EBU and relevant technical activities can be found at http://www.ebu.ch/metadata.",
      "zh-CHS": "有关EBU和相关技术活动的更多信息，请访问http://www.ebu.ch/metadata."
    },
    {
      "indent": 3,
      "text": "Identifier and namespace uniqueness considerations:",
      "zh-CHS": "标识符和命名空间唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "The EBU understands the vital necessity for uniqueness and will establish unique identifiers and namespaces under the authority of its metadata expert group under the auspices of the EBU Production Management Committee to prevent re-assignation of existing identifiers and namespaces.",
      "zh-CHS": "EBU了解唯一性的重要性，并将在其元数据专家组的授权下，在EBU生产管理委员会的主持下建立唯一标识符和名称空间，以防止现有标识符和名称空间的重新分配。"
    },
    {
      "indent": 3,
      "text": "Identifier and namespace persistence considerations:",
      "zh-CHS": "标识符和命名空间持久性注意事项："
    },
    {
      "indent": 6,
      "text": "The European Broadcasting Union (EBU) shall ensure the accessibility and persistence of all resources that are officially assigned URNs by the organization, in particular upon suitable delegation at the level of \"{category}\"s, and persistence of category assignment.",
      "zh-CHS": "欧洲广播联盟（EBU）应确保本组织正式分配给URN的所有资源的可访问性和持久性，特别是在“{category}”级别的适当授权和持久性类别分配的情况下。"
    },
    {
      "indent": 3,
      "text": "Process of identifier and namespace assignment:",
      "zh-CHS": "标识符和命名空间分配过程："
    },
    {
      "indent": 6,
      "text": "The assignment of identifiers and namespaces is fully controlled and managed by the European Broadcasting Union (EBU).",
      "zh-CHS": "标识符和名称空间的分配完全由欧洲广播联盟（EBU）控制和管理。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 6,
      "text": "The owner will develop and maintain \"URN catalogues\" that map all assigned URNs to Uniform Resource Locators (URLs) specifically to enable Web-based resolution of named resources. In the future, an interactive online resolution system may be developed to automate this process.",
      "zh-CHS": "所有者将开发和维护“URN目录”，将所有分配的URN映射到统一资源定位器（URL），以实现基于Web的命名资源解析。将来，可能会开发一个交互式在线解决系统来自动化这一过程。"
    },
    {
      "indent": 6,
      "text": "The owner will authorize additional resolution services as appropriate.",
      "zh-CHS": "业主将酌情授权额外的解决服务。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "The \"{category}\" is case-insensitive. Thus, the portion of the URN:",
      "zh-CHS": "“{category}”不区分大小写。因此，URN的部分："
    },
    {
      "indent": 19,
      "text": "urn:ebu:{category}:",
      "zh-CHS": "urn:ebu:{category}:"
    },
    {
      "indent": 6,
      "text": "is case-insensitive for matches up to {category}. The remainder of the identifier shall be considered case-sensitive; hence, URNs are only lexically equivalent if they are also lexically identical in the remaining \"{string}\" field.",
      "zh-CHS": "对于{category}以下的匹配项不区分大小写。标识符的其余部分应视为区分大小写；因此，只有在剩余的“{string}”字段中URN在词汇上相同时，URN才在词汇上等效。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "zh-CHS": "没有特别考虑。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "The owner will develop and maintain URN catalogues. The presence of a URN in a catalogue indicates that it is valid. Validation shall more particularly be done by a syntax grammar corresponding to each \"{category}\".",
      "zh-CHS": "业主将开发和维护URN目录。目录中有瓮表明它是有效的。尤其应通过与每个“{category}”对应的语法进行验证。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "Global",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are presented for pedagogical reasons only.",
      "zh-CHS": "以下示例不能保证是真实的。它们仅出于教学方面的原因。"
    },
    {
      "indent": 6,
      "text": "urn:ebu:metadata:pmeta_2007\nurn:ebu:metadata-cs:EscortCS_2007",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "4. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "The EBU develops and maintains metadata schemas and classification schemes, which are made publicly available from http://www.ebu.ch/metadata for integration or cross reference in third party implementations, technical specifications and standards. Reference to the urn:ebu namespace shall be a guarantee of open access and quality.",
      "zh-CHS": "EBU开发并维护元数据模式和分类方案，这些方案可从http://www.ebu.ch/metadata 用于第三方实施、技术规范和标准中的集成或交叉引用。对urn:ebu名称空间的引用应保证开放访问和质量。"
    },
    {
      "indent": 3,
      "text": "Furthermore, the value of well-defined namespaces is fully recognized including for versioning purposes, which will be facilitated through the EBU maintenance of its own namespace dictated by the following rules.",
      "zh-CHS": "此外，定义良好的名称空间的价值得到充分认可，包括用于版本控制目的，这将通过以下规则规定的EBU维护其自己的名称空间来实现。"
    },
    {
      "indent": 3,
      "text": "URN assignment procedures:",
      "zh-CHS": "URN分配程序："
    },
    {
      "indent": 6,
      "text": "The individual URNs shall be assigned through the process of development of EBU resources by the European Broadcasting Union (EBU).",
      "zh-CHS": "各URN应通过欧洲广播联盟（EBU）开发EBU资源的过程进行分配。"
    },
    {
      "indent": 3,
      "text": "URN resolution/delegation:",
      "zh-CHS": "决议/授权："
    },
    {
      "indent": 6,
      "text": "The resolution and delegation shall be determined through the process of development of EBU resources by the European Broadcasting Union (EBU).",
      "zh-CHS": "决议和授权应通过欧洲广播联盟（EBU）开发EBU资源的过程确定。"
    },
    {
      "indent": 3,
      "text": "Type of resources to be identified:",
      "zh-CHS": "要确定的资源类型："
    },
    {
      "indent": 6,
      "text": "Types of resources to be identified include XML schema definition files, classification schemes, and identification systems.",
      "zh-CHS": "要标识的资源类型包括XML模式定义文件、分类方案和标识系统。"
    },
    {
      "indent": 3,
      "text": "Type of services to be supported:",
      "zh-CHS": "要支持的服务类型："
    },
    {
      "indent": 6,
      "text": "Types of services supported include controlled term lookup in classification schemes and resolution of IDs in identification systems.",
      "zh-CHS": "支持的服务类型包括分类方案中的受控术语查找和识别系统中的ID解析。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "zh-CHS": "5. 社区考虑"
    },
    {
      "indent": 3,
      "text": "The EBU traditionally addresses the broadcasting community, but its resources are made available to all interested parties.",
      "zh-CHS": "EBU传统上面向广播界，但其资源可供所有相关方使用。"
    },
    {
      "indent": 3,
      "text": "Communities involved in offering content over new IP-based delivery medias such as via the Internet and mobile communication networks, or using IP infrastructures and Service-Oriented Architectures are welcome to use EBU resources. Metadata and content identifiers, for which the EBU mainly needs the urn:ebu namespace, play a key role in content search and retrieval, end-to-end from content commissioning to user delivery.",
      "zh-CHS": "通过互联网和移动通信网络等新的基于IP的交付媒体提供内容，或使用IP基础设施和面向服务的体系结构的社区欢迎使用EBU资源。元数据和内容标识符（EBU主要需要urn:EBU名称空间）在内容搜索和检索（从内容调试到用户交付的端到端）中起着关键作用。"
    },
    {
      "indent": 3,
      "text": "Web services, search engines, and the semantic web are among the core technologies that the EBU is now exploiting to access users in a multimedia multi-platform connected world.",
      "zh-CHS": "Web服务、搜索引擎和语义Web是EBU现在用来访问多媒体多平台互联世界中用户的核心技术之一。"
    },
    {
      "indent": 3,
      "text": "Potential beneficiary developing communities include:",
      "zh-CHS": "潜在的受益发展中社区包括："
    },
    {
      "indent": 6,
      "text": "a) Implementers and users of EBU resources.",
      "zh-CHS": "a) EBU资源的实现者和用户。"
    },
    {
      "indent": 9,
      "text": "Resources that comply with EBU specifications (including schemas, instance documents that comply with EBU schemas, and the EBU default Classification Schemes) may, by means of the registered namespace, become exposed to the general Internet and gain from the interoperability benefits of the Internet at large.",
      "zh-CHS": "符合EBU规范的资源（包括模式、符合EBU模式的实例文档和EBU默认分类模式）可以通过注册的名称空间向通用Internet公开，并从Internet的互操作性好处中获益。"
    },
    {
      "indent": 6,
      "text": "b) Implementers of other specifications that incorporate part or all of available EBU resources.",
      "zh-CHS": "b) 包含部分或全部可用EBU资源的其他规范的实现者。"
    },
    {
      "indent": 9,
      "text": "URNs used to identify EBU resources may be used to enable their inclusion in, and enhancement of, other specifications while maintaining, to a certain degree, interoperability with the EBU (see a) above).",
      "zh-CHS": "用于识别EBU资源的URN可用于将其包含在其他规范中并增强其他规范，同时在一定程度上保持与EBU的互操作性（见上文a）。"
    },
    {
      "indent": 6,
      "text": "c) Implementers of other semantically related specifications that do not directly incorporate part or all of EBU resources.",
      "zh-CHS": "c) 其他语义相关规范的实现者，这些规范不直接包含部分或全部EBU资源。"
    },
    {
      "indent": 9,
      "text": "URNs used to identify EBU resources, such as identifiers of terms within default Classification Schemes, may enable interoperation with other semantically determined specifications (including present and future metadata/resource description and ontology specifications) of relevance to EBU implementation communities (see a) and b) above).",
      "zh-CHS": "用于标识EBU资源（例如默认分类方案中的术语标识符）的URN可实现与其他语义确定规范（包括当前和未来的元数据/资源描述和本体规范）的互操作，这些规范与EBU实现社区相关（见上文a）和b）。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The portion of the URN, urn:ebu:{category}:, is case-insensitive for matches up to {category}.",
      "zh-CHS": "URN的部分URN:ebu:{category}：，对于{category}以下的匹配项不区分大小写。"
    },
    {
      "indent": 3,
      "text": "Otherwise, there are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "否则，除了通常与一般URN的使用和解析相关的安全考虑之外，没有其他安全考虑。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the formal URN namespace 'ebu' (38) to the EBU within the IANA registry of URN NIDs, according to the registration template in Section 2.",
      "zh-CHS": "根据第2节中的注册模板，IANA已将正式的URN名称空间“ebu”（38）注册到URN NID的IANA注册中心内的ebu。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "zh-CHS": "8. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[RFC2141]Moats，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Jean-Pierre Evain European Broadcasting Union Technical Department L'ancienne route 17A CH-1218 Grand-Saconnex (GE) SWITZERLAND",
      "zh-CHS": "Jean-Pierre Evain欧洲广播联盟技术部L'Anciene 17A路CH-1218 Grand Saconnex（GE）瑞士"
    },
    {
      "indent": 3,
      "text": "Phone: +41 22 717 2734\nFax:   +41 22 74 74 734\nEMail: evain@ebu.ch",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "zh-CHS": "版权所有（C）IETF信托基金（2008年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    }
  ]
}