{
  "title": {
    "text": "RFC 5593: Internet Message Access Protocol (IMAP) - URL Access Identifier Extension",
    "zh-CHS": "RFC 5593"
  },
  "number": 5593,
  "created_at": "2021-11-08 03:07:11.124344+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            N. Cook\nRequest for Comments: 5593                                     Cloudmark\nUpdates: 5092                                                  June 2009\nCategory: Standards Track",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Internet Message Access Protocol (IMAP) - URL Access Identifier Extension",
      "zh-CHS": "Internet消息访问协议（IMAP）-URL访问标识符扩展"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托在本文件出版之日生效的与IETF文件有关的法律规定的约束(http://trustee.ietf.org/license-info). 请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The existing IMAP URL specification (RFC 5092) lists several <access> identifiers and <access> identifier prefixes that can be used to restrict access to URLAUTH-generated URLs. However, these identifiers do not provide facilities for new services such as streaming. This document proposes a set of new <access> identifiers as well as an IANA mechanism to register new <access> identifiers for future applications.",
      "zh-CHS": "现有的IMAP URL规范（RFC 5092）列出了几个<access>标识符和<access>标识符前缀，可用于限制对URLAUTH生成的URL的访问。但是，这些标识符不为流式传输等新服务提供便利。本文档提出了一组新的<access>标识符以及一种IANA机制，用于为未来的应用程序注册新的<access>标识符。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 5092.",
      "zh-CHS": "本文档更新了RFC 5092。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions Used in This Document ...............................2\n3. Additional Authorized Access Identifiers ........................3\n   3.1. Existing Access Identifiers ................................3\n   3.2. Requirement for Additional Access Identifiers ..............3\n   3.3. Additional Access Identifier Specification .................4\n   3.4. Defining an Access Identifier for Streaming ................5\n4. Formal Syntax ...................................................5\n5. Acknowledgements ................................................6\n6. IANA Considerations .............................................6\n   6.1. Access Identifier Registration Template ....................7\n   6.2. Stream Application Registration ............................7\n   6.3. Submit Application Registration ............................8\n   6.4. User Application Registration ..............................8\n   6.5. Authuser Application Registration ..........................9\n   6.6. Anonymous Application Registration .........................9\n7. Security Considerations .........................................9\n8. References .....................................................10\n   8.1. Normative References ......................................10\n   8.2. Informative References ....................................10",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The IMAP URL specification [RFC5092] provides a way to carry authorization information in IMAP URLs. Several authorization <access> identifiers are specified in the document that allow URLAUTH-authorized URLs to be used only by anonymous users, authenticated users, or message submission entities. However, there is no mechanism defined to create new <access> identifiers, and overloading the existing mechanisms has security as well as administrative implications.",
      "zh-CHS": "IMAP URL规范[RFC5092]提供了一种在IMAP URL中携带授权信息的方法。文档中指定了多个授权<access>标识符，这些标识符允许URLAUTH授权URL仅由匿名用户、经过身份验证的用户或消息提交实体使用。但是，没有定义任何机制来创建新的<access>标识符，并且重载现有机制会带来安全性和管理方面的影响。"
    },
    {
      "indent": 3,
      "text": "This document describes a new <access> identifier, \"stream\", to be used by message streaming entities (as described in [STREAMING]), and defines an IANA registration template, which can be used to register new <access> identifiers for future applications. IANA definitions for the existing access identifiers and prefixes from RFC 5092 are also defined in this document -- this document updates RFC 5092 and should be taken as the master in the event of any differences or discrepancies.",
      "zh-CHS": "本文档描述了一个新的<access>标识符“stream”，将由消息流实体使用（如[streaming]中所述），并定义了一个IANA注册模板，该模板可用于注册新的<access>标识符以供将来的应用。本文件中还定义了RFC 5092中现有访问标识符和前缀的IANA定义——本文件更新了RFC 5092，如果存在任何差异或不一致，应将其视为主文件。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "2. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "In examples, \"C:\" and \"S:\" indicate lines sent by the client and server, respectively. If a single \"C:\" or \"S:\" label applies to multiple lines, then some of the line breaks between those lines are for editorial clarity only and may not be part of the actual protocol exchange.",
      "zh-CHS": "在示例中，“C:”和“S:”分别表示客户端和服务器发送的行。如果单个“C:”或“S:”标签适用于多行，则这些行之间的一些换行符仅用于编辑清晰性，可能不是实际协议交换的一部分。"
    },
    {
      "indent": 0,
      "text": "3. Additional Authorized Access Identifiers",
      "section_title": true,
      "zh-CHS": "3. 附加授权访问标识符"
    },
    {
      "indent": 0,
      "text": "3.1. Existing Access Identifiers",
      "section_title": true,
      "zh-CHS": "3.1. 现有访问标识符"
    },
    {
      "indent": 3,
      "text": "The IMAP URL specification [RFC5092] specifies the following authorized <access> identifiers:",
      "zh-CHS": "IMAP URL规范[RFC5092]指定了以下授权<access>标识符："
    },
    {
      "indent": 3,
      "text": "o \"authuser\" - Indicates that use of this URL is limited to authenticated IMAP sessions that are logged in as any non-anonymous user.",
      "zh-CHS": "o “authuser”-表示此URL的使用仅限于以任何非匿名用户身份登录的经过身份验证的IMAP会话。"
    },
    {
      "indent": 3,
      "text": "o \"anonymous\" - Indicates that use of this URL is not restricted by session authorization identity.",
      "zh-CHS": "o “匿名”-表示此URL的使用不受会话授权标识的限制。"
    },
    {
      "indent": 3,
      "text": "Additionally, the following <access> identifier prefixes are defined in [RFC5092]:",
      "zh-CHS": "此外，[RFC5092]中定义了以下<access>标识符前缀："
    },
    {
      "indent": 3,
      "text": "o \"submit+\" - Followed by a userid, indicates that only a userid authorized as a message submission entity on behalf of the specified userid is permitted to use this URL.",
      "zh-CHS": "o “submit+”-后跟用户ID，表示仅允许代表指定用户ID授权为消息提交实体的用户ID使用此URL。"
    },
    {
      "indent": 3,
      "text": "o \"user+\" - Followed by a userid, indicates that use of this URL is limited to IMAP sessions that are logged in as the specified userid.",
      "zh-CHS": "o “user+”-后跟用户ID，表示此URL的使用仅限于以指定用户ID登录的IMAP会话。"
    },
    {
      "indent": 0,
      "text": "3.2. Requirement for Additional Access Identifiers",
      "section_title": true,
      "zh-CHS": "3.2. 对附加访问标识符的要求"
    },
    {
      "indent": 3,
      "text": "The existing <access> identifiers are suitable for user-based authorization, but only the \"submit+\" <access> identifier prefix is suitable for entities acting on behalf of a user. Generic support for external entities acting on behalf of users is required for new services such as streaming [STREAMING].",
      "zh-CHS": "现有的<access>标识符适用于基于用户的授权，但只有“submit+”<access>标识符前缀适用于代表用户的实体。对于流媒体[流媒体]等新服务，需要为代表用户的外部实体提供通用支持。"
    },
    {
      "indent": 3,
      "text": "The \"submit+\" <access> identifier prefix is not suitable for use as a general mechanism to grant access to entities acting on behalf of users, for reasons that include:",
      "zh-CHS": "“submit+”<access>标识符前缀不适合用作向代表用户的实体授予访问权限的一般机制，原因包括："
    },
    {
      "indent": 3,
      "text": "o Security - The IMAP server maintains a list of submission server entities that are entitled to retrieve IMAP URLs specifying the \"submit+\" <access> identifier prefix. If this list is extended to include the set of all external entities that could act on behalf of users, then the attack surface would be increased.",
      "zh-CHS": "o 安全性-IMAP服务器维护有权检索IMAP URL的提交服务器实体列表，指定“提交+”<access>标识符前缀。如果将此列表扩展为包含可代表用户行事的所有外部实体的集合，则攻击面将增加。"
    },
    {
      "indent": 3,
      "text": "o Administration - When URLAUTH-style IMAP URLs are presented to an IMAP server by entities acting on behalf of users, the server administrator has no way of determining the intended use of that URL from the server logs.",
      "zh-CHS": "o 管理-当代表用户的实体将URLAUTH样式的IMAP URL呈现给IMAP服务器时，服务器管理员无法从服务器日志中确定该URL的预期用途。"
    },
    {
      "indent": 3,
      "text": "o Resourcing - Without a mechanism to distinguish between the application for which an IMAP URL is to be used, the IMAP server has no way to prioritize resources for particular applications. For example, the server could prioritize \"submit+\" URL fetch requests over other access identifiers.",
      "zh-CHS": "o 资源分配-如果没有一种机制来区分要使用IMAP URL的应用程序，IMAP服务器就无法对特定应用程序的资源进行优先级排序。例如，服务器可以将“提交+”URL获取请求优先于其他访问标识符。"
    },
    {
      "indent": 0,
      "text": "3.3. Additional Access Identifier Specification",
      "section_title": true,
      "zh-CHS": "3.3. 附加访问标识符规范"
    },
    {
      "indent": 3,
      "text": "The previous section establishes that additional access identifiers are required to support applications, such as streaming [STREAMING], that require entities to retrieve URLAUTH URLs on behalf of users. This section describes the scope and meaning of any additional <access> identifiers that are created.",
      "zh-CHS": "上一节确定了需要额外的访问标识符来支持应用程序，例如流[streaming]，这些应用程序要求实体代表用户检索URLAUTH URL。本节描述创建的任何附加<access>标识符的范围和含义。"
    },
    {
      "indent": 3,
      "text": "Additional <access> identifiers MUST take one of two forms (Section 4 gives the formal ABNF syntax):",
      "zh-CHS": "附加<access>标识符必须采用两种形式之一（第4节给出了ABNF的正式语法）："
    },
    {
      "indent": 3,
      "text": "o <access> identifier - The name of the application, e.g., \"exampleapp\".",
      "zh-CHS": "o <access>identifier—应用程序的名称，例如“exampleapp”。"
    },
    {
      "indent": 3,
      "text": "o <access> identifier prefix - The name of the application, e.g., \"exampleapp3\", followed by a \"+\" and then a userid. For example, consider \"exampleapp3+testuser\".",
      "zh-CHS": "o <access>标识符前缀-应用程序的名称，例如，“exampleapp3”，后跟“+”和用户ID。例如，考虑“ExpultApp3+TestPuthor”。"
    },
    {
      "indent": 3,
      "text": "Note that an <access> identifier name can also be registered as an <access> identifier prefix. However, this would require 2 separate IANA registrations.",
      "zh-CHS": "请注意，<access>标识符名称也可以注册为<access>标识符前缀。然而，这需要两个独立的IANA注册。"
    },
    {
      "indent": 3,
      "text": "In both cases, the semantics are the same as those for \"submit+\", i.e., the <access> identifier or <access> identifier prefix (which MUST be followed by a userid) indicates that only a userid authorized as an application entity for the specified application is permitted to use this URL. In the case of <access> identifier prefixes, the IMAP server SHALL NOT validate the specified userid but MUST validate that the IMAP session has an authorization identity that is authorized as an application entity for the specified application.",
      "zh-CHS": "在这两种情况下，语义与“submit+”的语义相同，即<access>标识符或<access>标识符前缀（后面必须跟一个userid）表示只有授权为指定应用程序的应用程序实体的userid才允许使用此URL。对于<access>标识符前缀，IMAP服务器不应验证指定的用户ID，但必须验证IMAP会话是否具有作为指定应用程序的应用程序实体授权的授权标识。"
    },
    {
      "indent": 3,
      "text": "The application entity itself MAY choose to perform validation on any specified userid before attempting to retrieve the URL.",
      "zh-CHS": "在尝试检索URL之前，应用程序实体本身可以选择对任何指定的用户ID执行验证。"
    },
    {
      "indent": 3,
      "text": "The authorization granted by any <access> identifiers used as described above is self-describing, and so requires that the IMAP server provide an extensible mechanism for associating userids with new applications. For example, imagine a new application, \"foo\", is created that requires application entities to retrieve URLs on behalf of users. In this case, the IMAP server would need to provide a way to register the new application \"foo\" and to associate the set of userids to be used by those entities with the application \"foo\". Any attempt to retrieve URLs containing the <access> identifier \"foo\" would be checked for authorization against the list of userids associated with the application \"foo\".",
      "zh-CHS": "如上所述使用的任何<access>标识符所授予的授权都是自描述的，因此需要IMAP服务器提供一种可扩展的机制，用于将用户ID与新应用程序关联起来。例如，假设创建了一个新的应用程序“foo”，它要求应用程序实体代表用户检索URL。在这种情况下，IMAP服务器需要提供一种方法来注册新的应用程序“foo”，并将这些实体使用的用户ID集与应用程序“foo”关联起来。任何检索包含<access>标识符“foo”的URL的尝试都将根据与应用程序“foo”关联的用户ID列表进行授权检查。"
    },
    {
      "indent": 3,
      "text": "Section 6 provides the template required to register new <access> identifiers or prefixes with IANA.",
      "zh-CHS": "第6节提供了向IANA注册新的<access>标识符或前缀所需的模板。"
    },
    {
      "indent": 0,
      "text": "3.4. Defining an Access Identifier for Streaming",
      "section_title": true,
      "zh-CHS": "3.4. 定义流的访问标识符"
    },
    {
      "indent": 3,
      "text": "One application that makes use of URLAUTH-authorized URLs is that of streaming multimedia files that are received as internet-messaging attachments. This application is described in [STREAMING].",
      "zh-CHS": "使用URLAUTH授权URL的一个应用程序是作为internet消息附件接收的流媒体文件。此应用程序在[STREAMING]中进行了描述。"
    },
    {
      "indent": 3,
      "text": "See Section 6.2 for the IANA registration template for the \"stream\" <access> identifier.",
      "zh-CHS": "有关“流”<access>标识符的IANA注册模板，请参见第6.2节。"
    },
    {
      "indent": 0,
      "text": "4. Formal Syntax",
      "section_title": true,
      "zh-CHS": "4. 形式语法"
    },
    {
      "indent": 3,
      "text": "The following syntax specification uses the Augmented Backus-Naur Form (ABNF) notation as specified in [RFC5234].",
      "zh-CHS": "以下语法规范使用[RFC5234]中指定的增广巴科斯诺尔形式（ABNF）表示法。"
    },
    {
      "indent": 3,
      "text": "Except as noted otherwise, all alphabetic characters are case-insensitive. The use of upper- or lower-case characters to define token strings is for editorial clarity only. Implementations MUST accept these strings in a case-insensitive fashion.",
      "zh-CHS": "除非另有说明，否则所有字母字符都不区分大小写。使用大写或小写字符定义标记字符串仅用于编辑清晰性。实现必须以不区分大小写的方式接受这些字符串。"
    },
    {
      "indent": 3,
      "text": "The ABNF specified below updates the formal syntax of <access> identifiers as defined in IMAP URL [RFC5092].",
      "zh-CHS": "下面指定的ABNF更新了IMAP URL[RFC5092]中定义的<access>标识符的正式语法。"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as authors of the code. All rights reserved.",
      "zh-CHS": "版权所有（c）2009 IETF信托基金和被确定为代码作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:",
      "zh-CHS": "在满足以下条件的情况下，允许以源代码和二进制格式重新分发和使用，无论是否修改："
    },
    {
      "indent": 3,
      "text": "- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.",
      "zh-CHS": "- 源代码的重新分发必须保留上述版权声明、此条件列表和以下免责声明。"
    },
    {
      "indent": 3,
      "text": "- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.",
      "zh-CHS": "- 以二进制形式重新分发时，必须在分发时提供的文档和/或其他材料中复制上述版权声明、本条件列表和以下免责声明。"
    },
    {
      "indent": 3,
      "text": "- Neither the name of Internet Society, IETF or IETF Trust, nor the names of specific contributors, may be used to endorse or promote products derived from this software without specific prior written permission.",
      "zh-CHS": "- 未经事先书面许可，不得使用互联网协会、IETF或IETF Trust的名称或特定贡献者的名称来认可或推广源自本软件的产品。"
    },
    {
      "indent": 3,
      "text": "THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
      "zh-CHS": "本软件由版权所有人和贡献者提供，仅限于以下内容，对适销性和特定用途适用性的默示保证不承担任何责任。在任何情况下，版权所有人或贡献者均不对任何直接、间接、偶然、特殊、惩戒性或后果性损害（包括但不限于替代商品或服务的采购；使用、数据或利润的损失；或业务中断）负责，无论是在合同中还是在任何责任理论下，严格责任，或因使用本软件而产生的侵权行为（包括疏忽或其他），即使告知可能发生此类损害。"
    },
    {
      "indent": 9,
      "text": "application = 1*(ALPHA/DIGIT)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "access      =/ application / (application \"+\" enc-user)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "zh-CHS": "5. 致谢"
    },
    {
      "indent": 3,
      "text": "This document was inspired by discussions in the Lemonade Working Group.",
      "zh-CHS": "本文件受柠檬水工作组讨论的启发。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA created a new registry for IMAP URLAUTH access identifiers and prefixes.",
      "zh-CHS": "IANA为IMAP URLAUTH访问标识符和前缀创建了一个新的注册表。"
    },
    {
      "indent": 3,
      "text": "Access identifiers and prefixes MUST be registered using the \"IETF Review\" policy [RFC5226]. This section gives the IANA registration entries for the existing access identifiers and prefixes from RFC 5092 as well as the entry for the \"stream\" application.",
      "zh-CHS": "必须使用“IETF审查”策略[RFC5226]注册访问标识符和前缀。本节给出了RFC 5092中现有访问标识符和前缀的IANA注册条目以及“流”应用程序的条目。"
    },
    {
      "indent": 0,
      "text": "6.1. Access Identifier Registration Template",
      "section_title": true,
      "zh-CHS": "6.1. 访问标识符注册模板"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: IMAP URL Access Identifier Registration",
      "zh-CHS": "致：iana@iana.org主题：IMAP URL访问标识符注册"
    },
    {
      "indent": 3,
      "text": "Type:          [Either \"<access> identifier\" or\n                \"<access> identifier prefix\"]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Application: [Name of the application, e.g., \"stream\"]",
      "zh-CHS": "应用程序：[应用程序的名称，例如，“流”]"
    },
    {
      "indent": 3,
      "text": "Description: [A description of the application and its use of IMAP URLs]",
      "zh-CHS": "Description:[应用程序及其IMAP URL使用的说明]"
    },
    {
      "indent": 3,
      "text": "RFC Number: [Number of the RFC in which the application is defined]",
      "zh-CHS": "RFC编号：[定义应用程序的RFC编号]"
    },
    {
      "indent": 3,
      "text": "Contact: [Email and/or physical address to contact for additional information]",
      "zh-CHS": "联系人：[有关更多信息，请发送电子邮件和/或实际联系地址]"
    },
    {
      "indent": 0,
      "text": "6.2. Stream Application Registration",
      "section_title": true,
      "zh-CHS": "6.2. 流应用程序注册"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: IMAP URL Access Identifier Registration",
      "zh-CHS": "致：iana@iana.org主题：IMAP URL访问标识符注册"
    },
    {
      "indent": 3,
      "text": "Type:          <access> identifier",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Application: stream",
      "zh-CHS": "应用：流"
    },
    {
      "indent": 3,
      "text": "Description: Used by SIP Media Servers to retrieve attachments for streaming to email clients",
      "zh-CHS": "描述：由SIP媒体服务器用于检索附件，以便流式传输到电子邮件客户端"
    },
    {
      "indent": 3,
      "text": "RFC Number: RFC 5593",
      "zh-CHS": "RFC编号：RFC 5593"
    },
    {
      "indent": 3,
      "text": "Contact:       Neil Cook <neil.cook@noware.co.uk>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6.3. Submit Application Registration",
      "section_title": true,
      "zh-CHS": "6.3. 提交注册申请"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: IMAP URL Access Identifier Registration",
      "zh-CHS": "致：iana@iana.org主题：IMAP URL访问标识符注册"
    },
    {
      "indent": 3,
      "text": "Type:          <access> identifier prefix",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Application: submit",
      "zh-CHS": "申请：提交"
    },
    {
      "indent": 3,
      "text": "Description: Used by message submission entities to retrieve attachments to be included in submitted messages",
      "zh-CHS": "描述：邮件提交实体用于检索要包含在已提交邮件中的附件"
    },
    {
      "indent": 3,
      "text": "RFC Number: RFC 5593 and RFC 5092",
      "zh-CHS": "RFC编号：RFC 5593和RFC 5092"
    },
    {
      "indent": 3,
      "text": "Contact:       Lemonade WG <lemonade@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6.4. User Application Registration",
      "section_title": true,
      "zh-CHS": "6.4. 用户应用程序注册"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: IMAP URL Access Identifier Registration",
      "zh-CHS": "致：iana@iana.org主题：IMAP URL访问标识符注册"
    },
    {
      "indent": 3,
      "text": "Type:          <access> identifier prefix",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Application: user",
      "zh-CHS": "应用：用户"
    },
    {
      "indent": 3,
      "text": "Description: Used to restrict access to IMAP sessions that are logged in as the specified userid",
      "zh-CHS": "描述：用于限制对以指定用户ID登录的IMAP会话的访问"
    },
    {
      "indent": 3,
      "text": "RFC Number: RFC 5593 and RFC 5092",
      "zh-CHS": "RFC编号：RFC 5593和RFC 5092"
    },
    {
      "indent": 3,
      "text": "Contact:       Lemonade WG <lemonade@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6.5. Authuser Application Registration",
      "section_title": true,
      "zh-CHS": "6.5. Authuser应用程序注册"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: IMAP URL Access Identifier Registration",
      "zh-CHS": "致：iana@iana.org主题：IMAP URL访问标识符注册"
    },
    {
      "indent": 3,
      "text": "Type:          <access> identifier",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Application: authuser",
      "zh-CHS": "应用程序：authuser"
    },
    {
      "indent": 3,
      "text": "Description: Used to restrict access to IMAP sessions that are logged in as any non-anonymous user of that IMAP server",
      "zh-CHS": "描述：用于限制以该IMAP服务器的任何非匿名用户身份登录的IMAP会话的访问"
    },
    {
      "indent": 3,
      "text": "RFC Number: RFC 5593 and RFC 5092",
      "zh-CHS": "RFC编号：RFC 5593和RFC 5092"
    },
    {
      "indent": 3,
      "text": "Contact:       Lemonade WG <lemonade@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6.6. Anonymous Application Registration",
      "section_title": true,
      "zh-CHS": "6.6. 匿名申请注册"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: IMAP URL Access Identifier Registration",
      "zh-CHS": "致：iana@iana.org主题：IMAP URL访问标识符注册"
    },
    {
      "indent": 3,
      "text": "Type:          <access> identifier",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Application: anonymous",
      "zh-CHS": "应用：匿名"
    },
    {
      "indent": 3,
      "text": "Description: Indicates that use of this URL is not restricted by session authorization identity",
      "zh-CHS": "描述：表示此URL的使用不受会话授权标识的限制"
    },
    {
      "indent": 3,
      "text": "RFC Number: RFC 5593 and RFC 5092",
      "zh-CHS": "RFC编号：RFC 5593和RFC 5092"
    },
    {
      "indent": 3,
      "text": "Contact:       Lemonade WG <lemonade@ietf.org>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "zh-CHS": "7. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The extension to <access> identifiers specified in this document provides a mechanism for extending the semantics of the \"submit+\" <access> prefix to arbitrary applications. The use of such additional <access> identifiers and prefixes is primarily for security purposes, i.e., to prevent the overloading of \"submit+\" as a generic mechanism to allow entities to retrieve IMAP URLs on behalf of userids. Other than this, the security implications are identical to those discussed in Section 10.1 of IMAPURL [RFC5092].",
      "zh-CHS": "本文档中指定的<access>标识符扩展提供了一种机制，用于将“submit+”<access>前缀的语义扩展到任意应用程序。使用此类附加的<access>标识符和前缀主要是出于安全目的，即防止“submit+”过载，作为允许实体代表userid检索IMAP URL的通用机制。除此之外，安全含义与IMAPURL[RFC5092]第10.1节中讨论的内容相同。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5092] Melnikov, A., Ed., and C. Newman, \"IMAP URL Scheme\", RFC 5092, November 2007.",
      "zh-CHS": "[RFC5092]Melnikov，A.，Ed.，和C.Newman，“IMAP URL方案”，RFC 5092，2007年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "zh-CHS": "[RFC5234]Crocker，D.，Ed.，和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，2008年1月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 3,
      "text": "[STREAMING] Cook, N., \"Streaming Internet Messaging Attachments\", Work in Progress, May 2009.",
      "zh-CHS": "[流媒体]库克，N.，“流媒体互联网信息附件”，正在进行的工作，2009年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Neil L Cook Cloudmark",
      "zh-CHS": "尼尔·库克·克劳马克"
    },
    {
      "indent": 3,
      "text": "EMail: neil.cook@noware.co.uk",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}