{
  "title": {
    "text": "RFC 5367: Subscriptions to Request-Contained Resource Lists in the Session Initiation Protocol (SIP)",
    "zh-CHS": "RFC 5367"
  },
  "number": 5367,
  "created_at": "2021-11-11 12:30:47.047969+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       G. Camarillo\nRequest for Comments: 5367                                      Ericsson\nUpdates: 3265                                                 A.B. Roach\nCategory: Standards Track                                        Tekelec\n                                                                O. Levin\n                                                   Microsoft Corporation\n                                                            October 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 11,
      "text": "Subscriptions to Request-Contained Resource Lists in the Session Initiation Protocol (SIP)",
      "zh-CHS": "对会话启动协议（SIP）中包含的资源列表的请求的订阅"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document specifies a way to create subscription to a list of resources in SIP. This is achieved by including the list of resources in the body of a SUBSCRIBE request. Instead of having a subscriber send a SUBSCRIBE request for each resource individually, the subscriber defines the resource list, subscribes to it, and gets notifications about changes in the resources' states using a single SUBSCRIBE dialog.",
      "zh-CHS": "本文档指定了在SIP中创建资源列表订阅的方法。这是通过在订阅请求主体中包含资源列表来实现的。订阅者不是让订阅者分别为每个资源发送订阅请求，而是定义资源列表，订阅它，并使用单个订阅对话框获取有关资源状态更改的通知。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................2\n3. User Agent Client Procedures ....................................2\n   3.1. Response Handling ..........................................2\n   3.2. Subsequent SUBSCRIBE Requests ..............................3\n4. URI-List Document Format ........................................3\n5. Resource List Server Behavior ...................................4\n   5.1. Subsequent SUBSCRIBE Requests ..............................4\n6. Providing a URI to Manipulate a Resource List ...................4\n7. Example .........................................................5\n8. Security Considerations .........................................6\n9. IANA Considerations .............................................6\n   9.1. List-Management Purpose Parameter Value ....................6\n   9.2. recipient-list-subscribe Option-Tag ........................7\n10. Acknowledgments ................................................7\n11. Normative References ...........................................7",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "[RFC4662] specifies how to establish subscriptions to a homogeneous resource list in SIP (which is specified in [RFC3261]) and defines the procedures for getting notifications about changes in the state of the associated resources. Yet, list creation is outside the scope of [RFC4662].",
      "zh-CHS": "[RFC4662]指定如何在SIP（在[RFC3261]中指定）中建立对同质资源列表的订阅，并定义获取相关资源状态更改通知的过程。然而，列表创建超出了[RFC4662]的范围。"
    },
    {
      "indent": 3,
      "text": "This document specifies a way to create a list with a set of resources and subscribe to it using a single SIP request. This is achieved by including the list of resources (as defined in [RFC5363]) in the body of the SUBSCRIBE request.",
      "zh-CHS": "本文档指定了一种使用一组资源创建列表并使用单个SIP请求订阅该列表的方法。这是通过将资源列表（如[RFC5363]中所定义）包含在订阅请求主体中来实现的。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. User Agent Client Procedures",
      "section_title": true,
      "zh-CHS": "3. 用户代理客户端过程"
    },
    {
      "indent": 3,
      "text": "A UAC (User Agent Client) that wants to create a resource list and subscribe to it using the mechanism described in this document constructs a SUBSCRIBE request with at least one body, whose disposition is type \"recipient-list\" as defined in [RFC5363], that contains the URI list. Additionally, the UAC MUST include the 'recipient-list-subscribe' option-tag (which is registered with the IANA in Section 9) in a Require header field. The UAC MUST build the rest of the SUBSCRIBE request following the rules in [RFC3265].",
      "zh-CHS": "UAC（用户代理客户端）希望创建资源列表并使用本文档中描述的机制对其进行订阅，该UAC（用户代理客户端）构造了一个订阅请求，其中至少有一个主体，其处置类型为[RFC5363]中定义的“收件者列表”，其中包含URI列表。此外，UAC必须在Require头字段中包含“收件人列表订阅”选项标记（在第9节中向IANA注册）。UAC必须按照[RFC3265]中的规则构建订阅请求的其余部分。"
    },
    {
      "indent": 3,
      "text": "The UAC MUST support the \"rlmi+xml\" format defined in [RFC4662] and signal this by including \"rlmi+xml\" in the Accept header. The UAC MAY support additional formats and include them in the Accept header field of the SUBSCRIBE request.",
      "zh-CHS": "UAC必须支持[RFC4662]中定义的“rlmi+xml”格式，并通过在Accept标头中包含“rlmi+xml”来发出信号。UAC可以支持其他格式，并将其包含在订阅请求的Accept header字段中。"
    },
    {
      "indent": 0,
      "text": "3.1. Response Handling",
      "section_title": true,
      "zh-CHS": "3.1. 响应处理"
    },
    {
      "indent": 3,
      "text": "The status code in the response to the SUBSCRIBE request does not provide any information about whether or not the resource list server was able to successfully subscribe to the URIs in the URI list. The UAC obtains this information in the notifications sent by the server.",
      "zh-CHS": "订阅请求响应中的状态代码不提供任何有关资源列表服务器是否能够成功订阅URI列表中的URI的信息。UAC从服务器发送的通知中获取此信息。"
    },
    {
      "indent": 0,
      "text": "3.2. Subsequent SUBSCRIBE Requests",
      "section_title": true,
      "zh-CHS": "3.2. 后续订阅请求"
    },
    {
      "indent": 3,
      "text": "The previous sections have specified how to include a URI list in an initial SUBSCRIBE request to a resource list server in order to subscribe to the state of a set of resources. Once the subscription has been created and a dialog between the UAC and the resource list server has been established, the UAC can send subsequent SUBSCRIBE requests to, for example, extend the duration of the subscription.",
      "zh-CHS": "前面的部分已经指定了如何在资源列表服务器的初始订阅请求中包括URI列表，以便订阅一组资源的状态。创建订阅并在UAC和资源列表服务器之间建立对话后，UAC可以发送后续订阅请求，例如，延长订阅的持续时间。"
    },
    {
      "indent": 3,
      "text": "At this point, there are no semantics associated with resource-list bodies in subsequent SUBSCRIBE requests (although future extensions can define them). Therefore, UACs SHOULD NOT include resource-list bodies in subsequent SUBSCRIBE requests to a resource list server.",
      "zh-CHS": "此时，在后续的订阅请求中没有与资源列表体相关联的语义（尽管将来的扩展可以定义它们）。因此，UAC不应在对资源列表服务器的后续订阅请求中包含资源列表主体。"
    },
    {
      "indent": 6,
      "text": "Note that a difference between an initial SUBSCRIBE request and subsequent ones is that while the initial request is sent to the public URI of the resource list, subsequent ones are sent to the URI provided by the server when the dialog is established. Therefore, from the UAC's point of view, the resource identified by the former URI supports recipient-list bodies, while the resource identified by the latter does not support them.",
      "zh-CHS": "请注意，初始订阅请求和后续订阅请求之间的区别在于，虽然初始请求被发送到资源列表的公共URI，但在建立对话框时，后续订阅请求被发送到服务器提供的URI。因此，从UAC的角度来看，前一个URI标识的资源支持收件人列表主体，而后一个URI标识的资源不支持收件人列表主体。"
    },
    {
      "indent": 0,
      "text": "4. URI-List Document Format",
      "section_title": true,
      "zh-CHS": "4. URI列表文档格式"
    },
    {
      "indent": 3,
      "text": "[RFC5363] mandates that each URI-list services specification, such as the subscription service defined here, specifies the default format for the recipient-list bodies used within the particular service.",
      "zh-CHS": "[RFC5363]要求每个URI列表服务规范（如此处定义的订阅服务）指定特定服务中使用的收件人列表主体的默认格式。"
    },
    {
      "indent": 3,
      "text": "The default format for the recipient-list bodies for the subscription service defined in this document is the resource list format defined in [RFC4826]. UAs (User Agents) generating recipient-list bodies MUST support this format and MAY support other formats. Resource list servers able to handle recipient-list bodies MUST support this format and MAY support other formats.",
      "zh-CHS": "本文档中定义的订阅服务的收件人列表正文的默认格式为[RFC4826]中定义的资源列表格式。生成收件人列表主体的UAs（用户代理）必须支持此格式，并且可能支持其他格式。能够处理收件人列表正文的资源列表服务器必须支持此格式，并且可能支持其他格式。"
    },
    {
      "indent": 3,
      "text": "The Extensible Markup Language (XML) Configuration Access Protocol (XCAP) resource list document provides features, such as hierarchical lists and the ability to include entries by reference relative to the XCAP root URI, that are not needed by the subscription service defined here, which only needs to transfer a flat list of URIs between a UA and the resource list server. Therefore, when using the default resource list document, UAs SHOULD use flat lists (i.e., no hierarchical lists) and SHOULD NOT use <entry-ref> elements. A resource list server receiving a URI list with more information than what has just been described MAY discard all the extra information.",
      "zh-CHS": "可扩展标记语言（XML）配置访问协议（XCAP）资源列表文档提供了此处定义的订阅服务不需要的功能，例如分层列表和通过引用包含与XCAP根URI相关的条目的能力，它只需要在UA和资源列表服务器之间传输URI的平面列表。因此，当使用默认资源列表文档时，UAs应该使用平面列表（即，没有层次列表），并且不应该使用<entry ref>元素。资源列表服务器接收到比刚才描述的信息更多的URI列表时，可能会丢弃所有额外信息。"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows an example of a flat list that follows the resource list document.",
      "zh-CHS": "图1显示了资源列表文档后面的平面列表示例。"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<resource-lists xmlns=\"urn:ietf:params:xml:ns:resource-lists\"\n               xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n  <list>\n    <entry uri=\"sip:bill@example.com\" />\n    <entry uri=\"sip:joe@example.org\" />\n    <entry uri=\"sip:ted@example.net\" />\n  </list>\n</resource-lists>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 28,
      "text": "Figure 1: URI list",
      "zh-CHS": "图1:URI列表"
    },
    {
      "indent": 0,
      "text": "5. Resource List Server Behavior",
      "section_title": true,
      "zh-CHS": "5. 资源列表服务器行为"
    },
    {
      "indent": 3,
      "text": "Resource list servers that are able to receive and process SUBSCRIBE requests with a recipient-list body SHOULD include a 'recipient-list-subscribe' option-tag in a Supported header field when responding to OPTIONS requests.",
      "zh-CHS": "能够通过收件人列表主体接收和处理订阅请求的资源列表服务器在响应选项请求时，应在支持的标题字段中包含“收件人列表订阅”选项标记。"
    },
    {
      "indent": 3,
      "text": "On reception of a SUBSCRIBE request with a URI list, a resource list server that chooses to accept the \"rlmi+xml\" format MUST comply with [RFC4662] for creating the subscription and reporting the changes in the resources within the created dialog.",
      "zh-CHS": "在接收到带有URI列表的订阅请求时，选择接受“rlmi+xml”格式的资源列表服务器必须遵守[RFC4662]，以便在创建的对话框中创建订阅并报告资源中的更改。"
    },
    {
      "indent": 0,
      "text": "5.1. Subsequent SUBSCRIBE Requests",
      "section_title": true,
      "zh-CHS": "5.1. 后续订阅请求"
    },
    {
      "indent": 3,
      "text": "At this point, there are no semantics associated with resource-list bodies in subsequent SUBSCRIBE requests (although future extensions may define them). Therefore, a resource list server receiving a subsequent SUBSCRIBE request with a resource-list body, following standard SIP procedures, rejects it with a 415 (Unsupported Media Type) response.",
      "zh-CHS": "此时，在后续的订阅请求中没有与资源列表体相关联的语义（尽管将来的扩展可能会定义它们）。因此，按照标准SIP过程，接收具有资源列表主体的后续订阅请求的资源列表服务器使用415（不支持的媒体类型）响应拒绝该请求。"
    },
    {
      "indent": 0,
      "text": "6. Providing a URI to Manipulate a Resource List",
      "section_title": true,
      "zh-CHS": "6. 提供URI以操作资源列表"
    },
    {
      "indent": 3,
      "text": "A UAC can manipulate a resource list at a resource list server. The resource list server MAY provide a URI to manipulate the resource list associated with a subscription using the Call-Info header field in the NOTIFY request that establishes the subscription. The \"purpose\" parameter of the Call-Info header field MUST have a value of 'list-management', which we register with the IANA in Section 9. The following is an example of such a header field.",
      "zh-CHS": "UAC可以在资源列表服务器上操作资源列表。资源列表服务器可以提供URI，以使用建立订阅的通知请求中的Call Info报头字段来操纵与订阅相关联的资源列表。Call Info header字段的“purpose”参数必须具有“list management”值，我们在第9节向IANA注册了该值。以下是此类标题字段的示例。"
    },
    {
      "indent": 3,
      "text": "Call-Info: <http://xcap.example.com/your-list.xml>\n           ;purpose=list-management",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The lifetime of a resource list to be manipulated by the URI provided by the server is bundled to the lifetime of the subscription. That is, the resource list SHOULD be destroyed when the subscription expires or is otherwise terminated.",
      "zh-CHS": "由服务器提供的URI操作的资源列表的生存期绑定到订阅的生存期。也就是说，资源列表应该在订阅过期或终止时销毁。"
    },
    {
      "indent": 3,
      "text": "Section 7.1 of [RFC3265] does not list the Call-Info header field in the table of header fields that NOTIFY requests can carry. This document updates that table so that the Call-Info header field can be optionally included in NOTIFY requests.",
      "zh-CHS": "[RFC3265]第7.1节未列出通知请求可携带的标题字段表中的Call Info标题字段。此文档将更新该表，以便可以选择将Call Info header字段包括在NOTIFY请求中。"
    },
    {
      "indent": 0,
      "text": "7. Example",
      "section_title": true,
      "zh-CHS": "7. 实例"
    },
    {
      "indent": 3,
      "text": "The following is an example of a SUBSCRIBE request, which carries a URI list in its body, sent by a UAC to a resource list server.",
      "zh-CHS": "下面是SUBSCRIBE请求的示例，它的主体中包含一个URI列表，由UAC发送到资源列表服务器。"
    },
    {
      "indent": 3,
      "text": "SUBSCRIBE  sip:rls@example.com SIP/2.0\nVia: SIP/2.0/TCP terminal.example.com;branch=z9hG4bKwYb6QREiCL\nMax-Forwards: 70\nTo: RLS <sip:rls@example.com>\nFrom: <sip:adam@example.com>;tag=ie4hbb8t\nCall-ID: cdB34qLToC@terminal.example.com\nCSeq: 1 SUBSCRIBE\nContact: <sip:terminal.example.com>\nEvent: presence\nExpires: 7200\nRequire: recipient-list-subscribe\nSupported: eventlist\nAccept: application/cpim-pidf+xml\nAccept: application/rlmi+xml\nAccept: multipart/related\nAccept: multipart/signed\nAccept: multipart/encrypted\nContent-Type: application/resource-lists+xml\nContent-Disposition: recipient-list\nContent-Length: 337",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<resource-lists xmlns=\"urn:ietf:params:xml:ns:resource-lists\"\n               xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n  <list>\n    <entry uri=\"sip:bill@example.com\" />\n    <entry uri=\"sip:joe@example.org\" />\n    <entry uri=\"sip:ted@example.net\" />\n  </list>\n</resource-lists>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 24,
      "text": "Figure 2: SUBSCRIBE request",
      "zh-CHS": "图2：订阅请求"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The Security Considerations section of [RFC4662] discusses security issues related to resource list servers. Resource list servers accepting request-contained URI lists MUST also follow the security guidelines given in [RFC4662].",
      "zh-CHS": "[RFC4662]的安全注意事项部分讨论与资源列表服务器相关的安全问题。接受包含请求的URI列表的资源列表服务器还必须遵循[RFC4662]中给出的安全准则。"
    },
    {
      "indent": 3,
      "text": "\"Framework and Security Considerations for Session Initiation Protocol (SIP) URI-List Services\" [RFC5363] discusses issues related to SIP URI-list services. Given that a resource list server sending SUBSCRIBE requests to a set of users acts as a URI-list service, implementations of resource list servers that handle request-contained URI lists MUST follow the security-related rules in [RFC5363]. These rules include opt-in lists and mandatory authentication and authorization of clients.",
      "zh-CHS": "“会话初始化协议（SIP）URI列表服务的框架和安全注意事项”[RFC5363]讨论了与SIP URI列表服务相关的问题。假设向一组用户发送订阅请求的资源列表服务器充当URI列表服务，则处理包含请求的URI列表的资源列表服务器的实现必须遵循[RFC5363]中的安全相关规则。这些规则包括选择加入列表和客户端的强制身份验证和授权。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "zh-CHS": "9. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The following sections describe the IANA registration of the 'list-management' value for the \"purpose\" parameter of the Call-Info header field and the 'recipient-list-subscribe' SIP option-tag.",
      "zh-CHS": "以下各节描述呼叫信息头字段的“目的”参数和“收件人列表订阅”SIP选项标记的“列表管理”值的IANA注册。"
    },
    {
      "indent": 0,
      "text": "9.1. List-Management Purpose Parameter Value",
      "section_title": true,
      "zh-CHS": "9.1. 列表管理目的参数值"
    },
    {
      "indent": 3,
      "text": "This document defines the 'list-management' value for the \"purpose\" parameter of the Call-Info header field. A reference to this RFC (in double brackets) has been added to the existing \"purpose\" Call-Info parameter entry in the SIP Parameters registry, which currently looks as follows:",
      "zh-CHS": "本文档为Call Info header字段的“purpose”参数定义“list management”值。对该RFC的引用（在双括号中）已添加到SIP参数注册表中现有的“目的”呼叫信息参数条目中，该条目目前如下所示："
    },
    {
      "indent": 3,
      "text": "                                               Predefined\nHeader Field                  Parameter Name     Values     Reference\n----------------------------  ---------------   ---------   ---------\nCall-Info                     purpose             Yes       [RFC3261]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9.2. recipient-list-subscribe Option-Tag",
      "section_title": true,
      "zh-CHS": "9.2. 收件人列表订阅选项标记"
    },
    {
      "indent": 3,
      "text": "This document defines the SIP option tag \"recipient-list-subscribe\".",
      "zh-CHS": "本文档定义了SIP选项标记“收件人列表订阅”。"
    },
    {
      "indent": 3,
      "text": "The following row has been added to the \"Option Tags\" section of the SIP Parameter Registry:",
      "zh-CHS": "以下行已添加到SIP参数注册表的“选项标记”部分："
    },
    {
      "indent": 3,
      "text": "+--------------------------+----------------------------+-----------+\n| Name                     | Description                | Reference |\n+--------------------------+----------------------------+-----------+\n| recipient-list-subscribe | This option tag is used to | [RFC5367] |\n|                          | ensure that a server can   |           |\n|                          | process the recipient-list |           |\n|                          | body used in a SUBSCRIBE   |           |\n|                          | request.                   |           |\n+-------------------------------------------------------+-----------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "zh-CHS": "10. 致谢"
    },
    {
      "indent": 3,
      "text": "Cullen Jennings and Jonathan Rosenberg provided useful comments on this document.",
      "zh-CHS": "Cullen Jennings和Jonathan Rosenberg对此文件提供了有用的评论。"
    },
    {
      "indent": 0,
      "text": "11. Normative References",
      "section_title": true,
      "zh-CHS": "11. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[RFC3261]Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.，和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3265] Roach, A.B., \"Session Initiation Protocol (SIP)-Specific Event Notification\", RFC 3265, June 2002.",
      "zh-CHS": "[RFC3265]Roach，A.B.，“会话启动协议（SIP）-特定事件通知”，RFC3265，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4662] Roach, A.B., Campbell, B., and J. Rosenberg, \"A Session Initiation Protocol (SIP) Event Notification Extension for Resource Lists\", RFC 4662, August 2006.",
      "zh-CHS": "[RFC4662]Roach，A.B.，Campbell，B.，和J.Rosenberg，“资源列表的会话启动协议（SIP）事件通知扩展”，RFC 4662，2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4826] Rosenberg, J., \"Extensible Markup Language (XML) Formats for Representing Resource Lists\", RFC 4826, May 2007.",
      "zh-CHS": "[RFC4826]Rosenberg，J.，“用于表示资源列表的可扩展标记语言（XML）格式”，RFC 4826，2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5363] Camarillo, G. and A.B. Roach, \"Framework and Security Considerations for Session Initiation Protocol (SIP) URI-List Services\", RFC 5363, October 2008.",
      "zh-CHS": "[RFC5363]Camarillo，G.和A.B.Roach，“会话启动协议（SIP）URI列表服务的框架和安全注意事项”，RFC 5363，2008年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Gonzalo Camarillo Ericsson Hirsalantie 11 Jorvas 02420 Finland",
      "zh-CHS": "Gonzalo Camarillo Ericsson Hirsalantie 11 Jorvas 02420芬兰"
    },
    {
      "indent": 3,
      "text": "EMail: Gonzalo.Camarillo@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Adam Roach Tekelec 17210 Campbell Rd Ste 250 Dallas, TX 75252 USA",
      "zh-CHS": "美国德克萨斯州达拉斯市坎贝尔大道250号，邮编75252"
    },
    {
      "indent": 3,
      "text": "EMail: Adam.Roach@tekelec.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Orit Levin Microsoft Corporation One Microsoft Way Redmond, WA 98052",
      "zh-CHS": "奥利特·莱文微软公司华盛顿州雷德蒙微软大道一号，邮编：98052"
    },
    {
      "indent": 3,
      "text": "EMail: oritl@microsoft.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "zh-CHS": "版权所有（C）IETF信托基金（2008年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    }
  ]
}