{
  "title": {
    "text": "RFC 5384: The Protocol Independent Multicast (PIM) Join Attribute Format",
    "zh-CHS": "RFC 5384"
  },
  "number": 5384,
  "created_at": "2021-11-11 13:17:06.196579+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           A. Boers\nRequest for Comments: 5384                                   I. Wijnands\nCategory: Standards Track                                       E. Rosen\n                                                     Cisco Systems, Inc.\n                                                           November 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "The Protocol Independent Multicast (PIM) Join Attribute Format",
      "zh-CHS": "协议无关多播（PIM）连接属性格式"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2008 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2008 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/license-info)自本文件出版之日起生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "A \"Protocol Independent Multicast - Sparse Mode\" Join message sent by a given node identifies one or more multicast distribution trees that that node wishes to join. Each tree is identified by the combination of a multicast group address and a source address (where the source address is possibly a \"wild card\"). Under certain conditions it can be useful, when joining a tree, to specify additional information related to the construction of the tree. However, there has been no way to do so until now. This document describes a modification of the Join message that allows a node to associate attributes with a particular tree. The attributes are encoded in Type-Length-Value format.",
      "zh-CHS": "由给定节点发送的“协议独立多播-稀疏模式”加入消息标识该节点希望加入的一个或多个多播分发树。每个树都由多播组地址和源地址（其中源地址可能是“通配符”）的组合来标识。在某些情况下，在连接树时，指定与树的构造相关的附加信息可能很有用。然而，到目前为止，还没有办法做到这一点。本文档描述了对联接消息的修改，该消息允许节点将属性与特定树相关联。属性以类型长度值格式编码。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Specification of Requirements ...................................3\n3. Use of Join Attributes ..........................................3\n   3.1. Sending Join Attributes ....................................3\n   3.2. The Join Attribute Option in the PIM Hello .................4\n   3.3. Receiving Join Attributes ..................................4\n        3.3.1. General Considerations ..............................4\n        3.3.2. Transitive and Non-Transitive Attributes ............5\n        3.3.3. Conflicting Attributes ..............................5\n        3.3.4. Attribute Change ....................................6\n   3.4. PIM Attribute Packet Format ................................7\n        3.4.1. PIM Join Packet Format ..............................7\n        3.4.2. PIM Join Attribute Hello Option .....................8\n4. IANA Considerations .............................................8\n5. Security Considerations .........................................9\n6. Acknowledgments .................................................9\n7. Normative References ............................................9\n8. Informative References ..........................................9",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "In the protocol known as \"Protocol Independent Multicast - Sparse Mode\" [RFC4601] (henceforth referred to as \"PIM\"), a Join message sent by a given node may identify one or more multicast distribution trees that that node wishes to join. Each tree is identified by the combination of a multicast group address and a source address (where the source address is possibly a \"wild card\"). Under certain conditions it can be useful, when joining a tree, to specify additional information related to the construction of the tree. However, there has been no way to do so until now. This document describes a modification of the Join message that allows a node to associate an attribute, encoded in Type-Length-Value (TLV) format, with a particular tree that it wishes to join. These attributes are known as \"PIM Join Attributes\".",
      "zh-CHS": "在称为“协议独立多播-稀疏模式”[RFC4601]（以下称为“PIM”）的协议中，由给定节点发送的加入消息可以识别该节点希望加入的一个或多个多播分发树。每个树都由多播组地址和源地址（其中源地址可能是“通配符”）的组合来标识。在某些情况下，在连接树时，指定与树的构造相关的附加信息可能很有用。然而，到目前为止，还没有办法做到这一点。本文档描述了对连接消息的修改，该修改允许节点将以类型长度值（TLV）格式编码的属性与其希望连接的特定树相关联。这些属性称为“PIM连接属性”。"
    },
    {
      "indent": 3,
      "text": "In the PIM Join message, the Source Address is identified by being encoded as an \"Encoded-Source Address\" ([RFC4601], section 4.9.1). Each Encoded-Source Address occurs in the context of a particular group address, represented as an \"Encoded-Group Address\". Together, the Encoded-Source Address and the Encoded-Group Address identify a multicast distribution tree. The Encoded-Source Address contains an \"encoding type\" field. The only value defined in [RFC4601] is 0. This specification is the first to assign another encoding type value.",
      "zh-CHS": "在PIM连接消息中，通过将源地址编码为“编码源地址”（[RFC4601]，第4.9.1节）来识别源地址。每个编码源地址出现在特定组地址的上下文中，表示为“编码组地址”。编码源地址和编码组地址一起标识多播分发树。编码的源地址包含一个“编码类型”字段。[RFC4601]中定义的唯一值为0。此规范是第一个指定另一个编码类型值的规范。"
    },
    {
      "indent": 3,
      "text": "In order to associate TLVs with a particular tree, this specification defines a new encoding type for the Encoded-Source Address: type 1. When type 1 is used, the Encoded-Source Address may contain a sequence of \"Join Attributes\", each of which is encoded as a TLV. Then the type 1 Encoded-Source Address, in the context of the associated Encoded-Group Address, identifies a multicast distribution tree and specifies (via the Join Attribute TLVs) the attributes that apply to the tree. Apart from the fact that the type 1 Encoded-Source Address may contain Join Attributes, it is otherwise identical to the type 0 Encoded-Source Address.",
      "zh-CHS": "为了将TLV与特定树相关联，本规范为编码的源地址定义了一种新的编码类型：类型1。当使用类型1时，编码的源地址可能包含一系列“连接属性”，每个属性都编码为TLV。然后，类型1编码源地址在相关编码组地址的上下文中标识多播分发树，并指定（通过连接属性TLV）应用于该树的属性。除了类型1编码的源地址可能包含连接属性之外，它在其他方面与类型0编码的源地址相同。"
    },
    {
      "indent": 3,
      "text": "This document does not contain the specification for any particular Join Attribute. It specifies how Join Attributes are to be encoded into the Join messages and it specifies generic procedures that are common to all Join Attributes. The content and purpose of any particular Join Attribute is outside the scope of this document.",
      "zh-CHS": "本文档不包含任何特定联接属性的规范。它指定如何将联接属性编码到联接消息中，并指定所有联接属性通用的通用过程。任何特定联接属性的内容和用途都不在本文档的范围内。"
    },
    {
      "indent": 3,
      "text": "The use of Join Attributes in \"Protocol Independent Multicast - Dense Mode\" [RFC3973] is not considered.",
      "zh-CHS": "不考虑在“协议独立多播-密集模式”[RFC3973]中使用连接属性。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "zh-CHS": "2. 需求说明"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“必需”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Use of Join Attributes",
      "section_title": true,
      "zh-CHS": "3. 连接属性的使用"
    },
    {
      "indent": 0,
      "text": "3.1. Sending Join Attributes",
      "section_title": true,
      "zh-CHS": "3.1. 发送连接属性"
    },
    {
      "indent": 3,
      "text": "Join Attributes are encoded as TLVs into the Encoded-Source Address field of a PIM Join message, as specified in section 3.4.1 below. Each attribute applies to the same multicast distribution tree that is identified by the combination of the Encoded-Source Address and the associated Encoded-Group Address. The multicast distribution tree may be either a source-specific tree or a shared tree.",
      "zh-CHS": "按照下面第3.4.1节的规定，连接属性作为TLV编码到PIM连接消息的编码源地址字段中。每个属性都应用于同一个多播分发树，该多播分发树由编码源地址和相关编码组地址的组合标识。多播分发树可以是源特定树或共享树。"
    },
    {
      "indent": 3,
      "text": "The encoding of the \"source address\" field within the Encoded-Source Address is exactly the same for a type 1 Encoded-Source Address as for a type 0 Encoded-Source Address, specified in [RFC4601].",
      "zh-CHS": "编码源地址中“源地址”字段的编码与[RFC4601]中规定的类型1编码源地址的编码与类型0编码源地址的编码完全相同。"
    },
    {
      "indent": 3,
      "text": "A type 1 Encoded-Source Address MUST contain at least one Join Attribute. The way to specify that there are no Join Attributes for a particular tree is to use the type 0 Encoded-Source Address.",
      "zh-CHS": "类型1编码的源地址必须至少包含一个联接属性。指定特定树没有连接属性的方法是使用类型0编码的源地址。"
    },
    {
      "indent": 3,
      "text": "Multiple Join Attributes of the same type or of different types may occur within a single Encoded-Source Address. This specification does not require all attributes of a given type to occur contiguously. There is no header field that specifies the number of attributes; rather the last attribute is specially marked as such.",
      "zh-CHS": "同一类型或不同类型的多个连接属性可能出现在单个编码源地址中。本规范不要求给定类型的所有属性连续出现。没有指定属性数量的标题字段；相反，最后一个属性被特别标记为这样。"
    },
    {
      "indent": 3,
      "text": "Any PIM router that does not understand the type 1 Encoded-Source Address will not be able to process a PIM Join message that contains it. Further, if the use of any particular Join Attribute affects the construction of the multicast distribution tree, the tree may not be formed correctly unless the attribute is understood by all PIM routers that receive it. As a consequence, attributes are only useful within a single administrative domain (or perhaps a small set of contiguous, cooperating administrative domains) where it can be determined a priori that all deployed PIM routers understand the type 1 Encoded-Source Address, as well as whatever specific attributes are in use.",
      "zh-CHS": "任何不理解类型1编码源地址的PIM路由器将无法处理包含该地址的PIM连接消息。此外，如果任何特定连接属性的使用影响多播分发树的构造，则除非接收多播分发树的所有PIM路由器都理解该属性，否则可能无法正确地形成该树。因此，属性仅在单个管理域（或者可能是一小组连续的、协作的管理域）内有用，其中可以先验地确定所有部署的PIM路由器都理解类型1编码的源地址，以及正在使用的任何特定属性。"
    },
    {
      "indent": 0,
      "text": "3.2. The Join Attribute Option in the PIM Hello",
      "section_title": true,
      "zh-CHS": "3.2. PIM Hello中的Join属性选项"
    },
    {
      "indent": 3,
      "text": "To ensure that a type 1 Encoded-Source Address is not sent to a PIM neighbor that does not understand this encoding, a new PIM Hello option, the \"Join Attribute\" option, is defined. This option MUST be included in the PIM Hellos of any PIM router that is willing to receive type 1 Encoded-Source Address. A PIM router MUST NOT send a type 1 Encoded-Source Address out any interface on which there is a PIM neighbor that has not included this option in its Hellos. (Even a router that is not the upstream neighbor must be able parse the packet in order to do Join suppression or overriding.)",
      "zh-CHS": "为确保类型1编码的源地址不会发送给不理解该编码的PIM邻居，定义了一个新的PIM Hello选项“Join Attribute”选项。该选项必须包含在任何愿意接收类型1编码源地址的PIM路由器的PIM Hellos中。PIM路由器不得将类型1编码的源地址发送到任何接口，该接口上有一个PIM邻居未在其Hellos中包含此选项。（即使不是上游邻居的路由器也必须能够解析数据包，以便进行连接抑制或覆盖。）"
    },
    {
      "indent": 3,
      "text": "Note that a PIM router that sends the \"Join Attribute\" Hello option does not necessarily understand every possible attribute type. As there is no immediate way to act on a neighbor's inability to process certain attribute types, it is not desired to have a Hello option for each possible attribute type.",
      "zh-CHS": "请注意，发送“Join Attribute”Hello选项的PIM路由器不一定理解所有可能的属性类型。由于无法立即处理邻居无法处理某些属性类型的情况，因此不希望为每个可能的属性类型都提供Hello选项。"
    },
    {
      "indent": 0,
      "text": "3.3. Receiving Join Attributes",
      "section_title": true,
      "zh-CHS": "3.3. 接收连接属性"
    },
    {
      "indent": 0,
      "text": "3.3.1. General Considerations",
      "section_title": true,
      "zh-CHS": "3.3.1. 一般考虑"
    },
    {
      "indent": 3,
      "text": "A PIM router that receives a type 1 Encoded-Source Address MUST examine all the attributes in the order in which they appear.",
      "zh-CHS": "接收类型1编码源地址的PIM路由器必须按照属性出现的顺序检查所有属性。"
    },
    {
      "indent": 3,
      "text": "The specification for a given attribute type MUST specify the procedure to apply if there are multiple instances of that attribute type.",
      "zh-CHS": "如果给定属性类型有多个实例，则该属性类型的规范必须指定要应用的过程。"
    },
    {
      "indent": 3,
      "text": "Processing an attribute may affect the following:",
      "zh-CHS": "处理属性可能会影响以下方面："
    },
    {
      "indent": 3,
      "text": "- the construction of the associated multicast distribution tree,",
      "zh-CHS": "- 关联多播分发树的构造，"
    },
    {
      "indent": 3,
      "text": "- the processing of other attributes of the same type that also occur in the type 1 Encoded-Source Address, and",
      "zh-CHS": "- 处理同样发生在类型1编码源地址中的相同类型的其他属性，以及"
    },
    {
      "indent": 3,
      "text": "- the forwarding (or not) of the attribute itself and/or other attributes of the same type that also occur in the type 1 Encoded-Source Address.",
      "zh-CHS": "- 转发（或不转发）属性本身和/或类型1编码源地址中出现的相同类型的其他属性。"
    },
    {
      "indent": 3,
      "text": "If the processing of a received attribute has any effect on the construction of the multicast distribution tree or on the set of attributes that are forwarded up the tree, then state MUST be maintained associating the received attribute with the adjacency or adjacencies from which it was received.",
      "zh-CHS": "如果对接收到的属性的处理对多播分发树的构造或转发到树上的属性集有任何影响，则必须保持将接收到的属性与接收属性的一个或多个邻接关联的状态。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Transitive and Non-Transitive Attributes",
      "section_title": true,
      "zh-CHS": "3.3.2. 传递属性和非传递属性"
    },
    {
      "indent": 3,
      "text": "If a PIM router understands a particular attribute type, the attribute is processed as specified above.",
      "zh-CHS": "如果PIM路由器了解特定的属性类型，则按照上述规定处理该属性。"
    },
    {
      "indent": 3,
      "text": "If a PIM router does not understand the type of a particular attribute, the PIM router either forwards that attribute or discards it, depending upon the setting of the attribute's F-bit. If the F-bit is set, then the router MUST forward the attribute; if the F-bit is clear, then the router MUST discard it.",
      "zh-CHS": "如果PIM路由器不了解特定属性的类型，则PIM路由器会转发该属性或丢弃该属性，具体取决于属性的F位设置。如果设置了F位，则路由器必须转发该属性；如果F位是清除的，那么路由器必须丢弃它。"
    },
    {
      "indent": 3,
      "text": "If one or more non-transitive attributes are discarded, the rest of the Join Attributes (if any) are still forwarded. If there are no Join Attributes left to forward, a Join with a type 0 Encoded-Source Address field MUST be forwarded.",
      "zh-CHS": "如果一个或多个非传递属性被丢弃，则其余的连接属性（如果有）仍将被转发。如果没有要转发的联接属性，则必须转发具有类型0编码的源地址字段的联接。"
    },
    {
      "indent": 0,
      "text": "3.3.3. Conflicting Attributes",
      "section_title": true,
      "zh-CHS": "3.3.3. 冲突属性"
    },
    {
      "indent": 3,
      "text": "It is possible that a router receives conflicting attribute information from different downstream routers. Conflicts only occur with attributes of the same type.",
      "zh-CHS": "路由器可能从不同的下游路由器接收冲突的属性信息。冲突只会与相同类型的属性发生。"
    },
    {
      "indent": 3,
      "text": "    ( Edge A1 )            ( Edge B1 )---- [R1]\n   /           \\          /\n  /             \\        /\n[S]              ( Core )\n  \\             /        \\\n   \\           /          \\\n    ( Edge A2 )            ( Edge B2 )---- [R2]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 33,
      "text": "Figure 1",
      "zh-CHS": "图1"
    },
    {
      "indent": 3,
      "text": "As an example, consider Figure 1 and suppose a Join Attribute is used to indicate a choice of exit router. There are 2 receivers for the same group connected to Edge B1 and B2. Suppose that edge router B1 prefers A1 and B2 prefers A2 as exit points to reach the source S. If both Edge B1 and B2 send a Join including an attribute to prefer their exit router in the network and they cross the same core router, the core router will get conflicting attribute information for the source. If this happens, we use the attribute from the PIM adjacency with the numerically smallest IP address. In the case of IPv6, the link local address will be used. When two neighbors have the same IP address, either for IPv4 or IPv6, the interface index MUST be used as a tie breaker. The attributes from other sending routers MAY be remembered; that way, if the adjacency that supplied the selected attribute gets pruned or expires, we are able to immediately use the attribute that was sent by the adjacency that is next in the order of preference. This enables us to converge quickly without waiting for the next periodic update.",
      "zh-CHS": "举个例子，考虑图1，假设使用一个连接属性来指示退出路由器的选择。同一组有2个接收器连接到边缘B1和B2。假设边缘路由器B1首选A1，B2首选A2作为到达源S的出口点。如果边缘B1和B2在网络中发送一个包含首选其出口路由器属性的连接，并且它们穿过同一个核心路由器，则核心路由器将获得源的冲突属性信息。如果发生这种情况，我们将使用数字最小IP地址的PIM邻接属性。在IPv6的情况下，将使用链路本地地址。如果两个邻居具有相同的IP地址（IPv4或IPv6），则必须将接口索引用作连接断开器。可以记住来自其他发送路由器的属性；这样，如果提供所选属性的邻接被删除或过期，我们就可以立即使用由邻接发送的属性，该邻接按优先顺序排列。这使我们能够快速收敛，而无需等待下一次定期更新。"
    },
    {
      "indent": 3,
      "text": "When a particular attribute type is specified, the specification MAY include a conflict resolution procedure specific to that type. If so, that conflict resolution procedure MUST be used instead of the procedure described in this section.",
      "zh-CHS": "指定特定属性类型时，规范可能包括特定于该类型的冲突解决过程。如果是，则必须使用该冲突解决程序，而不是本节所述的程序。"
    },
    {
      "indent": 3,
      "text": "It is possible that a router will receive, from two different adjacencies, transitive attributes of a given type. If the router does not understand attributes of that type and if the two adjacencies have not sent the exact same set of attributes of that type, then the conflict resolution procedure described in this section MUST be applied to those attributes. Two adjacencies are said to have sent the exact same set of attributes of a given type if they have sent the same number of instances of that attribute and if corresponding instances are byte-for-byte identical.",
      "zh-CHS": "路由器可能会从两个不同的邻接处接收给定类型的可传递属性。如果路由器不理解该类型的属性，并且如果两个相邻未发送该类型的完全相同的属性集，则必须对这些属性应用本节中描述的冲突解决程序。如果两个邻接发送的属性实例数量相同，并且对应的实例是逐字节相同的，则称它们发送了给定类型的完全相同的属性集。"
    },
    {
      "indent": 0,
      "text": "3.3.4. Attribute Change",
      "section_title": true,
      "zh-CHS": "3.3.4. 属性变化"
    },
    {
      "indent": 3,
      "text": "A PIM router may decide to change the set of attributes it has associated with a given multicast distribution tree. This can happen if one of its downstream neighbors on the tree has changed the set of attributes. It can also happen as a result of processing the attributes. It can also happen for reasons outside the scope of this specification (such as a change in configuration).",
      "zh-CHS": "PIM路由器可能决定更改其与给定多播分发树关联的属性集。如果树上的下游邻居之一更改了属性集，则可能发生这种情况。处理属性时也可能发生这种情况。由于本规范范围之外的原因（如配置更改），也可能发生这种情况。"
    },
    {
      "indent": 3,
      "text": "If a PIM router needs to change the set of attributes for a given tree but does not change its upstream neighbor for that tree, it MUST send a new Join for that tree, specifying the new set of attributes. If the new set of attributes is the null set, the type 0 Encoded-Source format MUST be used.",
      "zh-CHS": "如果PIM路由器需要更改给定树的属性集，但不更改该树的上游邻居，则它必须为该树发送新连接，并指定新的属性集。如果新属性集为空集，则必须使用类型0编码的源格式。"
    },
    {
      "indent": 3,
      "text": "If a PIM router needs to change the set of attributes for a given tree and as a result changes its upstream neighbor for that tree, it sends a Prune to the old upstream neighbor. The Prune does not need to carry any attributes.",
      "zh-CHS": "如果PIM路由器需要更改给定树的属性集，并因此更改该树的上游邻居，它会向旧的上游邻居发送修剪。修剪不需要携带任何属性。"
    },
    {
      "indent": 3,
      "text": "When a PIM router receives a Join for a given tree and the Join does not contain exactly the same set of attributes as the prior Join, the set of attributes in the new Join becomes the entire new set of attributes. No attribute information from the prior Join is retained. There is no way to advertise incremental changes to the set of attributes; any attributes that are no longer present are considered to have been withdrawn. If, as the result of receiving a Join, a PIM router determines that the set of attributes has changed, it will need to send a new Join upstream that contains the new set of attributes. (Of course, the procedures for resolving attribute conflicts may need to be applied first.)",
      "zh-CHS": "当PIM路由器接收到给定树的连接，且该连接不包含与先前连接完全相同的属性集时，新连接中的属性集将成为整个新属性集。不会保留先前联接中的属性信息。没有办法公布对属性集的增量更改；不再存在的任何属性都将被视为已撤销。如果作为接收连接的结果，PIM路由器确定属性集已更改，则需要向上游发送包含新属性集的新连接。（当然，可能需要首先应用解决属性冲突的过程。）"
    },
    {
      "indent": 3,
      "text": "When a PIM router R1 receives a Prune for a given tree from a given downstream neighbor R2, where R2 had previously sent attributes applying to that tree, those attributes are considered to have been withdrawn. Depending on the attributes that R1 has received from its other downstream neighbors (if any) on the tree, R1 may determine that the set of attributes applying to the tree has changed, in which case it needs to send a new Join, with the new attribute set, to its upstream neighbor on the tree.",
      "zh-CHS": "当PIM路由器R1从给定的下游邻居R2接收到给定树的修剪，其中R2先前已发送应用于该树的属性，则认为这些属性已被撤回。根据R1从树上的其他下游邻居（如果有）接收到的属性，R1可以确定应用于树的属性集已更改，在这种情况下，R1需要向树上的上游邻居发送具有新属性集的新连接。"
    },
    {
      "indent": 0,
      "text": "3.4. PIM Attribute Packet Format",
      "section_title": true,
      "zh-CHS": "3.4. 属性包格式"
    },
    {
      "indent": 0,
      "text": "3.4.1. PIM Join Packet Format",
      "section_title": true,
      "zh-CHS": "3.4.1. PIM连接数据包格式"
    },
    {
      "indent": 3,
      "text": "There is no space in the default PIM source encoding to include an attribute field. Therefore we introduce a new source encoding type. The attributes are formatted as TLVs. The new Encoded-Source Address looks like this:",
      "zh-CHS": "默认PIM源编码中没有包含属性字段的空间。因此，我们引入了一种新的源编码类型。属性的格式为TLV。新的编码源地址如下所示："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Addr Family   | Encoding Type | Rsrvd   |S|W|R|  Mask Len     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               Source Address\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+.....\n|F|E| Attr_Type | Length        | Value\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+.....\n|F|E| Attr_Type | Length        | Value\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+.....\n     .                    .                     .\n     .                    .                     .",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "- Encoding Type: 1",
      "zh-CHS": "- 编码类型：1"
    },
    {
      "indent": 3,
      "text": "- F-bit, Transitive Attribute. If this bit is set, the attribute is a transitive attribute; otherwise, it is a non-transitive attribute. See section 3.3.2.",
      "zh-CHS": "- F位，传递属性。如果设置了该位，则该属性是可传递属性；否则，它是非传递属性。见第3.3.2节。"
    },
    {
      "indent": 3,
      "text": "- E-bit, End of Attributes. If this bit is set, then this is the last Join Attribute appearing in this Encoded-Source Address field.",
      "zh-CHS": "- E位，属性结束。如果设置了此位，则这是此编码源地址字段中出现的最后一个连接属性。"
    },
    {
      "indent": 3,
      "text": "- \"Attr_Type\", a 6-bit field identifying the type of the Attribute.",
      "zh-CHS": "- “Attr_Type”，标识属性类型的6位字段。"
    },
    {
      "indent": 3,
      "text": "- Length field, a 1-octet field specifying the length in octets, encoded as an unsigned binary integer, of the value field.",
      "zh-CHS": "- 长度字段，一个1个八位字节的字段，指定值字段的长度（以八位字节为单位），编码为无符号二进制整数。"
    },
    {
      "indent": 3,
      "text": "The other fields are the same as described in [RFC4601].",
      "zh-CHS": "其他字段与[RFC4601]中所述相同。"
    },
    {
      "indent": 0,
      "text": "3.4.2. PIM Join Attribute Hello Option",
      "section_title": true,
      "zh-CHS": "3.4.2. PIM连接属性Hello选项"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      OptionType = 26           |      OptionLength = 0        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "- Option type: 26.",
      "zh-CHS": "- 选项类型：26。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "zh-CHS": "4. IANA考虑"
    },
    {
      "indent": 3,
      "text": "A new IANA registry has been created for \"PIM Join Attribute Types\". These are values of the \"Attr_Type\" field depicted in section 3.4.1. Assignments are to be made according to the policy \"IETF Review\" as defined in [RFC5226].",
      "zh-CHS": "已为“PIM连接属性类型”创建了新的IANA注册表。这些是第3.4.1节中描述的“属性类型”字段的值。根据[RFC5226]中定义的“IETF审查”政策进行分配。"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the PIM Hello option value 26 to the \"Join Attribute\" option, with this document as the reference.",
      "zh-CHS": "IANA已将PIM Hello选项值26指定给“连接属性”选项，并将此文档作为参考。"
    },
    {
      "indent": 3,
      "text": "[RFC4601] should have, but did not, create a registry for the \"Encoding Type\" field of the Encoded-Source Address format defined therein. IANA has set up a registry for this, referencing both this document and [RFC4601]. Assignments should be made according to the policy \"IETF Review\" as defined in [RFC5226]. Two encoding types are defined:",
      "zh-CHS": "[RFC4601]应该为其中定义的编码源地址格式的“编码类型”字段创建注册表，但没有创建注册表。IANA已经为此建立了一个注册表，引用了本文件和[RFC4601]。应根据[RFC5226]中定义的“IETF审查”政策进行分配。定义了两种编码类型："
    },
    {
      "indent": 3,
      "text": "- The encoding type 0 has been allocated, defined as \"native encoding for the address family\", and [RFC4601] is the reference.",
      "zh-CHS": "- 编码类型0已分配，定义为“地址族的本机编码”，并且[RFC4601]是参考。"
    },
    {
      "indent": 3,
      "text": "- The encoding type 1 has been allocated, defined as \"native encoding for the address family, but with zero or more PIM Join Attributes present\", and this document is the reference.",
      "zh-CHS": "- 编码类型1已分配，定义为“地址族的本机编码，但不存在任何或多个PIM连接属性”，本文档仅供参考。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "Security of the Join Attribute is only guaranteed by the security of the PIM packet, so the security considerations for PIM Join packets as described in [RFC4601] apply here. Additional security considerations may apply to specific attributes; if so, these will need to be documented in the specification of those attributes.",
      "zh-CHS": "连接属性的安全性仅由PIM数据包的安全性保证，因此[RFC4601]中描述的PIM连接数据包的安全注意事项适用于此处。其他安全注意事项可能适用于特定属性；如果是这样，则需要在这些属性的规范中记录这些属性。"
    },
    {
      "indent": 3,
      "text": "Security considerations from [RFC5015] may apply as well.",
      "zh-CHS": "[RFC5015]中的安全注意事项也可能适用。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "zh-CHS": "6. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Stig Venaas, James Lingard, Bharat Joshi, Marshall Eubanks, Pekka Savola, Tom Pusateri, and Elwyn Davies for their input.",
      "zh-CHS": "作者要感谢Stig Venaas、James Lingard、Bharat Joshi、Marshall Eubanks、Pekka Savola、Tom Pusateri和Elwyn Davies的投入。"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "zh-CHS": "7. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4601] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "zh-CHS": "[RFC4601]Fenner，B.，Handley，M.，Holbrook，H.，和I.Kouvelas，“协议独立多播-稀疏模式（PIM-SM）：协议规范（修订版）”，RFC 46012006年8月。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "zh-CHS": "8. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3973] Adams, A., Nicholas, J., and W. Siadak, \"Protocol Independent Multicast - Dense Mode (PIM-DM): Protocol Specification (Revised)\", RFC 3973, January 2005.",
      "zh-CHS": "[RFC3973]Adams，A.，Nicholas，J.，和W.Siadak，“协议独立多播-密集模式（PIM-DM）：协议规范（修订版）”，RFC 3973，2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5015] Handley, M., Kouvelas, I., Speakman, T., and L. Vicisano, \"Bidirectional Protocol Independent Multicast (BIDIR-PIM)\", RFC 5015, October 2007.",
      "zh-CHS": "[RFC5015]Handley，M.，Kouvelas，I.，Speakman，T.，和L.Vicisano，“双向协议独立多播（BIDIR-PIM）”，RFC 50152007年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "zh-CHS": "[RFC5226]Narten，T.和H.Alvestrand，“在RFCs中编写IANA注意事项部分的指南”，BCP 26，RFC 5226，2008年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Arjen Boers Cisco Systems, Inc. Avda. Diagnoal, 682 Barcelona 08034",
      "zh-CHS": "Arjen Boers思科系统公司Avda。Diagnoal，682巴塞罗那08034"
    },
    {
      "indent": 3,
      "text": "EMail: aboers@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "IJsbrand Wijnands Cisco Systems, Inc. De kleetlaan 6a Diegem 1831 Belgium",
      "zh-CHS": "IJsbrand Wijlands Cisco Systems，Inc.De kleetlaan 6a Diegem 1831比利时"
    },
    {
      "indent": 3,
      "text": "EMail: ice@cisco.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Eric C. Rosen Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA, 01719",
      "zh-CHS": "Eric C.Rosen Cisco Systems，Inc.马萨诸塞州伯斯堡马萨诸塞大道1414号，邮编01719"
    },
    {
      "indent": 3,
      "text": "EMail: erosen@cisco.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}