{
  "title": {
    "text": "RFC 5065: Autonomous System Confederations for BGP",
    "zh-CHS": "RFC 5065"
  },
  "number": 5065,
  "created_at": "2021-11-10 01:50:00.400262+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          P. Traina\nRequest for Comments: 5065                            Blissfully Retired\nObsoletes: 3065                                             D. McPherson\nCategory: Standards Track                                 Arbor Networks\n                                                              J. Scudder\n                                                        Juniper Networks\n                                                             August 2007",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 16,
      "text": "Autonomous System Confederations for BGP",
      "zh-CHS": "BGP自治系统联合会"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "The Border Gateway Protocol (BGP) is an inter-autonomous system routing protocol designed for Transmission Control Protocol/Internet Protocol (TCP/IP) networks. BGP requires that all BGP speakers within a single autonomous system (AS) must be fully meshed. This represents a serious scaling problem that has been well documented in a number of proposals.",
      "zh-CHS": "边界网关协议（BGP）是一种为传输控制协议/互联网协议（TCP/IP）网络设计的自治系统间路由协议。BGP要求单个自治系统（AS）内的所有BGP扬声器必须完全啮合。这是一个严重的缩放问题，在许多提案中都有很好的记录。"
    },
    {
      "indent": 3,
      "text": "This document describes an extension to BGP that may be used to create a confederation of autonomous systems that is represented as a single autonomous system to BGP peers external to the confederation, thereby removing the \"full mesh\" requirement. The intention of this extension is to aid in policy administration and reduce the management complexity of maintaining a large autonomous system.",
      "zh-CHS": "本文档描述了对BGP的扩展，该扩展可用于创建自治系统联盟，该联盟表示为联盟外部BGP对等方的单个自治系统，从而消除了“全网格”要求。此扩展的目的是帮助策略管理，降低维护大型自治系统的管理复杂性。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 3065.",
      "zh-CHS": "本文件淘汰RFC 3065。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Specification of Requirements ..............................3\n   1.2. Terminology ................................................3\n2. Discussion ......................................................4\n3. AS_CONFED Segment Type Extension ................................5\n4. Operation .......................................................5\n   4.1. AS_PATH Modification Rules .................................6\n5. Error Handling ..................................................8\n   5.1. Error Handling .............................................8\n   5.2. MED and LOCAL_PREF Handling ................................8\n   5.3. AS_PATH and Path Selection .................................9\n6. Compatibility Considerations ...................................10\n7. Deployment Considerations ......................................10\n8. Security Considerations ........................................10\n9. Acknowledgments ................................................11\n10. References ....................................................11\n   10.1. Normative References .....................................11\n   10.2. Informative References ...................................11\nAppendix A. Aggregate Routing Information .........................13\nAppendix B. Changes from RFC 3065 .................................13",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "As originally defined, BGP requires that all BGP speakers within a single AS must be fully meshed. The result is that for n BGP speakers within an AS, n*(n-1)/2 unique Internal BGP (IBGP) sessions are required. This \"full mesh\" requirement clearly does not scale when there are a large number of IBGP speakers within the autonomous system, as is common in many networks today.",
      "zh-CHS": "按照最初的定义，BGP要求单个As中的所有BGP扬声器必须完全啮合。结果是，对于AS中的n个BGP发言者，需要n*（n-1）/2个唯一的内部BGP（IBGP）会话。当自治系统中有大量IBGP扬声器时，这种“全网状”要求显然无法扩展，这在当今许多网络中很常见。"
    },
    {
      "indent": 3,
      "text": "This scaling problem has been well documented and a number of proposals have been made to alleviate this, such as [RFC2796] and [RFC1863] (made historic by [RFC4223]). This document presents another alternative alleviating the need for a \"full mesh\" and is known as \"Autonomous System Confederations for BGP\", or simply, \"BGP confederations\". It has also been observed that BGP confederations may provide improvements in routing policy control.",
      "zh-CHS": "这种缩放问题已经有了很好的记录，并且已经提出了许多建议来缓解这一问题，例如[RFC2796]和[RFC1863]（由[RFC4223]历史性地提出）。本文件提出了另一种替代方案，以缓解对“全网格”的需求，称为“BGP自治系统联盟”，或简称为“BGP联盟”。也有人观察到，BGP联盟可以在路由策略控制方面提供改进。"
    },
    {
      "indent": 3,
      "text": "This document is a revision of, and obsoletes, [RFC3065], which is itself a revision of [RFC1965]. It includes editorial changes, terminology clarifications, and more explicit protocol specifications based on extensive implementation and deployment experience with BGP Confederations.",
      "zh-CHS": "本文件是[RFC3065]的修订版，并将其废弃，而[RFC3065]本身就是[RFC1965]的修订版。它包括编辑性修改、术语澄清，以及基于BGP联盟广泛实施和部署经验的更明确的协议规范。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification of Requirements",
      "section_title": true,
      "zh-CHS": "1.1. 需求说明"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "zh-CHS": "1.2. 术语"
    },
    {
      "indent": 3,
      "text": "AS Confederation",
      "zh-CHS": "作为同盟"
    },
    {
      "indent": 6,
      "text": "A collection of autonomous systems represented and advertised as a single AS number to BGP speakers that are not members of the local BGP confederation.",
      "zh-CHS": "自治系统的集合，以单个as号码向非本地BGP联盟成员的BGP发言者进行表示和宣传。"
    },
    {
      "indent": 3,
      "text": "AS Confederation Identifier",
      "zh-CHS": "作为联邦标识符"
    },
    {
      "indent": 6,
      "text": "An externally visible autonomous system number that identifies a BGP confederation as a whole.",
      "zh-CHS": "一种外部可见的自治系统编号，用于将BGP联盟作为一个整体进行标识。"
    },
    {
      "indent": 3,
      "text": "Member Autonomous System (Member-AS)",
      "zh-CHS": "成员自治系统（成员AS）"
    },
    {
      "indent": 6,
      "text": "An autonomous system that is contained in a given AS confederation. Note that \"Member Autonomous System\" and \"Member-AS\" are used entirely interchangeably throughout this document.",
      "zh-CHS": "一个自治系统，包含在一个给定的联邦中。请注意，“成员自治系统”和“成员身份”在本文件中完全可以互换使用。"
    },
    {
      "indent": 3,
      "text": "Member-AS Number",
      "zh-CHS": "成员编号"
    },
    {
      "indent": 6,
      "text": "An autonomous system number identifier visible only within a BGP confederation, and used to represent a Member-AS within that confederation.",
      "zh-CHS": "仅在BGP联盟内可见的自治系统编号标识符，用于表示该联盟内的成员。"
    },
    {
      "indent": 0,
      "text": "2. Discussion",
      "section_title": true,
      "zh-CHS": "2. 讨论"
    },
    {
      "indent": 3,
      "text": "It may be useful to subdivide autonomous systems with a very large number of BGP speakers into smaller domains for purposes of controlling routing policy via information contained in the BGP AS_PATH attribute. For example, one may choose to consider all BGP speakers in a geographic region as a single entity.",
      "zh-CHS": "为了通过BGP AS_PATH属性中包含的信息来控制路由策略，可以将具有大量BGP扬声器的自治系统细分为更小的域。例如，可以选择将地理区域中的所有BGP扬声器视为单个实体。"
    },
    {
      "indent": 3,
      "text": "In addition to potential improvements in routing policy control, if techniques such as those presented here or in [RFC4456] are not employed, [BGP-4] requires BGP speakers in the same autonomous system to establish a full mesh of TCP connections among all speakers for the purpose of exchanging exterior routing information. In autonomous systems, the number of intra-domain connections that need to be maintained by each border router can become significant.",
      "zh-CHS": "除了路由策略控制方面的潜在改进外，如果未采用此处或[RFC4456]中介绍的技术，[BGP-4]要求同一自治系统中的BGP扬声器在所有扬声器之间建立完整的TCP连接网，以交换外部路由信息。在自治系统中，需要由每个边界路由器维护的域内连接的数量可能变得非常重要。"
    },
    {
      "indent": 3,
      "text": "Subdividing a large autonomous system allows a significant reduction in the total number of intra-domain BGP connections, as the connectivity requirements simplify to the model used for inter-domain connections.",
      "zh-CHS": "细分大型自治系统可以显著减少域内BGP连接的总数，因为连接要求简化为用于域间连接的模型。"
    },
    {
      "indent": 3,
      "text": "Unfortunately, subdividing an autonomous system may increase the complexity of routing policy based on AS_PATH information for all members of the Internet. Additionally, this division increases the maintenance overhead of coordinating external peering when the internal topology of this collection of autonomous systems is modified.",
      "zh-CHS": "不幸的是，对自治系统进行细分可能会增加基于互联网所有成员的AS_路径信息的路由策略的复杂性。此外，当修改自治系统集合的内部拓扑时，该划分增加了协调外部对等的维护开销。"
    },
    {
      "indent": 3,
      "text": "Therefore, division of an autonomous system into separate systems may adversely affect optimal routing of packets through the Internet.",
      "zh-CHS": "因此，将自治系统划分为单独的系统可能会对通过因特网的分组的最佳路由产生不利影响。"
    },
    {
      "indent": 3,
      "text": "However, there is usually no need to expose the internal topology of this divided autonomous system, which means it is possible to regard a collection of autonomous systems under a common administration as a single entity or autonomous system, when viewed from outside the confines of the confederation of autonomous systems itself.",
      "zh-CHS": "然而，通常不需要公开这种分割的自治系统的内部拓扑，这意味着从自治系统联盟本身的范围之外看，可以将共同管理下的自治系统集合视为单个实体或自治系统。"
    },
    {
      "indent": 0,
      "text": "3. AS_CONFED Segment Type Extension",
      "section_title": true,
      "zh-CHS": "3. 自编段类型扩展"
    },
    {
      "indent": 3,
      "text": "Currently, BGP specifies that the AS_PATH attribute is a well-known mandatory attribute that is composed of a sequence of AS path segments. Each AS path segment is represented by a triple <path segment type, path segment length, path segment value>.",
      "zh-CHS": "目前，BGP指定AS_路径属性是众所周知的强制属性，由一系列AS路径段组成。每个AS路径段由三个<path segment type、path segment length、path segment value>表示。"
    },
    {
      "indent": 3,
      "text": "In [BGP-4], the path segment type is a 1-octet field with the two following values defined:",
      "zh-CHS": "在[BGP-4]中，路径段类型是一个1-octet字段，定义了以下两个值："
    },
    {
      "indent": 3,
      "text": "Value Segment Type",
      "zh-CHS": "值段类型"
    },
    {
      "indent": 5,
      "text": "1 AS_SET: unordered set of autonomous systems that a route in the UPDATE message has traversed",
      "zh-CHS": "1 AS_SET：更新消息中的路由所经过的自治系统的无序集"
    },
    {
      "indent": 5,
      "text": "2 AS_SEQUENCE: ordered set of autonomous systems that a route in the UPDATE message has traversed",
      "zh-CHS": "2 AS_序列：更新消息中的路由所经过的自治系统的有序集合"
    },
    {
      "indent": 3,
      "text": "This document specifies two additional segment types:",
      "zh-CHS": "本文件规定了两种额外的管段类型："
    },
    {
      "indent": 5,
      "text": "3 AS_CONFED_SEQUENCE: ordered set of Member Autonomous Systems in the local confederation that the UPDATE message has traversed",
      "zh-CHS": "3 AS_CONFED_序列：更新消息所经过的本地联盟中成员自治系统的有序集合"
    },
    {
      "indent": 5,
      "text": "4 AS_CONFED_SET: unordered set of Member Autonomous Systems in the local confederation that the UPDATE message has traversed",
      "zh-CHS": "4 AS_-CONFED_集：更新消息所经过的本地联盟中成员自治系统的无序集"
    },
    {
      "indent": 0,
      "text": "4. Operation",
      "section_title": true,
      "zh-CHS": "4. 活动"
    },
    {
      "indent": 3,
      "text": "A member of a BGP confederation MUST use its AS Confederation Identifier in all transactions with peers that are not members of its confederation. This AS Confederation Identifier is the \"externally visible\" AS number, and this number is used in OPEN messages and advertised in the AS_PATH attribute.",
      "zh-CHS": "BGP联盟的成员必须在与非联盟成员的对等方的所有事务中使用其作为联盟标识符。此AS联盟标识符是“外部可见”AS编号，此编号用于打开的消息中，并在AS_路径属性中公布。"
    },
    {
      "indent": 3,
      "text": "A member of a BGP confederation MUST use its Member-AS Number in all transactions with peers that are members of the same confederation as the local BGP speaker.",
      "zh-CHS": "BGP联盟成员必须在与作为本地BGP发言人的同一联盟成员的对等方进行的所有交易中使用其成员作为号码。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker receiving an AS_PATH attribute containing an autonomous system matching its own AS Confederation Identifier SHALL treat the path in the same fashion as if it had received a path containing its own AS number.",
      "zh-CHS": "BGP说话人接收到包含与其自身AS联盟标识符匹配的自治系统的AS_路径属性时，应以与接收到包含其自身AS编号的路径相同的方式处理该路径。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker receiving an AS_PATH attribute containing an AS_CONFED_SEQUENCE or AS_CONFED_SET that contains its own Member-AS Number SHALL treat the path in the same fashion as if it had received a path containing its own AS number.",
      "zh-CHS": "BGP说话人接收到包含AS_-CONFED_序列的AS_路径属性或包含其自身成员AS编号的AS_-CONFED_集时，应以与接收到包含其自身AS编号的路径相同的方式处理该路径。"
    },
    {
      "indent": 0,
      "text": "4.1. AS_PATH Modification Rules",
      "section_title": true,
      "zh-CHS": "4.1. AS_路径修改规则"
    },
    {
      "indent": 3,
      "text": "When implementing BGP confederations, Section 5.1.2 of [BGP-4] is replaced with the following text:",
      "zh-CHS": "在实施BGP联盟时，[BGP-4]第5.1.2节替换为以下文本："
    },
    {
      "indent": 3,
      "text": "AS_PATH is a well-known mandatory attribute. This attribute identifies the autonomous systems through which routing information carried in this UPDATE message has passed. The components of this list can be AS_SETs, AS_SEQUENCEs, AS_CONFED_SETs or AS_CONFED_SEQUENCES.",
      "zh-CHS": "AS_PATH是众所周知的强制属性。此属性标识此更新消息中包含的路由信息所经过的自治系统。此列表的组件可以是AS_集、AS_序列、AS_组合_集或AS_组合_序列。"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker propagates a route it learned from another BGP speaker's UPDATE message, it modifies the route's AS_PATH attribute based on the location of the BGP speaker to which the route will be sent:",
      "zh-CHS": "当一个BGP扬声器传播它从另一个BGP扬声器的更新消息中学习到的路由时，它会根据路由将被发送到的BGP扬声器的位置修改路由的AS_PATH属性："
    },
    {
      "indent": 3,
      "text": "a) When a given BGP speaker advertises the route to another BGP speaker located in its own Member-AS, the advertising speaker SHALL NOT modify the AS_PATH attribute associated with the route.",
      "zh-CHS": "a) 当给定BGP扬声器向位于其自身成员AS中的另一BGP扬声器播发路由时，播发扬声器不得修改与路由相关联的AS_路径属性。"
    },
    {
      "indent": 3,
      "text": "b) When a given BGP speaker advertises the route to a BGP speaker located in a neighboring autonomous system that is a member of the local confederation, the advertising speaker updates the AS_PATH attribute as follows:",
      "zh-CHS": "b) 当给定BGP演讲者向位于相邻自治系统中的BGP演讲者播发路由时，该自治系统是本地联盟的成员，播发演讲者更新AS_PATH属性，如下所示："
    },
    {
      "indent": 6,
      "text": "1) if the first path segment of the AS_PATH is of type AS_CONFED_SEQUENCE, the local system prepends its own Member-AS number as the last element of the sequence (put it in the leftmost position with respect to the position of octets in the protocol message). If the act of prepending will cause an overflow in the AS_PATH segment (i.e., more than 255 ASs), it SHOULD prepend a new segment of type AS_CONFED_SEQUENCE and prepend its own AS number to this new segment.",
      "zh-CHS": "1) 如果AS_路径的第一个路径段属于AS_CONFED_序列类型，则本地系统将其自身的成员作为序列的最后一个元素（相对于协议消息中的八位字节位置，将其置于最左边的位置）。如果预编操作将导致AS_路径段溢出（即超过255个ASs），则应预编AS_CONFED_序列类型的新段，并将其自身的AS编号预编到此新段。"
    },
    {
      "indent": 6,
      "text": "2) if the first path segment of the AS_PATH is not of type AS_CONFED_SEQUENCE, the local system prepends a new path segment of type AS_CONFED_SEQUENCE to the AS_PATH, including its own Member-AS Number in that segment.",
      "zh-CHS": "2) 如果AS_路径的第一个路径段不是AS_CONFED_序列类型，则本地系统将AS_CONFED_序列类型的新路径段预先添加到AS_路径，包括该段中自己的成员AS编号。"
    },
    {
      "indent": 6,
      "text": "3) if the AS_PATH is empty, the local system creates a path segment of type AS_CONFED_SEQUENCE, places its own Member-AS Number into that segment, and places that segment into the AS_PATH.",
      "zh-CHS": "3) 如果AS_路径为空，则本地系统将创建一个AS_CONFED_序列类型的路径段，将其自身的成员作为编号放入该段，然后将该段放入AS_路径。"
    },
    {
      "indent": 3,
      "text": "c) When a given BGP speaker advertises the route to a BGP speaker located in a neighboring autonomous system that is not a member of the local confederation, the advertising speaker SHALL update the AS_PATH attribute as follows:",
      "zh-CHS": "c) 当给定BGP演讲者向位于邻近自治系统中的BGP演讲者播发路由时，该自治系统不是本地联盟的成员，播发演讲者应更新AS_路径属性，如下所示："
    },
    {
      "indent": 6,
      "text": "1) if any path segments of the AS_PATH are of the type AS_CONFED_SEQUENCE or AS_CONFED_SET, those segments MUST be removed from the AS_PATH attribute, leaving the sanitized AS_PATH attribute to be operated on by steps 2, 3 or 4.",
      "zh-CHS": "1) 如果AS_路径的任何路径段属于AS_-CONFED_序列或AS_-CONFED_集合类型，则必须从AS_路径属性中删除这些段，使已消毒的AS_路径属性由步骤2、3或4操作。"
    },
    {
      "indent": 6,
      "text": "2) if the first path segment of the remaining AS_PATH is of type AS_SEQUENCE, the local system prepends its own AS Confederation Identifier as the last element of the sequence (put it in the leftmost position with respect to the position of octets in the protocol message). If the act of prepending will cause an overflow in the AS_PATH segment (i.e., more than 255 ASs), it SHOULD prepend a new segment of type AS_SEQUENCE and prepend its own AS number to this new segment.",
      "zh-CHS": "2) 如果剩余AS_路径的第一个路径段的类型为AS_序列，则本地系统将其自身的AS联盟标识符作为序列的最后一个元素（将其置于协议消息中八位字节位置的最左侧位置）。如果预加操作将导致AS_路径段溢出（即超过255个ASs），则应预加类型为AS_序列的新段，并将其自身的AS编号预加到此新段。"
    },
    {
      "indent": 6,
      "text": "3) if the first path segment of the remaining AS_PATH is of type AS_SET, the local system prepends a new path segment of type AS_SEQUENCE to the AS_PATH, including its own AS Confederation Identifier in that segment.",
      "zh-CHS": "3) 如果剩余AS_路径的第一个路径段的类型为AS_SET，则本地系统将AS_序列类型的新路径段预先添加到AS_路径，包括该段中自己的AS联盟标识符。"
    },
    {
      "indent": 6,
      "text": "4) if the remaining AS_PATH is empty, the local system creates a path segment of type AS_SEQUENCE, places its own AS Confederation Identifier into that segment, and places that segment into the AS_PATH.",
      "zh-CHS": "4) 如果剩余的AS_路径为空，本地系统将创建一个AS_序列类型的路径段，将其自身的AS联盟标识符放入该段，并将该段放入AS_路径。"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker originates a route then:",
      "zh-CHS": "当BGP扬声器发起路由时，则："
    },
    {
      "indent": 3,
      "text": "a) the originating speaker includes its own AS Confederation Identifier in a path segment, of type AS_SEQUENCE, in the AS_PATH attribute of all UPDATE messages sent to BGP speakers located in neighboring autonomous systems that are not members of the local confederation. In this case, the AS Confederation Identifier of the originating speaker's autonomous system will be the only entry the path segment, and this path segment will be the only segment in the AS_PATH attribute.",
      "zh-CHS": "a) 发端说话人在路径段中包括其自己的AS联合标识符，该路径段类型为AS_序列，在发送给位于非本地联合会成员的相邻自治系统中的BGP说话人的所有更新消息的AS_路径属性中。在这种情况下，始发说话人自治系统的AS联盟标识符将是路径段的唯一入口，并且该路径段将是AS_路径属性中的唯一段。"
    },
    {
      "indent": 3,
      "text": "b) the originating speaker includes its own Member-AS Number in a path segment, of type AS_CONFED_SEQUENCE, in the AS_PATH attribute of all UPDATE messages sent to BGP speakers located in neighboring Member Autonomous Systems that are members of the local confederation. In this case, the Member-AS Number of the originating speaker's autonomous system will be the only entry the path segment, and this path segment will be the only segment in the AS_PATH attribute.",
      "zh-CHS": "b) 发端说话人在路径段中包括其自己的成员AS号，该路径段类型为AS_CONFED_序列，在发送给位于相邻成员自治系统（属于本地联盟的成员）的BGP说话人的所有更新消息的AS_路径属性中。在这种情况下，始发说话人自治系统的成员AS编号将是路径段的唯一条目，并且该路径段将是AS_路径属性中的唯一段。"
    },
    {
      "indent": 3,
      "text": "c) the originating speaker includes an empty AS_PATH attribute in all UPDATE messages sent to BGP speakers residing within the same Member-AS. (An empty AS_PATH attribute is one whose length field contains the value zero).",
      "zh-CHS": "c) 发起扬声器在发送给驻留在与相同成员中的BGP扬声器的所有更新消息中包含空AS_PATH属性。（空AS_PATH属性是其长度字段包含值零的属性）。"
    },
    {
      "indent": 3,
      "text": "Whenever the modification of the AS_PATH attribute calls for including or prepending the AS Confederation Identifier or Member-AS Number of the local system, the local system MAY include/prepend more than one instance of that value in the AS_PATH attribute. This is controlled via local configuration.",
      "zh-CHS": "每当AS_路径属性的修改要求包括或预先指定本地系统的AS联盟标识符或成员AS号码时，本地系统可以在AS_路径属性中包括/预先指定该值的多个实例。这是通过本地配置控制的。"
    },
    {
      "indent": 0,
      "text": "5. Error Handling",
      "section_title": true,
      "zh-CHS": "5. 错误处理"
    },
    {
      "indent": 3,
      "text": "A BGP speaker MUST NOT transmit updates containing AS_CONFED_SET or AS_CONFED_SEQUENCE attributes to peers that are not members of the local confederation.",
      "zh-CHS": "BGP演讲者不得将包含AS_CONFED_集或AS_CONFED_序列属性的更新发送给非本地联盟成员的对等方。"
    },
    {
      "indent": 3,
      "text": "It is an error for a BGP speaker to receive an UPDATE message with an AS_PATH attribute that contains AS_CONFED_SEQUENCE or AS_CONFED_SET segments from a neighbor that is not located in the same confederation. If a BGP speaker receives such an UPDATE message, it SHALL treat the message as having a malformed AS_PATH according to the procedures of [BGP-4], Section 6.3 (\"UPDATE Message Error Handling\").",
      "zh-CHS": "BGP说话者从不在同一联盟中的邻居处接收包含AS_CONFED_序列或AS_CONFED_集合段的AS_路径属性的更新消息是错误的。如果BGP扬声器收到此类更新消息，则应根据[BGP-4]第6.3节（“更新消息错误处理”）中的程序，将该消息视为具有格式错误的as_路径。"
    },
    {
      "indent": 3,
      "text": "It is a error for a BGP speaker to receive an update message from a confederation peer that is not in the same Member-AS that does not have AS_CONFED_SEQUENCE as the first segment. If a BGP speaker receives such an UPDATE message, it SHALL treat the message as having a malformed AS_PATH according to the procedures of [BGP-4], Section 6.3 (\"UPDATE Message Error Handling\").",
      "zh-CHS": "BGP演讲者接收来自联盟对等方的更新消息是错误的，该对等方与第一段不在同一成员中。如果BGP扬声器收到此类更新消息，则应根据[BGP-4]第6.3节（“更新消息错误处理”）中的程序，将该消息视为具有格式错误的as_路径。"
    },
    {
      "indent": 0,
      "text": "5.1. Common Administrative Issues",
      "section_title": true,
      "zh-CHS": "5.1. 共同的行政问题"
    },
    {
      "indent": 3,
      "text": "It is reasonable for Member Autonomous Systems of a confederation to share a common administration and Interior Gateway Protocol (IGP) information for the entire confederation. It is also reasonable for each Member-AS to run an independent IGP. In the latter case, the NEXT_HOP may need to be set using policy (i.e., by default it is unchanged).",
      "zh-CHS": "联邦成员自治系统共享整个联邦的公共管理和内部网关协议（IGP）信息是合理的。每个成员运行独立的IGP也是合理的。在后一种情况下，可能需要使用策略设置下一跳（即，默认情况下它是不变的）。"
    },
    {
      "indent": 0,
      "text": "5.2. MED and LOCAL_PREF Handling",
      "section_title": true,
      "zh-CHS": "5.2. MED和本地预处理"
    },
    {
      "indent": 3,
      "text": "It SHALL be legal for a BGP speaker to advertise an unchanged NEXT_HOP and MULTI_EXIT_DISC (MED) attribute to peers in a neighboring Member-AS of the local confederation.",
      "zh-CHS": "BGP演讲者向本地联盟的相邻成员中的对等方宣传未更改的下一跳和多跳退出光盘（MED）属性是合法的。"
    },
    {
      "indent": 3,
      "text": "MEDs of two routes SHOULD only be compared if the first autonomous systems in the first AS_SEQUENCE in both routes are the same -- i.e., skip all the autonomous systems in the AS_CONFED_SET and AS_CONFED_SEQUENCE. An implementation MAY provide the ability to configure path selection such that MEDs of two routes are comparable if the first autonomous systems in the AS_PATHs are the same, regardless of AS_SEQUENCE or AS_CONFED_SEQUENCE in the AS_PATH.",
      "zh-CHS": "只有当两条路线中第一个AS_序列中的第一个自治系统相同时，才应比较两条路线的MED，即跳过AS_CONFED_集合和AS_CONFED_序列中的所有自治系统。一种实现可以提供配置路径选择的能力，使得如果AS_路径中的第一自治系统相同，则两条路径的med是可比较的，而不管AS_路径中的AS_序列或AS_联合序列如何。"
    },
    {
      "indent": 3,
      "text": "An implementation MAY compare MEDs received from a Member-AS via multiple paths. An implementation MAY compare MEDs from different Member Autonomous Systems of the same confederation.",
      "zh-CHS": "实现可以比较通过多个路径从成员接收的MED。一个实现可以比较来自同一联邦不同成员自治系统的MED。"
    },
    {
      "indent": 3,
      "text": "In addition, the restriction against sending the LOCAL_PREF attribute to peers in a neighboring autonomous system within the same confederation is removed.",
      "zh-CHS": "此外，取消了对向同一联邦内相邻自治系统中的对等方发送本地_PREF属性的限制。"
    },
    {
      "indent": 0,
      "text": "5.3. AS_PATH and Path Selection",
      "section_title": true,
      "zh-CHS": "5.3. AS_路径和路径选择"
    },
    {
      "indent": 3,
      "text": "Path selection criteria for information received from members inside a confederation MUST follow the same rules used for information received from members inside the same autonomous system, as specified in [BGP-4].",
      "zh-CHS": "根据[BGP-4]中的规定，从联邦内部成员接收信息的路径选择标准必须遵循从同一自治系统内部成员接收信息的相同规则。"
    },
    {
      "indent": 3,
      "text": "In addition, the following rules SHALL be applied:",
      "zh-CHS": "此外，应适用以下规则："
    },
    {
      "indent": 3,
      "text": "1) If the AS_PATH is internal to the local confederation (i.e., there are only AS_CONFED_* segments), consider the neighbor AS to be the local AS.",
      "zh-CHS": "1) 如果ASSPATH是本地联盟内部的（即只有ASSCONFEDFE**段），则将邻居视为本地AS。"
    },
    {
      "indent": 3,
      "text": "2) Otherwise, if the first segment in the path that is not an AS_CONFED_SEQUENCE or AS_CONFED_SET is an AS_SEQUENCE, consider the neighbor AS to be the leftmost AS_SEQUENCE AS.",
      "zh-CHS": "2) 否则，如果不是ASSCONFEDYA序列或ASSCONFEDEDY集的路径中的第一段是ASA序列，则将邻居视为最左边的ASY序列AS。"
    },
    {
      "indent": 3,
      "text": "3) When comparing routes using AS_PATH length, CONFED_SEQUENCE and CONFED_SETs SHOULD NOT be counted.",
      "zh-CHS": "3) 当比较使用AS_路径长度的路由时，不应计算CONFED_序列和CONFED_集合。"
    },
    {
      "indent": 3,
      "text": "4) When comparing routes using the internal (IBGP learned) versus external (EBGP learned) rules, treat a route that is learned from a peer that is in the same confederation (not necessarily the same Member-AS) as \"internal\".",
      "zh-CHS": "4) 当使用内部（IBGP学习）和外部（EBGP学习）规则比较路由时，将从同一联盟（不一定与成员相同）中的对等方学习的路由视为“内部”。"
    },
    {
      "indent": 0,
      "text": "6. Compatibility Considerations",
      "section_title": true,
      "zh-CHS": "6. 兼容性考虑"
    },
    {
      "indent": 3,
      "text": "All BGP speakers participating as members of a confederation MUST recognize the AS_CONFED_SET and AS_CONFED_SEQUENCE segment type extensions to the AS_PATH attribute.",
      "zh-CHS": "作为联盟成员参与的所有BGP演讲者必须识别as_CONFED_集合和as_CONFED_序列段类型扩展到as_路径属性。"
    },
    {
      "indent": 3,
      "text": "Any BGP speaker not supporting these extensions will generate a NOTIFICATION message specifying an \"UPDATE Message Error\" and a sub-code of \"Malformed AS_PATH\".",
      "zh-CHS": "任何不支持这些扩展的BGP扬声器将生成一条通知消息，指定“更新消息错误”和子代码“格式错误的AS_路径”。"
    },
    {
      "indent": 3,
      "text": "This compatibility issue implies that all BGP speakers participating in a confederation MUST support BGP confederations. However, BGP speakers outside the confederation need not support these extensions.",
      "zh-CHS": "此兼容性问题意味着所有参加联盟的BGP发言者必须支持BGP联盟。但是，联邦以外的BGP扬声器不需要支持这些扩展。"
    },
    {
      "indent": 0,
      "text": "7. Deployment Considerations",
      "section_title": true,
      "zh-CHS": "7. 部署注意事项"
    },
    {
      "indent": 3,
      "text": "BGP confederations have been widely deployed throughout the Internet for a number of years and are supported by multiple vendors.",
      "zh-CHS": "BGP联盟已经在互联网上广泛部署多年，并得到多家供应商的支持。"
    },
    {
      "indent": 3,
      "text": "Improper configuration of BGP confederations can cause routing information within an AS to be duplicated unnecessarily. This duplication of information will waste system resources, cause unnecessary route flaps, and delay convergence.",
      "zh-CHS": "BGP联盟的不当配置可能导致AS内的路由信息被不必要地复制。这种信息重复将浪费系统资源，导致不必要的路线调整，并延迟收敛。"
    },
    {
      "indent": 3,
      "text": "Care should be taken to manually filter duplicate advertisements caused by reachability information being relayed through multiple Member Autonomous Systems based upon the topology and redundancy requirements of the confederation.",
      "zh-CHS": "应注意根据联邦的拓扑和冗余要求，手动过滤通过多成员自治系统中继的可达性信息引起的重复广告。"
    },
    {
      "indent": 3,
      "text": "Additionally, confederations (as well as route reflectors), by excluding different reachability information from consideration at different locations in a confederation, have been shown [RFC3345] to cause permanent oscillation between candidate routes when using the tie-breaking rules required by BGP [BGP-4]. Care must be taken when selecting MED values and tie-breaking policy to avoid these situations.",
      "zh-CHS": "此外，联邦（以及路由反射器）通过排除联邦中不同位置的不同可达性信息[RFC3345]，在使用BGP[BGP-4]要求的平局打破规则时，会导致候选路由之间的永久振荡。在选择中间值和中断策略时必须小心，以避免这些情况。"
    },
    {
      "indent": 3,
      "text": "One potential way to avoid this is by configuring inter-Member-AS IGP metrics higher than intra-Member-AS IGP metrics and/or using other tie-breaking policies to avoid BGP route selection based on incomparable MEDs.",
      "zh-CHS": "避免这种情况的一种潜在方法是，将成员间配置为高于成员内的IGP度量，并/或使用其他中断连接策略，以避免基于不可比较MED的BGP路由选择。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "This extension to BGP does not change the underlying security issues inherent in the existing BGP protocol, such as those described in [RFC2385] and [BGP-VULN].",
      "zh-CHS": "对BGP的扩展不会改变现有BGP协议中固有的基本安全问题，如[RFC2385]和[BGP-VULN]中所述。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "zh-CHS": "9. 致谢"
    },
    {
      "indent": 3,
      "text": "The general concept of BGP confederations was taken from IDRP's Routing Domain Confederations [ISO10747]. Some of the introductory text in this document was taken from [RFC2796].",
      "zh-CHS": "BGP联盟的一般概念取自IDRP的路由域联盟[ISO10747]。本文件中的一些介绍性文本摘自[RFC2796]。"
    },
    {
      "indent": 3,
      "text": "The authors would like to acknowledge Jeffrey Haas for his extensive feedback on this document. We'd also like to thank Bruce Cole, Srihari Ramachandra, Alex Zinin, Naresh Kumar Paliwal, Jeffrey Haas, Cengiz Alaettinoglu, Mike Hollyman, and Bruno Rijsman for their feedback and suggestions.",
      "zh-CHS": "作者要感谢Jeffrey Haas对本文件的广泛反馈。我们还要感谢Bruce Cole、Srihari Ramachandra、Alex Zinin、Naresh Kumar Paliwal、Jeffrey Haas、Cengz Alaettinoglu、Mike Hollyman和Bruno Rijsman的反馈和建议。"
    },
    {
      "indent": 3,
      "text": "Finally, we'd like to acknowledge Ravi Chandra and Yakov Rekhter for providing constructive and valuable feedback on earlier versions of this specification.",
      "zh-CHS": "最后，我们要感谢Ravi Chandra和Yakov Rekhter为本规范的早期版本提供了建设性和有价值的反馈。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[BGP-4] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "zh-CHS": "[BGP-4]Rekhter，Y.，Ed.，Li，T.，Ed.，和S.Hares，Ed.，“边境网关协议4（BGP-4）”，RFC 42712006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC1965] Traina, P., \"Autonomous System Confederations for BGP\", RFC 1965, June 1996.",
      "zh-CHS": "[RFC1965]Traina，P.，“BGP自治系统联合会”，RFC1965，1996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3065] Traina, P., McPherson, D., and J. Scudder, \"Autonomous System Confederations for BGP\", RFC 3065, February 2001.",
      "zh-CHS": "[RFC3065]Traina，P.，McPherson，D.，和J.Scudder，“BGP自治系统联合会”，RFC 3065，2001年2月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[ISO10747] Kunzinger, C., Editor, \"Inter-Domain Routing Protocol\", ISO/IEC 10747, October 1993.",
      "zh-CHS": "[ISO10747]Kunzinger，C.，编辑，“域间路由协议”，ISO/IEC 10747，1993年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1863] Haskin, D., \"A BGP/IDRP Route Server alternative to a full mesh routing\", RFC 1863, October 1995.",
      "zh-CHS": "[RFC1863]Haskin，D.，“全网状路由的BGP/IDRP路由服务器替代方案”，RFC 1863，1995年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2385] Heffernan, A., \"Protection of BGP Sessions via the TCP MD5 Signature Option\", RFC 2385, August 1998.",
      "zh-CHS": "[RFC2385]Heffernan，A.，“通过TCP MD5签名选项保护BGP会话”，RFC 2385，1998年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3345] McPherson, D., Gill, V., Walton, D., and A. Retana, \"Border Gateway Protocol (BGP) Persistent Route Oscillation Condition\", RFC 3345, August 2002.",
      "zh-CHS": "[RFC3345]McPherson，D.，Gill，V.，Walton，D.，和A.Retana，“边界网关协议（BGP）持续路由振荡条件”，RFC 33452002年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4223] Savola, P., \"Reclassification of RFC 1863 to Historic\", RFC 4223, October 2005.",
      "zh-CHS": "[RFC4223]Savola，P.，“将RFC 1863重新分类为历史”，RFC 42232005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4272] Murphy, S., \"BGP Security Vulnerabilities Analysis\", RFC 4272, January 2006.",
      "zh-CHS": "[RFC4272]Murphy，S.，“BGP安全漏洞分析”，RFC 4272，2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4456] Bates, T., Chen, E., and R. Chandra, \"BGP Route Reflection: An Alternative to Full Mesh Internal BGP (IBGP)\", RFC 4456, April 2006.",
      "zh-CHS": "[RFC4456]Bates，T.，Chen，E.，和R.Chandra，“BGP路由反射：全网格内部BGP（IBGP）的替代方案”，RFC 4456，2006年4月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Aggregate Routing Information",
      "section_title": true,
      "zh-CHS": "附录A.汇总路由信息"
    },
    {
      "indent": 3,
      "text": "As a practical matter, aggregation as discussed in [BGP-4], Section 9.2.2.2, is not generally employed within confederations. However, in the event that such aggregation is performed within a confederation, the rules of [BGP-4] should be followed, making the necessary substitutions between AS_SET and AS_CONFED_SET and similarly, AS_SEQUENCE and AS_CONFED_SEQUENCE. Confederation-type segments (AS_CONFED_SET and AS_CONFED_SEQUENCE) MUST be kept separate from non-confederation segments (AS_SET and AS_SEQUENCE). An implementation could also choose to provide a form of aggregation wherein non-confederation segments are aggregated as discussed in [BGP-4], Section 9.2.2.2, and confederation-type segments are not aggregated.",
      "zh-CHS": "作为一个实际问题，[BGP-4]第9.2.2.2节中讨论的聚合一般不在联邦内使用。然而，如果这种聚合是在联邦内进行的，则应遵循[BGP-4]的规则，在AS_集和AS_CONFED_集以及类似的AS_序列和AS_CONFED_序列之间进行必要的替换。联盟类型段（AS_集合和AS_集合序列）必须与非联盟段（AS_集合和AS_序列）分开。实现还可以选择提供一种聚合形式，其中按照[BGP-4]第9.2.2.2节的讨论聚合非联盟段，并且不聚合联盟类型段。"
    },
    {
      "indent": 3,
      "text": "Support for aggregation of confederation-type segments is not mandatory.",
      "zh-CHS": "对联盟类型段聚合的支持不是强制性的。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Changes from RFC 3065",
      "section_title": true,
      "zh-CHS": "附录B.RFC 3065的变更"
    },
    {
      "indent": 3,
      "text": "The primary trigger for an update to RFC 3065 was regarding issues associated with AS path segment handling, in particular what to do when interacting with BGP peers external to a confederation and to ensure AS_CONFED_[SET|SEQUENCE] segment types are not propagated to peers outside of a confederation.",
      "zh-CHS": "RFC 3065更新的主要触发因素是与AS路径段处理相关的问题，特别是当与联盟外部的BGP对等方进行交互时应该做什么，以及确保AS_CONFED_[SET | SEQUENCE]段类型不会传播到联盟外部的对等方。"
    },
    {
      "indent": 3,
      "text": "As such, the \"Error Handling\" section above was added and applies not only to BGP confederation speakers, but to all BGP speakers.",
      "zh-CHS": "因此，添加了上述“错误处理”部分，不仅适用于BGP联盟扬声器，而且适用于所有BGP扬声器。"
    },
    {
      "indent": 3,
      "text": "Other changes are mostly trivial and surrounding some clarification and consistency in terminology and denoting that AS_CONFED_[SET|SEQUENCE] Segment Type handling should be just as it is in the base BGP specification [BGP-4].",
      "zh-CHS": "其他变化大多是琐碎的，围绕术语的澄清和一致性，并表示AS_-CONFED_124;[SET | SEQUENCE]段类型处理应该与基本BGP规范[BGP-4]中的一样。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Paul Traina Blissfully Retired Email: bgp-confederations@st04.pst.org",
      "zh-CHS": "保罗·特拉纳幸福退休电子邮件：bgp-confederations@st04.pst.org"
    },
    {
      "indent": 3,
      "text": "Danny McPherson Arbor Networks EMail: danny@arbor.net",
      "zh-CHS": "Danny McPherson Arbor Networks电子邮件：danny@arbor.net"
    },
    {
      "indent": 3,
      "text": "John G. Scudder Juniper Networks EMail: jgs@juniper.net",
      "zh-CHS": "John G.Scudder Juniper Networks电子邮件：jgs@juniper.net"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "zh-CHS": "版权所有（C）IETF信托基金（2007年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "zh-CHS": "确认"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "zh-CHS": "RFC编辑功能的资金目前由互联网协会提供。"
    }
  ]
}