{
  "title": {
    "text": "RFC 5316: ISIS Extensions in Support of Inter-Autonomous System (AS) MPLS and GMPLS Traffic Engineering",
    "zh-CHS": "RFC 5316"
  },
  "number": 5316,
  "created_at": "2021-11-10 20:23:25.579550+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            M. Chen\nRequest for Comments: 5316                                      R. Zhang\nCategory: Standards Track                   Huawei Technologies Co., Ltd\n                                                                 X. Duan\n                                                            China Mobile\n                                                           December 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "ISIS Extensions in Support of Inter-Autonomous System (AS) MPLS and GMPLS Traffic Engineering",
      "zh-CHS": "ISIS扩展支持自治系统间（AS）MPLS和GMPLS流量工程"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2008 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2008 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/ license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/ 许可证信息）在本文件发布之日生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes extensions to the ISIS (ISIS) protocol to support Multiprotocol Label Switching (MPLS) and Generalized MPLS (GMPLS) Traffic Engineering (TE) for multiple Autonomous Systems (ASes). It defines ISIS-TE extensions for the flooding of TE information about inter-AS links, which can be used to perform inter-AS TE path computation.",
      "zh-CHS": "本文档描述了ISIS（ISIS）协议的扩展，以支持多个自治系统（ASE）的多协议标签交换（MPLS）和通用MPLS（GMPLS）流量工程（TE）。它定义了ISIS-TE扩展，用于泛洪有关AS间链路的TE信息，可用于执行AS间TE路径计算。"
    },
    {
      "indent": 3,
      "text": "No support for flooding information from within one AS to another AS is proposed or defined in this document.",
      "zh-CHS": "不支持本文件中提议或定义的从一个内部到另一个的洪水信息。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Conventions Used in This Document ..........................3\n2. Problem Statement ...............................................3\n   2.1. A Note on Non-Objectives ...................................4\n   2.2. Per-Domain Path Determination ..............................4\n   2.3. Backward Recursive Path Computation ........................6\n3. Extensions to ISIS-TE ...........................................7\n   3.1. Inter-AS Reachability TLV ..................................7\n   3.2. TE Router ID ...............................................9\n   3.3. Sub-TLV Detail .............................................9\n        3.3.1. Remote AS Number Sub-TLV ............................9\n        3.3.2. IPv4 Remote ASBR ID Sub-TLV ........................10\n        3.3.3. IPv6 Remote ASBR ID Sub-TLV ........................11\n        3.3.4. IPv4 TE Router ID sub-TLV ..........................11\n        3.3.5. IPv6 TE Router ID sub-TLV ..........................12\n4. Procedure for Inter-AS TE Links ................................12\n   4.1. Origin of Proxied TE Information ..........................14\n5. Security Considerations ........................................14\n6. IANA Considerations ............................................15\n   6.1. Inter-AS Reachability TLV .................................15\n   6.2. Sub-TLVs for the Inter-AS Reachability TLV ................15\n   6.3. Sub-TLVs for the IS-IS Router Capability TLV ..............17\n7. Acknowledgments ................................................17\n8. References .....................................................17\n   8.1. Normative References ......................................17\n   8.2. Informative References ....................................17",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "[ISIS-TE] defines extensions to the ISIS protocol [ISIS] to support intra-area Traffic Engineering (TE). The extensions provide a way of encoding the TE information for TE-enabled links within the network (TE links) and flooding this information within an area. The extended IS reachability TLV and traffic engineering router ID TLV, which are defined in [ISIS-TE], are used to carry such TE information. The extended IS reachability TLV has several nested sub-TLVs that describe the TE attributes for a TE link.",
      "zh-CHS": "[ISIS-TE]定义了ISIS协议[ISIS]的扩展，以支持区域内流量工程（TE）。扩展提供了一种对网络中启用TE的链路（TE链路）的TE信息进行编码的方法，并在一个区域内传播该信息。扩展IS可达性TLV和[ISIS-TE]中定义的流量工程路由器ID TLV用于承载此类TE信息。扩展IS可达性TLV有几个嵌套的子TLV，它们描述TE链路的TE属性。"
    },
    {
      "indent": 3,
      "text": "[ISIS-TE-V3] and [GMPLS-TE] define similar extensions to ISIS [ISIS] in support of IPv6 and GMPLS traffic engineering, respectively.",
      "zh-CHS": "[ISIS-TE-V3]和[GMPLS-TE]分别定义了ISIS[ISIS]的类似扩展，以支持IPv6和GMPLS流量工程。"
    },
    {
      "indent": 3,
      "text": "Requirements for establishing Multiprotocol Label Switching (MPLS) TE Label Switched Paths (LSPs) that cross multiple Autonomous Systems (ASes) are described in [INTER-AS-TE-REQ]. As described in [INTER-AS-TE-REQ], a method SHOULD provide the ability to compute a path spanning multiple ASes. So a path computation entity that may be the",
      "zh-CHS": "[INTER-AS-TE-REQ]中描述了建立跨多个自治系统（ASE）的多协议标签交换（MPLS）TE标签交换路径（LSP）的要求。如[INTER-As-TE-REQ]中所述，方法应提供计算跨越多个ASE的路径的能力。因此，路径计算实体可能是"
    },
    {
      "indent": 3,
      "text": "head-end Label Switching Router (LSR), an AS Border Router (ASBR), or a Path Computation Element (PCE [PCE]) needs to know the TE information not only of the links within an AS, but also of the links that connect to other ASes.",
      "zh-CHS": "前端标签交换路由器（LSR）、AS边界路由器（ASBR）或路径计算元件（PCE[PCE]）不仅需要知道AS内链路的TE信息，还需要知道连接到其他ASE的链路的TE信息。"
    },
    {
      "indent": 3,
      "text": "In this document, a new TLV, which is referred to as the inter-AS reachability TLV, is defined to advertise inter-AS TE information, and three new sub-TLVs are defined for inclusion in the inter-AS reachability TLV to carry the information about the remote AS number and remote ASBR ID. The sub-TLVs defined in [ISIS-TE], [ISIS-TE-V3], and other documents for inclusion in the extended IS reachability TLV for describing the TE properties of a TE link are applicable to be included in the inter-AS reachability TLV for describing the TE properties of an inter-AS TE link as well. Also, two more new sub-TLVs are defined for inclusion in the IS-IS router capability TLV to carry the TE Router ID when the TE Router ID needs to reach all routers within an entire ISIS routing domain. The extensions are equally applicable to IPv4 and IPv6 as identical extensions to [ISIS-TE] and [ISIS-TE-V3]. Detailed definitions and procedures are discussed in the following sections.",
      "zh-CHS": "在本文件中，定义了一个新的TLV，称为inter-as可达性TLV，用于公布inter-as-TE信息，并定义了三个新的子TLV，用于包含在inter-as可达性TLV中，以携带有关远程as编号和远程ASBR ID的信息。子TLV在[ISIS-TE]、[ISIS-TE-V3]中定义，用于描述TE链路的TE属性的扩展IS可达性TLV中包含的其他文档也适用于被包括在用于描述AS-TE链路的TE属性的inter-AS可达性TLV中。此外，还定义了两个新的子TLV，以包含在IS-IS路由器功能TLV中，以便在TE路由器ID需要到达整个ISIS路由域内的所有路由器时携带TE路由器ID。这些扩展与[ISIS-TE]和[ISIS-TE-V3]的相同扩展同样适用于IPv4和IPv6。详细的定义和程序将在以下章节中讨论。"
    },
    {
      "indent": 3,
      "text": "This document does not propose or define any mechanisms to advertise any other extra-AS TE information within ISIS. See Section 2.1 for a full list of non-objectives for this work.",
      "zh-CHS": "本文件不建议或定义在ISIS内宣传任何其他额外信息的任何机制。有关本工作的非目标的完整列表，请参见第2.1节。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "zh-CHS": "1.1. 本文件中使用的公约"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC-2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC-2119[RFC2119]中的说明进行解释。"
    },
    {
      "indent": 0,
      "text": "2. Problem Statement",
      "section_title": true,
      "zh-CHS": "2. 问题陈述"
    },
    {
      "indent": 3,
      "text": "As described in [INTER-AS-TE-REQ], in the case of establishing an inter-AS TE LSP that traverses multiple ASes, the Path message [RFC3209] may include the following elements in the Explicit Route Object (ERO) in order to describe the path of the LSP:",
      "zh-CHS": "如[INTER-As-TE-REQ]中所述，在建立穿越多个As的INTER-As-TE LSP的情况下，路径消息[RFC3209]可以在显式路由对象（ERO）中包括以下元素，以便描述LSP的路径："
    },
    {
      "indent": 3,
      "text": "- a set of AS numbers as loose hops, and/or",
      "zh-CHS": "- 一组AS编号，如松散的啤酒花，和/或"
    },
    {
      "indent": 3,
      "text": "- a set of LSRs including ASBRs as loose hops.",
      "zh-CHS": "- 一组LSR，包括作为松散跃点的ASBR。"
    },
    {
      "indent": 3,
      "text": "Two methods for determining inter-AS paths are currently being discussed. The per-domain method [PD-PATH] determines the path one domain at a time. The backward recursive method [BRPC] uses cooperation between PCEs to determine an optimum inter-domain path. The sections that follow examine how inter-AS TE link information could be useful in both cases.",
      "zh-CHS": "目前正在讨论两种确定AS间路径的方法。每域方法[PD-PATH]一次确定一个域的路径。反向递归方法[BRPC]使用PCE之间的协作来确定最佳域间路径。接下来的部分将研究在这两种情况下，AS TE链接信息是如何有用的。"
    },
    {
      "indent": 0,
      "text": "2.1. A Note on Non-Objectives",
      "section_title": true,
      "zh-CHS": "2.1. 关于非目标的说明"
    },
    {
      "indent": 3,
      "text": "It is important to note that this document does not make any change to the confidentiality and scaling assumptions surrounding the use of ASes in the Internet. In particular, this document is conformant to the requirements set out in [INTER-AS-TE-REQ].",
      "zh-CHS": "需要注意的是，本文件并未对互联网中ASE使用的保密性和可扩展性假设进行任何更改。特别是，本文件符合[INTER-AS-TE-REQ]中规定的要求。"
    },
    {
      "indent": 3,
      "text": "The following features are explicitly excluded:",
      "zh-CHS": "明确排除以下功能："
    },
    {
      "indent": 3,
      "text": "o There is no attempt to distribute TE information from within one AS to another AS.",
      "zh-CHS": "o 没有试图将TE信息从一个AS内部分发到另一个AS。"
    },
    {
      "indent": 3,
      "text": "o There is no mechanism proposed to distribute any form of TE reachability information for destinations outside the AS.",
      "zh-CHS": "o 没有任何机制建议为AS之外的目的地分发任何形式的TE可达性信息。"
    },
    {
      "indent": 3,
      "text": "o There is no proposed change to the PCE architecture or usage.",
      "zh-CHS": "o PCE架构或使用未提出变更。"
    },
    {
      "indent": 3,
      "text": "o TE aggregation is not supported or recommended.",
      "zh-CHS": "o 不支持或不推荐TE聚合。"
    },
    {
      "indent": 3,
      "text": "o There is no exchange of private information between ASes.",
      "zh-CHS": "o ASE之间不交换私人信息。"
    },
    {
      "indent": 3,
      "text": "o No ISIS adjacencies are formed on the inter-AS link.",
      "zh-CHS": "o 在AS间链路上不形成ISIS邻接。"
    },
    {
      "indent": 0,
      "text": "2.2. Per-Domain Path Determination",
      "section_title": true,
      "zh-CHS": "2.2. 每域路径确定"
    },
    {
      "indent": 3,
      "text": "In the per-domain method of determining an inter-AS path for an MPLS-TE LSP, when an LSR that is an entry-point to an AS receives a Path message from an upstream AS with an ERO containing a next hop that is an AS number, it needs to find which LSRs (ASBRs) within the local AS are connected to the downstream AS. That way, it can compute a TE LSP segment across the local AS to one of those LSRs and forward the Path message to that LSR and hence into the next AS. See Figure 1 for an example.",
      "zh-CHS": "在确定MPLS-TE LSP的AS间路径的每域方法中，当作为AS入口点的LSR从上游AS接收到路径消息，其中ERO包含作为AS编号的下一跳时，它需要找到本地AS内哪些LSR（asbr）连接到下游AS。通过这种方式，它可以跨本地AS计算这些LSR之一的TE LSP段，并将路径消息转发到该LSR，从而转发到下一个AS。有关示例，请参见图1。"
    },
    {
      "indent": 16,
      "text": "R1------R3----R5-----R7------R9-----R11\n        |     | \\    |      / |\n        |     |  \\   |  ----  |\n        |     |   \\  | /      |\nR2------R4----R6   --R8------R10----R12\n           :              :\n<-- AS1 -->:<---- AS2 --->:<--- AS3 --->",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 1: Inter-AS Reference Model",
      "zh-CHS": "图1:Inter AS参考模型"
    },
    {
      "indent": 3,
      "text": "The figure shows three ASes (AS1, AS2, and AS3) and twelve LSRs (R1 through R12). R3 and R4 are ASBRs in AS1. R5, R6, R7, and R8 are ASBRs in AS2. R9 and R10 are ASBRs in AS3.",
      "zh-CHS": "该图显示了三个ASE（AS1、AS2和AS3）和十二个LSR（R1到R12）。R3和R4是AS1中的ASBR。R5、R6、R7和R8是AS2中的ASBR。R9和R10是AS3中的ASBR。"
    },
    {
      "indent": 3,
      "text": "If an inter-AS TE LSP is planned to be established from R1 to R12, the AS sequence will be: AS1, AS2, AS3.",
      "zh-CHS": "如果计划从R1到R12建立AS间TE LSP，AS序列将为：AS1、AS2、AS3。"
    },
    {
      "indent": 3,
      "text": "Suppose that the Path message enters AS2 from R3. The next hop in the ERO shows AS3, and R5 must determine a path segment across AS2 to reach AS3. It has a choice of three exit points from AS2 (R6, R7, and R8), and it needs to know which of these provide TE connectivity to AS3, and whether the TE connectivity (for example, available bandwidth) is adequate for the requested LSP.",
      "zh-CHS": "假设Path消息从R3进入AS2。ERO中的下一个跃点显示AS3，R5必须确定跨越AS2到达AS3的路径段。它可以从AS2（R6、R7和R8）选择三个出口点，并且需要知道其中哪一个提供到AS3的TE连接，以及TE连接（例如，可用带宽）是否足以满足请求的LSP。"
    },
    {
      "indent": 3,
      "text": "Alternatively, if the next hop in the ERO is the entry ASBR for AS3 (say R9), R5 needs to know which of its exit ASBRs has a TE link that connects to R9. Since there may be multiple ASBRs that are connected to R9 (both R7 and R8 in this example), R5 also needs to know the TE properties of the inter-AS TE links so that it can select the correct exit ASBR.",
      "zh-CHS": "或者，如果ERO中的下一个跃点是AS3的入口ASBR（比如R9），则R5需要知道其出口ASBR中的哪个具有连接到R9的TE链路。由于可能有多个ASBR连接到R9（本例中为R7和R8），因此R5还需要知道AS TE间链路的TE属性，以便选择正确的退出ASBR。"
    },
    {
      "indent": 3,
      "text": "Once the Path message reaches the exit ASBR, any choice of inter-AS TE link can be made by the ASBR if not already made by the entry ASBR that computed the segment.",
      "zh-CHS": "一旦Path消息到达出口ASBR，ASBR可以选择任何AS TE链接，如果计算段的入口ASBR尚未选择。"
    },
    {
      "indent": 3,
      "text": "More details can be found in Section 4 of [PD-PATH], which clearly points out why advertising of inter-AS links is desired.",
      "zh-CHS": "更多细节见[PD-PATH]的第4节，该节明确指出了为什么需要进行内部AS链接广告。"
    },
    {
      "indent": 3,
      "text": "To enable R5 to make the correct choice of exit ASBR, the following information is needed:",
      "zh-CHS": "为了使R5能够正确选择退出ASBR，需要以下信息："
    },
    {
      "indent": 3,
      "text": "o List of all inter-AS TE links for the local AS.",
      "zh-CHS": "o 本地AS的所有AS-TE链接列表。"
    },
    {
      "indent": 3,
      "text": "o TE properties of each inter-AS TE link.",
      "zh-CHS": "o 每个inter AS TE链路的TE属性。"
    },
    {
      "indent": 3,
      "text": "o AS number of the neighboring AS connected to by each inter-AS TE link.",
      "zh-CHS": "o 每个AS-TE链路连接到的相邻AS的数量。"
    },
    {
      "indent": 3,
      "text": "o Identity (TE Router ID) of the neighboring ASBR connected to by each inter-AS TE link.",
      "zh-CHS": "o 每个AS-TE链路连接到的相邻ASBR的标识（TE路由器ID）。"
    },
    {
      "indent": 3,
      "text": "In GMPLS networks, further information may also be required to select the correct TE links as defined in [GMPLS-TE].",
      "zh-CHS": "在GMPLS网络中，可能还需要更多信息来选择[GMPLS-TE]中定义的正确TE链路。"
    },
    {
      "indent": 3,
      "text": "The example above shows how this information is needed at the entry-point ASBRs for each AS (or the PCEs that provide computation services for the ASBRs). However, this information is also needed throughout the local AS if path computation functionality is fully distributed among LSRs in the local AS, for example to support LSPs that have start points (ingress nodes) within the AS.",
      "zh-CHS": "上面的示例显示了每个AS（或为ASBR提供计算服务的PCE）在入口点ASBR处如何需要此信息。然而，在整个本地AS中也需要该信息，就好像路径计算功能在本地AS中的lsr之间完全分布一样，例如，为了支持在AS中具有起点（入口节点）的lsp。"
    },
    {
      "indent": 0,
      "text": "2.3. Backward Recursive Path Computation",
      "section_title": true,
      "zh-CHS": "2.3. 反向递归路径计算"
    },
    {
      "indent": 3,
      "text": "Another scenario using PCE techniques has the same problem. [BRPC] defines a PCE-based TE LSP computation method (called Backward Recursive Path Computation) to compute optimal inter-domain constrained MPLS-TE or GMPLS LSPs. In this path computation method, a specific set of traversed domains (ASes) are assumed to be selected before computation starts. Each downstream PCE in domain(i) returns to its upstream neighbor PCE in domain(i-1) a multipoint-to-point tree of potential paths. Each tree consists of the set of paths from all boundary nodes located in domain(i) to the destination where each path satisfies the set of required constraints for the TE LSP (bandwidth, affinities, etc.).",
      "zh-CHS": "另一个使用PCE技术的场景也有同样的问题。[BRPC]定义了一种基于PCE的TE LSP计算方法（称为反向递归路径计算），用于计算最优域间约束MPLS-TE或GMPLS LSP。在这种路径计算方法中，假设在计算开始之前选择一组特定的遍历域（ASE）。域（i）中的每个下游PCE向其域（i-1）中的上游邻居PCE返回潜在路径的多点到点树。每个树由从位于域（i）中的所有边界节点到目的地的路径集组成，其中每个路径满足TE LSP所需的约束集（带宽、亲和力等）。"
    },
    {
      "indent": 3,
      "text": "So a PCE needs to select boundary nodes (that is, ASBRs) that provide connectivity from the upstream AS. In order for the tree of paths provided by one PCE to its neighbor to be correlated, the identities of the ASBRs for each path need to be referenced. Thus, the PCE must know the identities of the ASBRs in the remote AS that are reached by any inter-AS TE link, and, in order to provide only suitable paths in the tree, the PCE must know the TE properties of the inter-AS TE links. See the following figure as an example.",
      "zh-CHS": "因此，PCE需要选择边界节点（即ASBR），以从上游AS提供连接。为了将一个PCE提供给其邻居的路径树关联起来，需要引用每个路径的ASBR的标识。因此，PCE必须知道任何AS-TE链路到达的远程AS中的asbr的身份，并且，为了在树中仅提供合适的路径，PCE必须知道AS-TE链路的TE属性。请参见下图作为示例。"
    },
    {
      "indent": 16,
      "text": "   PCE1<------>PCE2<-------->PCE3\n   /       :             :\n  /        :             :\nR1------R3----R5-----R7------R9-----R11\n        |     | \\    |      / |\n        |     |  \\   |  ----  |\n        |     |   \\  | /      |\nR2------R4----R6   --R8------R10----R12\n           :              :\n<-- AS1 -->:<---- AS2 --->:<--- AS3 --->",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 15,
      "text": "Figure 2: BRPC for Inter-AS Reference Model",
      "zh-CHS": "图2:Inter AS参考模型的BRPC"
    },
    {
      "indent": 3,
      "text": "The figure shows three ASes (AS1, AS2, and AS3), three PCEs (PCE1, PCE2, and PCE3), and twelve LSRs (R1 through R12). R3 and R4 are ASBRs in AS1. R5, R6, R7, and R8 are ASBRs in AS2. R9 and R10 are ASBRs in AS3. PCE1, PCE2, and PCE3 cooperate to perform inter-AS path computation and are responsible for path segment computation within their own domain(s).",
      "zh-CHS": "该图显示了三个ASE（AS1、AS2和AS3）、三个PCE（PCE1、PCE2和PCE3）和十二个LSR（R1到R12）。R3和R4是AS1中的ASBR。R5、R6、R7和R8是AS2中的ASBR。R9和R10是AS3中的ASBR。PCE1、PCE2和PCE3协同执行AS间路径计算，并负责各自域内的路径段计算。"
    },
    {
      "indent": 3,
      "text": "If an inter-AS TE LSP is planned to be established from R1 to R12, the traversed domains are assumed to be selected: AS1->AS2->AS3, and the PCE chain is: PCE1->PCE2->PCE3. First, the path computation request originated from the PCC (R1) is relayed by PCE1 and PCE2 along the PCE chain to PCE3. Then, PCE3 begins to compute the path",
      "zh-CHS": "如果计划从R1到R12建立AS-TE间LSP，则假定选择了经过的域：AS1->AS2->AS3，PCE链为：PCE1->PCE2->PCE3。首先，来自PCC（R1）的路径计算请求由PCE1和PCE2沿着PCE链中继到PCE3。然后，PCE3开始计算路径"
    },
    {
      "indent": 3,
      "text": "segments from the entry boundary nodes that provide connection from AS2 to the destination (R12). But, to provide suitable path segments, PCE3 must determine which entry boundary nodes provide connectivity to its upstream neighbor AS (identified by its AS number), and must know the TE properties of the inter-AS TE links. In the same way, PCE2 also needs to determine the entry boundary nodes according to its upstream neighbor AS and the inter-AS TE link capabilities.",
      "zh-CHS": "来自入口边界节点的段，提供从AS2到目标（R12）的连接。但是，为了提供合适的路径段，PCE3必须确定哪些入口边界节点提供到其上游邻居AS的连接（由其AS编号标识），并且必须知道AS-TE间链路的TE属性。同样，PCE2还需要根据其上游邻居AS和AS-TE间链路能力来确定入口边界节点。"
    },
    {
      "indent": 3,
      "text": "Thus, to support Backward Recursive Path Computation, the same information listed in Section 2.2 is required. The AS number of the neighboring AS connected to by each inter-AS TE link is particularly important.",
      "zh-CHS": "因此，为了支持反向递归路径计算，需要第2.2节中列出的相同信息。每个AS-TE链路连接到的相邻AS的AS数量尤其重要。"
    },
    {
      "indent": 0,
      "text": "3. Extensions to ISIS-TE",
      "section_title": true,
      "zh-CHS": "3. ISIS-TE的扩展"
    },
    {
      "indent": 3,
      "text": "Note that this document does not define mechanisms for distribution of TE information from one AS to another, does not distribute any form of TE reachability information for destinations outside the AS, does not change the PCE architecture or usage, does not suggest or recommend any form of TE aggregation, and does not feed private information between ASes. See Section 2.1.",
      "zh-CHS": "注意，本文件未定义从一个AS到另一个AS的TE信息分发机制，未为AS之外的目的地分发任何形式的TE可达性信息，未更改PCE架构或使用，未建议或推荐任何形式的TE聚合，并且不会在ASE之间提供私人信息。见第2.1节。"
    },
    {
      "indent": 3,
      "text": "In this document, for the advertisement of inter-AS TE links, a new TLV, which is referred to as the inter-AS reachability TLV, is defined. Three new sub-TLVs are also defined for inclusion in the inter-AS reachability TLV to carry the information about the neighboring AS number and the remote ASBR ID of an inter-AS link. The sub-TLVs defined in [ISIS-TE], [ISIS-TE-V3], and other documents for inclusion in the extended IS reachability TLV are applicable to be included in the inter-AS reachability TLV for inter-AS TE links advertisement. Also, two other new sub-TLVs are defined for inclusion in the IS-IS router capability TLV to carry the TE Router ID when the TE Router ID is needed to reach all routers within an entire ISIS routing domain.",
      "zh-CHS": "在本文件中，为了公布AS-TE链路，定义了一种新的TLV，称为AS-TE链路间可达性TLV。还定义了三个新的子TLV，用于包含在inter-AS可达性TLV中，以携带关于相邻AS号和inter-AS链路的远程ASBR ID的信息。[ISIS-TE]、[ISIS-TE-V3]和其他文件中定义的子TLV可包含在扩展IS可达性TLV中，适用于包含在AS-TE间链路广告的AS间可达性TLV中。此外，定义了另外两个新的子TLV，以便在需要TE路由器ID到达整个ISIS路由域内的所有路由器时，将其包含在IS-IS路由器能力TLV中，以携带TE路由器ID。"
    },
    {
      "indent": 3,
      "text": "While some of the TE information of an inter-AS TE link may be available within the AS from other protocols, in order to avoid any dependency on where such protocols are processed, this mechanism carries all the information needed for the required TE operations.",
      "zh-CHS": "虽然AS间TE链路的一些TE信息可以从其他协议在AS内可用，但为了避免对处理此类协议的位置的任何依赖，该机制携带所需TE操作所需的所有信息。"
    },
    {
      "indent": 0,
      "text": "3.1. Inter-AS Reachability TLV",
      "section_title": true,
      "zh-CHS": "3.1. 内部AS可达性TLV"
    },
    {
      "indent": 3,
      "text": "The inter-AS reachability TLV has type 141 (see Section 6.1) and contains a data structure consisting of:",
      "zh-CHS": "AS间可达性TLV的类型为141（见第6.1节），包含一个数据结构，包括："
    },
    {
      "indent": 6,
      "text": "o  4 octets of Router ID\no  3 octets of default metric\no  1 octet of control information, consisting of:\n   -  1 bit of flooding-scope information (S bit)\n   -  1 bit of up/down information (D bit)\n   -  6 bits reserved\no  1 octet of length of sub-TLVs\no  0-246 octets of sub-TLVs, where each sub-TLV consists of a\n   sequence of:\n   -  1 octet of sub-type\n   -  1 octet of length of the value field of the sub-TLV\n   -  0-244 octets of value",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Compared to the extended reachability TLV, which is defined in [ISIS-TE], the inter-AS reachability TLV replaces the \"7 octets of System ID and Pseudonode Number\" field with a \"4 octets of Router ID\" field and introduces an extra \"control information\" field, which consists of a flooding-scope bit (S bit), an up/down bit (D bit), and 6 reserved bits.",
      "zh-CHS": "与[ISIS-TE]中定义的扩展可达性TLV相比，内部AS可达性TLV将“系统ID和伪节点号的7个八位字节”字段替换为“路由器ID的4个八位字节”字段，并引入一个额外的“控制信息”字段，该字段由泛洪作用域位（S位）、上/下位（D位）组成，和6个保留位。"
    },
    {
      "indent": 3,
      "text": "The Router ID field of the inter-AS reachability TLV is 4 octets in length, which contains the Router ID of the router who generates the inter-AS reachability TLV. The Router ID MUST be unique within the ISIS area. If the router generates inter-AS reachability TLV with entire ISIS routing domain flooding scope, then the Router ID MUST also be unique within the entire ISIS routing domain. The Router ID could be used to indicate the source of the inter-AS reachability TLV.",
      "zh-CHS": "inter-AS可达性TLV的路由器ID字段长度为4个八位字节，其中包含生成inter-AS可达性TLV的路由器的路由器ID。路由器ID在ISIS区域内必须是唯一的。如果路由器在整个ISIS路由域泛洪范围内生成AS间可达性TLV，则路由器ID在整个ISIS路由域内也必须是唯一的。路由器ID可用于指示inter AS可达性TLV的来源。"
    },
    {
      "indent": 3,
      "text": "The flooding procedures for inter-AS reachability TLV are identical to the flooding procedures for the GENINFO TLV, which are defined in Section 4 of [GENINFO]. These procedures have been previously discussed in [ISIS-CAP]. The flooding-scope bit (S bit) SHOULD be set to 0 if the flooding scope is to be limited to within the single IGP area to which the ASBR belongs. It MAY be set to 1 if the information is intended to reach all routers (including area border routers, ASBRs, and PCEs) in the entire ISIS routing domain. The choice between the use of 0 or 1 is an AS-wide policy choice, and configuration control SHOULD be provided in ASBR implementations that support the advertisement of inter-AS TE links.",
      "zh-CHS": "AS间可达性TLV的泛洪程序与GENINFO TLV的泛洪程序相同，其定义见[GENINFO]第4节。这些程序之前已在[ISIS-CAP]中讨论过。如果泛洪范围限制在ASBR所属的单个IGP区域内，则泛洪范围位应设置为0。如果信息旨在到达整个ISIS路由域中的所有路由器（包括区域边界路由器、ASBR和PCE），则可将其设置为1。在使用0或1之间的选择是一个尽可能广泛的策略选择，并且应在支持AS TE间链路广告的ASBR实现中提供配置控制。"
    },
    {
      "indent": 3,
      "text": "The sub-TLVs defined in [ISIS-TE], [ISIS-TE-V3], and other documents for describing the TE properties of a TE link are also applicable to the inter-AS reachability TLV for describing the TE properties of an inter-AS TE link. Apart from these sub-TLVs, three new sub-TLVs are defined for inclusion in the inter-AS reachability TLV defined in this document:",
      "zh-CHS": "[ISIS-TE]、[ISIS-TE-V3]和其他描述TE链路TE属性的文件中定义的子TLV也适用于描述AS-TE链路TE属性的AS间可达性TLV。除这些子TLV外，定义了三个新的子TLV，以将其包含在本文件中定义的inter AS可达性TLV中："
    },
    {
      "indent": 3,
      "text": "Sub-TLV type    Length  Name\n------------    ------  ---------------------------\n          24        4   remote AS number\n          25        4   IPv4 remote ASBR identifier\n          26       16   IPv6 remote ASBR identifier",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The detailed definitions of the three new sub-TLVs are described in Section 3.3.",
      "zh-CHS": "第3.3节描述了三个新子TLV的详细定义。"
    },
    {
      "indent": 0,
      "text": "3.2. TE Router ID",
      "section_title": true,
      "zh-CHS": "3.2. TE路由器ID"
    },
    {
      "indent": 3,
      "text": "The IPv4 TE Router ID TLV and IPv6 TE Router ID TLV, which are defined in [ISIS-TE] and [ISIS-TE-V3] respectively, only have area flooding-scope. When performing inter-AS TE, the TE Router ID MAY be needed to reach all routers within an entire ISIS routing domain and it MUST have the same flooding scope as the inter-AS reachability TLV does.",
      "zh-CHS": "[ISIS-TE]和[ISIS-TE-V3]中分别定义的IPv4 TE路由器ID TLV和IPv6 TE路由器ID TLV仅具有区域泛洪范围。当执行inter-AS-TE时，TE路由器ID可能需要到达整个ISIS路由域内的所有路由器，并且它必须与inter-AS-TE具有与可达性TLV相同的泛洪范围。"
    },
    {
      "indent": 3,
      "text": "[ISIS-CAP] defines a generic advertisement mechanism for ISIS, which allows a router to advertise its capabilities within an ISIS area or an entire ISIS routing domain. [ISIS-CAP] also points out that the TE Router ID is a candidate to be carried in the IS-IS router capability TLV when performing inter-area TE.",
      "zh-CHS": "[ISIS-CAP]定义了ISIS的通用广告机制，允许路由器在ISIS区域或整个ISIS路由域内广告其功能。[ISIS-CAP]还指出，在执行区域间TE时，TE路由器ID是is-is路由器能力TLV中要携带的候选。"
    },
    {
      "indent": 3,
      "text": "This document uses such mechanism for TE Router ID advertisement when the TE Router ID is needed to reach all routers within an entire ISIS Routing domain. Two new sub-TLVs are defined for inclusion in the IS-IS router capability TLV to carry the IPv4 and IPv6 TE Router IDs, respectively:",
      "zh-CHS": "当需要TE路由器ID到达整个ISIS路由域内的所有路由器时，本文档使用这种机制发布TE路由器ID。IS-IS路由器功能TLV中定义了两个新的子TLV，分别承载IPv4和IPv6 TE路由器ID："
    },
    {
      "indent": 3,
      "text": "Sub-TLV type   Length  Name\n------------    ------  -----------------\n          11        4   IPv4 TE Router ID\n          12       16   IPv6 TE Router ID",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Detailed definitions of the two new sub-TLVs are described in Section 3.3.",
      "zh-CHS": "第3.3节描述了两个新子TLV的详细定义。"
    },
    {
      "indent": 0,
      "text": "3.3. Sub-TLV Detail",
      "section_title": true,
      "zh-CHS": "3.3. 子TLV详图"
    },
    {
      "indent": 0,
      "text": "3.3.1. Remote AS Number Sub-TLV",
      "section_title": true,
      "zh-CHS": "3.3.1. 远程AS编号子TLV"
    },
    {
      "indent": 3,
      "text": "A new sub-TLV, the remote AS number sub-TLV, is defined for inclusion in the inter-AS reachability TLV when advertising inter-AS links. The remote AS number sub-TLV specifies the AS number of the neighboring AS to which the advertised link connects.",
      "zh-CHS": "定义了一个新的子TLV，即远程AS编号子TLV，用于在发布AS间链路时将其包含在AS间可达性TLV中。远程AS编号子TLV指定播发链接所连接的相邻AS的AS编号。"
    },
    {
      "indent": 3,
      "text": "The remote AS number sub-TLV is TLV type 24 (see Section 6.2) and is 4 octets in length. The format is as follows:",
      "zh-CHS": "远程AS编号子TLV为24型TLV（见第6.2节），长度为4个八位字节。格式如下:"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Type             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Remote AS Number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The Remote AS number field has 4 octets. When only 2 octets are used for the AS number, as in current deployments, the left (high-order) 2 octets MUST be set to 0. The remote AS number sub-TLV MUST be included when a router advertises an inter-AS TE link.",
      "zh-CHS": "远程AS编号字段有4个八位字节。当AS编号仅使用2个八位字节时，如在当前部署中，左（高阶）2个八位字节必须设置为0。当路由器播发AS TE间链路时，必须包括远程AS编号子TLV。"
    },
    {
      "indent": 0,
      "text": "3.3.2. IPv4 Remote ASBR ID Sub-TLV",
      "section_title": true,
      "zh-CHS": "3.3.2. IPv4远程ASBR ID子TLV"
    },
    {
      "indent": 3,
      "text": "A new sub-TLV, which is referred to as the IPv4 remote ASBR ID sub-TLV, is defined for inclusion in the inter-AS reachability TLV when advertising inter-AS links. The IPv4 remote ASBR ID sub-TLV specifies the IPv4 identifier of the remote ASBR to which the advertised inter-AS link connects. This could be any stable and routable IPv4 address of the remote ASBR. Use of the TE Router ID as specified in the Traffic Engineering router ID TLV [ISIS-TE] is RECOMMENDED.",
      "zh-CHS": "定义了一个新的子TLV，称为IPv4远程ASBR ID子TLV，用于在发布as间链路时将其包含在as间可达性TLV中。IPv4远程ASBR ID子TLV指定播发的AS间链路连接到的远程ASBR的IPv4标识符。这可以是远程ASBR的任何稳定且可路由的IPv4地址。建议使用流量工程路由器ID TLV[ISIS-TE]中指定的TE路由器ID。"
    },
    {
      "indent": 3,
      "text": "The IPv4 remote ASBR ID sub-TLV is TLV type 25 (see Section 6.2) and is 4 octets in length. The format of the IPv4 remote ASBR ID sub-TLV is as follows:",
      "zh-CHS": "IPv4远程ASBR ID子TLV为TLV类型25（见第6.2节），长度为4个八位字节。IPv4远程ASBR ID子TLV的格式如下："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Type             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Remote ASBR ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The IPv4 remote ASBR ID sub-TLV MUST be included if the neighboring ASBR has an IPv4 address. If the neighboring ASBR does not have an IPv4 address (not even an IPv4 TE Router ID), the IPv6 remote ASBR ID sub-TLV MUST be included instead. An IPv4 remote ASBR ID sub-TLV and IPv6 remote ASBR ID sub-TLV MAY both be present in an extended IS reachability TLV.",
      "zh-CHS": "如果相邻ASBR具有IPv4地址，则必须包括IPv4远程ASBR ID子TLV。如果相邻ASBR没有IPv4地址（甚至没有IPv4 TE路由器ID），则必须包含IPv6远程ASBR ID子TLV。扩展IS可达性TLV中可能同时存在IPv4远程ASBR ID子TLV和IPv6远程ASBR ID子TLV。"
    },
    {
      "indent": 0,
      "text": "3.3.3. IPv6 Remote ASBR ID Sub-TLV",
      "section_title": true,
      "zh-CHS": "3.3.3. IPv6远程ASBR ID子TLV"
    },
    {
      "indent": 3,
      "text": "A new sub-TLV, which is referred to as the IPv6 remote ASBR ID sub-TLV, is defined for inclusion in the inter-AS reachability TLV when advertising inter-AS links. The IPv6 remote ASBR ID sub-TLV specifies the IPv6 identifier of the remote ASBR to which the advertised inter-AS link connects. This could be any stable and routable IPv6 address of the remote ASBR. Use of the TE Router ID as specified in the IPv6 Traffic Engineering router ID TLV [ISIS-TE-V3] is RECOMMENDED.",
      "zh-CHS": "定义了一个新的子TLV，称为IPv6远程ASBR ID子TLV，用于在发布as间链路时将其包含在as间可达性TLV中。IPv6远程ASBR ID子TLV指定播发的AS间链路连接到的远程ASBR的IPv6标识符。这可以是远程ASBR的任何稳定且可路由的IPv6地址。建议使用IPv6流量工程路由器ID TLV[ISIS-TE-V3]中指定的TE路由器ID。"
    },
    {
      "indent": 3,
      "text": "The IPv6 remote ASBR ID sub-TLV is TLV type 26 (see Section 6.2) and is 16 octets in length. The format of the IPv6 remote ASBR ID sub-TLV is as follows:",
      "zh-CHS": "IPv6远程ASBR ID子TLV为TLV类型26（见第6.2节），长度为16个八位字节。IPv6远程ASBR ID子TLV的格式如下："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Type             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Remote ASBR ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Remote ASBR ID (continued)              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Remote ASBR ID (continued)              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Remote ASBR ID (continued)              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The IPv6 remote ASBR ID sub-TLV MUST be included if the neighboring ASBR has an IPv6 address. If the neighboring ASBR does not have an IPv6 address, the IPv4 remote ASBR ID sub-TLV MUST be included instead. An IPv4 remote ASBR ID sub-TLV and IPv6 remote ASBR ID sub-TLV MAY both be present in an extended IS reachability TLV.",
      "zh-CHS": "如果相邻ASBR具有IPv6地址，则必须包括IPv6远程ASBR ID子TLV。如果相邻ASBR没有IPv6地址，则必须包含IPv4远程ASBR ID子TLV。扩展IS可达性TLV中可能同时存在IPv4远程ASBR ID子TLV和IPv6远程ASBR ID子TLV。"
    },
    {
      "indent": 0,
      "text": "3.3.4. IPv4 TE Router ID sub-TLV",
      "section_title": true,
      "zh-CHS": "3.3.4. IPv4 TE路由器ID子TLV"
    },
    {
      "indent": 3,
      "text": "The IPv4 TE Router ID sub-TLV is TLV type 11 (see Section 6.3) and is 4 octets in length. The format of the IPv4 TE Router ID sub-TLV is as follows:",
      "zh-CHS": "IPv4 TE路由器ID子TLV为TLV类型11（见第6.3节），长度为4个八位字节。IPv4 TE路由器ID子TLV的格式如下："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Type             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       TE Router ID                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When the TE Router ID is needed to reach all routers within an entire ISIS routing domain, the IS-IS Router capability TLV MUST be included in its LSP. If an ASBR supports Traffic Engineering for IPv4 and if the ASBR has an IPv4 TE Router ID, the IPv4 TE Router ID sub-TLV MUST be included. If the ASBR does not have an IPv4 TE Router ID, the IPv6 TE Router sub-TLV MUST be included instead. An IPv4 TE Router ID sub-TLV and IPv6 TE Router ID sub-TLV MAY both be present in an IS-IS router capability TLV.",
      "zh-CHS": "当需要TE路由器ID到达整个ISIS路由域内的所有路由器时，is-is路由器功能TLV必须包含在其LSP中。如果ASBR支持IPv4流量工程，并且ASBR具有IPv4 TE路由器ID，则必须包括IPv4 TE路由器ID子TLV。如果ASBR没有IPv4 TE路由器ID，则必须包含IPv6 TE路由器子TLV。IS-IS路由器功能TLV中可能同时存在IPv4 TE路由器ID子TLV和IPv6 TE路由器ID子TLV。"
    },
    {
      "indent": 0,
      "text": "3.3.5. IPv6 TE Router ID sub-TLV",
      "section_title": true,
      "zh-CHS": "3.3.5. IPv6 TE路由器ID子TLV"
    },
    {
      "indent": 3,
      "text": "The IPv6 TE Router ID sub-TLV is TLV type 12 (see Section 6.3) and is 4 octets in length. The format of the IPv6 TE Router ID sub-TLV is as follows:",
      "zh-CHS": "IPv6 TE路由器ID子TLV为TLV类型12（见第6.3节），长度为4个八位字节。IPv6 TE路由器ID子TLV的格式如下："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Type             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       TE Router ID                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       TE Router ID   (continued)              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       TE Router ID   (continued)              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       TE Router ID   (continued)              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "When the TE Router ID is needed to reach all routers within an entire ISIS routing domain, the IS-IS router capability TLV MUST be included in its LSP. If an ASBR supports Traffic Engineering for IPv6 and if the ASBR has an IPv6 TE Router ID, the IPv6 TE Router ID sub-TLV MUST be included. If the ASBR does not have an IPv6 TE Router ID, the IPv4 TE Router sub-TLV MUST be included instead. An IPv4 TE Router ID sub-TLV and IPv6 TE Router ID sub-TLV MAY both be present in an IS-IS router capability TLV.",
      "zh-CHS": "当需要TE路由器ID到达整个ISIS路由域内的所有路由器时，is-is路由器功能TLV必须包含在其LSP中。如果ASBR支持IPv6流量工程，并且ASBR具有IPv6 TE路由器ID，则必须包括IPv6 TE路由器ID子TLV。如果ASBR没有IPv6 TE路由器ID，则必须包含IPv4 TE路由器子TLV。IS-IS路由器功能TLV中可能同时存在IPv4 TE路由器ID子TLV和IPv6 TE路由器ID子TLV。"
    },
    {
      "indent": 0,
      "text": "4. Procedure for Inter-AS TE Links",
      "section_title": true,
      "zh-CHS": "4. AS-TE间链路的程序"
    },
    {
      "indent": 3,
      "text": "When TE is enabled on an inter-AS link and the link is up, the ASBR SHOULD advertise this link using the normal procedures for ISIS-TE [ISIS-TE]. When either the link is down or TE is disabled on the link, the ASBR SHOULD withdraw the advertisement. When there are changes to the TE parameters for the link (for example, when the available bandwidth changes), the ASBR SHOULD re-advertise the link but MUST take precautions against excessive re-advertisements.",
      "zh-CHS": "当在AS间链路上启用TE且链路启动时，ASBR应使用ISIS-TE[ISIS-TE]的正常程序公布此链路。当链接关闭或链接上的TE被禁用时，ASBR应撤回广告。当链路的TE参数发生变化时（例如，当可用带宽发生变化时），ASBR应重新公布链路，但必须采取预防措施防止过度重新公布。"
    },
    {
      "indent": 3,
      "text": "Hellos MUST NOT be exchanged over the inter-AS link, and consequently, an ISIS adjacency MUST NOT be formed.",
      "zh-CHS": "不得通过内部AS链接交换问候，因此，不得形成ISIS邻接。"
    },
    {
      "indent": 3,
      "text": "The information advertised comes from the ASBR's knowledge of the TE capabilities of the link, the ASBR's knowledge of the current status and usage of the link, and configuration at the ASBR of the remote AS number and remote ASBR TE Router ID.",
      "zh-CHS": "公布的信息来自ASBR对链路TE能力的了解、ASBR对链路当前状态和使用情况的了解以及ASBR对远程AS号码和远程ASBR TE路由器ID的配置。"
    },
    {
      "indent": 3,
      "text": "Legacy routers receiving an advertisement for an inter-AS TE link are able to ignore it because they do not know the new TLV and sub-TLVs that are defined in Section 3 of this document. They will continue to flood the LSP, but will not attempt to use the information received.",
      "zh-CHS": "接收到AS-TE链路广告的传统路由器可以忽略它，因为它们不知道本文档第3节中定义的新TLV和子TLV。他们将继续淹没LSP，但不会尝试使用收到的信息。"
    },
    {
      "indent": 3,
      "text": "In the current operation of ISIS TE, the LSRs at each end of a TE link emit LSAs describing the link. The databases in the LSRs then have two entries (one locally generated, the other from the peer) that describe the different 'directions' of the link. This enables Constrained Shortest Path First (CSPF) to do a two-way check on the link when performing path computation and eliminate it from consideration unless both directions of the link satisfy the required constraints.",
      "zh-CHS": "在ISIS TE的当前操作中，TE链路每一端的lsr发射描述链路的lsa。然后，LSR中的数据库有两个条目（一个是本地生成的，另一个来自对等方），它们描述了链路的不同“方向”。这使得约束最短路径优先（CSPF）能够在执行路径计算时对链路进行双向检查，并将其从考虑范围中排除，除非链路的两个方向都满足所需的约束。"
    },
    {
      "indent": 3,
      "text": "In the case we are considering here (i.e., of a TE link to another AS), there is, by definition, no IGP peering and hence no bidirectional TE link information. In order for the CSPF route computation entity to include the link as a candidate path, we have to find a way to get LSAs describing its (bidirectional) TE properties into the TE database.",
      "zh-CHS": "在我们这里考虑的情况下（即，TE链路到另一AS），根据定义，没有IGP对等，因此没有双向TE链路信息。为了让CSPF路由计算实体将链路作为候选路径，我们必须找到一种方法，将描述其（双向）TE属性的LSA获取到TE数据库中。"
    },
    {
      "indent": 3,
      "text": "This is achieved by the ASBR advertising, internally to its AS, information about both directions of the TE link to the next AS. The ASBR will normally generate an LSA describing its own side of a link; here we have it 'proxy' for the ASBR at the edge of the other AS and generate an additional LSA that describes that device's 'view' of the link.",
      "zh-CHS": "这是通过ASBR在其AS内部发布关于TE链接到下一个AS的两个方向的信息来实现的。ASBR通常会生成一个LSA，描述链路的自己一侧；这里，我们在另一个AS的边缘为ASBR设置了“代理”，并生成一个额外的LSA，该LSA描述了该设备的链接“视图”。"
    },
    {
      "indent": 3,
      "text": "Only some essential TE information for the link needs to be advertised; i.e., the Interface Address, the remote AS number, and the remote ASBR ID of an inter-AS TE link.",
      "zh-CHS": "只有一些必要的TE信息的链接需要广告；i、 例如，接口地址、远程AS编号和AS-TE间链路的远程ASBR ID。"
    },
    {
      "indent": 3,
      "text": "Routers or PCEs that are capable of processing advertisements of inter-AS TE links SHOULD NOT use such links to compute paths that exit an AS to a remote ASBR and then immediately re-enter the AS through another TE link. Such paths would constitute extremely rare occurrences and SHOULD NOT be allowed except as the result of specific policy configurations at the router or PCE computing the path.",
      "zh-CHS": "能够处理AS-TE链路的广告的路由器或pce不应使用此类链路来计算从AS到远程ASBR的路径，然后通过另一个TE链路立即重新进入AS。此类路径将构成极为罕见的情况，并且不应被允许，除非由于路由器或PCE计算路径的特定策略配置的结果。"
    },
    {
      "indent": 0,
      "text": "4.1. Origin of Proxied TE Information",
      "section_title": true,
      "zh-CHS": "4.1. 代理TE信息的来源"
    },
    {
      "indent": 3,
      "text": "Section 4 describes how an ASBR advertises TE link information as a proxy for its neighbor ASBR, but does not describe where this information comes from.",
      "zh-CHS": "第4节描述了ASBR如何作为其邻居ASBR的代理播发TE链路信息，但没有描述该信息的来源。"
    },
    {
      "indent": 3,
      "text": "Although the source of this information is outside the scope of this document, it is possible that it will be a configuration requirement at the ASBR, as are other local properties of the TE link. Further, where BGP is used to exchange IP routing information between the ASBRs, a certain amount of additional local configuration about the link and the remote ASBR is likely to be available.",
      "zh-CHS": "尽管此信息的来源不在本文档的范围内，但它可能是ASBR的配置要求，TE链接的其他本地属性也是如此。此外，在使用BGP在ASBR之间交换IP路由信息的情况下，关于链路和远程ASBR的一定数量的附加本地配置可能可用。"
    },
    {
      "indent": 3,
      "text": "We note further that it is possible, and may be operationally advantageous, to obtain some of the required configuration information from BGP. Whether and how to utilize these possibilities is an implementation matter.",
      "zh-CHS": "我们进一步注意到，从BGP获得一些所需的配置信息是可能的，并且在操作上可能是有利的。是否以及如何利用这些可能性是一个实施问题。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "zh-CHS": "5. 安全考虑"
    },
    {
      "indent": 3,
      "text": "The protocol extensions defined in this document are relatively minor and can be secured within the AS in which they are used by the existing ISIS security mechanisms (e.g., using the cleartext passwords or Hashed Message Authentication Codes - Message Digest 5 (HMAC-MD5) algorithm, which are defined in [ISIS] and [RFC5304], respectively).",
      "zh-CHS": "本文件中定义的协议扩展相对较小，可在现有ISIS安全机制使用的AS内进行安全保护（例如，使用明文密码或散列消息认证码-消息摘要5（HMAC-MD5）算法，分别在[ISIS]和[RFC5304]中定义）。"
    },
    {
      "indent": 3,
      "text": "There is no exchange of information between ASes, and no change to the ISIS security relationship between the ASes. In particular, since no ISIS adjacency is formed on the inter-AS links, there is no requirement for ISIS security between the ASes.",
      "zh-CHS": "ASE之间没有信息交换，ASE之间的ISIS安全关系也没有变化。特别是，由于AS间链路上没有形成ISIS邻接，因此ASE之间没有ISIS安全要求。"
    },
    {
      "indent": 3,
      "text": "Some of the information included in these new advertisements (e.g., the remote AS number and the remote ASBR ID) is obtained manually from a neighboring administration as part of a commercial relationship. The source and content of this information should be carefully checked before it is entered as configuration information at the ASBR responsible for advertising the inter-AS TE links.",
      "zh-CHS": "这些新广告中包含的一些信息（例如，远程AS号码和远程ASBR ID）是作为商业关系的一部分从邻近管理部门手动获取的。在将该信息作为配置信息输入负责公布as-TE链接的ASBR之前，应仔细检查该信息的来源和内容。"
    },
    {
      "indent": 3,
      "text": "It is worth noting that in the scenario we are considering, a Border Gateway Protocol (BGP) peering may exist between the two ASBRs and that this could be used to detect inconsistencies in configuration (e.g., the administration that originally supplied the information may be lying, or some manual mis-configurations or mistakes may be made by the operators). For example, if a different remote AS number is received in a BGP OPEN [BGP] from that locally configured to ISIS-TE, as we describe here, then local policy SHOULD be applied to determine whether to alert the operator to a potential mis-",
      "zh-CHS": "值得注意的是，在我们正在考虑的场景中，两个ASBR之间可能存在边界网关协议（BGP）对等，这可用于检测配置中的不一致性（例如，最初提供信息的管理部门可能在撒谎，或者操作员可能会出现一些手动错误配置或错误）。例如，如果在BGP OPEN[BGP]中接收到不同的远程AS号码从本地配置到ISIS-TE，正如我们在这里所描述的，然后应用本地策略来确定是否向操作员发出潜在mis警报-"
    },
    {
      "indent": 3,
      "text": "configuration or to suppress the ISIS advertisement of the inter-AS TE link. Note further that if BGP is used to exchange TE information as described in Section 4.1, the inter-AS BGP session SHOULD be secured using mechanisms as described in [BGP] to provide authentication and integrity checks.",
      "zh-CHS": "配置或抑制AS-TE链路的ISIS播发。进一步注意，如第4.1节所述，如果使用BGP交换TE信息，则应使用[BGP]中所述的机制保护as间BGP会话，以提供身份验证和完整性检查。"
    },
    {
      "indent": 3,
      "text": "For a discussion of general security considerations for IS-IS, see [RFC5304].",
      "zh-CHS": "有关IS-IS的一般安全注意事项的讨论，请参阅[RFC5304]。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "zh-CHS": "6. IANA考虑"
    },
    {
      "indent": 3,
      "text": "IANA has made the following allocations from registries under its control.",
      "zh-CHS": "IANA已从其控制下的登记处进行了以下分配。"
    },
    {
      "indent": 0,
      "text": "6.1. Inter-AS Reachability TLV",
      "section_title": true,
      "zh-CHS": "6.1. 内部AS可达性TLV"
    },
    {
      "indent": 3,
      "text": "This document defines the following new ISIS TLV type, described in Section 3.1, which has been registered in the ISIS TLV codepoint registry:",
      "zh-CHS": "本文件定义了以下新的ISIS TLV类型，如第3.1节所述，已在ISIS TLV代码点注册表中注册："
    },
    {
      "indent": 14,
      "text": "Type        Description              IIH   LSP   SNP\n----        ----------------------   ---   ---   ---\n 141        inter-AS reachability     n     y     n\n                  information",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "6.2. Sub-TLVs for the Inter-AS Reachability TLV",
      "section_title": true,
      "zh-CHS": "6.2. 用于内部AS可达性TLV的子TLV"
    },
    {
      "indent": 3,
      "text": "This document defines the following new sub-TLV types (described in Sections 3.3.1, 3.3.2, and 3.3.3) of top-level TLV 141 (see Section 6.1 above), which have been registered in the ISIS sub-TLV registry for TLV 141. Note that these three new sub-TLVs SHOULD NOT appear in TLV 22 (or TLV 222) and MUST be ignored in TLV 22 (or TLV 222).",
      "zh-CHS": "本文件定义了顶级TLV 141（见上文第6.1节）的以下新子TLV类型（见第3.3.1节、第3.3.2节和第3.3.3节），这些类型已在ISIS子TLV注册表中注册为TLV 141。请注意，这三个新的子TLV不应出现在TLV 22（或TLV 222）中，并且必须在TLV 22（或TLV 222）中忽略。"
    },
    {
      "indent": 5,
      "text": "Type        Description\n----        ------------------------------\n  24        remote AS number\n  25        IPv4 remote ASBR Identifier\n  26        IPv6 remote ASBR Identifier",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "As described above in Section 3.1, the sub-TLVs defined in [ISIS-TE], [ISIS-TE-V3], and other documents for describing the TE properties of a TE link are applicable to describe an inter-AS TE link and MAY be included in the inter-AS reachability TLV when adverting inter-AS TE links.",
      "zh-CHS": "如上文第3.1节所述，[ISIS-TE]、[ISIS-TE-V3]和其他描述TE链路TE属性的文件中定义的子TLV适用于描述As-TE链路，并且在播发As-TE链路时可包括在As-TE链路间可达性TLV中。"
    },
    {
      "indent": 3,
      "text": "IANA has updated the registry that was specified as \"Sub-TLVs for TLV 22\" to be named \"Sub-TLVs for TLVs 22, 141, and 222\". Three new columns have been added to the registry to show in which TLVs the",
      "zh-CHS": "IANA已将指定为“TLV 22的子TLV”的注册表更新为“TLV 22、141和222的子TLV”。注册表中添加了三个新列，以显示"
    },
    {
      "indent": 3,
      "text": "sub-TLVs may be present. All sub-TLVs currently defined may be present in all three TLVs, hence the registry (with the definition of the new sub-TLVs defined here) should read as follows.",
      "zh-CHS": "可能存在子TLV。当前定义的所有子TLV可能存在于所有三个TLV中，因此注册表（此处定义了新子TLV的定义）应如下所示。"
    },
    {
      "indent": 3,
      "text": "                                            TLV TLV TLV\nType    Description                          22  141 222 Reference\n------- ------------------------------------ --- --- --- ---------\n   0    Unassigned                            y   y   y\n   1    Unassigned                            y   y   y\n   2    Unassigned                            y   y   y\n   3    Administrative group (color)          y   y   y  [RFC5305]\n   4    Link Local/Remote Identifiers         y   y   y\n                                                [RFC4205][RFC5307]\n   5    Unassigned                            y   y   y\n   6    IPv4 interface address                y   y   y  [RFC5305]\n   7    Unassigned                            y   y   y\n   8    IPv4 neighbor address                 y   y   y  [RFC5305]\n   9    Maximum link bandwidth                y   y   y  [RFC5305]\n  10    Maximum reservable link bandwidth     y   y   y  [RFC5305]\n  11    Unreserved bandwidth                  y   y   y  [RFC5305]\n  12    Unassigned                            y   y   y\n  13    Unassigned                            y   y   y\n  14    Unassigned                            y   y   y\n  15    Unassigned                            y   y   y\n  16    Unassigned                            y   y   y\n  17    Unassigned                            y   y   y\n  18    TE Default metric                     y   y   y  [RFC5305]\n  19    Link-attributes                       y   y   y  [RFC5029]\n  20    Link Protection Type                  y   y   y\n                                                   [RFC4205][RFC5307]\n  21    Interface Switching Capability Desc   y   y   y\n                                                   [RFC4205][RFC5307]\n  22    Bandwidth Constraints                 y   y   y  [RFC4124]\n  23    Unconstrained TE LSP Count (sub-)TLV  y   y   y  [RFC5330]\n  24    remote AS number                      n   y   n  [RFC5316]\n  25    IPv4 remote ASBR identifier           n   y   n  [RFC5316]\n  26    IPv6 remote ASBR identifier           n   y   n  [RFC5316]\n27-249  Unassigned\n250-254 Reserved for Cisco-specific exts\n255     Reserved for future expansion",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Further sub-TLVs may be defined in the future for inclusion in any of the TLVs 22, 141, or 222. The re-naming of the registry as above ensures that there is no accidental overlap of sub-TLV codepoints. The introduction of the columns within the registry clarify the use of the sub-TLVs.",
      "zh-CHS": "将来可定义进一步的子tlv以包括在tlv 22、141或222中的任一个中。如上所述重新命名注册表可确保子TLV代码点不会意外重叠。注册表中列的介绍澄清了子TLV的使用。"
    },
    {
      "indent": 0,
      "text": "6.3. Sub-TLVs for the IS-IS Router Capability TLV",
      "section_title": true,
      "zh-CHS": "6.3. IS-IS路由器功能TLV的子TLV"
    },
    {
      "indent": 3,
      "text": "This document defines the following new sub-TLV types, described in Sections 3.3.4 and 3.3.5, of top-level TLV 242 (which is defined in [ISIS-CAP]) that have been registered in the ISIS sub-TLV registry for TLV 242:",
      "zh-CHS": "本文件定义了顶级TLV 242（定义见[ISIS-CAP]）第3.3.4节和第3.3.5节中所述的以下新的子TLV类型，这些类型已在ISIS子TLV注册表中注册为TLV 242："
    },
    {
      "indent": 6,
      "text": "Type        Description                        Length\n----        ------------------------------   --------\n  11        IPv4 TE Router ID                       4\n  12        IPv6 TE Router ID                      16",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Adrian Farrel, Jean-Louis Le Roux, Christian Hopps, Les Ginsberg, and Hannes Gredler for their review and comments on this document.",
      "zh-CHS": "作者感谢Adrian Farrel、Jean-Louis Le Roux、Christian Hopps、Les Ginsberg和Hannes Gredler对本文件的审查和评论。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "zh-CHS": "8.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "zh-CHS": "[RFC3209]Awduche，D.，Berger，L.，Gan，D.，Li，T.，Srinivasan，V.，和G.Swallow，“RSVP-TE：LSP隧道RSVP的扩展”，RFC 3209，2001年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, October 2008.",
      "zh-CHS": "[RFC5304]Li，T.和R.Atkinson，“IS-IS加密认证”，RFC 5304，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[ISIS] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990.",
      "zh-CHS": "[ISIS]Callon，R.，“OSI IS-IS在TCP/IP和双环境中的路由使用”，RFC 1195，1990年12月。"
    },
    {
      "indent": 3,
      "text": "[ISIS-CAP] Vasseur, JP., Ed., Shen, N., Ed., and R. Aggarwal, Ed., \"Intermediate System to Intermediate System (IS-IS) Extensions for Advertising Router Information\", RFC 4971, July 2007.",
      "zh-CHS": "[ISIS-CAP]Vasseur，JP.，Ed.，Shen，N.，Ed.，和R.Aggarwal，Ed.，“广告路由器信息的中间系统到中间系统（IS-IS）扩展”，RFC 49712007年7月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "zh-CHS": "8.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[INTER-AS-TE-REQ] Zhang, R., Ed., and J.-P. Vasseur, Ed., \"MPLS Inter-Autonomous System (AS) Traffic Engineering (TE) Requirements\", RFC 4216, November 2005.",
      "zh-CHS": "[INTER-AS-TE-REQ]Zhang，R.，Ed.，和J.-P.Vasseur，Ed.，“MPLS自治系统间（AS）流量工程（TE）要求”，RFC 42162005年11月。"
    },
    {
      "indent": 3,
      "text": "[PD-PATH] Vasseur, JP., Ed., Ayyangar, A., Ed., and R. Zhang, \"A Per-Domain Path Computation Method for Establishing Inter-Domain Traffic Engineering (TE) Label Switched Paths (LSPs)\", RFC 5152, February 2008.",
      "zh-CHS": "[PD-PATH]Vasseur，JP.，Ed.，Ayyangar，A.，Ed.，和R.Zhang，“用于建立域间流量工程（TE）标签交换路径（LSP）的每域路径计算方法”，RFC 5152，2008年2月。"
    },
    {
      "indent": 3,
      "text": "[BRPC] Vasseur, JP., Ed., Zhang, R., Bitar, N., JL. Le Roux, \"A Backward Recursive PCE-Based Computation (BRPC) Procedure to Compute Shortest Inter-Domain Traffic Engineering Label Switched Paths\", Work in Progress, April 2008.",
      "zh-CHS": "[BRPC]Vasseur，JP.，Ed.，Zhang，R.，Bitar，N.，JL。Le Roux，“基于PCE的反向递归计算（BRPC）程序，用于计算最短域间流量工程标签交换路径”，正在进行的工作，2008年4月。"
    },
    {
      "indent": 3,
      "text": "[PCE] Farrel, A., Vasseur, J.-P., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, August 2006.",
      "zh-CHS": "[PCE]Farrel，A.，Vasseur，J.-P.，和J.Ash，“基于路径计算元素（PCE）的体系结构”，RFC 46552006年8月。"
    },
    {
      "indent": 3,
      "text": "[ISIS-TE] Li, T. and H. Smit, \"IS-IS Extensions for Traffic Engineering\", RFC 5305, October 2008.",
      "zh-CHS": "[ISIS-TE]Li，T.和H.Smit，“交通工程的IS-IS扩展”，RFC 5305，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[ISIS-TE-V3] Harrison, J., Berger, J., and Bartlett, M., \"IPv6 Traffic Engineering in IS-IS\", Work in Progress, June 2008.",
      "zh-CHS": "[ISIS-TE-V3]Harrison，J.，Berger，J.，和Bartlett，M.，“IS-IS中的IPv6流量工程”，正在进行的工作，2008年6月。"
    },
    {
      "indent": 3,
      "text": "[GMPLS-TE] Kompella, K., Ed., and Y. Rekhter, Ed., \"IS-IS Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 5307, October 2008.",
      "zh-CHS": "[GMPLS-TE]Kompella，K.，Ed.，和Y.Rekhter，Ed.，“支持通用多协议标签交换（GMPLS）的IS-IS扩展”，RFC 5307，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[BGP] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "zh-CHS": "[BGP]Rekhter，Y.，Ed.，Li，T.，Ed.，和S.Hares，Ed.，“边境网关协议4（BGP-4）”，RFC 42712006年1月。"
    },
    {
      "indent": 3,
      "text": "[GENINFO] L. Ginsberg., Previdi, S., and M. Shand, \"Advertising Generic Information in IS-IS\", Work in Progress, June 2008.",
      "zh-CHS": "[GENINFO]L.Ginsberg.，Previdi，S.和M.Shand，“IS-IS中的广告通用信息”，正在进行的工作，2008年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Mach (Guoyi) Chen Huawei Technologies Co., Ltd KuiKe Building, No.9 Xinxi Rd. Hai-Dian District Beijing, 100085 P.R. China",
      "zh-CHS": "中国北京市海淀区新西路9号魁克大厦Mach（国一）陈华为技术有限公司，邮编100085"
    },
    {
      "indent": 3,
      "text": "EMail: mach@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Renhai Zhang Huawei Technologies Co., Ltd KuiKe Building, No.9 Xinxi Rd. Hai-Dian District Beijing, 100085 P.R. China",
      "zh-CHS": "中国北京市海淀区新西路9号华为技术有限公司魁克大厦，邮编100085"
    },
    {
      "indent": 3,
      "text": "EMail: zhangrenhai@huawei.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Xiaodong Duan China Mobile 53A, Xibianmennei Ave. Xunwu District Beijing, China",
      "zh-CHS": "中国移动北京寻乌区西边门内大街53A小东段"
    },
    {
      "indent": 3,
      "text": "EMail: duanxiaodong@chinamobile.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}