{
  "title": {
    "text": "RFC 5138: A Uniform Resource Name (URN) Namespace for the Commission for the Management and Application of Geoscience Information (CGI)",
    "zh-CHS": "RFC 5138"
  },
  "number": 5138,
  "created_at": "2021-11-10 07:09:59.467336+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                             S. Cox\nRequest for Comments: 5138                                         CSIRO\nCategory: Informational                                    February 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": " A Uniform Resource Name (URN) Namespace for the Commission for the Management and Application of Geoscience Information (CGI)",
      "zh-CHS": "地球科学信息管理和应用委员会（CGI）的统一资源名称（URN）命名空间"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document describes a URN (Uniform Resource Name) namespace that is engineered by the Commission for the Management and Application of Geoscience Information (CGI) for naming (i) persistent resources published by the CGI and (ii) resources published by organizations that wish them to be used in the context of services conforming to protocols and agreements issued by CGI. The formal Namespace Identifier (NID) is \"cgi\".",
      "zh-CHS": "本文件描述了由地球科学信息管理和应用委员会（CGI）设计的URN（统一资源名称）命名空间，用于命名（i）CGI发布的持久资源和（ii）希望在符合CGI发布的协议和协议的服务环境中使用的组织发布的资源。正式名称空间标识符（NID）是“cgi”。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "CGI is a Commission of the International Union of Geological Sciences (IUGS) concerned with developing best practices in the management and application of geoscience information. The active membership is primarily drawn from organizations with statutory responsibility for providing geoscience information to external users (e.g., Geologic Surveys). An important focus of activity is the development of standards for networked data interchange to complement or supersede the traditional map product.",
      "zh-CHS": "CGI是国际地质科学联合会（IUGS）的一个委员会，负责制定地球科学信息管理和应用的最佳实践。活跃成员主要来自负责向外部用户（如地质调查）提供地球科学信息的法定组织。活动的一个重要重点是制定网络数据交换标准，以补充或取代传统地图产品。"
    },
    {
      "indent": 3,
      "text": "A number of documents, definitions, and other artifacts, are required to support this. CGI wishes to provide persistent, location-independent identifiers for these resources. In addition, organizations that subscribe to the interchange standards proposed by CGI require external identifiers for data objects that are transferred. CGI wishes to provide a scheme to enable data providers to uniquely identify data, which is consistent with the requirements of the interchange framework.",
      "zh-CHS": "需要大量文档、定义和其他工件来支持这一点。CGI希望为这些资源提供持久的、与位置无关的标识符。此外，订阅CGI提出的交换标准的组织需要传输的数据对象的外部标识符。CGI希望提供一种方案，使数据提供者能够唯一地识别数据，这符合交换框架的要求。"
    },
    {
      "indent": 3,
      "text": "Products and services that conform to CGI endorsed interchange specifications enable users to exchange and process geoscience information across networks, computing platforms, and products. Interoperability in such an environment is facilitated by the use of",
      "zh-CHS": "符合CGI认可的交换规范的产品和服务使用户能够跨网络、计算平台和产品交换和处理地球科学信息。通过使用"
    },
    {
      "indent": 3,
      "text": "a system of identifiers that is global in scope. CGI is the lead forum for statutory organizations that act as primary providers of technical data in this application domain.",
      "zh-CHS": "范围全局的标识符系统。CGI是作为该应用领域技术数据主要提供者的法定组织的主要论坛。"
    },
    {
      "indent": 3,
      "text": "Motivated by these concerns, CGI would like to assign formal URNs to published resources in order to provide persistent, location-independent identifiers for them. The process for registering a namespace identifier is documented in [RFC3406].",
      "zh-CHS": "出于这些考虑，CGI希望为已发布的资源分配正式的URN，以便为它们提供持久的、位置独立的标识符。[RFC3406]中记录了注册命名空间标识符的过程。"
    },
    {
      "indent": 3,
      "text": "The official IANA registry of URN namespaces is available online at:",
      "zh-CHS": "URN名称空间的官方IANA注册可在线访问："
    },
    {
      "indent": 3,
      "text": "<http://www.iana.org/assignments/urn-namespaces>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "2. URN Specification for the \"cgi\" NID",
      "section_title": true,
      "zh-CHS": "2. “cgi”NID的URN规范"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "zh-CHS": "命名空间ID:"
    },
    {
      "indent": 6,
      "text": "cgi",
      "zh-CHS": "cgi"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "zh-CHS": "注册资料："
    },
    {
      "indent": 6,
      "text": "Registration Version Number: 1 Registration Date: 2007-10-04",
      "zh-CHS": "注册版本号：1注册日期：2007-10-04"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "zh-CHS": "已声明命名空间的注册人："
    },
    {
      "indent": 6,
      "text": "Commission for Geoscience Information (Secretariat) c/o British Geological Survey Kingsley Dunham Centre Keyworth Nottingham Nottinghamshire NG12 5GG U K Attn. Ian Jackson (ij@bgs.ac.uk)",
      "zh-CHS": "地球科学信息委员会（秘书处）C/O英国地质调查局金斯利邓纳姆中心KeWestern诺丁汉诺丁汉郡NG12 5GG UK ATTN。伊恩·杰克逊(ij@bgs.ac.uk)"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "zh-CHS": "句法结构声明："
    },
    {
      "indent": 6,
      "text": "The Namespace Specific String (NSS) of all URNs that use the \"cgi\" NID has the following structure:",
      "zh-CHS": "使用“cgi”NID的所有URN的命名空间特定字符串（NSS）具有以下结构："
    },
    {
      "indent": 6,
      "text": "urn:cgi:{CGIResource}:{ResourceSpecificString}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "where the \"CGIResource\" is a US-ASCII string that conforms to the URN syntax requirements [RFC2141] and defines a specific class of resource type. Each resource type has a specific labeling scheme that is covered by \"ResourceSpecificString\", which also conforms to the naming requirements of [RFC2141].",
      "zh-CHS": "其中，“CGIResource”是符合URN语法要求[RFC2141]的US-ASCII字符串，并定义了资源类型的特定类别。每个资源类型都有一个特定的标签方案，该方案由“ResourceSpecificString”涵盖，它也符合[RFC2141]的命名要求。"
    },
    {
      "indent": 6,
      "text": "The CGI maintains a naming authority, the CGI Naming Authority (CGINA), that manages the assignment of CGIResource classes and the specific registration values assigned for each resource class.",
      "zh-CHS": "CGI维护一个命名机构，即CGI命名机构（CGINA），它管理CGIResource类的分配以及为每个资源类分配的特定注册值。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "zh-CHS": "相关辅助文件："
    },
    {
      "indent": 6,
      "text": "The CGI Naming Authority (CGINA) provides information on the registered resources and the registrations for each. More information about CGINA and the registration activities and procedures to be followed are available at:",
      "zh-CHS": "CGI命名机构（CGINA）提供有关已注册资源和每个资源的注册的信息。有关CGINA以及注册活动和程序的更多信息，请访问："
    },
    {
      "indent": 6,
      "text": "<http://www.cgi-iugs.org/CGIIdentifierScheme>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "A URN resolver is available at:",
      "zh-CHS": "URN解析器可从以下位置获得："
    },
    {
      "indent": 6,
      "text": "<http://www.cgi-iugs.org/uri>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "The resolver provides a registry of CGI URNs used in CGI services.",
      "zh-CHS": "解析器提供CGI服务中使用的CGI URN的注册表。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "zh-CHS": "标识符唯一性注意事项："
    },
    {
      "indent": 6,
      "text": "The CGINA manages resources using the \"cgi\" NID and is the authority for managing the resources and subsequent strings associated. In the associated procedures, CGINA ensures the uniqueness of the strings themselves or permits secondary responsibility for management of well-defined sub-trees.",
      "zh-CHS": "CGINA使用“cgi”NID管理资源，是管理资源和后续相关字符串的权威。在相关程序中，CGINA确保字符串本身的唯一性，或允许对定义良好的子树进行二级管理。"
    },
    {
      "indent": 6,
      "text": "CGI may permit use of experimental-type values that will not be registered. As a consequence, multiple users may end up using the same value for separate uses. As experimental usage is only intended for testing purposes, this should not interfere with operational services.",
      "zh-CHS": "CGI可能允许使用未注册的实验类型值。因此，多个用户可能最终使用相同的值进行单独使用。由于实验性使用仅用于测试目的，因此不应干扰操作服务。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "zh-CHS": "标识符持久性注意事项："
    },
    {
      "indent": 6,
      "text": "CGINA provides clear documentation of the registered uses of the \"cgi\" NID. This is structured such that each CGIResource has a separate description and associated ResourceSpecificString with separate registration tables for elements of the strings that are separately maintained.",
      "zh-CHS": "CGINA提供了“cgi”NID注册使用的清晰文档。这种结构使得每个CGIResource都有一个单独的描述和关联的ResourceSpecificString，以及单独维护的字符串元素的单独注册表。"
    },
    {
      "indent": 6,
      "text": "The registration tables and information are published and maintained by CGINA on the CGI web site, indicated above.",
      "zh-CHS": "注册表格和信息由CGINA在CGI网站上发布和维护，如上所述。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "zh-CHS": "标识符分配过程："
    },
    {
      "indent": 6,
      "text": "CGINA defines CGIResource classes used with the \"cgi\" NID, and specifies the process for identifier assignment for each class. These are described at:",
      "zh-CHS": "CGINA定义与“cgi”NID一起使用的CGIResource类，并为每个类指定标识符分配的过程。以下是对这些问题的描述："
    },
    {
      "indent": 6,
      "text": "<http://www.cgi-iugs.org/CGIIdentifierScheme>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "and a set of registers is linked from there. Each such resource may have three types of registration activities:",
      "zh-CHS": "一组寄存器从那里链接起来。每个此类资源可能有三种类型的注册活动："
    },
    {
      "indent": 9,
      "text": "1) Registered values associated with CGI resources 2) Registration of values or sub-trees to other entities 3) Name models for use in experimental purposes",
      "zh-CHS": "1) 与CGI资源相关的注册值2）将值或子树注册到其他实体3）命名用于实验目的的模型"
    },
    {
      "indent": 3,
      "text": "Process for Identifier Resolution:",
      "zh-CHS": "标识符解析过程："
    },
    {
      "indent": 6,
      "text": "The namespace is not listed with a Resolution Discovery System (RDS); this is not relevant.",
      "zh-CHS": "名称空间未与解析发现系统（RDS）一起列出；这是不相关的。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "zh-CHS": "词汇对等规则："
    },
    {
      "indent": 6,
      "text": "No special considerations; the rules for lexical equivalence of [RFC2141] apply.",
      "zh-CHS": "没有特别考虑；[RFC2141]的词汇对等规则适用。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "zh-CHS": "符合URN语法："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "zh-CHS": "没有特别考虑。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "zh-CHS": "验证机制："
    },
    {
      "indent": 6,
      "text": "None specified. URN assignment will be handled by procedures implemented in support of CGINA activities.",
      "zh-CHS": "没有具体说明。URN分配将由支持CGINA活动的程序执行。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "zh-CHS": "范围："
    },
    {
      "indent": 6,
      "text": "Global",
      "zh-CHS": "全球的"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "zh-CHS": "3. 例子"
    },
    {
      "indent": 3,
      "text": "The following examples are representative URNs that have been assigned by CGINA:",
      "zh-CHS": "以下示例是CGINA分配的具有代表性的URN："
    },
    {
      "indent": 3,
      "text": "urn:cgi:document:CGI:CGIIdentifierScheme",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies the document that describes the CGI Identifier Scheme.",
      "zh-CHS": "- 标识描述CGI标识符方案的文档。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:register:CGI:CGIResourceClasses",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies the register of resource classes for which identifiers from the CGI scheme may be provided.",
      "zh-CHS": "- 标识可为其提供CGI方案标识符的资源类的寄存器。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:xmlns:CGI:GeoSciML:2.0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- is the XML namespace for version 2.0 of GeoSciML, which is owned by CGI.",
      "zh-CHS": "- 是GeoSciML 2.0版的XML命名空间，由CGI拥有。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:schema:GGIC:MineralOccurences:1.0:XMI",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies the XML Metadata Interchange (XMI) representation of version 1.0 of the Mineral Occurrences information model owned by the (Australasian) Government Geoscience Information Committee.",
      "zh-CHS": "- 标识（澳大利亚）政府地球科学信息委员会拥有的矿点信息模型1.0版的XML元数据交换（XMI）表示形式。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:featureType:CGI:GeoSciML:2.0:Fault",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies the Fault feature-type from version 2.0 of the GeoSciML schema that is owned by CGI.",
      "zh-CHS": "- 标识CGI拥有的GeoSciML模式版本2.0中的故障特征类型。"
    },
    {
      "indent": 3,
      "text": "urn:ogc:serviceType:CGI:GSML-FS:1.0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies version 1.0 of the \"GSML-FS\" service-type owned by CGI.",
      "zh-CHS": "- 标识CGI拥有的“GSML-FS”服务类型的1.0版。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:classifierScheme:ICS:StratChart:2004",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies the 2004 edition of the Stratigraphic Chart published by the International Commission for Stratigraphy.",
      "zh-CHS": "- 确定了国际地层学委员会出版的2004年版地层图。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:classifier:ICS:StratChart:2004:Silurian",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies the geologic period designated Silurian from the 2004 edition of the Stratigraphic Chart published by the International Commission for Stratigraphy.",
      "zh-CHS": "- 从国际地层学委员会出版的2004年版地层图中确定了指定为志留纪的地质时期。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:classifier:GSV:Lithology:UIUYG1245NN07",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies the concept given the designation UIUYG1245NN07 from the lithology scheme published by Geoscience Victoria (Australia).",
      "zh-CHS": "- 从维多利亚地球科学（澳大利亚）出版的岩性方案中确定了命名为UIUUI1245NN07的概念。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:feature:USGS:2feb49bc-6755-11dc-8314-0800200c9a66",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies a feature instance given the designation 2feb49bc-6755-11dc-8314-0800200c9a66 by the US Geological Survey.",
      "zh-CHS": "- 识别美国地质调查局指定为2feb49bc-6755-11dc-8314-0800200c9a66的地物实例。"
    },
    {
      "indent": 3,
      "text": "urn:cgi:object:SGU:552cb080-6755-11dc-8314-0800200c9a66",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "- identifies an object given the designation 552cb080-6755-11dc-8314-0800200c9a66 by the Geological Survey of Sweden.",
      "zh-CHS": "- 识别瑞典地质调查局指定为552cb080-6755-11dc-8314-0800200c9a66的物体。"
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "zh-CHS": "4. 命名空间注意事项"
    },
    {
      "indent": 3,
      "text": "There is currently no available namespace that will allow the CGI to uniquely specify and access resources, such as schemas and registries, that are required by organizations implementing CGI standards. There is also a need for other standards organizations, such as the Open Geospatial Consortium (OGC) to be able to access CGI-specific resources.",
      "zh-CHS": "目前还没有可用的名称空间允许CGI唯一地指定和访问实施CGI标准的组织所需的资源，如模式和注册表。还需要其他标准组织，如开放地理空间联盟（OGC）能够访问CGI特定的资源。"
    },
    {
      "indent": 3,
      "text": "The CGI members considered use of other existing NIDs, such as those for OGC. However, these do not support the semantics required and in particular do not allow for the delegation of identifier assignment within the CGI community that is demonstrated here.",
      "zh-CHS": "CGI成员考虑使用其他现有NID，例如OGC的NID。但是，它们不支持所需的语义，特别是不允许在这里演示的CGI社区中进行标识符分配的委托。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "zh-CHS": "5. 社区考虑"
    },
    {
      "indent": 3,
      "text": "CGI standards require access to resources, such as schemas, registries, catalogues, documents, and services. In order for the larger IT community to be able to implement applications that access CGI resources effectively, a unique namespace is required. We desire these resources to be freely and openly available as a set of community resources.",
      "zh-CHS": "CGI标准要求访问资源，如模式、注册表、目录、文档和服务。为了使更大的IT社区能够实现有效访问CGI资源的应用程序，需要一个唯一的名称空间。我们希望这些资源能够作为一套社区资源免费公开提供。"
    },
    {
      "indent": 3,
      "text": "The design of the CGI namespace builds on the experience of the Open Geospatial Consortium (OGC) which has defined the framework of geospatial services within which CGI standards have been developed. The OGC membership has expertise in using the OGC URN [OGC-URN] [OGC-DEF], gained through implementation experiments and a variety of operational testbeds. The CGI namespace is compatible with this experience.",
      "zh-CHS": "CGI名称空间的设计基于开放地理空间联盟（OGC）的经验，OGC定义了地理空间服务框架，CGI标准是在该框架内制定的。OGC成员在使用OGC URN[OGC-URN][OGC-DEF]方面拥有专业知识，这些知识是通过实施实验和各种操作测试平台获得的。CGI名称空间与此体验兼容。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "zh-CHS": "6. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "zh-CHS": "除了通常与使用和解决骨灰盒相关的安全注意事项外，没有其他安全注意事项。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "zh-CHS": "7. IANA考虑"
    },
    {
      "indent": 3,
      "text": "This document defines a URN NID registration of \"cgi\", which has been entered into the IANA registry located at:",
      "zh-CHS": "本文件定义了“cgi”的URN NID注册，该注册已输入IANA注册中心，地址为："
    },
    {
      "indent": 3,
      "text": "<http://www.iana.org/assignments/urn-namespaces>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "zh-CHS": "8. 工具书类"
    },
    {
      "indent": 0,
      "text": "8.1 Normative References",
      "section_title": true,
      "zh-CHS": "8.1 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "zh-CHS": "[RFC2141]Moats，R.，“瓮语法”，RFC 21411997年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "zh-CHS": "[RFC3406]Daigle，L.，van Gulik，D.，Iannella，R.，和P.Faltstrom，“统一资源名称（URN）命名空间定义机制”，BCP 66，RFC 3406，2002年10月。"
    },
    {
      "indent": 0,
      "text": "8.2 Informative References",
      "section_title": true,
      "zh-CHS": "8.2 资料性引用"
    },
    {
      "indent": 3,
      "text": "[OGC-URN] Reed, C., \"A URN namespace for the Open Geospatial Consortium (OGC)\", Work in Progress, October 2007.",
      "zh-CHS": "[OGC-URN]Reed，C.，“开放地理空间联盟（OGC）的URN名称空间”，正在进行的工作，2007年10月。"
    },
    {
      "indent": 3,
      "text": "[OGC-DEF] Whiteside, A., \"Definition identifier URNs in OGC\n          namespace\", OpenGIS Best Practice document, OGC 06-023r1,\n          August 2006.  Available [online]:\n          <http://portal.opengeospatial.org/files/?artifact_id=16339>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "9. Acknowledgement",
      "section_title": true,
      "zh-CHS": "9. 确认"
    },
    {
      "indent": 3,
      "text": "Thanks to Carl Reed for preparing the document, \"A URN Namespace for the Open Geospatial Consortium\", upon which this submission is based.",
      "zh-CHS": "感谢Carl Reed编写的文档“开放地理空间联盟的URN名称空间”，本次提交基于此。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "S.J.D. Cox Commonwealth Scientific and Industrial Research Organisation PO Box 1130 Bentley, WA, 6102, Australia EMail: Simon.Cox@csiro.au",
      "zh-CHS": "S.J.D.考克斯联邦科学和工业研究组织，地址：澳大利亚西澳州宾利市1130号邮政信箱，6102，电子邮件：西蒙。Cox@csiro.au"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "zh-CHS": "版权所有（C）IETF信托基金（2008年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    }
  ]
}