{
  "title": {
    "text": "RFC 5318: The Session Initiation Protocol (SIP) P-Refused-URI-List Private-Header (P-Header)",
    "zh-CHS": "RFC 5318"
  },
  "number": 5318,
  "created_at": "2021-11-10 20:29:35.415328+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      J. Hautakorpi\nRequest for Comments: 5318                                  G. Camarillo\nCategory: Informational                                         Ericsson\n                                                           December 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": " The Session Initiation Protocol (SIP) P-Refused-URI-List Private-Header (P-Header)",
      "zh-CHS": "会话启动协议（SIP）P-Header-URI-List专用头（P-Header）"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "zh-CHS": "本备忘录为互联网社区提供信息。它没有规定任何类型的互联网标准。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "zh-CHS": "版权公告"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2008 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "zh-CHS": "版权所有（c）2008 IETF信托基金和确定为文件作者的人员。版权所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/ license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "zh-CHS": "本文件受BCP 78和IETF信托有关IETF文件的法律规定的约束(http://trustee.ietf.org/ 许可证信息）在本文件发布之日生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This document specifies the Session Initiation Protocol (SIP) P-Refused-URI-List Private-Header (P-Header). This P-Header is used in the Open Mobile Alliance's (OMA) Push to talk over Cellular (PoC) system. It enables URI-list servers to refuse the handling of incoming URI lists that have embedded URI lists. This P-Header also makes it possible for the URI-list server to inform the client about the embedded URI list that caused the rejection and the individual URIs that form such a URI list.",
      "zh-CHS": "本文档指定了会话启动协议（SIP）P-Header-URI-List专用头（P-Header）。此P-Header用于开放移动联盟（OMA）的蜂窝式一键通（PoC）系统。它使URI列表服务器能够拒绝处理具有嵌入URI列表的传入URI列表。这个P头还使得URI列表服务器能够通知客户机导致拒绝的嵌入式URI列表以及形成这样一个URI列表的各个URI。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 0,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................2\n3. Usage Scenario ..................................................3\n4. Overview of Operation ...........................................6\n5. Syntax of P-Refused-URI-List Header Field .......................6\n6. Response Generation .............................................7\n7. Message Sequence Example ........................................7\n8. Applicability ...................................................9\n9. Security Considerations ........................................10\n10. IANA Considerations ...........................................11\n11. Acknowledgements ..............................................11\n12. References ....................................................11\n   12.1. Normative References .....................................11\n   12.2. Informative References ...................................12",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "zh-CHS": "1. 介绍"
    },
    {
      "indent": 3,
      "text": "The Open Mobile Alliance (OMA) has specified the Push to talk over Cellular (PoC) service, which uses the Session Initiation Protocol (SIP) [3] and Uniform Resource Identifier (URI)-list services [5] (more information about OMA PoC can be found at [8]).",
      "zh-CHS": "开放移动联盟（OMA）已指定了蜂窝式一键通（PoC）服务，该服务使用会话发起协议（SIP）[3]和统一资源标识符（URI）-列表服务[5]（有关OMA PoC的更多信息，请参见[8]）。"
    },
    {
      "indent": 3,
      "text": "OMA PoC needs a mechanism for servers to refuse the handling of incoming URI lists when these have embedded URI lists. Such a mechanism is intended to be used to establish a particular type of PoC session called an ad-hoc PoC group session.",
      "zh-CHS": "OMAPOC需要一种机制，当传入的URI列表具有嵌入的URI列表时，服务器可以拒绝处理这些列表。这种机制旨在用于建立称为特设PoC组会话的特定类型的PoC会话。"
    },
    {
      "indent": 3,
      "text": "The remainder of this document is organized as follows. Section 3 describes the scenario where the mechanism will be used. Section 4 provides an overview of the mechanism, which includes a new P-Header called P-Refused-URI-List. Section 5 defines the syntax of this new P-Header. Section 6 specifies how to use the P-Header. Section 7 provides a usage example. Section 8 describes the applicability of the P-Header. Security considerations are discussed in Section 9 and, finally, the IANA considerations are stated in Section 10.",
      "zh-CHS": "本文件的其余部分组织如下。第3节描述了将使用该机制的场景。第4节概述了该机制，其中包括一个名为P-reked-URI-List的新P头。第5节定义了这个新P-Header的语法。第6节规定了如何使用P标题。第7节提供了一个使用示例。第8节描述了P-Header的适用性。第9节讨论了安全注意事项，最后，第10节阐述了IANA注意事项。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "zh-CHS": "2. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [1].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[1]中所述进行解释。"
    },
    {
      "indent": 0,
      "text": "3. Usage Scenario",
      "section_title": true,
      "zh-CHS": "3. 使用场景"
    },
    {
      "indent": 3,
      "text": "An ad-hoc PoC group session is a type of multi-party PoC session. The originator of a particular ad-hoc PoC group session chooses in an ad-hoc manner (e.g., selecting from an address book) the set of desired participants. In order to establish the ad-hoc PoC group session, the originator sends an INVITE request with a URI list that contains the URIs of those participants.",
      "zh-CHS": "特设PoC组会话是一种多方PoC会话。特定特设PoC组会话的发起人以特设方式（例如，从通讯簿中选择）选择所需参与者的集合。为了建立特设PoC组会话，发起者发送一个INVITE请求，其中包含这些参与者的URI列表。"
    },
    {
      "indent": 3,
      "text": "The PoC network, following the procedures defined in [6], receives such an INVITE request and generates an individual INVITE request towards each of the URIs in the URI list.",
      "zh-CHS": "PoC网络按照[6]中定义的过程接收此类INVITE请求，并针对URI列表中的每个URI生成单独的INVITE请求。"
    },
    {
      "indent": 3,
      "text": "In previous versions of the OMA PoC service, the originator of an ad-hoc PoC group session was only allowed to populate the initial URI list with URIs identifying individual PoC users. Later versions of the service allow the originator to also include URI lists whose entries represent URI lists. That is, the initial URI list contains entries that are URI lists themselves. The expected service behavior then is that the members of the embedded URI lists are invited to join the ad-hoc PoC group session.",
      "zh-CHS": "在OMA PoC服务的早期版本中，仅允许临时PoC组会话的发起人使用标识单个PoC用户的URI填充初始URI列表。服务的更高版本允许发起者还包括URI列表，其条目表示URI列表。也就是说，初始URI列表包含的条目本身就是URI列表。然后，预期的服务行为是邀请嵌入URI列表的成员加入特设PoC组会话。"
    },
    {
      "indent": 3,
      "text": "Figure 1 illustrates the desired behavior. The originator (not shown) places the URI list friends@example.org, along with the URI alice@example.com, in the initial URI list. The PoC network resolves friends@example.org into its members, bob@example.org and carol@example.net, and sends INVITE requests to all the recipients.",
      "zh-CHS": "图1说明了所需的行为。发起者（未显示）放置URI列表friends@example.org，以及URIalice@example.com，在初始URI列表中。PoC网络解决了friends@example.org加入其成员，bob@example.org和carol@example.net，并向所有收件人发送邀请请求。"
    },
    {
      "indent": 4,
      "text": "                               2. INVITE\n                           +------------------>\n                           |   alice@example.com\n                           |\n                           |\n                    +-------------+\n                    |             |\n   1. INVITE        |             | 3. INVITE\n ------------------>| PoC Network |---------------->\nalice@example.com   |             | bob@example.org\nfriends@example.org |             |\n                    +-------------+\n                           |\n                           |\n                           |\n                           |   4. INVITE\n                           +------------------>\n                               carol@example.net",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "Figure 1: PoC Expected Behavior",
      "zh-CHS": "图1:PoC预期行为"
    },
    {
      "indent": 3,
      "text": "The PoC network in Figure 1 consists of PoC servers, which are SIP entities that can behave as proxies or B2BUAs (Back-to-Back User Agents). There are two types of logical PoC servers: controlling and participating.",
      "zh-CHS": "图1中的PoC网络由PoC服务器组成，这些服务器是可以作为代理或B2BUA（背靠背用户代理）的SIP实体。有两种类型的逻辑PoC服务器：控制和参与。"
    },
    {
      "indent": 3,
      "text": "In an ad-hoc PoC group session, there is always exactly one controlling PoC server. The controlling PoC server of an ad-hoc PoC group session resolves an incoming URI list and sends INVITEs to the members of the list. The controlling PoC server also functions as the focus of the session. Every participant in an ad-hoc PoC group has an associated participating PoC server, which resides in the home domain of the participant.",
      "zh-CHS": "在特设PoC组会话中，始终只有一台控制PoC服务器。特设PoC组会话的控制PoC服务器解析传入URI列表，并向该列表的成员发送邀请。控制PoC服务器还充当会话的焦点。特设PoC组中的每个参与者都有一个关联的参与PoC服务器，该服务器位于参与者的主域中。"
    },
    {
      "indent": 3,
      "text": "Figure 2 shows how the PoC servers of the PoC network behave in the scenario shown in Figure 1. An originating PoC user agent sends an INVITE request (1) with a URI list to its participating PoC server. The participating PoC server of the originator receives the INVITE request, assumes the role of controlling PoC server for the ad-hoc PoC group session, and sends an INVITE request to each of the URIs in the URI list.",
      "zh-CHS": "图2显示了PoC网络的PoC服务器在图1所示场景中的行为。发起的PoC用户代理向其参与的PoC服务器发送带有URI列表的INVITE请求（1）。发起人的参与PoC服务器接收INVITE请求，承担控制特设PoC组会话的PoC服务器的角色，并向URI列表中的每个URI发送INVITE请求。"
    },
    {
      "indent": 0,
      "text": "                                              +-------------+\n                              2. INVITE       | Particip.   |\n                          +------------------>| PoC server  |->\n                          | alice@example.com | example.com |\n                          |                   +-------------+\n                          |\n                   +-------------+ 3. INVITE           +-------------+\n                   |             |-------------------->|             |\n     1. INVITE     | Controlling | friends@example.org | Particip.   |\n  ---------------->| PoC server  |                     | PoC server  |->\nalice@example.com  |             | 4. 403 Forbidden    | example.org |\nfriends@example.org|             |<--------------------|             |\n                   +-------------+  bob@example.org    +-------------+\n                      |      |      carol@example.net         ^\n                      |      |                                |\n                      |      |     5. INVITE                  |\n                      |      +--------------------------------+\n                      |             bob@example.org\n                      |\n                      |                   +------------+\n                      |   6. INVITE       | Particip.  |\n                      +------------------>| PoC server |->\n                        carol@example.net | example.net|\n                                          +------------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "Figure 2: PoC Network Behavior",
      "zh-CHS": "图2:PoC网络行为"
    },
    {
      "indent": 3,
      "text": "The first URI of the list, alice@example.com, identifies a single user. The second URI of the URI list, friends@example.org, identifies a URI list. In PoC terminology, friends@example.com identifies a pre-arranged PoC group. The PoC server at example.org, which knows the membership of friends@example.com, cannot send INVITE requests to the members of friends@example.org because that PoC server does not act as a controlling PoC server for the ad-hoc PoC group session being established. Instead, it informs the controlling PoC server that friends@example.org is a list whose members are bob@example.org and carol@example.net. Upon receiving this information, the controlling PoC server generates INVITE requests towards bob@example.org and carol@example.net.",
      "zh-CHS": "列表的第一个URI，alice@example.com，标识单个用户。URI列表的第二个URI，friends@example.org，标识URI列表。在PoC术语中，friends@example.com标识预先安排的PoC组。example.org上的PoC服务器，它知道friends@example.com，无法向的成员发送邀请请求friends@example.org因为该PoC服务器不充当正在建立的特设PoC组会话的控制PoC服务器。相反，它会通知控制PoC服务器friends@example.org是一个成员为的列表bob@example.org和carol@example.net. 收到此信息后，控制PoC服务器将生成针对的INVITE请求bob@example.org和carol@example.net."
    },
    {
      "indent": 3,
      "text": "Although not shown in the above example, the participating PoC server (example.org) can include -- based on policy, presence of the members, etc. -- just a partial list of URIs of the URI list. Furthermore, a URI that the participating PoC server returns can be a URI list.",
      "zh-CHS": "尽管在上面的示例中没有显示，但参与的PoC服务器（example.org）可以包括——基于策略、成员的存在等——URI列表中的部分URI列表。此外，参与PoC服务器返回的URI可以是URI列表。"
    },
    {
      "indent": 3,
      "text": "At present, there is not a mechanism for a participating PoC server to inform a controlling PoC server that a URI identifies a list and the members of that list, nor is there a mechanism to indicate the URIs contained in the list. This document defines such a mechanism: the P-Refused-URI-List P-Header.",
      "zh-CHS": "目前，没有用于参与PoC服务器通知控制PoC服务器URI标识列表和该列表的成员的机制，也没有用于指示列表中包含的URI的机制。本文档定义了这样一种机制：P-denked-URI-List P-Header。"
    },
    {
      "indent": 0,
      "text": "4. Overview of Operation",
      "section_title": true,
      "zh-CHS": "4. 业务概况"
    },
    {
      "indent": 3,
      "text": "When a URI-list server receives an INVITE request with a URI list containing entries that are URI lists themselves, and the server cannot handle the request, it returns a 403 (Forbidden) response with a P-Refused-URI-List P-Header, as shown in Figure 3. The P-Refused-URI-List P-Header contains the members of the URI list or lists that caused the rejection of the request. This way, the client can send requests directly to those member URIs.",
      "zh-CHS": "当一个URI列表服务器接收到一个INVITE请求，其中一个URI列表包含了URI列表本身的条目，并且该服务器无法处理该请求时，它返回一个403（禁止）响应，该响应带有一个P-denked-URI-list P-Header，如图3所示。P-denked-URI-List P-Header包含导致请求被拒绝的URI列表的成员。这样，客户端可以直接向这些成员URI发送请求。"
    },
    {
      "indent": 11,
      "text": "+---------+        INVITE request         +----------+\n|         |------------------------------>|          |\n|         |   [URI list in a URI list]    | URI-list |\n| Client  |                               |  server  |\n|         |        403 Forbidden          |          |\n|         |<------------------------------|          |\n|         | [Content of refused URI list] |          |\n+---------+                               +----------+",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 22,
      "text": "Figure 3: Operational Overview",
      "zh-CHS": "图3：操作概述"
    },
    {
      "indent": 0,
      "text": "5. Syntax of P-Refused-URI-List Header Field",
      "section_title": true,
      "zh-CHS": "5. P-denked-URI-List头字段的语法"
    },
    {
      "indent": 3,
      "text": "The following is the augmented Backus-Naur Form (BNF) [4] syntax of the P-Refused-URI-List P-Header:",
      "zh-CHS": "以下是P-REQUENED-URI-List P-Header的增广Backus Naur Form（BNF）[4]语法："
    },
    {
      "indent": 7,
      "text": "P-Refused-URI-List = \"P-Refused-URI-List\" HCOLON\n                          uri-list-entry\n                          *(COMMA uri-list-entry)\nuri-list-entry     = ( name-addr / addr-spec )\n                          *( SEMI refused-param )\nrefused-param      = members-param / generic-param\nmembers-param      = \"members\" EQUAL\n                          LDQUOT *( qdtext / quoted-pair ) RDQUOT",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The members P-Header parameter MUST contain a cid-url, which is defined in RFC 2392 [2].",
      "zh-CHS": "members P-Header参数必须包含在RFC 2392[2]中定义的cid url。"
    },
    {
      "indent": 3,
      "text": "The HCOLON, SEMI, EQUAL, LDQUOT, RDQUOT, and generic-param are defined in [3].",
      "zh-CHS": "[3]中定义了HCOLON、SEMI、EQUAL、LDQUOT、RDQUOT和generic参数。"
    },
    {
      "indent": 0,
      "text": "6. Response Generation",
      "section_title": true,
      "zh-CHS": "6. 响应生成"
    },
    {
      "indent": 3,
      "text": "A 403 (Forbidden) response can contain more than one P-Refused-URI-List entries. The P-Refused-URI-List header field MUST NOT be used with any other response. The P-Refused-URI-List P-Header contains one or more URIs, which were present in the URI list in the incoming request and could not be handled by the server. Additionally, the P-Refused-URI-List can optionally carry some or all of the members of the URI lists identified by those URIs.",
      "zh-CHS": "403（禁止）响应可以包含多个P-REQUENED-URI-List条目。P-denked-URI-List头字段不得与任何其他响应一起使用。P-denked-URI-List P-Header包含一个或多个URI，这些URI出现在传入请求的URI列表中，服务器无法处理。此外，P-reked-URI-List可以选择性地携带由那些URI标识的URI列表的部分或全部成员。"
    },
    {
      "indent": 3,
      "text": "The 403 (Forbidden) response MAY contain body parts which contain URI lists. Those body parts can be referenced by the P-Refused-URI-List entries through their Content-IDs [2]. If there is a Content-ID defined in the P-Refused-URI-List, one of the body parts MUST have an equivalent Content-ID. The format of a URI list is service specific.",
      "zh-CHS": "403（禁止）响应可能包含包含URI列表的主体部分。这些身体部位可以通过其内容ID被P-URI-List条目引用[2]。如果P-URI-List中定义了内容ID，则其中一个主体部分必须具有等效的内容ID。URI列表的格式是特定于服务的。"
    },
    {
      "indent": 3,
      "text": "This kind of message structure enables clients to determine which URI relates to which URI list, if the URI-list server is willing to disclose that information. Furthermore, the information enclosed in the URI lists enable clients to take further actions to remedy the rejection situation (e.g., send individual requests to the members of the URI list).",
      "zh-CHS": "这种消息结构使客户端能够确定哪个URI与哪个URI列表相关，如果URI列表服务器愿意披露该信息。此外，URI列表中包含的信息使客户端能够采取进一步的措施来纠正拒绝情况（例如，向URI列表的成员发送单个请求）。"
    },
    {
      "indent": 0,
      "text": "7. Message Sequence Example",
      "section_title": true,
      "zh-CHS": "7. 消息序列示例"
    },
    {
      "indent": 3,
      "text": "In the following message sequence example, a controlling PoC server sends an INVITE request to a participating PoC server. The participating PoC server rejects the request with a 403 (Forbidden) response. The 403 response has a P-Refused-URI-List P-Header that carries the members of the rejected URI lists that the participating PoC server determines to disclose to this controlling PoC server in the body of the message.",
      "zh-CHS": "在下面的消息序列示例中，控制PoC服务器向参与的PoC服务器发送INVITE请求。参与的PoC服务器以403（禁止）响应拒绝请求。403响应具有P-denked-URI-List P-Header，该P-denked-URI-List P-Header携带参与PoC服务器确定在消息主体中向该控制PoC服务器公开的被拒绝URI列表的成员。"
    },
    {
      "indent": 11,
      "text": "Controlling PoC server Participating PoC server example.com example.net",
      "zh-CHS": "控制PoC服务器参与PoC服务器example.com example.net"
    },
    {
      "indent": 20,
      "text": "|                                 |\n|             INVITE              |\n|-------------------------------->|\n|                                 |\n|          403 Forbidden          |\n|<--------------------------------|\n|                                 |",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 20,
      "text": "Figure 4: Message Sequence Example",
      "zh-CHS": "图4：消息序列示例"
    },
    {
      "indent": 3,
      "text": "The INVITE request shown in Figure 4 is as follows (Via header fields are not shown for simplicity):",
      "zh-CHS": "图4所示的INVITE请求如下（为简单起见，未显示Via头字段）："
    },
    {
      "indent": 6,
      "text": "INVITE sip:poc-service@example.net SIP/2.0\nMax-Forwards: 70\nFrom: PoC service <sip:poc-service@example.com>;tag=4fxaed73sl\nTo: PoC service <sip:poc-service@example.net>\nCall-ID: 7xTn9vxNit65XU7p4@example.com\nCSeq: 1 INVITE\nContact: <sip:poc-service@poc-as.example.com>\nRequire: recipient-list-invite\nContent-Type: multipart/mixed;boundary=\"boundary1\"\nContent-Length: 538",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "--boundary1\nContent-Type: application/sdp",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "(SDP not shown)",
      "zh-CHS": "（未显示SDP）"
    },
    {
      "indent": 6,
      "text": "--boundary1 Content-Type: application/resource-lists+xml Content-Disposition: recipient-list",
      "zh-CHS": "--boundary1内容类型：应用程序/资源列表+xml内容处置：收件人列表"
    },
    {
      "indent": 6,
      "text": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<resource-lists xmlns=\"urn:ietf:params:xml:ns:resource-lists\">\n  <list>\n    <entry uri=\"sip:bob@example.net\"/>\n    <entry uri=\"sip:friends-list@example.net\"/>\n    <entry uri=\"sip:colleagues-list@example.net\"/>\n  </list>\n</resource-lists>\n--boundary1--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The URIs sip:friends-list@example.net and sip:colleagues-list@example.net in the example above are actually references to URI lists (i.e., pre-arranged PoC groups). In the following response, the URI lists are in the XML resource list format [7].",
      "zh-CHS": "URI sip：朋友-list@example.net及sip:同事-list@example.net在上面的示例中，实际上是对URI列表的引用（即，预先安排的PoC组）。在下面的响应中，URI列表采用XML资源列表格式[7]。"
    },
    {
      "indent": 3,
      "text": "The content of the 403 (Forbidden) response in Figure 4 is as follows (Via header fields are not shown for simplicity):",
      "zh-CHS": "图4中403（禁止）响应的内容如下（为简单起见，未显示Via头字段）："
    },
    {
      "indent": 6,
      "text": "SIP/2.0 403 Forbidden\nFrom: PoC service <sip:poc-service@example.com>;tag=4fxaed73sl\nTo: PoC service <sip:poc-service@example.net>;tag=814254\nCall-ID: 7xTn9vxNit65XU7p4@example.com\nCSeq: 1 INVITE\nP-Refused-URI-List: sip:friends-list@example.net;\n  members=<cid:an3bt8jf03@example.net>\nP-Refused-URI-List: sip:colleagues-list@example.net;",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "  members=<cid:bn35n8jf04@example.net>\nContent-Type: multipart/mixed;boundary=\"boundary1\"\nContent-Length: 745",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "--boundary1\nContent-Type: application/resource-lists+xml\nContent-Disposition: recipient-list\nContent-ID: <an3bt8jf03@example.net>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<resource-lists xmlns=\"urn:ietf:params:xml:ns:resource-lists\">\n  <list>\n    <entry uri=\"sip:bill@example.org\"/>\n    <entry uri=\"sip:randy@example.com\"/>\n    <entry uri=\"sip:eddy@example.com\"/>\n  </list>\n</resource-lists>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "--boundary1\nContent-Type: application/resource-lists+xml\nContent-Disposition: recipient-list\nContent-ID: <bn35n8jf04@example.net>",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 6,
      "text": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<resource-lists xmlns=\"urn:ietf:params:xml:ns:resource-lists\">\n  <list>\n    <entry uri=\"sip:joe@example.org\"/>\n    <entry uri=\"sip:carol@example.com\"/>\n  </list>\n</resource-lists>\n--boundary1--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Using the message body of the 403 (Forbidden) response above, the controlling PoC server can determine the members of sip:friend-list@example.net and sip:colleagues-list@example.net that the participating PoC server determines to disclose to this controlling PoC server. Furthermore, the controlling PoC server can deduce that the participating PoC server has not sent any outgoing requests, per regular URI-list server procedures.",
      "zh-CHS": "使用上面403（禁止）响应的消息体，控制PoC服务器可以确定sip:friend的成员-list@example.net及sip:同事-list@example.net参与的PoC服务器决定向该控制PoC服务器公开的消息。此外，根据常规URI列表服务器过程，控制PoC服务器可以推断参与的PoC服务器没有发送任何传出请求。"
    },
    {
      "indent": 0,
      "text": "8. Applicability",
      "section_title": true,
      "zh-CHS": "8. 适用性"
    },
    {
      "indent": 3,
      "text": "The P-Refused-URI-List header field is intended to be used in OMA PoC networks. This header field is used between PoC servers and carries information about those URI lists that were rejected by the server receiving the request.",
      "zh-CHS": "P-reked-URI-List报头字段用于OMA PoC网络。此标头字段在PoC服务器之间使用，并携带有关接收请求的服务器拒绝的URI列表的信息。"
    },
    {
      "indent": 3,
      "text": "The OMA PoC services is designed so that, in a given session, only one PoC server can resolve incoming URI lists and send INVITEs to members of these lists. This restriction is not present on services developed to be used on the public Internet. Therefore, the P-Refused-URI-List P-Header does not seem to have general applicability outside the OMA PoC service.",
      "zh-CHS": "OMAPOC服务的设计使得在给定会话中，只有一台PoC服务器可以解析传入的URI列表并向这些列表的成员发送邀请。此限制不适用于为在公共互联网上使用而开发的服务。因此，P-denked-URI-List P-Header在OMA-PoC服务之外似乎没有普遍的适用性。"
    },
    {
      "indent": 3,
      "text": "Additionally, the use of the P-Refused-URI-List P-Header requires special trust relationships between servers that do not typically exist on the public Internet.",
      "zh-CHS": "此外，使用P-denked-URI-List P-Header需要在公共互联网上通常不存在的服务器之间建立特殊的信任关系。"
    },
    {
      "indent": 3,
      "text": "It is important to note that the P-Refused-URI-List is optional and does not change the basic behavior of a SIP URI-list service. The P-Refused-URI-List only provides clients with additional information about the refusal of the request.",
      "zh-CHS": "需要注意的是，P-denked-URI-List是可选的，不会改变SIP-URI列表服务的基本行为。P-denked-URI-List仅向客户端提供有关拒绝请求的附加信息。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "zh-CHS": "9. 安全考虑"
    },
    {
      "indent": 3,
      "text": "It is assumed that the network elements handling the P-Refused-URI-List P-Header are trusted. Also, attackers are not supposed to have access to the protocol messages between those elements. This is because the P-Refused-URI-List is intended to be used in the OMA PoC environment, which is implemented in the operators' core network; for more on OMA PoC security assumptions, see [9]. Traffic protection between network elements is achieved by using IP Security (IPsec) and sometimes by physically protecting the network.",
      "zh-CHS": "假设处理P-denked-URI-List P-Header的网元是可信的。此外，攻击者不应访问这些元素之间的协议消息。这是因为P-reked-URI-List旨在用于OMA PoC环境，该环境在运营商的核心网络中实现；有关OMA PoC安全性假设的更多信息，请参见[9]。网元之间的流量保护通过使用IP安全（IPsec）实现，有时通过物理保护网络实现。"
    },
    {
      "indent": 3,
      "text": "However, implementors and administrators should be aware of two special security considerations related to the use of P-Refused-URI-List:",
      "zh-CHS": "但是，实现者和管理员应该知道与使用P-URI-List相关的两个特殊安全注意事项："
    },
    {
      "indent": 3,
      "text": "Eavesdropping: 403 (Forbidden) responses may contain information about the members of a given URI list. Eavesdroppers can acquire this information if the 403 (Forbidden) responses are not encrypted. Therefore, it is RECOMMENDED that either hop-by-hop or end-to-end encryption (e.g., using TLS or S/MIME, respectively) is used.",
      "zh-CHS": "窃听：403（禁止）响应可能包含关于给定URI列表成员的信息。如果403（禁止）响应未加密，窃听者可以获取此信息。因此，建议使用逐跳或端到端加密（例如，分别使用TLS或S/MIME）。"
    },
    {
      "indent": 3,
      "text": "Disclosing information: A rogue entity may be able to acquire information about the members of a given URI list if the URI-list server sends information about those URI lists to unauthorized users. Therefore, it is RECOMMENDED that a URI-list server discloses the content of that URI-list only to authorized clients.",
      "zh-CHS": "披露信息：如果URI列表服务器向未经授权的用户发送有关URI列表的信息，流氓实体可能能够获取有关给定URI列表成员的信息。因此，建议URI列表服务器仅向授权客户端公开该URI列表的内容。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "zh-CHS": "10. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The IANA has made two additions to the Session Initiation Protocol (SIP) Parameters registry. The following header field has been added to the Header Fields sub-registry.",
      "zh-CHS": "IANA在会话启动协议（SIP）参数注册表中添加了两个参数。以下标题字段已添加到标题字段子注册表。"
    },
    {
      "indent": 5,
      "text": "Header Name        compact    Reference\n-----------------  -------    ---------\nP-Refused-URI-List            [RFC5318]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The following header field parameter has been added to the Header Field Parameters and Parameter Values sub-registry.",
      "zh-CHS": "以下标题字段参数已添加到标题字段参数和参数值子注册表中。"
    },
    {
      "indent": 3,
      "text": "                                               Predefined\nHeader Field                  Parameter Name     Values     Reference\n----------------------------  ---------------   ---------   ---------\nP-Refused-URI-List            members              No       [RFC5318]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "11. Acknowledgements",
      "section_title": true,
      "zh-CHS": "11. 致谢"
    },
    {
      "indent": 3,
      "text": "Authors would like to thank Tom Hiller who did a thorough, dedicated review for this document.",
      "zh-CHS": "作者要感谢Tom Hiller，他对本文件进行了全面、专门的审查。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "zh-CHS": "12. 工具书类"
    },
    {
      "indent": 0,
      "text": "12.1. Normative References",
      "section_title": true,
      "zh-CHS": "12.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[1] Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Levinson, E., \"Content-ID and Message-ID Uniform Resource Locators\", RFC 2392, August 1998.",
      "zh-CHS": "[2] Levinson，E.，“内容ID和消息ID统一资源定位器”，RFC 2392，1998年8月。"
    },
    {
      "indent": 3,
      "text": "[3] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "zh-CHS": "[3] Rosenberg，J.，Schulzrinne，H.，Camarillo，G.，Johnston，A.，Peterson，J.，Sparks，R.，Handley，M.，和E.Schooler，“SIP：会话启动协议”，RFC 3261，2002年6月。"
    },
    {
      "indent": 3,
      "text": "[4] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "zh-CHS": "[4] Crocker，D.和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[5] Camarillo, G. and A. Roach, \"Framework and Security Considerations for Session Initiation Protocol (SIP) URI-List Services\", RFC 5363, October 2008.",
      "zh-CHS": "[5] Camarillo，G.和A.Roach，“会话启动协议（SIP）URI列表服务的框架和安全注意事项”，RFC 5363，2008年10月。"
    },
    {
      "indent": 3,
      "text": "[6] Camarillo, G. and A. Johnston, \"Conference Establishment Using Request-Contained Lists in the Session Initiation Protocol (SIP)\", RFC 5366, October 2008.",
      "zh-CHS": "[6] Camarillo，G.和A.Johnston，“使用会话启动协议（SIP）中包含的请求列表建立会议”，RFC 5366，2008年10月。"
    },
    {
      "indent": 0,
      "text": "12.2. Informative References",
      "section_title": true,
      "zh-CHS": "12.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[7] Rosenberg, J., \"Extensible Markup Language (XML) Formats for Representing Resource Lists\", RFC 4826, May 2007.",
      "zh-CHS": "[7] Rosenberg，J.，“表示资源列表的可扩展标记语言（XML）格式”，RFC4826，2007年5月。"
    },
    {
      "indent": 3,
      "text": "[8] Open Mobile Alliance, \"OMA PoC System Description: Draft Version 2.0\", April 2007.",
      "zh-CHS": "[8] 开放移动联盟，“OMA PoC系统说明：2.0版草案”，2007年4月。"
    },
    {
      "indent": 3,
      "text": "[9] Open Mobile Alliance, \"Push to talk over Cellular (PoC) - Architecture: Draft Version 2.0\", April 2007.",
      "zh-CHS": "[9] 开放式移动联盟，“通过蜂窝网络进行按键通话（PoC）-架构：2.0版草案”，2007年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Jani Hautakorpi Ericsson Hirsalantie 11 Jorvas 02420 Finland",
      "zh-CHS": "Jani Hautakorpi Ericsson Hirsalantie 11 Jorvas 02420芬兰"
    },
    {
      "indent": 3,
      "text": "EMail: Jani.Hautakorpi@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Gonzalo Camarillo Ericsson Hirsalantie 11 Jorvas 02420 Finland",
      "zh-CHS": "Gonzalo Camarillo Ericsson Hirsalantie 11 Jorvas 02420芬兰"
    },
    {
      "indent": 3,
      "text": "EMail: Gonzalo.Camarillo@ericsson.com",
      "raw": true,
      "zh-CHS": " "
    }
  ]
}