{
  "title": {
    "text": "RFC 5098: Signaling MIB for PacketCable and IPCablecom Multimedia Terminal Adapters (MTAs)",
    "zh-CHS": "RFC 5098"
  },
  "number": 5098,
  "created_at": "2021-11-10 04:05:24.240811+08:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         G. Beacham\nRequest for Comments: 5098                                Motorola, Inc.\nCategory: Standards Track                                       S. Kumar\n                                                       Texas Instruments\n                                                        S. Channabasappa\n                                                               CableLabs\n                                                           February 2008",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 14,
      "text": "Signaling MIB for PacketCable and IPCablecom Multimedia Terminal Adapters (MTAs)",
      "zh-CHS": "PacketCable和IPCablecom多媒体终端适配器（MTA）的信令MIB"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "zh-CHS": "关于下段备忘"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "zh-CHS": "本文件规定了互联网社区的互联网标准跟踪协议，并要求进行讨论和提出改进建议。有关本协议的标准化状态和状态，请参考当前版本的“互联网官方协议标准”（STD 1）。本备忘录的分发不受限制。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "zh-CHS": "摘要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it defines a basic set of managed objects for Simple Network Management Protocol (SNMP)-based management of PacketCable-and IPCablecom-compliant Multimedia Terminal Adapter devices.",
      "zh-CHS": "此备忘录定义了管理信息库（MIB）的一部分，用于Internet社区中的网络管理协议。特别是，它为基于简单网络管理协议（SNMP）的PacketCable和IPCablecom兼容多媒体终端适配器设备管理定义了一组基本的托管对象。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "zh-CHS": "目录"
    },
    {
      "indent": 3,
      "text": "1. The Internet-Standard Management Framework ......................2\n2. Introduction ....................................................2\n3. Terminology .....................................................3\n   3.1. MTA ........................................................3\n   3.2. Endpoint ...................................................3\n   3.3. L Line Package .............................................4\n   3.4. E Line Package .............................................4\n4. Overview ........................................................4\n   4.1. Structure of the MIB .......................................5\n   4.2. pktcSigMibObjects ..........................................5\n   4.3. pktcSigConformance .........................................6\n5. Definitions .....................................................6\n6. Examples .......................................................69\n7. Acknowledgments ................................................72\n8. Security Considerations ........................................73\n9. IANA Considerations ............................................75\n10. References ....................................................75\n   10.1. Normative References .....................................75\n   10.2. Informative References ...................................76",
      "raw": true,
      "toc": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "1. The Internet-Standard Management Framework",
      "section_title": true,
      "zh-CHS": "1. 因特网标准管理框架"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "zh-CHS": "有关描述当前互联网标准管理框架的文件的详细概述，请参阅RFC 3410[RFC3410]第7节。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "zh-CHS": "托管对象通过虚拟信息存储（称为管理信息库或MIB）进行访问。MIB对象通常通过简单网络管理协议（SNMP）进行访问。MIB中的对象是使用管理信息结构（SMI）中定义的机制定义的。本备忘录规定了符合SMIv2的MIB模块，如STD 58、RFC 2578[RFC2578]、STD 58、RFC 2579[RFC2579]和STD 58、RFC 2580[RFC2580]所述。"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "zh-CHS": "2. 介绍"
    },
    {
      "indent": 3,
      "text": "A multimedia terminal adapter (MTA) is used to deliver broadband Internet, data, and/or voice access jointly with telephony service to a subscriber's or customer's premises using a cable network infrastructure. An MTA is normally installed at the customer's or subscriber's premises, and it is coupled to a multiple system operator (MSO) using a hybrid fiber coax (HFC) access network.",
      "zh-CHS": "多媒体终端适配器（MTA）用于使用有线网络基础设施将宽带互联网、数据和/或语音接入与电话服务一起传送到用户或客户的场所。MTA通常安装在客户或订户的场所，并使用混合光纤同轴电缆（HFC）接入网络连接到多系统运营商（MSO）。"
    },
    {
      "indent": 3,
      "text": "An MTA is provisioned by the MSO for broadband Internet, data, and/or voice service. For more information on MTA provisioning, refer to",
      "zh-CHS": "MSO为宽带互联网、数据和/或语音服务提供MTA。有关MTA设置的详细信息，请参阅"
    },
    {
      "indent": 3,
      "text": "the PacketCable Provisioning Specification [PKT-SP-PROV] and [RFC4682]. MTA devices include one or more endpoints (e.g., telephone ports), which receive call signaling information to establish ring cadence, and codecs used for providing telephony service. For more information on call signaling, refer to the PacketCable Signaling Specification [PKT-SP-MGCP] and [RFC3435]. For more information on codecs refer to the PacketCable Audio/Video Codecs Specification [PKT-SP-CODEC].",
      "zh-CHS": "打包电缆供应规范[PKT-SP-PROV]和[RFC4682]。MTA设备包括一个或多个端点（例如，电话端口），用于接收呼叫信令信息以建立环频，以及用于提供电话服务的编解码器。有关呼叫信令的更多信息，请参阅PacketCable信令规范[PKT-SP-MGCP]和[RFC3435]。有关编解码器的更多信息，请参阅PacketCable音频/视频编解码器规范[PKT-SP-CODEC]。"
    },
    {
      "indent": 3,
      "text": "Telephone systems are typically very complex and often have a wide distribution. It is therefore important for management systems to support MTAs from multiple vendors at the same time, including those from multiple countries. This MIB module provides objects suitable for managing signaling for MTA devices in the widest possible range of markets.",
      "zh-CHS": "电话系统通常非常复杂，并且通常分布广泛。因此，管理系统必须同时支持来自多个供应商（包括来自多个国家/地区的供应商）的MTA。此MIB模块提供的对象适用于在尽可能广泛的市场范围内管理MTA设备的信令。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "zh-CHS": "3. 术语"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "zh-CHS": "本文件中的关键词“必须”、“不得”、“要求”、“应”、“不应”、“应”、“不应”、“建议”、“可”和“可选”应按照RFC 2119[RFC2119]中所述进行解释。"
    },
    {
      "indent": 3,
      "text": "The terms \"MIB module\" and \"information module\" are used interchangeably in this memo. As used here, both terms refer to any of the three types of information modules defined in Section 3 of RFC 2578 [RFC2578].",
      "zh-CHS": "术语“MIB模块”和“信息模块”在本备忘录中互换使用。此处使用的两个术语均指RFC 2578[RFC2578]第3节中定义的三种信息模块中的任何一种。"
    },
    {
      "indent": 0,
      "text": "3.1. MTA",
      "section_title": true,
      "zh-CHS": "3.1. MTA"
    },
    {
      "indent": 3,
      "text": "An MTA is a PacketCable or IPCablecom compliant device providing telephony services over a cable or hybrid system used to deliver video signals to a community. It contains an interface to endpoints, a network interface, codecs, and all signaling and encapsulation functions required for Voice-over IP transport, call signaling, and Quality of Service signaling. An MTA can be an embedded or standalone device. An Embedded MTA (E-MTA) is an MTA device containing an embedded Data Over Cable Service Interface Specifications (DOCSIS) Cable Modem. A Standalone MTA (S-MTA) is an MTA device separated from the DOCSIS Cable Modem by non-DOCSIS Media Access Control (MAC) interface (e.g., Ethernet, USB).",
      "zh-CHS": "MTA是一种符合PacketCable或IPCablecom标准的设备，通过用于向社区传送视频信号的电缆或混合系统提供电话服务。它包含端点接口、网络接口、编解码器以及IP语音传输、呼叫信令和服务质量信令所需的所有信令和封装功能。MTA可以是嵌入式或独立设备。嵌入式MTA（E-MTA）是一种MTA设备，包含嵌入式数据有线服务接口规范（DOCSIS）电缆调制解调器。独立MTA（S-MTA）是通过非DOCSIS介质访问控制（MAC）接口（如以太网、USB）与DOCSIS电缆调制解调器分离的MTA设备。"
    },
    {
      "indent": 0,
      "text": "3.2. Endpoint",
      "section_title": true,
      "zh-CHS": "3.2. 端点"
    },
    {
      "indent": 3,
      "text": "An endpoint or MTA endpoint is a standard telephony physical port located on the MTA and used for attaching the telephone device to the MTA.",
      "zh-CHS": "端点或MTA端点是位于MTA上的标准电话物理端口，用于将电话设备连接到MTA。"
    },
    {
      "indent": 0,
      "text": "3.3. L Line Package",
      "section_title": true,
      "zh-CHS": "3.3. L线封装"
    },
    {
      "indent": 3,
      "text": "The L line package refers to the Media Gateway Control Protocol (MGCP) package for the core signaling functionality, as defined by PacketCable and IPCablecom. An MTA provides all L package elements: however, the operator determines their application.",
      "zh-CHS": "L线包是指PacketCable和IPCablecom定义的用于核心信令功能的媒体网关控制协议（MGCP）包。MTA提供所有L包元素：但是，由操作员确定其应用程序。"
    },
    {
      "indent": 0,
      "text": "3.4. E Line Package",
      "section_title": true,
      "zh-CHS": "3.4. 电子线路包"
    },
    {
      "indent": 3,
      "text": "The E line package refers to the MGCP package extensions, over and above the core L package, defined in support of international requirements. E line package elements are optional, vary from country to country, and are set by operator or regulatory requirements.",
      "zh-CHS": "E线包是指MGCP包扩展，位于核心L包之上，定义用于支持国际要求。E-line包装元件是可选的，因国家而异，由运营商或监管要求设置。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "zh-CHS": "4. 概述"
    },
    {
      "indent": 3,
      "text": "This MIB module provides a set of objects required for Multimedia Terminal Adapter (MTA) devices compliant with the PacketCable and IPCablecom signaling specifications published by CableLabs, the European Telecommunications Standards Institute (ETSI), and the International Telecommunication Union Telecommunication Standardization Sector (ITU-T) IPCablecom compliant Multimedia Terminal Adapter (MTA) devices. The Signaling MIB module (PKTC-IETF-SIG-MIB) is intended to update various Signaling MIB modules from which it is partly derived:",
      "zh-CHS": "此MIB模块提供多媒体终端适配器（MTA）设备所需的一组对象，这些设备符合CableLabs、欧洲电信标准协会（ETSI）和国际电信联盟电信标准化部门（ITU-T）发布的PacketCable和IPCablecom信令规范IPCablecom兼容的多媒体终端适配器（MTA）设备。信令MIB模块（PKTC-IETF-SIG-MIB）旨在更新其部分派生的各种信令MIB模块："
    },
    {
      "indent": 5,
      "text": "- the PacketCable 1.0 Signaling MIB Specification [PKT-SP-MIB-SIG-1.0],",
      "zh-CHS": "- PacketCable 1.0信令MIB规范[PKT-SP-MIB-SIG-1.0]，"
    },
    {
      "indent": 5,
      "text": "- the PacketCable 1.5 Signaling MIB Specification [PKT-SP-MIB-SIG-1.5],",
      "zh-CHS": "- PacketCable 1.5信令MIB规范[PKT-SP-MIB-SIG-1.5]，"
    },
    {
      "indent": 5,
      "text": "- the ITU-T IPCablecom Signaling MIB requirements [ITU-T-J169],",
      "zh-CHS": "- ITU-T IPCablecom信令MIB要求[ITU-T-J169]，"
    },
    {
      "indent": 5,
      "text": "- the ETSI Signaling MIB [ETSI-TS-101-909-9]. The ETSI Signaling MIB requirements also refer to various signal characteristics defined in [ETSI-TS-101-909-4], [ETSI-EN-300-001], [ETSI-EN-300-659-1], [ETSI-EN-300-324-1] and [ETSI-TR-101-183].",
      "zh-CHS": "- ETSI信令MIB[ETSI-TS-101-909-9]。ETSI信令MIB要求还涉及[ETSI-TS-101-909-4]、[ETSI-EN-300-001]、[ETSI-EN-300-659-1]、[ETSI-EN-300-324-1]和[ETSI-TR-101-183]中定义的各种信号特征。"
    },
    {
      "indent": 3,
      "text": "Several normative and informative references are used to help define Signaling MIB objects. As a convention, wherever PacketCable and IPCablecom requirements are equivalent, the PacketCable reference is used in the object REFERENCE clause. IPCablecom compliant MTA devices MUST use the equivalent IPCablecom references.",
      "zh-CHS": "一些规范性和信息性参考文献用于帮助定义信令MIB对象。按照惯例，只要PacketCable和IPCablecom要求是等效的，就在object reference子句中使用PacketCable引用。符合IPCablecom的MTA设备必须使用等效的IPCablecom引用。"
    },
    {
      "indent": 3,
      "text": "This MIB module describes the various Signaling MIB objects that are directly related to the PacketCable MTA and the endpoints supported on the MTA, each of which provides services independently. The recognition and distinction of the endpoints are made by utilizing the ifTable (IF-MIB [RFC2863]), where each index (ifIndex) value refers to a unique endpoint. This MIB module also utilizes the syntax definition of the Differentiated Services Code Point (DSCP) from DIFFSERV-DSCP-TC [RFC3289] for defining MIB objects that allow for differentiation between various types of traffic in the service provider network.",
      "zh-CHS": "此MIB模块描述与PacketCable MTA直接相关的各种信令MIB对象以及MTA上支持的端点，每个端点都独立提供服务。端点的识别和区分是通过利用ifTable（IF-MIB[RFC2863]）来实现的，其中每个索引（ifIndex）值表示一个唯一的端点。此MIB模块还利用DIFFSERV-DSCP-TC[RFC3289]中的差异化服务代码点（DSCP）的语法定义来定义MIB对象，以允许区分服务提供商网络中的各种类型的流量。"
    },
    {
      "indent": 0,
      "text": "4.1. Structure of the MIB",
      "section_title": true,
      "zh-CHS": "4.1. MIB的结构"
    },
    {
      "indent": 3,
      "text": "This MIB module is identified by pktcIetfSigMib and is structured into two major parts:",
      "zh-CHS": "该MIB模块由PKTCIETFSIGIMIB标识，并分为两个主要部分："
    },
    {
      "indent": 3,
      "text": "- Signaling information that controls device and endpoint configuration (pktcSigMibObjects)",
      "zh-CHS": "- 控制设备和端点配置的信令信息（pktcSigMibObjects）"
    },
    {
      "indent": 3,
      "text": "- Module Conformance information(pktcSigConformance)",
      "zh-CHS": "- 模块一致性信息（PKTCSIGConsistence）"
    },
    {
      "indent": 3,
      "text": "The following sections explain each part in further detail. It is to be noted that future enhancements to specify Notification Objects are also allowed (pktcSigNotification).",
      "zh-CHS": "以下各节将对每个部分进行更详细的解释。需要注意的是，还允许将来对指定通知对象进行增强（pktcSigNotification）。"
    },
    {
      "indent": 0,
      "text": "4.2. pktcSigMibObjects",
      "section_title": true,
      "zh-CHS": "4.2. pktcSigMibObjects"
    },
    {
      "indent": 3,
      "text": "This is further divided into device-specific elements (pktcSigDevObjects) and endpoint-specific elements (pktcSigEndPntConfigObjects).",
      "zh-CHS": "这进一步分为设备特定元素（pktcSigDevObjects）和端点特定元素（pktcSigEndPntConfigObjects）。"
    },
    {
      "indent": 3,
      "text": "Some highlights of the device-specific elements are as follows:",
      "zh-CHS": "设备特定元素的一些亮点如下："
    },
    {
      "indent": 3,
      "text": "pktcSigDevCodecTable - this object identifies the codec types available on the device.",
      "zh-CHS": "pktcSigDevCodecTable-此对象标识设备上可用的编解码器类型。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevEchoCancellation - this object identifies the capability of echo cancellation on the device.",
      "zh-CHS": "pktcSigDevEchoCancellation-此对象标识设备上的回声消除功能。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevSilenceSuppression - this object specifies if the device is capable of silence suppression (Voice Activity Detection).",
      "zh-CHS": "pktcSigDevSilenceSuppression-此对象指定设备是否能够抑制静音（语音活动检测）。"
    },
    {
      "indent": 3,
      "text": "pktcSigPulseSignalTable - this table selects the various signals used in the application of the metering pulse signal to the twisted pair line.",
      "zh-CHS": "pktcSigPulseSignalTable-此表选择将计量脉冲信号应用于双绞线时使用的各种信号。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable - this table specifies a flexible structure within which to specify all of the tones used in the MTA.",
      "zh-CHS": "pktcSigDevToneTable-此表指定了一个灵活的结构，可以在其中指定MTA中使用的所有音调。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable - this table defines the characteristics of tones with multiple frequencies. Each entry in this table represents the frequency reference of a multi-frequency tone.",
      "zh-CHS": "PKTCSIGDEVMULTIFREKTONETABLE-此表定义了具有多个频率的音调的特征。此表中的每个条目表示多频音调的频率参考。"
    },
    {
      "indent": 3,
      "text": "The endpoint-specific elements are mostly confined to the Endpoint configuration MIB table (pktcSigEndPntConfigTable). This table describes the MTA endPoint configuration. The number of entries in this table represents the number of provisioned endpoints.",
      "zh-CHS": "端点特定的元素主要局限于端点配置MIB表（pktcSigEndPntConfigTable）。此表介绍MTA端点配置。此表中的条目数表示已配置端点的数量。"
    },
    {
      "indent": 0,
      "text": "4.3. pktcSigConformance",
      "section_title": true,
      "zh-CHS": "4.3. PKTCSIGN一致性"
    },
    {
      "indent": 3,
      "text": "pktcSigDeviceGroup - this group contains all the MIB objects that apply on a per-device basis and need to be implemented by an MTA to claim compliance with the specified MIB module.",
      "zh-CHS": "pktcSigDeviceGroup-此组包含基于每个设备应用的所有MIB对象，需要由MTA实现以声明符合指定的MIB模块。"
    },
    {
      "indent": 3,
      "text": "pktcSigEndpointGroup - this group contains all the MIB objects that apply on a per-endpoint basis and need to be implemented by an MTA to claim compliance with the specified MIB module.",
      "zh-CHS": "pktcSigEndpointGroup-此组包含基于每个端点应用的所有MIB对象，需要由MTA实现以声明符合指定的MIB模块。"
    },
    {
      "indent": 3,
      "text": "pktcLLinePackageGroup - this group contains the MIB objects that need to be implemented to support the L line package.",
      "zh-CHS": "pktcLLinePackageGroup—此组包含需要实现以支持L行包的MIB对象。"
    },
    {
      "indent": 3,
      "text": "pktcELinePackageGroup - this group contains the MIB objects that need to be implemented to support the E line package.",
      "zh-CHS": "pktcELinePackageGroup-此组包含需要实现以支持E-line包的MIB对象。"
    },
    {
      "indent": 3,
      "text": "pktcInternationalGroup - this group contains optional MIB objects designed to support operations over the widest possible range of markets.",
      "zh-CHS": "pktcInternationalGroup-此组包含可选的MIB对象，旨在支持尽可能广泛的市场运营。"
    },
    {
      "indent": 0,
      "text": "5. Definitions",
      "section_title": true,
      "zh-CHS": "5. 定义"
    },
    {
      "indent": 0,
      "text": "PKTC-IETF-SIG-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "IMPORTS\n    MODULE-IDENTITY,\n    OBJECT-TYPE,\n    Integer32,\n    Unsigned32,\n    mib-2\n          FROM SNMPv2-SMI                   -- [RFC2578]\n    InetAddressType,\n    InetAddress,\n    InetPortNumber\n          FROM INET-ADDRESS-MIB             -- [RFC4001]\n    TEXTUAL-CONVENTION,\n    RowStatus,\n    TruthValue\n          FROM SNMPv2-TC                    -- [RFC2579]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "OBJECT-GROUP,\nMODULE-COMPLIANCE\n      FROM SNMPv2-CONF                  -- [RFC2580]\nSnmpAdminString\n      FROM SNMP-FRAMEWORK-MIB           -- [RFC3411]\nifIndex\n      FROM IF-MIB                       -- [RFC2863]\nDscp\n      FROM DIFFSERV-DSCP-TC;            -- [RFC3289]",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcIetfSigMib MODULE-IDENTITY LAST-UPDATED \"200712180000Z\" -- December 18, 2007 ORGANIZATION \"IETF IPCDN Working Group\" CONTACT-INFO \"Sumanth Channabasappa Cable Television Laboratories, Inc. 858 Coal Creek Circle, Louisville, CO 80027, USA Phone: +1 303-661-3307 Email: Sumanth@cablelabs.com",
      "zh-CHS": "pktcIetfSigMib模块标识最新更新“200712180000Z”-2007年12月18日组织“IETF IPCDN工作组”联系方式“Sumanth Channabasapa有线电视实验室有限公司，地址：美国科罗拉多州路易斯维尔煤溪圈858号电话：+1 303-661-3307电子邮件：Sumanth@cablelabs.com"
    },
    {
      "indent": 9,
      "text": "Gordon Beacham Motorola, Inc. 6450 Sequence Drive, Bldg. 1 San Diego, CA 92121, USA Phone: +1 858-404-2334 Email: gordon.beacham@motorola.com",
      "zh-CHS": "Gordon Beacham Motorola，Inc.6450 Sequence Drive，美国加利福尼亚州圣地亚哥1号楼92121电话：+1 858-404-2334电子邮件：Gordon。beacham@motorola.com"
    },
    {
      "indent": 9,
      "text": "Satish Kumar Mudugere Eswaraiah Texas Instruments India (P) Ltd., Golf view, Wind Tunnel Road Murugesh Palya Bangalore 560 017, INDIA Phone: +91 80 5269451 Email: satish.kumar@ti.com",
      "zh-CHS": "Satish Kumar Mudugere Eswaraiah Texas Instruments India（P）Ltd.，印度班加罗尔Murugesh Palya风洞路高尔夫景观560017电话：+91 80 5269451电子邮件：Satish。kumar@ti.com"
    },
    {
      "indent": 4,
      "text": "IETF IPCDN Working Group\n     General Discussion: ipcdn@ietf.org\n     Subscribe: http://www.ietf.org/mailman/listinfo/ipcdn\n     Archive: ftp://ftp.ietf.org/ietf-mail-archive/ipcdn\n     Co-Chair: Jean-Francois Mule, jf.mule@cablelabs.com\n     Co-Chair: Richard Woundy, Richard_Woundy@cable.comcast.com\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"This MIB module supplies the basic management objects for the PacketCable and IPCablecom Signaling protocols. This version of the MIB includes common signaling and Network Call Signaling",
      "zh-CHS": "DESCRIPTION“此MIB模块为PacketCable和IPCablecom信令协议提供基本管理对象。此版本的MIB包括通用信令和网络呼叫信令"
    },
    {
      "indent": 8,
      "text": "(NCS)-related signaling objects.",
      "zh-CHS": "（NCS）相关的信令对象。"
    },
    {
      "indent": 4,
      "text": " Copyright (C) The IETF Trust (2008). This version of this MIB module is part of RFC 5098; see the RFC itself for full legal notices.\" REVISION \"200712180000Z\" DESCRIPTION \"Initial version, published as RFC 5098.\"",
      "zh-CHS": "版权所有（C）IETF信托基金（2008年）。此版本的MIB模块是RFC 5098的一部分；有关完整的法律通知，请参见RFC本身。“修订版”200712180000Z“说明”初始版本，发布为RFC 5098"
    },
    {
      "indent": 0,
      "text": "::=  { mib-2 169 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "-- Textual Conventions",
      "zh-CHS": "--文本约定"
    },
    {
      "indent": 0,
      "text": "TenthdBm ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d-1\"\n    STATUS       current\n    DESCRIPTION\n        \"This TEXTUAL-CONVENTION represents power levels that are\n         normally expressed in dBm.  Units are in tenths of a dBm;\n         for example, -13.5 dBm will be represented as -135.\"\n    SYNTAX       Integer32",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcCodecType ::= TEXTUAL-CONVENTION\n    STATUS       current\n    DESCRIPTION\n        \" This TEXTUAL-CONVENTION defines various types of codecs\n          that MAY be supported.  The description for each\n          enumeration is listed below:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Enumeration Description other a defined codec not in the enumeration unknown a codec not defined by the PacketCable Codec Specification g729 ITU-T Recommendation G.729 reserved for future use g729E ITU-T Recommendation G.729E pcmu Pulse Code Modulation u-law (PCMU) g726at32 ITU-T Recommendation G.726-32 (32 kbit/s) g728 ITU-T Recommendation G.728 pcma Pulse Code Modulation a-law (PCMA) g726at16 ITU-T Recommendation G.726-16 (16 kbit/s) g726at24 ITU-T Recommendation G.726-24 (24 kbit/s) g726at40 ITU-T Recommendation G.726-40 (40 kbit/s) ilbc IETF Internet low-bit rate codec bv16 Broadcom BroadVoice16",
      "zh-CHS": "枚举说明其他未在枚举中定义的编解码器未知未由PacketCable编解码器规范g729 ITU-T建议G.729定义的编解码器保留供将来使用g729E ITU-T建议G.729E pcmu脉冲编码调制u律（pcmu）g726at32 ITU-T建议G.726-32（32 kbit/s）g728 ITU-T建议G.728 pcma脉冲编码调制a-law（pcma）g726at16 ITU-T建议G.726-16（16 kbit/s）g726at24 ITU-T建议G.726-24（24 kbit/s）g726at40 ITU-T建议G.726-40（40 kbit/s）ilbc IETF互联网低比特率编解码器bv16 Broadcom BroadVoice16"
    },
    {
      "indent": 10,
      "text": "The list of codecs is consistent with the IETF Real-Time Transport Protocol (RTP) Profile registry and",
      "zh-CHS": "编解码器列表与IETF实时传输协议（RTP）配置文件注册表和"
    },
    {
      "indent": 10,
      "text": "the RTP Map Parameters Table in PacketCable Audio/Video Codecs Specification [PKT-SP-CODEC]. The literal codec name for each codec is listed below:",
      "zh-CHS": "PacketCable音频/视频编解码器规范[PKT-SP-CODEC]中的RTP映射参数表。下面列出了每个编解码器的文字编解码器名称："
    },
    {
      "indent": 10,
      "text": "Codec Literal Codec Name g729 G729 g729E G729E pcmu PCMU g726at32 G726-32 g728 G728 pcma PCMA g726at16 G726-16 g726at24 G726-24 g726at40 G726-40 ilbc iLBC bv16 BV16",
      "zh-CHS": "编解码器文字编解码器名称g729 g729 g729E g729E pcmu pcmu g726at32 G726-32 g728 g728 pcma pcma g726at16 G726-16 g726at24 G726-24 g726at40 G726-40 ilbc ilbc bv16"
    },
    {
      "indent": 4,
      "text": "      The literal codec name is the second column of the table\n      with codec RTP Map Parameters.  The Literal Codec Name Column\n      contains the codec name used in the local connection\n      options (LCO) of the NCS messages create connection\n      (CRCX)/modify connection (MDCX) and is also used to\n      identify the codec in the Call Management System (CMS)\n      Provisioning Specification.  The RTP Map Parameter column of\n      the Table contains the string used in the media attribute\n      line (a=) of the session description protocol (SDP)\n      parameters in NCS messages.\"\nSYNTAX INTEGER {\n           other     (1),\n           unknown   (2),\n           g729      (3),\n           reserved  (4),\n           g729E     (5),\n           pcmu      (6),\n           g726at32  (7),\n           g728      (8),\n           pcma      (9),\n           g726at16  (10),\n           g726at24  (11),\n           g726at40  (12),\n           ilbc      (13),\n           bv16      (14)\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcRingCadence   ::= TEXTUAL-CONVENTION\n    STATUS        current\n    DESCRIPTION\n          \"This object provides an encoding scheme for ring",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "cadences, including repeatability characteristics. All fields in this object MUST be encoded in network-byte order.",
      "zh-CHS": "节奏，包括重复性特征。此对象中的所有字段必须按网络字节顺序编码。"
    },
    {
      "indent": 10,
      "text": "The first three higher-order octets are reserved. The octets that follow are used to encode a 'bit-string', with each bit corresponding to 50 milliseconds. A bit value of '1' indicates the presence of a ring-tone, and a bit value of '0' indicates the absence of a ring-tone, for that duration (50 ms) (Note: A minimum number of octets required to encode the bit-string MUST be used).",
      "zh-CHS": "保留前三个高阶八位组。后面的八位字节用于编码“位字符串”，每个位对应50毫秒。位值“1”表示存在铃声，位值“0”表示在该持续时间（50 ms）内没有铃声（注意：必须使用编码位字符串所需的最小八位字节数）。"
    },
    {
      "indent": 10,
      "text": "The first two of the reserved octets MUST indicate the length of the encoded cadence (in bits) and MUST range between 1 and 264. (Note: The length in bits MUST also be consistent with the number of octets that encode the cadence). The MTA MUST ignore any unused bits in the last octet, but MUST reflect the value as provided on subsequent SNMP GETs.",
      "zh-CHS": "保留八位字节中的前两个必须指示编码节拍的长度（以位为单位），并且必须在1到264之间。（注意：以位为单位的长度还必须与编码节奏的八位字节数一致）。MTA必须忽略最后八位字节中任何未使用的位，但必须反映后续SNMP GET中提供的值。"
    },
    {
      "indent": 10,
      "text": "The third of the reserved octets indicates 'repeatability' and MUST be either 0x80 or 0x00 -- the former value indicating 'non-repeatability', and the latter indicating 'repeatability'.",
      "zh-CHS": "第三个保留八位字节表示“可重复性”，必须为0x80或0x00——前者表示“不可重复性”，后者表示“可重复性”。"
    },
    {
      "indent": 10,
      "text": "The MTA MUST reject attempts to set a value that violates any of the above requirements.\"",
      "zh-CHS": "MTA必须拒绝设置违反上述任何要求的值的尝试。”"
    },
    {
      "indent": 4,
      "text": "SYNTAX OCTET STRING (SIZE(4..36))",
      "zh-CHS": "语法八位字节字符串（大小（4..36））"
    },
    {
      "indent": 0,
      "text": "PktcSigType     ::= TEXTUAL-CONVENTION\n    STATUS       current\n    DESCRIPTION\n        \" This object lists the various types of signaling that may\n          be supported:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "      other(1) - set when signaling other than NCS is used\n      ncs(2)   - Network Call Signaling is a derivation of MGCP\n                (Media Gateway Control Protocol) defined for\n                 IPCablecom/PacketCable MTAs.\"\nSYNTAX INTEGER {\n               other(1),\n               ncs(2)\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "DtmfCode::=TEXTUAL-CONVENTION\n    STATUS       current\n    DESCRIPTION\n        \"This TEXTUAL-CONVENTION represents the Dual-Tone\n         Multi-Frequency (DTMF) Character used\n         to indicate the start or end of the digit transition\n         sequence used for caller id or Visual Message Waiting\n         Indicator (VMWI).",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "         Note: The DTMF code '*' is indicated using 'dtmfcodeStar',\n         and the DTMF code '#' is indicated using ' dtmfcodeHash'.\"\n    SYNTAX       INTEGER {\n                  dtmfcode0(0),\n                  dtmfcode1(1),\n                  dtmfcode2(2),\n                  dtmfcode3(3),\n                  dtmfcode4(4),\n                  dtmfcode5(5),\n                  dtmfcode6(6),\n                  dtmfcode7(7),\n                  dtmfcode8(8),\n                  dtmfcode9(9),\n                  dtmfcodeStar(10),\n                  dtmfcodeHash(11),\n                  dtmfcodeA(12),\n                  dtmfcodeB(13),\n                  dtmfcodeC(14),\n                  dtmfcodeD(15)\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcSubscriberSideSigProtocol::=TEXTUAL-CONVENTION\n    STATUS  current\n    DESCRIPTION\n        \"This TEXTUAL-CONVENTION represents the Signaling\n         protocol being used for purposes such as caller id\n         or VMWI.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "A value of fsk(1) indicates Frequency Shift Keying\n(FSK).\nA value of dtmf(2) indicates Dual-Tone Multi-Frequency\n(DTMF).\"\nSYNTAX INTEGER {\n       fsk(1),\n       dtmf(2)\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigMibObjects OBJECT IDENTIFIER ::= { pktcIetfSigMib 1 }\npktcSigDevObjects OBJECT IDENTIFIER ::=",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "                                        { pktcSigMibObjects 1 }\npktcSigEndPntConfigObjects OBJECT IDENTIFIER ::=\n                                        { pktcSigMibObjects 2 }\n--\n-- The codec table (pktcSigDevCodecTable) defines all combinations\n-- of codecs supported by the Multimedia Terminal Adapter (MTA).\n--\npktcSigDevCodecTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF PktcSigDevCodecEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n         \" This table describes the MTA-supported codec types.  An MTA\n          MUST populate this table with all possible combinations of\n          codecs it supports for simultaneous operation.  For example,\n          an MTA with two endpoints may be designed with a particular\n          Digital Signal Processing (DSP) and memory architecture that\n          allows it to support the following fixed combinations of\n          codecs for simultaneous operation:",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "Codec Type Maximum Number of Simultaneous Codecs PCMA 3",
      "zh-CHS": "编解码器类型同时编解码器的最大数量PCMA 3"
    },
    {
      "indent": 10,
      "text": "PCMA 2 PCMU 1",
      "zh-CHS": "PCMA 2 PCMU 1"
    },
    {
      "indent": 10,
      "text": "PCMA 1",
      "zh-CHS": "PCMA 1"
    },
    {
      "indent": 10,
      "text": "PCMU 2",
      "zh-CHS": "PCMU 2"
    },
    {
      "indent": 10,
      "text": "PCMU 3",
      "zh-CHS": "PCMU 3"
    },
    {
      "indent": 10,
      "text": "PCMA 1 G729 1",
      "zh-CHS": "PCMA 1 G729 1"
    },
    {
      "indent": 10,
      "text": "G729 2",
      "zh-CHS": "G729 2"
    },
    {
      "indent": 10,
      "text": "PCMU 1 G729 1",
      "zh-CHS": "PCMU 1 G729 1"
    },
    {
      "indent": 10,
      "text": "Based on this example, the entries in the codec table would be:",
      "zh-CHS": "基于此示例，编解码器表中的条目将为："
    },
    {
      "indent": 10,
      "text": " pktcSigDev pktcSigDev pktcSigDev CodecComboIndex CodecType CodecMax 1 pcma 3 2 pcma 2 2 pcmu 1",
      "zh-CHS": "pktcSigDev pktcSigDev pktcSigDev codecomboindex CodecType CodecMax 1 pcma 3 2 pcma 2 pcmu 1"
    },
    {
      "indent": 17,
      "text": "3 pcma 1 3 pcmu 2 4 pcmu 3 5 pcma 1 5 g729 1 6 g729 2 7 pcmu 1 7 g729 1",
      "zh-CHS": "3 pcma 1 3 pcmu 2 4 pcmu 3 5 pcma 1 5 g729 1 6 g729 2 7 pcmu 1 7 g729 1"
    },
    {
      "indent": 10,
      "text": "An operator querying this table is able to determine all possible codec combinations the MTA is capable of simultaneously supporting.",
      "zh-CHS": "查询此表的操作员能够确定MTA能够同时支持的所有可能的编解码器组合。"
    },
    {
      "indent": 4,
      "text": "      This table MUST NOT include non-voice codecs.\"\n::= { pktcSigDevObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecEntry  OBJECT-TYPE\n    SYNTAX      PktcSigDevCodecEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Each entry represents the maximum number of active\n         connections with a particular codec the MTA is capable of\n         supporting.  Each row is indexed by a composite key\n         consisting of a number enumerating the particular codec\n         combination and the codec type.\"\n    INDEX { pktcSigDevCodecComboIndex, pktcSigDevCodecType }\n    ::= { pktcSigDevCodecTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcSigDevCodecEntry  ::= SEQUENCE {\n    pktcSigDevCodecComboIndex    Unsigned32,\n    pktcSigDevCodecType     PktcCodecType,\n    pktcSigDevCodecMax      Unsigned32\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecComboIndex  OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..255)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \" The index value that enumerates a particular codec\n          combination in the pktcSigDevCodecTable.\"\n    ::= { pktcSigDevCodecEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecType OBJECT-TYPE SYNTAX PktcCodecType MAX-ACCESS not-accessible STATUS current",
      "zh-CHS": "pktcSigDevCodecType对象类型语法PktcCodecType MAX-ACCESS不可访问状态当前"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n    \" A codec type supported by this MTA.\"\n::= { pktcSigDevCodecEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecMax  OBJECT-TYPE\n    SYNTAX      Unsigned32(1..255)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \" The maximum number of simultaneous sessions of a\n          particular codec that the MTA can support.\"\n    ::= { pktcSigDevCodecEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- These are the common signaling-related definitions that affect\n-- the entire MTA device.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevEchoCancellation  OBJECT-TYPE\n    SYNTAX       TruthValue\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This object specifies if the device is capable of echo\n          cancellation.  The MTA MUST set this MIB object to a\n          value of true(1) if it is capable of echo\n          cancellation, and a value of false(2) if not.\"\n    ::= { pktcSigDevObjects 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevSilenceSuppression  OBJECT-TYPE\n    SYNTAX       TruthValue\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This object specifies if the device is capable of\n          silence suppression (as a result of Voice Activity\n          Detection).  The MTA MUST set this MIB object to a\n          value of true(1) if it is capable of silence\n          suppression, and a value of false(2) if not.\"\n::= { pktcSigDevObjects 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidSigProtocol OBJECT-TYPE SYNTAX PktcSubscriberSideSigProtocol MAX-ACCESS read-write STATUS current DESCRIPTION \"This object is used to configure the subscriber-line protocol used for signaling on-hook caller id information.",
      "zh-CHS": "pktcSigDevCidSigProtocol对象类型语法PktcSubscriberSideSigProtocol MAX-ACCESS read-write STATUS current DESCRIPTION“此对象用于配置用于向挂接呼叫方id信息发送信号的订户线路协议。"
    },
    {
      "indent": 9,
      "text": "Different countries define different caller id signaling protocols to support caller identification.",
      "zh-CHS": "不同的国家定义了不同的呼叫者id信令协议来支持呼叫者识别。"
    },
    {
      "indent": 9,
      "text": "Setting this object at a value fsk(1) sets the subscriber line protocol to be Frequency Shift Keying (FSK).",
      "zh-CHS": "将此对象的值设置为fsk（1）将用户线路协议设置为频移键控（fsk）。"
    },
    {
      "indent": 9,
      "text": "Setting this object at a value dtmf(2) sets the subscriber line protocol to be Dual-Tone Multi-Frequency (DTMF).",
      "zh-CHS": "将此对象的值设置为dtmf（2）将用户线路协议设置为双音多频（dtmf）。"
    },
    {
      "indent": 0,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n     REFERENCE\n        \"ETSI-EN-300-659-1 Specification\"\n     DEFVAL { fsk }\n::= { pktcSigDevObjects 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR0Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 0 (a user-defined field).",
      "zh-CHS": "pktcSigDevR0Cadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定环cadence 0（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR1Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 1 (a user-defined field).",
      "zh-CHS": "PKTCSIGDEVR1CADDENCE对象类型语法PKTCRINGCADDENCE MAX-ACCESS读写状态当前描述“此对象指定环CADDENCE 1（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR2Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 2 (a user-defined field).",
      "zh-CHS": "pktcSigDevR2Cadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence 2（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR3Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 3 (a user-defined field).",
      "zh-CHS": "pktcSigDevR3Cadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence 3（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR4Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 4 (a user-defined field).",
      "zh-CHS": "pktcSigDevR4Cadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence 4（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR5Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 5 (a user-defined field).",
      "zh-CHS": "pktcSigDevR5Cadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence 5（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR6Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 6 (a user-defined field).",
      "zh-CHS": "pktcSigDevR6Cadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence 6（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevR7Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 7 (a user-defined field).",
      "zh-CHS": "pktcSigDevR7Cadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence 7（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevRgCadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence rg (a user-defined field).",
      "zh-CHS": "pktcSigDevRgCadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence rg（用户定义的字段）。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevRsCadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence rs (a user-defined field). The MTA MUST reject any attempt to make this object repeatable.",
      "zh-CHS": "pktcSigDevRsCadence对象类型语法PktcRingCadence MAX-ACCESS读写状态当前描述“此对象指定ring cadence rs（用户定义的字段）。MTA必须拒绝使此对象可重复的任何尝试。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDefCallSigDscp OBJECT-TYPE SYNTAX Dscp -- RFC 3289: DIFFSERV-DSCP-TC MAX-ACCESS read-write STATUS current DESCRIPTION \" The default value used in the IP header for setting the Differentiated Services Code Point (DSCP) value for call",
      "zh-CHS": "PKTCSIGFALLSIGDSCP对象类型语法Dscp--RFC 3289:DIFFSERV-Dscp-TC MAX-ACCESS读写状态当前描述“IP标头中用于设置呼叫的差异化服务代码点（Dscp）值的默认值"
    },
    {
      "indent": 10,
      "text": "signaling.",
      "zh-CHS": "信号。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nDEFVAL { 0 }\n::= { pktcSigDevObjects 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDefMediaStreamDscp OBJECT-TYPE SYNTAX Dscp -- RFC 3289: DIFFSERV-DSCP-TC MAX-ACCESS read-write STATUS current DESCRIPTION \" This object contains the default value used in the IP header for setting the Differentiated Services Code Point (DSCP) value for media stream packets. The MTA MUST NOT update this object with the value supplied by the CMS in the NCS messages (if present). Any currently active connections are not affected by updates to this object. When the value of this object is updated by SNMP, the MTA MUST use the new value as a default starting only from new connections.",
      "zh-CHS": "pktcSigDefMediaStreamDscp对象类型语法Dscp--RFC 3289:DIFFSERV-Dscp-TC MAX-ACCESS读写状态当前描述“此对象包含IP标头中用于设置区分服务代码点（Dscp）的默认值”媒体流数据包的值。MTA不得使用NCS消息（如果存在）中CMS提供的值更新此对象。任何当前活动的连接都不受此对象更新的影响。当SNMP更新此对象的值时，MTA必须使用新值作为默认值，仅从新连接开始。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nDEFVAL { 0 }\n::= { pktcSigDevObjects 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- pktcSigCapabilityTable - This table defines the valid signaling\n-- types supported by this MTA.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityTable    OBJECT-TYPE\n    SYNTAX        SEQUENCE OF PktcSigCapabilityEntry\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \" This table describes the signaling types supported by this\n          MTA.\"\n    ::= { pktcSigDevObjects 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityEntry OBJECT-TYPE SYNTAX PktcSigCapabilityEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" Entries in pktcMtaDevSigCapabilityTable - list of supported signaling types, versions, and vendor extensions",
      "zh-CHS": "pktcSigCapabilityEntry对象类型语法pktcSigCapabilityEntry MAX-ACCESS不可访问状态当前描述“pktcMtaDevSigCapabilityTable中的条目-支持的信令类型、版本和供应商扩展的列表"
    },
    {
      "indent": 4,
      "text": "      for this MTA.  Each entry in the list provides for one\n      signaling type and version combination.  If the device\n      supports multiple versions of the same signaling type, it\n      will require multiple entries.\"\nINDEX { pktcSigCapabilityIndex }\n::= { pktcSigCapabilityTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcSigCapabilityEntry  ::= SEQUENCE {\n    pktcSigCapabilityIndex             Unsigned32,\n    pktcSigCapabilityType              PktcSigType,\n    pktcSigCapabilityVersion           SnmpAdminString,\n    pktcSigCapabilityVendorExt         SnmpAdminString\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityIndex       OBJECT-TYPE\n    SYNTAX        Unsigned32 (1..255)\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \" The index value that uniquely identifies an entry in the\n          pktcSigCapabilityTable.\"\n    ::= { pktcSigCapabilityEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityType      OBJECT-TYPE\n    SYNTAX        PktcSigType\n    MAX-ACCESS    read-only\n    STATUS        current\n    DESCRIPTION\n        \" This object identifies the type of signaling used.  This\n          value has to be associated with a single signaling\n          version.\"\n    ::= { pktcSigCapabilityEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityVersion      OBJECT-TYPE\n    SYNTAX        SnmpAdminString\n    MAX-ACCESS    read-only\n    STATUS        current\n    DESCRIPTION\n        \" Provides the version of the signaling type - reference\n          pktcSigCapabilityType.  Examples would be 1.0 or 2.33 etc.\"\n    ::= { pktcSigCapabilityEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityVendorExt OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \" The vendor extension allows vendors to provide a list of",
      "zh-CHS": "pktcsigcapabilityvendoext对象类型语法snmpadmin安装MAX-ACCESS只读状态当前描述“供应商扩展允许供应商提供"
    },
    {
      "indent": 10,
      "text": "additional capabilities.",
      "zh-CHS": "附加功能。"
    },
    {
      "indent": 10,
      "text": "The syntax for this MIB object in ABNF ([RFC5234]) is specified to be zero or more occurrences of vendor extensions, as follows:",
      "zh-CHS": "ABNF（[RFC5234]）中此MIB对象的语法指定为零次或多次出现供应商扩展，如下所示："
    },
    {
      "indent": 11,
      "text": "pktcSigCapabilityVendorExt  = *(vendor-extension)\nvendor-extension = (ext symbol alphanum) DQUOTE ; DQUOTE\next      = DQUOTE %x58 DQUOTE\nsymbol   = (DQUOTE %x2D DQUOTE)/(DQUOTE %x2D DQUOTE)\nalphanum = 1*6(ALPHA/DIGIT)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "    \"\n::= { pktcSigCapabilityEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDefNcsReceiveUdpPort OBJECT-TYPE SYNTAX InetPortNumber (1025..65535) MAX-ACCESS read-only STATUS current DESCRIPTION \" This object contains the MTA User Datagram Protocol (UDP) receive port that is being used for NCS call signaling. This object should only be changed by the configuration file.",
      "zh-CHS": "pktcSigDefNcsReceiveUdpPort对象类型语法InetPortNumber（1025..65535）MAX-ACCESS只读状态当前描述“此对象包含用于NCS呼叫信令的MTA用户数据报协议（UDP）接收端口。此对象只应由配置文件更改。"
    },
    {
      "indent": 4,
      "text": "      Unless changed via configuration, this MIB object MUST\n      reflect a value of '2427'.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\n::= { pktcSigDevObjects 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPowerRingFrequency    OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 f20Hz(1),\n                 f25Hz(2),\n                 f33Point33Hz(3),\n                 f50Hz(4),\n                 f15Hz(5),\n                 f16Hz(6),\n                 f22Hz(7),\n                 f23Hz(8),\n                 f45Hz(9)\n    }\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This object must only be provided via the configuration\n          file during the provisioning process.  The power ring",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "frequency is the frequency at which the sinusoidal voltage must travel down the twisted pair to make terminal equipment ring. Different countries define different electrical characteristics to make terminal equipment ring.",
      "zh-CHS": "频率是正弦电压必须沿双绞线向下移动以使终端设备振铃的频率。不同的国家定义了不同的电气特性，使终端设备成为环形。"
    },
    {
      "indent": 4,
      "text": "      The f20Hz setting corresponds to a power ring frequency\n      of 20 Hertz.  The f25Hz setting corresponds to a power ring\n      frequency of 25 Hertz.  The f33Point33Hz setting\n      corresponds to a power ring frequency of 33.33 Hertz.  The\n      f50Hz setting corresponds to a power ring frequency of 50\n      Hertz.  The f15Hz setting corresponds to a power ring\n      frequency of 15 Hertz.  The f16Hz setting corresponds to a\n      power ring frequency of 16 Hertz.  The f22Hz setting\n      corresponds to a power ring frequency of 22 Hertz.  The\n      f23Hz setting corresponds to a power ring frequency of 23\n      Hertz.  The f45Hz setting corresponds to a power ring\n      frequency of 45 Hertz.\"\nREFERENCE\n      \"ETSI-EN-300-001\"\n::= { pktcSigDevObjects 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalTable    OBJECT-TYPE\n    SYNTAX       SEQUENCE OF PktcSigPulseSignalEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \" The Pulse signal table defines the pulse signal operation.\n          There are nine types of international pulse signals,\n          with each signal having a set of provisionable parameters.\n          The values of the MIB objects in this table take effect\n          only if these parameters are not defined via signaling, in\n          which case, the latter determines the values of the\n          parameters.  The MIB objects in this table do not persist\n          across MTA reboots.\"\n    REFERENCE\n        \"ETSI-TS-101-909-4 Specification\"\n    ::= { pktcSigDevObjects 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalEntry OBJECT-TYPE SYNTAX PktcSigPulseSignalEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" This object defines the set of parameters associated with each particular value of pktcSigPulseSignalType. Each entry in the pktcSigPulseSignalTable is indexed by the pktcSigPulseSignalType object.",
      "zh-CHS": "pktcSigPulseSignalEntry对象类型语法pktcSigPulseSignalEntry MAX-ACCESS不可访问状态当前描述“此对象定义与pktcSigPulseSignalType的每个特定值关联的参数集。pktcSigPulseSignalType对象为pktcSigPulseSignalType表中的每个条目编制索引。"
    },
    {
      "indent": 4,
      "text": "      The conceptual rows MUST NOT persist across MTA reboots.\"\nINDEX { pktcSigPulseSignalType }\n::= { pktcSigPulseSignalTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcSigPulseSignalEntry ::= SEQUENCE {\n        pktcSigPulseSignalType              INTEGER,\n        pktcSigPulseSignalFrequency         INTEGER,\n        pktcSigPulseSignalDbLevel           TenthdBm,\n        pktcSigPulseSignalDuration          Unsigned32,\n        pktcSigPulseSignalPulseInterval     Unsigned32,\n        pktcSigPulseSignalRepeatCount       Unsigned32\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalType    OBJECT-TYPE\n    SYNTAX       INTEGER\n                 {\n                     initialRing(1),\n                     pulseLoopClose(2),\n                     pulseLoopOpen(3),\n                     enableMeterPulse(4),\n                     meterPulseBurst(5),\n                     pulseNoBattery(6),\n                     pulseNormalPolarity(7),\n                     pulseReducedBattery(8),\n                     pulseReversePolarity(9)\n                 }\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \"There are nine types of international pulse signals.  These\n         signals are defined as follows:\n         initial ring\n         pulse loop close\n         pulse loop open\n         enable meter pulse\n         meter pulse burst\n         pulse no battery\n         pulse normal polarity\n         pulse reduced battery\n         pulse reverse polarity\"\n    REFERENCE\n        \"ETSI-EN-300-324-1 Specification\"",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "::= { pktcSigPulseSignalEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalFrequency OBJECT-TYPE SYNTAX INTEGER { twentyfive(1),",
      "zh-CHS": "pktcSigPulseSignalFrequency对象类型语法整数{二十五（1），"
    },
    {
      "indent": 4,
      "text": " twelvethousand(2), sixteenthousand(3) } MAX-ACCESS read-write STATUS current DESCRIPTION \" This object is only applicable to the initialRing, enableMeterPulse, and meterPulseBurst signal types. This object identifies the frequency of the generated signal. The following table defines the default values for this object depending on signal type:",
      "zh-CHS": "十二（2）、十六（3）}MAX-ACCESS读写状态当前描述“此对象仅适用于初始化、启用MeterPulse和meterPulseBurst信号类型。此对象标识生成信号的频率。下表根据信号类型定义此对象的默认值："
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignalType Default initialRing 25 enableMeterPulse 16000 meterPulseBurst 16000",
      "zh-CHS": "pktcSigPulseSignalType默认初始化环25启用仪表脉冲16000仪表脉冲16000"
    },
    {
      "indent": 4,
      "text": "      The value of twentyfive MUST only be used for the\n      initialRing signal type.  The values of twelvethousand and\n      sixteenthousand MUST only be used for enableMeterPulse and\n      meterPulseBurst signal types.  An attempt to set this\n      object while the value of pktcSigPulseSignalType is not\n      initialRing, enableMeterPulse, or meterPulseBurst will\n      result in an 'inconsistentValue' error.\"\nREFERENCE\n    \"ETSI-EN-300-001 Specification\"\n     ::= { pktcSigPulseSignalEntry 2}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalDbLevel OBJECT-TYPE SYNTAX TenthdBm (-350..0) UNITS \"1/10 of a dBm\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object is only applicable to the enableMeterPulse and meterPulseBurst signal types. This is the decibel level for each frequency at which tones could be generated at the a and b terminals (TE connection point). An attempt to set this object while the value of pktcSigPulseSignalType is not enableMeterPulse or meterPulseBurst will result in an 'inconsistentValue' error.\" REFERENCE \"ETSI-EN-300-001 Specification\"",
      "zh-CHS": "pktcSigPulseSignalDbLevel对象类型语法TenthdBm（-350..0）单位“1/10 dBm”最大访问读写状态当前描述“此对象仅适用于enableMeterPulse和meterPulseBurst信号类型。这是a和b端子上可以生成音调的每个频率的分贝级别（TE连接点）。如果在pktcSigPulseSignalType的值未启用时尝试设置此对象，MeterPulse或meterPulseBurst将导致“值不一致”错误。“参考“ETSI-EN-300-001规范”"
    },
    {
      "indent": 4,
      "text": "DEFVAL { -135 }\n::={pktcSigPulseSignalEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalDuration OBJECT-TYPE",
      "zh-CHS": "pktcSigPulseSignalDuration对象类型"
    },
    {
      "indent": 4,
      "text": "SYNTAX Unsigned32 (0..5000) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the pulse duration for each signal type. In addition, the MTA must accept the values in the incremental steps specific for each signal type. The following table defines the default values and the incremental steps for this object depending on the signal type:",
      "zh-CHS": "语法无符号32（0..5000）单位“毫秒”最大访问读写状态当前说明“此对象指定每种信号类型的脉冲持续时间。此外，MTA必须接受特定于每种信号类型的增量步骤中的值。下表定义了此对象的默认值和增量步骤，具体取决于信号类型："
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignaltype Default (ms) Increment (ms) initialRing 200 50 pulseLoopClose 200 10 pulseLoopOpen 200 10 enableMeterPulse 150 10 meterPulseBurst 150 10 pulseNoBattery 200 10 pulseNormalPolarity 200 10 pulseReducedBattery 200 10 pulseReversePolarity 200 10",
      "zh-CHS": "pktcSigPulseSignaltype默认值（毫秒）增量（毫秒）初始化200 50脉冲回路闭合200 10脉冲回路打开200 10启用计脉冲150 10米脉冲突发150 10脉冲极性200 10脉冲正常极性200 10脉冲蓄电池200 10脉冲恒极性200 10"
    },
    {
      "indent": 4,
      "text": "      An attempt to set this object to a value that does not\n      fall on one of the increment boundaries, or on the wrong\n      increment boundary for the specific signal type, will\n      result in an 'inconsistentValue' error.\"\nREFERENCE\n    \"ETSI-EN-300-324-1 Specification\"\n     ::= {pktcSigPulseSignalEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalPulseInterval OBJECT-TYPE SYNTAX Unsigned32 (0..5000) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the repeat interval, or the period, for each signal type. In addition, the MTA must accept the values in the incremental steps specific for each signal type. The following table defines the default values and the incremental steps for this object, depending on the signal type:",
      "zh-CHS": "pktcSigPulseSignalPulseInterval对象类型语法无符号32（0..5000）单位“毫秒”最大访问读写状态当前说明“此对象指定每种信号类型的重复间隔或周期。此外，MTA必须接受特定于每种信号类型的增量步骤中的值。下表定义了此对象的默认值和增量步骤，具体取决于信号类型："
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignaltype Default (ms) Increment (ms) initialRing 200 50 pulseLoopClose 1000 10 pulseLoopOpen 1000 10",
      "zh-CHS": "pktcSigPulseSignaltype默认值（毫秒）增量（毫秒）初始化200 50脉冲回路关闭1000 10脉冲回路打开1000 10"
    },
    {
      "indent": 10,
      "text": "enableMeterPulse 1000 10 meterPulseBurst 1000 10 pulseNoBattery 1000 10 pulseNormalPolarity 1000 10 pulseReducedBattery 1000 10 pulseReversePolarity 1000 10",
      "zh-CHS": "启用仪表脉冲1000 10米脉冲爆炸1000 10脉冲电池1000 10脉冲正常极性1000 10脉冲蓄电池1000 10脉冲每极性1000 10"
    },
    {
      "indent": 4,
      "text": "      An attempt to set this object to a value that does not\n      fall on one of the increment boundaries, or on the wrong\n      increment boundary for the specific signal type, will\n      result in an 'inconsistentValue' error.\"\nREFERENCE\n    \"ETSI-EN-300-324-1 Specification\"\n     ::= { pktcSigPulseSignalEntry 5}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalRepeatCount OBJECT-TYPE SYNTAX Unsigned32 (1..50) MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies how many times to repeat a pulse. This object is not used by the enableMeterPulse signal type, and in that case, the value is irrelevant. The following table defines the default values and the valid ranges for this object, depending on the signal type:",
      "zh-CHS": "pktcSigPulseSignalRepeatCount对象类型语法Unsigned32（1..50）最大访问读写状态当前说明“此对象指定重复一个脉冲的次数。enableMeterPulse信号类型不使用此对象，在这种情况下，该值不相关。下表定义了此对象的默认值和有效范围，具体取决于信号类型："
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignaltype Default Range",
      "zh-CHS": "pktcSigPulseSignaltype默认范围"
    },
    {
      "indent": 10,
      "text": "initialRing 1 1-5 pulseLoopClose 1 1-50 pulseLoopOpen 1 1-50 enableMeterPulse (any value)(but not used) meterPulseBurst 1 1-50 pulseNoBattery 1 1-50 pulseNormalPolarity 1 1-50 pulseReducedBattery 1 1-50 pulseReversePolarity 1 1-50",
      "zh-CHS": "初始化1 1-5脉冲环路关闭1 1-50脉冲环路打开1 1-50启用仪表脉冲（任何值）（但未使用）仪表脉冲突发1 1-50脉冲电池1 1 1-50脉冲正常极性1 1-50脉冲减少电池1 1-50脉冲平均极性1 1 1-50"
    },
    {
      "indent": 4,
      "text": "      An attempt to set this object to a value that does not\n      fall within the range for the specific\n      signal type will result in an 'inconsistentValue' error.\"\n::={ pktcSigPulseSignalEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidMode OBJECT-TYPE SYNTAX INTEGER { duringRingingETS(1), dtAsETS(2), rpAsETS(3),",
      "zh-CHS": "pktcSigDevCidMode对象类型语法整数{duringRingingETS（1）、dtAsETS（2）、rpAsETS（3），"
    },
    {
      "indent": 4,
      "text": " lrAsETS(4), lrETS(5) } MAX-ACCESS read-write STATUS current DESCRIPTION \" For on-hook caller id, pktcSigDevCidMode selects the method for representing and signaling caller identification. For the duringRingingETS method, the Frequency Shift Keying (FSK) or the Dual-Tone Multi-Frequency (DTMF) containing the caller identification information is sent between the first and second ring pattern.",
      "zh-CHS": "lrAsETS（4），lrETS（5）}MAX-ACCESS读写状态当前描述“对于挂机呼叫者id，pktcSigDevCidMode选择表示呼叫者标识并发送信号的方法。对于DuringingETS方法，频移键控（FSK）或双音多频（DTMF）在第一和第二环形图案之间发送包含呼叫者标识信息的信息。"
    },
    {
      "indent": 10,
      "text": "For the dtAsETS,rpAsETS, lrAsETS and lrETS methods, the FSK or DTMF containing the caller id information is sent before the first ring pattern.",
      "zh-CHS": "对于dtAsETS、rpAsETS、lrAsETS和lrETS方法，包含呼叫者id信息的FSK或DTMF在第一个响铃模式之前发送。"
    },
    {
      "indent": 10,
      "text": "For the dtAsETS method, the FSK or DTMF is sent after the Dual Tone Alert Signal. For the rpAsETS method, the FSK or DTMF is sent after a Ring Pulse.",
      "zh-CHS": "对于dtAsETS方法，FSK或DTMF在双音警报信号之后发送。对于rpAsETS方法，FSK或DTMF在环形脉冲后发送。"
    },
    {
      "indent": 10,
      "text": "For the lrAsETS method, the Line Reversal occurs first, then the Dual Tone Alert Signal, and, finally, the FSK or DTMF is sent.",
      "zh-CHS": "对于lrAsETS方法，首先发生线路反转，然后发送双音警报信号，最后发送FSK或DTMF。"
    },
    {
      "indent": 10,
      "text": "For the lrETS method, the Line Reversal occurs first, then the FSK or DTMF is sent.",
      "zh-CHS": "对于lrETS方法，首先发生线路反转，然后发送FSK或DTMF。"
    },
    {
      "indent": 10,
      "text": "The value of this MIB object MUST NOT persist across MTA reboots.\"",
      "zh-CHS": "此MIB对象的值不能在MTA重新启动期间持续存在。”"
    },
    {
      "indent": 4,
      "text": "DEFVAL { rpAsETS}\n::= {pktcSigDevObjects 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidAfterRing OBJECT-TYPE SYNTAX Unsigned32 (0|50..2000) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of first ringing pattern and the start of the transmission of the FSK or DTMF containing the caller id information. It is only used when pktcSigDevCidMode is set to a value of 'duringRingingETS'.",
      "zh-CHS": "pktcSigDevCidAfterRing对象类型语法Unsigned32（0 | 50..2000）单位“毫秒”最大访问读写状态当前说明“此对象指定从第一次振铃模式结束到包含呼叫者id信息的FSK或DTMF开始传输之间的延迟。仅当pktcSigDevCidMode设置为“duringets”值时使用。"
    },
    {
      "indent": 10,
      "text": "The following table defines the default values for this MIB object, depending on the signal type",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型"
    },
    {
      "indent": 9,
      "text": "(pktcSigDevCidMode), and MUST be followed:",
      "zh-CHS": "（pktcSigDevCidMode），并且必须遵循："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "zh-CHS": "pktcSigDevCidMode默认值的值"
    },
    {
      "indent": 10,
      "text": "duringringingETS 550 ms dtAsETS any value (not used) rpAsETS any value (not used) lrAsETS any value (not used) lrETS any value (not used)",
      "zh-CHS": "在RingingETS 550 ms数据集期间，设置任意值（未使用）rpAsETS任意值（未使用）lrAsETS任意值（未使用）lrETS任意值（未使用）"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not duringringingETS will result in an 'inconsistentValue' error.",
      "zh-CHS": "当pktcSigDevCidMode的值在RingingGets期间不存在时，尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 550 }\n::= {pktcSigDevObjects 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidAfterDTAS OBJECT-TYPE SYNTAX Unsigned32 (0|45..500) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Dual Tone Alert Signal (DT-AS) and the start of the transmission of the FSK or DTMF containing the caller id information. This object is only used when pktcSigDevCidMode is set to a value of 'dtAsETS' or 'lrAsETS'.",
      "zh-CHS": "pktcSigDevCidAfterDTAS对象类型语法Unsigned32（0 | 45..500）单位“毫秒”最大访问读写状态当前描述“此对象指定双音警报信号（DT-AS）结束之间的延迟以及包含呼叫者id信息的FSK或DTMF传输的开始。此对象仅在pktcSigDevCidMode设置为“dtAsETS”或“lrAsETS”值时使用。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevCidMode），必须遵循下表："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "zh-CHS": "pktcSigDevCidMode默认值的值"
    },
    {
      "indent": 10,
      "text": "duringringingETS any value (not used) dtAsETS 50 ms rpAsETS any value (not used) lrAsETS 50 ms lrETS any value (not used)",
      "zh-CHS": "在使用过程中设置任意值（未使用）数据设置50毫秒rpAsETS任意值（未使用）lrAsETS 50毫秒lrETS任意值（未使用）"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of",
      "zh-CHS": "试图设置此对象，而"
    },
    {
      "indent": 10,
      "text": "pktcSigDevCidMode is not 'dtAsETS' or 'lrAsETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "pktcSigDevCidMode不是“dtAsETS”或“lrAsETS”将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 50 }\n::= {pktcSigDevObjects 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidAfterRPAS OBJECT-TYPE SYNTAX Unsigned32 (0|500..800) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Ring Pulse Alert Signal (RP-AS) and the start of the transmission of the FSK or DTMF containing the caller id information. This MIB object is only used when pktcSigDevCidMode is set to a value of 'rpAsETS'. The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "zh-CHS": "PKTCSIGDEVCIDAFTERPAS对象类型语法Unsigned32（0 | 500..800）单位“毫秒”最大访问读写状态当前描述“此对象指定环形脉冲警报信号（RP-AS）结束之间的延迟以及包含呼叫者id信息的FSK或DTMF传输的开始。此MIB对象仅在pktcSigDevCidMode设置为“rpAsETS”值时使用。下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevCidMode），并且必须遵循："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "zh-CHS": "pktcSigDevCidMode默认值的值"
    },
    {
      "indent": 10,
      "text": "duringringingETS any value (not used) dtAsETS any value (not used) rpAsETS 650 ms lrAsETS any value (not used) lrETS any value (not used)",
      "zh-CHS": "使用期间设置任意值（未使用）数据设置任意值（未使用）rpAsETS 650 ms lrAsETS任意值（未使用）lrETS任意值（未使用）"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not 'rpAsETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "在pktcSigDevCidMode的值不是“rpAsETS”时尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 650 }\n::= {pktcSigDevObjects 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingAfterCID OBJECT-TYPE SYNTAX Unsigned32 (0|50..500) UNITS \"Milliseconds\" MAX-ACCESS read-write",
      "zh-CHS": "pktcSigDevRingAfterCID对象类型语法无符号32（0 | 50..500）单位“毫秒”最大访问读写"
    },
    {
      "indent": 4,
      "text": "STATUS current DESCRIPTION \" This object specifies the delay between the end of the complete transmission of the FSK or DTMF containing the caller id information and the start of the first ring pattern. It is only used when pktcSigDevCidMode is set to a value of 'dtAsETS', 'rpAsETS', 'lrAsETS' or 'lrETS'.",
      "zh-CHS": "STATUS current DESCRIPTION“此对象指定包含呼叫者id信息的FSK或DTMF的完整传输结束与第一个响铃模式开始之间的延迟。仅当pktcSigDevCidMode设置为'dtAsETS'、'rpAsETS'、'lrAsETS'或'lrETS'值时，才使用此对象。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevCidMode），必须遵循下表："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "zh-CHS": "pktcSigDevCidMode默认值的值"
    },
    {
      "indent": 10,
      "text": "duringringingETS any value (not used) dtAsETS 250 ms rpAsETS 250 ms lrAsETS 250 ms lrETS 250 ms",
      "zh-CHS": "在RingingETS期间任何值（未使用）数据集250毫秒rpAsETS 250毫秒lrAsETS 250毫秒lrETS 250毫秒"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not 'dtAsETS', 'rpAsETS', 'lrAsETS', or 'lrETS' will result in an 'inconsistent value' error.",
      "zh-CHS": "当pktcSigDevCidMode的值不是“dtAsETS”、“rpAsETS”、“lrAsETS”或“lrETS”时，尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 250 }\n::= {pktcSigDevObjects 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidDTASAfterLR OBJECT-TYPE SYNTAX Unsigned32 (50..655) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Line Reversal and the start of the Dual Tone Alert Signal (DT-AS). This object is only used when pktcSigDevCidMode is set to a value of 'lrAsETS'.",
      "zh-CHS": "PKTCSIGDEVCIDDTASAAFTERLR对象类型语法Unsigned32（50..655）单位“毫秒”最大访问读写状态当前描述“此对象指定线路反转结束与双音警报信号（DT-AS）开始之间的延迟。此对象仅在PKTCSIGDEVCIDDMODE设置为“lrAsETS”值时使用。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevCidMode），必须遵循下表："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "zh-CHS": "pktcSigDevCidMode默认值的值"
    },
    {
      "indent": 10,
      "text": "duringringingETS any value (not used) dtAsETS any value (not used) rpAsETS any value (not used) lrAsETS 250 ms lrETS any value (not used)",
      "zh-CHS": "使用期间设置任意值（未使用）数据设置任意值（未使用）rpAsETS任意值（未使用）lrAsETS 250 ms lrETS任意值（未使用）"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not lrAsETS will result in an 'inconsistentValue' error.",
      "zh-CHS": "在pktcSigDevCidMode的值不是lrAsETS时尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": " The value of this MIB object MUST NOT persist across MTA reboots.\" REFERENCE \"ETSI-EN-300-659-1 Specification\" DEFVAL { 250 }",
      "zh-CHS": "此MIB对象的值不能在MTA重新启动期间保持不变。“参考”ETSI-EN-300-659-1规范“DEFVAL{250}"
    },
    {
      "indent": 4,
      "text": "::= {pktcSigDevObjects 26 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiMode    OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 dtAsETS(1),\n                 rpAsETS(2),\n                 lrAsETS(3),\n                 osi(4),\n                 lrETS(5)\n                 }\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \" For visual message waiting indicator (VMWI),\n          pktcSigDevVmwiMode selects the alerting signal method.  For\n          the dtAsETS, rpAsETS, lrAsETS, osi, and lrETS methods,\n          the FSK containing the VMWI information is sent after an\n          alerting signal.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 10,
      "text": "For the dtAsETS method, the FSK, or DTMF is sent after the Dual Tone Alert Signal. For the rpAsETS method, the FSK or DTMF is sent after a Ring Pulse.",
      "zh-CHS": "对于dtAsETS方法，FSK或DTMF在双音警报信号之后发送。对于rpAsETS方法，FSK或DTMF在环形脉冲后发送。"
    },
    {
      "indent": 10,
      "text": "For the lrAsETS method, the Line Reversal occurs first, then the Dual Tone Alert Signal, and, finally, the FSK or DTMF is sent.",
      "zh-CHS": "对于lrAsETS方法，首先发生线路反转，然后发送双音警报信号，最后发送FSK或DTMF。"
    },
    {
      "indent": 10,
      "text": "For the OSI method, the FSK or DTMF is sent after the Open Switching Interval.",
      "zh-CHS": "对于OSI方法，FSK或DTMF在开放切换间隔后发送。"
    },
    {
      "indent": 10,
      "text": "For the lrETS method, the Line Reversal occurs first, then the FSK or DTMF is sent.",
      "zh-CHS": "对于lrETS方法，首先发生线路反转，然后发送FSK或DTMF。"
    },
    {
      "indent": 10,
      "text": "The value of this MIB object MUST NOT persist across MTA reboots.\"",
      "zh-CHS": "此MIB对象的值不能在MTA重新启动期间持续存在。”"
    },
    {
      "indent": 4,
      "text": "DEFVAL { rpAsETS }\n::= {pktcSigDevObjects 27 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiAfterDTAS OBJECT-TYPE SYNTAX Unsigned32 (0|45..500) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Dual Tone Alert Signal (DT-AS) and the start of the transmission of the FSK or DTMF containing the VMWI information.",
      "zh-CHS": "pktcSigDevVmwiAfterDTAS对象类型语法Unsigned32（0 | 45..500）单位“毫秒”最大访问读写状态当前描述“此对象指定双音警报信号（DT-AS）结束与包含VMWI信息的FSK或DTMF开始传输之间的延迟。"
    },
    {
      "indent": 10,
      "text": "This object is only used when pktcSigDevVmwiMode is set to a value of 'dtAsETS' or 'lrAsETS'.",
      "zh-CHS": "此对象仅在pktcSigDevVmwiMode设置为“dtAsETS”或“lrAsETS”值时使用。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevVmwiMode），必须遵循下表："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "zh-CHS": "pktcSigDevVmwiMode默认值的值"
    },
    {
      "indent": 10,
      "text": "dtAsETS 50 ms rpAsETS any value (not used) lrAsETS 50 ms lrETS any value (not used)",
      "zh-CHS": "数据集50毫秒rpAsETS任意值（未使用）lrAsETS 50毫秒lrETS任意值（未使用）"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'dtAsETS' or 'lrAsETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "在pktcSigDevVmwiMode的值不是“dtAsETS”或“lrAsETS”时尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 50 }\n::= {pktcSigDevObjects 28 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiAfterRPAS OBJECT-TYPE SYNTAX Unsigned32 (0|500..800)",
      "zh-CHS": "pktcsigdevvmwiafterpas对象类型语法Unsigned32（0 | 500..800）"
    },
    {
      "indent": 4,
      "text": "UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Ring Pulse Alert Signal (RP-AS) and the start of the transmission of the FSK or DTMF containing the VMWI information.",
      "zh-CHS": "单位“毫秒”MAX-ACCESS read-write STATUS current DESCRIPTION“此对象指定环形脉冲警报信号（RP-AS）结束与包含VMWI信息的FSK或DTMF开始传输之间的延迟。"
    },
    {
      "indent": 10,
      "text": "This object is only used when pktcSigDevVmwiMode is set to a value of 'rpAsETS'.",
      "zh-CHS": "仅当pktcSigDevVmwiMode设置为“rpAsETS”值时，才使用此对象。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevVmwiMode），必须遵循下表："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "zh-CHS": "pktcSigDevVmwiMode默认值的值"
    },
    {
      "indent": 10,
      "text": "dtAsETS any value (not used) rpAsETS 650 ms lrAsETS any value (not used) lrETS any value (not used)",
      "zh-CHS": "数据集任意值（未使用）rpAsETS 650毫秒lrAsETS任意值（未使用）lrETS任意值（未使用）"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'rpAsETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "在pktcSigDevVmwiMode的值不是“rpAsETS”时尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 650 }\n::= {pktcSigDevObjects 29 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiDTASAfterLR OBJECT-TYPE SYNTAX Unsigned32 (0|50..655) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Line Reversal and the start of the Dual Tone Alert Signal (DT-AS) for VMWI information. This object is only used when pktcSigDevVmwiMode is set to a value of 'lrAsETS'.",
      "zh-CHS": "pktcSigDevVmwiDTASAfterLR对象类型语法Unsigned32（0 | 50..655）单位“毫秒”最大访问读写状态当前描述“此对象指定线路反转结束与双音警报信号（DT-AS）开始之间的延迟用于VMWI信息。此对象仅在pktcSigDevVmwiMode设置为“lrAsETS”值时使用。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevVmwiMode），必须遵循下表："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "zh-CHS": "pktcSigDevVmwiMode默认值的值"
    },
    {
      "indent": 10,
      "text": "dtAsETS any value (not used) rpAsETS any value (not used) lrAsETS 250 ms lrETS any value (not used)",
      "zh-CHS": "数据集任意值（未使用）rpAsETS任意值（未使用）lrAsETS 250 ms lrETS任意值（未使用）"
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'lrAsETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "在pktcSigDevVmwiMode的值不是“lrAsETS”时尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 250 }\n::= {pktcSigDevObjects 30 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadenceTable    OBJECT-TYPE\n    SYNTAX       SEQUENCE OF PktcSigDevRingCadenceEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \"Cadence rings are defined by the telco governing\n         body for each country.  The MTA must be able to support\n         various ranges of cadence patterns and cadence periods.\n         The MTA will be able to support country-specific\n         provisioning of the cadence and idle period.  Each\n         cadence pattern will be assigned a unique value ranging\n         from 0-127 (inclusive) corresponding to the value of x,\n         where x is the value sent in the cadence ringing (cr)\n         signal cr(x), requested per the appropriate NCS\n         message, and defined in the E package.  The MTA will derive\n         the cadence periods from the ring cadence table entry, as\n         provisioned by the customer.  The MTA is allowed to provide\n         appropriate default values for each of the ring cadences.\n         This table only needs to be supported when the MTA\n         implements the E package.\"\n    REFERENCE\n        \"ETSI-TS-101-909-4 Specification\"\n    ::= { pktcSigDevObjects 31 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadenceEntry OBJECT-TYPE SYNTAX PktcSigDevRingCadenceEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "zh-CHS": "pktcSigDevRingCadenceEntry对象类型语法pktcSigDevRingCadenceEntry MAX-ACCESS不可访问状态当前描述"
    },
    {
      "indent": 4,
      "text": "    \" Each entry in this row corresponds to a ring cadence\n      that is being supported by the device.  The conceptual\n      rows MUST NOT persist across MTA reboots.\"\nINDEX { pktcSigDevRingCadenceIndex }\n::= { pktcSigDevRingCadenceTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcSigDevRingCadenceEntry ::= SEQUENCE {\n        pktcSigDevRingCadenceIndex       Unsigned32,\n        pktcSigDevRingCadence            PktcRingCadence\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadenceIndex    OBJECT-TYPE\n    SYNTAX       Unsigned32 (0..127)\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \" A unique value ranging from 0 to 127 that corresponds to the\n          value sent by the LE based on country-specific cadences,\n          one row per cadence cycle.  In any given system\n          implementation for a particular country, it is anticipated\n          that a small number of ring cadences will be in use.  Thus,\n          this table most likely will not be populated to its full\n          size.\"\n    ::= { pktcSigDevRingCadenceEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadence    OBJECT-TYPE\n    SYNTAX       PktcRingCadence\n    MAX-ACCESS   read-write\n    STATUS       current\n    DESCRIPTION\n        \"This is the Ring Cadence.\"\n    ::= { pktcSigDevRingCadenceEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneTable OBJECT-TYPE SYNTAX SEQUENCE OF PktcSigDevToneEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" The Tone Table defines the composition of tones and various tone operations.",
      "zh-CHS": "pktcSigDevToneTable对象类型语法PktcSigDevToneEntry MAX-ACCESS不可访问状态当前描述“音调表定义音调的组成和各种音调操作。"
    },
    {
      "indent": 10,
      "text": "The definition of the tones callWaiting1 through callWaiting4 in this table MUST only contain the audible tone itself; the delay between tones or the value of the tone repeat count are not applicable for the call waiting tones.",
      "zh-CHS": "本表中callWaiting1至callWaiting4音调的定义必须仅包含可听音调本身；音调之间的延迟或音调重复计数的值不适用于呼叫等待音调。"
    },
    {
      "indent": 10,
      "text": "The delay between tones or the repeat count is controlled by the objects pktcSigEndPntConfigCallWaitingDelay and pktcSigEndPntConfigCallWaitingMaxRep. If the pktcSigDevToneType is set to either of the values callWaiting1, callWaiting2, callWaiting3, or callWaiting4, then the value of the pktcSigDevToneWholeToneRepeatCount object indicates that the particular frequency group is applicable, as a repeatable part of the tone, based on the value of the MIB object pktcSigDevToneWholeToneRepeatCount.",
      "zh-CHS": "音调之间的延迟或重复计数由对象pktcSigEndPntConfigCallWaitingDelay和pktcSigEndPntConfigCallWaitingMaxRep控制。如果将pktcSigDevToneType设置为callWaiting1、callWaiting2、callWaiting3或callWaiting4，则PKTCSIGDEVTONEWHOLETONEEPEATCOUNT对象的值表示特定频率组作为音调的可重复部分，基于MIB对象PKTCSIGDEVTONEWHOLETOEATCOUNT的值适用。"
    },
    {
      "indent": 10,
      "text": "The MTA MUST make sure that, after the provisioning cycle, the table is fully populated (i.e., for each possible index, an entry MUST be defined) using reasonable defaults for each row that was not defined by the provisioning information delivered via MTA Configuration.",
      "zh-CHS": "MTA必须确保在资源调配周期结束后，使用合理的默认值为通过MTA配置提供的资源调配信息未定义的每一行完全填充表（即，对于每个可能的索引，必须定义一个条目）。"
    },
    {
      "indent": 10,
      "text": "The frequency composition of each tone is defined by the pktcSigDevMultiFreqToneTable. For each tone type defined in pktcSigDevToneTable, the MTA MUST populate at least one entry in the pktcSigDevMultiFreqToneTable.",
      "zh-CHS": "每个音调的频率组成由PKTCSIGDEVMULTIFREKTONETABLE定义。对于pktcSigDevToneTable中定义的每个音调类型，MTA必须在PKTCSIGDEVMULTIFREKTONETABLE中至少填充一个条目。"
    },
    {
      "indent": 10,
      "text": "For each particular value of pktcSigDevToneType, the pktcSigDevToneTable table can define non-repeating and repeating groups of the frequencies defined by the pktcSigDevMultiFreqToneTable, such that each group is represented by the set of the consecutive rows (frequency group) in the pktcSigDevMultiFreqToneTable.",
      "zh-CHS": "对于pktcSigDevToneType的每个特定值，pktcSigDevToneTable表可以定义由PKTCSIGDEVMULTIFREKTONETABLE定义的频率的非重复组和重复组，以便每个组由PKTCSIGDEVMULTIFREKTONETABLE中的一组连续行（频率组）表示。"
    },
    {
      "indent": 4,
      "text": "      Objects in this table do not persist across MTA reboots.\n      For tones with multiple frequencies refer to the MIB table\n      pktcSigDevMultiFreqToneTable.\"\nREFERENCE\n    \"PacketCable NCS Specification, ETSI-TS-101-909-4\n     Specification.\"\n::= { pktcSigDevObjects 32 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneEntry OBJECT-TYPE SYNTAX PktcSigDevToneEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" The different tone types that can be provisioned based on country-specific needs.",
      "zh-CHS": "pktcSigDevToneEntry对象类型语法pktcSigDevToneEntry MAX-ACCESS不可访问状态当前描述“可根据特定国家/地区的需要设置的不同音调类型。"
    },
    {
      "indent": 10,
      "text": "Each entry contains the tone generation parameters for a specific frequency group of the specific Tone Type.",
      "zh-CHS": "每个条目都包含特定音调类型的特定频率组的音调生成参数。"
    },
    {
      "indent": 4,
      "text": "      The different parameters can be provisioned via MTA\n      configuration based on country specific needs.\n      An MTA MUST populate all entries of this table for each\n      tone type.\"\nINDEX { pktcSigDevToneType, pktcSigDevToneFreqGroup }\n::= { pktcSigDevToneTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcSigDevToneEntry ::= SEQUENCE {\n    pktcSigDevToneType                      INTEGER,\n    pktcSigDevToneFreqGroup                 Unsigned32,\n    pktcSigDevToneFreqCounter               Unsigned32,\n    pktcSigDevToneWholeToneRepeatCount      Unsigned32,\n    pktcSigDevToneSteady                    TruthValue\n    }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneType        OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 busy(1),\n                 confirmation(2),\n                 dial(3),\n                 messageWaiting(4),\n                 offHookWarning(5),\n                 ringBack(6),\n                 reOrder(7),\n                 stutterdial(8),\n                 callWaiting1(9),\n                 callWaiting2(10),\n                 callWaiting3(11),\n                 callWaiting4(12),\n                 alertingSignal(13),\n                 specialDial(14),\n                 specialInfo(15),\n                 release(16),\n                 congestion(17),\n                 userDefined1(18),\n                 userDefined2(19),\n                 userDefined3(20),\n                 userDefined4(21)\n                 }\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \"A unique value that will correspond to the different\n         tone types.  These tones can be provisioned based on\n         country-specific needs.  This object defines the type\n         of tone being accessed.",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 9,
      "text": "The alertingSignal, specialDial, specialInfo, release,",
      "zh-CHS": "警报信号，特殊信号，特殊信息，发布，"
    },
    {
      "indent": 4,
      "text": "     congestion, userDefined1, userDefined2, userDefined3,\n     and userDefined4 tone types are used in\n     the E line package.\"\n::= { pktcSigDevToneEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneFreqGroup  OBJECT-TYPE\n       SYNTAX       Unsigned32(1..4)\n       MAX-ACCESS   not-accessible\n       STATUS       current\n       DESCRIPTION\n           \"This MIB object represents the Tone Sequence reference\n           of a multi-sequence tone.\"\n       ::={ pktcSigDevToneEntry 2}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneFreqCounter OBJECT-TYPE SYNTAX Unsigned32(1..8) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the number of consecutive multi-frequency tones for the particular tone type in the multi-frequency table (pktcSigDevMultiFreqToneTable).",
      "zh-CHS": "PKTCSIGDEVTONEFREQUOTER对象类型语法Unsigned32（1..8）MAX-ACCESS只读状态当前说明“此MIB对象表示多频率表（PKTCSIGDEVMULTIFREKTONETABLE）中特定音调类型的连续多频率音调数。"
    },
    {
      "indent": 7,
      "text": "    Such a sequence of the consecutive multi-frequency tones\n    forms the tone group for the particular tone type in the\n    pktcSigDevToneTable.\"\n::={ pktcSigDevToneEntry 3}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneWholeToneRepeatCount OBJECT-TYPE SYNTAX Unsigned32 (0..5000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This is the repeat count, which signifies how many times to repeat the entire on-off cadence sequence. Setting this object may result in a cadence duration longer or shorter than the overall signal duration specified by the time out (TO) object for a particular signal. If the repeat count results in a longer tone duration than the signal duration specified by the TO, the tone duration defined by the TO object for a particular signal always represents the overall signal duration for a tone. In this case, the tone duration repeat count will not be fully exercised, and the desired tone duration will be truncated per the TO setting. If the repeat count results in a shorter tone duration than the signal duration specified by the TO, the tone duration defined by the repeat count takes precedence over the TO and will end the signal event. In this case,",
      "zh-CHS": "PKTCSIGDEVTONEWHOLETONERPEATCOUNT对象类型语法Unsigned32（0..5000）MAX-ACCESS只读状态当前说明“这是重复计数，表示重复整个开-关节奏序列的次数。设置此对象可能导致步频持续时间长于或短于特定信号的超时（TO）对象指定的总信号持续时间。如果重复计数导致音调持续时间长于TO指定的信号持续时间，则TO对象为特定信号定义的音调持续时间始终表示音调的总信号持续时间。在这种情况下，音调持续时间重复计数将不会完全执行，并且所需的音调持续时间将根据TO设置被截断。如果重复计数导致音调持续时间短于TO指定的信号持续时间，则重复计数定义的音调持续时间优先于TO，并将结束信号事件。在这种情况下,，"
    },
    {
      "indent": 4,
      "text": "     the TO represents a time not to be exceeded for the signal.\n     It is recommended to ensure proper telephony signaling so that\n     the TO duration setting should always be longer than the\n     desired repeat count-time duration.\"\n::={ pktcSigDevToneEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneSteady OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the steady tone status. A value of 'true(1)' indicates that the steady tone is applied, and a value of 'false(2)' indicates otherwise. Devices must play out the on-off cadence sequence for the number of times indicated by the MIB object 'pktcSigDevToneWholeToneRepeatCount' prior to applying the last tone steadily, indefinitely. If the MIB table 'pktcSigDevToneTable' contains multiple rows with this Object set to a value of 'true(1)', the steady tone is applied to the last repeating frequency group of the tone.",
      "zh-CHS": "PKTCSIGDEVTONE稳定对象类型语法TruthValue MAX-ACCESS只读状态当前描述“此MIB对象表示稳定音调状态。值'true（1）'表示应用了稳定音调，值'false（2）''表示不是。在稳定、无限期地应用最后一个音调之前，设备必须播放MIB对象'PKTCSIGDEVTONEWHOLETONEEPEATCOUNT'所指示次数的开-关节奏序列。如果MIB表'pktcSigDevToneTable'包含多行且此对象的值设置为'true（1）''时，稳定音调应用于音调的最后一个重复频率组。"
    },
    {
      "indent": 9,
      "text": "Setting this MIB object may result in a tone duration that is longer or shorter than the overall signal duration specified by the time out (TO) MIB object for a particular signal. If the repeat count results in a longer tone duration than the signal duration specified by the TO, the tone duration defined by the TO object for a particular signal always represents the overall signal duration for a tone. In this case, the tone duration repeat count will not be fully exercised, and the desired tone duration will be truncated per the TO setting. If the repeat count results in a shorter tone duration than the signal duration specified by the TO, the tone duration defined by the repeat count takes precedence over the TO and will end the signal event. In this case, the TO represents a time not to be exceeded for the signal.",
      "zh-CHS": "设置此MIB对象可能导致音调持续时间长于或短于特定信号的超时（TO）MIB对象指定的总信号持续时间。如果重复计数导致音调持续时间长于TO指定的信号持续时间，则TO对象为特定信号定义的音调持续时间始终表示音调的总信号持续时间。在这种情况下，音调持续时间重复计数将不会完全执行，并且所需的音调持续时间将根据TO设置被截断。如果重复计数导致音调持续时间短于TO指定的信号持续时间，则重复计数定义的音调持续时间优先于TO，并将结束信号事件。在这种情况下，TO表示不超过信号的时间。"
    },
    {
      "indent": 4,
      "text": "     It is recommended to ensure proper telephony signaling that\n     The TO duration setting should always be longer than the\n     desired repeat count-time duration, plus the desired maximum\n     steady tone period.\"\n::={ pktcSigDevToneEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable OBJECT-TYPE SYNTAX SEQUENCE OF PktcSigDevMultiFreqToneEntry MAX-ACCESS not-accessible STATUS current",
      "zh-CHS": "PKTCSIGDEVMULTIFREKTONETABLE PKTCSIGDEVMULTIFREKTONETRENTRY MAX-ACCESS的对象类型语法序列不可访问状态当前"
    },
    {
      "indent": 7,
      "text": "DESCRIPTION \" This MIB table defines the characteristics of tones with multiple frequencies. The constraints imposed on the tones by the MIB table pktcSigDevToneTable need to be considered for MIB objects in this table as well.",
      "zh-CHS": "DESCRIPTION“此MIB表定义了具有多个频率的音调的特征。对于此表中的MIB对象，还需要考虑MIB表pktcSigDevToneTable对音调施加的约束。"
    },
    {
      "indent": 13,
      "text": "The MTA MUST populate the corresponding row(s) of the pktcSigDevMultiFreqToneTable for each tone defined in the pktcSigDevToneTable.",
      "zh-CHS": "MTA必须为pktcSigDevToneTable中定义的每个音调填充pktcSigDevToneTable的相应行。"
    },
    {
      "indent": 7,
      "text": "      The contents of the table may be provisioned via\n      MTA configuration.\"\nREFERENCE\n    \"PacketCable NCS Specification, ETSI-TS-101-909-4\n     Specification.\"\n::= { pktcSigDevObjects 33 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneEntry    OBJECT-TYPE\n    SYNTAX       PktcSigDevMultiFreqToneEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \" The different tone types with multiple frequencies\n          that can be provisioned based on country-specific\n          needs.\"\n    INDEX {pktcSigDevToneType, pktcSigDevToneNumber}\n    ::= { pktcSigDevMultiFreqToneTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "PktcSigDevMultiFreqToneEntry ::= SEQUENCE {\n      pktcSigDevToneNumber                    Unsigned32,\n      pktcSigDevToneFirstFreqValue            Unsigned32,\n      pktcSigDevToneSecondFreqValue           Unsigned32,\n      pktcSigDevToneThirdFreqValue            Unsigned32,\n      pktcSigDevToneFourthFreqValue           Unsigned32,\n      pktcSigDevToneFreqMode                  INTEGER,\n      pktcSigDevToneFreqAmpModePrtg           Unsigned32,\n      pktcSigDevToneDbLevel                   TenthdBm,\n      pktcSigDevToneFreqOnDuration            Unsigned32,\n      pktcSigDevToneFreqOffDuration           Unsigned32,\n      pktcSigDevToneFreqRepeatCount           Unsigned32\n}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneNumber OBJECT-TYPE SYNTAX Unsigned32(1..8) MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "zh-CHS": "pktcSigDevToneNumber对象类型语法Unsigned32（1..8）MAX-ACCESS不可访问状态当前说明"
    },
    {
      "indent": 7,
      "text": "   \"This MIB object represents the frequency reference\n    of a multi-frequency tone.\"\n::={ pktcSigDevMultiFreqToneEntry 1}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFirstFreqValue    OBJECT-TYPE\n    SYNTAX       Unsigned32(0..4000)\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n      \"This MIB object represents the value of the first\n       frequency of a tone type.  A value of zero implies\n       absence of the referenced frequency.\"\n    ::={ pktcSigDevMultiFreqToneEntry 2}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneSecondFreqValue    OBJECT-TYPE\n    SYNTAX       Unsigned32(0..4000)\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n      \"This MIB object represents the value of the second\n       frequency of a tone type.  A value of zero implies\n       absence of the referenced frequency.\"\n    ::={ pktcSigDevMultiFreqToneEntry 3}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneThirdFreqValue    OBJECT-TYPE\n    SYNTAX       Unsigned32(0..4000)\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n      \"This MIB object represents the value of the third\n       frequency of a tone type.  A value of zero implies\n       absence of the referenced frequency.\"\n    ::={ pktcSigDevMultiFreqToneEntry 4}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFourthFreqValue    OBJECT-TYPE\n    SYNTAX       Unsigned32(0..4000)\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n      \"This MIB object represents the value of the fourth\n       frequency of a tone type.  A value of zero implies\n       absence of the referenced frequency.\"\n    ::={ pktcSigDevMultiFreqToneEntry 5}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqMode OBJECT-TYPE SYNTAX INTEGER { firstModulatedBySecond(1), summation(2)",
      "zh-CHS": "pktcSigDevToneFreqMode对象类型语法整数{firstModulatedBySecond（1），求和（2）"
    },
    {
      "indent": 7,
      "text": " } MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object provides directive on the modulation or summation of the frequencies involved in the tone.",
      "zh-CHS": "}MAX-ACCESS只读状态当前描述“此MIB对象提供有关音调中涉及的频率调制或总和的指令。"
    },
    {
      "indent": 8,
      "text": "It is to be noted that while summation can be done without any constraint on the number of frequencies, the modulation (amplitude) holds good only when there are two frequencies (first and second).",
      "zh-CHS": "需要注意的是，虽然可以在不限制频率数量的情况下进行求和，但调制（振幅）仅在存在两个频率（第一和第二）时保持良好。"
    },
    {
      "indent": 8,
      "text": "Thus: - If the mode is set to a value of 'firstModulatedBySecond(1)', the first frequency MUST be modulated by the second, and the remaining frequencies (third and fourth) ignored. The percentage of amplitude modulation to be applied is defined by the MIB object pktcSigDevToneFreqAmpModePrtg.",
      "zh-CHS": "因此：-如果模式设置为“firstModulatedBySecond（1）”值，则第一个频率必须由第二个频率调制，其余频率（第三个和第四个）忽略。要应用的振幅调制百分比由MIB对象PKTCSIGDEVTONEFREQUAMPMODEPRTG定义。"
    },
    {
      "indent": 7,
      "text": "   - If the mode is set to a value of\n     'summation(2)', all the frequencies MUST be\n     summed without any modulation.\n\"\n::={ pktcSigDevMultiFreqToneEntry 6}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "pktcSigDevToneFreqAmpModePrtg OBJECT-TYPE SYNTAX Unsigned32(0..100) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the percentage of amplitude modulation applied to the second frequency when the MIB object pktcSigDevToneFreqMode is set to a value of 'firstModulatedBySecond (1)'.",
      "zh-CHS": "pktcSigDevToneFreqAmpModePrtg对象类型语法Unsigned32（0..100）最大访问只读状态当前描述“此MIB对象表示当MIB对象pktcSigDevToneFreqMode设置为“firstModulatedBySecond（1）”值时应用于第二频率的振幅调制百分比。”。"
    },
    {
      "indent": 7,
      "text": "    If the MIB object pktcSigDevToneFreqMode is set to\n    value of 'summation (2)', then this MIB object MUST be\n    ignored.\"\n::={ pktcSigDevMultiFreqToneEntry 7}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 2,
      "text": "pktcSigDevToneDbLevel OBJECT-TYPE SYNTAX TenthdBm (-250..-110) UNITS \"1/10 of a dBm\" MAX-ACCESS read-only",
      "zh-CHS": "pktcSigDevToneDbLevel对象类型语法TenthdBm（-250..-110）单位“1/10 dBm”最大只读访问"
    },
    {
      "indent": 6,
      "text": "STATUS current DESCRIPTION \"This MIB object contains the decibel level for each analog signal (tone) that is locally generated (versus in-band supervisory tones) and sourced to the a-b terminals (TE connection point). Each tone in itself may consist of multiple frequencies, as defined by the MIB table pktcSigDevMultiFreqToneTable.",
      "zh-CHS": "STATUS current DESCRIPTION“此MIB对象包含本地生成（相对于带内监控音）并源至a-b终端（TE连接点）的每个模拟信号（音）的分贝级。每个音本身可能由多个频率组成，如MIB表PKTCSIGDEVMULTIFREKTONETABLE所定义。"
    },
    {
      "indent": 11,
      "text": "This MIB object reflects the desired level at the Telco (POTS) a-b (T/R) terminals, including the effect of any MTA receiver gain (loss). This is required so that locally generated tones are consistent with remotely generated in-band tones at the a-b terminals, consistent with user expectations.",
      "zh-CHS": "此MIB对象反映电信公司（POTS）a-b（T/R）终端的所需级别，包括任何MTA接收器增益（损失）的影响。这是必需的，以便本地生成的音调与a-b终端处远程生成的带内音调一致，与用户期望一致。"
    },
    {
      "indent": 11,
      "text": "This MIB object must be set for each tone. When tones are formed by combining multi-frequencies, the level of each frequency shall be set so as to result in the tone level specified in this object at the a-b (T/R) terminals.",
      "zh-CHS": "必须为每个音调设置此MIB对象。当通过组合多个频率形成音调时，应设置每个频率的电平，以便在a-b（T/R）终端处产生本对象中规定的音调电平。"
    },
    {
      "indent": 4,
      "text": "       The wide range of levels for this Object is required\n       to provide signal-generator levels across the wide\n       range of gains (losses) -- but does not imply the entire\n       range is to be achievable given the range of gains (losses)\n       in the MTA.\"\nDEFVAL { -120 }\n::={ pktcSigDevMultiFreqToneEntry 8}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqOnDuration OBJECT-TYPE\n    SYNTAX       Unsigned32(0..5000)\n    UNITS        \"milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n       \"This MIB object represents the duration for which the\n        frequency reference corresponding to the tone type\n        is turned on.\"\n    ::={ pktcSigDevMultiFreqToneEntry 9}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqOffDuration OBJECT-TYPE SYNTAX Unsigned32(0..5000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the duration for which the",
      "zh-CHS": "pktcSigDevToneFreqOffDuration对象类型语法Unsigned32（0..5000）单位“毫秒”最大访问只读状态当前描述“此MIB对象表示"
    },
    {
      "indent": 7,
      "text": "    frequency reference corresponding to the tone type\n    is turned off.\"\n::={ pktcSigDevMultiFreqToneEntry 10}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqRepeatCount OBJECT-TYPE SYNTAX Unsigned32(0..5000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object indicates the number of times to repeat the cadence cycle represented by the on/off durations (refer to the MIB objects pktcSigDevToneFreqOnDuration and pktcSigDevToneFreqOffDuration).",
      "zh-CHS": "pktcSigDevToneFreqRepeatCount对象类型语法Unsigned32（0..5000）MAX-ACCESS只读状态当前描述“此MIB对象指示重复由开/关持续时间表示的节奏周期的次数（请参阅MIB对象pktcSigDevToneFreqOnDuration和pktcSigDevToneFreqOffDuration）。"
    },
    {
      "indent": 7,
      "text": "Setting this object may result in a tone duration that is longer or shorter than the overall signal duration specified by the time out (TO) object for the corresponding tone type. If the value of this MIB Object indicates a longer duration than that specified by the TO, the latter overrules the former, and the desired tone duration will be truncated according to the TO.",
      "zh-CHS": "设置此对象可能导致音调持续时间比超时（TO）对象为相应音调类型指定的总信号持续时间长或短。如果此MIB对象的值指示的持续时间比TO指定的持续时间长，则TO将否决前者，并且所需的音调持续时间将根据TO被截断。"
    },
    {
      "indent": 7,
      "text": "However, if the repeat count results in a shorter\ntone duration than the signal duration specified by\nthe TO, the tone duration defined by the repeat count\ntakes precedence over the TO and will end the signal\nevent.  In this case, the TO represents a time not to\nbe exceeded for the signal.  It is recommended, to\nensure proper telephony signaling, that the TO\nduration setting should always be longer than the\ndesired repeat count-time duration.  A value of zero\nmeans the tone sequence is to be played once but not\nrepeated.\"\n::={ pktcSigDevMultiFreqToneEntry 11}",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevCidDelayAfterLR OBJECT-TYPE SYNTAX Unsigned32 (300..800) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies the delay between the end of the Line Reversal and the start of the FSK or DTMF signal. This MIB object is used only when pktcSigDevCidMode is set to a value of 'lrETS'. This timing has a range of 300 to 800 ms.",
      "zh-CHS": "pktcSigDevCidDelayAfterLR对象类型语法Unsigned32（300..800）单位“毫秒”最大访问读写状态当前说明“此对象指定线路反转结束与FSK或DTMF信号开始之间的延迟。仅当pktcSigDevCidMode设置为“lrETS”值时，才使用此MIB对象。此正时的范围为300至800 ms。"
    },
    {
      "indent": 11,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevCidMode），必须遵循下表："
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "zh-CHS": "pktcSigDevCidMode默认值的值"
    },
    {
      "indent": 12,
      "text": "duringringingETS any value (not used) dtAsETS any value (not used) rpAsETS any value (not used) lrAsETS any value (not used) lrETS 400",
      "zh-CHS": "在RingingETS任意值（未使用）数据集任意值（未使用）rpAsETS任意值（未使用）lrAsETS任意值（未使用）lrETS 400"
    },
    {
      "indent": 12,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not set to a value of 'lrETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "当pktcSigDevCidMode的值未设置为“lrETS”值时，尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 7,
      "text": "     The value of this MIB object MUST NOT persist across MTA\n     reboots.\"\nDEFVAL { 400 }\n::= {pktcSigDevObjects 34 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevCidDtmfStartCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies optional start codes used when the MIB object pktcSigDevCidSigProtocol is set to a value of 'dtmf(2)'.",
      "zh-CHS": "pktcSigDevCidDtmfStartCode对象类型语法DtmfCode MAX-ACCESS读写状态当前说明“此对象标识MIB对象pktcSigDevCidSigProtocol设置为“dtmf（2）”值时使用的可选启动代码。"
    },
    {
      "indent": 12,
      "text": "Different countries define different caller id signaling codes to support caller identification. When Dual-Tone Multi-Frequency (DTMF) is used, the caller id digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "zh-CHS": "不同的国家定义不同的呼叫者id信令代码以支持呼叫者识别。当使用双音多频（DTMF）时，呼叫者id数字前面是“起始码”数字，后面是数字传输序列<S1>…<Sn>（其中Sx表示数字0-9），最后是“结束码”数字。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>. The start code for calling number delivery may be DTMF 'A' or 'D'. The start code for redirecting a number may be DTMF 'D'. The DTMF code 'B' may be sent by the network as a start code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "zh-CHS": "例如，<A><S1>。<Sn><D><S1>。<Sn><B><S1>。<Sn><C>。呼叫号码传送的起始代码可以是DTMF“A”或“D”。重定向号码的起始代码可以是DTMF“D”。DTMF代码“B”可由网络发送，作为信息值传输的起始代码，通过该代码可向用户指示特殊事件。在一些国家，可以使用“*”或“#”来代替“A”、“B”、“C”或“D”。"
    },
    {
      "indent": 12,
      "text": "The value of this MIB object MUST NOT persist across MTA",
      "zh-CHS": "此MIB对象的值不能跨MTA持久化"
    },
    {
      "indent": 3,
      "text": "         reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeA}\n::= { pktcSigDevObjects 35 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevCidDtmfEndCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies optional end codes used when the pktcSigDevCidSigProtocol is set to a value of 'dtmf(2)'.",
      "zh-CHS": "pktcSigDevCidDtmfEndCode对象类型语法DtmfCode MAX-ACCESS读写状态当前描述“此对象标识当PKTCSIGDEVCIDDSIGSPROTOcol设置为“dtmf（2）”值时使用的可选结束代码。”。"
    },
    {
      "indent": 12,
      "text": "Different countries define different caller id signaling protocols to support caller identification. When Dual-Tone Multi-Frequency (DTMF) is used, the caller id digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "zh-CHS": "不同的国家定义了不同的呼叫者id信令协议来支持呼叫者识别。当使用双音多频（DTMF）时，呼叫者id数字前面是“起始码”数字，后面是数字传输序列<S1>…<Sn>（其中Sx表示数字0-9），最后是“结束码”数字。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>.",
      "zh-CHS": "例如，<A><S1>。<Sn><D><S1>。<Sn><B><S1>。<Sn><C>。"
    },
    {
      "indent": 12,
      "text": "The DTMF code 'C' may be sent by the network as an end code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "zh-CHS": "DTMF代码“C”可以由网络作为信息值传输的结束代码发送，通过它可以向用户指示特殊事件。在一些国家，可以使用“*”或“#”来代替“A”、“B”、“C”或“D”。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeC}\n::= { pktcSigDevObjects 36 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiSigProtocol OBJECT-TYPE SYNTAX PktcSubscriberSideSigProtocol MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies the subscriber line protocol used for signaling the information on Visual Message Waiting Indicator (VMWI). Different countries define different VMWI signaling protocols to support VMWI service.",
      "zh-CHS": "pktcSigDevVmwiSigProtocol对象类型语法PktcSubscriberSideSigProtocol MAX-ACCESS读写状态当前描述“此对象标识用于向可视消息等待指示器（VMWI）上的信息发送信号的订户线路协议。不同国家定义不同的VMWI信号协议以支持VMWI服务。"
    },
    {
      "indent": 12,
      "text": "Frequency shift keying (FSK) is most commonly used. DTMF is an alternative.",
      "zh-CHS": "频移键控（FSK）是最常用的。DTMF是另一种选择。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n     DEFVAL { fsk }\n::= { pktcSigDevObjects 37 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiDelayAfterLR OBJECT-TYPE SYNTAX Unsigned32 (0|300..800) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies the delay between the end of the Line Reversal and the start of the FSK or DTMF signal. This object is only used when pktcSigDevVmwiMode is set to a value of 'lrETS'. This timing has a range of 300 to 800 ms.",
      "zh-CHS": "pktcSigDevVmwiDelayAfterLR对象类型语法无符号32（0 | 300..800）单位“毫秒”最大访问读写状态当前说明“此对象指定线路反转结束与FSK或DTMF信号开始之间的延迟。此对象仅在pktcSigDevVmwiMode设置为“lrETS”值时使用。此正时的范围为300至800 ms。"
    },
    {
      "indent": 11,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevVmwiMode），必须遵循下表："
    },
    {
      "indent": 12,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "zh-CHS": "pktcSigDevVmwiMode默认值的值"
    },
    {
      "indent": 12,
      "text": "duringringingETS any value (not used) dtAsETS any value (not used) rpAsETS any value (not used) lrAsETS any value (not used) lrETS 400",
      "zh-CHS": "在RingingETS任意值（未使用）数据集任意值（未使用）rpAsETS任意值（未使用）lrAsETS任意值（未使用）lrETS 400"
    },
    {
      "indent": 12,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'lrETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "在pktcSigDevVmwiMode的值不是“lrETS”时尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 12,
      "text": "The value of this MIB object MUST NOT persist across MTA reboots.\"",
      "zh-CHS": "此MIB对象的值不能在MTA重新启动期间持续存在。”"
    },
    {
      "indent": 7,
      "text": "DEFVAL {400}\n    ::= {pktcSigDevObjects 38 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiDtmfStartCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies optional start codes used when",
      "zh-CHS": "pktcSigDevVmwiDtmfStartCode对象类型语法DtmfCode MAX-ACCESS读写状态当前说明“此对象标识在"
    },
    {
      "indent": 12,
      "text": "the pktcSigDevVmwiSigProtocol is set to a value of 'dtmf(2)'. Different countries define different On Hook Data Transmission Protocol signaling codes to support VMWI.",
      "zh-CHS": "pktcSigDevVmwiSigProtocol的值设置为“dtmf（2）”。不同的国家定义了不同的挂机数据传输协议信令代码来支持VMWI。"
    },
    {
      "indent": 12,
      "text": "When Dual-Tone Multi-Frequency (DTMF) is used, the VMWI digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "zh-CHS": "当使用双音多频（DTMF）时，VMWI数字前面是一个“开始代码”数字，后面是数字传输序列<S1>…<Sn>（其中Sx表示数字0-9），最后是“结束代码”数字。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>.",
      "zh-CHS": "例如，<A><S1>。<Sn><D><S1>。<Sn><B><S1>。<Sn><C>。"
    },
    {
      "indent": 12,
      "text": "The start code for redirecting VMWI may be DTMF 'D' The DTMF code 'B' may be sent by the network as a start code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "zh-CHS": "重定向VMWI的起始代码可以是DTMF“D”。DTMF代码“B”可以由网络作为信息值传输的起始代码发送，通过该代码可以向用户指示特殊事件。在一些国家，可以使用“*”或“#”来代替“A”、“B”、“C”或“D”。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeA}\n::= { pktcSigDevObjects 39 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiDtmfEndCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies an optional end code used when the pktcSigDevVmwiSigProtocol is set to a value of 'dtmf(2)'. Different countries define different on-hook Data Transmission Protocol signaling codes to support VMWI.",
      "zh-CHS": "PKTCSIGDEVVMWIDTMFODE对象类型语法DtmfCode MAX-ACCESS读写状态当前描述“此对象标识当pktcSigDevVmwiSigProtocol设置为“dtmf（2）”值时使用的可选结束代码。不同国家定义不同的挂接数据传输协议信令代码以支持VMWI。"
    },
    {
      "indent": 12,
      "text": "When Dual-Tone Multi-Frequency (DTMF) is used, the VMWI digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "zh-CHS": "当使用双音多频（DTMF）时，VMWI数字前面是一个“开始代码”数字，后面是数字传输序列<S1>…<Sn>（其中Sx表示数字0-9），最后是“结束代码”数字。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>.",
      "zh-CHS": "例如，<A><S1>。<Sn><D><S1>。<Sn><B><S1>。<Sn><C>。"
    },
    {
      "indent": 12,
      "text": "The DTMF code 'C' may be sent by the network as an end code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "zh-CHS": "DTMF代码“C”可以由网络作为信息值传输的结束代码发送，通过它可以向用户指示特殊事件。在一些国家，可以使用“*”或“#”来代替“A”、“B”、“C”或“D”。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeC}\n::= { pktcSigDevObjects 40 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDevrpAsDtsDuration OBJECT-TYPE SYNTAX Unsigned32 (0|200..500) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the duration of the rpASDTS ring pulse prior to the start of the transmission of the FSK or DTMF containing the caller id information. It is only used when pktcSigDevCidMode is set to a value of 'rpAsETS'.",
      "zh-CHS": "PKTCSIGDEVRPASDTSDUTION对象类型语法Unsigned32（0 | 200..500）单位“毫秒”最大访问读写状态当前说明“此对象指定在开始传输包含呼叫者id信息的FSK或DTMF之前rpASDTS响铃脉冲的持续时间。仅当pktcSigDevCidMode设置为“rpAsETS”值时，才使用此选项。"
    },
    {
      "indent": 12,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "zh-CHS": "下表定义了此MIB对象的默认值，具体取决于信号类型（pktcSigDevCidMode），必须遵循下表："
    },
    {
      "indent": 13,
      "text": "Value of pktcSigDevCidMode Default value",
      "zh-CHS": "pktcSigDevCidMode默认值的值"
    },
    {
      "indent": 13,
      "text": "duringringingETS any value (not used) dtAsETS any value (not used) rpAsETS 250 lrAsETS any value (not used) lrETS any value (not used)",
      "zh-CHS": "使用期间设置任意值（未使用）数据设置任意值（未使用）rpAsETS 250 lrAsETS任意值（未使用）lrETS任意值（未使用）"
    },
    {
      "indent": 13,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not 'rpAsETS' will result in an 'inconsistentValue' error.",
      "zh-CHS": "在pktcSigDevCidMode的值不是“rpAsETS”时尝试设置此对象将导致“值不一致”错误。"
    },
    {
      "indent": 7,
      "text": "     The value of this MIB object MUST NOT persist across MTA\n     reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification and Belgacom\n     BGC_D_48_9811_30_09_EDOC version 3.3\"\nDEFVAL { 250 }\n::= {pktcSigDevObjects 41 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- The Endpoint Config Table is used to define attributes that\n-- are specific to connection EndPoints.\n--",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTable  OBJECT-TYPE\n    SYNTAX        SEQUENCE OF PktcSigEndPntConfigEntry\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \" This table describes the information pertaining to each\n          endpoint of the MTA.  All entries in this table represent\n          the provisioned endpoints provisioned with the information\n          required by the MTA to maintain the NCS protocol\n          communication with the CMS.  Each endpoint can be assigned\n          to its own CMS.  If the specific endpoint does not have\n          the corresponding CMS information in this table, the\n          endpoint is considered as not provisioned with voice\n          services.  Objects in this table do not persist across\n          MTA reboots.\"\n   ::=  { pktcSigEndPntConfigObjects 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigEntry  OBJECT-TYPE\n    SYNTAX        PktcSigEndPntConfigEntry\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \"Each entry in the pktcSigEndPntConfigTable represents\n         required signaling parameters for the specific endpoint\n         provisioned with voice services.  The conceptual rows MUST\n         NOT persist across MTA reboots.\"\n    INDEX { ifIndex }\n    ::= { pktcSigEndPntConfigTable 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "PktcSigEndPntConfigEntry  ::= SEQUENCE {\n    pktcSigEndPntConfigCallAgentId             SnmpAdminString,\n    pktcSigEndPntConfigCallAgentUdpPort        InetPortNumber,\n    pktcSigEndPntConfigPartialDialTO           Unsigned32,\n    pktcSigEndPntConfigCriticalDialTO          Unsigned32,\n    pktcSigEndPntConfigBusyToneTO              Unsigned32,\n    pktcSigEndPntConfigDialToneTO              Unsigned32,\n    pktcSigEndPntConfigMessageWaitingTO        Unsigned32,\n    pktcSigEndPntConfigOffHookWarnToneTO       Unsigned32,\n    pktcSigEndPntConfigRingingTO               Unsigned32,\n    pktcSigEndPntConfigRingBackTO              Unsigned32,\n    pktcSigEndPntConfigReorderToneTO           Unsigned32,\n    pktcSigEndPntConfigStutterDialToneTO       Unsigned32,",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 4,
      "text": "pktcSigEndPntConfigTSMax Unsigned32, pktcSigEndPntConfigMax1 Unsigned32, pktcSigEndPntConfigMax2 Unsigned32, pktcSigEndPntConfigMax1QEnable TruthValue, pktcSigEndPntConfigMax2QEnable TruthValue, pktcSigEndPntConfigMWD Unsigned32, pktcSigEndPntConfigTdinit Unsigned32, pktcSigEndPntConfigTdmin Unsigned32, pktcSigEndPntConfigTdmax Unsigned32, pktcSigEndPntConfigRtoMax Unsigned32, pktcSigEndPntConfigRtoInit Unsigned32, pktcSigEndPntConfigLongDurationKeepAlive Unsigned32, pktcSigEndPntConfigThist Unsigned32, pktcSigEndPntConfigStatus RowStatus, pktcSigEndPntConfigCallWaitingMaxRep Unsigned32, pktcSigEndPntConfigCallWaitingDelay Unsigned32, pktcSigEndPntStatusCallIpAddressType InetAddressType, pktcSigEndPntStatusCallIpAddress InetAddress, pktcSigEndPntStatusError INTEGER, pktcSigEndPntConfigMinHookFlash Unsigned32, pktcSigEndPntConfigMaxHookFlash Unsigned32, pktcSigEndPntConfigPulseDialInterdigitTime Unsigned32, pktcSigEndPntConfigPulseDialMinMakeTime Unsigned32, pktcSigEndPntConfigPulseDialMaxMakeTime Unsigned32, pktcSigEndPntConfigPulseDialMinBreakTime Unsigned32, pktcSigEndPntConfigPulseDialMaxBreakTime Unsigned32 }",
      "zh-CHS": "pktcSigEndPntConfigTSMax Unsigned32、pktcSigEndPntConfigMax1 Unsigned32、pktcSigEndPntConfigMax1 Unsigned32、pktcSigEndPntConfigMax1 Unsigned32、PKTCSIGENDPNTConfigmax Unsigned32、pktcSigEndPntConfigMax1 Unsigned32、PKTCSIGENDPNTConfigmax Unsigned32、，pktcSigEndPntConfigRtoMax Unsigned32、PKTCSIGENDPNTCONFIGRTOINT Unsigned32、PKTCSIGENDPNTCONFIGLONDURATIONKEEPALLIVE Unsigned32、pktcSigEndPntConfigThist Unsigned32、PKTCSIGENDPNTCONFIGGSTATUS RowStatus、pktcSigEndPntConfigCallWaitingMaxRep Unsigned32、pktcSigEndPntConfigCallWaitingDelay Unsigned32、，PKTCSIGENDPNTStatusCalipAddressType InetAddressType，PKTCSIGENDPNTStatusCalipAddress InetAddress，pktcSigEndPntStatusError INTEGER，pktcSigEndPntConfigMinHookFlash Unsigned32，pktcSigEndPntConfigMaxHookFlash Unsigned32，pktcSigEndPntConfigPulseDialInterdigitTime Unsigned32，pktcSigEndPntConfigPulseDialMaxMakeTime Unsigned32，pktcSigEndPntConfigPulseDialMinBreakTime Unsigned32，pktcSigEndPntConfigPulseDialMaxBreakTime Unsigned32}"
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallAgentId OBJECT-TYPE SYNTAX SnmpAdminString(SIZE (3..255)) MAX-ACCESS read-create STATUS current DESCRIPTION \" This object contains a string indicating the call agent name (e.g., ca@example.com). The call agent name, after the character '@', MUST be a fully qualified domain name (FQDN) and MUST have a corresponding pktcMtaDevCmsFqdn entry in the pktcMtaDevCmsTable. The object pktcMtaDevCmsFqdn is defined in the PacketCable MIBMTA Specification. For each particular endpoint, the MTA MUST use the current value of this object to communicate with the corresponding CMS. The MTA MUST update this object with the value of the 'Notified Entity' parameter of the NCS message. Because of the high importance of this object to the ability of the MTA to maintain reliable NCS communication with the CMS, it is highly recommended not to change this object's value using SNMP during normal operation.\"",
      "zh-CHS": "pktcSigEndPntConfigCallAgentId对象类型语法SnmpAdminString（大小（3..255））MAX-ACCESS read create STATUS current DESCRIPTION“此对象包含指示呼叫代理名称的字符串（例如。，ca@example.com)。在字符“@”之后的呼叫代理名称必须是完全限定的域名（FQDN）并且必须在PKTCMTADEVCMS表中具有相应的pktcMtaDevCmsFqdn项。对象pktcMtaDevCmsFqdn在PacketCable MIBMTA规范中定义。对于每个特定端点，MTA必须使用此对象的当前值与相应的CMS通信。MTA必须使用“通知”值更新此对象NCS消息的实体参数。由于此对象对MTA与CMS保持可靠NCS通信的能力非常重要，因此强烈建议在正常操作期间不要使用SNMP更改此对象的值。”"
    },
    {
      "indent": 4,
      "text": "::= {  pktcSigEndPntConfigEntry 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallAgentUdpPort    OBJECT-TYPE\n    SYNTAX      InetPortNumber (1025..65535)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the current value of the User\n          Datagram Protocol (UDP) receive port on which the\n          call agent will receive NCS from the endpoint.\n          For each particular endpoint, the MTA MUST use the current\n          value of this object to communicate with the corresponding\n          CMS.  The MTA MUST update this object with the value of the\n          'Notified Entity' parameter of the NCS message.  If the\n          Notified Entity parameter does not contain a CallAgent\n          port, the MTA MUST update this object with the default\n          value of 2727.  Because of the high importance of this\n          object to the ability of the MTA to maintain reliable NCS\n          communication with the CMS, it is highly recommended not\n          to change this object's value using SNMP during normal\n          operation.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 2727 }\n    ::= { pktcSigEndPntConfigEntry 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPartialDialTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \"This object contains the value of the partial dial\n         time out.\n         The time out (TO) elements are intended to limit the time a\n         tone or frequency is generated.  When this MIB object is set\n         to a value of '0', the MTA MUST NOT generate the\n         corresponding frequency or tone, regardless of the\n         definitions pertaining to frequency, tone duration, or\n         cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 16 }\n    ::= { pktcSigEndPntConfigEntry 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCriticalDialTO OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\"",
      "zh-CHS": "pktcSigEndPntConfigCriticalDialTO对象类型语法无符号32个单位“秒”"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS   read-create\nSTATUS       current\nDESCRIPTION\n    \"This object contains the value of the critical\n     dial time out.\n     The time out (TO) elements are intended to limit the time a\n     tone or frequency is generated.  When this MIB object is set\n     to a value of '0', the MTA MUST NOT generate the\n     corresponding frequency or tone, regardless of the\n     definitions pertaining to frequency, tone duration, or\n     cadence.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 4 }\n::= { pktcSigEndPntConfigEntry 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigBusyToneTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for busy\n          tone.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 30 }\n    ::= { pktcSigEndPntConfigEntry 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigDialToneTO OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \" This object contains the default time out value for dial tone. The MTA MUST NOT update this object with the value provided in the NCS message (if present). If",
      "zh-CHS": "pktcSigEndPntConfigDialToneTO对象类型语法Unsigned32个单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“此对象包含拨号音的默认超时值。MTA不得使用NCS消息（如果存在）中提供的值更新此对象。如果"
    },
    {
      "indent": 4,
      "text": "      the value of the object is modified by the SNMP Management\n      Station, the MTA MUST use the new value as a default only\n      for a new signal requested by the NCS message.\n      The time out (TO) elements are intended to limit the time\n      a tone or frequency is generated.  When this MIB object is\n      set to a value of '0', the MTA MUST NOT generate the\n      corresponding frequency or tone, regardless of the\n      definitions pertaining to frequency, tone duration, or\n      cadence.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL    { 16 }\n::= { pktcSigEndPntConfigEntry 6 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMessageWaitingTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for message\n          waiting indicator.  The MTA MUST NOT update this object\n          with the value provided in the NCS message (if\n          present).  If the value of the object is modified by the\n          SNMP Manager application, the MTA MUST use the new value\n          as a default only for a new signal requested by the NCS\n          message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 16 }\n    ::= { pktcSigEndPntConfigEntry 7 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigOffHookWarnToneTO OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \" This object contains the default time out value for the off-hook warning tone. The MTA MUST NOT update this object with the value provided in the NCS message (if present). If the value of the object is modified by the SNMP Manager",
      "zh-CHS": "PKTCSIGENDPNTConfigoffhookwarntonto对象类型语法Unsigned32个单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“此对象包含摘机警告音的默认超时值。MTA不得使用NCS消息（如果存在）中提供的值更新此对象。如果SNMP管理器修改了对象的值"
    },
    {
      "indent": 4,
      "text": "      application, the MTA MUST use the new value as a default\n      only for a new signal requested by the NCS message.  The\n      time out (TO) elements are intended to limit the time a tone\n      or frequency is generated.  When this MIB object is set to a\n      value of '0', the MTA MUST NOT generate the corresponding\n      frequency or tone, regardless of the definitions pertaining\n      to frequency, tone duration, or cadence.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 0 }\n::= { pktcSigEndPntConfigEntry 8 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRingingTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for\n          ringing.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 180 }\n    ::= { pktcSigEndPntConfigEntry 9 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRingBackTO OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \" This object contains the default time out value for ring back. The MTA MUST NOT update this object with the value provided in the NCS message (if present). If the value of the object is modified by the SNMP Management Station, the MTA MUST use the new value as a default only for a new signal requested by the NCS message. The time out (TO) elements are intended to limit the time",
      "zh-CHS": "pktcSigEndPntConfigRingBackTO对象类型语法Unsigned32个单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“此对象包含回拨的默认超时值。MTA不得使用NCS消息中提供的值更新此对象（如果存在）。如果SNMP管理站修改了对象的值，MTA必须仅将新值用作NCS消息请求的新信号的默认值。超时（TO）元素旨在限制时间"
    },
    {
      "indent": 4,
      "text": "      a tone or frequency is generated.  When this MIB object is\n      set to a value of '0', the MTA MUST NOT generate the\n      corresponding frequency or tone, regardless of the\n      definitions pertaining to frequency, tone duration, or\n      cadence.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL    { 180 }\n::= { pktcSigEndPntConfigEntry 10 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigReorderToneTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for reorder\n          tone.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 30 }\n    ::= { pktcSigEndPntConfigEntry 11 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigStutterDialToneTO OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \" This object contains the default time out value for stutter dial tone. The MTA MUST NOT update this object with the value provided in the NCS message (if present). If the value of the object is modified by the SNMP Management Station, the MTA MUST use the new value as a default only for a new signal requested by the NCS message. The time out (TO) elements are intended to limit the time a tone or frequency is generated. When this MIB object is set to a value of '0', the MTA MUST NOT generate the",
      "zh-CHS": "pktcSigEndPntConfigStutterDialToneTO对象类型语法Unsigned32个单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“此对象包含stutter拨号音的默认超时值。MTA不得使用NCS消息（如果存在）中提供的值更新此对象。如果SNMP管理站修改了对象的值，则MTA必须仅将新值用作NCS消息请求的新信号的默认值。超时（TO）元素旨在限制生成音调或频率的时间。当此MIB对象设置为值“0”时，MTA不得生成"
    },
    {
      "indent": 4,
      "text": "      corresponding frequency or tone, regardless of the\n      definitions pertaining to frequency, tone duration, or\n      cadence.\"\nREFERENCE\n      \"PacketCable NCS Specification\"\nDEFVAL    { 16 }\n::= { pktcSigEndPntConfigEntry 12 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTSMax OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-create STATUS current DESCRIPTION \"This MIB object is used as part of an NCS retransmission algorithm. Prior to any retransmission, the MTA must check to make sure that the time elapsed since the sending of the initial datagram does not exceed the value specified by this MIB object. If more than Tsmax time has elapsed, then the retransmissions MUST cease.",
      "zh-CHS": "pktcSigEndPntConfigTSMax对象类型语法Unsigned32 MAX-ACCESS读取创建状态当前说明“此MIB对象用作NCS重传算法的一部分。在任何重新传输之前，MTA必须进行检查，以确保自发送初始数据报以来经过的时间不超过此MIB对象指定的值。如果超过Tsmax时间，则必须停止重新传输。"
    },
    {
      "indent": 4,
      "text": "        Refer to the MIB object pktcSigEndPntConfigThist for\n        information on when the endpoint becomes disconnected.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 20 }\n::= { pktcSigEndPntConfigEntry 13 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax1     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object contains the suspicious error threshold for\n         signaling messages.  The pktcSigEndPntConfigMax1 object\n         indicates the retransmission threshold at which the MTA MAY\n         actively query the domain name server (DNS) in order to\n         detect the possible change of call agent interfaces.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 5 }\n    ::= { pktcSigEndPntConfigEntry 14 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax2 OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-create STATUS current DESCRIPTION",
      "zh-CHS": "pktcSigEndPntConfigMax2对象类型语法Unsigned32 MAX-ACCESS读取创建状态当前说明"
    },
    {
      "indent": 4,
      "text": "    \"This object contains the disconnect error threshold for\n     signaling messages.  The pktcSigEndPntConfigMax2 object\n     indicates the retransmission threshold at which the MTA\n     SHOULD contact the DNS one more time to see if any other\n     interfaces to the call agent have become available.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 7 }\n::= { pktcSigEndPntConfigEntry 15 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax1QEnable     OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object enables/disables the Max1 domain name server\n         (DNS) query operation when the pktcSigEndPntConfigMax1\n         threshold has been reached.\n         A value of true(1) indicates enabling, and a value of\n         false(2) indicates disabling.\"\n    DEFVAL { true }\n    ::= { pktcSigEndPntConfigEntry 16 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax2QEnable     OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object enables/disables the Max2 domain name server\n         (DNS) query operation when the pktcSigEndPntConfigMax2\n         threshold has been reached.\n         A value of true(1) indicates enabling, and a value of\n         false(2) indicates disabling.\"\n    DEFVAL { true }\n    ::= { pktcSigEndPntConfigEntry 17 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMWD OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"Maximum Waiting Delay (MWD) contains the maximum number of seconds an MTA waits, after powering on, before initiating the restart procedure with the call agent.\" REFERENCE \"PacketCable NCS Specification\" DEFVAL { 600 }",
      "zh-CHS": "pktcSigEndPntConfigMWD对象类型语法Unsigned32个单位“秒”MAX-ACCESS read create STATUS current DESCRIPTION“最大等待延迟（MWD）包含MTA在通电后，在启动调用代理的重新启动过程之前等待的最大秒数。”参考“PacketCable NCS规范”DEFVAL{600}"
    },
    {
      "indent": 4,
      "text": "::= { pktcSigEndPntConfigEntry 18 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTdinit OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This MIB object represents the 'disconnected' initial waiting delay within the context of an MTA's 'disconnected procedure'. The 'disconnected procedure' is initiated when an endpoint becomes 'disconnected' while attempting to communicate with a call agent.",
      "zh-CHS": "pktcSigEndPntConfigTdinit对象类型语法无符号32个单位“秒”最大访问读取创建状态当前说明“此MIB对象表示MTA的“断开连接的过程”上下文中的“断开连接的”初始等待延迟。当端点在尝试与呼叫代理通信时变为“断开连接”时，将启动“断开连接的过程”。"
    },
    {
      "indent": 9,
      "text": "The 'disconnected timer' associated with the 'disconnected Procedure' is initialized to a random value, uniformly distributed between zero and the value contained in this MIB object.",
      "zh-CHS": "与“断开连接的过程”关联的“断开连接的计时器”初始化为随机值，均匀分布在零和此MIB对象中包含的值之间。"
    },
    {
      "indent": 4,
      "text": "     For more information on the usage of this timer, please\n     refer to the PacketCable NCS Specification.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 15 }\n::= { pktcSigEndPntConfigEntry 19 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTdmin     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This MIB object represents the 'disconnected' minimum\n             waiting delay within the context of an MTA's\n             'disconnected procedure', specifically when local user\n             activity is detected.\n             The 'disconnected procedure' is initiated when\n             an endpoint becomes 'disconnected' while attempting to\n             communicate with a call agent.\n             For more information on the usage of this timer, please\n             refer to the PacketCable NCS Specification.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 15 }\n    ::= { pktcSigEndPntConfigEntry 20 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTdmax OBJECT-TYPE SYNTAX Unsigned32",
      "zh-CHS": "pktcSigEndPntConfigTdmax对象类型语法Unsigned32"
    },
    {
      "indent": 4,
      "text": "UNITS       \"seconds\"\nMAX-ACCESS  read-create\nSTATUS      current\nDESCRIPTION\n    \" This object contains the maximum number of seconds the MTA\n      waits, after a disconnect, before initiating the\n      disconnected procedure with the call agent.\n       \"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 600 }\n::= { pktcSigEndPntConfigEntry 21 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRtoMax     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object specifies the maximum number of seconds the MTA\n         waits for a response to an NCS message before initiating\n         a retransmission.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 4 }\n    ::= { pktcSigEndPntConfigEntry 22 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRtoInit     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"milliseconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the initial number of seconds for the\n          retransmission timer.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 200 }\n    ::= { pktcSigEndPntConfigEntry 23 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigLongDurationKeepAlive OBJECT-TYPE SYNTAX Unsigned32 UNITS \"minutes\" MAX-ACCESS read-create STATUS current DESCRIPTION \" Specifies a time out value, in minutes, for sending long duration call notification messages.\"",
      "zh-CHS": "pktcSigEndPntConfigLongDurationKeepAlive对象类型语法Unsigned32个单位“分钟”MAX-ACCESS read create STATUS current DESCRIPTION“指定超时值，以分钟为单位，用于发送长时间呼叫通知消息。”"
    },
    {
      "indent": 4,
      "text": "REFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 60 }\n::= { pktcSigEndPntConfigEntry 24 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigThist  OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" Time out period, in seconds, before no response is declared.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 30 }\n    ::= { pktcSigEndPntConfigEntry 25 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigStatus     OBJECT-TYPE\n    SYNTAX      RowStatus\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the Row Status associated with the\n          pktcSigEndPntConfigTable.  There are no restrictions or\n          dependencies amidst the columnar objects before this\n          row can be activated or for modifications of the\n          columnar objects when this object is set to a\n          value of 'active(1).\"\n    ::= { pktcSigEndPntConfigEntry 26 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallWaitingMaxRep     OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..10)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the default value of the maximum\n          number of repetitions of the Call Waiting tone that the\n          MTA will play from a single CMS request.  The MTA MUST NOT\n          update this object with the information provided in the\n          NCS message (if present).  If the value of the object is\n          modified by the SNMP Manager application, the MTA MUST use\n          the new value as a default only for a new signal\n          requested by the NCS message.\"\n    DEFVAL    { 1 }\n    ::= { pktcSigEndPntConfigEntry 27 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallWaitingDelay OBJECT-TYPE SYNTAX Unsigned32 (1..100)",
      "zh-CHS": "pktcSigEndPntConfigCallWaitingDelay对象类型语法Unsigned32（1..100）"
    },
    {
      "indent": 4,
      "text": "UNITS        \"seconds\"\nMAX-ACCESS   read-create\nSTATUS       current\nDESCRIPTION\n    \" This object contains the delay between repetitions of the\n      Call Waiting tone that the MTA will play from a single CMS\n      request.\"\nDEFVAL    { 10 }\n::= { pktcSigEndPntConfigEntry 28 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntStatusCallIpAddressType OBJECT-TYPE SYNTAX InetAddressType MAX-ACCESS read-only STATUS current DESCRIPTION \" This object contains the type of Internet address contained in the MIB object 'pktcSigEndPntStatusCallIpAddress'.",
      "zh-CHS": "PKTCSIGENDPNTSTATUSALLIPAddressType对象类型语法InetAddressType MAX-ACCESS只读状态当前描述“此对象包含MIB对象“PKTCSIGENDPNTSTATUSALLIPAddress”中包含的Internet地址类型。"
    },
    {
      "indent": 9,
      "text": "Since pktcSigEndPntStatusCallIpAddress is expected to contain an IP address, a value of dns(16) is disallowed.\"",
      "zh-CHS": "由于PKTCSIGENDPNTSTATUSALLIPDRESS应包含IP地址，因此不允许dns（16）的值。”"
    },
    {
      "indent": 4,
      "text": "::= { pktcSigEndPntConfigEntry 29 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntStatusCallIpAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \" This MIB object contains the chosen IP address of the CMS currently being used for the corresponding endpoint.",
      "zh-CHS": "PKTCSIGENDPNTSTATUSALLIPDRESS对象类型语法InetAddress MAX-ACCESS只读状态当前描述“此MIB对象包含当前用于相应端点的CMS的选定IP地址。"
    },
    {
      "indent": 9,
      "text": "The device determines the IP address by using DNS to resolve the IP address of the CMS from the FQDN stored in the MIB object 'pktcSigEndPntConfigCallAgentId'. The processes are outlined in the PacketCable NCS and Security specifications, and MUST be followed by the MTA.",
      "zh-CHS": "设备通过使用DNS从存储在MIB对象“pktcSigEndPntConfigCallAgentId”中的FQDN解析CMS的IP地址来确定IP地址。PacketCable NCS和安全规范中概述了这些流程，MTA必须遵循这些流程。"
    },
    {
      "indent": 0,
      "text": "         The IP address type contained in this MIB object is\n         indicated by pktcSigEndPntStatusCallIpAddressType.\"\n    REFERENCE\n        \"PacketCable NCS Specification;\n         PacketCable Security specification, [PKT-SP-SEC].\"\n::= { pktcSigEndPntConfigEntry 30 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntStatusError OBJECT-TYPE SYNTAX INTEGER { operational (1), noSecurityAssociation (2),",
      "zh-CHS": "pktcSigEndPntStatusError对象类型语法整数{可操作（1），noSecurityAssociation（2），"
    },
    {
      "indent": 4,
      "text": "           disconnected (3)\n         }\nMAX-ACCESS   read-only\nSTATUS  current\nDESCRIPTION\n   \" This object contains the error status for this interface.\n     The operational status indicates that all operations\n     necessary to put the line in service have occurred, and the\n     CMS has acknowledged the Restart In Progress (RSIP)\n     message successfully.  If pktcMtaDevCmsIpsecCtrl is enabled\n     for the associated call agent, the noSecurityAssociation\n     status indicates that no Security Association (SA) yet\n     exists for this endpoint.  If pktcMtaDevCmsIpsecCtrl is\n     disabled for the associated call agent, the\n     noSecurityAssociation status is not applicable and should\n     not be used by the MTA.  The disconnected status indicates\n     one of the following two:\n     If pktcMtaDevCmsIpsecCtrl is disabled, then no security\n     association is involved with this endpoint.  The NCS\n     signaling software is in process of establishing the NCS\n     signaling link via an RSIP exchange.\n     Otherwise, when pktcMtaDevCmsIpsecCtrl is enabled,\n     security Association has been established, and the NCS\n     signaling software is in process of establishing the NCS\n     signaling link via an RSIP exchange.\"\n::= { pktcSigEndPntConfigEntry 31 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMinHookFlash    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..1550)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the minimum time a line needs to be on-hook for a\n          valid hook flash.  The value of this object MUST be\n          greater than the value of\n          pktcSigEndPntConfigPulseDialMaxBreakTime.  The value of\n          pktcSigEndPntConfigMinHookFlash MUST be less than\n          pktcSigEndPntConfigMaxHookFlash.  This object MUST only be\n          set via the MTA configuration during the provisioning\n          process.\n             Furthermore, given the possibility for the 'pulse dial'\n             and 'hook flash' to overlap, the value of this object\n             MUST be greater than the value contained by the MIB\n             Object 'pktcSigEndPntConfigPulseDialMaxMakeTime'.\"\n    DEFVAL { 300 }\n    ::= { pktcSigEndPntConfigEntry 32 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMaxHookFlash    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..1550)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the maximum time a line needs to be on-hook for a\n          valid hook flash.  The value of\n          pktcSigEndPntConfigMaxHookFlash MUST be greater than\n          pktcSigEndPntConfigMinHookFlash.  This object MUST only be\n          set via the MTA configuration during the provisioning\n          process.\"\n    DEFVAL { 800 }\n    ::= { pktcSigEndPntConfigEntry 33 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialInterdigitTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (100..1500)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the pulse dial inter-digit time out.  This object\n          MUST only be set via the MTA configuration during the\n          provisioning process.\"\n    DEFVAL { 100 }\n    ::= { pktcSigEndPntConfigEntry 34 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMinMakeTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..200)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the minimum make pulse width for the dial pulse.\n          The value of pktcSigEndPntConfigPulseDialMinMakeTime MUST\n          be less than pktcSigEndPntConfigPulseDialMaxMakeTime.  This\n          object MUST only be set via the MTA configuration during\n          the provisioning process.\"\n    DEFVAL { 25 }\n    ::= { pktcSigEndPntConfigEntry 35 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMaxMakeTime OBJECT-TYPE SYNTAX Unsigned32 (20..200) UNITS \"Milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \" This is the maximum make pulse width for the dial pulse.",
      "zh-CHS": "pktcSigEndPntConfigPulseDialMaxMakeTime对象类型语法Unsigned32（20..200）单位“毫秒”最大访问只读状态当前描述“这是拨号脉冲的最大生成脉冲宽度。"
    },
    {
      "indent": 4,
      "text": "      The value of pktcSigEndPntConfigPulseDialMaxMakeTime MUST\n      be greater than pktcSigEndPntConfigPulseDialMinMakeTime.\n      This object MUST only be provided via the configuration\n      file during the provisioning process.\n      Furthermore, given the possibility for the 'pulse dial'\n      and 'hook flash' to overlap, the value of this object MUST\n      be less than the value contained by the MIB object\n      pktcSigEndPntConfigMinHookFlash.\"\nDEFVAL { 55 }\n::= { pktcSigEndPntConfigEntry 36 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMinBreakTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..200)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the minimum break pulse width for the dial pulse.\n          The value of pktcSigEndPntConfigPulseDialMinBreakTime MUST\n          be less than pktcSigEndPntConfigPulseDialMaxBreakTime.\n          This object must only be provided via the configuration\n          file during the provisioning process.\"\n    DEFVAL { 45 }\n    ::= { pktcSigEndPntConfigEntry 37 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMaxBreakTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..200)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the maximum break pulse width for the dial pulse.\n          The value of pktcSigEndPntConfigPulseDialMaxBreakTime MUST\n          be greater than pktcSigEndPntConfigPulseDialMinBreakTime.\n          This object MUST only be provided via the configuration\n          file during the provisioning process.\"\n    DEFVAL { 75 }\n    ::= { pktcSigEndPntConfigEntry 38 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--\n-- notification group is for future extension.\n--\npktcSigNotification  OBJECT IDENTIFIER ::= { pktcIetfSigMib 0 }\npktcSigConformance   OBJECT IDENTIFIER ::= { pktcIetfSigMib 2 }\npktcSigCompliances   OBJECT IDENTIFIER ::= { pktcSigConformance 1 }\npktcSigGroups        OBJECT IDENTIFIER ::= { pktcSigConformance 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "--",
      "zh-CHS": "--"
    },
    {
      "indent": 0,
      "text": "-- compliance statements --",
      "zh-CHS": "--合规声明--"
    },
    {
      "indent": 0,
      "text": "pktcSigBasicCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \" The compliance statement for MTAs that implement NCS signaling.\"",
      "zh-CHS": "pktcSigBasicCompliance MODULE-COMPLIANCE STATUS当前描述“实施NCS信令的MTA的符合性声明”"
    },
    {
      "indent": 0,
      "text": "MODULE -- pktcIetfSigMib",
      "zh-CHS": "模块——pktcIetfSigMib"
    },
    {
      "indent": 0,
      "text": "---\n-- Unconditionally mandatory groups for all MTAs\n---",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "MANDATORY-GROUPS {\n    pktcSigDeviceGroup,\n    pktcSigEndpointGroup\n}\n---\n-- Conditionally mandatory groups for MTAs\n---",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "GROUP pktcInternationalGroup DESCRIPTION \" This group is mandatory only for MTAs implementing international telephony features.\"",
      "zh-CHS": "GROUP pktcInternationalGroup DESCRIPTION“此组仅对实现国际电话功能的MTA是必需的。”"
    },
    {
      "indent": 0,
      "text": "GROUP pktcLLinePackageGroup DESCRIPTION \" This group is mandatory only for MTAs implementing the L line package.\"",
      "zh-CHS": "组pktcLLinePackageGroup DESCRIPTION“此组仅对实现L行包的MTA是必需的。”"
    },
    {
      "indent": 0,
      "text": "GROUP pktcELinePackageGroup\n    DESCRIPTION\n        \" This group is mandatory only for MTAs implementing the E\n          Line Package.\"\n    ::={ pktcSigCompliances 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigDeviceGroup OBJECT-GROUP OBJECTS { pktcSigDevCodecMax, pktcSigDevEchoCancellation, pktcSigDevSilenceSuppression, pktcSigDevR0Cadence, pktcSigDevR1Cadence, pktcSigDevR2Cadence, pktcSigDevR3Cadence,",
      "zh-CHS": "PKTCSIGDEVERCEGROUP对象组对象{pktcSigDevCodecMax，PKTCSIGDEVCENCALATION，PKTCSIGDEVILENCESUPPORATION，pktcSigDevR0Cadence，pktcSigDevR1Cadence，pktcSigDevR2Cadence，pktcSigDevR3Cadence，"
    },
    {
      "indent": 4,
      "text": "pktcSigDevR4Cadence,\npktcSigDevR5Cadence,\npktcSigDevR6Cadence,\npktcSigDevR7Cadence,\npktcSigDevRgCadence,\npktcSigDevRsCadence,\npktcSigDefCallSigDscp,\npktcSigDefMediaStreamDscp,\npktcSigDevVmwiMode,\npktcSigCapabilityType,\npktcSigCapabilityVersion,\npktcSigCapabilityVendorExt,\npktcSigDefNcsReceiveUdpPort\n}\nSTATUS current\nDESCRIPTION\n      \"Group of MIB objects containing signaling configuration\n       information that is applicable per-device.\"\n::= { pktcSigGroups 1 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcSigEndpointGroup OBJECT-GROUP OBJECTS { pktcSigEndPntConfigCallAgentId, pktcSigEndPntConfigCallAgentUdpPort, pktcSigEndPntConfigPartialDialTO, pktcSigEndPntConfigCriticalDialTO, pktcSigEndPntConfigBusyToneTO, pktcSigEndPntConfigDialToneTO, pktcSigEndPntConfigMessageWaitingTO, pktcSigEndPntConfigOffHookWarnToneTO, pktcSigEndPntConfigRingingTO, pktcSigEndPntConfigRingBackTO, pktcSigEndPntConfigReorderToneTO, pktcSigEndPntConfigStutterDialToneTO, pktcSigEndPntConfigTSMax, pktcSigEndPntConfigMax1, pktcSigEndPntConfigMax2, pktcSigEndPntConfigMax1QEnable, pktcSigEndPntConfigMax2QEnable, pktcSigEndPntConfigMWD, pktcSigEndPntConfigTdinit, pktcSigEndPntConfigTdmin, pktcSigEndPntConfigTdmax, pktcSigEndPntConfigRtoMax, pktcSigEndPntConfigRtoInit, pktcSigEndPntConfigLongDurationKeepAlive, pktcSigEndPntConfigThist, pktcSigEndPntConfigStatus,",
      "zh-CHS": "pktcSigEndpointGroup对象组对象{pktcSigEndPntConfigCallAgentId，PKTCSIGENDPNTCONFIGCALAGENTUDPPORT，PKTCSIGENDPNTCONFIGPARTIALTO，pktcSigEndPntConfigCriticalDialTO，PKTCSIGENDPNTCONFIGCBUSYTONETO，PKTCSIGENDPNTCONFIGCHANGMESSAGENTTO，PKTCSIGENDPNTCONFIGGOUNGWARNTOTO，PKTCSIGENDPNTCONFINGTCHONGTO，PKTCSIGENDPNTCONFINGGBANDGBANTPntConfigReorderToneTO、PKTCSIGENDPNTConfigStateTo、PKTCSIGENDPNTConfigTmax、pktcSigEndPntConfigMax1、pktcSigEndPntConfigMax2、pktcSigEndPntConfigMax1QEnable、pktcSigEndPntConfigMax2QEnable、pktcSigEndPntConfigTdinit、pktcSigEndPntConfigTdmin、PKTCSIGENDPNTConfigTmax、PKTCSIGENDPNTConfigTmaxgRtoInit、pktcSigEndPntConfigLongDurationKeepAlive、pktcSigEndPntConfigThist、pktcSigEndPntConfigStatus、，"
    },
    {
      "indent": 4,
      "text": "pktcSigEndPntConfigCallWaitingMaxRep,\npktcSigEndPntConfigCallWaitingDelay,\npktcSigEndPntStatusCallIpAddressType,\npktcSigEndPntStatusCallIpAddress,\npktcSigEndPntStatusError\n}\nSTATUS current\nDESCRIPTION\n      \"Group of MIB objects containing signaling configuration\n       information that is applicable per-endpoint.\"\n::= { pktcSigGroups 2 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcInternationalGroup OBJECT-GROUP OBJECTS { pktcSigEndPntConfigMinHookFlash, pktcSigEndPntConfigMaxHookFlash, pktcSigEndPntConfigPulseDialInterdigitTime, pktcSigEndPntConfigPulseDialMinMakeTime, pktcSigEndPntConfigPulseDialMaxMakeTime, pktcSigEndPntConfigPulseDialMinBreakTime, pktcSigEndPntConfigPulseDialMaxBreakTime, pktcSigDevRingCadence, pktcSigDevCidSigProtocol, pktcSigDevCidDelayAfterLR, pktcSigDevCidDtmfStartCode, pktcSigDevCidDtmfEndCode, pktcSigDevVmwiSigProtocol, pktcSigDevVmwiDelayAfterLR, pktcSigDevVmwiDtmfStartCode, pktcSigDevVmwiDtmfEndCode, pktcSigDevrpAsDtsDuration, pktcSigDevCidMode, pktcSigDevCidAfterRing, pktcSigDevCidAfterDTAS, pktcSigDevCidAfterRPAS, pktcSigDevRingAfterCID, pktcSigDevCidDTASAfterLR, pktcSigDevVmwiMode, pktcSigDevVmwiAfterDTAS, pktcSigDevVmwiAfterRPAS, pktcSigDevVmwiDTASAfterLR, pktcSigPowerRingFrequency, pktcSigPulseSignalFrequency, pktcSigPulseSignalDbLevel, pktcSigPulseSignalDuration, pktcSigPulseSignalPulseInterval, pktcSigPulseSignalRepeatCount, pktcSigDevToneDbLevel,",
      "zh-CHS": "pktcInternationalGroup对象组对象{PKTCSIGENDPNTConfigminokFlash，pktcSigEndPntConfigMaxHookFlash，pktcSigEndPntConfigPulseDialInterdigitTime，PKTCSIGENDPNTConfigpulsedialmainmaitime，pktcSigEndPntConfigPulseDialMinBreakTime，pktcSigEndPntConfigPulseDialMaxBreakTime，PKTCSIGENDPNTConfigpulsedialmaincadence，PKTCSIGDevcidProtocol，PKTCSIGDevcidDelayafterrLR，pktcSigDevCidDtmfStartCode，pktcSigDevCidDtmfEndCode，PKTCSIGDEVVISIGPROTOCOL，PKTCSIGDEVIDMWIDELAYAFTERLR，PKTCSIGDEVIDTMSTARTCODE，PKTCSIGDEVIDTMFENDCODE，PKTCSIGDEVCIDDETER模式，PKTCSIGDEVCIDAAFTERRING，PKTCSIGDEVCIDAAFTERPAS，PKTCSIGDEVRINGAFTERPASmwiMode、PKTCSIGDEVHMWIAFTERDTAS、PKTCSIGDEVWIAFTERPAS、PKTCSIGDEVIDTSAFTERLR、PKTCSIGNPOWERRING频率、PKTCSIGNPULSE信号频率、PKTCSIGNPULSE信号电平、PKTCSIGNPULSE信号持续时间、PKTCSIGNPULSE信号脉冲间隔、PKTCSIGNPULSE信号重复计数、PKTCSIGNDEVTONEDB电平、，"
    },
    {
      "indent": 4,
      "text": "pktcSigDevToneFreqCounter,\npktcSigDevToneWholeToneRepeatCount,\npktcSigDevToneSteady,\npktcSigDevToneFirstFreqValue,\npktcSigDevToneSecondFreqValue,\npktcSigDevToneThirdFreqValue,\npktcSigDevToneFourthFreqValue,\npktcSigDevToneFreqMode,\npktcSigDevToneFreqAmpModePrtg,\npktcSigDevToneFreqOnDuration,\npktcSigDevToneFreqOffDuration,\npktcSigDevToneFreqRepeatCount\n}\nSTATUS current\nDESCRIPTION\n    \" Group of objects that extend the behavior of existing\n      objects to support operations in the widest possible set\n      of international marketplaces.  Note that many of these\n      objects represent a superset of behaviors described in\n      other objects within this MIB module.\"\n::= { pktcSigGroups 3 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcLLinePackageGroup  OBJECT-GROUP\n    OBJECTS {\n    pktcSigDevR0Cadence,\n    pktcSigDevR1Cadence,\n    pktcSigDevR2Cadence,\n    pktcSigDevR3Cadence,\n    pktcSigDevR4Cadence,\n    pktcSigDevR5Cadence,\n    pktcSigDevR6Cadence,\n    pktcSigDevR7Cadence,\n    pktcSigDevRgCadence,\n    pktcSigDevRsCadence\n    }\n    STATUS current\n    DESCRIPTION\n    \"Group of Objects to support the L line package.\"\n    ::= { pktcSigGroups 4 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "pktcELinePackageGroup OBJECT-GROUP OBJECTS { pktcSigDevR0Cadence, pktcSigDevR1Cadence, pktcSigDevR2Cadence, pktcSigDevR3Cadence, pktcSigDevR4Cadence, pktcSigDevR5Cadence,",
      "zh-CHS": "pktcELinePackageGroup对象组对象{pktcSigDevR0Cadence，pktcSigDevR1Cadence，pktcSigDevR2Cadence，pktcSigDevR3Cadence，pktcSigDevR4Cadence，pktcSigDevR5Cadence，"
    },
    {
      "indent": 4,
      "text": "pktcSigDevR6Cadence,\npktcSigDevR7Cadence,\npktcSigDevRgCadence,\npktcSigDevRsCadence,\npktcSigPulseSignalFrequency,\npktcSigPulseSignalDbLevel,\npktcSigPulseSignalDuration,\npktcSigPulseSignalPulseInterval,\npktcSigPulseSignalRepeatCount,\npktcSigDevRingCadence\n}\nSTATUS current\nDESCRIPTION\n    \"Group of Objects to support the E line package.\"\n::= { pktcSigGroups 5 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "END",
      "zh-CHS": "终止"
    },
    {
      "indent": 0,
      "text": "6. Examples",
      "section_title": true,
      "zh-CHS": "6. 例子"
    },
    {
      "indent": 3,
      "text": "This section provides a couple of examples, specifically related to the MIB tables pktcSigDevToneTable and pktcSigDevMultiFreqToneTable.",
      "zh-CHS": "本节提供了两个示例，具体涉及MIB表pktcSigDevToneTable和PKTCSIGDEVMULTIFREKTONETABLE。"
    },
    {
      "indent": 3,
      "text": "Example A: Call Waiting Tone Defined per [ITU-T E.180]:",
      "zh-CHS": "示例A：根据[ITU-T E.180]定义的呼叫等待音："
    },
    {
      "indent": 3,
      "text": "1) 400 Hz AM modulated by 16 Hz, on for 500ms at -4 dBm 2) 400 Hz AM modulated by 16 Hz, off for 400ms 3) 400 Hz not AM modulated, on for 50 ms at -4 dBm 4) 400 Hz not AM modulated, off for 450 ms 5) 400 Hz not AM modulated, on for 50 ms at -4 dBm 6) 400 Hz not AM modulated, off for 3450 ms 7) 400 Hz not AM modulated, on for 50 ms at -4 dBm 8) 400 Hz not AM modulated, off for 450 ms 9) 400 Hz not AM modulated, on for 50 ms at -4 dBm 10) 400 Hz not AM modulated, off for 3450 ms 11) not repeated, not continuous",
      "zh-CHS": "1) 400赫兹调幅由16赫兹调制，在-4 dBm时打开500毫秒2）400赫兹调幅由16赫兹调制，关闭400毫秒3）400赫兹未调幅，在-4 dBm时打开50毫秒4）400赫兹未调幅，关闭450毫秒5）400赫兹未调幅，打开50毫秒-4 dBm 6）400赫兹未调幅，关闭3450毫秒7）400赫兹未调幅，在-4 dBm时打开50 ms 8）400 Hz未调幅，关闭450 ms 9）400 Hz未调幅，在-4 dBm时打开50 ms 10）400 Hz未调幅，关闭3450 ms 11）未重复，不连续"
    },
    {
      "indent": 3,
      "text": "Assume userDefined1(18) is assigned to this tone:",
      "zh-CHS": "假设userDefined1（18）被分配给此音调："
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable:\nToneType|F-1|F-2|F-3|F-4|F-Mode|ModePrtg|DbL|OnDur|OffDur|Rep-Count\n===================================================================\n18       400  16  0   0     1     90     -40  500   400      0\n18       400   0  0   0     2      0     -40   50   450      0\n18       400   0  0   0     2      0     -40   50  3450      0\n18       400   0  0   0     2      0     -40   50   450      0\n18       400   0  0   0     2      0     -40   50  3450      0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable:\nToneType|ToneFreqGroup|ToneFreqCounter|ToneRep-Count|Steady\n=============================================================\n18          1             5              0       false(2)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The single row of the pktcSigDevToneTable defines one multi-frequency group of five rows (ToneFreqCounter) defined in the pktcSigDevMultiFreqToneTable and instructs the MTA to play this group only once (non-repeatable as ToneRep-Count equals 0).",
      "zh-CHS": "pktcSigDevToneTable的单行定义了PKTCSIGDEVMULTIFREKTONETABLE中定义的一个五行多频组（ToneFreqCounter），并指示MTA仅播放该组一次（不可重复，因为ToneRep计数等于0）。"
    },
    {
      "indent": 3,
      "text": "Example B - Congestion Tone - congestion(17):",
      "zh-CHS": "示例B-拥塞音-拥塞（17）："
    },
    {
      "indent": 3,
      "text": "Note: This example of an embedded cadence is based on an operator variation.",
      "zh-CHS": "注：此嵌入式cadence示例基于运算符变化。"
    },
    {
      "indent": 3,
      "text": "1) 400Hz on for 400ms -10 dBm",
      "zh-CHS": "1) 400Hz开启，持续400ms-10 dBm"
    },
    {
      "indent": 3,
      "text": "2) 400Hz off for 350ms",
      "zh-CHS": "2) 400Hz关闭350毫秒"
    },
    {
      "indent": 3,
      "text": "3) 400Hz on for 225ms -4 dBm",
      "zh-CHS": "3) 225ms-4dBm时400Hz开启"
    },
    {
      "indent": 3,
      "text": "4) 400Hz off for 525ms",
      "zh-CHS": "4) 400Hz关闭525ms"
    },
    {
      "indent": 3,
      "text": "5) repeat (1) through (4) 5000 times or T0 time out (whichever is the shortest period)",
      "zh-CHS": "5) 重复（1）至（4）5000次或T0超时（以最短时间为准）"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable:\nToneType|F-1|F-2|F-3|F-4|F-Mode|ModePrtg|DbL|OnDur|OffDur|Rep-Count\n===================================================================\n17       400  0   0   0    2       0    -100  400   350      0\n17       400  0   0   0    2       0     -40  225   525      0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable:\nToneType|ToneFreqGroup|ToneFreqCounter|ToneRep-Count|Steady\n=============================================================\n17          1             2              5000        false(2)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Example C - Call Waiting Tone - callWaiting1(9):",
      "zh-CHS": "示例C-呼叫等待音-呼叫等待1（9）："
    },
    {
      "indent": 3,
      "text": "1) 16 Hz is modulated to carry the 400 Hz signal, ModulationRate within 85%, on for 500msec, at -25 dBm or more but less than -14 dBm",
      "zh-CHS": "1) 16 Hz被调制以携带400 Hz信号，调制率在85%以内，以-25 dBm或更大但小于-14 dBm的速度开启500毫秒"
    },
    {
      "indent": 3,
      "text": "2) 16 Hz is modulated to carry the 400 Hz signal, off for 0 ~ 4 secs",
      "zh-CHS": "2) 调制16 Hz以携带400 Hz信号，关闭0~4秒"
    },
    {
      "indent": 3,
      "text": "3) 400 Hz not modulated, on for 50 ms at -25 dBm or more but less than -14 dBm",
      "zh-CHS": "3) 400 Hz未调制，在-25 dBm或更大但小于-14 dBm时开启50 ms"
    },
    {
      "indent": 3,
      "text": "4) 400 Hz not modulated, off for 450ms",
      "zh-CHS": "4) 400 Hz未调制，关闭450毫秒"
    },
    {
      "indent": 3,
      "text": "5) 400 Hz not modulated, on for 50 ms at -25 dBm or more but less than -14 dBm",
      "zh-CHS": "5) 400 Hz未调制，在-25 dBm或更大但小于-14 dBm时开启50 ms"
    },
    {
      "indent": 3,
      "text": "6) 400 Hz not modulated, off for 3450ms ([4000 - (50+450+50)])",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "7) Steps 3 thru 6 are repeated",
      "zh-CHS": "7) 重复步骤3至6"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable:\nToneType|F-1|F-2|F-3|F-4|F-Mode|ModePrtg|DbL|OnDur|OffDur|Rep-Count\n===================================================================\n9        1   400 16  0   0     1     85     -25  500  1000      0\n9        2   400  0  0   0     2      0     -25   50   450      0\n9        3   400  0  0   0     2      0     -25   50  3450      0",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable:\nToneType|ToneFreqGroup|ToneFreqCounter|ToneRep-Count|Steady\n=============================================================\n9           1             1              0       false(2)\n9           2             2              1       false(2)",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "The first row of the pktcSigDevToneTable table instructs the MTA to play one row (ToneFreqCounter) of the pktcSigDevMultiFreqToneTable table only once (non-repeatable as ToneRep-Count equals 0). The second row of the pktcSigDevToneTable table instructs the MTA to play the next two rows (ToneFreqCounter) of the pktcSigDevMultiFreqToneTable table and make this frequency group repeatable (ToneRep-Count is not 0).",
      "zh-CHS": "pktcSigDevToneTable表格的第一行指示MTA仅播放PKTCSIGDEVMULTIFREKTONETABLE表格的一行（ToneFreqCounter）（不可重复，因为ToneRep计数等于0）。pktcSigDevToneTable表格的第二行指示MTA播放PKTCSIGDEVMULTITONETABLE表格的下两行（TONEREQCOUNTER），并使该频率组可重复（ToneRep计数不为0）。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "zh-CHS": "7. 致谢"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the members of the IETF IPCDN working group and the CableLabs PacketCable Provisioning focus team for their contributions, comments, and suggestions.",
      "zh-CHS": "作者要感谢IETF IPCDN工作组和CableLabs PacketCable Provisioning focus团队成员的贡献、评论和建议。"
    },
    {
      "indent": 3,
      "text": "Specifically, the following individuals are recognized:",
      "zh-CHS": "具体而言，以下个人是公认的："
    },
    {
      "indent": 7,
      "text": "Angela Lyda Arris Interactive Romascanu, Dan Avaya Chad Griffiths Broadcom Corp. Eugene Nechamkin Broadcom Corp. Jean-Francois Mule CableLabs Matt A. Osman CableLabs Klaus Hermanns Cisco Systems, Inc. Rich Woundy Comcast Corp. Bert Wijnen Alcatel-Lucent Randy Presuhn Mindspring Phillip Freyman Motorola, Inc. Rick Vetter Motorola, Inc. Sasha Medvinsky Motorola, Inc. Wim De Ketelaere tComLabs David De Reu tComLabs Kristof Sercu tComLabs Roy Spitzer Telogy Networks, Inc. Itay Sherman Texas Instruments, Inc. Mauricio Sanchez Texas Instruments, Inc. Shivakumar Thangapandi Texas Instruments, Inc. Mike Heard Consultant",
      "zh-CHS": "Angela Lyda Arris Interactive Romascanu，Dan Avaya Chad Griffiths Broadcom Corp.Eugene Nechamkin Broadcom Corp.Jean-Francois Mule CableLabs Matt A.Osman CableLabs Klaus Hermanns Cisco Systems，Inc.Rich Woundy Comcast Corp.Bert Wijnen Alcatel Lucent Randy Presuhn Mindspring Phillip Freyman Motorola，Inc.Rick Vetter Motorola，萨沙·梅德文斯基公司摩托罗拉公司Wim De Ketelaere tComLabs David De Reu tComLabs Kristof Sercu tComLabs Roy Spitzer Telogy Networks，Inc.Itay Sherman Texas Instruments，Inc.莫里西奥·桑切斯德州仪器公司Shivakumar Thangapandi Texas Instruments，Inc.迈克·赫德顾问"
    },
    {
      "indent": 3,
      "text": "The current editor (Sumanth Channabasappa) would like to recognize Phillip Freyman and Eugene Nechamkin for their contributions towards the international objects, and Stephane Bortzmeyer for assistance with the ABNF.",
      "zh-CHS": "现任编辑（Sumanth Channabasappa）希望表彰菲利普·弗雷曼和尤金·内查姆金对国际目标的贡献，以及斯蒂芬·博尔茨迈耶对ABNF的帮助。"
    },
    {
      "indent": 3,
      "text": "The editor also extends appreciation to the IPCDN co-chairs (Jean-Francois Mule, Rich Woundy) and Dan Romascanu for the numerous reviews and valuable comments. Special appreciation is extended to Bert Wijnen, as the MIB doctor, for his ever-useful and constructive comments.",
      "zh-CHS": "编辑还感谢IPCDN联合主席（Jean-Francois Mule，Rich Woundy）和Dan Romascanu的众多评论和宝贵意见。特别感谢作为MIB医生的Bert Wijnen，他一直以来的有用和建设性的评论。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "zh-CHS": "8. 安全考虑"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "zh-CHS": "此MIB模块中定义了许多管理对象，其MAX-ACCESS子句为read-write和/或read-create。在某些网络环境中，此类对象可能被视为敏感或易受攻击。在没有适当保护的非安全环境中支持SET操作可能会对网络操作产生负面影响。"
    },
    {
      "indent": 3,
      "text": "The following Differentiated Services Code Point (DSCP) and mask objects are used to differentiate between various types of traffic in the service provider network:",
      "zh-CHS": "以下区分服务代码点（DSCP）和掩码对象用于区分服务提供商网络中的各种类型的流量："
    },
    {
      "indent": 8,
      "text": "pktcSigDefCallSigDscp pktcSigDefMediaStreamDscp",
      "zh-CHS": "pktcSigDefCallSigDscp pktcSigDefMediaStreamDscp"
    },
    {
      "indent": 3,
      "text": "These objects may contain information that may be sensitive from a business perspective. For example, they may represent a customer's service contract that a service provider chooses to apply to a customer's ingress or egress traffic. If these objects are SET maliciously, it may permit unmarked or inappropriately marked signaling and media traffic to enter the service provider network, resulting in unauthorized levels of service for customers.",
      "zh-CHS": "从业务角度来看，这些对象可能包含敏感信息。例如，它们可以表示服务提供商选择应用于客户的进出流量的客户服务合同。如果恶意设置这些对象，可能会允许未标记或不适当标记的信令和媒体流量进入服务提供商网络，从而导致未经授权的客户服务级别。"
    },
    {
      "indent": 3,
      "text": "The following objects determine ring cadence, repeatable characteristics, signal duration, and caller id subscriber line protocol for telephony operation:",
      "zh-CHS": "以下对象确定电话操作的铃声节拍、可重复特性、信号持续时间和呼叫者id用户线协议："
    },
    {
      "indent": 8,
      "text": "pktcSigDevR0Cadence pktcSigDevR1Cadence pktcSigDevR2Cadence pktcSigDevR3Cadence pktcSigDevR4Cadence pktcSigDevR5Cadence pktcSigDevR6Cadence pktcSigDevR7Cadence pktcSigDevRgCadence pktcSigDevRsCadence pktcSigDevCidSigProtocol pktcSigDevVmwiSigProtocol pktcSigPulseSignalDuration pktcSigPulseSignalPauseDuration",
      "zh-CHS": "PKTCSIGDEVR 0密码PKTCSIGDEVR 1密码PKTCSIGDEVR 2密码PKTCSIGDEVR 3密码PKTCSIGDEVR 4密码PKTCSIGDEVR 5密码PKTCSIGDEVR 6步频PKTCSIGDEVR 7步频PKTCSIGDEVR密码PKTCSIGDEVC密码协议PKTCSIGDEV协议PKTCSIGMWISIGPROTOCOL PKTCSIGDEVR信号持续PKTCSIGDEVR信号传导"
    },
    {
      "indent": 3,
      "text": "If these objects are SET maliciously, it may result in unwanted operation, or a failure to obtain telephony service from client (MTA) devices.",
      "zh-CHS": "如果恶意设置这些对象，可能会导致不必要的操作，或无法从客户端（MTA）设备获取电话服务。"
    },
    {
      "indent": 3,
      "text": "The objects in the pktcSigEndPntConfigTable are used for endpoint signaling. The pktcSigEndPntConfigCallAgentId object contains the name of the call agent, which includes the call agent Fully Qualified Domain Name (FQDN). If this object is SET maliciously, the MTA will not be able to communicate with the call agent, resulting in a disruption of telephony service. The pktcSigEndPntConfigCallAgentUdpPort object identifies the UDP port for NCS traffic. If this object is SET maliciously, the call agent will not receive NCS traffic from the MTA, also resulting in a disruption of telephony service.",
      "zh-CHS": "pktcSigEndPntConfigTable中的对象用于端点信令。pktcSigEndPntConfigCallAgentId对象包含调用代理的名称，其中包括调用代理完全限定域名（FQDN）。如果恶意设置此对象，MTA将无法与呼叫代理通信，从而导致电话服务中断。pktcSigEndPntConfigCallAgentUdpPort对象标识NCS流量的UDP端口。如果恶意设置此对象，呼叫代理将不会从MTA接收NCS流量，也会导致电话服务中断。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. The most sensitive is pktcSigEndPntStatusCallIpAddress within pktcSigEndPntConfigTable. This information itself may be valuable to would-be attackers. Other MIB Objects of similar sensitivity include pktcSigEndPntStatusError, which can provide useful information to MTA impersonators, and pktcSigDevCodecMax, which can provide useful information for planning Denial of Service (DoS) attacks on MTAs.",
      "zh-CHS": "在某些网络环境中，此MIB模块中的某些可读对象（即具有MAX-ACCESS而非not ACCESS的对象）可能被视为敏感或易受攻击。因此，在通过SNMP通过网络发送这些对象时，控制甚至获取和/或通知对这些对象的访问，甚至可能加密这些对象的值，这一点非常重要。最敏感的是PKTCSIGENDPNTStatuscalipAddress（位于pktcSigEndPntConfigTable中）。这些信息本身可能对潜在攻击者很有价值。其他具有类似敏感性的MIB对象包括pktcSigEndPntStatusError，它可以为MTA模拟程序提供有用的信息，以及pktcSigDevCodecMax，它可以为规划对MTA的拒绝服务（DoS）攻击提供有用的信息。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "zh-CHS": "SNMPv3之前的SNMP版本未包含足够的安全性。即使网络本身是安全的（例如通过使用IPsec），即使如此，也无法控制安全网络上的谁可以访问和获取/设置（读取/更改/创建/删除）此MIB模块中的对象。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "zh-CHS": "建议实施者考虑SNMPv3框架所提供的安全特性（参见[RCFC310]，第8节），包括对SNMPv3加密机制的完全支持（用于身份验证和隐私）。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "zh-CHS": "此外，不建议部署SNMPv3之前的SNMP版本。相反，建议部署SNMPv3并启用加密安全性。然后，客户/运营商应负责确保授予访问此MIB模块实例权限的SNMP实体已正确配置为仅授予那些拥有确实获取或设置（更改/创建/删除）对象的合法权限的主体（用户）访问对象。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "zh-CHS": "9. IANA考虑"
    },
    {
      "indent": 3,
      "text": "The MIB module in this document uses the following IANA-assigned OBJECT IDENTIFIER value recorded in the SMI Numbers registry:",
      "zh-CHS": "本文档中的MIB模块使用SMI编号注册表中记录的以下IANA分配对象标识符值："
    },
    {
      "indent": 3,
      "text": "Descriptor     OBJECT IDENTIFIER Value\n----------     -----------------------\npktcIetfSigMib     { mib-2 169 }",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "zh-CHS": "10. 工具书类"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "zh-CHS": "10.1. 规范性引用文件"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-MIB-SIG-1.0]\n               PacketCable(TM) 1.0 Signaling MIB Specification,\n               Issued, PKT-SP-MIB-SIG-I09-050812, August 2005.\n               http://www.packetcable.com/specifications/\n               http://www.cablelabs.com/specifications/archives",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[PKT-SP-MIB-SIG-1.5]\n               PacketCable(TM) 1.5 Signaling MIB Specification,\n               Issued, PKT-SP-MIB-SIG1.5-I01-050128, January 2005.\n               http://www.packetcable.com/specifications/\n               http://www.cablelabs.com/specifications/archives",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[PKT-SP-SEC]   PacketCable Security Specification, Issued, PKT-SP-\n               SEC-I12-050812, August 2005.\n               http://www.packetcable.com/specifications/\n               http://www.cablelabs.com/specifications/archives",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "[ITU-T-J169] IPCablecom Network Call Signaling (NCS) MIB requirements, J.169, ITU-T, March, 2001.",
      "zh-CHS": "[ITU-T-J169]IPCablecom网络呼叫信令（NCS）MIB要求，J.169，ITU-T，2001年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "zh-CHS": "[RFC2119]Bradner，S.，“RFC中用于表示需求水平的关键词”，BCP 14，RFC 2119，1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "zh-CHS": "[RFC2578]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“管理信息的结构版本2（SMIv2）”，STD 58，RFC 2578，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "zh-CHS": "[RFC2579]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的文本约定”，STD 58，RFC 2579，1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "zh-CHS": "[RFC2580]McCloghrie，K.，Perkins，D.，和J.Schoenwaeld，“SMIv2的一致性声明”，STD 58，RFC 25801999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3289] Baker, F., Chan, K., and A. Smith, \"Management Information Base for the Differentiated Services Architecture\", RFC 3289, May 2002.",
      "zh-CHS": "[RFC3289]Baker，F.，Chan，K.和A.Smith，“差异化服务体系结构的管理信息库”，RFC 3289，2002年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., and J. Schoenwaelder, \"Textual Conventions for Internet Network Addresses\", RFC 4001, February 2005.",
      "zh-CHS": "[RFC4001]Daniele，M.，Haberman，B.，Routhier，S.，和J.Schoenwaeld，“互联网网络地址的文本约定”，RFC 4001，2005年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "zh-CHS": "[RFC3411]Harrington，D.，Presohn，R.，和B.Wijnen，“描述简单网络管理协议（SNMP）管理框架的体系结构”，STD 62，RFC 3411，2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "zh-CHS": "[RFC2863]McCloghrie，K.和F.Kastenholz，“接口组MIB”，RFC 28632000年6月。"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-CODEC] PacketCable Audio/Video Codecs Specification PKT-SP-CODEC-IO5-040113.",
      "zh-CHS": "[PKT-SP-CODEC]打包电缆音频/视频编解码器规范PKT-SP-CODEC-IO5-040113。"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-MGCP] PacketCable Network-Based Call Signaling Protocol Specification PKT-SP-EC-MGCP-I10-040402.",
      "zh-CHS": "[PKT-SP-MGCP]基于分组电缆网络的呼叫信令协议规范PKT-SP-EC-MGCP-I10-040402。"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-PROV] PacketCable MTA Device Provisioning Specification PKT-SP-PROV-I10-040730.",
      "zh-CHS": "[PKT-SP-PROV]打包电缆MTA设备供应规范PKT-SP-PROV-I10-040730。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "zh-CHS": "10.2. 资料性引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "zh-CHS": "[RFC3410]Case，J.，Mundy，R.，Partain，D.，和B.Stewart，“互联网标准管理框架的介绍和适用性声明”，RFC 34102002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3435] Andreasen, F. and B. Foster, \"Media Gateway Control Protocol (MGCP) Version 1.0\", RFC 3435, January 2003.",
      "zh-CHS": "[RFC3435]Andreasen，F.和B.Foster，“媒体网关控制协议（MGCP）1.0版”，RFC 3435，2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "zh-CHS": "[RFC5234]Crocker，D.，Ed.，和P.Overell，“语法规范的扩充BNF:ABNF”，STD 68，RFC 5234，2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4682] Nechamkin, E. and J-F. Mule, \"Multimedia Terminal Adapter (MTA) Management Information Base for PacketCable- and IPCablecom-Compliant Devices\", RFC 4682, December 2006.",
      "zh-CHS": "[RFC4682]Nechamkin，E.和J-F.Mule，“PacketCable和IPCablecom兼容设备的多媒体终端适配器（MTA）管理信息库”，RFC 4682，2006年12月。"
    },
    {
      "indent": 3,
      "text": "[ETSI-TS-101-909-4] ETSI TS 101 909-4:\"Access and Terminals (AT); Digital Broadband Cable Access to the Public Telecommunications Network; IP Multimedia Time Critical Services; Part 4: Network Call Signaling Protocol\".",
      "zh-CHS": "[ETSI-TS-101-909-4]ETSI TS 101 909-4:“接入和终端（AT）；公共电信网络的数字宽带电缆接入；IP多媒体时间关键业务；第4部分：网络呼叫信令协议”。"
    },
    {
      "indent": 3,
      "text": "[ETSI-TS-101-909-9] ETSI TS 101 909-9:\"Access and Terminals (AT); Digital Broadband Cable Access to the Public Telecommunications Network; IP Multimedia Time Critical Services; Part 9: IPCablecom Network Call Signalling (NCS) MIB Requirements\".",
      "zh-CHS": "[ETSI-TS-101-909-9]ETSI TS 101 909-9：“接入和终端（AT）；公共电信网络的数字宽带电缆接入；IP多媒体时间关键业务；第9部分：IPCablecom网络呼叫信令（NCS）MIB要求”。"
    },
    {
      "indent": 3,
      "text": "[ETSI-EN-300-001] ETSI EN 300-001 V1.5.1 (1998-10):\"European Standard (Telecommunications series) Attachments to Public Switched Telephone Network (PSTN); General technical requirements for equipment connected to an analogue subscriber interface in the PSTN; Chapter 3: Ringing signal characteristics (national deviations are in Table 3.1.1)\".",
      "zh-CHS": "[ETSI-EN-300-001]ETSI EN 300-001 V1.5.1（1998-10）：“公共交换电话网（PSTN）的欧洲标准（电信系列）附件；连接到PSTN中模拟用户接口的设备的一般技术要求；第3章：振铃信号特性（国家偏差见表3.1.1）”。"
    },
    {
      "indent": 3,
      "text": "[ETSI-EN-300-324-1] ETSI EN 300 324-1 V2.1.1 (2000-04):\"V Interfaces at the digital Loop Exchange (LE); V5.1 interface for the support of Access Network (AN); Part 1: V5.1 interface specification\".",
      "zh-CHS": "[ETSI-EN-300-324-1]ETSI EN 300 324-1 V2.1.1（2000-04）：“数字环路交换机（LE）处的V接口；支持接入网（AN）的V5.1接口；第1部分：V5.1接口规范”。"
    },
    {
      "indent": 3,
      "text": "[ETSI-EN-300-659-1] ETSI EN 300 659-1: \"Public Switched Telephone Network (PSTN); Subscriber line protocol over the local loop for display (and related) services; Part 1: On hook data transmission\".",
      "zh-CHS": "[ETSI-EN-300-659-1]ETSI EN 300 659-1:“公共交换电话网（PSTN）.显示（及相关）业务本地环路上的用户线协议.第1部分：挂机数据传输”。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-E.180] ITU-T E.180: \"Various Tones Used in National Networks, Supplement 2 to Recommendation E.180\".",
      "zh-CHS": "[ITU-T-E.180]ITU-T E.180：“国家网络中使用的各种音调，建议E.180的补充2”。"
    },
    {
      "indent": 3,
      "text": "[ETSI-TR-101-183] ETSI TR-101-183: \"Public Switched Telephone Network (PSTN) Analogue Ringing Signals\".",
      "zh-CHS": "[ETSI-TR-101-183]ETSI TR-101-183：“公共交换电话网（PSTN）模拟振铃信号”。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "zh-CHS": "作者地址"
    },
    {
      "indent": 3,
      "text": "Gordon Beacham Motorola, Inc. 6450 Sequence Drive, Bldg. 1 San Diego, CA 92121, USA",
      "zh-CHS": "Gordon Beacham Motorola，Inc.美国加利福尼亚州圣地亚哥1号楼6450 Sequence Drive 92121"
    },
    {
      "indent": 3,
      "text": "Phone: +1 858-404-2334\nEMail: gordon.beacham@motorola.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Satish Kumar Mudugere Eswaraiah Texas Instruments India (P) Ltd., Golf view, Wind Tunnel Road Murugesh Palya Bangalore 560 017, INDIA",
      "zh-CHS": "Satish Kumar Mudugere Eswaraiah Texas Instruments India（P）Ltd.，印度班加罗尔Murugesh Palya风洞路高尔夫景观560 017"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 5269451\nEMail: satish.kumar@ti.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 3,
      "text": "Sumanth Channabasappa Cable Television Laboratories, Inc. 858 Coal Creek Circle, Louisville, CO 80027, USA",
      "zh-CHS": "Sumanth Channabasapa有线电视实验室有限公司，地址：美国科罗拉多州路易斯维尔Coal Creek Circle 858号，邮编：80027"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303-661-3307\nEMail: Sumanth@cablelabs.com",
      "raw": true,
      "zh-CHS": " "
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "zh-CHS": "完整版权声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "zh-CHS": "版权所有（C）IETF信托基金（2008年）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "zh-CHS": "本文件受BCP 78中包含的权利、许可和限制的约束，除其中规定外，作者保留其所有权利。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "zh-CHS": "本文件及其包含的信息以“原样”为基础提供，贡献者、他/她所代表或赞助的组织（如有）、互联网协会、IETF信托基金和互联网工程任务组不承担任何明示或暗示的担保，包括但不限于任何保证，即使用本文中的信息不会侵犯任何权利，或对适销性或特定用途适用性的任何默示保证。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "zh-CHS": "知识产权"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "zh-CHS": "IETF对可能声称与本文件所述技术的实施或使用有关的任何知识产权或其他权利的有效性或范围，或此类权利下的任何许可可能或可能不可用的程度，不采取任何立场；它也不表示它已作出任何独立努力来确定任何此类权利。有关RFC文件中权利的程序信息，请参见BCP 78和BCP 79。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "zh-CHS": "向IETF秘书处披露的知识产权副本和任何许可证保证，或本规范实施者或用户试图获得使用此类专有权利的一般许可证或许可的结果，可从IETF在线知识产权存储库获取，网址为http://www.ietf.org/ipr."
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "zh-CHS": "IETF邀请任何相关方提请其注意任何版权、专利或专利申请，或其他可能涵盖实施本标准所需技术的专有权利。请将信息发送至IETF的IETF-ipr@ietf.org."
    }
  ]
}